{"newsArray":[{"article_id":"67553671564eb542a989014584e6be94","title":"Rangers-linked Scotland star’s season declared OVER after just two substitute appearances following £10m move","link":"https://www.thescottishsun.co.uk/sport/11697778/rangers-scotland-ross-stewart-southampton-sunderland/","keywords":["Championship","Football","Sport","Scottish Premiership"],"creator":["Stewart Fisher"],"video_url":null,"description":null,"content":"RANGERS have been heavily linked with Ross Stewart at various points of the former Ross County striker's journey. But the Ayrshire lad's career went in another direction - first when he moved to Sunderland , then when he clinched a £10m move to Southampton in the summer . 3 Ross Stewart's hopes of reaching Euro 2004 with Scotland have been dashed Credit: News Group Newspapers Ltd 3 Sunderland’s Ross Stewart has barely featured for Southampton Credit: Getty 3 Sunderland’s Ross Stewart bangs in a goal Credit: PA But the striker been limited to just TWO substitute appearances since earning his big move. And he's just learned that his season is now almost certainly OVER - as are his slim chance of joining clubmate Che Adams in Steve Clarke 's Scotland . That's because his hamstring injury has proved far more serious than first thought. Boss Russell Martin said in yesterday's press conference: “I think we need to be really honest about Ross and realistic, we probably won’t see him again this season. Read More Football Stories ON THE MOVE Celtic 'kick off January sales' as Hoops make PROFIT on star who played 1 match MEGA DEAL Celtic vs Livingston: Get £20 in free bets and £10 casino bonus with BoyleSports “I think if we say he’s not going to be here this season and if you do see him at some point, it’s a huge bonus.” Stewart has essentially missed 22 months of football out 24 - with 3 different injuries - and there's been mixed emotions from fans. Particularly from Sunderland fans who watched him bang in 40 goals in 80 games for them before jumping ship to a Championship rival. One fan wrote on X, formerly Twitter: \"Genuinely gutted for the bloke tbh. Most read in Championship KRIS BOYD Celtic just HAD to send an SOS to the Green Brigade - things have gotten that bad LAW AND ORDER Celtic lay down FOURTEEN rules to Green Brigade including ban on BALACLAVAS LOW BLOW SNP raid millions from sale of offshore wind plots in bid to plug huge budget gap ARREST IN PEACE Moment gypsy funeral mourners chased by cops with COFFIN on back of truck \"A fabulous centre forward before all this, and one who brought real joy to the club.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-12-23 12:57:40","image_url":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2023/12/ross-stewart-scotland-739177052.jpg?strip=all&w=748","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3198c24da9ad025753afbbf2e3d7bdee","title":"EA Sports FC 24 hits all-time low during Steam Winter Sale 2023","link":"https://thesportsrush.com/gaming-news-ea-sports-fc-24-hits-all-time-low-steam-winter-sale-2023/","keywords":["EA FC 24","Gaming","News","EA FC 24 cheap","ea sports","FC 24","Steam","Winter Sale 2023"],"creator":["Amlan Roy"],"video_url":null,"description":"EA Sports FC 24 is available at its lowest price on Steam during the Winter Sale 2023, making it a great time to purchase the game. In the two-week-long discount fest, the football game is available at a 60% reduced price under three months of its release. Now, users can buy the title for only… The post EA Sports FC 24 hits all-time low during Steam Winter Sale 2023 appeared first on The SportsRush.","content":"Advertisement EA FC 24 is 60% off for Christmas: Standard Edition (was $70, now $28): https://t.co/bc1PvfhAho Ultimate Edition (was, $100, now $40): https://t.co/TkQz2oC33z pic.twitter.com/Tq7qs8DfPe — EA FC 24 News (@FC24News) December 19, 2023 Advertisement What are you doing if this happens to you? Credit: u/GGlowy pic.twitter.com/lybbwsmEyP — EA FC 24 News (@FC24News) November 13, 2023 How will the Steam Winter Sale 2023 affect EA Sports FC 24’s player count? Advertisement Probably the best FC 24 goal I’ve ever seen Credit: u/NzuahVI pic.twitter.com/UGCIhhssCY — EA FC 24 News (@FC24News) November 3, 2023 Advertisement","pubDate":"2023-12-23 12:49:50","image_url":"https://cdn-wp.thesportsrush.com/2023/12/6f2a03c5-ea-fc-24-halland.jpg","source_id":"thesportsrush","source_priority":4166,"country":["australia","united states of america","united kingdom","india"],"category":["sports"],"language":"english"},{"article_id":"b78c2578691f15997395a2e5b4a3b6ab","title":"Darts sensation Luke Littler has day off from kebabs as he thanks legion of new fans","link":"https://www.dailystar.co.uk/sport/darts/luke-littler-kebab-world-championship-31739630","keywords":["Sport"],"creator":["staronline@reachplc.com (Dan Burnham)"],"video_url":null,"description":"Luke Littler took to social media to reflect on the craziest week of his young life at the World Darts Championship - and let his new fans know what he'd had for tea","content":"Luke Littler took a day off from the kebabs as he thanked his new fans for their Paddy Power World Championship support. The 16-year-old sensation has breezed into the third round on his Ally Pally debut, first seeing off Christian Kist before following up that over UK Open champion Andrew Gilding this week. Not being old enough to legally drink alcohol in his home country yet, Littler marked his progression differently to most - after both matches as a celebratory treat. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month But in the interests of his arteries the youngster switched it up on Friday (December 22). Taking to X, formerly Twitter, he wrote: \"Back home for Christmas. \"Thanks to everyone for messages I don’t think I can get round to say thanks to everyone there’s that many but I’ll try tomorrow. 10 thousand new followers last few days, 20 thousand new Instagram followers. Wishing you all a Merry .\" One of his followers then asked what he'd had for tea, with Littler replying: \"Chicken burger.\" The Nuke, as he's been dubbed, will return to face Canadian Matt Campbell after Christmas. The manner of his wins have stunned the darts world. He averaged 106.12 in a whitewash of Kist, higher than former world champion Gerwyn Price has ever managed on the same stage. And he only dropped one set to world No. 20 Gilding, showing little nerves against a vastly more experienced opponent. Guaranteeing himself at least £25,000 from the tournament, Littler bought his own kebab the second time around. \"My manager got that kebab so I'll get my own because I didn't really like it,\" he told Sky Sports. \"It's trending worldwide that kebab! But I think it's another kebab.\"","pubDate":"2023-12-23 12:47:07","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31723190.ece/ALTERNATES/s98/2_JS320058636.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"abb999b42e59186baf505ba076303dfc","title":"NFL picks: Are we looking at a Super Bowl preview Christmas Day between Ravens and 49ers?","link":"https://www.denverpost.com/2023/12/23/nfl-picks-week-16-football/","keywords":["Denver Broncos","Latest Headlines","NFL","Sports","Aaron Rodgers","Baker Mayfield","Case Keenum","Christian McCaffrey","Drew Lock","Gardner Minshew","Joe Flacco","Justin Herbert","Kyle Shanahan","More Broncos News","Patrick Mahomes","Russell Wilson","Tim Patrick","Trevor Lawrence"],"creator":["Parker Gabriel"],"video_url":null,"description":"NFL beat writer Parker Gabriel takes a look around the league heading into Week 16, including Baltimore at San Francisco.","content":"There are so many teams bunched up for playoff positioning, from three entering Sunday tied at 8-6 atop the AFC South to the seven teams entering the weekend with either seven or eight wins. At this point, it’s tough to know which way is up. But this will be a big weekend for clarity. Some way or another, at least a team or two rolling with a backup quarterback is going to make it to the postseason. Joe Flacco in Cleveland, Case Keenum in Houston, Jake Browning in Cincinnati, Gardner Minshew in Indianapolis. Then, can any of them win there? There’s a long way to go before the full scale of a potentially wild NFL coaching carousel is known this year. One thing’s for sure: There will be new brass for the Chargers, who are in the market for a coaching staff and a general manager. The conventional wisdom is that Justin Herbert’s presence makes L.A. the best job on the market, regardless of what else comes open. And, to be sure, coaches would all line up to work with him. But the rest of the picture is an aging, expensive roster with a pretty brutal salary cap picture going forward. So, is the tantalizing signal-caller enough to offset the rest? For somebody, obviously, it will be. But whether the Chargers are the pick of the coaching litter seems far from a certainty. And in the most shocking news of the NFL season, Aaron Rodgers is actually not returning from a torn Achilles tendon in three months. Who could have guessed? It does, of course, boggle the mind a bit to see Rodgers and others, too — including the Broncos’ Tim Patrick — rebound so quickly from Achilles tears thanks to new surgical procedures. That’s a good thing for athletes in the future. Speaking of good things and futures, what’s the likelihood that Rodgers’ full-throated endorsement of the Jets’ coaching apparatus looks wise a year from now? Dallas spent five weeks riding high, scoring 33-plus in five straight wins. Then Mike McCarthy’s team got thrown off the bull hard in a 31-10 beatdown at Buffalo on Sunday night. They’re going to get tested the next two weeks, too, against Miami and Detroit, before closing the season at Washington. They’ve locked up a playoff spot already. They’ll be talked about plenty in the coming weeks, but the only thing this group will be judged by ultimately is whether it can get the franchise past the divisional round of the playoffs for the first time since the 1995 season. No, really. Are the Birds in trouble? Philadelphia went from 10-1 to currently occupying a Wild Card spot thanks to a three-game skid started by San Francisco in the City of Brotherly Love and most recently extended by…. Drew Lock and his 92-yard touchdown drive! That’s a coast-to-coast skid, with Dallas right in the middle. Here’s the good news: There might not be a true cure for what ails the Eagles — defensive coordinator changes in December for teams with Super Bowl aspirations is not it, man — but there’s time for healing on the horizon. Philly closes with two against the Giants around a home game against Arizona. 13-4 here they come. Tough spot for Green Bay to be in this weekend. They’re clinging to slim playoff hopes after back-to-back dreadful defensive performances. Not only that, but beating Carolina this week only bolster’s arch-rival Chicago’s draft position, since the Bears have the Panthers’ first-round pick. Great work, Pack! You’ve just helped ensure you’ll be facing Caleb Williams twice a year. Funny enough, Chicago can help its own cause, too, by… losing to 3-11 Arizona. A Super Bowl preview? It wouldn’t be surprising at all at this point, given the way each team has rolled through the regular season. They do it in different ways, but both are complete teams that can scare you offensively and beat you up defensively. 49ers running back Christian McCaffrey has 1,801 offensive yards (1,292 rushing) and 20 touchdowns with three games to go this year. Seems pretty good. MVP good, come to think of it. He’ll be a key in Kyle Shanahan’s team getting it done as a 5.5-point home favorite. 49ers 27, Ravens 23 Antonio Pierce deserves a lot of credit for the work he’s done as the Raiders’ interim coach. Las Vegas has been a salty defense over the past few weeks and players seem to be committed to playing hard for him. But beating Patrick Mahomes and company would be a tall order. The Chiefs have their own issues, but they’re still in the hunt (albeit as major underdogs) for the No. 1 seed and they can wrap up a division title with either a Broncos loss Sunday or with a win as a 10-point home favorite on Christmas Day Chiefs 30, Raiders 13 Baker Mayfield and the Bucs put on an absolute clinic last week, torching Green Bay for 381 yards, four touchdowns and a perfect 158.3 passer rating at Lambeau Field. Hello. Mayfield’s had a pretty good year — his 3,315 yards, 24 TDs, eight INTs and 94.7 rating looks a little bit Russell Wilson-ish — and Tampa’s right in the mix for the mediocre-but-wide-open NFC South. Even still, Jacksonville needs the win just as much as it enters play in a three-way tie for the AFC South. As long as Trevor Lawrence plays to his normal standard after a concussion last week, the Jags should find a way to get the job done as a one-point road underdog across the Panhandle. Jaguars 24, Buccaneers 23","pubDate":"2023-12-23 12:45:27","image_url":"https://www.denverpost.com/wp-content/uploads/2023/11/AP23313047037165.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"054db47158e6019974d02258d78441b0","title":"Festivus 2023: The airing of grievances, sports edition","link":"https://www.denverpost.com/2023/12/23/festivus-airing-of-grievances-sports-edition-2023/","keywords":["Latest Headlines","Sports","AT&T SportsNet","Augusta National","baseball","Baseball Hall of Fame","basketball","Charlie Blackmon","college football","Coors Field","CU Buffs","Deion Sanders","Dick Monfort","golf","holidays","MLB All-Star Game","Shannon Sharpe","Todd Helton"],"creator":["Jeff Bailey"],"video_url":null,"description":"We will start by paying our respect to the classic TV show Seinfeld with my favorite tradition, the \"airing of grievances.\"","content":"Festivus is back! And with my aluminum pole, with a high strength-to-weight ratio, now pulled out of the crawl space we are ready for a tinsel-free Festivus miracle. Another year has come and gone in the sports world, memories were made, champions were crowned and over the past 12 months, my basket was filled with content for this year’s piece. We will start by paying our respect to the classic TV show Seinfeld with my favorite tradition, the “airing of grievances.” I have a lot of problems with teams, commissioners, fans, owners, players, rules and mascots. And now, you’re gonna hear about it. Here are all the ways the sports world has disappointed me over the past year: Is this really the best the Rockies could do in the mascot department? Time to make a trade my friends, I’ll take another pantless mascot in Clark from the Chicago Cubs all day. I thought Colorado letting Charlie Blackmon rob Monfort and Co. of was bad, but having Dinger on a contract that won’t end takes the cake. The 2023 class was filled with talent and real hall of famers. But again, the writers dropped the ball and left out some truly deserving players. It was nice to finally see the “Crime Dog” Fred McGriff get the call to Cooperstown. Still not sure why a guy with 493 homers and one of the most feared hitters of the 1990s had to wait for the Contemporary Baseball Era Players Committee to get in. Scott Rolen also got the call he was headed to Cooperstown, but I would argue he shouldn’t get in before other deserving guys. I mean, Rolen only had 316 home runs and 2077 hits. Whereas, Jeff Kent and Todd Helton were better players with stats on the back of their baseball cards to prove it. Kent finished with 2461 hits and 377 homers (most all-time for second base), and a .290 batting average. Helton tallied 2519 hits, 369 homer while hitting .316 for his career. Those are just a few stats to make my point. Sharpe got into a courtside yelling match at a Lakers game with Grizzlies’ Ja Morant. It is laughable how a grown man jumps onto the court and makes a huge scene that is all about him being a tough guy. Anyone else pulls that stunt sitting on the hardwood at an arena would have been ejected from the complex. All we got was a “I’ve preached for the last six and a half years responsibility and accountability, and I take full responsibility for what transpired,” Sharpe said. “I’m never gonna say that wasn’t Shannon Sharpe because that was me. That was just me getting out of character. And I’m sorry for all those who saw my actions and took offense to my actions.” Good lord, no emotional impulse control mixed with no common sense. Doesn't realize he should be absolutely embarrassed. This is similar to Juwan Howard slapping a coach and not realizing for a week he did anything wrong. A regular fan gets permanently banned for this behavior. — Jason Whitlock (@WhitlockJason) Have a feeling Manfred will be on this list yearly until his time in MLB is done. He keeps adding to the list with new rules that aren’t improving the game. The pitch clock and extra innings are at the top of my list. Baseball was never intended to be a timed clock sport, if that’s your jam head over to Dick’s Sporting Goods Park and watch the Rapids. Baseball is a classic game purists love. I enjoy the experience of going to the ballyard and not having anywhere to be. The other change was extra innings with the California tiebreaker rule when starting with a runner starting on second base. If you don’t want to play free baseball, win it in nine. Gone are the thrilling 15-inning games where a bench runs low the teams have to claw out a win. I’m an old-school guy and happy I worked in professional ball back when the game was played the right way. I miss throwing inside, sliding hard into bags/taking guys out and pitchers wanting to go 7-8 innings a start… none of this quality four innings junk. Yes, looking at your Kyle Freehand. Would love to hear a manager tell the likes of Gibson, Koufax, Palmer, Gooden, Hershiser, Clemens, Maddux and other greats to give us a solid five. And while you’re giving us that quality start, you can’t throw inside. Players today are soft. This is tough to hear… would not fly in the old days! Unfortunately this is how players are being taught with modern analytics…. What are y’all’s thoughts? — Roger Clemens (@rogerclemens) Golf Aurora and other courses that charge full-price green fees in winter months. I have heard it is because they don’t want to devalue the course. Well, I have news for those folks… it isn’t devaluing the course. A lot of high-end courses have seasonal rates. Golfers will agree, a dormant course in winter months shouldn’t be charging premium green fees. Will give a tip of the cap to the superintendents who work countless hours keeping a course in tip-top shape. With , it’s unsure who will broadcast Rockies games in 2024. The change may be a good thing in the end, as many fans feel the this area needed an overhaul. There are only so many Supermo references, or clinics a guy can give during a broadcast. Baseball fans are knowledgeable, and don’t need seven people contributing during a game in and around the booth. It would be a breath of fresh air for some new talent to take the reins in 2024. Player might be a three-time Masters champion, but that doesn’t give him the right to trash its members or course. about not being able to get tee times at Augusta National is one of the main reasons he isn’t invited more often. It could also have to do something with his son being for promoting golf balls during the opening tee shots in 2021… yes Player has won the Masters, but the traditions and way the club operates are what makes Augusta National a special place. I will give Player some advice, stop running your mouth about how . It’s not just another course, it is what we golfers consider hallowed grounds. We had this on the list last season, and it still rings true today. The only difference this year is agrees with us and thinks the 8 p.m. game times being bad for all involved. “Who makes these 8 o’clock games? Dumbest thing ever. Stupidest thing ever invented in life. Who wants to stay up until 8 o’clock for a darn game?” on his weekly radio show. “What about the East Coast — do they even care about ratings? Is anyone watching it? What are we supposed to do with the kids all day until 8 o’clock? What are we supposed to do in the hotel?” To all the media outlets and local journalists openly rooting over the top for Avs/Nuggets and Buffs on social media during the postseason runs must have forgotten that they are journalists who are supposed to be impartial and report the news. If you want to be a fan and pumped after the fact I’m all for it… to all my coworkers who are beat reporters, I applaud you for how you run your beats. Y’all are professionals and I’m happy to work with ya. Home run derby pitchers need to start throwing back at the bottom of the mound, go back to 10 outs and stop with the rapid-fire pitches. The biggest change had to do with the uniforms. The ASG needs to go back to having players wear team uniforms. It made the game special seeing players in the home and away unis… baseball has lost its way over the years. This one is for all the players who decide they are special and need to hit in the lesson area at the driving range. Those lesson grounds are for people who are paying a golf professional to give them a private lesson. And what comes with that is an area of more lush grounds to hit balls from. It’s one of the perks of paying for a private lesson at a course. So next time you decide to hit a bucket of balls from the lesson grounds, just know the golf gods are looking down upon you with shanks and slices coming your way during your next round of golf. Coors Field is Wrigley West when the Cubs come to town. Monfort should be ashamed of the culture the Rockies have created around 20th and Blake. Saying his team will be a .500 ball club, striving to be average and then losing 103 games. How do you lose 100-plus games and not fire anyone? But hey, at least when the Cubs come to town a packed house at Coors is a given. The oven mitts these guys are wearing are a laughable joke. Players from years past are laughing at these guys… they aren’t about player safety. They are about getting an extra six inches closer to sliding safe into bags. Mr. “I hate baseball” Manfred won’t do anything about it, but clubhouse attendants across baseball need to throw these things in the trash where they belong. All those California teams going to the ACC is pure comedy. Did those educated school presidents forget what the ACC stands for? I’ll give them the answer, Atlantic Coast Conference. Everyone knows NIL and the massive power conferences is all about football and broadcast money. Other sports are going to feel the pain here. I feel bad for the normal student-athlete who has to deal with the brutal travel schedule. Never thought I would see the day when players are staying in college longer and would rather go to class than make the jump to the professional ranks. Amazing what a few million dollars will make a student-athlete do. We aren’t done here folks, it will continue to blow up in NCAA’s faces in 2024. Big hits in football are not allowed anymore, even the legal ones. Football has become so soft, at the sight of a big hit the laundry starts flying. The league needs to get back to some form of football or it will all turn into a glorified flag football league. And if you are going to have the FFL, you might hire Manfred as your commissioner since he has a thing for destroying legacy and creating unnecessary rules. As Festivus rolls on, we come to the feats of strength. As we have no room currently in the newsroom for such wrestling activities, I’ll leave ya with something relaxing you can enjoy: The Butler Cabin Yule log from Augusta National. Vic Carapazza just informed the Reds dugout, it seems, that the second inning is not the time for the Cincy bullpen guys to go on an Eagle Scout adventure through the trees beyond CF. — Parker Gabriel (@ParkerJGabriel)","pubDate":"2023-12-23 12:45:10","image_url":"https://www.denverpost.com/wp-content/uploads/2016/12/festivus-pole.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"9542143a743d3a6c799eb2145d1fe2c3","title":"Mercato - PSG : 20M€ lâchés, la première recrue hivernale est annoncée","link":"https://le10sport.com/football/mercato/mercato-psg-20meur-laches-la-premiere-recrue-hivernale-est-annoncee-676791","keywords":null,"creator":null,"video_url":null,"description":"Alors que Presnel Kimpembe n’est finalement pas prêt de rejouer avec le PSG, le club de la capitale s’est mis en quête d’un renfort en défense centrale. Et finalement, Paris va trouver son bonheur du…","content":"Alors que Presnel Kimpembe n’est finalement pas prêt de rejouer avec le PSG, le club de la capitale s’est mis en quête d’un renfort en défense centrale. Et finalement, Paris va trouver son bonheur du côté du Brésil. Ces derniers jours, le dossier Lucas Beraldo avait été révélé. Et voilà que le transfert du Brésilien de Sao Paulo au PSG serait bouclé. Cet hiver, le PSG va prendre l’accent brésilien. Souhaitant apporter quelques retouches à l’effectif de Luis Enrique et répondre aux besoins de l’entraîneur espagnol, Luis Campos est parti piocher au Brésil. Alors que Gabriel Moscardo doit arriver de Corinthians, le premier à rejoindre le PSG devrait être Lucas Beraldo ( Sao Paulo ). Mercato - PSG : C’est terminé pour ce flop du projet QSI ? https://t.co/c3ECkqN5QE pic.twitter.com/qbejZfPazb Le mercato hivernal n’a pas encore officiellement ouvert ses portes, mais le PSG tiendrait déjà sa première recrue de janvier. En effet, ce samedi, Fabrizio Romano a sorti son traditionnel « Here we go » pour annoncer la venue du Brésilien à Paris. Un accord verbal aurait été trouvé entre les différentes parties et désormais, Sao Paulo et le PSG prépareraient les derniers documents pour boucler l’affaire à 100%. De son côté, Beraldo patiente dans l’attente de sa visite médicale. Le PSG va donc accueillir Lucas Beraldo dans les prochains jours. Pour cela, le club de la capitale a dû sortir le carnet de chèques pour parvenir à un accord avec Sao Paulo . Et finalement, selon le journaliste italien, l’accord de Beraldo porterait sur un montant de 20M€, sans bonus.","pubDate":"2023-12-23 12:45:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225327.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"9e2b76af13110880ee12c60f105399b9","title":"‘Scared’ Rodri was ‘close to tears’ after ‘one of the worst tackles of his career’ in Manchester City win","link":"https://talksport.com/football/1689133/rodri-tears-worst-tackle-man-city/","keywords":["Football","Premier League"],"creator":["Robert Calcutt"],"video_url":null,"description":null,"content":"Rodri admits he is a 'very lucky' man after the Manchester City star was able to avoid serious injury following a Fluminense player's tackle. The Spaniard featured in City's 4-0 win in the Club World Cup final against the Brazilian side on Friday, their fifth trophy lift of the year. During the second-half, Rodri was on the receiving end of a strong challenge from Alexsander and went down in pain. He was able to resume play but hit the turf once again, with Pep Guardiola then substituting him for Manuel Akani amid injury fears. Despite the initial worries, Rodri insists that he is fine to play but is counting his lucky stars that nothing serious happened to him. Speaking to Sky Sports after City won the Club World Cup, he said: \"I was very lucky today to be honest. \"I think it was one of the worst tackles in my career. It was so scary because I felt my knee but fortunately it was nothing and I said to the player, 'You cannot do these kind of actions.' \"Today I won more than a trophy, I go home safe but to be honest I was very close to crying because I felt very, very worried about what happened, but it's nothing.\" He was asked if he will be fit to play their next match against Everton on Wednesday and insisted: \"Yeah yeah. \"I have pain because it was very dramatic, the way it goes, but nothing affected.\" Rodri's confidence in his fitness will be music to the ears of City fans, with the 27-year-old integral to Pep Guardiola's side. They're unbeaten in the last 47 matches across all competitions in which last season's Champions League final hero has started. As well as this, City's three Premier League defeats this season have come when Rodri was absent from the side due to suspension. Guardiola will be hoping he can rely on his fellow Spaniard's fitness for the rest of the campaign, which could end with five trophies won.","pubDate":"2023-12-23 12:40:30","image_url":"https://talksport.com/wp-content/uploads/sites/5/2023/12/rodri-manchester-city-reacts-tackle-867871963.jpg?strip=all&w=960","source_id":"talksport","source_priority":4624,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e4d14aeca2b5d3de1da4260e6d7c3ff9","title":"Νέα Σαλαμίνα-Ανόρθωση: Το Βαρωσιώτικο ντέρμπι στο οποίο η καρδιά «σπαράζει»","link":"https://www.gazzetta.gr/football/protathlima-cyta/2287482/nea-salamina-anorthosi-barosiotiko-ntermpi-sto-opoio-i-kardia","keywords":["Ποδόσφαιρο","Κύπρος","Νέα Σαλαμίνα","Πρωτάθλημα Cyta","Ανόρθωση Αμμοχώστου","Πάνος Λάρκος"],"creator":null,"video_url":null,"description":"Νέα Σαλαμίνα-Ανόρθωση ή Ανόρθωση-Νέα Σαλαμίνα. Ένα ντέρμπι που δεν έχει καμία σχέση με κανένα άλλο. Ένα ντέρμπι όπου η καρδιά ματώνει, πονάει, διαλύεται, ραγίζει και «σπάζει» σε χίλια κομμάτια. Ένα ντέρμπι μακριά από την φυσική έδρα των δυο ομάδων, την θαλασσοφίλητη Αμμόχωστο.","content":"Ένα ντέρμπι όπου για μισό περίπου αιώνα δεν διεξάγεται στις πραγματικές του ρίζες, το ΓΣΕ και το Βαρώσι μετά τη βάρβαρη τουρκική εισβολή. Ένα ντέρμπι όπου οι παλιοί θυμούνται και διδάσκουν στους νέους την ιστορία και τις ρίζες τους, αλλά και τον μεγάλο πόθο για επιστροφή εκεί όπου μεγάλωσαν και έκαναν όνειρα. Στην Αμμόχωστο… Τόσο η Ανόρθωση όσο και η Νέα Σαλαμίνα για 49 χρόνια αποτελούν δυο πυλώνες αντίστασης. Αντίστασης στο να ξεχάσει η νέα γενιά τις ρίζες της και την Αμμόχωστο . Την ίδια ώρα όπου οι πολιτικοί δεν μπορούν να κουνήσουν το δαχτυλάκι τους για να βρεθεί μία λύση στο κυπριακό, οι δυο ομάδες της Αμμοχώστου έχουν καταφέρει να μείνουν όρθιες μέσα από δύσκολες συνθήκες και ταυτόχρονα μεταλαμπαδεύουν από γενιά σε γενιά τα ιδανικά των ομάδων τους αλλά και της Αμμοχώστου. Το να βλέπεις μικρά παιδιά να δακρύζουν ακούγοντας για την Αμμόχωστο αυτό δεν είναι έργο καμία κυβέρνησης, ούτε κάποιου πολιτικού προσώπου. Είναι καθαρά επίτευγμα του ποδοσφαίρου, της Ανόρθωσης και της Νέας Σαλαμίνας . Δυο προσφυγικά σωματεία που δίνουν το είναι τους για να μπορούν να συνεχίζουν να πρεσβεύουν τα ιδανικά και τις αξίες τους μακριά από τις ρίζες τους. Δίνουν την ψυχή τους για να μην ξεχάσει κανείς ότι κάποια μέρα πρέπει να επιστρέψει ο κόσμος στις ρίζες του. Κόντρα στις αντιξοότητες τα καταφέρνουν και δημιουργούν νέες γενιές που ζουν και αναπνέουν για επιστροφή στην Αμμόχωστο. Κι ας μην αντίκρισαν ποτέ την πόλη, κι ας μην ακούμπησαν ποτέ στην χρυσή αμμουδιά της Αμμοχώστου. Ξέρουν ότι έχουν ένα ιερό καθήκον. Το οποίο δεν είναι άλλο από το να μείνει η φλόγα ζωντανή και αναμμένη μέχρι την άγια ώρα της επιστροφής στην Αμμόχωστο . Μέχρι τότε οι δυο ομάδες θα αποτελούν σημείο αναφοράς και φάρο σε κάθε προσπάθεια, σε κάθε όνειρο, σε κάθε επιθυμία, σε κάθε καρδιά που έχει ραγίσει εδώ και 49 χρόνια… Υ.Γ. Η κεντρική φωτογραφία είναι από τον αγώνα ανάμεσα στις δυο ομάδες στο γήπεδο «Αμμόχωστος-Επιστροφή», έδρα της Νέας Σαλαμίνας , όπου ο Δήμος της Αμμοχώστου τύπωσε και στις δυο κερκίδες πλακάτ με το σύνθημα «Αμμόχωστος, θέλω την πόλη μου, το σπίτι μου». Σύνθημα ζωής πλέον για χιλιάδες Αμμοχωστιανούς…","pubDate":"2023-12-23 12:39:18","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"f5d8c38b1660014cba2e2082788400ad","title":"Football : Thomas Meunier révèle le montant de l'amende reçu par les joueurs de Dortmund pour chaque gramme pris pendant les fêtes","link":"https://www.ladepeche.fr/2023/12/23/football-thomas-meunier-revele-le-montant-de-lamende-recu-par-les-joueurs-de-dortmund-pour-chaque-gramme-pris-pendant-les-fetes-11660756.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Le Borussia Dortmund n'y va pas de main morte avec ses joueurs. Pour limiter la surcharge pondérale des joueurs au retour de la trêve hivernale le club allemand a déjà prévu des sanctions révèle l'arrière droit belge...","content":"Les excès des joueurs de Borussia Dortmund pendant les fêtes pourraient leur coûter très très cher. Le club allemand, adversaire du PSG en phase de poules de Ligue des champions, a décidé de se montrer strict cette année. Ils ont donc mis en place une réglementation précise pour dissuader les joueurs de trop manger à Noël et au Nouvel an révèle l'ancien latéral droit du Paris-Saint-Germain, Thomas Meunier. Une addition salée Chaque gramme sera compté précise l'international belge sur la RTBF : \"Nous avons été pesés lors du dernier entraînement et ce sera fait à la reprise\" ; \" Le tarif est connu : une amende de 1000 euros est prévue par kilo pris puis, à partir d'un certain palier, on passe à 1000 euros... les 100 grammes\". Et il semble que certains n'aient pas pris la mesure de cette sanction, le belge de 32 ans n'a lui jamais était inquiété mais ce n'est pas le cas de certains de ces coéquipiers : \" Sans balancer de nom, j'en connais un qui en était à 10 000 euros. On lui a dit : ' Tu as une semaine et si tu perds les kilos, on diminue l'amende' ... et il y est parvenu ! \" a raconté le Diable Rouge.","pubDate":"2023-12-23 12:37:03","image_url":"https://images.ladepeche.fr/api/v1/images/view/6586d43093ccd12a9414c5aa/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"23dc7bbcbfb0ae23029999081be978bc","title":"Sheffield Wednesday v Cardiff City live: Kick-off time, team news and score updates","link":"https://www.walesonline.co.uk/sport/football/football-news/sheffield-wednesday-v-cardiff-city-28342302","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Glen Williams)"],"video_url":null,"description":"The Bluebirds head to Yorkshire to take on the Owls","content":"Cardiff City take on Sheffield Wednesday today in the last instalment of Championship action before Christmas. The Bluebirds head into the game on the back of some poor form, having lost four of their last five matches. After a really positive start to the campaign, there is a danger of this run fizzling out mid-season, but Erol Bulut is desperate to get his side into the January transfer window without losing any more ground. The Owls are resurgent under new manager Danny Rohl and will prove a difficult test this afternoon. As ever, we will have all the live updates for you from Hillsborough. Kick-off is at 3pm . Sign up to our Cardiff City newsletter here Scroll down for live updates... READ MORE: Cardiff City fan jury - Transfer demands, 'dream' signings and tying Erol Bulut down WHATSAPP: For the latest Bluebirds stories delivered straight to your phone, join the Cardiff City WhatsApp here 12:40 Glen Williams Welcome! Hello and welcome to our live coverage from Hillsborough. Stick with us for all the build-up, team news and live match action from Yorkshire. Share Comments","pubDate":"2023-12-23 12:36:00","image_url":"https://i2-prod.walesonline.co.uk/incoming/article20323522.ece/ALTERNATES/s615/1_blogpic1.jpg","source_id":"walesonline","source_priority":16103,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"67553671564eb542a989014584e6be94","title":"Rangers-linked Scotland star’s season declared OVER after just two substitute appearances following £10m move","link":"https://www.thescottishsun.co.uk/sport/11697778/rangers-scotland-ross-stewart-southampton-sunderland/","keywords":["Championship","Football","Sport","Scottish Premiership"],"creator":["Stewart Fisher"],"video_url":null,"description":null,"content":"RANGERS have been heavily linked with Ross Stewart at various points of the former Ross County striker's journey. But the Ayrshire lad's career went in another direction - first when he moved to Sunderland , then when he clinched a £10m move to Southampton in the summer . 3 Ross Stewart's hopes of reaching Euro 2004 with Scotland have been dashed Credit: News Group Newspapers Ltd 3 Sunderland’s Ross Stewart has barely featured for Southampton Credit: Getty 3 Sunderland’s Ross Stewart bangs in a goal Credit: PA But the striker been limited to just TWO substitute appearances since earning his big move. And he's just learned that his season is now almost certainly OVER - as are his slim chance of joining clubmate Che Adams in Steve Clarke 's Scotland . That's because his hamstring injury has proved far more serious than first thought. Boss Russell Martin said in yesterday's press conference: “I think we need to be really honest about Ross and realistic, we probably won’t see him again this season. Read More Football Stories ON THE MOVE Celtic 'kick off January sales' as Hoops make PROFIT on star who played 1 match MEGA DEAL Celtic vs Livingston: Get £20 in free bets and £10 casino bonus with BoyleSports “I think if we say he’s not going to be here this season and if you do see him at some point, it’s a huge bonus.” Stewart has essentially missed 22 months of football out 24 - with 3 different injuries - and there's been mixed emotions from fans. Particularly from Sunderland fans who watched him bang in 40 goals in 80 games for them before jumping ship to a Championship rival. One fan wrote on X, formerly Twitter: \"Genuinely gutted for the bloke tbh. Most read in Championship KRIS BOYD Celtic just HAD to send an SOS to the Green Brigade - things have gotten that bad LAW AND ORDER Celtic lay down FOURTEEN rules to Green Brigade including ban on BALACLAVAS LOW BLOW SNP raid millions from sale of offshore wind plots in bid to plug huge budget gap ARREST IN PEACE Moment gypsy funeral mourners chased by cops with COFFIN on back of truck \"A fabulous centre forward before all this, and one who brought real joy to the club.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-12-23 12:57:40","image_url":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2023/12/ross-stewart-scotland-739177052.jpg?strip=all&w=748","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3198c24da9ad025753afbbf2e3d7bdee","title":"EA Sports FC 24 hits all-time low during Steam Winter Sale 2023","link":"https://thesportsrush.com/gaming-news-ea-sports-fc-24-hits-all-time-low-steam-winter-sale-2023/","keywords":["EA FC 24","Gaming","News","EA FC 24 cheap","ea sports","FC 24","Steam","Winter Sale 2023"],"creator":["Amlan Roy"],"video_url":null,"description":"EA Sports FC 24 is available at its lowest price on Steam during the Winter Sale 2023, making it a great time to purchase the game. In the two-week-long discount fest, the football game is available at a 60% reduced price under three months of its release. Now, users can buy the title for only… The post EA Sports FC 24 hits all-time low during Steam Winter Sale 2023 appeared first on The SportsRush.","content":"Advertisement EA FC 24 is 60% off for Christmas: Standard Edition (was $70, now $28): https://t.co/bc1PvfhAho Ultimate Edition (was, $100, now $40): https://t.co/TkQz2oC33z pic.twitter.com/Tq7qs8DfPe — EA FC 24 News (@FC24News) December 19, 2023 Advertisement What are you doing if this happens to you? Credit: u/GGlowy pic.twitter.com/lybbwsmEyP — EA FC 24 News (@FC24News) November 13, 2023 How will the Steam Winter Sale 2023 affect EA Sports FC 24’s player count? Advertisement Probably the best FC 24 goal I’ve ever seen Credit: u/NzuahVI pic.twitter.com/UGCIhhssCY — EA FC 24 News (@FC24News) November 3, 2023 Advertisement","pubDate":"2023-12-23 12:49:50","image_url":"https://cdn-wp.thesportsrush.com/2023/12/6f2a03c5-ea-fc-24-halland.jpg","source_id":"thesportsrush","source_priority":4166,"country":["australia","united states of america","united kingdom","india"],"category":["sports"],"language":"english"},{"article_id":"b78c2578691f15997395a2e5b4a3b6ab","title":"Darts sensation Luke Littler has day off from kebabs as he thanks legion of new fans","link":"https://www.dailystar.co.uk/sport/darts/luke-littler-kebab-world-championship-31739630","keywords":["Sport"],"creator":["staronline@reachplc.com (Dan Burnham)"],"video_url":null,"description":"Luke Littler took to social media to reflect on the craziest week of his young life at the World Darts Championship - and let his new fans know what he'd had for tea","content":"Luke Littler took a day off from the kebabs as he thanked his new fans for their Paddy Power World Championship support. The 16-year-old sensation has breezed into the third round on his Ally Pally debut, first seeing off Christian Kist before following up that over UK Open champion Andrew Gilding this week. Not being old enough to legally drink alcohol in his home country yet, Littler marked his progression differently to most - after both matches as a celebratory treat. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month But in the interests of his arteries the youngster switched it up on Friday (December 22). Taking to X, formerly Twitter, he wrote: \"Back home for Christmas. \"Thanks to everyone for messages I don’t think I can get round to say thanks to everyone there’s that many but I’ll try tomorrow. 10 thousand new followers last few days, 20 thousand new Instagram followers. Wishing you all a Merry .\" One of his followers then asked what he'd had for tea, with Littler replying: \"Chicken burger.\" The Nuke, as he's been dubbed, will return to face Canadian Matt Campbell after Christmas. The manner of his wins have stunned the darts world. He averaged 106.12 in a whitewash of Kist, higher than former world champion Gerwyn Price has ever managed on the same stage. And he only dropped one set to world No. 20 Gilding, showing little nerves against a vastly more experienced opponent. Guaranteeing himself at least £25,000 from the tournament, Littler bought his own kebab the second time around. \"My manager got that kebab so I'll get my own because I didn't really like it,\" he told Sky Sports. \"It's trending worldwide that kebab! But I think it's another kebab.\"","pubDate":"2023-12-23 12:47:07","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31723190.ece/ALTERNATES/s98/2_JS320058636.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"abb999b42e59186baf505ba076303dfc","title":"NFL picks: Are we looking at a Super Bowl preview Christmas Day between Ravens and 49ers?","link":"https://www.denverpost.com/2023/12/23/nfl-picks-week-16-football/","keywords":["Denver Broncos","Latest Headlines","NFL","Sports","Aaron Rodgers","Baker Mayfield","Case Keenum","Christian McCaffrey","Drew Lock","Gardner Minshew","Joe Flacco","Justin Herbert","Kyle Shanahan","More Broncos News","Patrick Mahomes","Russell Wilson","Tim Patrick","Trevor Lawrence"],"creator":["Parker Gabriel"],"video_url":null,"description":"NFL beat writer Parker Gabriel takes a look around the league heading into Week 16, including Baltimore at San Francisco.","content":"There are so many teams bunched up for playoff positioning, from three entering Sunday tied at 8-6 atop the AFC South to the seven teams entering the weekend with either seven or eight wins. At this point, it’s tough to know which way is up. But this will be a big weekend for clarity. Some way or another, at least a team or two rolling with a backup quarterback is going to make it to the postseason. Joe Flacco in Cleveland, Case Keenum in Houston, Jake Browning in Cincinnati, Gardner Minshew in Indianapolis. Then, can any of them win there? There’s a long way to go before the full scale of a potentially wild NFL coaching carousel is known this year. One thing’s for sure: There will be new brass for the Chargers, who are in the market for a coaching staff and a general manager. The conventional wisdom is that Justin Herbert’s presence makes L.A. the best job on the market, regardless of what else comes open. And, to be sure, coaches would all line up to work with him. But the rest of the picture is an aging, expensive roster with a pretty brutal salary cap picture going forward. So, is the tantalizing signal-caller enough to offset the rest? For somebody, obviously, it will be. But whether the Chargers are the pick of the coaching litter seems far from a certainty. And in the most shocking news of the NFL season, Aaron Rodgers is actually not returning from a torn Achilles tendon in three months. Who could have guessed? It does, of course, boggle the mind a bit to see Rodgers and others, too — including the Broncos’ Tim Patrick — rebound so quickly from Achilles tears thanks to new surgical procedures. That’s a good thing for athletes in the future. Speaking of good things and futures, what’s the likelihood that Rodgers’ full-throated endorsement of the Jets’ coaching apparatus looks wise a year from now? Dallas spent five weeks riding high, scoring 33-plus in five straight wins. Then Mike McCarthy’s team got thrown off the bull hard in a 31-10 beatdown at Buffalo on Sunday night. They’re going to get tested the next two weeks, too, against Miami and Detroit, before closing the season at Washington. They’ve locked up a playoff spot already. They’ll be talked about plenty in the coming weeks, but the only thing this group will be judged by ultimately is whether it can get the franchise past the divisional round of the playoffs for the first time since the 1995 season. No, really. Are the Birds in trouble? Philadelphia went from 10-1 to currently occupying a Wild Card spot thanks to a three-game skid started by San Francisco in the City of Brotherly Love and most recently extended by…. Drew Lock and his 92-yard touchdown drive! That’s a coast-to-coast skid, with Dallas right in the middle. Here’s the good news: There might not be a true cure for what ails the Eagles — defensive coordinator changes in December for teams with Super Bowl aspirations is not it, man — but there’s time for healing on the horizon. Philly closes with two against the Giants around a home game against Arizona. 13-4 here they come. Tough spot for Green Bay to be in this weekend. They’re clinging to slim playoff hopes after back-to-back dreadful defensive performances. Not only that, but beating Carolina this week only bolster’s arch-rival Chicago’s draft position, since the Bears have the Panthers’ first-round pick. Great work, Pack! You’ve just helped ensure you’ll be facing Caleb Williams twice a year. Funny enough, Chicago can help its own cause, too, by… losing to 3-11 Arizona. A Super Bowl preview? It wouldn’t be surprising at all at this point, given the way each team has rolled through the regular season. They do it in different ways, but both are complete teams that can scare you offensively and beat you up defensively. 49ers running back Christian McCaffrey has 1,801 offensive yards (1,292 rushing) and 20 touchdowns with three games to go this year. Seems pretty good. MVP good, come to think of it. He’ll be a key in Kyle Shanahan’s team getting it done as a 5.5-point home favorite. 49ers 27, Ravens 23 Antonio Pierce deserves a lot of credit for the work he’s done as the Raiders’ interim coach. Las Vegas has been a salty defense over the past few weeks and players seem to be committed to playing hard for him. But beating Patrick Mahomes and company would be a tall order. The Chiefs have their own issues, but they’re still in the hunt (albeit as major underdogs) for the No. 1 seed and they can wrap up a division title with either a Broncos loss Sunday or with a win as a 10-point home favorite on Christmas Day Chiefs 30, Raiders 13 Baker Mayfield and the Bucs put on an absolute clinic last week, torching Green Bay for 381 yards, four touchdowns and a perfect 158.3 passer rating at Lambeau Field. Hello. Mayfield’s had a pretty good year — his 3,315 yards, 24 TDs, eight INTs and 94.7 rating looks a little bit Russell Wilson-ish — and Tampa’s right in the mix for the mediocre-but-wide-open NFC South. Even still, Jacksonville needs the win just as much as it enters play in a three-way tie for the AFC South. As long as Trevor Lawrence plays to his normal standard after a concussion last week, the Jags should find a way to get the job done as a one-point road underdog across the Panhandle. Jaguars 24, Buccaneers 23","pubDate":"2023-12-23 12:45:27","image_url":"https://www.denverpost.com/wp-content/uploads/2023/11/AP23313047037165.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"054db47158e6019974d02258d78441b0","title":"Festivus 2023: The airing of grievances, sports edition","link":"https://www.denverpost.com/2023/12/23/festivus-airing-of-grievances-sports-edition-2023/","keywords":["Latest Headlines","Sports","AT&T SportsNet","Augusta National","baseball","Baseball Hall of Fame","basketball","Charlie Blackmon","college football","Coors Field","CU Buffs","Deion Sanders","Dick Monfort","golf","holidays","MLB All-Star Game","Shannon Sharpe","Todd Helton"],"creator":["Jeff Bailey"],"video_url":null,"description":"We will start by paying our respect to the classic TV show Seinfeld with my favorite tradition, the \"airing of grievances.\"","content":"Festivus is back! And with my aluminum pole, with a high strength-to-weight ratio, now pulled out of the crawl space we are ready for a tinsel-free Festivus miracle. Another year has come and gone in the sports world, memories were made, champions were crowned and over the past 12 months, my basket was filled with content for this year’s piece. We will start by paying our respect to the classic TV show Seinfeld with my favorite tradition, the “airing of grievances.” I have a lot of problems with teams, commissioners, fans, owners, players, rules and mascots. And now, you’re gonna hear about it. Here are all the ways the sports world has disappointed me over the past year: Is this really the best the Rockies could do in the mascot department? Time to make a trade my friends, I’ll take another pantless mascot in Clark from the Chicago Cubs all day. I thought Colorado letting Charlie Blackmon rob Monfort and Co. of was bad, but having Dinger on a contract that won’t end takes the cake. The 2023 class was filled with talent and real hall of famers. But again, the writers dropped the ball and left out some truly deserving players. It was nice to finally see the “Crime Dog” Fred McGriff get the call to Cooperstown. Still not sure why a guy with 493 homers and one of the most feared hitters of the 1990s had to wait for the Contemporary Baseball Era Players Committee to get in. Scott Rolen also got the call he was headed to Cooperstown, but I would argue he shouldn’t get in before other deserving guys. I mean, Rolen only had 316 home runs and 2077 hits. Whereas, Jeff Kent and Todd Helton were better players with stats on the back of their baseball cards to prove it. Kent finished with 2461 hits and 377 homers (most all-time for second base), and a .290 batting average. Helton tallied 2519 hits, 369 homer while hitting .316 for his career. Those are just a few stats to make my point. Sharpe got into a courtside yelling match at a Lakers game with Grizzlies’ Ja Morant. It is laughable how a grown man jumps onto the court and makes a huge scene that is all about him being a tough guy. Anyone else pulls that stunt sitting on the hardwood at an arena would have been ejected from the complex. All we got was a “I’ve preached for the last six and a half years responsibility and accountability, and I take full responsibility for what transpired,” Sharpe said. “I’m never gonna say that wasn’t Shannon Sharpe because that was me. That was just me getting out of character. And I’m sorry for all those who saw my actions and took offense to my actions.” Good lord, no emotional impulse control mixed with no common sense. Doesn't realize he should be absolutely embarrassed. This is similar to Juwan Howard slapping a coach and not realizing for a week he did anything wrong. A regular fan gets permanently banned for this behavior. — Jason Whitlock (@WhitlockJason) Have a feeling Manfred will be on this list yearly until his time in MLB is done. He keeps adding to the list with new rules that aren’t improving the game. The pitch clock and extra innings are at the top of my list. Baseball was never intended to be a timed clock sport, if that’s your jam head over to Dick’s Sporting Goods Park and watch the Rapids. Baseball is a classic game purists love. I enjoy the experience of going to the ballyard and not having anywhere to be. The other change was extra innings with the California tiebreaker rule when starting with a runner starting on second base. If you don’t want to play free baseball, win it in nine. Gone are the thrilling 15-inning games where a bench runs low the teams have to claw out a win. I’m an old-school guy and happy I worked in professional ball back when the game was played the right way. I miss throwing inside, sliding hard into bags/taking guys out and pitchers wanting to go 7-8 innings a start… none of this quality four innings junk. Yes, looking at your Kyle Freehand. Would love to hear a manager tell the likes of Gibson, Koufax, Palmer, Gooden, Hershiser, Clemens, Maddux and other greats to give us a solid five. And while you’re giving us that quality start, you can’t throw inside. Players today are soft. This is tough to hear… would not fly in the old days! Unfortunately this is how players are being taught with modern analytics…. What are y’all’s thoughts? — Roger Clemens (@rogerclemens) Golf Aurora and other courses that charge full-price green fees in winter months. I have heard it is because they don’t want to devalue the course. Well, I have news for those folks… it isn’t devaluing the course. A lot of high-end courses have seasonal rates. Golfers will agree, a dormant course in winter months shouldn’t be charging premium green fees. Will give a tip of the cap to the superintendents who work countless hours keeping a course in tip-top shape. With , it’s unsure who will broadcast Rockies games in 2024. The change may be a good thing in the end, as many fans feel the this area needed an overhaul. There are only so many Supermo references, or clinics a guy can give during a broadcast. Baseball fans are knowledgeable, and don’t need seven people contributing during a game in and around the booth. It would be a breath of fresh air for some new talent to take the reins in 2024. Player might be a three-time Masters champion, but that doesn’t give him the right to trash its members or course. about not being able to get tee times at Augusta National is one of the main reasons he isn’t invited more often. It could also have to do something with his son being for promoting golf balls during the opening tee shots in 2021… yes Player has won the Masters, but the traditions and way the club operates are what makes Augusta National a special place. I will give Player some advice, stop running your mouth about how . It’s not just another course, it is what we golfers consider hallowed grounds. We had this on the list last season, and it still rings true today. The only difference this year is agrees with us and thinks the 8 p.m. game times being bad for all involved. “Who makes these 8 o’clock games? Dumbest thing ever. Stupidest thing ever invented in life. Who wants to stay up until 8 o’clock for a darn game?” on his weekly radio show. “What about the East Coast — do they even care about ratings? Is anyone watching it? What are we supposed to do with the kids all day until 8 o’clock? What are we supposed to do in the hotel?” To all the media outlets and local journalists openly rooting over the top for Avs/Nuggets and Buffs on social media during the postseason runs must have forgotten that they are journalists who are supposed to be impartial and report the news. If you want to be a fan and pumped after the fact I’m all for it… to all my coworkers who are beat reporters, I applaud you for how you run your beats. Y’all are professionals and I’m happy to work with ya. Home run derby pitchers need to start throwing back at the bottom of the mound, go back to 10 outs and stop with the rapid-fire pitches. The biggest change had to do with the uniforms. The ASG needs to go back to having players wear team uniforms. It made the game special seeing players in the home and away unis… baseball has lost its way over the years. This one is for all the players who decide they are special and need to hit in the lesson area at the driving range. Those lesson grounds are for people who are paying a golf professional to give them a private lesson. And what comes with that is an area of more lush grounds to hit balls from. It’s one of the perks of paying for a private lesson at a course. So next time you decide to hit a bucket of balls from the lesson grounds, just know the golf gods are looking down upon you with shanks and slices coming your way during your next round of golf. Coors Field is Wrigley West when the Cubs come to town. Monfort should be ashamed of the culture the Rockies have created around 20th and Blake. Saying his team will be a .500 ball club, striving to be average and then losing 103 games. How do you lose 100-plus games and not fire anyone? But hey, at least when the Cubs come to town a packed house at Coors is a given. The oven mitts these guys are wearing are a laughable joke. Players from years past are laughing at these guys… they aren’t about player safety. They are about getting an extra six inches closer to sliding safe into bags. Mr. “I hate baseball” Manfred won’t do anything about it, but clubhouse attendants across baseball need to throw these things in the trash where they belong. All those California teams going to the ACC is pure comedy. Did those educated school presidents forget what the ACC stands for? I’ll give them the answer, Atlantic Coast Conference. Everyone knows NIL and the massive power conferences is all about football and broadcast money. Other sports are going to feel the pain here. I feel bad for the normal student-athlete who has to deal with the brutal travel schedule. Never thought I would see the day when players are staying in college longer and would rather go to class than make the jump to the professional ranks. Amazing what a few million dollars will make a student-athlete do. We aren’t done here folks, it will continue to blow up in NCAA’s faces in 2024. Big hits in football are not allowed anymore, even the legal ones. Football has become so soft, at the sight of a big hit the laundry starts flying. The league needs to get back to some form of football or it will all turn into a glorified flag football league. And if you are going to have the FFL, you might hire Manfred as your commissioner since he has a thing for destroying legacy and creating unnecessary rules. As Festivus rolls on, we come to the feats of strength. As we have no room currently in the newsroom for such wrestling activities, I’ll leave ya with something relaxing you can enjoy: The Butler Cabin Yule log from Augusta National. Vic Carapazza just informed the Reds dugout, it seems, that the second inning is not the time for the Cincy bullpen guys to go on an Eagle Scout adventure through the trees beyond CF. — Parker Gabriel (@ParkerJGabriel)","pubDate":"2023-12-23 12:45:10","image_url":"https://www.denverpost.com/wp-content/uploads/2016/12/festivus-pole.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"9542143a743d3a6c799eb2145d1fe2c3","title":"Mercato - PSG : 20M€ lâchés, la première recrue hivernale est annoncée","link":"https://le10sport.com/football/mercato/mercato-psg-20meur-laches-la-premiere-recrue-hivernale-est-annoncee-676791","keywords":null,"creator":null,"video_url":null,"description":"Alors que Presnel Kimpembe n’est finalement pas prêt de rejouer avec le PSG, le club de la capitale s’est mis en quête d’un renfort en défense centrale. Et finalement, Paris va trouver son bonheur du…","content":"Alors que Presnel Kimpembe n’est finalement pas prêt de rejouer avec le PSG, le club de la capitale s’est mis en quête d’un renfort en défense centrale. Et finalement, Paris va trouver son bonheur du côté du Brésil. Ces derniers jours, le dossier Lucas Beraldo avait été révélé. Et voilà que le transfert du Brésilien de Sao Paulo au PSG serait bouclé. Cet hiver, le PSG va prendre l’accent brésilien. Souhaitant apporter quelques retouches à l’effectif de Luis Enrique et répondre aux besoins de l’entraîneur espagnol, Luis Campos est parti piocher au Brésil. Alors que Gabriel Moscardo doit arriver de Corinthians, le premier à rejoindre le PSG devrait être Lucas Beraldo ( Sao Paulo ). Mercato - PSG : C’est terminé pour ce flop du projet QSI ? https://t.co/c3ECkqN5QE pic.twitter.com/qbejZfPazb Le mercato hivernal n’a pas encore officiellement ouvert ses portes, mais le PSG tiendrait déjà sa première recrue de janvier. En effet, ce samedi, Fabrizio Romano a sorti son traditionnel « Here we go » pour annoncer la venue du Brésilien à Paris. Un accord verbal aurait été trouvé entre les différentes parties et désormais, Sao Paulo et le PSG prépareraient les derniers documents pour boucler l’affaire à 100%. De son côté, Beraldo patiente dans l’attente de sa visite médicale. Le PSG va donc accueillir Lucas Beraldo dans les prochains jours. Pour cela, le club de la capitale a dû sortir le carnet de chèques pour parvenir à un accord avec Sao Paulo . Et finalement, selon le journaliste italien, l’accord de Beraldo porterait sur un montant de 20M€, sans bonus.","pubDate":"2023-12-23 12:45:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225327.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"9e2b76af13110880ee12c60f105399b9","title":"‘Scared’ Rodri was ‘close to tears’ after ‘one of the worst tackles of his career’ in Manchester City win","link":"https://talksport.com/football/1689133/rodri-tears-worst-tackle-man-city/","keywords":["Football","Premier League"],"creator":["Robert Calcutt"],"video_url":null,"description":null,"content":"Rodri admits he is a 'very lucky' man after the Manchester City star was able to avoid serious injury following a Fluminense player's tackle. The Spaniard featured in City's 4-0 win in the Club World Cup final against the Brazilian side on Friday, their fifth trophy lift of the year. During the second-half, Rodri was on the receiving end of a strong challenge from Alexsander and went down in pain. He was able to resume play but hit the turf once again, with Pep Guardiola then substituting him for Manuel Akani amid injury fears. Despite the initial worries, Rodri insists that he is fine to play but is counting his lucky stars that nothing serious happened to him. Speaking to Sky Sports after City won the Club World Cup, he said: \"I was very lucky today to be honest. \"I think it was one of the worst tackles in my career. It was so scary because I felt my knee but fortunately it was nothing and I said to the player, 'You cannot do these kind of actions.' \"Today I won more than a trophy, I go home safe but to be honest I was very close to crying because I felt very, very worried about what happened, but it's nothing.\" He was asked if he will be fit to play their next match against Everton on Wednesday and insisted: \"Yeah yeah. \"I have pain because it was very dramatic, the way it goes, but nothing affected.\" Rodri's confidence in his fitness will be music to the ears of City fans, with the 27-year-old integral to Pep Guardiola's side. They're unbeaten in the last 47 matches across all competitions in which last season's Champions League final hero has started. As well as this, City's three Premier League defeats this season have come when Rodri was absent from the side due to suspension. Guardiola will be hoping he can rely on his fellow Spaniard's fitness for the rest of the campaign, which could end with five trophies won.","pubDate":"2023-12-23 12:40:30","image_url":"https://talksport.com/wp-content/uploads/sites/5/2023/12/rodri-manchester-city-reacts-tackle-867871963.jpg?strip=all&w=960","source_id":"talksport","source_priority":4624,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e4d14aeca2b5d3de1da4260e6d7c3ff9","title":"Νέα Σαλαμίνα-Ανόρθωση: Το Βαρωσιώτικο ντέρμπι στο οποίο η καρδιά «σπαράζει»","link":"https://www.gazzetta.gr/football/protathlima-cyta/2287482/nea-salamina-anorthosi-barosiotiko-ntermpi-sto-opoio-i-kardia","keywords":["Ποδόσφαιρο","Κύπρος","Νέα Σαλαμίνα","Πρωτάθλημα Cyta","Ανόρθωση Αμμοχώστου","Πάνος Λάρκος"],"creator":null,"video_url":null,"description":"Νέα Σαλαμίνα-Ανόρθωση ή Ανόρθωση-Νέα Σαλαμίνα. Ένα ντέρμπι που δεν έχει καμία σχέση με κανένα άλλο. Ένα ντέρμπι όπου η καρδιά ματώνει, πονάει, διαλύεται, ραγίζει και «σπάζει» σε χίλια κομμάτια. Ένα ντέρμπι μακριά από την φυσική έδρα των δυο ομάδων, την θαλασσοφίλητη Αμμόχωστο.","content":"Ένα ντέρμπι όπου για μισό περίπου αιώνα δεν διεξάγεται στις πραγματικές του ρίζες, το ΓΣΕ και το Βαρώσι μετά τη βάρβαρη τουρκική εισβολή. Ένα ντέρμπι όπου οι παλιοί θυμούνται και διδάσκουν στους νέους την ιστορία και τις ρίζες τους, αλλά και τον μεγάλο πόθο για επιστροφή εκεί όπου μεγάλωσαν και έκαναν όνειρα. Στην Αμμόχωστο… Τόσο η Ανόρθωση όσο και η Νέα Σαλαμίνα για 49 χρόνια αποτελούν δυο πυλώνες αντίστασης. Αντίστασης στο να ξεχάσει η νέα γενιά τις ρίζες της και την Αμμόχωστο . Την ίδια ώρα όπου οι πολιτικοί δεν μπορούν να κουνήσουν το δαχτυλάκι τους για να βρεθεί μία λύση στο κυπριακό, οι δυο ομάδες της Αμμοχώστου έχουν καταφέρει να μείνουν όρθιες μέσα από δύσκολες συνθήκες και ταυτόχρονα μεταλαμπαδεύουν από γενιά σε γενιά τα ιδανικά των ομάδων τους αλλά και της Αμμοχώστου. Το να βλέπεις μικρά παιδιά να δακρύζουν ακούγοντας για την Αμμόχωστο αυτό δεν είναι έργο καμία κυβέρνησης, ούτε κάποιου πολιτικού προσώπου. Είναι καθαρά επίτευγμα του ποδοσφαίρου, της Ανόρθωσης και της Νέας Σαλαμίνας . Δυο προσφυγικά σωματεία που δίνουν το είναι τους για να μπορούν να συνεχίζουν να πρεσβεύουν τα ιδανικά και τις αξίες τους μακριά από τις ρίζες τους. Δίνουν την ψυχή τους για να μην ξεχάσει κανείς ότι κάποια μέρα πρέπει να επιστρέψει ο κόσμος στις ρίζες του. Κόντρα στις αντιξοότητες τα καταφέρνουν και δημιουργούν νέες γενιές που ζουν και αναπνέουν για επιστροφή στην Αμμόχωστο. Κι ας μην αντίκρισαν ποτέ την πόλη, κι ας μην ακούμπησαν ποτέ στην χρυσή αμμουδιά της Αμμοχώστου. Ξέρουν ότι έχουν ένα ιερό καθήκον. Το οποίο δεν είναι άλλο από το να μείνει η φλόγα ζωντανή και αναμμένη μέχρι την άγια ώρα της επιστροφής στην Αμμόχωστο . Μέχρι τότε οι δυο ομάδες θα αποτελούν σημείο αναφοράς και φάρο σε κάθε προσπάθεια, σε κάθε όνειρο, σε κάθε επιθυμία, σε κάθε καρδιά που έχει ραγίσει εδώ και 49 χρόνια… Υ.Γ. Η κεντρική φωτογραφία είναι από τον αγώνα ανάμεσα στις δυο ομάδες στο γήπεδο «Αμμόχωστος-Επιστροφή», έδρα της Νέας Σαλαμίνας , όπου ο Δήμος της Αμμοχώστου τύπωσε και στις δυο κερκίδες πλακάτ με το σύνθημα «Αμμόχωστος, θέλω την πόλη μου, το σπίτι μου». Σύνθημα ζωής πλέον για χιλιάδες Αμμοχωστιανούς…","pubDate":"2023-12-23 12:39:18","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"f5d8c38b1660014cba2e2082788400ad","title":"Football : Thomas Meunier révèle le montant de l'amende reçu par les joueurs de Dortmund pour chaque gramme pris pendant les fêtes","link":"https://www.ladepeche.fr/2023/12/23/football-thomas-meunier-revele-le-montant-de-lamende-recu-par-les-joueurs-de-dortmund-pour-chaque-gramme-pris-pendant-les-fetes-11660756.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Le Borussia Dortmund n'y va pas de main morte avec ses joueurs. Pour limiter la surcharge pondérale des joueurs au retour de la trêve hivernale le club allemand a déjà prévu des sanctions révèle l'arrière droit belge...","content":"Les excès des joueurs de Borussia Dortmund pendant les fêtes pourraient leur coûter très très cher. Le club allemand, adversaire du PSG en phase de poules de Ligue des champions, a décidé de se montrer strict cette année. Ils ont donc mis en place une réglementation précise pour dissuader les joueurs de trop manger à Noël et au Nouvel an révèle l'ancien latéral droit du Paris-Saint-Germain, Thomas Meunier. Une addition salée Chaque gramme sera compté précise l'international belge sur la RTBF : \"Nous avons été pesés lors du dernier entraînement et ce sera fait à la reprise\" ; \" Le tarif est connu : une amende de 1000 euros est prévue par kilo pris puis, à partir d'un certain palier, on passe à 1000 euros... les 100 grammes\". Et il semble que certains n'aient pas pris la mesure de cette sanction, le belge de 32 ans n'a lui jamais était inquiété mais ce n'est pas le cas de certains de ces coéquipiers : \" Sans balancer de nom, j'en connais un qui en était à 10 000 euros. On lui a dit : ' Tu as une semaine et si tu perds les kilos, on diminue l'amende' ... et il y est parvenu ! \" a raconté le Diable Rouge.","pubDate":"2023-12-23 12:37:03","image_url":"https://images.ladepeche.fr/api/v1/images/view/6586d43093ccd12a9414c5aa/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"23dc7bbcbfb0ae23029999081be978bc","title":"Sheffield Wednesday v Cardiff City live: Kick-off time, team news and score updates","link":"https://www.walesonline.co.uk/sport/football/football-news/sheffield-wednesday-v-cardiff-city-28342302","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Glen Williams)"],"video_url":null,"description":"The Bluebirds head to Yorkshire to take on the Owls","content":"Cardiff City take on Sheffield Wednesday today in the last instalment of Championship action before Christmas. The Bluebirds head into the game on the back of some poor form, having lost four of their last five matches. After a really positive start to the campaign, there is a danger of this run fizzling out mid-season, but Erol Bulut is desperate to get his side into the January transfer window without losing any more ground. The Owls are resurgent under new manager Danny Rohl and will prove a difficult test this afternoon. As ever, we will have all the live updates for you from Hillsborough. Kick-off is at 3pm . Sign up to our Cardiff City newsletter here Scroll down for live updates... READ MORE: Cardiff City fan jury - Transfer demands, 'dream' signings and tying Erol Bulut down WHATSAPP: For the latest Bluebirds stories delivered straight to your phone, join the Cardiff City WhatsApp here 12:40 Glen Williams Welcome! Hello and welcome to our live coverage from Hillsborough. Stick with us for all the build-up, team news and live match action from Yorkshire. Share Comments","pubDate":"2023-12-23 12:36:00","image_url":"https://i2-prod.walesonline.co.uk/incoming/article20323522.ece/ALTERNATES/s615/1_blogpic1.jpg","source_id":"walesonline","source_priority":16103,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"67553671564eb542a989014584e6be94","title":"Rangers-linked Scotland star’s season declared OVER after just two substitute appearances following £10m move","link":"https://www.thescottishsun.co.uk/sport/11697778/rangers-scotland-ross-stewart-southampton-sunderland/","keywords":["Championship","Football","Sport","Scottish Premiership"],"creator":["Stewart Fisher"],"video_url":null,"description":null,"content":"RANGERS have been heavily linked with Ross Stewart at various points of the former Ross County striker's journey. But the Ayrshire lad's career went in another direction - first when he moved to Sunderland , then when he clinched a £10m move to Southampton in the summer . 3 Ross Stewart's hopes of reaching Euro 2004 with Scotland have been dashed Credit: News Group Newspapers Ltd 3 Sunderland’s Ross Stewart has barely featured for Southampton Credit: Getty 3 Sunderland’s Ross Stewart bangs in a goal Credit: PA But the striker been limited to just TWO substitute appearances since earning his big move. And he's just learned that his season is now almost certainly OVER - as are his slim chance of joining clubmate Che Adams in Steve Clarke 's Scotland . That's because his hamstring injury has proved far more serious than first thought. Boss Russell Martin said in yesterday's press conference: “I think we need to be really honest about Ross and realistic, we probably won’t see him again this season. Read More Football Stories ON THE MOVE Celtic 'kick off January sales' as Hoops make PROFIT on star who played 1 match MEGA DEAL Celtic vs Livingston: Get £20 in free bets and £10 casino bonus with BoyleSports “I think if we say he’s not going to be here this season and if you do see him at some point, it’s a huge bonus.” Stewart has essentially missed 22 months of football out 24 - with 3 different injuries - and there's been mixed emotions from fans. Particularly from Sunderland fans who watched him bang in 40 goals in 80 games for them before jumping ship to a Championship rival. One fan wrote on X, formerly Twitter: \"Genuinely gutted for the bloke tbh. Most read in Championship KRIS BOYD Celtic just HAD to send an SOS to the Green Brigade - things have gotten that bad LAW AND ORDER Celtic lay down FOURTEEN rules to Green Brigade including ban on BALACLAVAS LOW BLOW SNP raid millions from sale of offshore wind plots in bid to plug huge budget gap ARREST IN PEACE Moment gypsy funeral mourners chased by cops with COFFIN on back of truck \"A fabulous centre forward before all this, and one who brought real joy to the club.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-12-23 12:57:40","image_url":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2023/12/ross-stewart-scotland-739177052.jpg?strip=all&w=748","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3198c24da9ad025753afbbf2e3d7bdee","title":"EA Sports FC 24 hits all-time low during Steam Winter Sale 2023","link":"https://thesportsrush.com/gaming-news-ea-sports-fc-24-hits-all-time-low-steam-winter-sale-2023/","keywords":["EA FC 24","Gaming","News","EA FC 24 cheap","ea sports","FC 24","Steam","Winter Sale 2023"],"creator":["Amlan Roy"],"video_url":null,"description":"EA Sports FC 24 is available at its lowest price on Steam during the Winter Sale 2023, making it a great time to purchase the game. In the two-week-long discount fest, the football game is available at a 60% reduced price under three months of its release. Now, users can buy the title for only… The post EA Sports FC 24 hits all-time low during Steam Winter Sale 2023 appeared first on The SportsRush.","content":"Advertisement EA FC 24 is 60% off for Christmas: Standard Edition (was $70, now $28): https://t.co/bc1PvfhAho Ultimate Edition (was, $100, now $40): https://t.co/TkQz2oC33z pic.twitter.com/Tq7qs8DfPe — EA FC 24 News (@FC24News) December 19, 2023 Advertisement What are you doing if this happens to you? Credit: u/GGlowy pic.twitter.com/lybbwsmEyP — EA FC 24 News (@FC24News) November 13, 2023 How will the Steam Winter Sale 2023 affect EA Sports FC 24’s player count? Advertisement Probably the best FC 24 goal I’ve ever seen Credit: u/NzuahVI pic.twitter.com/UGCIhhssCY — EA FC 24 News (@FC24News) November 3, 2023 Advertisement","pubDate":"2023-12-23 12:49:50","image_url":"https://cdn-wp.thesportsrush.com/2023/12/6f2a03c5-ea-fc-24-halland.jpg","source_id":"thesportsrush","source_priority":4166,"country":["australia","united states of america","united kingdom","india"],"category":["sports"],"language":"english"},{"article_id":"b78c2578691f15997395a2e5b4a3b6ab","title":"Darts sensation Luke Littler has day off from kebabs as he thanks legion of new fans","link":"https://www.dailystar.co.uk/sport/darts/luke-littler-kebab-world-championship-31739630","keywords":["Sport"],"creator":["staronline@reachplc.com (Dan Burnham)"],"video_url":null,"description":"Luke Littler took to social media to reflect on the craziest week of his young life at the World Darts Championship - and let his new fans know what he'd had for tea","content":"Luke Littler took a day off from the kebabs as he thanked his new fans for their Paddy Power World Championship support. The 16-year-old sensation has breezed into the third round on his Ally Pally debut, first seeing off Christian Kist before following up that over UK Open champion Andrew Gilding this week. Not being old enough to legally drink alcohol in his home country yet, Littler marked his progression differently to most - after both matches as a celebratory treat. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month But in the interests of his arteries the youngster switched it up on Friday (December 22). Taking to X, formerly Twitter, he wrote: \"Back home for Christmas. \"Thanks to everyone for messages I don’t think I can get round to say thanks to everyone there’s that many but I’ll try tomorrow. 10 thousand new followers last few days, 20 thousand new Instagram followers. Wishing you all a Merry .\" One of his followers then asked what he'd had for tea, with Littler replying: \"Chicken burger.\" The Nuke, as he's been dubbed, will return to face Canadian Matt Campbell after Christmas. The manner of his wins have stunned the darts world. He averaged 106.12 in a whitewash of Kist, higher than former world champion Gerwyn Price has ever managed on the same stage. And he only dropped one set to world No. 20 Gilding, showing little nerves against a vastly more experienced opponent. Guaranteeing himself at least £25,000 from the tournament, Littler bought his own kebab the second time around. \"My manager got that kebab so I'll get my own because I didn't really like it,\" he told Sky Sports. \"It's trending worldwide that kebab! But I think it's another kebab.\"","pubDate":"2023-12-23 12:47:07","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31723190.ece/ALTERNATES/s98/2_JS320058636.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"abb999b42e59186baf505ba076303dfc","title":"NFL picks: Are we looking at a Super Bowl preview Christmas Day between Ravens and 49ers?","link":"https://www.denverpost.com/2023/12/23/nfl-picks-week-16-football/","keywords":["Denver Broncos","Latest Headlines","NFL","Sports","Aaron Rodgers","Baker Mayfield","Case Keenum","Christian McCaffrey","Drew Lock","Gardner Minshew","Joe Flacco","Justin Herbert","Kyle Shanahan","More Broncos News","Patrick Mahomes","Russell Wilson","Tim Patrick","Trevor Lawrence"],"creator":["Parker Gabriel"],"video_url":null,"description":"NFL beat writer Parker Gabriel takes a look around the league heading into Week 16, including Baltimore at San Francisco.","content":"There are so many teams bunched up for playoff positioning, from three entering Sunday tied at 8-6 atop the AFC South to the seven teams entering the weekend with either seven or eight wins. At this point, it’s tough to know which way is up. But this will be a big weekend for clarity. Some way or another, at least a team or two rolling with a backup quarterback is going to make it to the postseason. Joe Flacco in Cleveland, Case Keenum in Houston, Jake Browning in Cincinnati, Gardner Minshew in Indianapolis. Then, can any of them win there? There’s a long way to go before the full scale of a potentially wild NFL coaching carousel is known this year. One thing’s for sure: There will be new brass for the Chargers, who are in the market for a coaching staff and a general manager. The conventional wisdom is that Justin Herbert’s presence makes L.A. the best job on the market, regardless of what else comes open. And, to be sure, coaches would all line up to work with him. But the rest of the picture is an aging, expensive roster with a pretty brutal salary cap picture going forward. So, is the tantalizing signal-caller enough to offset the rest? For somebody, obviously, it will be. But whether the Chargers are the pick of the coaching litter seems far from a certainty. And in the most shocking news of the NFL season, Aaron Rodgers is actually not returning from a torn Achilles tendon in three months. Who could have guessed? It does, of course, boggle the mind a bit to see Rodgers and others, too — including the Broncos’ Tim Patrick — rebound so quickly from Achilles tears thanks to new surgical procedures. That’s a good thing for athletes in the future. Speaking of good things and futures, what’s the likelihood that Rodgers’ full-throated endorsement of the Jets’ coaching apparatus looks wise a year from now? Dallas spent five weeks riding high, scoring 33-plus in five straight wins. Then Mike McCarthy’s team got thrown off the bull hard in a 31-10 beatdown at Buffalo on Sunday night. They’re going to get tested the next two weeks, too, against Miami and Detroit, before closing the season at Washington. They’ve locked up a playoff spot already. They’ll be talked about plenty in the coming weeks, but the only thing this group will be judged by ultimately is whether it can get the franchise past the divisional round of the playoffs for the first time since the 1995 season. No, really. Are the Birds in trouble? Philadelphia went from 10-1 to currently occupying a Wild Card spot thanks to a three-game skid started by San Francisco in the City of Brotherly Love and most recently extended by…. Drew Lock and his 92-yard touchdown drive! That’s a coast-to-coast skid, with Dallas right in the middle. Here’s the good news: There might not be a true cure for what ails the Eagles — defensive coordinator changes in December for teams with Super Bowl aspirations is not it, man — but there’s time for healing on the horizon. Philly closes with two against the Giants around a home game against Arizona. 13-4 here they come. Tough spot for Green Bay to be in this weekend. They’re clinging to slim playoff hopes after back-to-back dreadful defensive performances. Not only that, but beating Carolina this week only bolster’s arch-rival Chicago’s draft position, since the Bears have the Panthers’ first-round pick. Great work, Pack! You’ve just helped ensure you’ll be facing Caleb Williams twice a year. Funny enough, Chicago can help its own cause, too, by… losing to 3-11 Arizona. A Super Bowl preview? It wouldn’t be surprising at all at this point, given the way each team has rolled through the regular season. They do it in different ways, but both are complete teams that can scare you offensively and beat you up defensively. 49ers running back Christian McCaffrey has 1,801 offensive yards (1,292 rushing) and 20 touchdowns with three games to go this year. Seems pretty good. MVP good, come to think of it. He’ll be a key in Kyle Shanahan’s team getting it done as a 5.5-point home favorite. 49ers 27, Ravens 23 Antonio Pierce deserves a lot of credit for the work he’s done as the Raiders’ interim coach. Las Vegas has been a salty defense over the past few weeks and players seem to be committed to playing hard for him. But beating Patrick Mahomes and company would be a tall order. The Chiefs have their own issues, but they’re still in the hunt (albeit as major underdogs) for the No. 1 seed and they can wrap up a division title with either a Broncos loss Sunday or with a win as a 10-point home favorite on Christmas Day Chiefs 30, Raiders 13 Baker Mayfield and the Bucs put on an absolute clinic last week, torching Green Bay for 381 yards, four touchdowns and a perfect 158.3 passer rating at Lambeau Field. Hello. Mayfield’s had a pretty good year — his 3,315 yards, 24 TDs, eight INTs and 94.7 rating looks a little bit Russell Wilson-ish — and Tampa’s right in the mix for the mediocre-but-wide-open NFC South. Even still, Jacksonville needs the win just as much as it enters play in a three-way tie for the AFC South. As long as Trevor Lawrence plays to his normal standard after a concussion last week, the Jags should find a way to get the job done as a one-point road underdog across the Panhandle. Jaguars 24, Buccaneers 23","pubDate":"2023-12-23 12:45:27","image_url":"https://www.denverpost.com/wp-content/uploads/2023/11/AP23313047037165.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"054db47158e6019974d02258d78441b0","title":"Festivus 2023: The airing of grievances, sports edition","link":"https://www.denverpost.com/2023/12/23/festivus-airing-of-grievances-sports-edition-2023/","keywords":["Latest Headlines","Sports","AT&T SportsNet","Augusta National","baseball","Baseball Hall of Fame","basketball","Charlie Blackmon","college football","Coors Field","CU Buffs","Deion Sanders","Dick Monfort","golf","holidays","MLB All-Star Game","Shannon Sharpe","Todd Helton"],"creator":["Jeff Bailey"],"video_url":null,"description":"We will start by paying our respect to the classic TV show Seinfeld with my favorite tradition, the \"airing of grievances.\"","content":"Festivus is back! And with my aluminum pole, with a high strength-to-weight ratio, now pulled out of the crawl space we are ready for a tinsel-free Festivus miracle. Another year has come and gone in the sports world, memories were made, champions were crowned and over the past 12 months, my basket was filled with content for this year’s piece. We will start by paying our respect to the classic TV show Seinfeld with my favorite tradition, the “airing of grievances.” I have a lot of problems with teams, commissioners, fans, owners, players, rules and mascots. And now, you’re gonna hear about it. Here are all the ways the sports world has disappointed me over the past year: Is this really the best the Rockies could do in the mascot department? Time to make a trade my friends, I’ll take another pantless mascot in Clark from the Chicago Cubs all day. I thought Colorado letting Charlie Blackmon rob Monfort and Co. of was bad, but having Dinger on a contract that won’t end takes the cake. The 2023 class was filled with talent and real hall of famers. But again, the writers dropped the ball and left out some truly deserving players. It was nice to finally see the “Crime Dog” Fred McGriff get the call to Cooperstown. Still not sure why a guy with 493 homers and one of the most feared hitters of the 1990s had to wait for the Contemporary Baseball Era Players Committee to get in. Scott Rolen also got the call he was headed to Cooperstown, but I would argue he shouldn’t get in before other deserving guys. I mean, Rolen only had 316 home runs and 2077 hits. Whereas, Jeff Kent and Todd Helton were better players with stats on the back of their baseball cards to prove it. Kent finished with 2461 hits and 377 homers (most all-time for second base), and a .290 batting average. Helton tallied 2519 hits, 369 homer while hitting .316 for his career. Those are just a few stats to make my point. Sharpe got into a courtside yelling match at a Lakers game with Grizzlies’ Ja Morant. It is laughable how a grown man jumps onto the court and makes a huge scene that is all about him being a tough guy. Anyone else pulls that stunt sitting on the hardwood at an arena would have been ejected from the complex. All we got was a “I’ve preached for the last six and a half years responsibility and accountability, and I take full responsibility for what transpired,” Sharpe said. “I’m never gonna say that wasn’t Shannon Sharpe because that was me. That was just me getting out of character. And I’m sorry for all those who saw my actions and took offense to my actions.” Good lord, no emotional impulse control mixed with no common sense. Doesn't realize he should be absolutely embarrassed. This is similar to Juwan Howard slapping a coach and not realizing for a week he did anything wrong. A regular fan gets permanently banned for this behavior. — Jason Whitlock (@WhitlockJason) Have a feeling Manfred will be on this list yearly until his time in MLB is done. He keeps adding to the list with new rules that aren’t improving the game. The pitch clock and extra innings are at the top of my list. Baseball was never intended to be a timed clock sport, if that’s your jam head over to Dick’s Sporting Goods Park and watch the Rapids. Baseball is a classic game purists love. I enjoy the experience of going to the ballyard and not having anywhere to be. The other change was extra innings with the California tiebreaker rule when starting with a runner starting on second base. If you don’t want to play free baseball, win it in nine. Gone are the thrilling 15-inning games where a bench runs low the teams have to claw out a win. I’m an old-school guy and happy I worked in professional ball back when the game was played the right way. I miss throwing inside, sliding hard into bags/taking guys out and pitchers wanting to go 7-8 innings a start… none of this quality four innings junk. Yes, looking at your Kyle Freehand. Would love to hear a manager tell the likes of Gibson, Koufax, Palmer, Gooden, Hershiser, Clemens, Maddux and other greats to give us a solid five. And while you’re giving us that quality start, you can’t throw inside. Players today are soft. This is tough to hear… would not fly in the old days! Unfortunately this is how players are being taught with modern analytics…. What are y’all’s thoughts? — Roger Clemens (@rogerclemens) Golf Aurora and other courses that charge full-price green fees in winter months. I have heard it is because they don’t want to devalue the course. Well, I have news for those folks… it isn’t devaluing the course. A lot of high-end courses have seasonal rates. Golfers will agree, a dormant course in winter months shouldn’t be charging premium green fees. Will give a tip of the cap to the superintendents who work countless hours keeping a course in tip-top shape. With , it’s unsure who will broadcast Rockies games in 2024. The change may be a good thing in the end, as many fans feel the this area needed an overhaul. There are only so many Supermo references, or clinics a guy can give during a broadcast. Baseball fans are knowledgeable, and don’t need seven people contributing during a game in and around the booth. It would be a breath of fresh air for some new talent to take the reins in 2024. Player might be a three-time Masters champion, but that doesn’t give him the right to trash its members or course. about not being able to get tee times at Augusta National is one of the main reasons he isn’t invited more often. It could also have to do something with his son being for promoting golf balls during the opening tee shots in 2021… yes Player has won the Masters, but the traditions and way the club operates are what makes Augusta National a special place. I will give Player some advice, stop running your mouth about how . It’s not just another course, it is what we golfers consider hallowed grounds. We had this on the list last season, and it still rings true today. The only difference this year is agrees with us and thinks the 8 p.m. game times being bad for all involved. “Who makes these 8 o’clock games? Dumbest thing ever. Stupidest thing ever invented in life. Who wants to stay up until 8 o’clock for a darn game?” on his weekly radio show. “What about the East Coast — do they even care about ratings? Is anyone watching it? What are we supposed to do with the kids all day until 8 o’clock? What are we supposed to do in the hotel?” To all the media outlets and local journalists openly rooting over the top for Avs/Nuggets and Buffs on social media during the postseason runs must have forgotten that they are journalists who are supposed to be impartial and report the news. If you want to be a fan and pumped after the fact I’m all for it… to all my coworkers who are beat reporters, I applaud you for how you run your beats. Y’all are professionals and I’m happy to work with ya. Home run derby pitchers need to start throwing back at the bottom of the mound, go back to 10 outs and stop with the rapid-fire pitches. The biggest change had to do with the uniforms. The ASG needs to go back to having players wear team uniforms. It made the game special seeing players in the home and away unis… baseball has lost its way over the years. This one is for all the players who decide they are special and need to hit in the lesson area at the driving range. Those lesson grounds are for people who are paying a golf professional to give them a private lesson. And what comes with that is an area of more lush grounds to hit balls from. It’s one of the perks of paying for a private lesson at a course. So next time you decide to hit a bucket of balls from the lesson grounds, just know the golf gods are looking down upon you with shanks and slices coming your way during your next round of golf. Coors Field is Wrigley West when the Cubs come to town. Monfort should be ashamed of the culture the Rockies have created around 20th and Blake. Saying his team will be a .500 ball club, striving to be average and then losing 103 games. How do you lose 100-plus games and not fire anyone? But hey, at least when the Cubs come to town a packed house at Coors is a given. The oven mitts these guys are wearing are a laughable joke. Players from years past are laughing at these guys… they aren’t about player safety. They are about getting an extra six inches closer to sliding safe into bags. Mr. “I hate baseball” Manfred won’t do anything about it, but clubhouse attendants across baseball need to throw these things in the trash where they belong. All those California teams going to the ACC is pure comedy. Did those educated school presidents forget what the ACC stands for? I’ll give them the answer, Atlantic Coast Conference. Everyone knows NIL and the massive power conferences is all about football and broadcast money. Other sports are going to feel the pain here. I feel bad for the normal student-athlete who has to deal with the brutal travel schedule. Never thought I would see the day when players are staying in college longer and would rather go to class than make the jump to the professional ranks. Amazing what a few million dollars will make a student-athlete do. We aren’t done here folks, it will continue to blow up in NCAA’s faces in 2024. Big hits in football are not allowed anymore, even the legal ones. Football has become so soft, at the sight of a big hit the laundry starts flying. The league needs to get back to some form of football or it will all turn into a glorified flag football league. And if you are going to have the FFL, you might hire Manfred as your commissioner since he has a thing for destroying legacy and creating unnecessary rules. As Festivus rolls on, we come to the feats of strength. As we have no room currently in the newsroom for such wrestling activities, I’ll leave ya with something relaxing you can enjoy: The Butler Cabin Yule log from Augusta National. Vic Carapazza just informed the Reds dugout, it seems, that the second inning is not the time for the Cincy bullpen guys to go on an Eagle Scout adventure through the trees beyond CF. — Parker Gabriel (@ParkerJGabriel)","pubDate":"2023-12-23 12:45:10","image_url":"https://www.denverpost.com/wp-content/uploads/2016/12/festivus-pole.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"9542143a743d3a6c799eb2145d1fe2c3","title":"Mercato - PSG : 20M€ lâchés, la première recrue hivernale est annoncée","link":"https://le10sport.com/football/mercato/mercato-psg-20meur-laches-la-premiere-recrue-hivernale-est-annoncee-676791","keywords":null,"creator":null,"video_url":null,"description":"Alors que Presnel Kimpembe n’est finalement pas prêt de rejouer avec le PSG, le club de la capitale s’est mis en quête d’un renfort en défense centrale. Et finalement, Paris va trouver son bonheur du…","content":"Alors que Presnel Kimpembe n’est finalement pas prêt de rejouer avec le PSG, le club de la capitale s’est mis en quête d’un renfort en défense centrale. Et finalement, Paris va trouver son bonheur du côté du Brésil. Ces derniers jours, le dossier Lucas Beraldo avait été révélé. Et voilà que le transfert du Brésilien de Sao Paulo au PSG serait bouclé. Cet hiver, le PSG va prendre l’accent brésilien. Souhaitant apporter quelques retouches à l’effectif de Luis Enrique et répondre aux besoins de l’entraîneur espagnol, Luis Campos est parti piocher au Brésil. Alors que Gabriel Moscardo doit arriver de Corinthians, le premier à rejoindre le PSG devrait être Lucas Beraldo ( Sao Paulo ). Mercato - PSG : C’est terminé pour ce flop du projet QSI ? https://t.co/c3ECkqN5QE pic.twitter.com/qbejZfPazb Le mercato hivernal n’a pas encore officiellement ouvert ses portes, mais le PSG tiendrait déjà sa première recrue de janvier. En effet, ce samedi, Fabrizio Romano a sorti son traditionnel « Here we go » pour annoncer la venue du Brésilien à Paris. Un accord verbal aurait été trouvé entre les différentes parties et désormais, Sao Paulo et le PSG prépareraient les derniers documents pour boucler l’affaire à 100%. De son côté, Beraldo patiente dans l’attente de sa visite médicale. Le PSG va donc accueillir Lucas Beraldo dans les prochains jours. Pour cela, le club de la capitale a dû sortir le carnet de chèques pour parvenir à un accord avec Sao Paulo . Et finalement, selon le journaliste italien, l’accord de Beraldo porterait sur un montant de 20M€, sans bonus.","pubDate":"2023-12-23 12:45:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225327.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"9e2b76af13110880ee12c60f105399b9","title":"‘Scared’ Rodri was ‘close to tears’ after ‘one of the worst tackles of his career’ in Manchester City win","link":"https://talksport.com/football/1689133/rodri-tears-worst-tackle-man-city/","keywords":["Football","Premier League"],"creator":["Robert Calcutt"],"video_url":null,"description":null,"content":"Rodri admits he is a 'very lucky' man after the Manchester City star was able to avoid serious injury following a Fluminense player's tackle. The Spaniard featured in City's 4-0 win in the Club World Cup final against the Brazilian side on Friday, their fifth trophy lift of the year. During the second-half, Rodri was on the receiving end of a strong challenge from Alexsander and went down in pain. He was able to resume play but hit the turf once again, with Pep Guardiola then substituting him for Manuel Akani amid injury fears. Despite the initial worries, Rodri insists that he is fine to play but is counting his lucky stars that nothing serious happened to him. Speaking to Sky Sports after City won the Club World Cup, he said: \"I was very lucky today to be honest. \"I think it was one of the worst tackles in my career. It was so scary because I felt my knee but fortunately it was nothing and I said to the player, 'You cannot do these kind of actions.' \"Today I won more than a trophy, I go home safe but to be honest I was very close to crying because I felt very, very worried about what happened, but it's nothing.\" He was asked if he will be fit to play their next match against Everton on Wednesday and insisted: \"Yeah yeah. \"I have pain because it was very dramatic, the way it goes, but nothing affected.\" Rodri's confidence in his fitness will be music to the ears of City fans, with the 27-year-old integral to Pep Guardiola's side. They're unbeaten in the last 47 matches across all competitions in which last season's Champions League final hero has started. As well as this, City's three Premier League defeats this season have come when Rodri was absent from the side due to suspension. Guardiola will be hoping he can rely on his fellow Spaniard's fitness for the rest of the campaign, which could end with five trophies won.","pubDate":"2023-12-23 12:40:30","image_url":"https://talksport.com/wp-content/uploads/sites/5/2023/12/rodri-manchester-city-reacts-tackle-867871963.jpg?strip=all&w=960","source_id":"talksport","source_priority":4624,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e4d14aeca2b5d3de1da4260e6d7c3ff9","title":"Νέα Σαλαμίνα-Ανόρθωση: Το Βαρωσιώτικο ντέρμπι στο οποίο η καρδιά «σπαράζει»","link":"https://www.gazzetta.gr/football/protathlima-cyta/2287482/nea-salamina-anorthosi-barosiotiko-ntermpi-sto-opoio-i-kardia","keywords":["Ποδόσφαιρο","Κύπρος","Νέα Σαλαμίνα","Πρωτάθλημα Cyta","Ανόρθωση Αμμοχώστου","Πάνος Λάρκος"],"creator":null,"video_url":null,"description":"Νέα Σαλαμίνα-Ανόρθωση ή Ανόρθωση-Νέα Σαλαμίνα. Ένα ντέρμπι που δεν έχει καμία σχέση με κανένα άλλο. Ένα ντέρμπι όπου η καρδιά ματώνει, πονάει, διαλύεται, ραγίζει και «σπάζει» σε χίλια κομμάτια. Ένα ντέρμπι μακριά από την φυσική έδρα των δυο ομάδων, την θαλασσοφίλητη Αμμόχωστο.","content":"Ένα ντέρμπι όπου για μισό περίπου αιώνα δεν διεξάγεται στις πραγματικές του ρίζες, το ΓΣΕ και το Βαρώσι μετά τη βάρβαρη τουρκική εισβολή. Ένα ντέρμπι όπου οι παλιοί θυμούνται και διδάσκουν στους νέους την ιστορία και τις ρίζες τους, αλλά και τον μεγάλο πόθο για επιστροφή εκεί όπου μεγάλωσαν και έκαναν όνειρα. Στην Αμμόχωστο… Τόσο η Ανόρθωση όσο και η Νέα Σαλαμίνα για 49 χρόνια αποτελούν δυο πυλώνες αντίστασης. Αντίστασης στο να ξεχάσει η νέα γενιά τις ρίζες της και την Αμμόχωστο . Την ίδια ώρα όπου οι πολιτικοί δεν μπορούν να κουνήσουν το δαχτυλάκι τους για να βρεθεί μία λύση στο κυπριακό, οι δυο ομάδες της Αμμοχώστου έχουν καταφέρει να μείνουν όρθιες μέσα από δύσκολες συνθήκες και ταυτόχρονα μεταλαμπαδεύουν από γενιά σε γενιά τα ιδανικά των ομάδων τους αλλά και της Αμμοχώστου. Το να βλέπεις μικρά παιδιά να δακρύζουν ακούγοντας για την Αμμόχωστο αυτό δεν είναι έργο καμία κυβέρνησης, ούτε κάποιου πολιτικού προσώπου. Είναι καθαρά επίτευγμα του ποδοσφαίρου, της Ανόρθωσης και της Νέας Σαλαμίνας . Δυο προσφυγικά σωματεία που δίνουν το είναι τους για να μπορούν να συνεχίζουν να πρεσβεύουν τα ιδανικά και τις αξίες τους μακριά από τις ρίζες τους. Δίνουν την ψυχή τους για να μην ξεχάσει κανείς ότι κάποια μέρα πρέπει να επιστρέψει ο κόσμος στις ρίζες του. Κόντρα στις αντιξοότητες τα καταφέρνουν και δημιουργούν νέες γενιές που ζουν και αναπνέουν για επιστροφή στην Αμμόχωστο. Κι ας μην αντίκρισαν ποτέ την πόλη, κι ας μην ακούμπησαν ποτέ στην χρυσή αμμουδιά της Αμμοχώστου. Ξέρουν ότι έχουν ένα ιερό καθήκον. Το οποίο δεν είναι άλλο από το να μείνει η φλόγα ζωντανή και αναμμένη μέχρι την άγια ώρα της επιστροφής στην Αμμόχωστο . Μέχρι τότε οι δυο ομάδες θα αποτελούν σημείο αναφοράς και φάρο σε κάθε προσπάθεια, σε κάθε όνειρο, σε κάθε επιθυμία, σε κάθε καρδιά που έχει ραγίσει εδώ και 49 χρόνια… Υ.Γ. Η κεντρική φωτογραφία είναι από τον αγώνα ανάμεσα στις δυο ομάδες στο γήπεδο «Αμμόχωστος-Επιστροφή», έδρα της Νέας Σαλαμίνας , όπου ο Δήμος της Αμμοχώστου τύπωσε και στις δυο κερκίδες πλακάτ με το σύνθημα «Αμμόχωστος, θέλω την πόλη μου, το σπίτι μου». Σύνθημα ζωής πλέον για χιλιάδες Αμμοχωστιανούς…","pubDate":"2023-12-23 12:39:18","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"f5d8c38b1660014cba2e2082788400ad","title":"Football : Thomas Meunier révèle le montant de l'amende reçu par les joueurs de Dortmund pour chaque gramme pris pendant les fêtes","link":"https://www.ladepeche.fr/2023/12/23/football-thomas-meunier-revele-le-montant-de-lamende-recu-par-les-joueurs-de-dortmund-pour-chaque-gramme-pris-pendant-les-fetes-11660756.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Le Borussia Dortmund n'y va pas de main morte avec ses joueurs. Pour limiter la surcharge pondérale des joueurs au retour de la trêve hivernale le club allemand a déjà prévu des sanctions révèle l'arrière droit belge...","content":"Les excès des joueurs de Borussia Dortmund pendant les fêtes pourraient leur coûter très très cher. Le club allemand, adversaire du PSG en phase de poules de Ligue des champions, a décidé de se montrer strict cette année. Ils ont donc mis en place une réglementation précise pour dissuader les joueurs de trop manger à Noël et au Nouvel an révèle l'ancien latéral droit du Paris-Saint-Germain, Thomas Meunier. Une addition salée Chaque gramme sera compté précise l'international belge sur la RTBF : \"Nous avons été pesés lors du dernier entraînement et ce sera fait à la reprise\" ; \" Le tarif est connu : une amende de 1000 euros est prévue par kilo pris puis, à partir d'un certain palier, on passe à 1000 euros... les 100 grammes\". Et il semble que certains n'aient pas pris la mesure de cette sanction, le belge de 32 ans n'a lui jamais était inquiété mais ce n'est pas le cas de certains de ces coéquipiers : \" Sans balancer de nom, j'en connais un qui en était à 10 000 euros. On lui a dit : ' Tu as une semaine et si tu perds les kilos, on diminue l'amende' ... et il y est parvenu ! \" a raconté le Diable Rouge.","pubDate":"2023-12-23 12:37:03","image_url":"https://images.ladepeche.fr/api/v1/images/view/6586d43093ccd12a9414c5aa/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"23dc7bbcbfb0ae23029999081be978bc","title":"Sheffield Wednesday v Cardiff City live: Kick-off time, team news and score updates","link":"https://www.walesonline.co.uk/sport/football/football-news/sheffield-wednesday-v-cardiff-city-28342302","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Glen Williams)"],"video_url":null,"description":"The Bluebirds head to Yorkshire to take on the Owls","content":"Cardiff City take on Sheffield Wednesday today in the last instalment of Championship action before Christmas. The Bluebirds head into the game on the back of some poor form, having lost four of their last five matches. After a really positive start to the campaign, there is a danger of this run fizzling out mid-season, but Erol Bulut is desperate to get his side into the January transfer window without losing any more ground. The Owls are resurgent under new manager Danny Rohl and will prove a difficult test this afternoon. As ever, we will have all the live updates for you from Hillsborough. Kick-off is at 3pm . Sign up to our Cardiff City newsletter here Scroll down for live updates... READ MORE: Cardiff City fan jury - Transfer demands, 'dream' signings and tying Erol Bulut down WHATSAPP: For the latest Bluebirds stories delivered straight to your phone, join the Cardiff City WhatsApp here 12:40 Glen Williams Welcome! Hello and welcome to our live coverage from Hillsborough. Stick with us for all the build-up, team news and live match action from Yorkshire. Share Comments","pubDate":"2023-12-23 12:36:00","image_url":"https://i2-prod.walesonline.co.uk/incoming/article20323522.ece/ALTERNATES/s615/1_blogpic1.jpg","source_id":"walesonline","source_priority":16103,"country":["united kingdom"],"category":["sports"],"language":"english"}]}