{"newsArray":[{"title":"Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly","link":"https://www.dailymail.co.uk/sport/live/article-12355725/Man-United-News-LIVE-Mason-Greenwoods-future-decided-ahead-new-season-Andre-Onana-FUMES-Harry-Maguire-mistake-pre-season-friendly.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Hello and welcome to Mail Sport's live blog with all the latest news and developments regarding Manchester United.","content":"LIVE Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly By Adrian Bishop For Mailonline Updated: 14:29 BST, 31 July 2023 e-mail 10 View comments Hello and welcome to Mail Sport's live blog with all the latest news and developments regarding Manchester United. Adrian Bishop Host commentator 14:29 Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe Sheffield United boss Paul Heckingbottom has been in talks with former Manchester United defender Axel Tuanzebe. The newly-promoted Premier League side have also opened talks with Arsenal for defender Auston Trusty. The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham City last season and, as Confidential readers will know, was a target for Rangers earlier this summer. Click below to read more: Sheffield United targeting moves for Axel Tuanzebe and Auston Trusty SIMON JONES: The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham last season and, was a target for Rangers this summer. Mail Online 13:19 Erik ten Hag plays down Man United's title credentials already and claims only champions City can be considered contenders in pre-season Erik ten Hag admits that Manchester United cannot look at themselves as Premier League title contenders yet. United are set to take their summer spending to £179million on Rasmus Hojlund , Mason Mount and Andre Onana as they bid to close the gap on champions Manchester City. But Ten Hag believes that City’s dominance under Pep Guardiola means they are the only team that can go into the new campaign talking up their title hopes, while United have to focus on the top-four battle. Click below to read more: Erik ten Hag plays down Man United's title credentials already CHRIS WHEELER IN LAS VEGAS: United are set to take their summer spending to £179m on Rasmus Hojlund, Mason Mount and Andre Onana as they bid to close the gap on Manchester City. Mail Online 12:41 ERIK TEN HAG INTERVIEW: Man United's boss on transforming the culture at Old Trafford Before Manchester United wrapped up their summer tour of the US with a 3-2 defeat to Borussia Dortmund in Las Vegas in the early hours of Monday morning, manager Erik ten Hag sat down with Mail Sport to discuss his first year at Old Trafford and the new season ahead. Speaking at United's training base at the University of California in San Diego, Ten Hag spoke about a wide range of topics including the new regime he has imposed at the club and his hopes of closing the gap on Manchester City . Click below to read Chris Wheeler's interview with the United manager: Erik ten Hag interview ahead of second Man United season CHRIS WHEELER IN LAS VEGAS: Ten Hag spoke about a wide range of topics including the new regime he has imposed at the club and his hopes of closing the gap to City. Mail Online 12:19 Former Manchester United defender Jaap Stam urges Antony to 'step up a gear' Former Manchester United defender Jaap Stam has called on Antony to improve after a disappointing debut season in the Premier league. The Brazilian winger joined the Red Devils from Ajax for £85.5million last summer but failed to live up to high expectations. Stam believes Antony has the skill set to be a success at Old Trafford but needs to 'step up a gear' and become less predictable in the upcoming new season. Click below to read more: Former Man United defender Jaap Stam urges Antony to 'step up a gear' The Brazilian winger joined the Red Devils from Ajax for £85.5million last summer but failed to live up to high expectations, scoring eight goals in 44 matches across all competitions. Mail Online 11:34 Francis Ngannou claims he is Man United's 'favourite heavyweight boxer' as he teases Tyson Fury Francis Ngannou has claimed that he is ' Manchester United 's favourite heavyweight boxer'. The former UFC fighter, who is set to do battle with known United fan Tyson Fury in October , was present as Erik ten Hag's side succumbed to a 3-2 defeat to Borussia Dortmund in Las Vegas on Sunday. And it was a disappointing performance from United , with the Dutch manager blasting his team after the game for an 'unforgivable' capitulation, which is notably their third pre-season loss on the bounce in the US. Click below to read more: Francis Ngannou says he is Man United's 'favourite heavyweight boxer' The former UFC fighter, who is set to do battle with known United fan Tyson Fury in October , was present as Erik ten Hag's side succumbed to a 3-2 defeat to Borussia Dortmund in Las Vegas. Mail Online 11:00 FIVE THINGS WE LEARNED from Man Utd's 3-2 defeat to Borussia Dortmund Manchester United were beaten 3-2 by Borussia Dortmund in Las Vegas on Sunday night but there were some valuable lessons for manager Erik ten Hag. Diogo Dalot gave United the lead with a great strike from distance in the first half but a quickfire double from Donyell Malen gave Dortmud the lead at half-time. Antony got the scores level shortly after the interval but Youssoufa Moukoko's 71st minute strike proved to be decisive. Click below to read more: FIVE THINGS WE LEARNED from Man Utd's 3-2 defeat to Borussia Dortmund Mail Sport's CHRIS WHEELER was on hand with the Manchester United talking points from the game in Las Vegas... Mail Online 10:28 Man United boss Erik ten Hag warns Omari Forson after pre-season flare-up Erik ten Hag told Manchester United's teenage winger Omari Forson that he would have been sent off against Borussia Dortmund in Las Vegas if there was VAR at the game. Ten Hag substituted Forson 38 minutes into United's 3-2 defeat to the Bundesliga side at the Allegiant Stadium after he was involved in a flare-up with defender Julian Ryerson. Forson kicked out angrily at Ryerson and was then booked for squaring up to Karim Adeyemi who stepped in to defend his team-mate. Click below to read more: Man United boss Erik ten Hag warns Omari Forson after flare-up CHRIS WHEELER IN LAS VEGAS: Ten Hag substituted Forson 38 minutes into United's 3-2 defeat at the Allegiant Stadium after he was involved in a flare-up. Mail Online 10:07 Man United keeper Andre Onana FUMES at Harry Maguire Andre Onana has the potential to transform the way Manchester United play their football with his abilities on the ball at the back. But there were always going to be some teething problems as the new £47million goalkeeper gets accustomed to those in front of him. It was Harry Maguire who bore the brunt of Onana's frustration after a sloppy pass almost gifted Borussia Dortmund a goal in United's friendly in Las Vegas on Sunday night. Click below to read more: Man United keeper Andre Onana FUMES at Harry Maguire Harry Maguire who bore the brunt of Onana's frustration after a sloppy pass almost gifted Borussia Dortmund a goal in United's friendly in Las Vegas on Sunday night. Mail Online 09:48 Christian Eriksen hails 'strong No 9' Rasmus Hojlund after Man United move Christian Eriksen says Manchester United are getting a powerful striker by signing his Denmark teammate Rasmus Hojlund . Hojlund is set to complete his move to Old Trafford from Atalanta after the two clubs struck a deal worth £72million in total and the 20-year old agreed personal terms over a five-year contract. Hojlund still has to complete a medical while United tie up the loose ends of the deal with Atalanta , but he could feasibly play for Erik ten Hag 's side in Saturday's friendly against Lens at Old Trafford or Athletic Bilbao in Dublin 24 hours later. Click below to read more: Eriksen hails 'strong No 9' Rasmus Hojlund after Man United move CHRIS WHEELER IN LAS VEGAS: Hojlund is set to complete his move to Old Trafford from Atalanta after the two clubs struck a deal worth £72million in total. Mail Online 09:33 Manchester United land the biggest kit deal in Premier League HISTORY Manchester United have secured the biggest kit deal in Premier League history after announcing a new 10-year partnership with adidas worth £900million. The new deal extends United’s tie up with the German sportswear giant as their official kit supplier until 2035 and guarantees a significant increase on the current terms, earning the club £90m-per-year. United sources say the deal gives them certainty around the biggest source of revenue for the next decade, reinforcing the stability of the club. Click below to read more: Manchester United land the biggest kit deal in Premier League HISTORY Manchester United have extended their long-term partnership with adidas until 2035 in a deal worth an estimated £900million. Mail Online 09:23 Manchester United to decide Mason Greenwood's future ahead of the new Premier League season Manchester United 's decision over Mason Greenwood 's future is imminent with the club set to make an announcement before the start of the new Premier League season. United have been conducting an internal investigation for the last six months since the Crown Prosecution Service confirmed at the start of February that it was dropping charges of attempted rape and assault against the 21-year-old. Greenwood has been suspended by United for the last 18 months following his arrest in January 2022, with the player unable to play for the club or even train with his team-mates at Carrington. Click below to read more... Manchester United to decide Mason Greenwood's future CHRIS WHEELER: Greenwood has been suspended by United for the last 18 months following his arrest in January 2022, with the player unable to play for or train with the club. Mail Online 09:21 Good morning... ...and welcome to Sportsmail's coverage of all the latest Manchester United news. We'll have all the latest updates and analysis as Erik ten Hag's side continue their pre-season preparations as July draws to a close with the return of the Premier League fast approaching. {\"id\":\"12355725\",\"channel\":\"/sport\",\"greenBox\":{\"body\":\"\"},\"pageUrl\":\"https://www.dailymail.co.uk/sport/live/article-12355725/Man-United-News-LIVE-Mason-Greenwoods-future-decided-ahead-new-season-Andre-Onana-FUMES-Harry-Maguire-mistake-pre-season-friendly.html\",\"status\":\"running\",\"lastDate\":1690810147454} Share or comment on this article: Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:29:07","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/08/73791031-0-image-a-9_1690788827798.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages","link":"https://www.dailymail.co.uk/sport/football/article-12356517/Congratulations-winning-gold-medal-Olympics-USA-legend-Alexi-Lalas-takes-brutal-swipe-Canada-dumped-World-Cup-group-stages.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"For the first time in women's football history, the reigning Olympic gold medalists have been knocked out in the Group Stages of the following World Cup.","content":"USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages Canada is out of the Women's World Cup after a humbling 4-0 defeat to Australia Lalas - ever the provocateur - didn't miss an opportunity to take a dig at Canada DailyMail.com provides all the latest international sports news By Jake Fenner For Dailymail.Com Updated: 09:41 EDT, 31 July 2023 e-mail View comments For the first time in women's football history, the reigning Olympic gold medalists have been knocked out in the Group Stages of the following World Cup. Canada, who came in with the eleventh best odds to lift the trophy in Australia, lost 4-0 to hosts Australia on Monday night in Melbourne . Coupled with a Nigeria 0-0 draw against Ireland, that meant that the Super Falcons would join the hosts in the knockout stages. Canada joins three men's teams that won the Olympic gold but got knocked out in the group stages: Czechoslovakia (gold in 1980, eliminated in 1982), the Soviet Union (gold in 1988, fell in 1990) and Cameroon (won gold in 2000, knocked out in 2002). Never one to pass up on a time to mock America's rivals, former US men's national team defender Alexi Lalas took a jab at Canada - all while former CanWNT keeper Karina Leblanc was sitting on the same desk. Alexi Lalas (far right) jumped on the opportunity to provide a sly dig at Canada's misery The goals came early and often for host nation Australia, who defeated the Canadians 4-0 This loss, coupled with a Nigeria draw, means Canada are the first women's Olympic gold medal winners in history to be knocked out in the group stages of the following World Cup \"They really came out and fought. Sam Kerr did not have to play and that was exactly what they wanted.\" @RobStoneONFOX , @karinaleblanc , @CarliLloyd , and @AlexiLalas recap The Matildas emphatic victory over Canada as they go into the Round of 16 with incredible momentum! 🇦🇺 pic.twitter.com/lUBjIgsiyJ — FOX Soccer (@FOXSoccer) July 31, 2023 Lalas likened the tournament to a game of musical chairs, saying, 'the music has stopped and Canada is left without a chair. Sindely, Lalas added, 'Congratulations on winning the Gold Medal at the Olympics.' Prior to that jab, Lalas gave a pretty fair review of the state of the match. 'It was... emphatic. It was an exclamation point, and now they go into the Round of 16 with incredible momentum. Out wide they were dominant, in terms of finishing they were dominant, in set pieces they were ultimately dominant. 'And so I know Karina, this probably hurts. But it may hurt a little bit less because Canada was never even in this game. Leblanc, reluctantly added, 'I would have to agree with you. I'm proudly Canadian but I tip my hats off to Australia. They deserved it, they dominated. 'I mean you talk about that left hand side [Steph] Catley, Caitlin Foord, [Hayley] Raso, like everybody did what they needed to do today except for Canada. 'And you know, its disappointing. You're coming off an Olympic win, you hope for more but I don't think there's any Canadian who watched this game or who has played the game who would say they deserved it tonight. 'The good thing is its a home country a home team one of the things you as a former player you want that, it's good for the game but yeah, that's how it ended tonight.' It's jubilation for the host nation, who managed to win the group with this victory on Monday But it's likely the end of the road at the World Cup for Canada legends Christine Sinclair (L) and Sophie Schmidt (R) - the latter of which already announced her retirement from the team A fellow person on the desk, USWNT legend Carli Lloyd praised Australia, saying they were better, 'In every aspect of the game. From start to finish, they scored early - we said it in the pre-game the team that was going to score early was the team that was most likely going to come out and win this game. 'I thought defensively they were compact they made it really difficult for Canada to go centrally. And Foord, in her more natural position out on that left hand side between her and Catley just deadly they made so much happen. Raso getting on the end of those goals, they really came out and fought and Sam Kerr did not have to play and that's exactly what they wanted.' As for Canada, this defeat marks the country's fifth Group Stage exit at a Women's World Cup - following two straight knockout stage appearances. It's the final game in a Canada uniform for one of the country's brightest stars - Sophie Schmidt and likely the last World Cup game for the world's all-time leading international goal scorer Christine Sinclair. After the match, Schmidt said, 'I don't think there's any words for how we're feeling right now. We're shook, we're disappointed.' Share or comment on this article: USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:26:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/14/73801141-0-image-a-21_1690809760706.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue","link":"https://www.dailymail.co.uk/sport/football/article-12356713/Chelsea-Brighton-Robert-Sanchez-Moises-Caicedo.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: Chelsea want Robert Sanchez and he has agreed to join. The problem will be the fee and Chelsea's ongoing talks over a deal for £105million-rated Moises Caicedo.","content":"Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue Robert Sanchez has fallen down the pecking order at Brighton in recent months The goalkeeper has been capped twice by Spain and was courted by England TRANSFER CONFIDENTIAL: Spurs line up Brennan Johnson if Harry Kane leaves By Simon Jones for MailOnline Updated: 09:25 EDT, 31 July 2023 e-mail View comments Chelsea want Brighton goalkeeper Robert Sanchez and he has agreed to join. The problem will be the fee and Chelsea's ongoing talks over a deal for £105million-rated Moises Caicedo. Sanchez has fallen out of favour with Roberto de Zerbi and wants to get away with Chelsea a perfect opportunity. Former Brighton goalkeeping coach Ben Roberts is at Chelsea and played a big part in mentoring Sanchez's development. Indeed, the 6ft 6ins shot-stopper credits his 'mental fortitude' to Roberts's influence. Though born in Spain and capped twice by them, Sanchez counts as homegrown as he has been brought up through Brighton's academy since the age of 15, and was courted by England prior to his Spain call-up. Chelsea are eyeing a move for Brighton goalkeeper Robert Sanchez (left) this summer Mauricio Pochettino is keen to strengthen in between the sticks ahead of the new season That could prove vital with Chelsea's current recruitment pattern and the fact the likes of Conor Gallagher could still depart. Chelsea have also been maintaining contact with Southampton over Romeo Lavia and Tino Livramento. Mauricio Pochettino has confirmed new signing from Rennes, Lesley Ugochukwu, should go on loan to Strasbourg with winger Angelo Gabriel expected to follow. Regardless of shared ownership rules permit only three loans allowed between clubs. They still plan to sign striker Elye Wahi from Montpellier with Strasbourg in mind so Chelsea will need to find different temporary, or permanent, homes for a number of the players they are stockpiling. Impressive midfielder Andrey Santos has interest from eight clubs, home and abroad. Share or comment on this article: Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:25:42","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73800657-0-image-a-39_1690808101799.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty","link":"https://www.dailymail.co.uk/sport/football/article-12356709/Sheffield-United-Paul-Heckingbottom-Man-United-Axel-Tuanzebe-Arsenal-Auston-Trusty.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham last season and, was a target for Rangers this summer.","content":"Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty Axel Tuanzebe, 25, was released by Manchester United at the end of 2022-23 Auston Trusty had been a target for Scottish giants Rangers earlier this summer TRANSFER CONFIDENTIAL: Spurs line up Brennan Johnson if Harry Kane leaves By Simon Jones for MailOnline Updated: 14:34 BST, 31 July 2023 e-mail View comments Sheffield United boss Paul Heckingbottom has been in talks with former Manchester United defender Axel Tuanzebe. The newly-promoted Premier League side have also opened talks with Arsenal for defender Auston Trusty. The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham City last season and, as Confidential readers will know, was a target for Rangers earlier this summer. Sheffield United are keen to get the deal for Trusty over the line, and are set to receive a financial injection from the sale of Iliman Ndiaye to Marseille for £18million. Arsenal would ideally prefer a sale for Trusty. They need to raise funds to offset their spending and appease Financial Fair Play concerns. Sheffield United have opened talks with Arsenal's Auston Trusty and are eyeing Axel Tuanzebe Paul Heckingbottom's side are back in the Premier League after a fine Championship season Arsenal are targeting Brentford keeper David Raya, but face competition from Bayern Munich They want Brentford goalkeeper David Raya but early signs are they will offer around £15m and Brentford are determined to take £30m at least. Arsenal could sell Matt Turner to help the move. The USA international is one on a long list of keepers courted by Nottingham Forest who want Dean Henderson and one other to start the season. Raya is highly regarded by Arsenal keeper coach Inaki Cana who worked with the 27-year-old at Brentford and believes he can provide Aaron Ramsdale with serious competition for the number one jersey. Bayern Munich have not totally given up on Raya but they were offering a loan with obligation and are now looking at Morocco international Yassine Bouno, or 'Bono' to his friends, of Sevilla. Share or comment on this article: Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:25:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73800011-0-image-a-9_1690808139583.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea fans convinced the Blues are signing Kylian Mbappe after hearing Enzo Fernandez's comment","link":"https://www.dailymail.co.uk/sport/football/article-12356651/Chelsea-fans-convinced-Blues-signing-Kylian-Mbappe-hearing-Enzo-Fernandezs-comment.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mail Sport reported on Sunday night that the Blues 'want to hijack Liverpool's' sensational move for the France World Cup winner.","content":"What was that, Enzo? Chelsea fans are convinced the Blues are signing Kylian Mbappe after hearing Fernandez's comment during trophy lift amid links with a sensational swoop for the PSG star Chelsea believe they may be signing Kylian Mbappe after Sunday's victory The Blues were crowned the first Premier League Summer Series champions Fans think Enzo Fernandez revealed the transfer during the celebrations By Ed Carruthers For Mailonline Updated: 09:33 EDT, 31 July 2023 e-mail 34 shares 2 View comments Chelsea fans are convinced that Enzo Fernandez may have revealed that the club are signing Kylian Mbappe, following their Premier League Summer Series victory . Mail Sport reported on Sunday night that the Blues 'want to hijack Liverpool's' sensational move for the France World Cup winner. It comes as the 24-year-old is edging closer to an exit from Paris Saint-Germain, after the club put him up for sale and left him out of their pre-season tour last week. The forward's ongoing contract saga with the Parisian outfit has soured their relationship so much so that the club are now hoping to cash in on their superstar, with Nasser Al-Khelaifi's side having accepted a jaw-dropping £259million transfer offer for the forward. It's been made clear that he does not want to join the Saudi Pro League side , with Liverpool now reportedly 'holding talks' with the Frenchman , who has 12 months remaining on his contract at the Parc des Princes. Introducing your first-ever #PLSummerSeries champions: @ChelseaFC ! 🏆 pic.twitter.com/yFWiGzXqzO — Premier League (@premierleague) July 30, 2023 Both Chelsea and Liverpool are interested in signing Kylian Mbappe (pictured) with the French superstar's future at Paris Saint-Germain very much up in the air Chelsea, meanwhile, hoisted the Premier League Summer Series title yesterday, and fans believe they over heard Enzo Fernandez (third from left) saying the Frenchman's name Chelsea, meanwhile, are also interested in signing the superstar and their fans seem to think that he could be on his way to Stamford Bridge after their Argentine midfielder was seemingly overheard to be saying his name after their 2-0 victory against Fulham on Sunday. Mauricio Pochettino's side subsequently clinched the pre-season title, having gone unbeaten in the tournament in the US, with Reece James and Thiago Silva stepping forward to lift the trophy alongside their team-mates. And just as they hoisted the cup into the air, fans believe they overheard their midfielder, Fernandez, saying Mbappe's name. 'I heard it loud and clear,' one said, while another added: 'Hearing that for the first time... What's he onto?' 'Can't wait for Boehly to offer Mbappe a 10-year contract,' one wrote. 'Proper weird thing to think of saying in the moment tbh... unless he knows something we dont,' another Twitter user added, posting a thinking-face emoji with the Tweet. Fans have been reacting on Twitter to claims that they overheard Enzo Fernandez say Mbappe's name during their trophy celebrations Pochettino has remained tight-lipped on the potential to sign Mbappe (pictured) in the past According to the Daily Record , Chelsea would be interested in signing the French forward in a player plus-cash deal. But Pochettino last week refused to confirm that his side were interested in signing Mbappe claiming that the situation was 'delicate.' 'I need to be conscious,' the manager told Sky Sports after his side's 1-1 draw against Newcastle last week. 'I cannot talk because everything that you talk is too much noise, it is a very delicate situation and it is a situation they need to fix in Paris with Kylian, Kylian with PSG 'But from our side, nothing to say. We are working in our reality, their reality is different - and they for sure have another reality. 'And from my side, nothing to say - only to support them and hope they find the best solution for both sides.' Share or comment on this article: Chelsea fans convinced the Blues are signing Kylian Mbappe after hearing Enzo Fernandez's comment e-mail 34 shares Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:22:48","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/14/73801683-0-image-a-13_1690809734847.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Saint West, 7, Freaks Out After Soccer Star Neymar Throws Him A T-Shirt After Game: Watch","link":"https://hollywoodlife.com/2023/07/31/saint-west-neymar-shirt-kim-kardashian-photos-video/","keywords":["Entertainment","Sports","Kim Kardashian","Neymar","Saint West"],"creator":["Jason Brow"],"video_url":null,"description":"First, Saint West got a selfie with Messi. Now, Kim Kardashian revealed that her eldest son scored a shirt from Neymar after watching him play in Japan – and he got to meet Cristiano Ronaldo, too!","content":"Because the July 25 friendly game between Paris Saint-Germain and Al-Nassr ended in a 0-0 draw, it’s safe to say the real winner of the match was . Saint, 7, and his mom, , were in Japan to see and the rest of PSG square off against , , and the rest of the Al-Nassr squad. “So thankful that our boys’ dreams are coming true,” Kim, 42, captioned a July 31 Instagram Gallery that showed the highlights from this trip – including when Neymar, 31, tossed a t-shirt to Saint. Saint gleefully danced in triumph after he snatched it from the air and showed it to his mom. This isn’t the first that fans have seen Saint at this game. Kim initially posted the photos to her IG story after the game, and YouTuber (aka Darren Watkins Jr.) also spotted Kim, Saint, and their crew in the stands. “Why you got that PSG [jersey] on?” Darren asked Saint, to which the young boy said, “Because I’m gonna meet Neymar first.” Saint also got to meet Ronaldo, 38, after the game – and he switched to an Al-Nassr kit before he did. Saint posed with the football legend for a photo, and Ronaldo even taught Saint a handshake that included his trademark goal celebration. On July 28, Kim from her and Saint’s trip to Miami to see Messi, 36, play his first game with Inter Miami. Along with pictures of her and Saint next to and , Kim posted some pictures of Saint hanging out with the World Cup champ. “Legendary,” Kim said of the whole experience. Kim has been for Saint. The two on Mar. 16. The @AFCStuff twitter account reposted Kim’s Instagram story, showing how Saint donned “a jersey, cheering for as he takes his penalty during the shootout against Sporting CP tonight.” While overseas for the Arsenal/Sporting match, Saint and Kim also made time to catch a PSG game, per . Shortly after that, Kim posted a photo of her son meeting Kylian Mbappé, 24, to her Instagram story. Kim also shared a clip of her son and his friend FaceTiming with Neymar. “The luckiest boys in the world,” she captioned the shot, “Facetiming [Neymar] to wish him a speedy recovery.”","pubDate":"2023-07-31 13:21:22","image_url":"https://hollywoodlife.com/wp-content/uploads/2023/07/kim-kardashian-saint-west-soccer-ftr.jpg","source_id":"hollywoodlife","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Morocco’s Benzina makes history with hijab at Women’s World Cup","link":"https://thefrontierpost.com/moroccos-benzina-makes-history-with-hijab-at-womens-world-cup-2/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"AUCKLAND (AFP): Nouhaila Benzina became the first player to wear a hijab during a Women’s World Cup game when she sported the Muslim headscarf in Morocco’s match against South Korea on Sunday. World governing body FIFA lifted its ban on footballers wearing the hijab nearly a decade ago, after previous concerns over player safety. The […]","content":"AUCKLAND (AFP): Nouhaila Benzina became the first player to wear a hijab during a Women’s World Cup game when she sported the Muslim headscarf in Morocco’s match against South Korea on Sunday. World governing body FIFA lifted its ban on footballers wearing the hijab nearly a decade ago, after previous concerns over player safety. The 25-year-old defender Benzina, who plays her club football in Morocco, ran out against South Korea in Adelaide to write her name in the history books. Benzina shared social media posts in the lead-up to the World Cup about wearing a hijab, but has not spoken to the media in Australia and New Zealand about it. She told broadcaster Al Jazeera recently it would be a proud moment. “Lots of work was done over many years, and thank God it had a positive result,” she said. “We hope to play at a high level and honour Moroccans.” Several other sports have lifted hijab bans in recent years including basketball, but it is still not allowed during official football matches in France. The Moroccan women, coached by Frenchman Reynald Pedros, are at their first Women’s World Cup on the back of a historic runners-up finish at the 2022 Women’s Africa Cup of Nations. They were thrashed 6-0 by Germany in their tournament opener, with Benzina remaining on the bench.","pubDate":"2023-07-31 13:18:05","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash","link":"https://www.dailymail.co.uk/sport/football/article-12356499/Matildas-Canada-World-Cup-Allysha-Chapman-Hayley-Raso-swearing-X-rated-outburst.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Sideline microphones have captured the disgusting spray a Canadian player delivered to Matildas hero Hayley Raso as she lay prone on the ground in Australia's 4-0 win on Monday night.","content":"Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash Matildas thrashed Canada 4-0 Substitute Canadian player was not pleased Launched foul-mouthed spray By Josh Alston For Daily Mail Australia Updated: 13:51 BST, 31 July 2023 e-mail 1 View comments Sideline microphones have captured the disgusting spray a Canadian player delivered to Matildas hero Hayley Raso as she lay prone on the ground in Australia's 4-0 win on Monday night. It was do-or-die for the two nations in the final World Cup group match in Melbourne and the home side shot out of the blocks to dominate from the outset - even as captain Sam Kerr remained benched with a calf injury . Raso was named best on ground with two clutch goals that handed Australia a place in the knockout stages and their first win over powerhouse Canada since 2008. There was plenty of feeling in the match, with the Canadians ranked seventh in the world and fancied to go deep in the tournament prior to the Matildas demolition job. Chapman was not happy with something Australian coach Tony Gustavsson and launched a mighty, foul-mouthed spray in return Raso came off second best in the content but Chapman was not willing to concede that it was her fault after the challenge With the result all but secured, Canadian player Allysha Chapman collided with Raso, with the Australian coming off second best and requiring medical attention on the pitch. Australia coach Tony Gustavsson had some words for Chapman that weren't picked up on the broadcast, and the Canadian erupted in reply. 'She f***ing jumped into me you t***!' she yelled. Commentator David Basheer said: 'Allysha Chapman looked over to Tony Gustavsson and said some pretty stern words. 'It was just a coming together, really. It wasn't Chapman's doing. 'It was just Raso's determination to win the ball.' 'I don't think there was any real malice in the challenge,' fellow commentator and former Matilda Grace Gill added. 'A coming together of bodies, Raso coming off a little worse for wear.' Gustavsson and Raso had the last laugh, sharing an embrace after the Matildas smashed Canada 4-0 to dump them out of the tournament Commentators agreed that the collision was accidental, with both players having eyes only for the ball Fans were disgusted by the tirade, especially as it occured while Raso was down and potentially injured. 'Allysha Chapman’s foul mouth and evil ways make me sick,' one fan posted. 'Look at the scoreboard, you t***. Sincerely, Australia,' replied another. 'Allysha Chapman displaying the most fight this [Canadian team] have shown this tournament,' posted a third. Oooh, langage, Allysha Chapman! 😂 — Emil (@EmilASoccer) July 31, 2023 Raso had the last laugh, though, with the Matildas topping their group for the first time in a World Cup thanks in large part to her heroics. 'Getting a tattoo of Hayley Raso’s face on my face,' one enthusiastic fan proclaimed. 'Hayley Raso. Absolute gun of a player,' posted another. 'This has been a Hayley Raso masterclass,' added another. Australia now wait on the result of the Group D clash between England and China to see who their opposition will be in the round of 16. The Matildas will now focus on emulating or bettering their quarter final appearances at the 2007, 2011 and 2015 World Cup tournaments. Share or comment on this article: Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 12:51:56","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73798997-0-image-a-8_1690806132897.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada","link":"https://www.dailymail.co.uk/sport/football/article-12355353/Matildas-player-ratings-Canada-Womens-World-Cup-Melbourne-ranked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In an display that was light years ahead of their effort in the shock loss to Nigeria last week, the Matildas were dominant from the first whistle to the last against Canada.","content":"Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada Aussies dominant from the outset in 4-0 win Hayley Raso named best on ground with two goals Mary Fowler also among home team's best By Kristy Williams For Daily Mail Australia Updated: 13:56 BST, 31 July 2023 e-mail View comments The Matildas were dominant against Canada from start to finish despite the crushing pressure of knowing their home World Cup would have been over if they'd lost in Melbourne following their shock defeat to Nigeria last Thursday. Hayley Raso scored a double, Mary Fowler should have had two herself but had one controversially ruled offside by the VAR, and stand-in skipper Steph Catley put an exclamation point on proceedings with a late penalty. It was the biggest win by a Matildas side at any World Cup - and even better, the Aussies were so firmly in control that injured superstar Sam Kerr never had to be called on. Here's how Daily Mail Australia rated the home team... Mackenzie Arnold: 8.5 Made a few poor errors last game that may have dented the confidence, but 'Macca' was back at her best in this match, pulling off a couple of crucial saves but also returning to the brilliant distributor she had been. Ellie Carpenter: 6 Brilliant to see the Lyon star at least back to some decent form. She is such a talented player - one of the best in the world - but where has that spark gone? Carpenter was determined to defend better than the diabolical Nigeria match, and she certainly did that, but Aussies want to see the superstar they fell in love with. Clare Hunt: 8.5 The girl from the tiny town of Grenfell (NSW), was mammoth. Not many better players on the field than Hunt, who has well and truly played Kennedy and Polkinhorne out of the first-choice CB spot. The challenges she won, the time she won them and the distribution she afforded those ahead of her were phenomenal. She won't want the attention but she was as important as any Aussie player. Alanna Kennedy: 6.5 Many expected her to concede her place to Clare Polkinghorne, but Gustavsson picked his most talented centre back. While she didn't reach the heights of a brilliant game against Ireland, she was calmer than the Ireland match and despite a few passing errors she was Steph Catley: 8.5 Goodness, has the stand-in skipper stood up or what? Faded, as expected given the state of the match, as the game went on but the Arsenal jet was at her lethal best down the left - setting up the opening goal with an exquisite touch. Then came the defensive grunt - she was strong. Hayley Raso: 9 Hang it in the Louvre. The fan favourite celebrating a goal that sent the entire nation nuts to open the scoring was one thing - but the new Real Madrid signee kept showing her new Galactico club why they brought her in. Relentless as always but her positioning and nous were brilliant, and she seemed to regain confidence and composure with her first touch, and the fact she, yet again, often finished behind Carpenter showed how hard she worked. Katrina Gorry: 7 Not the workhorse's greatest match, with a fair few very, heavy touches, but the side is so much better for her in it, regardless. Looks to be very sore, and will be more crucial than Sam Kerr when it comes to the playoffs. Worked herself sore, and chased every mistake. Kyra Cooney-Cross: 7.5 A brilliant distributor, Gorry might have been the side's most important passer, but this Young Matilda has been sensational. Did she get found out? Don't think so. She never looks flustered, but has a better touch than her veteran counterpart. Emily Van Egmond: 6 Flirted between centre midfield and forwards, and wasn't much of an influence in either. But she certainly didn't let anyone down, despite not posing much of a threat. Caitlin Foord: 9 The happiest person in the Australian side Mary Fowler could play. The shackles were unleashed and the Arsenal star looked like a different player, free of the huge burden she looked to shoulder in the Nigeria loss. The first touch, the through balls...the effort chasing back in defence - she was a woman possessed. Mary Fowler: 9 Fowler is ecstatic after her goal gave the Aussies a 3-0 lead - after her first score was controversially called back for offside by the VAR One thing's for sure, when Sam Kerr (hopefully) lines up in the Round of 16, Mary Fowler will be there either way. What a stunning performance. The first touch, the dribbling, the passing... it's all Mary's world and we are just living in it. Clare Polkinghorne: N/A Subbed on late, as she has the last two, and fortunately didn't need to make a difference in this one. Share or comment on this article: Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 12:48:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/12/73795769-0-image-a-13_1690804742491.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Urgent warning ahead of Dublin’s homecoming celebrations as fans warned of severe issues around All-Ireland celebrations","link":"https://www.thesun.ie/sport/gaa-football/11113071/dublins-homecoming-celebrations-all-ireland-road-closures/","keywords":["GAA Football","Sport","GAA"],"creator":["Vincent Whelan"],"video_url":null,"description":null,"content":"DUBLIN fans intent on attending the homecoming for their All-Ireland winning heroes have been warned to take heed of several instructions. Fresh off an epic win over their greatest rivals Kerry , the capital will see a huge celebration occur in Smithfield Square on Monday evening. The event is due to get under way from 6.30 pm. However, supporters are being advised to allow plenty of time in order to get there on time since it will be guaranteed to be extremely busy. In addition to that, access to Smithfield Square is only going to permitted from North King Street, Friary Avenue and Thundercut Alley. The miserable weather means attendees should also allow extra time to ensure they get there safe and sound. Dublin City Council is asking people to use public transport when travelling to and from the event, which is a family-friendly alcohol-free event. The Lord Mayor Daithí de Róiste said: “Winning an All-Ireland title is always amazing, but beating Kerry in the final? \"It doesn’t come much better than that! \"I can’t wait to see everyone in Smithfield this evening. Let’s have a party and celebrate the boys in blue!” There will be entertainment provided on the evening, before the team takes to the stage to be welcomed by MC and RTE commentator Marty Morrissey. To celebrate the team’s achievement, Beckett Bridge and the Smithfield Sails will light up in blue both on Sunday evening and Monday evening. While Sunday's match was similarly blighted by the weather, it still wound up being a fascinating battle. Dublin were in most people's eyes the marginally better side over the course of the seventy-odd minutes. They had been in control prior to David Clifford pulling a magical pass out of nowhere just before half-time like a magician pulling a rabbit out of his hat. That teed up Paul Geaney's composed finish into the back of the net to send the Munster kingpins in at the break with a one-point lead. But Gavin White's costly turnover around the 50th minute resulted in Paddy Small blasting home a goal of their own. And while the defending champions fought resolutely to the bitter end, The Sky Blues kicked for home thanks to late scores from Brian Fenton and sub Dean Rock.","pubDate":"2023-07-31 12:33:41","image_url":null,"source_id":"thesun_ie","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly","link":"https://www.dailymail.co.uk/sport/live/article-12355725/Man-United-News-LIVE-Mason-Greenwoods-future-decided-ahead-new-season-Andre-Onana-FUMES-Harry-Maguire-mistake-pre-season-friendly.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Hello and welcome to Mail Sport's live blog with all the latest news and developments regarding Manchester United.","content":"LIVE Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly By Adrian Bishop For Mailonline Updated: 14:29 BST, 31 July 2023 e-mail 10 View comments Hello and welcome to Mail Sport's live blog with all the latest news and developments regarding Manchester United. Adrian Bishop Host commentator 14:29 Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe Sheffield United boss Paul Heckingbottom has been in talks with former Manchester United defender Axel Tuanzebe. The newly-promoted Premier League side have also opened talks with Arsenal for defender Auston Trusty. The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham City last season and, as Confidential readers will know, was a target for Rangers earlier this summer. Click below to read more: Sheffield United targeting moves for Axel Tuanzebe and Auston Trusty SIMON JONES: The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham last season and, was a target for Rangers this summer. Mail Online 13:19 Erik ten Hag plays down Man United's title credentials already and claims only champions City can be considered contenders in pre-season Erik ten Hag admits that Manchester United cannot look at themselves as Premier League title contenders yet. United are set to take their summer spending to £179million on Rasmus Hojlund , Mason Mount and Andre Onana as they bid to close the gap on champions Manchester City. But Ten Hag believes that City’s dominance under Pep Guardiola means they are the only team that can go into the new campaign talking up their title hopes, while United have to focus on the top-four battle. Click below to read more: Erik ten Hag plays down Man United's title credentials already CHRIS WHEELER IN LAS VEGAS: United are set to take their summer spending to £179m on Rasmus Hojlund, Mason Mount and Andre Onana as they bid to close the gap on Manchester City. Mail Online 12:41 ERIK TEN HAG INTERVIEW: Man United's boss on transforming the culture at Old Trafford Before Manchester United wrapped up their summer tour of the US with a 3-2 defeat to Borussia Dortmund in Las Vegas in the early hours of Monday morning, manager Erik ten Hag sat down with Mail Sport to discuss his first year at Old Trafford and the new season ahead. Speaking at United's training base at the University of California in San Diego, Ten Hag spoke about a wide range of topics including the new regime he has imposed at the club and his hopes of closing the gap on Manchester City . Click below to read Chris Wheeler's interview with the United manager: Erik ten Hag interview ahead of second Man United season CHRIS WHEELER IN LAS VEGAS: Ten Hag spoke about a wide range of topics including the new regime he has imposed at the club and his hopes of closing the gap to City. Mail Online 12:19 Former Manchester United defender Jaap Stam urges Antony to 'step up a gear' Former Manchester United defender Jaap Stam has called on Antony to improve after a disappointing debut season in the Premier league. The Brazilian winger joined the Red Devils from Ajax for £85.5million last summer but failed to live up to high expectations. Stam believes Antony has the skill set to be a success at Old Trafford but needs to 'step up a gear' and become less predictable in the upcoming new season. Click below to read more: Former Man United defender Jaap Stam urges Antony to 'step up a gear' The Brazilian winger joined the Red Devils from Ajax for £85.5million last summer but failed to live up to high expectations, scoring eight goals in 44 matches across all competitions. Mail Online 11:34 Francis Ngannou claims he is Man United's 'favourite heavyweight boxer' as he teases Tyson Fury Francis Ngannou has claimed that he is ' Manchester United 's favourite heavyweight boxer'. The former UFC fighter, who is set to do battle with known United fan Tyson Fury in October , was present as Erik ten Hag's side succumbed to a 3-2 defeat to Borussia Dortmund in Las Vegas on Sunday. And it was a disappointing performance from United , with the Dutch manager blasting his team after the game for an 'unforgivable' capitulation, which is notably their third pre-season loss on the bounce in the US. Click below to read more: Francis Ngannou says he is Man United's 'favourite heavyweight boxer' The former UFC fighter, who is set to do battle with known United fan Tyson Fury in October , was present as Erik ten Hag's side succumbed to a 3-2 defeat to Borussia Dortmund in Las Vegas. Mail Online 11:00 FIVE THINGS WE LEARNED from Man Utd's 3-2 defeat to Borussia Dortmund Manchester United were beaten 3-2 by Borussia Dortmund in Las Vegas on Sunday night but there were some valuable lessons for manager Erik ten Hag. Diogo Dalot gave United the lead with a great strike from distance in the first half but a quickfire double from Donyell Malen gave Dortmud the lead at half-time. Antony got the scores level shortly after the interval but Youssoufa Moukoko's 71st minute strike proved to be decisive. Click below to read more: FIVE THINGS WE LEARNED from Man Utd's 3-2 defeat to Borussia Dortmund Mail Sport's CHRIS WHEELER was on hand with the Manchester United talking points from the game in Las Vegas... Mail Online 10:28 Man United boss Erik ten Hag warns Omari Forson after pre-season flare-up Erik ten Hag told Manchester United's teenage winger Omari Forson that he would have been sent off against Borussia Dortmund in Las Vegas if there was VAR at the game. Ten Hag substituted Forson 38 minutes into United's 3-2 defeat to the Bundesliga side at the Allegiant Stadium after he was involved in a flare-up with defender Julian Ryerson. Forson kicked out angrily at Ryerson and was then booked for squaring up to Karim Adeyemi who stepped in to defend his team-mate. Click below to read more: Man United boss Erik ten Hag warns Omari Forson after flare-up CHRIS WHEELER IN LAS VEGAS: Ten Hag substituted Forson 38 minutes into United's 3-2 defeat at the Allegiant Stadium after he was involved in a flare-up. Mail Online 10:07 Man United keeper Andre Onana FUMES at Harry Maguire Andre Onana has the potential to transform the way Manchester United play their football with his abilities on the ball at the back. But there were always going to be some teething problems as the new £47million goalkeeper gets accustomed to those in front of him. It was Harry Maguire who bore the brunt of Onana's frustration after a sloppy pass almost gifted Borussia Dortmund a goal in United's friendly in Las Vegas on Sunday night. Click below to read more: Man United keeper Andre Onana FUMES at Harry Maguire Harry Maguire who bore the brunt of Onana's frustration after a sloppy pass almost gifted Borussia Dortmund a goal in United's friendly in Las Vegas on Sunday night. Mail Online 09:48 Christian Eriksen hails 'strong No 9' Rasmus Hojlund after Man United move Christian Eriksen says Manchester United are getting a powerful striker by signing his Denmark teammate Rasmus Hojlund . Hojlund is set to complete his move to Old Trafford from Atalanta after the two clubs struck a deal worth £72million in total and the 20-year old agreed personal terms over a five-year contract. Hojlund still has to complete a medical while United tie up the loose ends of the deal with Atalanta , but he could feasibly play for Erik ten Hag 's side in Saturday's friendly against Lens at Old Trafford or Athletic Bilbao in Dublin 24 hours later. Click below to read more: Eriksen hails 'strong No 9' Rasmus Hojlund after Man United move CHRIS WHEELER IN LAS VEGAS: Hojlund is set to complete his move to Old Trafford from Atalanta after the two clubs struck a deal worth £72million in total. Mail Online 09:33 Manchester United land the biggest kit deal in Premier League HISTORY Manchester United have secured the biggest kit deal in Premier League history after announcing a new 10-year partnership with adidas worth £900million. The new deal extends United’s tie up with the German sportswear giant as their official kit supplier until 2035 and guarantees a significant increase on the current terms, earning the club £90m-per-year. United sources say the deal gives them certainty around the biggest source of revenue for the next decade, reinforcing the stability of the club. Click below to read more: Manchester United land the biggest kit deal in Premier League HISTORY Manchester United have extended their long-term partnership with adidas until 2035 in a deal worth an estimated £900million. Mail Online 09:23 Manchester United to decide Mason Greenwood's future ahead of the new Premier League season Manchester United 's decision over Mason Greenwood 's future is imminent with the club set to make an announcement before the start of the new Premier League season. United have been conducting an internal investigation for the last six months since the Crown Prosecution Service confirmed at the start of February that it was dropping charges of attempted rape and assault against the 21-year-old. Greenwood has been suspended by United for the last 18 months following his arrest in January 2022, with the player unable to play for the club or even train with his team-mates at Carrington. Click below to read more... Manchester United to decide Mason Greenwood's future CHRIS WHEELER: Greenwood has been suspended by United for the last 18 months following his arrest in January 2022, with the player unable to play for or train with the club. Mail Online 09:21 Good morning... ...and welcome to Sportsmail's coverage of all the latest Manchester United news. We'll have all the latest updates and analysis as Erik ten Hag's side continue their pre-season preparations as July draws to a close with the return of the Premier League fast approaching. {\"id\":\"12355725\",\"channel\":\"/sport\",\"greenBox\":{\"body\":\"\"},\"pageUrl\":\"https://www.dailymail.co.uk/sport/live/article-12355725/Man-United-News-LIVE-Mason-Greenwoods-future-decided-ahead-new-season-Andre-Onana-FUMES-Harry-Maguire-mistake-pre-season-friendly.html\",\"status\":\"running\",\"lastDate\":1690810147454} Share or comment on this article: Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:29:07","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/08/73791031-0-image-a-9_1690788827798.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages","link":"https://www.dailymail.co.uk/sport/football/article-12356517/Congratulations-winning-gold-medal-Olympics-USA-legend-Alexi-Lalas-takes-brutal-swipe-Canada-dumped-World-Cup-group-stages.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"For the first time in women's football history, the reigning Olympic gold medalists have been knocked out in the Group Stages of the following World Cup.","content":"USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages Canada is out of the Women's World Cup after a humbling 4-0 defeat to Australia Lalas - ever the provocateur - didn't miss an opportunity to take a dig at Canada DailyMail.com provides all the latest international sports news By Jake Fenner For Dailymail.Com Updated: 09:41 EDT, 31 July 2023 e-mail View comments For the first time in women's football history, the reigning Olympic gold medalists have been knocked out in the Group Stages of the following World Cup. Canada, who came in with the eleventh best odds to lift the trophy in Australia, lost 4-0 to hosts Australia on Monday night in Melbourne . Coupled with a Nigeria 0-0 draw against Ireland, that meant that the Super Falcons would join the hosts in the knockout stages. Canada joins three men's teams that won the Olympic gold but got knocked out in the group stages: Czechoslovakia (gold in 1980, eliminated in 1982), the Soviet Union (gold in 1988, fell in 1990) and Cameroon (won gold in 2000, knocked out in 2002). Never one to pass up on a time to mock America's rivals, former US men's national team defender Alexi Lalas took a jab at Canada - all while former CanWNT keeper Karina Leblanc was sitting on the same desk. Alexi Lalas (far right) jumped on the opportunity to provide a sly dig at Canada's misery The goals came early and often for host nation Australia, who defeated the Canadians 4-0 This loss, coupled with a Nigeria draw, means Canada are the first women's Olympic gold medal winners in history to be knocked out in the group stages of the following World Cup \"They really came out and fought. Sam Kerr did not have to play and that was exactly what they wanted.\" @RobStoneONFOX , @karinaleblanc , @CarliLloyd , and @AlexiLalas recap The Matildas emphatic victory over Canada as they go into the Round of 16 with incredible momentum! 🇦🇺 pic.twitter.com/lUBjIgsiyJ — FOX Soccer (@FOXSoccer) July 31, 2023 Lalas likened the tournament to a game of musical chairs, saying, 'the music has stopped and Canada is left without a chair. Sindely, Lalas added, 'Congratulations on winning the Gold Medal at the Olympics.' Prior to that jab, Lalas gave a pretty fair review of the state of the match. 'It was... emphatic. It was an exclamation point, and now they go into the Round of 16 with incredible momentum. Out wide they were dominant, in terms of finishing they were dominant, in set pieces they were ultimately dominant. 'And so I know Karina, this probably hurts. But it may hurt a little bit less because Canada was never even in this game. Leblanc, reluctantly added, 'I would have to agree with you. I'm proudly Canadian but I tip my hats off to Australia. They deserved it, they dominated. 'I mean you talk about that left hand side [Steph] Catley, Caitlin Foord, [Hayley] Raso, like everybody did what they needed to do today except for Canada. 'And you know, its disappointing. You're coming off an Olympic win, you hope for more but I don't think there's any Canadian who watched this game or who has played the game who would say they deserved it tonight. 'The good thing is its a home country a home team one of the things you as a former player you want that, it's good for the game but yeah, that's how it ended tonight.' It's jubilation for the host nation, who managed to win the group with this victory on Monday But it's likely the end of the road at the World Cup for Canada legends Christine Sinclair (L) and Sophie Schmidt (R) - the latter of which already announced her retirement from the team A fellow person on the desk, USWNT legend Carli Lloyd praised Australia, saying they were better, 'In every aspect of the game. From start to finish, they scored early - we said it in the pre-game the team that was going to score early was the team that was most likely going to come out and win this game. 'I thought defensively they were compact they made it really difficult for Canada to go centrally. And Foord, in her more natural position out on that left hand side between her and Catley just deadly they made so much happen. Raso getting on the end of those goals, they really came out and fought and Sam Kerr did not have to play and that's exactly what they wanted.' As for Canada, this defeat marks the country's fifth Group Stage exit at a Women's World Cup - following two straight knockout stage appearances. It's the final game in a Canada uniform for one of the country's brightest stars - Sophie Schmidt and likely the last World Cup game for the world's all-time leading international goal scorer Christine Sinclair. After the match, Schmidt said, 'I don't think there's any words for how we're feeling right now. We're shook, we're disappointed.' Share or comment on this article: USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:26:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/14/73801141-0-image-a-21_1690809760706.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue","link":"https://www.dailymail.co.uk/sport/football/article-12356713/Chelsea-Brighton-Robert-Sanchez-Moises-Caicedo.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: Chelsea want Robert Sanchez and he has agreed to join. The problem will be the fee and Chelsea's ongoing talks over a deal for £105million-rated Moises Caicedo.","content":"Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue Robert Sanchez has fallen down the pecking order at Brighton in recent months The goalkeeper has been capped twice by Spain and was courted by England TRANSFER CONFIDENTIAL: Spurs line up Brennan Johnson if Harry Kane leaves By Simon Jones for MailOnline Updated: 09:25 EDT, 31 July 2023 e-mail View comments Chelsea want Brighton goalkeeper Robert Sanchez and he has agreed to join. The problem will be the fee and Chelsea's ongoing talks over a deal for £105million-rated Moises Caicedo. Sanchez has fallen out of favour with Roberto de Zerbi and wants to get away with Chelsea a perfect opportunity. Former Brighton goalkeeping coach Ben Roberts is at Chelsea and played a big part in mentoring Sanchez's development. Indeed, the 6ft 6ins shot-stopper credits his 'mental fortitude' to Roberts's influence. Though born in Spain and capped twice by them, Sanchez counts as homegrown as he has been brought up through Brighton's academy since the age of 15, and was courted by England prior to his Spain call-up. Chelsea are eyeing a move for Brighton goalkeeper Robert Sanchez (left) this summer Mauricio Pochettino is keen to strengthen in between the sticks ahead of the new season That could prove vital with Chelsea's current recruitment pattern and the fact the likes of Conor Gallagher could still depart. Chelsea have also been maintaining contact with Southampton over Romeo Lavia and Tino Livramento. Mauricio Pochettino has confirmed new signing from Rennes, Lesley Ugochukwu, should go on loan to Strasbourg with winger Angelo Gabriel expected to follow. Regardless of shared ownership rules permit only three loans allowed between clubs. They still plan to sign striker Elye Wahi from Montpellier with Strasbourg in mind so Chelsea will need to find different temporary, or permanent, homes for a number of the players they are stockpiling. Impressive midfielder Andrey Santos has interest from eight clubs, home and abroad. Share or comment on this article: Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:25:42","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73800657-0-image-a-39_1690808101799.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty","link":"https://www.dailymail.co.uk/sport/football/article-12356709/Sheffield-United-Paul-Heckingbottom-Man-United-Axel-Tuanzebe-Arsenal-Auston-Trusty.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham last season and, was a target for Rangers this summer.","content":"Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty Axel Tuanzebe, 25, was released by Manchester United at the end of 2022-23 Auston Trusty had been a target for Scottish giants Rangers earlier this summer TRANSFER CONFIDENTIAL: Spurs line up Brennan Johnson if Harry Kane leaves By Simon Jones for MailOnline Updated: 14:34 BST, 31 July 2023 e-mail View comments Sheffield United boss Paul Heckingbottom has been in talks with former Manchester United defender Axel Tuanzebe. The newly-promoted Premier League side have also opened talks with Arsenal for defender Auston Trusty. The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham City last season and, as Confidential readers will know, was a target for Rangers earlier this summer. Sheffield United are keen to get the deal for Trusty over the line, and are set to receive a financial injection from the sale of Iliman Ndiaye to Marseille for £18million. Arsenal would ideally prefer a sale for Trusty. They need to raise funds to offset their spending and appease Financial Fair Play concerns. Sheffield United have opened talks with Arsenal's Auston Trusty and are eyeing Axel Tuanzebe Paul Heckingbottom's side are back in the Premier League after a fine Championship season Arsenal are targeting Brentford keeper David Raya, but face competition from Bayern Munich They want Brentford goalkeeper David Raya but early signs are they will offer around £15m and Brentford are determined to take £30m at least. Arsenal could sell Matt Turner to help the move. The USA international is one on a long list of keepers courted by Nottingham Forest who want Dean Henderson and one other to start the season. Raya is highly regarded by Arsenal keeper coach Inaki Cana who worked with the 27-year-old at Brentford and believes he can provide Aaron Ramsdale with serious competition for the number one jersey. Bayern Munich have not totally given up on Raya but they were offering a loan with obligation and are now looking at Morocco international Yassine Bouno, or 'Bono' to his friends, of Sevilla. Share or comment on this article: Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:25:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73800011-0-image-a-9_1690808139583.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea fans convinced the Blues are signing Kylian Mbappe after hearing Enzo Fernandez's comment","link":"https://www.dailymail.co.uk/sport/football/article-12356651/Chelsea-fans-convinced-Blues-signing-Kylian-Mbappe-hearing-Enzo-Fernandezs-comment.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mail Sport reported on Sunday night that the Blues 'want to hijack Liverpool's' sensational move for the France World Cup winner.","content":"What was that, Enzo? Chelsea fans are convinced the Blues are signing Kylian Mbappe after hearing Fernandez's comment during trophy lift amid links with a sensational swoop for the PSG star Chelsea believe they may be signing Kylian Mbappe after Sunday's victory The Blues were crowned the first Premier League Summer Series champions Fans think Enzo Fernandez revealed the transfer during the celebrations By Ed Carruthers For Mailonline Updated: 09:33 EDT, 31 July 2023 e-mail 34 shares 2 View comments Chelsea fans are convinced that Enzo Fernandez may have revealed that the club are signing Kylian Mbappe, following their Premier League Summer Series victory . Mail Sport reported on Sunday night that the Blues 'want to hijack Liverpool's' sensational move for the France World Cup winner. It comes as the 24-year-old is edging closer to an exit from Paris Saint-Germain, after the club put him up for sale and left him out of their pre-season tour last week. The forward's ongoing contract saga with the Parisian outfit has soured their relationship so much so that the club are now hoping to cash in on their superstar, with Nasser Al-Khelaifi's side having accepted a jaw-dropping £259million transfer offer for the forward. It's been made clear that he does not want to join the Saudi Pro League side , with Liverpool now reportedly 'holding talks' with the Frenchman , who has 12 months remaining on his contract at the Parc des Princes. Introducing your first-ever #PLSummerSeries champions: @ChelseaFC ! 🏆 pic.twitter.com/yFWiGzXqzO — Premier League (@premierleague) July 30, 2023 Both Chelsea and Liverpool are interested in signing Kylian Mbappe (pictured) with the French superstar's future at Paris Saint-Germain very much up in the air Chelsea, meanwhile, hoisted the Premier League Summer Series title yesterday, and fans believe they over heard Enzo Fernandez (third from left) saying the Frenchman's name Chelsea, meanwhile, are also interested in signing the superstar and their fans seem to think that he could be on his way to Stamford Bridge after their Argentine midfielder was seemingly overheard to be saying his name after their 2-0 victory against Fulham on Sunday. Mauricio Pochettino's side subsequently clinched the pre-season title, having gone unbeaten in the tournament in the US, with Reece James and Thiago Silva stepping forward to lift the trophy alongside their team-mates. And just as they hoisted the cup into the air, fans believe they overheard their midfielder, Fernandez, saying Mbappe's name. 'I heard it loud and clear,' one said, while another added: 'Hearing that for the first time... What's he onto?' 'Can't wait for Boehly to offer Mbappe a 10-year contract,' one wrote. 'Proper weird thing to think of saying in the moment tbh... unless he knows something we dont,' another Twitter user added, posting a thinking-face emoji with the Tweet. Fans have been reacting on Twitter to claims that they overheard Enzo Fernandez say Mbappe's name during their trophy celebrations Pochettino has remained tight-lipped on the potential to sign Mbappe (pictured) in the past According to the Daily Record , Chelsea would be interested in signing the French forward in a player plus-cash deal. But Pochettino last week refused to confirm that his side were interested in signing Mbappe claiming that the situation was 'delicate.' 'I need to be conscious,' the manager told Sky Sports after his side's 1-1 draw against Newcastle last week. 'I cannot talk because everything that you talk is too much noise, it is a very delicate situation and it is a situation they need to fix in Paris with Kylian, Kylian with PSG 'But from our side, nothing to say. We are working in our reality, their reality is different - and they for sure have another reality. 'And from my side, nothing to say - only to support them and hope they find the best solution for both sides.' Share or comment on this article: Chelsea fans convinced the Blues are signing Kylian Mbappe after hearing Enzo Fernandez's comment e-mail 34 shares Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:22:48","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/14/73801683-0-image-a-13_1690809734847.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Saint West, 7, Freaks Out After Soccer Star Neymar Throws Him A T-Shirt After Game: Watch","link":"https://hollywoodlife.com/2023/07/31/saint-west-neymar-shirt-kim-kardashian-photos-video/","keywords":["Entertainment","Sports","Kim Kardashian","Neymar","Saint West"],"creator":["Jason Brow"],"video_url":null,"description":"First, Saint West got a selfie with Messi. Now, Kim Kardashian revealed that her eldest son scored a shirt from Neymar after watching him play in Japan – and he got to meet Cristiano Ronaldo, too!","content":"Because the July 25 friendly game between Paris Saint-Germain and Al-Nassr ended in a 0-0 draw, it’s safe to say the real winner of the match was . Saint, 7, and his mom, , were in Japan to see and the rest of PSG square off against , , and the rest of the Al-Nassr squad. “So thankful that our boys’ dreams are coming true,” Kim, 42, captioned a July 31 Instagram Gallery that showed the highlights from this trip – including when Neymar, 31, tossed a t-shirt to Saint. Saint gleefully danced in triumph after he snatched it from the air and showed it to his mom. This isn’t the first that fans have seen Saint at this game. Kim initially posted the photos to her IG story after the game, and YouTuber (aka Darren Watkins Jr.) also spotted Kim, Saint, and their crew in the stands. “Why you got that PSG [jersey] on?” Darren asked Saint, to which the young boy said, “Because I’m gonna meet Neymar first.” Saint also got to meet Ronaldo, 38, after the game – and he switched to an Al-Nassr kit before he did. Saint posed with the football legend for a photo, and Ronaldo even taught Saint a handshake that included his trademark goal celebration. On July 28, Kim from her and Saint’s trip to Miami to see Messi, 36, play his first game with Inter Miami. Along with pictures of her and Saint next to and , Kim posted some pictures of Saint hanging out with the World Cup champ. “Legendary,” Kim said of the whole experience. Kim has been for Saint. The two on Mar. 16. The @AFCStuff twitter account reposted Kim’s Instagram story, showing how Saint donned “a jersey, cheering for as he takes his penalty during the shootout against Sporting CP tonight.” While overseas for the Arsenal/Sporting match, Saint and Kim also made time to catch a PSG game, per . Shortly after that, Kim posted a photo of her son meeting Kylian Mbappé, 24, to her Instagram story. Kim also shared a clip of her son and his friend FaceTiming with Neymar. “The luckiest boys in the world,” she captioned the shot, “Facetiming [Neymar] to wish him a speedy recovery.”","pubDate":"2023-07-31 13:21:22","image_url":"https://hollywoodlife.com/wp-content/uploads/2023/07/kim-kardashian-saint-west-soccer-ftr.jpg","source_id":"hollywoodlife","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Morocco’s Benzina makes history with hijab at Women’s World Cup","link":"https://thefrontierpost.com/moroccos-benzina-makes-history-with-hijab-at-womens-world-cup-2/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"AUCKLAND (AFP): Nouhaila Benzina became the first player to wear a hijab during a Women’s World Cup game when she sported the Muslim headscarf in Morocco’s match against South Korea on Sunday. World governing body FIFA lifted its ban on footballers wearing the hijab nearly a decade ago, after previous concerns over player safety. The […]","content":"AUCKLAND (AFP): Nouhaila Benzina became the first player to wear a hijab during a Women’s World Cup game when she sported the Muslim headscarf in Morocco’s match against South Korea on Sunday. World governing body FIFA lifted its ban on footballers wearing the hijab nearly a decade ago, after previous concerns over player safety. The 25-year-old defender Benzina, who plays her club football in Morocco, ran out against South Korea in Adelaide to write her name in the history books. Benzina shared social media posts in the lead-up to the World Cup about wearing a hijab, but has not spoken to the media in Australia and New Zealand about it. She told broadcaster Al Jazeera recently it would be a proud moment. “Lots of work was done over many years, and thank God it had a positive result,” she said. “We hope to play at a high level and honour Moroccans.” Several other sports have lifted hijab bans in recent years including basketball, but it is still not allowed during official football matches in France. The Moroccan women, coached by Frenchman Reynald Pedros, are at their first Women’s World Cup on the back of a historic runners-up finish at the 2022 Women’s Africa Cup of Nations. They were thrashed 6-0 by Germany in their tournament opener, with Benzina remaining on the bench.","pubDate":"2023-07-31 13:18:05","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash","link":"https://www.dailymail.co.uk/sport/football/article-12356499/Matildas-Canada-World-Cup-Allysha-Chapman-Hayley-Raso-swearing-X-rated-outburst.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Sideline microphones have captured the disgusting spray a Canadian player delivered to Matildas hero Hayley Raso as she lay prone on the ground in Australia's 4-0 win on Monday night.","content":"Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash Matildas thrashed Canada 4-0 Substitute Canadian player was not pleased Launched foul-mouthed spray By Josh Alston For Daily Mail Australia Updated: 13:51 BST, 31 July 2023 e-mail 1 View comments Sideline microphones have captured the disgusting spray a Canadian player delivered to Matildas hero Hayley Raso as she lay prone on the ground in Australia's 4-0 win on Monday night. It was do-or-die for the two nations in the final World Cup group match in Melbourne and the home side shot out of the blocks to dominate from the outset - even as captain Sam Kerr remained benched with a calf injury . Raso was named best on ground with two clutch goals that handed Australia a place in the knockout stages and their first win over powerhouse Canada since 2008. There was plenty of feeling in the match, with the Canadians ranked seventh in the world and fancied to go deep in the tournament prior to the Matildas demolition job. Chapman was not happy with something Australian coach Tony Gustavsson and launched a mighty, foul-mouthed spray in return Raso came off second best in the content but Chapman was not willing to concede that it was her fault after the challenge With the result all but secured, Canadian player Allysha Chapman collided with Raso, with the Australian coming off second best and requiring medical attention on the pitch. Australia coach Tony Gustavsson had some words for Chapman that weren't picked up on the broadcast, and the Canadian erupted in reply. 'She f***ing jumped into me you t***!' she yelled. Commentator David Basheer said: 'Allysha Chapman looked over to Tony Gustavsson and said some pretty stern words. 'It was just a coming together, really. It wasn't Chapman's doing. 'It was just Raso's determination to win the ball.' 'I don't think there was any real malice in the challenge,' fellow commentator and former Matilda Grace Gill added. 'A coming together of bodies, Raso coming off a little worse for wear.' Gustavsson and Raso had the last laugh, sharing an embrace after the Matildas smashed Canada 4-0 to dump them out of the tournament Commentators agreed that the collision was accidental, with both players having eyes only for the ball Fans were disgusted by the tirade, especially as it occured while Raso was down and potentially injured. 'Allysha Chapman’s foul mouth and evil ways make me sick,' one fan posted. 'Look at the scoreboard, you t***. Sincerely, Australia,' replied another. 'Allysha Chapman displaying the most fight this [Canadian team] have shown this tournament,' posted a third. Oooh, langage, Allysha Chapman! 😂 — Emil (@EmilASoccer) July 31, 2023 Raso had the last laugh, though, with the Matildas topping their group for the first time in a World Cup thanks in large part to her heroics. 'Getting a tattoo of Hayley Raso’s face on my face,' one enthusiastic fan proclaimed. 'Hayley Raso. Absolute gun of a player,' posted another. 'This has been a Hayley Raso masterclass,' added another. Australia now wait on the result of the Group D clash between England and China to see who their opposition will be in the round of 16. The Matildas will now focus on emulating or bettering their quarter final appearances at the 2007, 2011 and 2015 World Cup tournaments. Share or comment on this article: Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 12:51:56","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73798997-0-image-a-8_1690806132897.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada","link":"https://www.dailymail.co.uk/sport/football/article-12355353/Matildas-player-ratings-Canada-Womens-World-Cup-Melbourne-ranked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In an display that was light years ahead of their effort in the shock loss to Nigeria last week, the Matildas were dominant from the first whistle to the last against Canada.","content":"Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada Aussies dominant from the outset in 4-0 win Hayley Raso named best on ground with two goals Mary Fowler also among home team's best By Kristy Williams For Daily Mail Australia Updated: 13:56 BST, 31 July 2023 e-mail View comments The Matildas were dominant against Canada from start to finish despite the crushing pressure of knowing their home World Cup would have been over if they'd lost in Melbourne following their shock defeat to Nigeria last Thursday. Hayley Raso scored a double, Mary Fowler should have had two herself but had one controversially ruled offside by the VAR, and stand-in skipper Steph Catley put an exclamation point on proceedings with a late penalty. It was the biggest win by a Matildas side at any World Cup - and even better, the Aussies were so firmly in control that injured superstar Sam Kerr never had to be called on. Here's how Daily Mail Australia rated the home team... Mackenzie Arnold: 8.5 Made a few poor errors last game that may have dented the confidence, but 'Macca' was back at her best in this match, pulling off a couple of crucial saves but also returning to the brilliant distributor she had been. Ellie Carpenter: 6 Brilliant to see the Lyon star at least back to some decent form. She is such a talented player - one of the best in the world - but where has that spark gone? Carpenter was determined to defend better than the diabolical Nigeria match, and she certainly did that, but Aussies want to see the superstar they fell in love with. Clare Hunt: 8.5 The girl from the tiny town of Grenfell (NSW), was mammoth. Not many better players on the field than Hunt, who has well and truly played Kennedy and Polkinhorne out of the first-choice CB spot. The challenges she won, the time she won them and the distribution she afforded those ahead of her were phenomenal. She won't want the attention but she was as important as any Aussie player. Alanna Kennedy: 6.5 Many expected her to concede her place to Clare Polkinghorne, but Gustavsson picked his most talented centre back. While she didn't reach the heights of a brilliant game against Ireland, she was calmer than the Ireland match and despite a few passing errors she was Steph Catley: 8.5 Goodness, has the stand-in skipper stood up or what? Faded, as expected given the state of the match, as the game went on but the Arsenal jet was at her lethal best down the left - setting up the opening goal with an exquisite touch. Then came the defensive grunt - she was strong. Hayley Raso: 9 Hang it in the Louvre. The fan favourite celebrating a goal that sent the entire nation nuts to open the scoring was one thing - but the new Real Madrid signee kept showing her new Galactico club why they brought her in. Relentless as always but her positioning and nous were brilliant, and she seemed to regain confidence and composure with her first touch, and the fact she, yet again, often finished behind Carpenter showed how hard she worked. Katrina Gorry: 7 Not the workhorse's greatest match, with a fair few very, heavy touches, but the side is so much better for her in it, regardless. Looks to be very sore, and will be more crucial than Sam Kerr when it comes to the playoffs. Worked herself sore, and chased every mistake. Kyra Cooney-Cross: 7.5 A brilliant distributor, Gorry might have been the side's most important passer, but this Young Matilda has been sensational. Did she get found out? Don't think so. She never looks flustered, but has a better touch than her veteran counterpart. Emily Van Egmond: 6 Flirted between centre midfield and forwards, and wasn't much of an influence in either. But she certainly didn't let anyone down, despite not posing much of a threat. Caitlin Foord: 9 The happiest person in the Australian side Mary Fowler could play. The shackles were unleashed and the Arsenal star looked like a different player, free of the huge burden she looked to shoulder in the Nigeria loss. The first touch, the through balls...the effort chasing back in defence - she was a woman possessed. Mary Fowler: 9 Fowler is ecstatic after her goal gave the Aussies a 3-0 lead - after her first score was controversially called back for offside by the VAR One thing's for sure, when Sam Kerr (hopefully) lines up in the Round of 16, Mary Fowler will be there either way. What a stunning performance. The first touch, the dribbling, the passing... it's all Mary's world and we are just living in it. Clare Polkinghorne: N/A Subbed on late, as she has the last two, and fortunately didn't need to make a difference in this one. Share or comment on this article: Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 12:48:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/12/73795769-0-image-a-13_1690804742491.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Urgent warning ahead of Dublin’s homecoming celebrations as fans warned of severe issues around All-Ireland celebrations","link":"https://www.thesun.ie/sport/gaa-football/11113071/dublins-homecoming-celebrations-all-ireland-road-closures/","keywords":["GAA Football","Sport","GAA"],"creator":["Vincent Whelan"],"video_url":null,"description":null,"content":"DUBLIN fans intent on attending the homecoming for their All-Ireland winning heroes have been warned to take heed of several instructions. Fresh off an epic win over their greatest rivals Kerry , the capital will see a huge celebration occur in Smithfield Square on Monday evening. The event is due to get under way from 6.30 pm. However, supporters are being advised to allow plenty of time in order to get there on time since it will be guaranteed to be extremely busy. In addition to that, access to Smithfield Square is only going to permitted from North King Street, Friary Avenue and Thundercut Alley. The miserable weather means attendees should also allow extra time to ensure they get there safe and sound. Dublin City Council is asking people to use public transport when travelling to and from the event, which is a family-friendly alcohol-free event. The Lord Mayor Daithí de Róiste said: “Winning an All-Ireland title is always amazing, but beating Kerry in the final? \"It doesn’t come much better than that! \"I can’t wait to see everyone in Smithfield this evening. Let’s have a party and celebrate the boys in blue!” There will be entertainment provided on the evening, before the team takes to the stage to be welcomed by MC and RTE commentator Marty Morrissey. To celebrate the team’s achievement, Beckett Bridge and the Smithfield Sails will light up in blue both on Sunday evening and Monday evening. While Sunday's match was similarly blighted by the weather, it still wound up being a fascinating battle. Dublin were in most people's eyes the marginally better side over the course of the seventy-odd minutes. They had been in control prior to David Clifford pulling a magical pass out of nowhere just before half-time like a magician pulling a rabbit out of his hat. That teed up Paul Geaney's composed finish into the back of the net to send the Munster kingpins in at the break with a one-point lead. But Gavin White's costly turnover around the 50th minute resulted in Paddy Small blasting home a goal of their own. And while the defending champions fought resolutely to the bitter end, The Sky Blues kicked for home thanks to late scores from Brian Fenton and sub Dean Rock.","pubDate":"2023-07-31 12:33:41","image_url":null,"source_id":"thesun_ie","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly","link":"https://www.dailymail.co.uk/sport/live/article-12355725/Man-United-News-LIVE-Mason-Greenwoods-future-decided-ahead-new-season-Andre-Onana-FUMES-Harry-Maguire-mistake-pre-season-friendly.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Hello and welcome to Mail Sport's live blog with all the latest news and developments regarding Manchester United.","content":"LIVE Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly By Adrian Bishop For Mailonline Updated: 14:29 BST, 31 July 2023 e-mail 10 View comments Hello and welcome to Mail Sport's live blog with all the latest news and developments regarding Manchester United. Adrian Bishop Host commentator 14:29 Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe Sheffield United boss Paul Heckingbottom has been in talks with former Manchester United defender Axel Tuanzebe. The newly-promoted Premier League side have also opened talks with Arsenal for defender Auston Trusty. The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham City last season and, as Confidential readers will know, was a target for Rangers earlier this summer. Click below to read more: Sheffield United targeting moves for Axel Tuanzebe and Auston Trusty SIMON JONES: The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham last season and, was a target for Rangers this summer. Mail Online 13:19 Erik ten Hag plays down Man United's title credentials already and claims only champions City can be considered contenders in pre-season Erik ten Hag admits that Manchester United cannot look at themselves as Premier League title contenders yet. United are set to take their summer spending to £179million on Rasmus Hojlund , Mason Mount and Andre Onana as they bid to close the gap on champions Manchester City. But Ten Hag believes that City’s dominance under Pep Guardiola means they are the only team that can go into the new campaign talking up their title hopes, while United have to focus on the top-four battle. Click below to read more: Erik ten Hag plays down Man United's title credentials already CHRIS WHEELER IN LAS VEGAS: United are set to take their summer spending to £179m on Rasmus Hojlund, Mason Mount and Andre Onana as they bid to close the gap on Manchester City. Mail Online 12:41 ERIK TEN HAG INTERVIEW: Man United's boss on transforming the culture at Old Trafford Before Manchester United wrapped up their summer tour of the US with a 3-2 defeat to Borussia Dortmund in Las Vegas in the early hours of Monday morning, manager Erik ten Hag sat down with Mail Sport to discuss his first year at Old Trafford and the new season ahead. Speaking at United's training base at the University of California in San Diego, Ten Hag spoke about a wide range of topics including the new regime he has imposed at the club and his hopes of closing the gap on Manchester City . Click below to read Chris Wheeler's interview with the United manager: Erik ten Hag interview ahead of second Man United season CHRIS WHEELER IN LAS VEGAS: Ten Hag spoke about a wide range of topics including the new regime he has imposed at the club and his hopes of closing the gap to City. Mail Online 12:19 Former Manchester United defender Jaap Stam urges Antony to 'step up a gear' Former Manchester United defender Jaap Stam has called on Antony to improve after a disappointing debut season in the Premier league. The Brazilian winger joined the Red Devils from Ajax for £85.5million last summer but failed to live up to high expectations. Stam believes Antony has the skill set to be a success at Old Trafford but needs to 'step up a gear' and become less predictable in the upcoming new season. Click below to read more: Former Man United defender Jaap Stam urges Antony to 'step up a gear' The Brazilian winger joined the Red Devils from Ajax for £85.5million last summer but failed to live up to high expectations, scoring eight goals in 44 matches across all competitions. Mail Online 11:34 Francis Ngannou claims he is Man United's 'favourite heavyweight boxer' as he teases Tyson Fury Francis Ngannou has claimed that he is ' Manchester United 's favourite heavyweight boxer'. The former UFC fighter, who is set to do battle with known United fan Tyson Fury in October , was present as Erik ten Hag's side succumbed to a 3-2 defeat to Borussia Dortmund in Las Vegas on Sunday. And it was a disappointing performance from United , with the Dutch manager blasting his team after the game for an 'unforgivable' capitulation, which is notably their third pre-season loss on the bounce in the US. Click below to read more: Francis Ngannou says he is Man United's 'favourite heavyweight boxer' The former UFC fighter, who is set to do battle with known United fan Tyson Fury in October , was present as Erik ten Hag's side succumbed to a 3-2 defeat to Borussia Dortmund in Las Vegas. Mail Online 11:00 FIVE THINGS WE LEARNED from Man Utd's 3-2 defeat to Borussia Dortmund Manchester United were beaten 3-2 by Borussia Dortmund in Las Vegas on Sunday night but there were some valuable lessons for manager Erik ten Hag. Diogo Dalot gave United the lead with a great strike from distance in the first half but a quickfire double from Donyell Malen gave Dortmud the lead at half-time. Antony got the scores level shortly after the interval but Youssoufa Moukoko's 71st minute strike proved to be decisive. Click below to read more: FIVE THINGS WE LEARNED from Man Utd's 3-2 defeat to Borussia Dortmund Mail Sport's CHRIS WHEELER was on hand with the Manchester United talking points from the game in Las Vegas... Mail Online 10:28 Man United boss Erik ten Hag warns Omari Forson after pre-season flare-up Erik ten Hag told Manchester United's teenage winger Omari Forson that he would have been sent off against Borussia Dortmund in Las Vegas if there was VAR at the game. Ten Hag substituted Forson 38 minutes into United's 3-2 defeat to the Bundesliga side at the Allegiant Stadium after he was involved in a flare-up with defender Julian Ryerson. Forson kicked out angrily at Ryerson and was then booked for squaring up to Karim Adeyemi who stepped in to defend his team-mate. Click below to read more: Man United boss Erik ten Hag warns Omari Forson after flare-up CHRIS WHEELER IN LAS VEGAS: Ten Hag substituted Forson 38 minutes into United's 3-2 defeat at the Allegiant Stadium after he was involved in a flare-up. Mail Online 10:07 Man United keeper Andre Onana FUMES at Harry Maguire Andre Onana has the potential to transform the way Manchester United play their football with his abilities on the ball at the back. But there were always going to be some teething problems as the new £47million goalkeeper gets accustomed to those in front of him. It was Harry Maguire who bore the brunt of Onana's frustration after a sloppy pass almost gifted Borussia Dortmund a goal in United's friendly in Las Vegas on Sunday night. Click below to read more: Man United keeper Andre Onana FUMES at Harry Maguire Harry Maguire who bore the brunt of Onana's frustration after a sloppy pass almost gifted Borussia Dortmund a goal in United's friendly in Las Vegas on Sunday night. Mail Online 09:48 Christian Eriksen hails 'strong No 9' Rasmus Hojlund after Man United move Christian Eriksen says Manchester United are getting a powerful striker by signing his Denmark teammate Rasmus Hojlund . Hojlund is set to complete his move to Old Trafford from Atalanta after the two clubs struck a deal worth £72million in total and the 20-year old agreed personal terms over a five-year contract. Hojlund still has to complete a medical while United tie up the loose ends of the deal with Atalanta , but he could feasibly play for Erik ten Hag 's side in Saturday's friendly against Lens at Old Trafford or Athletic Bilbao in Dublin 24 hours later. Click below to read more: Eriksen hails 'strong No 9' Rasmus Hojlund after Man United move CHRIS WHEELER IN LAS VEGAS: Hojlund is set to complete his move to Old Trafford from Atalanta after the two clubs struck a deal worth £72million in total. Mail Online 09:33 Manchester United land the biggest kit deal in Premier League HISTORY Manchester United have secured the biggest kit deal in Premier League history after announcing a new 10-year partnership with adidas worth £900million. The new deal extends United’s tie up with the German sportswear giant as their official kit supplier until 2035 and guarantees a significant increase on the current terms, earning the club £90m-per-year. United sources say the deal gives them certainty around the biggest source of revenue for the next decade, reinforcing the stability of the club. Click below to read more: Manchester United land the biggest kit deal in Premier League HISTORY Manchester United have extended their long-term partnership with adidas until 2035 in a deal worth an estimated £900million. Mail Online 09:23 Manchester United to decide Mason Greenwood's future ahead of the new Premier League season Manchester United 's decision over Mason Greenwood 's future is imminent with the club set to make an announcement before the start of the new Premier League season. United have been conducting an internal investigation for the last six months since the Crown Prosecution Service confirmed at the start of February that it was dropping charges of attempted rape and assault against the 21-year-old. Greenwood has been suspended by United for the last 18 months following his arrest in January 2022, with the player unable to play for the club or even train with his team-mates at Carrington. Click below to read more... Manchester United to decide Mason Greenwood's future CHRIS WHEELER: Greenwood has been suspended by United for the last 18 months following his arrest in January 2022, with the player unable to play for or train with the club. Mail Online 09:21 Good morning... ...and welcome to Sportsmail's coverage of all the latest Manchester United news. We'll have all the latest updates and analysis as Erik ten Hag's side continue their pre-season preparations as July draws to a close with the return of the Premier League fast approaching. {\"id\":\"12355725\",\"channel\":\"/sport\",\"greenBox\":{\"body\":\"\"},\"pageUrl\":\"https://www.dailymail.co.uk/sport/live/article-12355725/Man-United-News-LIVE-Mason-Greenwoods-future-decided-ahead-new-season-Andre-Onana-FUMES-Harry-Maguire-mistake-pre-season-friendly.html\",\"status\":\"running\",\"lastDate\":1690810147454} Share or comment on this article: Man United News LIVE: Mason Greenwood's future to be decided ahead of the new season as Andre Onana FUMES at Harry Maguire for mistake in pre-season friendly e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:29:07","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/08/73791031-0-image-a-9_1690788827798.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages","link":"https://www.dailymail.co.uk/sport/football/article-12356517/Congratulations-winning-gold-medal-Olympics-USA-legend-Alexi-Lalas-takes-brutal-swipe-Canada-dumped-World-Cup-group-stages.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"For the first time in women's football history, the reigning Olympic gold medalists have been knocked out in the Group Stages of the following World Cup.","content":"USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages Canada is out of the Women's World Cup after a humbling 4-0 defeat to Australia Lalas - ever the provocateur - didn't miss an opportunity to take a dig at Canada DailyMail.com provides all the latest international sports news By Jake Fenner For Dailymail.Com Updated: 09:41 EDT, 31 July 2023 e-mail View comments For the first time in women's football history, the reigning Olympic gold medalists have been knocked out in the Group Stages of the following World Cup. Canada, who came in with the eleventh best odds to lift the trophy in Australia, lost 4-0 to hosts Australia on Monday night in Melbourne . Coupled with a Nigeria 0-0 draw against Ireland, that meant that the Super Falcons would join the hosts in the knockout stages. Canada joins three men's teams that won the Olympic gold but got knocked out in the group stages: Czechoslovakia (gold in 1980, eliminated in 1982), the Soviet Union (gold in 1988, fell in 1990) and Cameroon (won gold in 2000, knocked out in 2002). Never one to pass up on a time to mock America's rivals, former US men's national team defender Alexi Lalas took a jab at Canada - all while former CanWNT keeper Karina Leblanc was sitting on the same desk. Alexi Lalas (far right) jumped on the opportunity to provide a sly dig at Canada's misery The goals came early and often for host nation Australia, who defeated the Canadians 4-0 This loss, coupled with a Nigeria draw, means Canada are the first women's Olympic gold medal winners in history to be knocked out in the group stages of the following World Cup \"They really came out and fought. Sam Kerr did not have to play and that was exactly what they wanted.\" @RobStoneONFOX , @karinaleblanc , @CarliLloyd , and @AlexiLalas recap The Matildas emphatic victory over Canada as they go into the Round of 16 with incredible momentum! 🇦🇺 pic.twitter.com/lUBjIgsiyJ — FOX Soccer (@FOXSoccer) July 31, 2023 Lalas likened the tournament to a game of musical chairs, saying, 'the music has stopped and Canada is left without a chair. Sindely, Lalas added, 'Congratulations on winning the Gold Medal at the Olympics.' Prior to that jab, Lalas gave a pretty fair review of the state of the match. 'It was... emphatic. It was an exclamation point, and now they go into the Round of 16 with incredible momentum. Out wide they were dominant, in terms of finishing they were dominant, in set pieces they were ultimately dominant. 'And so I know Karina, this probably hurts. But it may hurt a little bit less because Canada was never even in this game. Leblanc, reluctantly added, 'I would have to agree with you. I'm proudly Canadian but I tip my hats off to Australia. They deserved it, they dominated. 'I mean you talk about that left hand side [Steph] Catley, Caitlin Foord, [Hayley] Raso, like everybody did what they needed to do today except for Canada. 'And you know, its disappointing. You're coming off an Olympic win, you hope for more but I don't think there's any Canadian who watched this game or who has played the game who would say they deserved it tonight. 'The good thing is its a home country a home team one of the things you as a former player you want that, it's good for the game but yeah, that's how it ended tonight.' It's jubilation for the host nation, who managed to win the group with this victory on Monday But it's likely the end of the road at the World Cup for Canada legends Christine Sinclair (L) and Sophie Schmidt (R) - the latter of which already announced her retirement from the team A fellow person on the desk, USWNT legend Carli Lloyd praised Australia, saying they were better, 'In every aspect of the game. From start to finish, they scored early - we said it in the pre-game the team that was going to score early was the team that was most likely going to come out and win this game. 'I thought defensively they were compact they made it really difficult for Canada to go centrally. And Foord, in her more natural position out on that left hand side between her and Catley just deadly they made so much happen. Raso getting on the end of those goals, they really came out and fought and Sam Kerr did not have to play and that's exactly what they wanted.' As for Canada, this defeat marks the country's fifth Group Stage exit at a Women's World Cup - following two straight knockout stage appearances. It's the final game in a Canada uniform for one of the country's brightest stars - Sophie Schmidt and likely the last World Cup game for the world's all-time leading international goal scorer Christine Sinclair. After the match, Schmidt said, 'I don't think there's any words for how we're feeling right now. We're shook, we're disappointed.' Share or comment on this article: USA legend Alexi Lalas takes a brutal swipe at Canada after it is dumped out of the World Cup in the group stages e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:26:10","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/14/73801141-0-image-a-21_1690809760706.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue","link":"https://www.dailymail.co.uk/sport/football/article-12356713/Chelsea-Brighton-Robert-Sanchez-Moises-Caicedo.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: Chelsea want Robert Sanchez and he has agreed to join. The problem will be the fee and Chelsea's ongoing talks over a deal for £105million-rated Moises Caicedo.","content":"Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue Robert Sanchez has fallen down the pecking order at Brighton in recent months The goalkeeper has been capped twice by Spain and was courted by England TRANSFER CONFIDENTIAL: Spurs line up Brennan Johnson if Harry Kane leaves By Simon Jones for MailOnline Updated: 09:25 EDT, 31 July 2023 e-mail View comments Chelsea want Brighton goalkeeper Robert Sanchez and he has agreed to join. The problem will be the fee and Chelsea's ongoing talks over a deal for £105million-rated Moises Caicedo. Sanchez has fallen out of favour with Roberto de Zerbi and wants to get away with Chelsea a perfect opportunity. Former Brighton goalkeeping coach Ben Roberts is at Chelsea and played a big part in mentoring Sanchez's development. Indeed, the 6ft 6ins shot-stopper credits his 'mental fortitude' to Roberts's influence. Though born in Spain and capped twice by them, Sanchez counts as homegrown as he has been brought up through Brighton's academy since the age of 15, and was courted by England prior to his Spain call-up. Chelsea are eyeing a move for Brighton goalkeeper Robert Sanchez (left) this summer Mauricio Pochettino is keen to strengthen in between the sticks ahead of the new season That could prove vital with Chelsea's current recruitment pattern and the fact the likes of Conor Gallagher could still depart. Chelsea have also been maintaining contact with Southampton over Romeo Lavia and Tino Livramento. Mauricio Pochettino has confirmed new signing from Rennes, Lesley Ugochukwu, should go on loan to Strasbourg with winger Angelo Gabriel expected to follow. Regardless of shared ownership rules permit only three loans allowed between clubs. They still plan to sign striker Elye Wahi from Montpellier with Strasbourg in mind so Chelsea will need to find different temporary, or permanent, homes for a number of the players they are stockpiling. Impressive midfielder Andrey Santos has interest from eight clubs, home and abroad. Share or comment on this article: Chelsea want Brighton keeper Robert Sanchez - who has already agreed to join the Blues - but transfer fee and ongoing talks over £105m-rated Moises Caicedo are proving an issue e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:25:42","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73800657-0-image-a-39_1690808101799.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty","link":"https://www.dailymail.co.uk/sport/football/article-12356709/Sheffield-United-Paul-Heckingbottom-Man-United-Axel-Tuanzebe-Arsenal-Auston-Trusty.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham last season and, was a target for Rangers this summer.","content":"Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty Axel Tuanzebe, 25, was released by Manchester United at the end of 2022-23 Auston Trusty had been a target for Scottish giants Rangers earlier this summer TRANSFER CONFIDENTIAL: Spurs line up Brennan Johnson if Harry Kane leaves By Simon Jones for MailOnline Updated: 14:34 BST, 31 July 2023 e-mail View comments Sheffield United boss Paul Heckingbottom has been in talks with former Manchester United defender Axel Tuanzebe. The newly-promoted Premier League side have also opened talks with Arsenal for defender Auston Trusty. The Blades are pursuing a loan deal for the USA international who was player of the year at Birmingham City last season and, as Confidential readers will know, was a target for Rangers earlier this summer. Sheffield United are keen to get the deal for Trusty over the line, and are set to receive a financial injection from the sale of Iliman Ndiaye to Marseille for £18million. Arsenal would ideally prefer a sale for Trusty. They need to raise funds to offset their spending and appease Financial Fair Play concerns. Sheffield United have opened talks with Arsenal's Auston Trusty and are eyeing Axel Tuanzebe Paul Heckingbottom's side are back in the Premier League after a fine Championship season Arsenal are targeting Brentford keeper David Raya, but face competition from Bayern Munich They want Brentford goalkeeper David Raya but early signs are they will offer around £15m and Brentford are determined to take £30m at least. Arsenal could sell Matt Turner to help the move. The USA international is one on a long list of keepers courted by Nottingham Forest who want Dean Henderson and one other to start the season. Raya is highly regarded by Arsenal keeper coach Inaki Cana who worked with the 27-year-old at Brentford and believes he can provide Aaron Ramsdale with serious competition for the number one jersey. Bayern Munich have not totally given up on Raya but they were offering a loan with obligation and are now looking at Morocco international Yassine Bouno, or 'Bono' to his friends, of Sevilla. Share or comment on this article: Sheffield United boss Paul Heckingbottom holds talks with former Man United star Axel Tuanzebe, as Blades also enter discussions with Arsenal defender Auston Trusty e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:25:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73800011-0-image-a-9_1690808139583.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea fans convinced the Blues are signing Kylian Mbappe after hearing Enzo Fernandez's comment","link":"https://www.dailymail.co.uk/sport/football/article-12356651/Chelsea-fans-convinced-Blues-signing-Kylian-Mbappe-hearing-Enzo-Fernandezs-comment.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mail Sport reported on Sunday night that the Blues 'want to hijack Liverpool's' sensational move for the France World Cup winner.","content":"What was that, Enzo? Chelsea fans are convinced the Blues are signing Kylian Mbappe after hearing Fernandez's comment during trophy lift amid links with a sensational swoop for the PSG star Chelsea believe they may be signing Kylian Mbappe after Sunday's victory The Blues were crowned the first Premier League Summer Series champions Fans think Enzo Fernandez revealed the transfer during the celebrations By Ed Carruthers For Mailonline Updated: 09:33 EDT, 31 July 2023 e-mail 34 shares 2 View comments Chelsea fans are convinced that Enzo Fernandez may have revealed that the club are signing Kylian Mbappe, following their Premier League Summer Series victory . Mail Sport reported on Sunday night that the Blues 'want to hijack Liverpool's' sensational move for the France World Cup winner. It comes as the 24-year-old is edging closer to an exit from Paris Saint-Germain, after the club put him up for sale and left him out of their pre-season tour last week. The forward's ongoing contract saga with the Parisian outfit has soured their relationship so much so that the club are now hoping to cash in on their superstar, with Nasser Al-Khelaifi's side having accepted a jaw-dropping £259million transfer offer for the forward. It's been made clear that he does not want to join the Saudi Pro League side , with Liverpool now reportedly 'holding talks' with the Frenchman , who has 12 months remaining on his contract at the Parc des Princes. Introducing your first-ever #PLSummerSeries champions: @ChelseaFC ! 🏆 pic.twitter.com/yFWiGzXqzO — Premier League (@premierleague) July 30, 2023 Both Chelsea and Liverpool are interested in signing Kylian Mbappe (pictured) with the French superstar's future at Paris Saint-Germain very much up in the air Chelsea, meanwhile, hoisted the Premier League Summer Series title yesterday, and fans believe they over heard Enzo Fernandez (third from left) saying the Frenchman's name Chelsea, meanwhile, are also interested in signing the superstar and their fans seem to think that he could be on his way to Stamford Bridge after their Argentine midfielder was seemingly overheard to be saying his name after their 2-0 victory against Fulham on Sunday. Mauricio Pochettino's side subsequently clinched the pre-season title, having gone unbeaten in the tournament in the US, with Reece James and Thiago Silva stepping forward to lift the trophy alongside their team-mates. And just as they hoisted the cup into the air, fans believe they overheard their midfielder, Fernandez, saying Mbappe's name. 'I heard it loud and clear,' one said, while another added: 'Hearing that for the first time... What's he onto?' 'Can't wait for Boehly to offer Mbappe a 10-year contract,' one wrote. 'Proper weird thing to think of saying in the moment tbh... unless he knows something we dont,' another Twitter user added, posting a thinking-face emoji with the Tweet. Fans have been reacting on Twitter to claims that they overheard Enzo Fernandez say Mbappe's name during their trophy celebrations Pochettino has remained tight-lipped on the potential to sign Mbappe (pictured) in the past According to the Daily Record , Chelsea would be interested in signing the French forward in a player plus-cash deal. But Pochettino last week refused to confirm that his side were interested in signing Mbappe claiming that the situation was 'delicate.' 'I need to be conscious,' the manager told Sky Sports after his side's 1-1 draw against Newcastle last week. 'I cannot talk because everything that you talk is too much noise, it is a very delicate situation and it is a situation they need to fix in Paris with Kylian, Kylian with PSG 'But from our side, nothing to say. We are working in our reality, their reality is different - and they for sure have another reality. 'And from my side, nothing to say - only to support them and hope they find the best solution for both sides.' Share or comment on this article: Chelsea fans convinced the Blues are signing Kylian Mbappe after hearing Enzo Fernandez's comment e-mail 34 shares Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 13:22:48","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/14/73801683-0-image-a-13_1690809734847.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Saint West, 7, Freaks Out After Soccer Star Neymar Throws Him A T-Shirt After Game: Watch","link":"https://hollywoodlife.com/2023/07/31/saint-west-neymar-shirt-kim-kardashian-photos-video/","keywords":["Entertainment","Sports","Kim Kardashian","Neymar","Saint West"],"creator":["Jason Brow"],"video_url":null,"description":"First, Saint West got a selfie with Messi. Now, Kim Kardashian revealed that her eldest son scored a shirt from Neymar after watching him play in Japan – and he got to meet Cristiano Ronaldo, too!","content":"Because the July 25 friendly game between Paris Saint-Germain and Al-Nassr ended in a 0-0 draw, it’s safe to say the real winner of the match was . Saint, 7, and his mom, , were in Japan to see and the rest of PSG square off against , , and the rest of the Al-Nassr squad. “So thankful that our boys’ dreams are coming true,” Kim, 42, captioned a July 31 Instagram Gallery that showed the highlights from this trip – including when Neymar, 31, tossed a t-shirt to Saint. Saint gleefully danced in triumph after he snatched it from the air and showed it to his mom. This isn’t the first that fans have seen Saint at this game. Kim initially posted the photos to her IG story after the game, and YouTuber (aka Darren Watkins Jr.) also spotted Kim, Saint, and their crew in the stands. “Why you got that PSG [jersey] on?” Darren asked Saint, to which the young boy said, “Because I’m gonna meet Neymar first.” Saint also got to meet Ronaldo, 38, after the game – and he switched to an Al-Nassr kit before he did. Saint posed with the football legend for a photo, and Ronaldo even taught Saint a handshake that included his trademark goal celebration. On July 28, Kim from her and Saint’s trip to Miami to see Messi, 36, play his first game with Inter Miami. Along with pictures of her and Saint next to and , Kim posted some pictures of Saint hanging out with the World Cup champ. “Legendary,” Kim said of the whole experience. Kim has been for Saint. The two on Mar. 16. The @AFCStuff twitter account reposted Kim’s Instagram story, showing how Saint donned “a jersey, cheering for as he takes his penalty during the shootout against Sporting CP tonight.” While overseas for the Arsenal/Sporting match, Saint and Kim also made time to catch a PSG game, per . Shortly after that, Kim posted a photo of her son meeting Kylian Mbappé, 24, to her Instagram story. Kim also shared a clip of her son and his friend FaceTiming with Neymar. “The luckiest boys in the world,” she captioned the shot, “Facetiming [Neymar] to wish him a speedy recovery.”","pubDate":"2023-07-31 13:21:22","image_url":"https://hollywoodlife.com/wp-content/uploads/2023/07/kim-kardashian-saint-west-soccer-ftr.jpg","source_id":"hollywoodlife","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Morocco’s Benzina makes history with hijab at Women’s World Cup","link":"https://thefrontierpost.com/moroccos-benzina-makes-history-with-hijab-at-womens-world-cup-2/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"AUCKLAND (AFP): Nouhaila Benzina became the first player to wear a hijab during a Women’s World Cup game when she sported the Muslim headscarf in Morocco’s match against South Korea on Sunday. World governing body FIFA lifted its ban on footballers wearing the hijab nearly a decade ago, after previous concerns over player safety. The […]","content":"AUCKLAND (AFP): Nouhaila Benzina became the first player to wear a hijab during a Women’s World Cup game when she sported the Muslim headscarf in Morocco’s match against South Korea on Sunday. World governing body FIFA lifted its ban on footballers wearing the hijab nearly a decade ago, after previous concerns over player safety. The 25-year-old defender Benzina, who plays her club football in Morocco, ran out against South Korea in Adelaide to write her name in the history books. Benzina shared social media posts in the lead-up to the World Cup about wearing a hijab, but has not spoken to the media in Australia and New Zealand about it. She told broadcaster Al Jazeera recently it would be a proud moment. “Lots of work was done over many years, and thank God it had a positive result,” she said. “We hope to play at a high level and honour Moroccans.” Several other sports have lifted hijab bans in recent years including basketball, but it is still not allowed during official football matches in France. The Moroccan women, coached by Frenchman Reynald Pedros, are at their first Women’s World Cup on the back of a historic runners-up finish at the 2022 Women’s Africa Cup of Nations. They were thrashed 6-0 by Germany in their tournament opener, with Benzina remaining on the bench.","pubDate":"2023-07-31 13:18:05","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash","link":"https://www.dailymail.co.uk/sport/football/article-12356499/Matildas-Canada-World-Cup-Allysha-Chapman-Hayley-Raso-swearing-X-rated-outburst.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Sideline microphones have captured the disgusting spray a Canadian player delivered to Matildas hero Hayley Raso as she lay prone on the ground in Australia's 4-0 win on Monday night.","content":"Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash Matildas thrashed Canada 4-0 Substitute Canadian player was not pleased Launched foul-mouthed spray By Josh Alston For Daily Mail Australia Updated: 13:51 BST, 31 July 2023 e-mail 1 View comments Sideline microphones have captured the disgusting spray a Canadian player delivered to Matildas hero Hayley Raso as she lay prone on the ground in Australia's 4-0 win on Monday night. It was do-or-die for the two nations in the final World Cup group match in Melbourne and the home side shot out of the blocks to dominate from the outset - even as captain Sam Kerr remained benched with a calf injury . Raso was named best on ground with two clutch goals that handed Australia a place in the knockout stages and their first win over powerhouse Canada since 2008. There was plenty of feeling in the match, with the Canadians ranked seventh in the world and fancied to go deep in the tournament prior to the Matildas demolition job. Chapman was not happy with something Australian coach Tony Gustavsson and launched a mighty, foul-mouthed spray in return Raso came off second best in the content but Chapman was not willing to concede that it was her fault after the challenge With the result all but secured, Canadian player Allysha Chapman collided with Raso, with the Australian coming off second best and requiring medical attention on the pitch. Australia coach Tony Gustavsson had some words for Chapman that weren't picked up on the broadcast, and the Canadian erupted in reply. 'She f***ing jumped into me you t***!' she yelled. Commentator David Basheer said: 'Allysha Chapman looked over to Tony Gustavsson and said some pretty stern words. 'It was just a coming together, really. It wasn't Chapman's doing. 'It was just Raso's determination to win the ball.' 'I don't think there was any real malice in the challenge,' fellow commentator and former Matilda Grace Gill added. 'A coming together of bodies, Raso coming off a little worse for wear.' Gustavsson and Raso had the last laugh, sharing an embrace after the Matildas smashed Canada 4-0 to dump them out of the tournament Commentators agreed that the collision was accidental, with both players having eyes only for the ball Fans were disgusted by the tirade, especially as it occured while Raso was down and potentially injured. 'Allysha Chapman’s foul mouth and evil ways make me sick,' one fan posted. 'Look at the scoreboard, you t***. Sincerely, Australia,' replied another. 'Allysha Chapman displaying the most fight this [Canadian team] have shown this tournament,' posted a third. Oooh, langage, Allysha Chapman! 😂 — Emil (@EmilASoccer) July 31, 2023 Raso had the last laugh, though, with the Matildas topping their group for the first time in a World Cup thanks in large part to her heroics. 'Getting a tattoo of Hayley Raso’s face on my face,' one enthusiastic fan proclaimed. 'Hayley Raso. Absolute gun of a player,' posted another. 'This has been a Hayley Raso masterclass,' added another. Australia now wait on the result of the Group D clash between England and China to see who their opposition will be in the round of 16. The Matildas will now focus on emulating or bettering their quarter final appearances at the 2007, 2011 and 2015 World Cup tournaments. Share or comment on this article: Canadian star is busted in X-rated outburst about match-winning Matilda Hayley Raso - and it went to air uncensored during World Cup clash e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 12:51:56","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/13/73798997-0-image-a-8_1690806132897.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada","link":"https://www.dailymail.co.uk/sport/football/article-12355353/Matildas-player-ratings-Canada-Womens-World-Cup-Melbourne-ranked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In an display that was light years ahead of their effort in the shock loss to Nigeria last week, the Matildas were dominant from the first whistle to the last against Canada.","content":"Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada Aussies dominant from the outset in 4-0 win Hayley Raso named best on ground with two goals Mary Fowler also among home team's best By Kristy Williams For Daily Mail Australia Updated: 13:56 BST, 31 July 2023 e-mail View comments The Matildas were dominant against Canada from start to finish despite the crushing pressure of knowing their home World Cup would have been over if they'd lost in Melbourne following their shock defeat to Nigeria last Thursday. Hayley Raso scored a double, Mary Fowler should have had two herself but had one controversially ruled offside by the VAR, and stand-in skipper Steph Catley put an exclamation point on proceedings with a late penalty. It was the biggest win by a Matildas side at any World Cup - and even better, the Aussies were so firmly in control that injured superstar Sam Kerr never had to be called on. Here's how Daily Mail Australia rated the home team... Mackenzie Arnold: 8.5 Made a few poor errors last game that may have dented the confidence, but 'Macca' was back at her best in this match, pulling off a couple of crucial saves but also returning to the brilliant distributor she had been. Ellie Carpenter: 6 Brilliant to see the Lyon star at least back to some decent form. She is such a talented player - one of the best in the world - but where has that spark gone? Carpenter was determined to defend better than the diabolical Nigeria match, and she certainly did that, but Aussies want to see the superstar they fell in love with. Clare Hunt: 8.5 The girl from the tiny town of Grenfell (NSW), was mammoth. Not many better players on the field than Hunt, who has well and truly played Kennedy and Polkinhorne out of the first-choice CB spot. The challenges she won, the time she won them and the distribution she afforded those ahead of her were phenomenal. She won't want the attention but she was as important as any Aussie player. Alanna Kennedy: 6.5 Many expected her to concede her place to Clare Polkinghorne, but Gustavsson picked his most talented centre back. While she didn't reach the heights of a brilliant game against Ireland, she was calmer than the Ireland match and despite a few passing errors she was Steph Catley: 8.5 Goodness, has the stand-in skipper stood up or what? Faded, as expected given the state of the match, as the game went on but the Arsenal jet was at her lethal best down the left - setting up the opening goal with an exquisite touch. Then came the defensive grunt - she was strong. Hayley Raso: 9 Hang it in the Louvre. The fan favourite celebrating a goal that sent the entire nation nuts to open the scoring was one thing - but the new Real Madrid signee kept showing her new Galactico club why they brought her in. Relentless as always but her positioning and nous were brilliant, and she seemed to regain confidence and composure with her first touch, and the fact she, yet again, often finished behind Carpenter showed how hard she worked. Katrina Gorry: 7 Not the workhorse's greatest match, with a fair few very, heavy touches, but the side is so much better for her in it, regardless. Looks to be very sore, and will be more crucial than Sam Kerr when it comes to the playoffs. Worked herself sore, and chased every mistake. Kyra Cooney-Cross: 7.5 A brilliant distributor, Gorry might have been the side's most important passer, but this Young Matilda has been sensational. Did she get found out? Don't think so. She never looks flustered, but has a better touch than her veteran counterpart. Emily Van Egmond: 6 Flirted between centre midfield and forwards, and wasn't much of an influence in either. But she certainly didn't let anyone down, despite not posing much of a threat. Caitlin Foord: 9 The happiest person in the Australian side Mary Fowler could play. The shackles were unleashed and the Arsenal star looked like a different player, free of the huge burden she looked to shoulder in the Nigeria loss. The first touch, the through balls...the effort chasing back in defence - she was a woman possessed. Mary Fowler: 9 Fowler is ecstatic after her goal gave the Aussies a 3-0 lead - after her first score was controversially called back for offside by the VAR One thing's for sure, when Sam Kerr (hopefully) lines up in the Round of 16, Mary Fowler will be there either way. What a stunning performance. The first touch, the dribbling, the passing... it's all Mary's world and we are just living in it. Clare Polkinghorne: N/A Subbed on late, as she has the last two, and fortunately didn't need to make a difference in this one. Share or comment on this article: Matildas player ratings: See which Australian stars excelled and who struggled in World Cup demolition of Canada e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-31 12:48:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/31/12/73795769-0-image-a-13_1690804742491.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Urgent warning ahead of Dublin’s homecoming celebrations as fans warned of severe issues around All-Ireland celebrations","link":"https://www.thesun.ie/sport/gaa-football/11113071/dublins-homecoming-celebrations-all-ireland-road-closures/","keywords":["GAA Football","Sport","GAA"],"creator":["Vincent Whelan"],"video_url":null,"description":null,"content":"DUBLIN fans intent on attending the homecoming for their All-Ireland winning heroes have been warned to take heed of several instructions. Fresh off an epic win over their greatest rivals Kerry , the capital will see a huge celebration occur in Smithfield Square on Monday evening. The event is due to get under way from 6.30 pm. However, supporters are being advised to allow plenty of time in order to get there on time since it will be guaranteed to be extremely busy. In addition to that, access to Smithfield Square is only going to permitted from North King Street, Friary Avenue and Thundercut Alley. The miserable weather means attendees should also allow extra time to ensure they get there safe and sound. Dublin City Council is asking people to use public transport when travelling to and from the event, which is a family-friendly alcohol-free event. The Lord Mayor Daithí de Róiste said: “Winning an All-Ireland title is always amazing, but beating Kerry in the final? \"It doesn’t come much better than that! \"I can’t wait to see everyone in Smithfield this evening. Let’s have a party and celebrate the boys in blue!” There will be entertainment provided on the evening, before the team takes to the stage to be welcomed by MC and RTE commentator Marty Morrissey. To celebrate the team’s achievement, Beckett Bridge and the Smithfield Sails will light up in blue both on Sunday evening and Monday evening. While Sunday's match was similarly blighted by the weather, it still wound up being a fascinating battle. Dublin were in most people's eyes the marginally better side over the course of the seventy-odd minutes. They had been in control prior to David Clifford pulling a magical pass out of nowhere just before half-time like a magician pulling a rabbit out of his hat. That teed up Paul Geaney's composed finish into the back of the net to send the Munster kingpins in at the break with a one-point lead. But Gavin White's costly turnover around the 50th minute resulted in Paddy Small blasting home a goal of their own. And while the defending champions fought resolutely to the bitter end, The Sky Blues kicked for home thanks to late scores from Brian Fenton and sub Dean Rock.","pubDate":"2023-07-31 12:33:41","image_url":null,"source_id":"thesun_ie","category":["sports"],"country":["ireland"],"language":"english"}]}