{"newsArray":[{"title":"What time and TV channel is Castletown v Fossa on today in the AIB GAA Football All-Ireland Junior Club Championship","link":"https://www.irishmirror.ie/sport/gaa/gaelic-football/what-time-tv-channel-castletown-28882074","keywords":["Sport"],"creator":["news@irishmirror.ie (Oisin Doherty)"],"video_url":null,"description":"All the information you need ahead of the AIB GAA Football All-Ireland Junior Club Championship semi-finals.","content":null,"pubDate":"2023-01-07 06:00:00","image_url":"https://i2-prod.irishmirror.ie/incoming/article28881924.ece/ALTERNATES/s98/0_Fossas-David-Clifford.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Football: Fifa to introduce cap on fees in widespread agent rule changes","link":"https://www.straitstimes.com/sport/football/football-fifa-to-introduce-cap-on-fees-in-widespread-agent-rule-changes","keywords":null,"creator":null,"video_url":null,"description":"January 07, 2023 1:32 PMLONDON - World football’s governing body Fifa will this week introduce widespread rule changes on how football agents operate, including a cap on the transfer commissions they receive and the introduction of an exam, the organisation confirmed on Friday.","content":null,"pubDate":"2023-01-07 05:32:24","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Liverpool vs Wolves, other FA Cup matches to thrill Nigerian fans","link":"https://guardian.ng/sport/liverpool-vs-wolves-other-fa-cup-matches-to-thrill-nigerian-fans/","keywords":["Football","Sport","FA Cup","Liverpool vs Wolves"],"creator":["Guardian Nigeria"],"video_url":null,"description":"After an exciting round of mid-week games, the FA Cup returns with even more interesting fixtures this weekend. Football never stops. Whether it is the Premier League, La Liga, Champions League, or international games, there is almost always some action to watch on DStv. Here are some fixtures for this weekend. Liverpool vs Wolves The […] The post Liverpool vs Wolves, other FA Cup matches to thrill Nigerian fans appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"After an exciting round of mid-week games, the FA Cup returns with even more interesting fixtures this weekend. Football never stops. Whether it is the Premier League, La Liga, Champions League, or international games, there is almost always some action to watch on DStv. Here are some fixtures for this weekend. Liverpool vs Wolves The defending champions, Liverpool, will go against Wolves for the third-round clash at Anfield today. The new Wolves’ head coach, Julen Lopetegui, was frustrated after Liverpool got an extra two days to prepare for the third-round encounter at Anfield, while Wolves fought out a 1-1 draw with Aston Villa on Wednesday night. Jurgen Klopp’s Liverpool lost at Brentford 48 hours earlier. This match will hold today, at 9:00 pm local time on DSTV SuperSport Premier League (Ch. 203). Tottenham vs Portsmouth Tottenham will host Portsmouth in the FA Cup third round this afternoon in a bid to end their 15-year trophy drought. Reigniting their top-four charge with a bang, Tottenham is still outside the Champions League places in fifth – two points behind Manchester United. However, the Red Devils team has played one game more than Tottenham. An elusive piece of silverware will be on the menu if Conte’s side can now make waves in the FA Cup. The match will hold at 1:30 pm local time on DSTV SuperSport Premier League (Ch. 203) Man City vs Chelsea Chelsea, who lost 1-0 to Manchester City in the Premier League on Thursday night, will travel to the Etihad Stadium on Sunday for their FA Cup third-round tie. Chelsea-Manchester City matches have often been breathtaking over the years, most especially in recent ones. No rival has secured more wins against the Citizens in the Premier League era than Chelsea’s 27. Equally, as a coach, Pep Guardiola has not lost to any club more than the Londoners (eight times). The match will hold on Sunday at 5:30 pm local time on DSTV SuperSport Premier League (Ch. 203) Aston Villa vs Stevenage Aston Villa welcomes League Two Stevenage to Villa Park on Sunday afternoon in the third round of this season’s FA Cup. The hosts, who are now under the stewardship of Unai Emery, currently sit 11th in the Premier League standings, accumulating 10 points from their last five matches. This season, Stevenage has proven excellent in League Two, catching people by surprise. This clash on Sunday afternoon at Villa Park may be a superb outing for Stevenage or Aston Villa fans. This match will be on DStv on Super Sport Football Plus (Ch. 202) by 5:30 pm. Follow Us","pubDate":"2023-01-07 03:34:33","image_url":null,"source_id":"guardian","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Football-Match amical : Défaite des Barea face aux Congolais","link":"https://midi-madagasikara.mg/2023/01/07/football-match-amical-defaite-des-barea-face-aux-congolais/","keywords":["Sports","Barea","Congolais","Défaite","Football-Match amical","Madagascar"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Un match difficile pour les Barea A’. L’équipe malgache a été battue par les Diables Rouges du Congo Brazzaville sur le score de 1 à 0, hier, lors d’un match amical à Tunis. Une défaite qui ne devrait pas impacter le moral des protégés de Rôrô Rakotondrabe à huit jours du coup d’envoi de la […] L’article <strong>Football-Match amical : Défaite des Barea face aux Congolais </strong> est apparu en premier sur Midi Madagasikara.","content":"Un match difficile pour les Barea A’. L’équipe malgache a été battue par les Diables Rouges du Congo Brazzaville sur le score de 1 à 0, hier, lors d’un match amical à Tunis. Une défaite qui ne devrait pas impacter le moral des protégés de Rôrô Rakotondrabe à huit jours du coup d’envoi de la septième édition du Championnat d’ Afrique des Nations réservée aux joueurs locaux ou CHAN. Malgré les séances d’entraînements intenses des Barea depuis le début de cette semaine, ils ont encore eu du mal à s’adapter au gazon naturel. Le seul et unique but a été marqué durant la première mi-temps. Une confirmation pour les Diables Rouges qui se trouvent à la 99e du classement de la FIFA et 21e en Afrique tandis que les Barea de leur part occupent le 102e rang. Mais l’essentiel pour le coach c’est de pouvoir en tirer des leçons à l’issue de cette première rencontre amicale. C’était le troisième match test de l’équipe nationale Barea A’, car ils ont déjà remporté 3 buts à 1 lors du premier match à domicile contre la sélection Réunionnaise le 17 décembre 2022. Puis, Berajo et ses coéquipiers se sont imposés sur le score de 1 but à 0 face à l’équipe de l’Uscafoot le 30 décembre passé. Le deuxième match de préparation sur le sol tunisien se jouera ce lundi. La bande à Nina s’opposera à l’équipe de Niger. Une dernière ligne droite avant de rejoindre la Capitale d’ Algérie pour le CHAN.  Manjato Razafy  L’article <strong>Football-Match amical : Défaite des Barea face aux Congolais </strong> est apparu en premier sur Midi Madagasikara.","pubDate":"2023-01-07 03:00:00","image_url":null,"source_id":"madagasikara","country":["madagascar"],"category":["sports"],"language":"french"},{"title":"RNS 2023 : Rendez-vous à Vichy pour la 48e édition","link":"https://midi-madagasikara.mg/2023/01/07/rns-2023-rendez-vous-a-vichy-pour-la-48e-edition/","keywords":["Sports","48e édition","Madagascar","Rendez-vous","RNS 2023","Vichy"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Pour la énième fois, la ville de Vichy accueillera les grandes retrouvailles de la communauté malgache de France les 8, 9 et 10 avril 2023. C’est confirmé. Le comité exécutif de la RNS vient de publier la ville hôte de la 48e édition de la Rencontre Nationale Sportive 2023. « Cette ville a toujours su nous […] L’article <strong>RNS 2023 : Rendez-vous à Vichy pour la 48<sup>e</sup> édition </strong> est apparu en premier sur Midi Madagasikara.","content":"Qui va succéder à l’équipe de l’AS Baobab chez les vétérans? Pour la énième fois, la ville de Vichy accueillera les grandes retrouvailles de la communauté malgache de France les 8, 9 et 10 avril 2023. C’est confirmé. Le comité exécutif de la RNS vient de publier la ville hôte de la 48e édition de la Rencontre Nationale Sportive 2023. « Cette ville a toujours su nous accueillir et parce qu’on s’y sent comme à la maison. Vichy sera notre ville hôte pour la 48e édition de la RNS. Sa situation permet à tous les amis de Madagascar, habitant même aux quatre coins de la France, de venir pour que l’on puisse se retrouver tous ensemble. Sportifs et amoureux de la culture malgache, nous vous donnons rendez-vous les 8, 9 et 10 avril pour faire partie du plus grand événement sportif de la communauté malgache », tel est le message du comité d’organisation. Comme en 2019 et 2022, la ville de Vichy a été choisie pour accueillir pour la troisième année consécutive les tournois annuels de la RNS.  Lors de la dernière édition à Vichy, 9 disciplines sportives étaient au programme dont le football (jeunes, masculin et vétéran), le foot à 5, le volley-ball (féminin et masculin), le basket-ball (féminin, masculin et vétéran), le tennis, le tennis de table, les arts martiaux, la pétanque, le rugby et l’E-Sport. Outre les activités sportives, la culture est aussi à l’honneur, entre autres les différents concours et des ateliers dédiés aux enfants de 7 à 77 ans pour des jeux de société et des jeux traditionnels. Cette année, le nombre de disciplines n’est pas encore finalisé  ainsi que les détails des inscriptions aux tournois. Forte d’une expérience de plus de quarante ans dans la réalisation de la manifestation dans différentes villes européennes, la RNS est l’unique organisation indépendante malgache qui fédère et coordonne l’expertise et les compétences d’une centaine de bénévoles, pour les mettre fraternellement au service de la communauté.  T.H L’article <strong>RNS 2023 : Rendez-vous à Vichy pour la 48<sup>e</sup> édition </strong> est apparu en premier sur Midi Madagasikara.","pubDate":"2023-01-07 03:00:00","image_url":null,"source_id":"madagasikara","country":["madagascar"],"category":["sports"],"language":"french"},{"title":"Football: Romeo Beckham signs deal to play for Premier League side Brentford’s B team","link":"https://www.newstalkzb.co.nz/news/sport/football-romeo-beckham-signs-deal-to-play-for-premier-league-side-brentford-s-b-team/","keywords":null,"creator":null,"video_url":null,"description":"Romeo Beckham, the son of England football great David Beckham, will be playing on English soil over the coming months after signing a contract with Premier League club Brentford to play in its reserve team. Romeo, who currently plays for US team Inter Miami II, the reserve team of the MLS club co-owned by his father, has been training with the Brentford B team as part of his off-season from Major League Soccer (MLS) and has now been announced as a short-term signing for the team through to the end of the English 2022/23 season. While the 20-year-old is yet to show the pure class of his father - David had already played three seasons of Premier League football for Manchester United by the time he was 20 - the signing has caused a stir amongst the UK football community and has been suitably promoted by his new club. Accompanying the signing announcement on Saturday, Brentford FC posted a hype video of Romeo in its red and white striped shirt which garnered hundreds of thousands of views within hours. Alongside the video, a heart-warming photo was released showing David with his hand protectively on the shoulder of Romeo as he signed his new contract. Romeo himself says he’s excited to play in England and join a group of players he says he already has a strong connection with. “If you look at Brentford as a club, it’s very positive and it’s a club that is on the rise very quickly. I’m very grateful to be here.” he said in a statement. “They are all very talented players, and they drive me to be even better in myself. A few of them give me some kicks and I give them back, but we all come into work hard to get better in ourselves and the coaches drive that.” Romeo’s Inter Miami CF II team finished sixth in the MLS Next Pro league last season, thanks in part to his league-high 10 goal-assists and two goals. One of those goals bore a remarkable similarity to the ones his father turned into a signature move over the course of his 21-year professional career. Romeo has only recently returned to focussing on football - he was part of Arsenal’s junior academy as a young teenager - after spending five years playing tennis. It has been reported that a US$40,000 (NZ$62,994) tennis court was built at a property owned by his parents to aide his tennis dream, before it was summarily demolished and replaced by a football pitch when Romeo decided to return to playing football in 2020. Brentford B’s next match is scheduled to take place February 3 against Ulsan FC in the Atlantic Cup.","content":"Romeo Beckham, the son of England football great David Beckham, will be playing on English soil over the coming months after signing a contract with Premier League club Brentford to play in its reserve team. Romeo, who currently plays for US team Inter Miami II, the reserve team of the MLS club co-owned by his father, has been training with the Brentford B team as part of his off-season from Major League Soccer (MLS) and has now been announced as a short-term signing for the team through to the end of the English 2022/23 season. While the 20-year-old is yet to show the pure class of his father - David had already played three seasons of Premier League football for Manchester United by the time he was 20 - the signing has caused a stir amongst the UK football community and has been suitably promoted by his new club. Accompanying the signing announcement on Saturday, Brentford FC posted a hype video of Romeo in its red and white striped shirt which garnered hundreds of thousands of views within hours. Alongside the video, a heart-warming photo was released showing David with his hand protectively on the shoulder of Romeo as he signed his new contract. Romeo himself says he’s excited to play in England and join a group of players he says he already has a strong connection with. “If you look at Brentford as a club, it’s very positive and it’s a club that is on the rise very quickly. I’m very grateful to be here.” he said in a statement. “They are all very talented players, and they drive me to be even better in myself. A few of them give me some kicks and I give them back, but we all come into work hard to get better in ourselves and the coaches drive that.” Romeo’s Inter Miami CF II team finished sixth in the MLS Next Pro league last season, thanks in part to his league-high 10 goal-assists and two goals. One of those goals bore a remarkable similarity to the ones his father turned into a signature move over the course of his 21-year professional career. Romeo has only recently returned to focussing on football - he was part of Arsenal’s junior academy as a young teenager - after spending five years playing tennis. that a US$40,000 (NZ$62,994) tennis court was built at a property owned by his parents to aide his tennis dream, before it was summarily demolished and replaced by a football pitch when Romeo decided to return to playing football in 2020. Brentford B’s next match is scheduled to take place February 3 against Ulsan FC in the Atlantic Cup.","pubDate":"2023-01-07 01:35:07","image_url":"https://www.newstalkzb.co.nz/media/gvrb1pe2/romeo-beckham-signs-his-contract-with-brentford-under-the-supervision-of-his-father-david.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Sarah Taylor, wife of Zac Taylor, delivers kids' cards to Damar Hamlin","link":"https://www.wcpo.com/sports/football/bengals/sarah-taylor-wife-of-zac-taylor-teams-up-with-nfl-coaches-wives-to-deliver-kids-cards-to-damar-hamlin","keywords":null,"creator":null,"video_url":null,"description":"Taylor said she collected handmade cards from 40 schools in Cincinnati — and even more out of town — wishing Damar Hamlin a speedy recovery.","content":"Sarah Taylor, the wife of Bengals head coach Zac Taylor, delivered hundreds of cards from local students to UC Medical Center Friday for Bills safety Damar Hamlin.Taylor said she collected handmade cards from 40 schools in Cincinnati — and even more out of town — wishing Hamlin a speedy recovery after he collapsed on the field during the Bengals-Bills Monday Night Football game.The Bills said Hamlin went into cardiac arrest. While he's still in the hospital, doctors said Hamlin has made \"remarkable\" progress and is able to talk with friends and family. Hopefully, he'll have time to read letters like the one Edwin sent.\"Dear Damar Hamlin, I am so sorry about your injury,\" Edwin wrote. \"I was up till 3:00 a.m. thinking about you. Get better soon the Bills are nothing without you.\"Taylor's son, Brooks, joined his fifth-grade class at Cardinal Pacelli in writing a letter to Hamlin.\"He got really hurt — and he's not just a player, he's a person too, so we need to support him so he gets better,\" Brooks Taylor said.Many of the students said they saw what happened and felt like making the cards helped them feel better as well.\"Everybody wants to be part of something,\" said Terri Cento, Cardinal Pacelli principal. \"And sometimes in cases like this when you're like so far removed, but yet you've seen it, like, 'What could I do to help the situation?' So sometimes just a simple thing is making a card and sending it makes you feel better.\"Taylor has also been working with fellow NFL coaches' wives to deliver cards from across the country. She said she is waiting on cards from Kansas City and Seattle.","pubDate":"2023-01-07 01:31:06","image_url":null,"source_id":"wcpo","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Deep dive: Everything you need to know about the Bulldogs","link":"https://www.themercury.com.au/sport/nrl/nrl-team-previews-2023-bulldogs-free-agency-wrap-crystal-ball-predictions/news-story/bdc741642af7ef9dd206e383191dc6dd","keywords":["Canterbury Bulldogs","NRL News","Sport news and galleries"],"creator":null,"video_url":null,"description":"They signed the hottest coach-in-waiting and two of the biggest recruits of the off-season, but can Canterbury make it all work on the field?","content":"Here’s everything you need to know about the Bulldogs ahead of the 2023 NRL season kick off in a News Corp exclusive club-by-club deep dive series.2022 RICH 100 reps: 6Tevita Pangai Jr (12, $925k), Luke Thompson (39, $750k), Jack Hetherington (85, $550k), Matt Burton (82, $550k), Josh Addo-Carr (93, $500k) and Corey Allan (94, $500k).FREE AGENCY WRAPThe drums are beating in Belmore on the back of the competition’s most hotly-anticipated recruitment drives. The Dogs get an A rating for their 2023 recruits with Eels grand final hooker Reed Mahoney set to solve the club’s dummy-half issue that has plagued them ever since Michael Ennis was let go in 2015. Equally as significant is the signing of the game’s most damaging backrower Viliame Kikau. He doesn’t only create carnage with the ball in his hand, but it’s what he can provide for his support men and more importantly, in defence, which is a mandatory area of improvement for the Dogs. Arguably the club’s most important signing in Canterbury’s roster rebuild was sealed in early January when star playmaker Matt Burton extended his stay at Belmore until the end of season 2027.Add more starch in the pack with ex-Raiders prop Ryan Sutton and the capable Andrew Davey and Canterbury should be laying an even greater platform than last season for Matt Burton to launch his aerial raids.Rating: ACOACH STATUS: CAMERON CIRALDO (2027)Cameron Ciraldo arrives at Belmore after a deliberately patient approach towards becoming an NRL coach and it was GM of football Phil Gould who wore the rookie down to sign. Ciraldo is huge on building trust and bonds within his playing ranks, so let’s see how tight this squad becomes. Ciraldo’s first season will also be about adopting an identity for the Dogs following a five-year period of mass roster and coach changes. The appointment of club legend Andrew Ryan as a cultural driver speaks to that. Defence will be the absolute focus of every performance and key to Ciraldo’s arrival to the big stage is the fitness of his players, which is being led by former Rabbitohs and Roosters head of high performance Travis Touma. Safety Rating: ALIKELY DEBUTANT/SJeral Skelton:Timing is everything in rugby league and the Dogs lean depth in their outside backs could provide Skelton, a former Australian rugby sevens player, his taste of NRL in 2023. Skelton is aiming to follow in the footsteps of a former sevens teammate, Cronulla’s Lachlan Miller. Seriously powerful, Skelton is a hard-running centre, who joined the Dogs on a train and trial contract at the end of last season. He wasted little time displaying glimpses of his promise in the NSW Cup with three tries in six games. Clearly he still has a lot to learn to perfect the cross-code switch, but the good judges suggest his shot could come in 2023. Bulldogs fact boxWHO TAKES THE NEXT STEP?Jacob Kiraz. Canterbury’s 2022 Rookie of the Year is on a trajectory that should have every Dogs fan excited. In his rookie season, Kiraz scored six tries in 14 games on the wing after playing one game, in his debut, at centre.The local junior finished the year with the invaluable experience of playing fullback for Lebanon in a quarter-final clash against Australia. The 20-year old has since made no secret that he wants to be wearing the Dogs No. 1 in the future. Kiraz faces competition from 2022 fullback Jake Averillo for the jersey, but should the young talent continue to apply pressure through his performances, he could ultimately halt the Dogs powerbrokers from making a big-money play for a fullback.Kiraz is contracted to the Dogs until 2024, but should he further his footy in 2023, watch for the Dogs to try and take him off the market and extend his future at Belmore.THREE BURNING ISSUES1. Who is the captain of the Kennel? The shock retirement of club captain and forward pack mainstay Josh Jackson has left a leadership void at the Dogs. Jackson may have been tapering in his influence with the ball, but he was immense inside the dressing room as a voice of reason, experience and respect. Who steps up in his absence, will be critical. Without a senior figure and obvious replacement as captain, a leadership team of Luke Thompson, Josh Addo-Carr, Matt Burton and Reed Mahoney must emerge as the figureheads that others follow.2. The 1,6,7 and 9The Dogs will boast their best spine in several seasons with the arrival of Reed Mahoney from Parramatta. That class could prove crucial in servicing Kyle Flanagan. Flanagan has impressed the Dogs coaching staff with his focus, fitness levels and desire so far this pre-season. Unlike this time last year, it seems Flanagan is being backed to wear the No. 7 in round one. Similarly, Jake Averillo has spent the entire pre-season at fullback, and not at centre or in the halves. Key will be Matt Burton, who despite his obvious talent, won’t have much time to form combinations following his recovery from a World Cup lay-off.Who will win the 2023 NRL premiership?3. Can TPJ fire for Dogs?The best of Tevita Pangai Jr could prove season-defining for Canterbury. The power forward has talked up a big game in wanting to show his best for the club in 2023. He has vowed to be in the best shape of his career. If Pangai Jr can be the devastating forward he wants to be, it could be enough to drive the Dogs to the finals.CRYSTAL BALLUndeniably the big improvers of 2023 with game-influencing inclusions of Reed Mahoney and Viliame Kikau. Their entire club-wide mentality shift towards a defensive mindset under new coach Cameron Ciraldo will also be significant. Finals should be the goal, but the concern is their lack of depth and leadership when the going gets tough. Between 9th and 12th.Finish the last five years2022: 12th2021: 16th2020: 15th2019: 12th2018: 12th2023 oddsPremiership: $21Minor premiership: $26To make grand final: $10Top four: $5Top eight: $2.10Most losses: $26Watch every game LIVE & ad-break free during play is on FOX LEAGUE with Kayo Sports. New to Kayo? Start your free trial now >","pubDate":"2023-01-07 01:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Chelsea want reassurances that Mykhailo Mudryk wishes to join them before competing with Arsenal - Daily Mail","link":"https://news.google.com/__i/rss/rd/articles/CBMiiAFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvc3BvcnQvZm9vdGJhbGwvYXJ0aWNsZS0xMTYwODQ5OS9DaGVsc2VhLXdhbnQtcmVhc3N1cmFuY2VzLU15a2hhaWxvLU11ZHJ5ay13aXNoZXMtam9pbi1jb21wZXRpbmctQXJzZW5hbC5odG1s0gGMAWh0dHBzOi8vd3d3LmRhaWx5bWFpbC5jby51ay9zcG9ydC9mb290YmFsbC9hcnRpY2xlLTExNjA4NDk5L2FtcC9DaGVsc2VhLXdhbnQtcmVhc3N1cmFuY2VzLU15a2hhaWxvLU11ZHJ5ay13aXNoZXMtam9pbi1jb21wZXRpbmctQXJzZW5hbC5odG1s?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Chelsea want reassurances that Mykhailo Mudryk wishes to join them before competing with Arsenal  Daily MailMykhaylo Mudryk's agent breaks silence on Arsenal and Chelsea transfer with 'decision' claim  Football.LondonMykhaylo Mudryk 'makes Chelsea U-turn' after dropping Arsenal transfer hints  The MirrorMykhaylo Mudryk agent delivers transfer update amid Arsenal and Chelsea talks  Evening StandardTransfer News RECAP: Real Madrid lead race to sign Jude Bellingham  Daily MailView Full coverage on Google News","content":null,"pubDate":"2023-01-07 00:10:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Damar Hamlin's breathing tube removed and he's able to talk, telling teammates \"Love you boys,\" Buffalo Bills say","link":"https://www.cbsnews.com/newyork/news/damar-hamlin-breathing-tube-removed-able-to-talk-buffalo-bills/","keywords":["U.S.","Sports","Local News"],"creator":["CBS New York"],"video_url":null,"description":"The Buffalo Bills say Damar Hamlin is breathing on his own and able to speak to his family, doctors and teammates.","content":"Buffalo Bills safety Damar Hamlin is breathing on his own and able to talk after having his breathing tube removed, his agent and the team said Friday — the latest step in his remarkable recovery in the four days since going into cardiac arrest and being resuscitated on the field during a game against the Cincinnati Bengals.The Bills said Friday in a statement that Hamlin's \"neurologic function remains intact and he has been able to talk to his family and care team.\" The development was first reported by The Athletic.\"He continues to progress remarkably in his recovery,\" the Bills said in a tweet.In another tweet, the team said he joined players and coaches for their daily meeting via FaceTime and said: \"Love you boys.\"  Damar Hamlin FaceTimed into our team meeting today to talk to players and coaches.What he said to the team: “Love you boys.” ❤️ pic.twitter.com/8dorrWNaxt— Buffalo Bills (@BuffaloBills) January 6, 2023 Speaking with reporters, Bills coach Sean McDermott called the moment \"amazing\" and \"touching.\"\"I probably won't be able to do it justice,\" McDermott said. \"… To see Damar, No. 1, through my own eyes, I know it's something I've been looking forward to, kind of needing to see, I guess.\"McDermott said he kept it a secret from the team before announcing he had \"a treat in store\" for them — putting Hamlin on the big screen in the meeting room.\"They stood up right away and clapped for him and yelled some things to him, and it was a pretty cool exchange for a few seconds there,\" McDermott said.Hamlin flexed his arms — drawing a laugh from the coach — put his hands together to form a heart and gave his teammates a thumbs-up, McDermott said.\"He's just an infectious young man with an infectious personality,\" McDermott said.Damar Hamlin, No. 3 of the Buffalo Bills, is seen on October 9, 2022, in New York. Bryan Bennett/Getty Images Bills offensive tackle Dion Dawkins later told reporters the team has been riding a roller coaster and was experiencing \"a positive energy right now.\"\"We got to see our guy, and we got to see 3 smile, and that's literally all we wanted, you know?\" Dawkins said. \"He's here with us, and that's all that we can ask for, is that he's taking steps forward, so it's still very emotional for a lot of guys, and we're happy, we're blessed and extremely thankful.\"The 24-year-old Hamlin was still listed Thursday in critical condition in the intensive care unit of the University of Cincinnati Medical Center. Aside from being able to communicate by writing, Hamlin was also been able to grip people's hands.\"So we know that it's not only that the lights are on. We know that he's home. And it appears that all the cylinders are firing within his brain, which is greatly gratifying for all of us,\" Dr. Timothy Pritts said. \"He still has significant progress he needs to make, but this marks a really good turning point in his ongoing care.\"Hamlin's recovery continues to trend in a positive direction after his heart stopped while making what appeared to be a routine tackle in the first quarter of a game against the Bengals on Monday night. The second-year player spent his first two days in the hospital under sedation to allow his body to recover, and on a ventilator to assist his breathing. The Bills were uplifted by the encouraging medical reports as they returned to practice Thursday in preparation to play a home game against the New England Patriots on Sunday. The sight of Hamlin collapsing, which was broadcast to a North American TV audience on ESPN's \"Monday Night Football,\" has led to an outpouring of support from fans and players from across the league. Fans, team owners and players — including Tom Brady and Russell Wilson — have made donations to Hamlin's Chasing M's Foundation, which had raised more than $7.8 million by Friday morning.","pubDate":"2023-01-07 00:06:00","image_url":"https://assets2.cbsnewsstatic.com/hub/i/r/2023/01/05/1a236d90-e142-4147-89ff-7db8e3f601f2/thumbnail/1024x576/28e9f8167afed77d4b6180f29d5cc842/hypatia-h-eda970bb6c24c8af19f0758ef992f2f8-h-f3791670e7284ef7be6e02e9dc3f6d87.jpg","source_id":"newyorkcbslocal","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Lampard says future not under his control after Everton exit FA Cup","link":"https://www.malaymail.com/news/sports/2023/01/07/lampard-says-future-not-under-his-control-after-everton-exit-fa-cup/48858","keywords":["Frank Lampard","Everton","FA Cup"],"creator":null,"video_url":null,"description":"MANCHESTER, Jan 7 ― Everton manager Frank Lampard said his future at the club was out of his control after his side w...","content":"MANCHESTER, Jan 7 ― Everton manager Frank Lampard said his future at the club was out of his control after his side were knocked out of the FA Cup by Manchester United following a 3-1 defeat today. Everton slipped into the relegation zone after a 4-1 home defeat by Brighton & Hove Albion on Tuesday and were booed off the pitch but after a sixth defeat in seven matches, Lampard insisted he was not worried about his job. “That's not under my control. It's not for me to focus on that. It's for me to focus on what I saw tonight and that was a performance that every manager wants with the attitude of the team, and the focus,” Lampard told ITV. “The focus now is Southampton (Everton's next league fixture). I don't want to talk about my future, I only want to talk about the players and how well they played.” Conor Coady cancelled out Antony's opening goal in the first half but then put the ball in his own net after the interval to restore United's lead. Everton had a goal ruled out for offside after a VAR review before a late Marcus Rashford penalty sealed their fate. Everton also had forward Alex Iwobi carried off on a stretcher and Lampard said the player had damaged ligaments in his ankle and was in crutches. “I think we deserved better,” Lampard added. “The players were very, very good in a sense of organisation, the game plan, the work ethic. Things which should be basics in football but people question them when you have a performance like we did the other night (against Brighton). “We were really good. We had the better chances I think. Good chances for us and a goal disallowed. Marcus Rashford was probably the difference between the teams. A top individual talent can do that to you.” The 9,000 visiting supporters largely applauded their team off the pitch after the FA Cup defeat, and Lampard said their reaction showed his side could still turn their fortunes around. “When the players perform with the spirit of an Everton player, the fans will react to that. Even in defeat and that says a lot,” he added. “This league can change very quickly and when you're in a difficult run you have to work really hard to get out of it but it can change.” ― Reuters","pubDate":"2023-01-06 23:39:56","image_url":null,"source_id":"malaymail","country":["singapore","malaysia"],"category":["sports"],"language":"english"},{"title":"Potter confident of support from Chelsea owners despite slump","link":"https://www.malaymail.com/news/sports/2023/01/07/potter-confident-of-support-from-chelsea-owners-despite-slump/48857","keywords":["Graham Potter","chelsea","EPL"],"creator":null,"video_url":null,"description":"LONDON, Jan 7 ― Graham Potter says he has the “full support” of Chelsea's owners and players as he tries to turn arou...","content":"LONDON, Jan 7 ― Graham Potter says he has the “full support” of Chelsea's owners and players as he tries to turn around the club's fortunes after a disappointing start to his tenure. Potter's side have won just one of their past eight Premier League games, slipping to a 1-0 home defeat to Manchester City at Stamford Bridge on Thursday. Speculation is growing over the future of the former Brighton boss, who took over at Chelsea in September, but he said he did not need validation from anybody outside the club. “The owners are billionaires so they're quite smart,” he said. “Smarter than me, that's for sure. So they understand the challenges that we have and the direction we want to go in. I've been here four months and five, six weeks of that have been lost to international football. “I think Pep (Guardiola) was (at Manchester City) a year before they'd won anything, and then obviously Mikel (Arteta) and Jurgen (Klopp) took a bit of time. But obviously it's maybe different for me, for some reason. But I don't put a timescale on it. I know the responsibility we have here. “But also I know that I am capable, and I know the quality that I have and I have the full support of certainly the owners, the players and the staff here.” Chelsea go head-to-head with City again on Sunday, this time at the Etihad in the FA Cup third round. Raheem Sterling and Christian Pulisic were both forced off the pitch on Thursday, adding to an injury nightmare Potter summarised by saying: “I've never experienced anything like it.” The pair could be added to a growing list that includes N'Golo Kante, Reece James, Wesley Fofana, Mason Mount, Ben Chilwell, Armando Broja, Ruben Loftus-Cheek and Edouard Mendy. The Blues boss said it was unfair to judge him on a season disrupted by an injury crisis and the World Cup. “I'm not sitting here (as) some egomaniac that has all the answers and gets everything right,” he said. “Of course that's not the case. But at the same time, there's some challenges that we face, there's some margins in the Premier League that are difficult. “We've had a massive transition ― problems in terms of injuries don't make it easy to be stable.” ― AFP","pubDate":"2023-01-06 23:37:43","image_url":null,"source_id":"malaymail","country":["singapore","malaysia"],"category":["sports"],"language":"english"},{"title":"Italian Football Great Gianluca Vialli Dies At 58","link":"https://independent.ng/italian-football-great-gianluca-vialli-dies-st-58/","keywords":["Sports"],"creator":["Agency Report"],"video_url":null,"description":"Former Juventus, Chelsea, and Italy striker Gianluca Vialli has died aged 58 of pancreatic cancer, his former clubs announced on Friday. Vialli was diagnosed with cancer in 2017 but was still able to play a significant role in Italy’s European Championship title-winning campaign in 2021 assisting long-time Sampdoria strike partner and national coach Roberto Mancini. However, the signs were […]","content":null,"pubDate":"2023-01-06 23:29:00","image_url":null,"source_id":"independentng","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Bayern Defender Mazraoui Out With Heart Inflammation","link":"https://independent.ng/bayern-defender-mazraoui-out-with-heart-inflammation/","keywords":["Featured","Football"],"creator":["Agency Report"],"video_url":null,"description":"Bayern Munich’s Moroccan defender Noussair Mazraoui is to take some time away from football to deal with inflammation of heart tissue after suffering from Covid-19. According to the German club, the full-back, whose last game was for his country in the World Cup semi-final against France in December, had been suffering from the virus during […]","content":null,"pubDate":"2023-01-06 23:27:00","image_url":null,"source_id":"independentng","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"2 former BYU running backs can make history in the NFL in Week 18","link":"https://www.deseret.com/2023/1/6/23543011/jamaal-williams-tyler-allgeier-chasing-1000-yard-rushing-seasons","keywords":null,"creator":["Brandon Judd"],"video_url":null,"description":null,"content":"Detroit Lions running back Jamaal Williams (30) is introduced before an NFL football game against the Chicago Bears in Detroit, Sunday, Jan. 1, 2023.Paul Sancya, Associated Press BYU’s track record for churning out pro-level running backs isn’t exactly great.In recent years, though, it’s gotten much better, and heading into the final week of the NFL regular season, two former Cougars running backs are chasing history.Both the Detroit Lions’ Jamaal Williams and the Atlanta Falcons’ Tyler Allgeier could become the first two former BYU running backs to run for 1,000 yards in an NFL season in their teams’ respective games on Sunday.How close is Jamaal Williams to 1,000 yards rushing? Williams needs just six rushing yards against his former team, Green Bay (Sunday, 6:20 p.m. MST, NBC), to reach the 1,000-yard mark. Heading into the regular-season finale at the Packers, he has 246 carries for 994 yards and an NFL-leading 15 rushing touchdowns.If he reaches 1,000 rushing yards, Williams, who is set to become a free agent in March, will earn a $250,000 bonus, according to Sports Illustrated’s Albert Breer. Related Why Zach Wilson will back up Joe Flacco in Jets’ season finale and not start with Mike White ailing Utah, BYU and Utah State 2023 NFL draft declaration tracker Williams would become the first Lion to run for 1,000 yards in a season since Reggie Bush in 2013.Williams already holds the record for rushing yards in a season by a former BYU running back at the NFL level — in 2021, he ran for a then career-best 601 yards in his first season in Detroit.He is coming off a career-high 144-yard rushing game in a win over Chicago, and has rushed for over 100 yards twice this season.There’s more at stake, too — both Green Bay and Detroit are still alive for a wild-card playoff spot.“I’d be happy just to get 1,000 no matter who we play,” Williams told the Detroit Free Press. “But it’s more important about us just getting a dub and that’s really what I want from us is just to go out there in Lambeau and get a (win).”What other record could Jamaal Williams set? With 15 rushing touchdowns, Williams is one short of the Lions’ single-season rushing touchdowns record, set by Hall of Famer Barry Sanders in 1991.Williams has five multi-touchdown games this season, including three in a win over the New York Giants in late November.Williams has just one rushing touchdown over the last month, though, and it’s been seven weeks since he had a multi-touchdown game.“It’d make me a good running back, I guess,” Williams told the Detroit Free Press about potentially tying or breaking Sanders’ record. “I mean, Barry’s a great running back so I’ve been watching him for — on YouTube; I wasn’t here to watch him, but watching him on YouTube. ... (He’s) a legend, so I’m just grateful for that opportunity, to be able to be in there with somebody like that.” Atlanta Falcons running back Tyler Allgeier (25) runs against the Arizona Cardinals during an NFL football football game Sunday, Jan. 1, 2023, in Atlanta. John Bazemore, Associated Press How close is Tyler Allgeier to 1,000 yards rushing? Allgeier hitting the century mark is less certain — he needs 100 rushing yards in the Falcons’ season finale against Tampa Bay (Sunday, 11 a.m.) to reach the 1,000 yards for the year.Allgeier has 186 carries for 900 yards and three rushing touchdowns in his rookie season.He has rushed for 50 yards or more for six straight weeks, and 70 or more each of the past three games, including an 83-yard effort last week in a win over Arizona.Allgeier has only one 100-yard game this season — he ran for 139 yards and a touchdown on 17 carries in Week 15, though he also had a 99-yard rushing effort in Week 9. He has 483 rushing yards after first contact this season, sixth-best in the NFL, and his 2.6 yards after contact per rush leads the NFL, according to ESPN.“Just probably not being tackled by one guy,” Allgeier told ESPN, talking about his mentality as a runner. “Always had that mindset as a kid. Not one guy can freaking tackle me.“Just translated it and now translated it to the NFL.”What record could Tyler Allgeier set? Allgeier could also set the Falcons’ rookie rushing record, if he rushes for 124 yards against the Buccaneers.William Andrews set the record by rushing for 1,023 yards in 1979.Allgeier already became just the fourth Atlanta rookie to amass more than 1,000 scrimmage yards in his first season, per the NFL.com staff.He has 1,039 scrimmage yards heading into Sunday — that includes 16 receptions for 139 yards and one touchdown. That’s the most scrimmage yards from a Falcons rookie in more than 40 years. Allgeier would need a herculean type effort to set the Atlanta rookie record for scrimmage yards in a season, though. Andrews, who was a four-time Pro Bowler, set that mark in 1979 with 1,332, meaning Allgeier would need 294 yards from scrimmage to pass Andrews.Fellow rookie Desmond Ridder, the team’s new starting quarterback, praised Allgeier following their most recent win.“Tyler’s a workhorse,” Ridder said, per the team’s website. “His balance is wild. For him to be able to get the ball and then make one guy miss and then get hit by two or three guys but still be up, it’s something that I haven’t seen before. It’s a credit to him and a credit to the guy’s up front and moving their guys.”","pubDate":"2023-01-06 23:18:29","image_url":null,"source_id":"deseret","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Football: Rashford stars as Man United beat Everton in FA Cup","link":"https://www.straitstimes.com/sport/football/football-rashford-stars-as-man-united-beat-everton-in-fa-cup","keywords":null,"creator":null,"video_url":null,"description":"January 07, 2023 6:59 AMEverton loss heaps pressure on beleaguered boss Frank Lampard.","content":"MANCHESTER, England - Marcus Rashford scored for the fifth straight game as Manchester United beat Everton 3-1 in the FA Cup third round on Friday, heaping the pressure on beleaguered boss Frank Lampard. Everton travelled to Old Trafford in trepidation after slipping into the Premier League relegation zone this week following a chastening 4-1 home hammering at the hands of Brighton. They made the worst possible start, with Brazil forward Antony scoring in just the fourth minute but were level 10 minutes later after Conor Coady pounced on a howler from United goalkeeper David de Gea. However, the Everton defender put the ball in his own net early in the second half to hand the initiative back to the home side. Rashford increased United’s lead in the dying seconds, scoring from the penalty spot to maintain his record of scoring in every match since the World Cup. Man-of-the-match Rashford, brimming with confidence, said his goalscoring form matched the level of the best spells during his career. The England forward also said the players were desperate to end the club’s trophy drought, stretching back to 2017. “We want to be in finals and the biggest games,” he said. “Ultimately, we want to win silverware and a trophy. Hopefully this season we will get the opportunity to do that.” The Red Devils, who won the most recent of their 12 FA Cups in 2016, are in fourth spot in the Premier League in Erik ten Hag’s first season in charge and are through to the League Cup quarter-finals. The in-form team opened the scoring when the impressive Rashford surged down the left and into the penalty area before firing the ball across the box into the path of the fast-arriving Antony. Everton appeared to be facing an arduous evening but they were level in bizarre circumstances in the 14th minute. Amadou Onana won the ball on the edge of the box and fed Neal Maupay, who hit a low cross. De Gea could have used his hands but the ball somehow squeezed through his legs as he clung to the near post with one hand and Coady had the easiest of finishes, changing the mood of the match. Ten Hag urged the United fans to turn up the volume as he came out after half-time and they were quickly back in front, with Rashford once again playing a crucial role. The England forward cut in from the left and drove into the Everton box, beating Seamus Coleman to send in a cross which Coady turned into his own net. United continued to probe for openings as fans taunted Lampard with chants of “you’re getting sacked in the morning”. Everton, showing an admirable fighting spirit, had the ball in the net through substitute Dominic Calvert-Lewin but the goal was ruled out by VAR for an offside earlier in the move. Rashford added gloss to the scoreline from the spot after substitute Alejandro Garnacho was bundled over in the box, sending Jordan Pickford the wrong way. It was Manchester United’s seventh straight win in all competitions, either side of the World Cup. Lampard praised his men for their commitment, saying Rashford had made the difference. “It was a performance that every manager wants with the attitude of the team and the focus and our only focus now is Southampton (in the Premier League),” he said. AFP","pubDate":"2023-01-06 22:59:09","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"FA Cup: Lisandro Martínez jugó en el triunfo de Manchester United","link":"https://www.pagina12.com.ar/513813-fa-cup-lisandro-martinez-jugo-en-el-triunfo-de-manchester-un","keywords":null,"creator":["Página/12"],"video_url":null,"description":"Con Marcus Rashford como estandarte, los Diablos Rojos sacaron del torneo más antiguo del mundo al equipo de Frank Lampard.","content":"El defensor Lisandro Martínez, campeón mundial con la Selección en Qatar 2022, ingresó en el complemento en Manchester United, que pasó a los 16avos de la FA Cup al vencer 3-1 a Everton, en un encuentro disputado en el mítico estadio Old Trafford.Los goles de Manchester United fueron logrados por el brasileño Antony, Marcus Rashford de penal y Conor Coady en contra; justamente minutos antes, este defensor de Everton había marcado el empate parcial. https://content.jwplatform.com/previews/4UASC9NP-buQgiLVC Martínez -oriundo de Gualeguay y que el próximo 18 de enero cumplirá 25 años- ingresó a los 76 minutos, en tanto que su compatriota Alejandro Garnacho, de 18 años, reemplazó al delantero francés Anthony Martial a los 71 minutos.El defensor entrerriano -ex Newell's Old Boys y Defensa y Justicia- fue rebautizado por los simpatizantes de Manchester United como \"El Carnicero\", por la fiereza de su juego.La FA Cup prosigue este sábado y los encuentros más relevantes, entre otros, son Tottenham-Portsmouth, Crystal Palace-Southampton y Gillingham-Leicester (a las 9.30); Middlesbrough-Brighton (12); Brentford-West Ham (14.30); Sheffield-Newcastle (15) y Liverpool-Wolverhampton.Precisamente el equipo del alemán Jürgen Klopp es el actual campeón y obtuvo el trofeo por octava vez.La FA Cup está considerado el torneo más antiguo del mundo, ya que se disputó por primera vez entre 1871-1872, hace 150 años. Participan todos los equipos que compiten en la Premier League, la Football League y las cinco categorías por debajo de ésta, así como determinados equipos del décimo nivel del fútbol inglés.","pubDate":"2023-01-06 22:46:50","image_url":"https://images.pagina12.com.ar/styles/width960/public/2023-01/686333-rashford-20manchester-20united.jpg?itok=aY7dca7Y","source_id":"pagina12","country":["argentina"],"category":["sports"],"language":"spanish"},{"title":"Steve Cooper warns Gustavo Scarpa not to take risks with skateboarding hobby","link":"https://www.belfasttelegraph.co.uk/sport/football/steve-cooper-warns-gustavo-scarpa-not-to-take-risks-with-skateboarding-hobby-42268456.html","keywords":["Football"],"creator":null,"video_url":null,"description":"Steve Cooper has had to warn new Nottingham Forest signing Gustavo Scarpa to keep his tricks for the football field and not the half-pipe.","content":null,"pubDate":"2023-01-06 22:30:07","image_url":"https://www.belfasttelegraph.co.uk/sport/football/eb34e/42268455.ece/AUTOCROP/w1240h700/bpanews_444e1090-67ac-466e-9891-fd147a434a73_1","source_id":"belfasttelegraph","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Football: Italian great Gianluca Vialli dies, aged 58","link":"https://www.newstalkzb.co.nz/news/sport/football-italian-great-gianluca-vialli-dies-aged-58/","keywords":null,"creator":null,"video_url":null,"description":"Gianluca Vialli, the former Italy striker who helped Sampdoria and Juventus win Serie A and European trophies before becoming player-manager at Chelsea, has died. He was 58. The Italian football federation confirmed Vialli’s death late on Friday. Vialli announced in 2018 that he had overcome a year-long battle with pancreatic cancer but then said in December 2021 that the disease had returned. With his condition worsening, Vialli announced in mid-December that he was temporarily stepping down from his role as the delegation chief for Italy’s national team. Gianluca Vialli celebrates winning the Champions League with Juventus in 1996. Photo / Getty Federation president Gabriele Gravina said he was “deeply saddened” and noted that Vialli’s sporting success was matched by his “extraordinary human qualities.” “Gianluca was a splendid person and he leaves a void that cannot be filled,” Gravina added. “I hoped until the end that he would be able to perform another miracle. Yet I am comforted by the certainty that what he did for Italian football and the blue shirt will never be forgotten.” Vialli was appointed delegation chief under Azzurri head coach Roberto Mancini, his longtime friend and former teammate. The pair were known as the “gemelli del gol,” or “goal twins,” when they played together at Sampdoria, leading the Genoa club to its only Serie A title in 1991 and its only European title in 1990 with the Cup Winners’ Cup — plus four Italian Cup trophies. Vialli and Mancini also helped Sampdoria reach the 1992 European Cup final, which it lost to Barcelona at Wembley Stadium. Sampdoria said in a statement: “We won’t forget your 141 goals , your overhead kicks, your cashmere shirts, your earring, your platinum blonde hair, your Ultras bomber jacket. You gave us so much, we gave you so much: yes, it was love, reciprocal, infinite. A love that will not die today with you.” As delegation chief, Vialli reunited with Mancini to help Italy win the European Championship by beating England in a penalty shootout at Wembley in 2021. Gianluca Vialli on the sidelines as part of Italy's management team at Euro 2020. Photo / Photosport “We have a relationship that goes way beyond friendship,” Mancini said during the Euros. “He’s like a true brother to me.” Vialli won another Serie A title at Juventus and also raised the Champions League and UEFA Cup trophies with the Bianconeri. “Such an intense sense of loss,” Juventus said in a statement. “We have always been with you, Gianluca. Ever since you arrived in 1992, when it was love at first sight...we loved everything about you, absolutely everything — your smile, your being a star and leader at the same time, on the pitch and in the dressing room, your adorable swashbuckling ways, your culture, your class, which you showed until the last day in the black and white stripes.” Vialli played for Italy from 1985-1992, making 59 appearances and scoring 16 goals. He ended his playing career while also managing Chelsea, leading the London club to FA Cup, League Cup and Cup Winners’ Cup titles. He continued to live in London after moving on from Chelsea into TV commentary and other ventures. “Our thoughts are with Luca’s wife Cathryn, his daughters Sofia and Olivia, and the rest of his family and his friends at this terribly sad time,” Chelsea said in a statement. Chelsea chairman Todd Boehly and co-controlling owner Behdad Eghbali added, “Gianluca’s legend will live on at Stamford Bridge.” “His impact as a player, a coach and most importantly as a person, will be forever written across our club’s history.” Tributes flow for ‘a gorgeous soul’ Several of Vialli’s former teammates and managers have led tributes to the former Italy striker. Gianfranco Zola, who played both alongside Vialli and under him as manager at Chelsea said: “Together we won many matches and shared some of the best moments of our lives. “For the love of our ball we have often clashed. With no quarter, but always with the utmost respect. Because, in the end, we were always ourselves: two Italian boys and a ball.” Former Chelsea manager Ruud Gullit posted an image on Instagram of himself with Vialli on the day he signed for Chelsea in 1996 with the caption: “RIP Gianluca Vialli. We will miss you.” Writing on Twitter, former England striker Gary Lineker said: “Deeply, deeply saddened to hear that Gianluca Vialli has left us. One of the loveliest people you could possibly meet. A truly magnificent footballer who will be hugely missed. RIP Luca.” Former Chelsea captain John Terry tweeted: “Heartbroken. RIP Luca. A proper legend and a great man. I will forever be grateful for you giving me my debut.” Former England captain Alan Shearer tweeted: “RIP Gianluca Vialli. What a lovely lovely man and a wonderful player he was.” Ex-England striker Peter Crouch wrote on Twitter: “I’m genuinely gutted about this. I had Sampdoria home and away shirts because of him. I tried to replicate his volleys In the park and such a lovely man when I met him. Rip” Former Scotland defender Graeme Souness, who played alongside Vialli at Sampdoria, told Sky Sports UK: “I can’t tell you how good a guy he was. Forget football, he was just a gorgeous soul. He was just a truly nice human being. “He was just fabulous to be around. He was such a fun-loving guy, full of mischief, wonderful footballer and a warm human being. “People will say things about his magnificent football ability, and correctly so, but above all that what a human being. My condolence go to his family - the kids were blessed to have a dad like that, his wife was blessed to be married to a man like that.” Real Madrid manager Carlo Ancelotti, who played alongside Vialli with Italy, tweeted in Italian: “Ciao amico mio” - thank you my friend. Alessandro del Piero, a Champions League winner alongside Vialli with Juventus posted: “Our captain. My captain. Forever.” Tottenham assistant Cristian Stellini said manager and fellow Italian Antonio Conte was “upset and sad” following the news, adding Vialli was an “important person” who “opened the door for Italian managers” in the Premier League. “For us he was a great player but first of all he was a great man. He taught us a lot of things, also not only when he played but when he spoke with everyone,” Stellini said. He added: “Now we have to say thanks to Vialli for opening the door and letting us understand how important football is in Europe to open doors and create, because also Italian managers came into the Premier League and improved it so we did it together. It is a great thing.”","content":null,"pubDate":"2023-01-06 22:10:56","image_url":"https://www.newstalkzb.co.nz/media/mt4oufzd/gianluca-vialli-celebrates-winning-the-champions-league-with-juventus-in-1996.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Colerain High School set to announce the new head football coach on Monday","link":"https://www.wcpo.com/sports/high-school-sports/colerain-high-school-set-to-announce-the-new-head-football-coach-on-monday","keywords":null,"creator":null,"video_url":null,"description":"Colerain High School is scheduled to announce its new head football coach on Monday. The new coach will inherit a program with four consecutive playoff appearances.","content":"Colerain High School is scheduled to announce its new head football coach at noon Monday in the auditorium, athletic director Matt Stoinoff announced Friday afternoon.Northwest Local School District superintendent Darrell Yater will start the press conference followed by Stoinoff's formal introduction of the new football coach. Colerain completed interviews with candidates this week after the school had an estimated 82 individuals who either applied or expressed interest by mid-December.The new coach will succeed former Colerain coach Shawn Cutright, who stepped down on Dec. 1 in order to spend more time with his family.Cutright had a 26-18 record as the Colerain head coach the past four seasons including four consecutive playoff appearances.Cutright, who arrived at Colerain in 2005, earned a 181-43 career record at the Greater Miami Conference program including his time as an assistant coach and defensive coordinator.Colerain is scheduled to open the 2023 season at La Salle as part of a home-and-home contract between the two schools that was announced this past April. Colerain (4-7 in 2022) has four consecutive postseason appearances.All media is invited to the Monday press conference with a reservation made with Stoinoff at mstoinoff@nwlsd.org.The school will have a parent meeting later next week with the new coach and that day and time will be announced later.SIGN UP: Subscribe to our high school sports newsletter","pubDate":"2023-01-06 22:03:41","image_url":null,"source_id":"wcpo","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"When is FA Cup draw? Start time, TV channel, live stream and ball numbers for fourth round","link":"https://www.standard.co.uk/sport/football/fa-cup-draw-2023-start-time-ball-numbers-tv-channel-live-stream-fourth-round-b1051336.html","keywords":["Football","Sport"],"creator":["George Flood"],"video_url":null,"description":"One of the signature weekends on the English football calendar is upon us as the FA Cup reaches the third-round stage.","content":null,"pubDate":"2023-01-06 22:01:43","image_url":"https://static.standard.co.uk/2023/01/06/15/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Five Arsenal transfers that indicate when Mykhaylo Mudryk will sign as Mikel Arteta made to wait - Football.London","link":"https://news.google.com/__i/rss/rd/articles/CBMiZGh0dHBzOi8vd3d3LmZvb3RiYWxsLmxvbmRvbi9hcnNlbmFsLWZjL3RyYW5zZmVyLW5ld3MvYXJzZW5hbC10cmFuc2ZlcnMtc2lnbi1teWtoYXlsby1tdWRyeWstMjU5MTM2NTHSAWhodHRwczovL3d3dy5mb290YmFsbC5sb25kb24vYXJzZW5hbC1mYy90cmFuc2Zlci1uZXdzL2Fyc2VuYWwtdHJhbnNmZXJzLXNpZ24tbXlraGF5bG8tbXVkcnlrLTI1OTEzNjUxLmFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Five Arsenal transfers that indicate when Mykhaylo Mudryk will sign as Mikel Arteta made to wait  Football.LondonMykhaylo Mudryk makes decision over Arsenal transfer after Chelsea talks  Metro.co.ukArsenal hopes crushed by latest Mudryk update and Aubameyang would rather be spat at  Football365Arsenal: Dharmesh Sheth claims Gunners want Felix and Mudryk  FootballFanCast.comMykhaylo Mudryk's four Arsenal transfer hints suggest January switch will take place  The MirrorView Full coverage on Google News","content":null,"pubDate":"2023-01-06 22:00:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Football. Coupe de France (32es de finale) : Montpellier sorti, Paris bat Châteauroux dans la douleur","link":"https://www.ledauphine.com/sport/2023/01/06/coupe-de-france-premiere-surprise-montpellier-tombe-a-pau-(l2)-des-les-32es","keywords":["Coupe de France de football","Football","Sport","Sport national","Fil Info"],"creator":null,"video_url":null,"description":"Les 32es de finale de la Coupe de France 2022-2023 ont démarré ce vendredi soir. Un club de Ligue 1 est déjà éliminé : Montpellier a en effet été battu à Pau. Dans des duels entre clubs de Ligue 2, Grenoble a pris le meilleur sur Nîmes (1-0) tandis que le Paris FC a disposé de Valenciennes (3-1). Le Paris SG a souffert mais s'est défait de Châteauroux, pensionnaire de National (3-1).","content":null,"pubDate":"2023-01-06 22:00:00","image_url":"https://cdn-s-www.ledauphine.com/images/19E056E4-9946-4260-8891-5E5F6553B36D/NW_listB/le-but-de-valere-germain-n-a-pas-suffi-a-montpellier-photo-sipa-marcio-machado-1673031968.jpg","source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"Coupe de France : le PSG passe, deux clubs de L1 au tapis, tous les résultats, tous les qualifiés !","link":"https://www.butfootballclub.fr/ligue-1/coupe-de-france-le-programme-complet-des-32e-de-finale-802162","keywords":null,"creator":null,"video_url":null,"description":"Ce week-end, on joue les 32e de finale de la Coupe de France, marquant l'entrée en lice des 20 clubs de Ligue 1 dans la compétition. Tous les matchs, tous les résultats, tous les qualifiés, c'est sur But ! Football Club que ça se passe.","content":null,"pubDate":"2023-01-06 21:53:00","image_url":"https://static.butfootballclub.fr/16/2023/01/photo_article/802162/318443/1200-L-coupe-de-france-le-programme-complet-des-32e-de-finale.jpg","source_id":"butfootballclub","country":["france"],"category":["sports"],"language":"french"},{"title":"Ceravolo: \"In passato Allegri forse non gradito da tutta la dirigenza, ma oggi è punto fermo. Vialli un esempio a livello umano\"","link":"https://www.tuttojuve.com/altre-notizie/ceravolo-in-passato-allegri-forse-non-gradito-da-tutta-la-dirigenza-ma-oggi-e-punto-fermo-vialli-un-esempio-a-livello-umano-628085","keywords":["Altre notizie"],"creator":null,"video_url":null,"description":"A “1 Football Club”, programma radiofonico condotto da Luca Cerchione in onda su 1 Station Radio, è intervenuto Franco Ceravolo, dirigente e direttore sportivo. Di seguito, un estratto raccolto dalla redazione di IlSognoNelCuore.","content":null,"pubDate":"2023-01-06 21:50:06","image_url":"https://net-storage.tcccdn.com/storage/tuttojuve.com/img_notizie/thumb3/3d/3de32b081bcc750538a40e3ced2ed467-58090-oooz0000.jpeg","source_id":"tuttojuve","country":["italy"],"category":["sports"],"language":"italian"},{"title":"Raith earn draw with Dundee after trying week: takeover bid, put under siege, breathless finale","link":"https://www.scotsman.com/sport/football/raith-earn-draw-with-dundee-after-trying-week-takeover-bid-put-under-siege-breathless-finale-3977909","keywords":["Football","Sport"],"creator":["Mark Atkinson"],"video_url":null,"description":"This has been a challenging week for those of a Raith Rovers persuasion given the chatter of a takeover from a Hong Kong consortium, so it was a relief to have matters on the pitch to discuss as Dundee visited Stark’s Park for some Friday-night football","content":null,"pubDate":"2023-01-06 21:49:41","image_url":"https://www.scotsman.com/webimg/b25lY21zOmIzNjAwZDBiLTg5ZjQtNDY0NS1iYjQxLTRlMTk2OWE4NGJjNToyNzY0NDE5ZS1mNTI2LTQ2NzgtYmY2ZC04NDUyYzljZjY1ZTY=.jpg?width=1200&auto=webp","source_id":"scotsman","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Taccola: \"La Juve può dare filo da torcere per lo Scudetto. Gatti può essere difensore del futuro. Vialli lascia eredità importante\"","link":"https://www.tuttojuve.com/altre-notizie/taccola-la-juve-puo-dare-filo-da-torcere-per-lo-scudetto-gatti-puo-essere-difensore-del-futuro-vialli-lascia-eredita-importante-628084","keywords":["Altre notizie"],"creator":null,"video_url":null,"description":"MIRKO TACCOLA  A “1 Football Club”, programma radiofonico condotto da Luca Cerchione in onda su 1 Station Radio, è intervenuto Mirko Taccola, ex calciatore, tra le tante, di Inter e Napoli ed attuale allenatore.","content":null,"pubDate":"2023-01-06 21:40:09","image_url":"https://net-storage.tcccdn.com/storage/tuttojuve.com/img_notizie/thumb3/49/49795a0658c75977293cc1239623ae15-48366-oooz0000.jpeg","source_id":"tuttojuve","country":["italy"],"category":["sports"],"language":"italian"},{"title":"Michael Carrick happy to continue his quiet revolution at Middlesbrough - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9mb290YmFsbC8yMDIzL2phbi8wNi9taWNoYWVsLWNhcnJpY2staGFwcHktdG8tY29udGludWUtaGlzLXF1aWV0LXJldm9sdXRpb24tYXQtbWlkZGxlc2Jyb3VnaNIBeGh0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS9mb290YmFsbC8yMDIzL2phbi8wNi9taWNoYWVsLWNhcnJpY2staGFwcHktdG8tY29udGludWUtaGlzLXF1aWV0LXJldm9sdXRpb24tYXQtbWlkZGxlc2Jyb3VnaA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Michael Carrick happy to continue his quiet revolution at Middlesbrough  The GuardianMiddlesbrough complete first January transfer as Cameron Archer joins on loan from Aston Villa  Teesside LiveOpinion: Middlesbrough are making the perfect January signing with 27-year-old set to sign  Football League WorldCameron Archer Arrives On Loan  mfc.co.ukCameron Archer makes Aaron Danks admission after sealing Aston Villa transfer  Birmingham LiveView Full coverage on Google News","content":null,"pubDate":"2023-01-06 21:36:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Harry Redknapp raves about Tottenham star Harry Kane - TBR - The Boot Room - Football News","link":"https://news.google.com/__i/rss/rd/articles/CBMiTWh0dHBzOi8vdGJyZm9vdGJhbGwuY29tL2hhcnJ5LXJlZGtuYXBwLXJhdmVzLWFib3V0LXRvdHRlbmhhbS1zdGFyLWhhcnJ5LWthbmUv0gFRaHR0cHM6Ly90YnJmb290YmFsbC5jb20vaGFycnktcmVka25hcHAtcmF2ZXMtYWJvdXQtdG90dGVuaGFtLXN0YXItaGFycnkta2FuZS8_YW1w?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Harry Redknapp raves about Tottenham star Harry Kane  TBR - The Boot Room - Football NewsOpinion: The five key takeaways from Tottenham’s 4-0 win at Crystal Palace  The Spurs WebAntonio Conte's 'really exciting' plan to boost Harvey White's Tottenham development  Football.LondonReport: Tottenham man barely celebrated after both of Harry Kane’s goals vs Palace on Wednesday  TBR - The Boot Room - Football NewsOpinion: Why Tottenham are currently suffering from a hangover, despite 4-0 win  The Spurs WebView Full coverage on Google News","content":null,"pubDate":"2023-01-06 21:15:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Extraordinary museum dedicated to Brazil football god Pele filled with Brit icons","link":"https://www.irishmirror.ie/sport/soccer/extraordinary-museum-dedicated-brazil-football-28895808","keywords":["Sport"],"creator":["news@irishmirror.ie (Andy Lines)"],"video_url":null,"description":"The display, at the museum in Santos, includes comments about the 1966 World Cup which would upset Three Lions fans - but there is one unlikely hero from the World Cup many will be delighted to see","content":"At the heart of a museum ­dedicated to Brazilian football icon Pele stands an amazing cluster of England memorabilia. There are displays featuring the Queen, the Beatles, Pickles the dog, a Bearskin and Carnaby Street. The legendary striker, who died last week at 82, is described as “the Black king the British never had”. Even Sherlock Holmes and Scotland Yard get a mention. A powerful quote about Pele’s brilliance has been taken from an article in the Sunday Mirror and chosen to adorn the walls. It was quite moving to see The Mirror named on the wall of tributes alongside Muhammad Ali, Andy Warhol, Ronald Reagan and some of the world’s greatest-ever sporting figures. But the display, at the museum in Santos, includes some controversial comments about the 1966 World Cup which would upset Three Lions fans. One states that Geoff Hurst’s second goal in the 1966 World Cup was the “goal that never happened.” And England were “aided by referees all the way to the final.” The entire museum, which opened in 2014, is dedicated to Pele who died last week at the age of 82. Pele donated some fantastic artefacts including his boots and his accreditation documents for several world cups. The displays include: The late Queen Among the most fascinating items is a special ceremonial sword awarded to Pele by the Queen. By the sword it reads: “Pele was the first non British person to be awarded the Football Sword of Honour … “ 1966 World Cup Pele was badly injured during the tournament after referees allowed him to be constantly fouled. It left a bad taste in the mouth of Brazilians which the museum makes abundantly clear: “The truth is that the English did not organise the World Cup so they could lose it. “Aided by the referees all the way to the final they were gifted a decisive goal in the 11th minute of extra time against Germany. “With the match tied at two Hurst took a shot, the ball hit the crossbar and landed on the goal line but assistant referee Rafiq Bahramov from Azerbaijan and the referee Gottfried Dienst from Switzerland confirmed the goal that never happened and decided the tournament.” Beatles There is a display featuring the Beatles bemoaning the fact that Pele never met them - despite playing in a 1966 match at Everton ’s Goodison Park in Liverpool . John & Paul & Ringo & George & Pele: “The meeting that never happened.” “The greatest icons of the 1960s (and of all the decades that followed) could have met in Liverpool, land of the Fab Four, where the King of Football saw his dreams of winning a third World Cup title get postponed.” Bearskin “British Royal Guard bearskin hat. Pele has always been admired by the British as the black King they never had. The busby however was not a gift from England but rather a hat worn for a cover article made for Realidade magazine.” Pickles the dog Engrossed in celebration England had only lost their stoic smile in March when the Jules Rimet trophy was stolen from an exhibition at the Westminster Central Hall in London. The thief was arrested by Scotland Yard but would not reveal the whereabouts of the trophy. When it seemed not only Sherlock Holmes would be able to find the stolen item a little mixed-breed Collie dog named Pickles picked up the scent of the precious trophy wrapped in newspaper and tossed behind a bush. Pickles became a national hero and was entitled to dog food for life and the World Cup frenzy raged on. The museum, over four floors, is located at the centre of Santos’ historic district and is free to enter to allow as many fans the chance to visit. I went the morning after Pele’s funeral and there was lengthy queue to enter before it had opened. Hundreds of fans posed for selfies with some of the greatest images of Pele during his playing days. In particular, several stopped by a huge picture of Pele embracing England legend Bobby Moore after the 1970 match between England and Brazil. The photo seemed to sum up Pele, and the world of football, at the end of such an extraordinary week in Santos.","pubDate":"2023-01-06 21:13:25","image_url":"https://i2-prod.mirror.co.uk/incoming/article28895487.ece/ALTERNATES/s98/0_new-exclusive-social-Recovered-Recovered-Recovered.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"}]}