{"newsArray":[{"article_id":"320244beba0f06709fbdcbfae945f9cc","title":"Almost in the bag","link":"https://mwnation.com/almost-in-the-bag/","keywords":["Front Page","National Sports"],"creator":null,"video_url":null,"description":"FCB Nyasa Bullets are within touching distance of a fifth successive TNM Super League title and a record 16th overall following their 0-1 victory over Karonga United at Karonga Stadium yesterday. Following the win, Bullets now have 59 points, three above second-placed Silver Strikers whom they meet in their last match this Sunday at Kamuzu […] The post Almost in the bag appeared first on The Nation Online.","content":"FCB Nyasa Bullets are within touching distance of a fifth successive TNM Super League title and a record 16th overall following their 0-1 victory over Karonga United at Karonga Stadium yesterday. Following the win, Bullets now have 59 points, three above second-placed Silver Strikers whom they meet in their last match this Sunday at Kamuzu Stadium in Blantyre. The People’s Team has a seven-goal difference going into their final fixture and the Central Bankers will need to win by an eight-goal margin to wrest the title from within Bullets’ nose. It is a task not beyond the realms of possibility as football has at times exhibited every inch of its unpredictability, but certainly a tall order and it will take something special for the Central Bankers to turn it around. In a match which failed to stir the passions, monitored on MBC TV, wonder kid Patrick Mwaungulu struck the priceless goal for Bullets in the seventh minute. Ephraim Kondowe floated a well-curled cross and Mwaungulu rose to head the ball home. It all looked simple, no fuss. Ingwina ya Karonga nearly drew level 10 minutes later when Pilirani Thulu’s free-kick was headed over the bar by Ellie Kayombo. In the 31st minute, the hosts came close again when Kayombo’s effort hit the post and from the rebound, Allen Chihana missed in front of a yawning goal with Bullets’ ‘keeper Richard Chimbamba well beaten. Karonga continued to push for an equaliser and twice Kayombo’s attempts through headers, were thwarted by Bullets defence which stood firm. Kondowe nearly doubled the visitors’ lead in the 62nd minute, but his chip narrowly missed the target. Both teams made several substitutions towards the end, but the scoreline remained unchanged. Referee Newton Nyirenda was forced to stop the match for about 10 minutes in added time following ugly scenes as some alleged Karonga fans threw objects onto the pitch and when action resumed, the match had long lost its rhythm. In a post-match interview, Bullets coach Kallisto Pasuwa said he would only comment about the title after the last game. Commenting on the actual match, the Zimbabwean tactician said: “We were talking about the boys being tired due to crammed fixtures and the secret was to attack early when we still had the energy and it worked. “Ofcourse the opposition started coming back stronger by hitting long balls to their tall strikers, but we defended well.” Bullets left the stadium under police escort.","pubDate":"2023-11-30 06:35:00","image_url":"https://mwnation.com/wp-content/uploads/2023/11/Mwaungulu.jpg","source_id":"mwnation","source_priority":790082,"country":["malawi"],"category":["sports"],"language":"english"},{"article_id":"3d24b79e3c4800e7c4a292b066a96652","title":"US-Sport kompakt: Franz Wagner brilliert beim achten Orlando-Sieg in Serie","link":"https://rp-online.de/sport/us-sport/nba-franz-wagner-brilliert-beim-achten-orlando-sieg-in-serie_aid-63774461","keywords":["Sport","US-Sport"],"creator":["Aaron Knopp, Maximilian Lonn, Stefan Janssen, Sebastian Kalenberg, Stefan Loyda"],"video_url":null,"description":"Während die meisten Europäer schlafen, geht es in den nordamerikanischen Profiligen hoch her. Was in der Nacht beim American Football, Basketball, Baseball und Eishockey passiert ist.","content":"Die bauen ihre beeindruckende Siegesserie in der weiter aus: Das Team der Basketball-Weltmeister Franz und Moritz Wagner fuhr mit einem 139:120 gegen die den achten Sieg in Folge ein. Zuletzt war dies der Franchise in der Saison 2010/11 gelungen. Der Teamrekord liegt bei neun erfolgreichen Partien hintereinander. Die besten Scorer aller Zeiten Überragender Spieler auf dem Parkett gegen war einmal mehr Franz Wagner, der 31 Punkte erzielte. Moritz Wagner lieferte als wichtiger Rollenspieler dazu elf Zähler ab. „Die deutsche Disziplin hilft mir ein bisschen, auf dem Boden zu bleiben“, sagte Franz Wagner: „Nach so einem Spiel nicht zu denken, dass alles großartig ist und es immer so weiter geht. Sondern weiter an sich zu arbeiten und nicht zu weit nach vorne zu blicken.“ Es gebe viele Ablenkungen, gerade wenn man gut spiele, fügte er an. „Wo ich herkomme hilft mir sehr, das nicht alles mitzubekommen und da nicht immer daran interessiert zu sein und ein bisschen filtern zu können. Um mein Leben zu leben und gut zu spielen“, sagte Franz Wagner. Das Ziel mit dem Team sei es, am Ende der Saison noch stärker zu sein. Dann geht es um die Play-offs. Die Meisterrunde würde auch gerne mit den Toronto Raptors spielen. Mit einem 112:105-Erfolg gegen die gelang den Kanadiern der neunte Sieg im 19. Spiel. Schröder erzielte lediglich acht Punkte, war aber in der spannenden Schlussphase voll da und überzeugte mit zwölf Assists. Auch Daniel Theis feiert mit den Clippers einen 131:117-Erfolg bei den , zu dem der deutsche Center fünf Zähler beitrug. Die dramatischsten Super Bowls der Geschichte Der Verkauf der Mehrheitsanteile an den Mavericks ist so gut wie besiegelt. US-Medienberichten zufolge hat sich Klubbesitzer Mark Cuban mit der Unternehmer-Familie Adelson auf einen Preis von 3,5 Milliarden US-Dollar (ca. 3,2 Mio Euro) geeinigt. Die Betreiber des Casino-Resorts Sands würden damit formal die Kontrolle an der NBA-Franchise übernehmen. Der Deal solle bis zum Ende des Jahres abgeschlossen werden. „Die Familien Adelson und Dumont haben verbindliche Kaufverträge abgeschlossen“, hieß es in einer Erklärung: „Die Familien streben einen Abschluss der Transaktion bis zum Jahresende an, vorbehaltlich der Erfüllung der üblichen Abschlussbedingungen und der Zustimmung des NBA Board of Governors.“ Das sind die Top-Transfers der neuen NBA-Saison Cuban, ein leidenschaftlicher Basketballfan und Freund von Ex-Mavericks-Superstar , hatte im Januar 2000 für 285 Millionen Dollar die Mehrheit erworben. Der 65-Jährige soll Berichten zufolge die operative Kontrolle über das Team behalten. Die Mavericks gewannen 2011 angeführt von Nowitzki ihre bislang einzige NBA-Meisterschaft.","pubDate":"2023-11-30 06:34:00","image_url":"https://rp-online.de/imgs/32/1/1/7/4/0/2/7/5/3/tok_9b526fa36a16e40715af09df0a431c6c/w950_h950_x1500_y1000_DPA_bfunk_dpa_5FAEFC007644C6B3-412af0f9ffe5afff.jpg","source_id":"rp_online","source_priority":605562,"country":["germany"],"category":["sports"],"language":"german"},{"article_id":"43cb2eb3f7b47c402bf36f3dcc614c56","title":"Julien Stéphan et le Stade Rennais poursuivent en 3-4-3 même en Europe","link":"https://www.lequipe.fr/Football/Actualites/Julien-stephan-et-le-stade-rennais-poursuivent-en-3-4-3-meme-en-europe/1434186#xtor=RSS-1","keywords":["Foot, C3, Rennes"],"creator":["Emery Taisne"],"video_url":null,"description":"Vainqueur dans un schéma en 3-4-3 contre Reims (3-1), dimanche, le Stade Rennais devrait à nouveau se présenter à trois derrière ce soir contre le Maccabi.","content":"C'est une option qui avait déjà été envisagée pour rebooster les résultats du Stade Rennais lorsque Bruno Genesio en était encore l'entraîneur : pour sa première sur le banc face à Reims (3-1) samedi dernier, Julien Stéphan a bousculé les habitudes de ses joueurs en instaurant un 3-4-3 a priori amené à perdurer. L'idée consistait à renforcer l'axe et rassurer un groupe en perte de confiance, pas assez tueur devant et beaucoup trop perméable derrière. observe l'ancien défenseur Alain Roche qui officiait en tant que consultant pour Canal+ dimanche au Roazhon Park. Belocian suspendu Rennes a eu le mauvais réflexe de se recroqueviller après l'ouverture du score d'Amine Gouiri, il a une nouvelle fois manqué de concentration sur le but d'Oumar Diakité juste avant la pause et il a concédé beaucoup de situations... Mais en termes d'implication, de rigueur et de dépassement de soi, tout le groupe a élevé le curseur. Bourigeaud a cavalé dans son couloir droit, Arnaud Kalimuendo a abattu un gros travail défensif. Et si la moyenne d'âge de sa défense centrale n'a pas subitement décollé, le trio Wooh-Belocian-Theate a plutôt donné des gages de solidité. , reprend Roche. , a insisté Arthur Theate, plutôt friand de ce schéma à trois derrière. Tactiquement, son principal inconvénient réside au milieu, où les Rennais pourraient très vite se retrouver en infériorité contre des équipes qui évoluent à trois dans ce secteur de jeu. , souligne Frédéric Antonetti, passé sur le banc rennais entre 2009 et 2013. Mercredi, Stéphan a rappelé que tout était une question d'animation et de philosophie de jeu. Il devra faire ce soir sans Jeanuël Belocian, suspendu, alors que Warmed Omari effectue, lui, son retour. En cas de succès, le Stade Rennais sera assuré de terminer a minima à la deuxième place du groupe.","pubDate":"2023-11-30 06:30:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/julien-stephan-p-lahalle-l-equipe/1500000001875708/0:0,1997:1331-665-335-70/b6e2e.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"1f68e04d7496380d72d20c91317c0ca2","title":"Ботев Враца си връща защитник","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/botev-vraca-si-vryshta-zashtitnik-765843","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Ботев Враца обмисля да си върне левия бек Том Рапнуи. Французинът премина в ЦСКА 1948, но така и не можа да се наложи и основно е използван от дубъла. Врачани ще търсят подсилване именно в крайните защитници. Както е известно, Момичл Цветанов изненадващо си тръгна от стадион „Христо Ботев“ и не се знае дали ще се върне. Рапнуи нямал нищо против да облече екипа на врачани. 22-годишният французин не попада в плановете на столичани, които са готови да го върнат във Враца.","pubDate":"2023-11-30 06:21:00","image_url":"https://m3.netinfo.bg/media/images/50514/50514231/960-600-tom-rapnui.jpg","source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"2d1007bcee03989a0630e95708a80bec","title":"Brighton's Fati, Lamptey out for 'long time', says De Zebri","link":"https://www.straitstimes.com/sport/football/brightons-fati-lamptey-out-for-long-time-says-de-zebri","keywords":null,"creator":["The Straits Times"],"video_url":null,"description":"November 30, 2023 2:16 PMBrighton & Hove Albion forward Ansu Fati and defender Tariq Lamptey will both be sidelined for a significant period after picking up injuries at the weekend, manager Roberto De Zerbi said.","content":"Brighton & Hove Albion forward Ansu Fati and defender Tariq Lamptey will both be sidelined for a significant period after picking up injuries at the weekend, manager Roberto De Zerbi said. Lamptey and Barcelona loanee Fati went down injured in the first half of Brighton's 3-2 victory at Nottingham Forest on Saturday, when they ended their six-game winless run in the Premier League. Brighton, who face AEK Athens in the Europa League later on Thursday, have been struggling with a number of key players out of action, including Kaoru Mitoma, Danny Welbeck, Solly March and Julio Enciso. \"Ansu and Lamptey are both injured,\" Italian De Zebri told reporters on Wednesday. \"We have lost them for a long time, I think.\" Brighton are second in Group B on seven points from four games, a point behind Marseille. They lost to AEK in their campaign opener but have the chance to make up for that defeat in Athens. The lengthy injury list makes their task harder but De Zebri said they had to focus on the players who are fit. \"We will have to compete,\" he added. \"I don't know if we will win, but we will fight to win the game for sure.\" REUTERS","pubDate":"2023-11-30 06:16:22","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"e9f499cc94730fd82408ab2ff028ab67","title":"Лудогорец гостува на Спартак Търнава в търсене на нова победа в ЛК","link":"https://gong.bg/bg-football/evrouchastnici/multimedia/video/ludogorec-gostuva-na-spartak-tyrnava-v-tyrsene-na-nova-pobeda-v-lk-765840","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Отборът на Лудогорец гостува на Спартак Търнава в мач от груповата фаза в Лигата на конференциите. Двубоят стартира в 22:00 часа българско време и ще бъде предаван пряко по MAX Sport 3. Разградчани влизат в мача след изненадваща загуба у дома срещу Славия (2:3) в последния кръг на efbet Лига. Това бе и първа загуба за българския шампион в първенството ни след завръщането на Георги Дерменджиев. В първия мач между Лудогорец и Спартак Търнава \"орлите\" записаха категоричен успех с 4:0 в Разград. Победата бе изкована през втората част, когато паднаха и четирите гола във вратата на словаците, а с основна заслуга тогава бе Якуб Пьотровски, който реализира две от попаденията. Ситуацията в Група H е заплетена като Фенербахче води с 9 точки, а Нордселанд е втори със 7 пункта. Лудогорец пък е с точка зад датчаните, които днес приемат Фенербахче. Именно затова за разградчани е много важно да победят Търнава и да се надяват на благоприятен развой в другата среща, с който да се озоват в позициите, даващи право на участие в следващата фаза на Лига на конференциите. Спартак Търнава обаче влиза в днешния сблъсък след пет поредни успеха в първенството на Словакия и равенство в Дания с Нордселанд. Андрей Джурич няма да е на разположение за тима, както и Азис Осени, а пък Ян Бернат ще виси до последно. За гостуването в Търнава Дерменджиев има сериозни кадрови проблеми. Националът Спас Делев отпадна в последния момент заради настинка. Халфът Иван Йорданов също не попадна в групата за Словакия. 23-годишният национал се възстановява след операция на херния. Аут от сметките на Дерменджиев е и Марсел Хайстер. Трайно контузен пък е Диниш Алмейда.","pubDate":"2023-11-30 06:11:00","image_url":"https://m4.netinfo.bg/media/images/50600/50600022/960-600-ludogorec-vs-spartak-tyrnava.jpg","source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"4f7d1c2a8d5931e9cb1c6b9d0f849671","title":"Wanyama hopes to steer Kenya’s 3×3 team into first ever Olympics","link":"https://www.capitalfm.co.ke/sports/2023/11/30/wanyama-hopes-to-steer-kenyas-3x3-team-into-first-ever-olympics/?utm_source=rss&utm_medium=rss&utm_campaign=wanyama-hopes-to-steer-kenyas-3x3-team-into-first-ever-olympics","keywords":["Basketball","Sports","featured"],"creator":["Timothy Olobulu"],"video_url":null,"description":"NAIROBI, Kenya, Nov 30 – Lithuania-based Mercy Wanyama has made the final Kenyan team for the 3×3 Africa Cup which starts in Egypt on Friday, and the forward has voiwed to use her European experience to help the team clinch a qualifier slot. Wanyama, who has recently joined Lithuanian league side BC Siauliai believes they […] The post Wanyama hopes to steer Kenya’s 3×3 team into first ever Olympics appeared first on Capital Sports.","content":"Wanyama, who has recently joined Lithuanian league side BC Siauliai believes they have a strong team and can easily battle to clinch the Africa Cup and book a direct ticket to the Universality One, which gives them a chance to qualify for the Olympic Games. The younger sister to football royalty Victor Wanyama and MacDonald Mariga will be playing the 3×3 for the first time, but says she is ready. “It feels great to join up with the team. It is my first time on the 3×3 but I understand the game. We will do our best as a team,” Wanyama said. She adds; Every player wants to represent their country at the Olympics and for us it is not different. We want to go there and give our best to be in Paris. This is very big for us because Kenya has never qualified for the Olympics in basketball and we want to make history for the 50million+ Kenyans.” Wanyama has spent the last six years in Europe and played in Spain last season before making the switch to Lithuania, where she has already curved her niche and is a dependable player for her club. She hopes her experience can help the team in Egypt. “I have really grown. I am not the same Mercy I was five years ago. I am bringing what I have learnt on that side and with the talented players we have from the local league, I believe we will do great things,” she notes. The team will be skippered by KPA’s Natalie Akinyi, and will also include teammate Hilda Indasi and Zetech University’s Madina Okot. Captain Natalie says the team is ready to battle out and win the Africa Cup, which gives them a direct ticket to the Olympic qualifiers. “We have a very good team compared to last year and we want to go to the Olympics. Each one of us wants to be called an Olympian so we are ready to give our all in Egypt. Playing at the Olympics is a good platform to showcase our talents and our target is to give it a very good shot,” said the KPA point guard. The team will be coached by Evelyn Kedogo, who says they have trained really well and are looking to go all out and clinch the title. “The training has been really good and we had a Strength and Conditioning coach for the first time and this has really helped us to build our physicality. I believe we are ready as a team and we have what it takes to win,” noted the coach. The Kenyan women team is currently ranked fourth in Africa. They will clash with Nigeria, Mali, Madagascar and Benin in their group. Winning all matches will earn them a direct slot in the semi-finals.","pubDate":"2023-11-30 06:07:37","image_url":"https://www.capitalfm.co.ke/sports/files/2023/11/IMG_5979-1024x665.jpg","source_id":"capitalfm","source_priority":143748,"country":["kenya"],"category":["sports"],"language":"english"},{"article_id":"de464f1a09ae2413eebb9940ba79d09b","title":"Programme TV foot : à quelle heure et sur quelle chaîne voir les matchs de ce soir (30 novembre 2023) ?","link":"https://www.lequipe.fr/Football/Actualites/Programme-tv-foot-a-quelle-heure-et-sur-quelle-chaine-voir-les-matchs-de-ce-soir-30-novembre-2023/1434233#xtor=RSS-1","keywords":["Foot"],"creator":["Base de données"],"video_url":null,"description":"Retrouvez l'intégralité des retransmissions des matches de football du jour retransmis sur toutes les chaînes du bouquet TNT, Câble et Satellite. Ligue 1, Ligue 2, Premier League, coupes d'Europe... Suivez tous les matches en direct sur votre télévision ou en streaming.","content":"Retrouvez l'intégralité du . - Multizone : à 18h45 en direct sur RMC Sport Live 4 - Multizone : à 21 heures en direct sur RMC Sport Live 4 - Sturm Graz - Rakow Czestochowa : à 18h45 en direct sur RMC Sport Live 10 - AEK Athènes - Brighton : à 18h45 en direct sur RMC Sport Live 5 - Atalanta Bergame - Sporting Portugal : à 18h45 en direct sur RMC Sport Live 6 - TSC Backa Topola - West Ham : à 18h45 en direct sur RMC Sport Live 7 - Sparta Prague - Betis Séville : à 18h45 en direct sur RMC Sport Live 8 - Fribourg - Olympiakos : à 18h45 en direct sur RMC Sport Live 9 - Maccabi Haïfa - Rennes : à 18h45 en direct sur RMC Sport UHD et RMC Sport 1 - Marseille - Ajax Amsterdam : à 21 heures en clair et en direct sur M6 et Canal+ Foot - Molde FK - Karabagh FC : à 21 heures en direct sur RMC Sport Live 10 - Liverpool - Linz ASK : à 21 heures en direct sur RMC Sport Live 3 - Villarreal - Panathinaïkos : à 21 heures en direct sur RMC Sport Live 5 - Servette Genève - AS Rome : à 21 heures en direct sur RMC Sport Live 6 - BK Häcken - Bayer Leverkusen : à 21 heures en direct sur RMC Sport Live 7 - Glasgow Rangers - Aris Limassol : à 21 heures en direct sur RMC Sport Live 8 - Sheriff Tiraspol - Slavia Prague : à 21 heures en direct sur RMC Sport Live 9 - Toulouse - Union Saint-Gilloise : à 21 heures en direct sur RMC Sport UHD et RMC Sport 1 - FC Astana - Dinamo Zagreb : à 16h30 en direct sur RMC Sport Live 3 - Besiktas - Club Bruges : à 18h45 en direct sur RMC Sport Live 11 - KI Klaksvik - Slovan Bratislava : à 18h45 en direct sur RMC Sport Live 12 - Bodo/Glimt - FC Lugano : à 18h45 en direct sur RMC Sport Live 14 - La Gantoise - Zorya Lougansk : à 18h45 en direct sur RMC Sport Live 15 - HJK Helsinki - Aberdeen : à 18h45 en direct sur RMC Sport Live 16 - KF Ballkani - Viktoria Plzen : à 18h45 en direct sur RMC Sport Live 17 - Olimpija Ljubljana - Lille : à 18h45 en direct sur RMC Sport Live 3 - Eintracht Francfort - PAOK Salonique : à 21 heures en direct sur RMC Sport Live 11 - Fiorentina - Racing Genk : à 21 heures en direct sur RMC Sport Live 12 - FC Nordsjälland - Fenerbahçe : à 21 heures en direct sur RMC Sport Live 13 - Cukaricki Belgrade - Ferencvaros : à 21 heures en direct sur RMC Sport Live 14 - Spartak Trnava - Ludogorets Razgrad : à 21 heures en direct sur RMC Sport Live 15 - AZ Alkmaar - Zrinjski Mostar : à 18h45 en direct sur RMC Sport Live 13 - Breidablik - Maccabi Tel-Aviv : à 14 heures en direct sur RMC Sport Live 3 - Abha Club - Al-Ahli FC : à 16 heures en direct sur Canal+ Foot","pubDate":"2023-11-30 06:00:44","image_url":"https://medias.lequipe.fr/img-photo-jpg/-/1500000001560312/4:0,2500:1664-665-335-70/77bc2.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"b7172f44de3d796f88e8fb2a9a741ea3","title":"Ranked! The 10 best Barcelona sides ever","link":"https://www.fourfourtwo.com/features/ranked-the-10-best-barcelona-sides-ever","keywords":["Lists"],"creator":["mark.j.white@futurenet.com (Mark White)"],"video_url":null,"description":"Delving into the depths of the best Barcelona sides ever – from Rivaldo to Ronaldinho, Maradona to Messi","content":"In 2011, Pep Guardiola won his second Champions League title as Barcelona manager with arguably the greatest performance his side had ever delivered - and what a stage to do it. It was a display that had everything you’d associate with Barcelona. Control, dominance and attacking intent throughout as Barca toyed with like a cat with a ball of string. Yet when asked whether this side had surpassed the ‘Dream Team’ that Guardiola himself had been a part of under Johan Cruyff, Pep was coy to answer. Instead, he said that this side would never have been possible with Cruyff’s team. The way that Guardiola saw it, his philosophy was merely a continuation of his mentor’s and that the way - the correct way to play - was the most important thing. Well, we’re going to pose the questions that Pep himself wouldn’t answer. Which team was the best? There are plenty to choose from… In an El Classico tie in 1983, Diego Maradona rounded the goalkeeper and was about to score, before a flying tackle came in from Juan Jose. Maradona stood still, waiting for the defender to smack into the post, slotting the ball into the empty net. The Argentine was the first Barcelona player to be given a standing ovation by a Bernabeu audience. He was an undisputed world-beater and would have won more in Spain, perhaps, had it not been for bad luck and ill-discipline. He suffered hepatitis, before a broken ankle - caused by Andoni “the Butcher of Bilbao” Goikoetxea - though sometimes he was to blame for trouble. At one point, Diego trashed the Camp Nou trophy room because he wasn’t allowed his passport - while his Barca career ended with him in the centre of a mass brawl, kicking and punching anyone in an shirt, after an on-pitch argument broke out into a shocking fight. Long before Barca execs were trying to offload Maradona to for his nonsense though, Maradona was the jewel of the side under legendary managers Udo Lattek - who managed in their glory years - and Cesar Luis Menotti - who won the World Cup with Argentina in 1978. Bernd Schuster was in that side too - a future star. It was a pleasure to watch the Argentine at the time, given free roam in front of a solid defence and hard-working midfield, often partnering Lobo Carrasco up top for the Blaugrana. It was a great side but not one that won a league trophy. Long before Barcelona became wedded to the beautiful Cruyffian ideals that would come to define the club, another kind of philosopher was at the reigns of the club. Helenio Herrera won La Liga in 1950 and 1951 with and arrived in Catalonia as the king of “catenaccio”, a style of play that relied on a sweeper-type defender to act as a door lock and keep the defence tight. Herrera is often likened to Jose Mourinho for his larger-than-life persona and tactics which history has chalked up as dour compared to more “progressive” managers - but that’s not to say that Barca didn’t still play fluid, attacking football at times that later presidents would have been proud of. Hungarian Laszlo Kubala and 1960 Ballon d’Or winner Luis Suarez were the two stars of the side, which won La Liga in 1958/59 and 1959/60. Herrera left the club in 1960 after clashing with Kubala one too many times, taking charge of the Spanish national side before going to and winning two European Cups with his talisman Suarez. Barca were the first side to ever knock Real Madrid out of the European Cup, too, during Herrera’s time at the club - it’s a case of maybe what could have been for this phenomenally talented side, despite the domestic dominance. Maybe that first wait for a European title could have come sooner. Imagine having Bobby Robson on your bench, Jose Mourinho as his translator and Pep Guardiola as your captain. You should be fine for leadership, right? Now imagine you’ve got Ronaldo up front, too. But this was a tough time in Catalonia. Johan Cruyff, the club’s modern founding father, had just left - Robson stepped up though, winning the UEFA Cup Winners' Cup, the Copa Del Rey and finishing second in La Liga. “He arrived as if he was in Barcelona for the last 20 years,” former president Joan Gaspart beamed of the once England boss. Robson’s side were tactically flexible, extremely intelligent and had talent in spades. Of course, Ronaldo’s stellar season leading the line was the big talking point of the campaign - he hit an incredible 47 goals in all competitions - but the likes of Luis Figo and Hristo Stoichov were still reliable forces, too. Both Ronaldo and Robson were at their peak of their powers, here. This was to be a one-season wonder for both, though - Louis van Gaal replaced Sir Bobby, while R9 went to Inter. The memories of that campaign - one in which expectations were sharply adjusted before it began - are still sweet, to this day. The foundations for the ‘Dream Team’ of 1992 had its foundations laid decades before. Johan Cruyff joining the club as a player in 1973 was a clear catalyst but even before that, Barca geared up for a possession-based style by hiring Vic Buckingham in 1969 - a pioneer push-and-run style before he went to to work on total football - before replacing Buckingham with Rinus Michels in 1971. Michels had overseen the dominant, multiple Eredivisie-winning Ajax sides of the 1960s and lifted the European Cup in 1971. This was a piece of what Barcelona wanted and so they tempted the Dutchman to the Camp Nou to work his magic. A year later he brought Cruyff - for a record transfer fee - and the jigsaw was complete. Cruyff turned down Real Madrid - saying he could never join a club “associated with Franco” - and won La Liga in his first season, beating Real 5-0 on their own patch. Michels weaved his total football masterplan to devastating effect that night, with Cruyff spraying passes from deep for the likes of Carles Rexach and Juan Carlos to run onto, exhausting the opposition defence. Cruyff picked up the European footballer of the Year awards in 1973 and 1974. Few would successfully mark him until Franz Beckenbauer managed to get one over the Dutchman at the World Cup final of 1974. A European Cup never came but Cruyff excelled in Catalonia as a player. “[My] philosophy does not correspond with the culture of the country.” Louis van Gaal said when he left Barcelona in the new millenium. As a player, he was a substitute to Cruyff at Ajax; he rebuilt Ajax as a manager after Cruyff left and was the natural successor to him at Barcelona - he loved possession and relied on the academy at his fingertips. So surely his philosophy should’ve corresponded? Cruyff disagreed - he was said to despise van Gaal’s less enthralling style of play and Bobby Robson even said that he felt he was brought in for one season specifically as a buffer between Cruyff and van Gaal. When he arrived though, van Gaal brought a raft of fellow countrymen, such as Kluivert, the De Boer brothers, Boudewijn Zenden and Ruud Hesp, rebuilding the side in his image. The Dutchman came in just as Ronaldo was packing for Inter and had to implement a rigorous system to compensate - just as he did when Dennis Bergkamp left for I Nerazzurri while he was at Ajax. For sheer talent though, van Gaal's was still one of the greatest Barca sides ever. Van Gaal won two La Ligas in Spain so the decision to hire him was somewhat vindicated, at least. After an unconvincing double in his first season - if there is such a thing - Barca began controlling games far more a season later, relying on incredible flair from Ballon d’Or-winning Rivaldo. They did exit the Champions League in the group stage two seasons in a row - quite the blemish - but it was a hell of a squad while it lasted. When cracks began to show in 2000, Louis left to manage the Netherlands’ ill-fated 2002 World Cup qualification campaign. At least there, no one could complain that he picked too many Dutchmen. “What has Barcelona won in 100 years? How many Champions Leagues?” van Gaal questioned in his post-exit interview. “In six years at Ajax I won more than Barcelona had won in 100 years.” Unbelievable, really, that he had a second spell after that comment. There were some who were concerned with the idea of Frank Rijkaard managing a club of Barcelona’s stature. He was, to say the least, a volatile character - but the temper he displayed as a player melted away as he became a figure of calm in the dugout. Rijkaard ended a trophy drought of six years, making big-name signings in his first season in charge in the form Samuel Eto’o and Deco. The team revolved around the talents of Ronaldinho, as Rijkaard oversaw an exodus of older stars - Dutch trio Philip Cocu, Patrick Kluivert and Michael Reiziger all saw their contracts terminated, while Luis Enrique and Marc Overmars retired. The result was instant. Barcelona won the league playing football with flair, thanks to their exciting attack. A season later, they made very little change but drafted in youth product Lionel Messi a little more - whatever happened to that fella? - producing the first iconic front three that the little genius was a part of, alongside Ronaldinho and Eto’o. In 2006, Barcelona retained the league title again ahead of Real Madrid before breaking hearts in Paris to lift their second Champions League title. Frank Rijkaard had a short spell at but has largely left the picture as far as management is concerned - he’s the second-longest serving Barca boss since Cruyff, either way. By 2015, Barcelona hadn’t won a Champions League title since Pep Guardiola’s last one in 2011 - astonishing, really, considering the calibre of their players and the contingency plan that Pep himself put in place. But the semi-finals of the competition would pair up one club legend with another, as Pep’s new side, , took on Luis Enrique’s Barca. Guardiola’s Camp Nou return was a sour one, with his team tied in knots by trident. Having Messi, Suarez and Neymar in your team was enough for anyone - they netted an unprecedented 122 goals in all competitions that campaign and beyond that this team didn’t need much more coaching to overcome Pep’s evolving ideals. Players like Pique, Rakitic, Iniesta, Busquets and Alves coached themselves by now. Messi famously folded Jerome Boateng inside out before chipping Manuel Neuer with his right foot. It summed up the season - even against world-class opposition, just a moment of genius was enough. This was proof, too, that there was life without Pep Guardiola. - take note. Barcelona won the treble, obliterating all before them with arguably the most potent attack of all time. It’s not the prettiest side they ever built but it’s probably the most ferocious. It was said that in British music in the 1990s, everyone was influenced by Oasis whether they wanted to be or not - you either kicked against them or embraced them. Well, Cruyff was the parallel in European football at the time. Camp Nou attendances were at 40,000 spectators just a decade prior. Barcelona weren’t winning trophies around this time, of course, but they weren’t winning plaudits either: Terry Venables and Luis Aragones had both deployed pragmatic tactics and the Cules were growing tired of their team. Enter Johan Cruyff. A Cup Winners’ Cup winner with Ajax, Catalonia’s favourite adopted son brought in his 4-3-3/3-4-3 hybrid, drawing from the La Masia academy and teaching Barcelona a new way to play. He moved Guardiola from the wing to become the tempo-setter in midfield, while Ronald Koeman would step out from being a centre-back to start play at the base of midfield. Barcelona had won two La Liga titles in a 30-year stretch before Cruyff arrived. Under the Dutchman’s free-flowing philosophy, they lifted four in a row and completed their first European Cup triumph in 1992 - thanks to a rocket from the gallivanting Koeman. He didn’t just put together a successful team, he created a style of play, celebrated the world over, that would become ingrained into the DNA of a club. He’s arguably the most influential man in the game ever - and this was his managerial masterpiece. It’s sometimes levelled at Pep Guardiola that he never gives himself a challenge - he always manages the big guns. People forget though that when he took over Barcelona, they hadn’t won anything for two seasons - they were a shadow of their former Rijkaard-led side and in one of his first missions at the club, he went to war with his bosses. Lionel Messi wanted to represent Argentina at the 2008 Beijing Olympics, something Barcelona weren’t keen on him risking himself for. Pep argued his case, stating what a strong learning opportunity it was for him as a player, winning gold in Barcelona in 1992. Pep won the battle, Messi followed in his mentor’s footsteps and brought home gold. It was the first real sign of this young player showing he was a winner - Guardiola had such faith in him that he sold Ronaldinho and Deco to clear space for Messi to play. It was a bold move at the time and it could have backfired so easily - yet it proved to be a masterstroke. The early faith in Messi paid dividends, as Samuel Eto’o and Thierry Henry combined with the little genius to devastating effect. Xavi and Andres Iniesta become generals of Pep’s philosophy - the same positional play that he’d been educated in - as Barcelona swept to a magnificent treble. It showed a glimpse of what this incredible young manager - and his unbelievable protege - could deliver. Guardiola became the youngest manager of all time to ever win the Champions League in 2009. Plenty happened between Pep Guardiola’s two Champions League titles. Eto’o was swapped for Zlatan Ibrahimovic - disastrously - as Zlatan left 12 months later, spitting feathers at Pep, while Eto’o lifted a consecutive treble with Jose Mourinho’s Inter Milan. Mourinho, still angry at not getting Guardiola’s job in 2008, made sure to make a beast of himself when he knocked his adversary out of the Champions League semi-final. Henry, Marquez, Toure, Hleb, Gudjohnsen and Sylvinho were out - David Villa now led the line, Pedro had burst through the academy, Sergio Busquets was the No.6 and Javier Mascherano was Gerard Pique’s pitbull alongside him. Pep’s first Barcelona team was good - but this really felt like his own side, moulded in his image. By now, Lionel Messi had reached god level, netting 53 times in 55 games of this campaign. This was the season that perhaps Pep Guardiola still has to match up to. The football was absolutely exquisite. The team was otherworldly. They won 16 La Liga matches in a row, including the Clasico 5-0 and then dismantled Sir Alex Ferguson’s Manchester United in the Champions League final at Wembley. There has perhaps never been a team this good in world football. A beaten Ferguson admitted that Messi was the finest player he’d ever seen. Football perfection is something that Barca have been searching for, throughout their history. They’ve come so very near so very many times - but this is definitely their best case for it.","pubDate":"2023-11-30 06:00:32","image_url":"https://cdn.mos.cms.futurecdn.net/3QjZvJz8cPT8phSVBb3gNn.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"87f50bf23dbcd2367fc8b312b6192e35","title":"Kickoff | Sundowns star not giving up on Bafana future","link":"https://www.snl24.com/kickoff/sanews/premiership/mamelodi-sundowns/sundowns-star-not-giving-up-on-bafana-future-20231129","keywords":null,"creator":null,"video_url":null,"description":"Defender Terrence Mashego is refusing to throw in the towel in the possibly of making the Bafana Bafana that will play in the Afcon set to kick-off in January 2024.","content":"Mashego joined The Brazilians ahead of the 23/24 season but has struggled to cement a starting position due to injuries and competition and by since the making the switch from Cape Town City. The 25-year-old has made 10 appearances across all competitions for Sundowns, starting just two and has been riddled by injuries. | The lack of playing time has also cost Mashego a spot in recent Bafana squad, with his last call-up coming in September last year – where he had to withdraw due to injury. However, speaking at the Tswhane derby press conference, Mashego revealed that he has not closed the door on Bafana. \"I still have a chance (to make it to the Afcon squad), Mashego said. \"There is about ten games remaining before the finals (AFCON)are played. and I would say, there is still a chance and there are no regrets,\" the left-back explained Mashego. \"It’s a conversation that I had with my dad that I don’t want to retire as a player, who just played football. \"I said, I want to win titles. I want to look back one day and say, you know what, I achieved this and that. That’s why I joined Sundowns, to compete and win. | Bafana’s last three matches saw right back Nyiko Mobbie replaced by Sundowns’ Khuliso Mudau. \"That’s why I say there is a bit of a chance,\" added Mashego. \"As you saw, there is a bit of a rotation (at Bafana) and also I managed get my first 90 minutes this season. I’m looking to build on that and maybe I will get more game time hence there is still a chance.\"","pubDate":"2023-11-30 06:00:20","image_url":"https://cdn.24.co.za/files/Cms/General/d/10004/73bddb5b3fea4a03a20b367b2afe27c3.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"320244beba0f06709fbdcbfae945f9cc","title":"Almost in the bag","link":"https://mwnation.com/almost-in-the-bag/","keywords":["Front Page","National Sports"],"creator":null,"video_url":null,"description":"FCB Nyasa Bullets are within touching distance of a fifth successive TNM Super League title and a record 16th overall following their 0-1 victory over Karonga United at Karonga Stadium yesterday. Following the win, Bullets now have 59 points, three above second-placed Silver Strikers whom they meet in their last match this Sunday at Kamuzu […] The post Almost in the bag appeared first on The Nation Online.","content":"FCB Nyasa Bullets are within touching distance of a fifth successive TNM Super League title and a record 16th overall following their 0-1 victory over Karonga United at Karonga Stadium yesterday. Following the win, Bullets now have 59 points, three above second-placed Silver Strikers whom they meet in their last match this Sunday at Kamuzu Stadium in Blantyre. The People’s Team has a seven-goal difference going into their final fixture and the Central Bankers will need to win by an eight-goal margin to wrest the title from within Bullets’ nose. It is a task not beyond the realms of possibility as football has at times exhibited every inch of its unpredictability, but certainly a tall order and it will take something special for the Central Bankers to turn it around. In a match which failed to stir the passions, monitored on MBC TV, wonder kid Patrick Mwaungulu struck the priceless goal for Bullets in the seventh minute. Ephraim Kondowe floated a well-curled cross and Mwaungulu rose to head the ball home. It all looked simple, no fuss. Ingwina ya Karonga nearly drew level 10 minutes later when Pilirani Thulu’s free-kick was headed over the bar by Ellie Kayombo. In the 31st minute, the hosts came close again when Kayombo’s effort hit the post and from the rebound, Allen Chihana missed in front of a yawning goal with Bullets’ ‘keeper Richard Chimbamba well beaten. Karonga continued to push for an equaliser and twice Kayombo’s attempts through headers, were thwarted by Bullets defence which stood firm. Kondowe nearly doubled the visitors’ lead in the 62nd minute, but his chip narrowly missed the target. Both teams made several substitutions towards the end, but the scoreline remained unchanged. Referee Newton Nyirenda was forced to stop the match for about 10 minutes in added time following ugly scenes as some alleged Karonga fans threw objects onto the pitch and when action resumed, the match had long lost its rhythm. In a post-match interview, Bullets coach Kallisto Pasuwa said he would only comment about the title after the last game. Commenting on the actual match, the Zimbabwean tactician said: “We were talking about the boys being tired due to crammed fixtures and the secret was to attack early when we still had the energy and it worked. “Ofcourse the opposition started coming back stronger by hitting long balls to their tall strikers, but we defended well.” Bullets left the stadium under police escort.","pubDate":"2023-11-30 06:35:00","image_url":"https://mwnation.com/wp-content/uploads/2023/11/Mwaungulu.jpg","source_id":"mwnation","source_priority":790082,"country":["malawi"],"category":["sports"],"language":"english"},{"article_id":"3d24b79e3c4800e7c4a292b066a96652","title":"US-Sport kompakt: Franz Wagner brilliert beim achten Orlando-Sieg in Serie","link":"https://rp-online.de/sport/us-sport/nba-franz-wagner-brilliert-beim-achten-orlando-sieg-in-serie_aid-63774461","keywords":["Sport","US-Sport"],"creator":["Aaron Knopp, Maximilian Lonn, Stefan Janssen, Sebastian Kalenberg, Stefan Loyda"],"video_url":null,"description":"Während die meisten Europäer schlafen, geht es in den nordamerikanischen Profiligen hoch her. Was in der Nacht beim American Football, Basketball, Baseball und Eishockey passiert ist.","content":"Die bauen ihre beeindruckende Siegesserie in der weiter aus: Das Team der Basketball-Weltmeister Franz und Moritz Wagner fuhr mit einem 139:120 gegen die den achten Sieg in Folge ein. Zuletzt war dies der Franchise in der Saison 2010/11 gelungen. Der Teamrekord liegt bei neun erfolgreichen Partien hintereinander. Die besten Scorer aller Zeiten Überragender Spieler auf dem Parkett gegen war einmal mehr Franz Wagner, der 31 Punkte erzielte. Moritz Wagner lieferte als wichtiger Rollenspieler dazu elf Zähler ab. „Die deutsche Disziplin hilft mir ein bisschen, auf dem Boden zu bleiben“, sagte Franz Wagner: „Nach so einem Spiel nicht zu denken, dass alles großartig ist und es immer so weiter geht. Sondern weiter an sich zu arbeiten und nicht zu weit nach vorne zu blicken.“ Es gebe viele Ablenkungen, gerade wenn man gut spiele, fügte er an. „Wo ich herkomme hilft mir sehr, das nicht alles mitzubekommen und da nicht immer daran interessiert zu sein und ein bisschen filtern zu können. Um mein Leben zu leben und gut zu spielen“, sagte Franz Wagner. Das Ziel mit dem Team sei es, am Ende der Saison noch stärker zu sein. Dann geht es um die Play-offs. Die Meisterrunde würde auch gerne mit den Toronto Raptors spielen. Mit einem 112:105-Erfolg gegen die gelang den Kanadiern der neunte Sieg im 19. Spiel. Schröder erzielte lediglich acht Punkte, war aber in der spannenden Schlussphase voll da und überzeugte mit zwölf Assists. Auch Daniel Theis feiert mit den Clippers einen 131:117-Erfolg bei den , zu dem der deutsche Center fünf Zähler beitrug. Die dramatischsten Super Bowls der Geschichte Der Verkauf der Mehrheitsanteile an den Mavericks ist so gut wie besiegelt. US-Medienberichten zufolge hat sich Klubbesitzer Mark Cuban mit der Unternehmer-Familie Adelson auf einen Preis von 3,5 Milliarden US-Dollar (ca. 3,2 Mio Euro) geeinigt. Die Betreiber des Casino-Resorts Sands würden damit formal die Kontrolle an der NBA-Franchise übernehmen. Der Deal solle bis zum Ende des Jahres abgeschlossen werden. „Die Familien Adelson und Dumont haben verbindliche Kaufverträge abgeschlossen“, hieß es in einer Erklärung: „Die Familien streben einen Abschluss der Transaktion bis zum Jahresende an, vorbehaltlich der Erfüllung der üblichen Abschlussbedingungen und der Zustimmung des NBA Board of Governors.“ Das sind die Top-Transfers der neuen NBA-Saison Cuban, ein leidenschaftlicher Basketballfan und Freund von Ex-Mavericks-Superstar , hatte im Januar 2000 für 285 Millionen Dollar die Mehrheit erworben. Der 65-Jährige soll Berichten zufolge die operative Kontrolle über das Team behalten. Die Mavericks gewannen 2011 angeführt von Nowitzki ihre bislang einzige NBA-Meisterschaft.","pubDate":"2023-11-30 06:34:00","image_url":"https://rp-online.de/imgs/32/1/1/7/4/0/2/7/5/3/tok_9b526fa36a16e40715af09df0a431c6c/w950_h950_x1500_y1000_DPA_bfunk_dpa_5FAEFC007644C6B3-412af0f9ffe5afff.jpg","source_id":"rp_online","source_priority":605562,"country":["germany"],"category":["sports"],"language":"german"},{"article_id":"43cb2eb3f7b47c402bf36f3dcc614c56","title":"Julien Stéphan et le Stade Rennais poursuivent en 3-4-3 même en Europe","link":"https://www.lequipe.fr/Football/Actualites/Julien-stephan-et-le-stade-rennais-poursuivent-en-3-4-3-meme-en-europe/1434186#xtor=RSS-1","keywords":["Foot, C3, Rennes"],"creator":["Emery Taisne"],"video_url":null,"description":"Vainqueur dans un schéma en 3-4-3 contre Reims (3-1), dimanche, le Stade Rennais devrait à nouveau se présenter à trois derrière ce soir contre le Maccabi.","content":"C'est une option qui avait déjà été envisagée pour rebooster les résultats du Stade Rennais lorsque Bruno Genesio en était encore l'entraîneur : pour sa première sur le banc face à Reims (3-1) samedi dernier, Julien Stéphan a bousculé les habitudes de ses joueurs en instaurant un 3-4-3 a priori amené à perdurer. L'idée consistait à renforcer l'axe et rassurer un groupe en perte de confiance, pas assez tueur devant et beaucoup trop perméable derrière. observe l'ancien défenseur Alain Roche qui officiait en tant que consultant pour Canal+ dimanche au Roazhon Park. Belocian suspendu Rennes a eu le mauvais réflexe de se recroqueviller après l'ouverture du score d'Amine Gouiri, il a une nouvelle fois manqué de concentration sur le but d'Oumar Diakité juste avant la pause et il a concédé beaucoup de situations... Mais en termes d'implication, de rigueur et de dépassement de soi, tout le groupe a élevé le curseur. Bourigeaud a cavalé dans son couloir droit, Arnaud Kalimuendo a abattu un gros travail défensif. Et si la moyenne d'âge de sa défense centrale n'a pas subitement décollé, le trio Wooh-Belocian-Theate a plutôt donné des gages de solidité. , reprend Roche. , a insisté Arthur Theate, plutôt friand de ce schéma à trois derrière. Tactiquement, son principal inconvénient réside au milieu, où les Rennais pourraient très vite se retrouver en infériorité contre des équipes qui évoluent à trois dans ce secteur de jeu. , souligne Frédéric Antonetti, passé sur le banc rennais entre 2009 et 2013. Mercredi, Stéphan a rappelé que tout était une question d'animation et de philosophie de jeu. Il devra faire ce soir sans Jeanuël Belocian, suspendu, alors que Warmed Omari effectue, lui, son retour. En cas de succès, le Stade Rennais sera assuré de terminer a minima à la deuxième place du groupe.","pubDate":"2023-11-30 06:30:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/julien-stephan-p-lahalle-l-equipe/1500000001875708/0:0,1997:1331-665-335-70/b6e2e.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"1f68e04d7496380d72d20c91317c0ca2","title":"Ботев Враца си връща защитник","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/botev-vraca-si-vryshta-zashtitnik-765843","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Ботев Враца обмисля да си върне левия бек Том Рапнуи. Французинът премина в ЦСКА 1948, но така и не можа да се наложи и основно е използван от дубъла. Врачани ще търсят подсилване именно в крайните защитници. Както е известно, Момичл Цветанов изненадващо си тръгна от стадион „Христо Ботев“ и не се знае дали ще се върне. Рапнуи нямал нищо против да облече екипа на врачани. 22-годишният французин не попада в плановете на столичани, които са готови да го върнат във Враца.","pubDate":"2023-11-30 06:21:00","image_url":"https://m3.netinfo.bg/media/images/50514/50514231/960-600-tom-rapnui.jpg","source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"2d1007bcee03989a0630e95708a80bec","title":"Brighton's Fati, Lamptey out for 'long time', says De Zebri","link":"https://www.straitstimes.com/sport/football/brightons-fati-lamptey-out-for-long-time-says-de-zebri","keywords":null,"creator":["The Straits Times"],"video_url":null,"description":"November 30, 2023 2:16 PMBrighton & Hove Albion forward Ansu Fati and defender Tariq Lamptey will both be sidelined for a significant period after picking up injuries at the weekend, manager Roberto De Zerbi said.","content":"Brighton & Hove Albion forward Ansu Fati and defender Tariq Lamptey will both be sidelined for a significant period after picking up injuries at the weekend, manager Roberto De Zerbi said. Lamptey and Barcelona loanee Fati went down injured in the first half of Brighton's 3-2 victory at Nottingham Forest on Saturday, when they ended their six-game winless run in the Premier League. Brighton, who face AEK Athens in the Europa League later on Thursday, have been struggling with a number of key players out of action, including Kaoru Mitoma, Danny Welbeck, Solly March and Julio Enciso. \"Ansu and Lamptey are both injured,\" Italian De Zebri told reporters on Wednesday. \"We have lost them for a long time, I think.\" Brighton are second in Group B on seven points from four games, a point behind Marseille. They lost to AEK in their campaign opener but have the chance to make up for that defeat in Athens. The lengthy injury list makes their task harder but De Zebri said they had to focus on the players who are fit. \"We will have to compete,\" he added. \"I don't know if we will win, but we will fight to win the game for sure.\" REUTERS","pubDate":"2023-11-30 06:16:22","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"e9f499cc94730fd82408ab2ff028ab67","title":"Лудогорец гостува на Спартак Търнава в търсене на нова победа в ЛК","link":"https://gong.bg/bg-football/evrouchastnici/multimedia/video/ludogorec-gostuva-na-spartak-tyrnava-v-tyrsene-na-nova-pobeda-v-lk-765840","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Отборът на Лудогорец гостува на Спартак Търнава в мач от груповата фаза в Лигата на конференциите. Двубоят стартира в 22:00 часа българско време и ще бъде предаван пряко по MAX Sport 3. Разградчани влизат в мача след изненадваща загуба у дома срещу Славия (2:3) в последния кръг на efbet Лига. Това бе и първа загуба за българския шампион в първенството ни след завръщането на Георги Дерменджиев. В първия мач между Лудогорец и Спартак Търнава \"орлите\" записаха категоричен успех с 4:0 в Разград. Победата бе изкована през втората част, когато паднаха и четирите гола във вратата на словаците, а с основна заслуга тогава бе Якуб Пьотровски, който реализира две от попаденията. Ситуацията в Група H е заплетена като Фенербахче води с 9 точки, а Нордселанд е втори със 7 пункта. Лудогорец пък е с точка зад датчаните, които днес приемат Фенербахче. Именно затова за разградчани е много важно да победят Търнава и да се надяват на благоприятен развой в другата среща, с който да се озоват в позициите, даващи право на участие в следващата фаза на Лига на конференциите. Спартак Търнава обаче влиза в днешния сблъсък след пет поредни успеха в първенството на Словакия и равенство в Дания с Нордселанд. Андрей Джурич няма да е на разположение за тима, както и Азис Осени, а пък Ян Бернат ще виси до последно. За гостуването в Търнава Дерменджиев има сериозни кадрови проблеми. Националът Спас Делев отпадна в последния момент заради настинка. Халфът Иван Йорданов също не попадна в групата за Словакия. 23-годишният национал се възстановява след операция на херния. Аут от сметките на Дерменджиев е и Марсел Хайстер. Трайно контузен пък е Диниш Алмейда.","pubDate":"2023-11-30 06:11:00","image_url":"https://m4.netinfo.bg/media/images/50600/50600022/960-600-ludogorec-vs-spartak-tyrnava.jpg","source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"4f7d1c2a8d5931e9cb1c6b9d0f849671","title":"Wanyama hopes to steer Kenya’s 3×3 team into first ever Olympics","link":"https://www.capitalfm.co.ke/sports/2023/11/30/wanyama-hopes-to-steer-kenyas-3x3-team-into-first-ever-olympics/?utm_source=rss&utm_medium=rss&utm_campaign=wanyama-hopes-to-steer-kenyas-3x3-team-into-first-ever-olympics","keywords":["Basketball","Sports","featured"],"creator":["Timothy Olobulu"],"video_url":null,"description":"NAIROBI, Kenya, Nov 30 – Lithuania-based Mercy Wanyama has made the final Kenyan team for the 3×3 Africa Cup which starts in Egypt on Friday, and the forward has voiwed to use her European experience to help the team clinch a qualifier slot. Wanyama, who has recently joined Lithuanian league side BC Siauliai believes they […] The post Wanyama hopes to steer Kenya’s 3×3 team into first ever Olympics appeared first on Capital Sports.","content":"Wanyama, who has recently joined Lithuanian league side BC Siauliai believes they have a strong team and can easily battle to clinch the Africa Cup and book a direct ticket to the Universality One, which gives them a chance to qualify for the Olympic Games. The younger sister to football royalty Victor Wanyama and MacDonald Mariga will be playing the 3×3 for the first time, but says she is ready. “It feels great to join up with the team. It is my first time on the 3×3 but I understand the game. We will do our best as a team,” Wanyama said. She adds; Every player wants to represent their country at the Olympics and for us it is not different. We want to go there and give our best to be in Paris. This is very big for us because Kenya has never qualified for the Olympics in basketball and we want to make history for the 50million+ Kenyans.” Wanyama has spent the last six years in Europe and played in Spain last season before making the switch to Lithuania, where she has already curved her niche and is a dependable player for her club. She hopes her experience can help the team in Egypt. “I have really grown. I am not the same Mercy I was five years ago. I am bringing what I have learnt on that side and with the talented players we have from the local league, I believe we will do great things,” she notes. The team will be skippered by KPA’s Natalie Akinyi, and will also include teammate Hilda Indasi and Zetech University’s Madina Okot. Captain Natalie says the team is ready to battle out and win the Africa Cup, which gives them a direct ticket to the Olympic qualifiers. “We have a very good team compared to last year and we want to go to the Olympics. Each one of us wants to be called an Olympian so we are ready to give our all in Egypt. Playing at the Olympics is a good platform to showcase our talents and our target is to give it a very good shot,” said the KPA point guard. The team will be coached by Evelyn Kedogo, who says they have trained really well and are looking to go all out and clinch the title. “The training has been really good and we had a Strength and Conditioning coach for the first time and this has really helped us to build our physicality. I believe we are ready as a team and we have what it takes to win,” noted the coach. The Kenyan women team is currently ranked fourth in Africa. They will clash with Nigeria, Mali, Madagascar and Benin in their group. Winning all matches will earn them a direct slot in the semi-finals.","pubDate":"2023-11-30 06:07:37","image_url":"https://www.capitalfm.co.ke/sports/files/2023/11/IMG_5979-1024x665.jpg","source_id":"capitalfm","source_priority":143748,"country":["kenya"],"category":["sports"],"language":"english"},{"article_id":"de464f1a09ae2413eebb9940ba79d09b","title":"Programme TV foot : à quelle heure et sur quelle chaîne voir les matchs de ce soir (30 novembre 2023) ?","link":"https://www.lequipe.fr/Football/Actualites/Programme-tv-foot-a-quelle-heure-et-sur-quelle-chaine-voir-les-matchs-de-ce-soir-30-novembre-2023/1434233#xtor=RSS-1","keywords":["Foot"],"creator":["Base de données"],"video_url":null,"description":"Retrouvez l'intégralité des retransmissions des matches de football du jour retransmis sur toutes les chaînes du bouquet TNT, Câble et Satellite. Ligue 1, Ligue 2, Premier League, coupes d'Europe... Suivez tous les matches en direct sur votre télévision ou en streaming.","content":"Retrouvez l'intégralité du . - Multizone : à 18h45 en direct sur RMC Sport Live 4 - Multizone : à 21 heures en direct sur RMC Sport Live 4 - Sturm Graz - Rakow Czestochowa : à 18h45 en direct sur RMC Sport Live 10 - AEK Athènes - Brighton : à 18h45 en direct sur RMC Sport Live 5 - Atalanta Bergame - Sporting Portugal : à 18h45 en direct sur RMC Sport Live 6 - TSC Backa Topola - West Ham : à 18h45 en direct sur RMC Sport Live 7 - Sparta Prague - Betis Séville : à 18h45 en direct sur RMC Sport Live 8 - Fribourg - Olympiakos : à 18h45 en direct sur RMC Sport Live 9 - Maccabi Haïfa - Rennes : à 18h45 en direct sur RMC Sport UHD et RMC Sport 1 - Marseille - Ajax Amsterdam : à 21 heures en clair et en direct sur M6 et Canal+ Foot - Molde FK - Karabagh FC : à 21 heures en direct sur RMC Sport Live 10 - Liverpool - Linz ASK : à 21 heures en direct sur RMC Sport Live 3 - Villarreal - Panathinaïkos : à 21 heures en direct sur RMC Sport Live 5 - Servette Genève - AS Rome : à 21 heures en direct sur RMC Sport Live 6 - BK Häcken - Bayer Leverkusen : à 21 heures en direct sur RMC Sport Live 7 - Glasgow Rangers - Aris Limassol : à 21 heures en direct sur RMC Sport Live 8 - Sheriff Tiraspol - Slavia Prague : à 21 heures en direct sur RMC Sport Live 9 - Toulouse - Union Saint-Gilloise : à 21 heures en direct sur RMC Sport UHD et RMC Sport 1 - FC Astana - Dinamo Zagreb : à 16h30 en direct sur RMC Sport Live 3 - Besiktas - Club Bruges : à 18h45 en direct sur RMC Sport Live 11 - KI Klaksvik - Slovan Bratislava : à 18h45 en direct sur RMC Sport Live 12 - Bodo/Glimt - FC Lugano : à 18h45 en direct sur RMC Sport Live 14 - La Gantoise - Zorya Lougansk : à 18h45 en direct sur RMC Sport Live 15 - HJK Helsinki - Aberdeen : à 18h45 en direct sur RMC Sport Live 16 - KF Ballkani - Viktoria Plzen : à 18h45 en direct sur RMC Sport Live 17 - Olimpija Ljubljana - Lille : à 18h45 en direct sur RMC Sport Live 3 - Eintracht Francfort - PAOK Salonique : à 21 heures en direct sur RMC Sport Live 11 - Fiorentina - Racing Genk : à 21 heures en direct sur RMC Sport Live 12 - FC Nordsjälland - Fenerbahçe : à 21 heures en direct sur RMC Sport Live 13 - Cukaricki Belgrade - Ferencvaros : à 21 heures en direct sur RMC Sport Live 14 - Spartak Trnava - Ludogorets Razgrad : à 21 heures en direct sur RMC Sport Live 15 - AZ Alkmaar - Zrinjski Mostar : à 18h45 en direct sur RMC Sport Live 13 - Breidablik - Maccabi Tel-Aviv : à 14 heures en direct sur RMC Sport Live 3 - Abha Club - Al-Ahli FC : à 16 heures en direct sur Canal+ Foot","pubDate":"2023-11-30 06:00:44","image_url":"https://medias.lequipe.fr/img-photo-jpg/-/1500000001560312/4:0,2500:1664-665-335-70/77bc2.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"b7172f44de3d796f88e8fb2a9a741ea3","title":"Ranked! The 10 best Barcelona sides ever","link":"https://www.fourfourtwo.com/features/ranked-the-10-best-barcelona-sides-ever","keywords":["Lists"],"creator":["mark.j.white@futurenet.com (Mark White)"],"video_url":null,"description":"Delving into the depths of the best Barcelona sides ever – from Rivaldo to Ronaldinho, Maradona to Messi","content":"In 2011, Pep Guardiola won his second Champions League title as Barcelona manager with arguably the greatest performance his side had ever delivered - and what a stage to do it. It was a display that had everything you’d associate with Barcelona. Control, dominance and attacking intent throughout as Barca toyed with like a cat with a ball of string. Yet when asked whether this side had surpassed the ‘Dream Team’ that Guardiola himself had been a part of under Johan Cruyff, Pep was coy to answer. Instead, he said that this side would never have been possible with Cruyff’s team. The way that Guardiola saw it, his philosophy was merely a continuation of his mentor’s and that the way - the correct way to play - was the most important thing. Well, we’re going to pose the questions that Pep himself wouldn’t answer. Which team was the best? There are plenty to choose from… In an El Classico tie in 1983, Diego Maradona rounded the goalkeeper and was about to score, before a flying tackle came in from Juan Jose. Maradona stood still, waiting for the defender to smack into the post, slotting the ball into the empty net. The Argentine was the first Barcelona player to be given a standing ovation by a Bernabeu audience. He was an undisputed world-beater and would have won more in Spain, perhaps, had it not been for bad luck and ill-discipline. He suffered hepatitis, before a broken ankle - caused by Andoni “the Butcher of Bilbao” Goikoetxea - though sometimes he was to blame for trouble. At one point, Diego trashed the Camp Nou trophy room because he wasn’t allowed his passport - while his Barca career ended with him in the centre of a mass brawl, kicking and punching anyone in an shirt, after an on-pitch argument broke out into a shocking fight. Long before Barca execs were trying to offload Maradona to for his nonsense though, Maradona was the jewel of the side under legendary managers Udo Lattek - who managed in their glory years - and Cesar Luis Menotti - who won the World Cup with Argentina in 1978. Bernd Schuster was in that side too - a future star. It was a pleasure to watch the Argentine at the time, given free roam in front of a solid defence and hard-working midfield, often partnering Lobo Carrasco up top for the Blaugrana. It was a great side but not one that won a league trophy. Long before Barcelona became wedded to the beautiful Cruyffian ideals that would come to define the club, another kind of philosopher was at the reigns of the club. Helenio Herrera won La Liga in 1950 and 1951 with and arrived in Catalonia as the king of “catenaccio”, a style of play that relied on a sweeper-type defender to act as a door lock and keep the defence tight. Herrera is often likened to Jose Mourinho for his larger-than-life persona and tactics which history has chalked up as dour compared to more “progressive” managers - but that’s not to say that Barca didn’t still play fluid, attacking football at times that later presidents would have been proud of. Hungarian Laszlo Kubala and 1960 Ballon d’Or winner Luis Suarez were the two stars of the side, which won La Liga in 1958/59 and 1959/60. Herrera left the club in 1960 after clashing with Kubala one too many times, taking charge of the Spanish national side before going to and winning two European Cups with his talisman Suarez. Barca were the first side to ever knock Real Madrid out of the European Cup, too, during Herrera’s time at the club - it’s a case of maybe what could have been for this phenomenally talented side, despite the domestic dominance. Maybe that first wait for a European title could have come sooner. Imagine having Bobby Robson on your bench, Jose Mourinho as his translator and Pep Guardiola as your captain. You should be fine for leadership, right? Now imagine you’ve got Ronaldo up front, too. But this was a tough time in Catalonia. Johan Cruyff, the club’s modern founding father, had just left - Robson stepped up though, winning the UEFA Cup Winners' Cup, the Copa Del Rey and finishing second in La Liga. “He arrived as if he was in Barcelona for the last 20 years,” former president Joan Gaspart beamed of the once England boss. Robson’s side were tactically flexible, extremely intelligent and had talent in spades. Of course, Ronaldo’s stellar season leading the line was the big talking point of the campaign - he hit an incredible 47 goals in all competitions - but the likes of Luis Figo and Hristo Stoichov were still reliable forces, too. Both Ronaldo and Robson were at their peak of their powers, here. This was to be a one-season wonder for both, though - Louis van Gaal replaced Sir Bobby, while R9 went to Inter. The memories of that campaign - one in which expectations were sharply adjusted before it began - are still sweet, to this day. The foundations for the ‘Dream Team’ of 1992 had its foundations laid decades before. Johan Cruyff joining the club as a player in 1973 was a clear catalyst but even before that, Barca geared up for a possession-based style by hiring Vic Buckingham in 1969 - a pioneer push-and-run style before he went to to work on total football - before replacing Buckingham with Rinus Michels in 1971. Michels had overseen the dominant, multiple Eredivisie-winning Ajax sides of the 1960s and lifted the European Cup in 1971. This was a piece of what Barcelona wanted and so they tempted the Dutchman to the Camp Nou to work his magic. A year later he brought Cruyff - for a record transfer fee - and the jigsaw was complete. Cruyff turned down Real Madrid - saying he could never join a club “associated with Franco” - and won La Liga in his first season, beating Real 5-0 on their own patch. Michels weaved his total football masterplan to devastating effect that night, with Cruyff spraying passes from deep for the likes of Carles Rexach and Juan Carlos to run onto, exhausting the opposition defence. Cruyff picked up the European footballer of the Year awards in 1973 and 1974. Few would successfully mark him until Franz Beckenbauer managed to get one over the Dutchman at the World Cup final of 1974. A European Cup never came but Cruyff excelled in Catalonia as a player. “[My] philosophy does not correspond with the culture of the country.” Louis van Gaal said when he left Barcelona in the new millenium. As a player, he was a substitute to Cruyff at Ajax; he rebuilt Ajax as a manager after Cruyff left and was the natural successor to him at Barcelona - he loved possession and relied on the academy at his fingertips. So surely his philosophy should’ve corresponded? Cruyff disagreed - he was said to despise van Gaal’s less enthralling style of play and Bobby Robson even said that he felt he was brought in for one season specifically as a buffer between Cruyff and van Gaal. When he arrived though, van Gaal brought a raft of fellow countrymen, such as Kluivert, the De Boer brothers, Boudewijn Zenden and Ruud Hesp, rebuilding the side in his image. The Dutchman came in just as Ronaldo was packing for Inter and had to implement a rigorous system to compensate - just as he did when Dennis Bergkamp left for I Nerazzurri while he was at Ajax. For sheer talent though, van Gaal's was still one of the greatest Barca sides ever. Van Gaal won two La Ligas in Spain so the decision to hire him was somewhat vindicated, at least. After an unconvincing double in his first season - if there is such a thing - Barca began controlling games far more a season later, relying on incredible flair from Ballon d’Or-winning Rivaldo. They did exit the Champions League in the group stage two seasons in a row - quite the blemish - but it was a hell of a squad while it lasted. When cracks began to show in 2000, Louis left to manage the Netherlands’ ill-fated 2002 World Cup qualification campaign. At least there, no one could complain that he picked too many Dutchmen. “What has Barcelona won in 100 years? How many Champions Leagues?” van Gaal questioned in his post-exit interview. “In six years at Ajax I won more than Barcelona had won in 100 years.” Unbelievable, really, that he had a second spell after that comment. There were some who were concerned with the idea of Frank Rijkaard managing a club of Barcelona’s stature. He was, to say the least, a volatile character - but the temper he displayed as a player melted away as he became a figure of calm in the dugout. Rijkaard ended a trophy drought of six years, making big-name signings in his first season in charge in the form Samuel Eto’o and Deco. The team revolved around the talents of Ronaldinho, as Rijkaard oversaw an exodus of older stars - Dutch trio Philip Cocu, Patrick Kluivert and Michael Reiziger all saw their contracts terminated, while Luis Enrique and Marc Overmars retired. The result was instant. Barcelona won the league playing football with flair, thanks to their exciting attack. A season later, they made very little change but drafted in youth product Lionel Messi a little more - whatever happened to that fella? - producing the first iconic front three that the little genius was a part of, alongside Ronaldinho and Eto’o. In 2006, Barcelona retained the league title again ahead of Real Madrid before breaking hearts in Paris to lift their second Champions League title. Frank Rijkaard had a short spell at but has largely left the picture as far as management is concerned - he’s the second-longest serving Barca boss since Cruyff, either way. By 2015, Barcelona hadn’t won a Champions League title since Pep Guardiola’s last one in 2011 - astonishing, really, considering the calibre of their players and the contingency plan that Pep himself put in place. But the semi-finals of the competition would pair up one club legend with another, as Pep’s new side, , took on Luis Enrique’s Barca. Guardiola’s Camp Nou return was a sour one, with his team tied in knots by trident. Having Messi, Suarez and Neymar in your team was enough for anyone - they netted an unprecedented 122 goals in all competitions that campaign and beyond that this team didn’t need much more coaching to overcome Pep’s evolving ideals. Players like Pique, Rakitic, Iniesta, Busquets and Alves coached themselves by now. Messi famously folded Jerome Boateng inside out before chipping Manuel Neuer with his right foot. It summed up the season - even against world-class opposition, just a moment of genius was enough. This was proof, too, that there was life without Pep Guardiola. - take note. Barcelona won the treble, obliterating all before them with arguably the most potent attack of all time. It’s not the prettiest side they ever built but it’s probably the most ferocious. It was said that in British music in the 1990s, everyone was influenced by Oasis whether they wanted to be or not - you either kicked against them or embraced them. Well, Cruyff was the parallel in European football at the time. Camp Nou attendances were at 40,000 spectators just a decade prior. Barcelona weren’t winning trophies around this time, of course, but they weren’t winning plaudits either: Terry Venables and Luis Aragones had both deployed pragmatic tactics and the Cules were growing tired of their team. Enter Johan Cruyff. A Cup Winners’ Cup winner with Ajax, Catalonia’s favourite adopted son brought in his 4-3-3/3-4-3 hybrid, drawing from the La Masia academy and teaching Barcelona a new way to play. He moved Guardiola from the wing to become the tempo-setter in midfield, while Ronald Koeman would step out from being a centre-back to start play at the base of midfield. Barcelona had won two La Liga titles in a 30-year stretch before Cruyff arrived. Under the Dutchman’s free-flowing philosophy, they lifted four in a row and completed their first European Cup triumph in 1992 - thanks to a rocket from the gallivanting Koeman. He didn’t just put together a successful team, he created a style of play, celebrated the world over, that would become ingrained into the DNA of a club. He’s arguably the most influential man in the game ever - and this was his managerial masterpiece. It’s sometimes levelled at Pep Guardiola that he never gives himself a challenge - he always manages the big guns. People forget though that when he took over Barcelona, they hadn’t won anything for two seasons - they were a shadow of their former Rijkaard-led side and in one of his first missions at the club, he went to war with his bosses. Lionel Messi wanted to represent Argentina at the 2008 Beijing Olympics, something Barcelona weren’t keen on him risking himself for. Pep argued his case, stating what a strong learning opportunity it was for him as a player, winning gold in Barcelona in 1992. Pep won the battle, Messi followed in his mentor’s footsteps and brought home gold. It was the first real sign of this young player showing he was a winner - Guardiola had such faith in him that he sold Ronaldinho and Deco to clear space for Messi to play. It was a bold move at the time and it could have backfired so easily - yet it proved to be a masterstroke. The early faith in Messi paid dividends, as Samuel Eto’o and Thierry Henry combined with the little genius to devastating effect. Xavi and Andres Iniesta become generals of Pep’s philosophy - the same positional play that he’d been educated in - as Barcelona swept to a magnificent treble. It showed a glimpse of what this incredible young manager - and his unbelievable protege - could deliver. Guardiola became the youngest manager of all time to ever win the Champions League in 2009. Plenty happened between Pep Guardiola’s two Champions League titles. Eto’o was swapped for Zlatan Ibrahimovic - disastrously - as Zlatan left 12 months later, spitting feathers at Pep, while Eto’o lifted a consecutive treble with Jose Mourinho’s Inter Milan. Mourinho, still angry at not getting Guardiola’s job in 2008, made sure to make a beast of himself when he knocked his adversary out of the Champions League semi-final. Henry, Marquez, Toure, Hleb, Gudjohnsen and Sylvinho were out - David Villa now led the line, Pedro had burst through the academy, Sergio Busquets was the No.6 and Javier Mascherano was Gerard Pique’s pitbull alongside him. Pep’s first Barcelona team was good - but this really felt like his own side, moulded in his image. By now, Lionel Messi had reached god level, netting 53 times in 55 games of this campaign. This was the season that perhaps Pep Guardiola still has to match up to. The football was absolutely exquisite. The team was otherworldly. They won 16 La Liga matches in a row, including the Clasico 5-0 and then dismantled Sir Alex Ferguson’s Manchester United in the Champions League final at Wembley. There has perhaps never been a team this good in world football. A beaten Ferguson admitted that Messi was the finest player he’d ever seen. Football perfection is something that Barca have been searching for, throughout their history. They’ve come so very near so very many times - but this is definitely their best case for it.","pubDate":"2023-11-30 06:00:32","image_url":"https://cdn.mos.cms.futurecdn.net/3QjZvJz8cPT8phSVBb3gNn.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"87f50bf23dbcd2367fc8b312b6192e35","title":"Kickoff | Sundowns star not giving up on Bafana future","link":"https://www.snl24.com/kickoff/sanews/premiership/mamelodi-sundowns/sundowns-star-not-giving-up-on-bafana-future-20231129","keywords":null,"creator":null,"video_url":null,"description":"Defender Terrence Mashego is refusing to throw in the towel in the possibly of making the Bafana Bafana that will play in the Afcon set to kick-off in January 2024.","content":"Mashego joined The Brazilians ahead of the 23/24 season but has struggled to cement a starting position due to injuries and competition and by since the making the switch from Cape Town City. The 25-year-old has made 10 appearances across all competitions for Sundowns, starting just two and has been riddled by injuries. | The lack of playing time has also cost Mashego a spot in recent Bafana squad, with his last call-up coming in September last year – where he had to withdraw due to injury. However, speaking at the Tswhane derby press conference, Mashego revealed that he has not closed the door on Bafana. \"I still have a chance (to make it to the Afcon squad), Mashego said. \"There is about ten games remaining before the finals (AFCON)are played. and I would say, there is still a chance and there are no regrets,\" the left-back explained Mashego. \"It’s a conversation that I had with my dad that I don’t want to retire as a player, who just played football. \"I said, I want to win titles. I want to look back one day and say, you know what, I achieved this and that. That’s why I joined Sundowns, to compete and win. | Bafana’s last three matches saw right back Nyiko Mobbie replaced by Sundowns’ Khuliso Mudau. \"That’s why I say there is a bit of a chance,\" added Mashego. \"As you saw, there is a bit of a rotation (at Bafana) and also I managed get my first 90 minutes this season. I’m looking to build on that and maybe I will get more game time hence there is still a chance.\"","pubDate":"2023-11-30 06:00:20","image_url":"https://cdn.24.co.za/files/Cms/General/d/10004/73bddb5b3fea4a03a20b367b2afe27c3.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"320244beba0f06709fbdcbfae945f9cc","title":"Almost in the bag","link":"https://mwnation.com/almost-in-the-bag/","keywords":["Front Page","National Sports"],"creator":null,"video_url":null,"description":"FCB Nyasa Bullets are within touching distance of a fifth successive TNM Super League title and a record 16th overall following their 0-1 victory over Karonga United at Karonga Stadium yesterday. Following the win, Bullets now have 59 points, three above second-placed Silver Strikers whom they meet in their last match this Sunday at Kamuzu […] The post Almost in the bag appeared first on The Nation Online.","content":"FCB Nyasa Bullets are within touching distance of a fifth successive TNM Super League title and a record 16th overall following their 0-1 victory over Karonga United at Karonga Stadium yesterday. Following the win, Bullets now have 59 points, three above second-placed Silver Strikers whom they meet in their last match this Sunday at Kamuzu Stadium in Blantyre. The People’s Team has a seven-goal difference going into their final fixture and the Central Bankers will need to win by an eight-goal margin to wrest the title from within Bullets’ nose. It is a task not beyond the realms of possibility as football has at times exhibited every inch of its unpredictability, but certainly a tall order and it will take something special for the Central Bankers to turn it around. In a match which failed to stir the passions, monitored on MBC TV, wonder kid Patrick Mwaungulu struck the priceless goal for Bullets in the seventh minute. Ephraim Kondowe floated a well-curled cross and Mwaungulu rose to head the ball home. It all looked simple, no fuss. Ingwina ya Karonga nearly drew level 10 minutes later when Pilirani Thulu’s free-kick was headed over the bar by Ellie Kayombo. In the 31st minute, the hosts came close again when Kayombo’s effort hit the post and from the rebound, Allen Chihana missed in front of a yawning goal with Bullets’ ‘keeper Richard Chimbamba well beaten. Karonga continued to push for an equaliser and twice Kayombo’s attempts through headers, were thwarted by Bullets defence which stood firm. Kondowe nearly doubled the visitors’ lead in the 62nd minute, but his chip narrowly missed the target. Both teams made several substitutions towards the end, but the scoreline remained unchanged. Referee Newton Nyirenda was forced to stop the match for about 10 minutes in added time following ugly scenes as some alleged Karonga fans threw objects onto the pitch and when action resumed, the match had long lost its rhythm. In a post-match interview, Bullets coach Kallisto Pasuwa said he would only comment about the title after the last game. Commenting on the actual match, the Zimbabwean tactician said: “We were talking about the boys being tired due to crammed fixtures and the secret was to attack early when we still had the energy and it worked. “Ofcourse the opposition started coming back stronger by hitting long balls to their tall strikers, but we defended well.” Bullets left the stadium under police escort.","pubDate":"2023-11-30 06:35:00","image_url":"https://mwnation.com/wp-content/uploads/2023/11/Mwaungulu.jpg","source_id":"mwnation","source_priority":790082,"country":["malawi"],"category":["sports"],"language":"english"},{"article_id":"3d24b79e3c4800e7c4a292b066a96652","title":"US-Sport kompakt: Franz Wagner brilliert beim achten Orlando-Sieg in Serie","link":"https://rp-online.de/sport/us-sport/nba-franz-wagner-brilliert-beim-achten-orlando-sieg-in-serie_aid-63774461","keywords":["Sport","US-Sport"],"creator":["Aaron Knopp, Maximilian Lonn, Stefan Janssen, Sebastian Kalenberg, Stefan Loyda"],"video_url":null,"description":"Während die meisten Europäer schlafen, geht es in den nordamerikanischen Profiligen hoch her. Was in der Nacht beim American Football, Basketball, Baseball und Eishockey passiert ist.","content":"Die bauen ihre beeindruckende Siegesserie in der weiter aus: Das Team der Basketball-Weltmeister Franz und Moritz Wagner fuhr mit einem 139:120 gegen die den achten Sieg in Folge ein. Zuletzt war dies der Franchise in der Saison 2010/11 gelungen. Der Teamrekord liegt bei neun erfolgreichen Partien hintereinander. Die besten Scorer aller Zeiten Überragender Spieler auf dem Parkett gegen war einmal mehr Franz Wagner, der 31 Punkte erzielte. Moritz Wagner lieferte als wichtiger Rollenspieler dazu elf Zähler ab. „Die deutsche Disziplin hilft mir ein bisschen, auf dem Boden zu bleiben“, sagte Franz Wagner: „Nach so einem Spiel nicht zu denken, dass alles großartig ist und es immer so weiter geht. Sondern weiter an sich zu arbeiten und nicht zu weit nach vorne zu blicken.“ Es gebe viele Ablenkungen, gerade wenn man gut spiele, fügte er an. „Wo ich herkomme hilft mir sehr, das nicht alles mitzubekommen und da nicht immer daran interessiert zu sein und ein bisschen filtern zu können. Um mein Leben zu leben und gut zu spielen“, sagte Franz Wagner. Das Ziel mit dem Team sei es, am Ende der Saison noch stärker zu sein. Dann geht es um die Play-offs. Die Meisterrunde würde auch gerne mit den Toronto Raptors spielen. Mit einem 112:105-Erfolg gegen die gelang den Kanadiern der neunte Sieg im 19. Spiel. Schröder erzielte lediglich acht Punkte, war aber in der spannenden Schlussphase voll da und überzeugte mit zwölf Assists. Auch Daniel Theis feiert mit den Clippers einen 131:117-Erfolg bei den , zu dem der deutsche Center fünf Zähler beitrug. Die dramatischsten Super Bowls der Geschichte Der Verkauf der Mehrheitsanteile an den Mavericks ist so gut wie besiegelt. US-Medienberichten zufolge hat sich Klubbesitzer Mark Cuban mit der Unternehmer-Familie Adelson auf einen Preis von 3,5 Milliarden US-Dollar (ca. 3,2 Mio Euro) geeinigt. Die Betreiber des Casino-Resorts Sands würden damit formal die Kontrolle an der NBA-Franchise übernehmen. Der Deal solle bis zum Ende des Jahres abgeschlossen werden. „Die Familien Adelson und Dumont haben verbindliche Kaufverträge abgeschlossen“, hieß es in einer Erklärung: „Die Familien streben einen Abschluss der Transaktion bis zum Jahresende an, vorbehaltlich der Erfüllung der üblichen Abschlussbedingungen und der Zustimmung des NBA Board of Governors.“ Das sind die Top-Transfers der neuen NBA-Saison Cuban, ein leidenschaftlicher Basketballfan und Freund von Ex-Mavericks-Superstar , hatte im Januar 2000 für 285 Millionen Dollar die Mehrheit erworben. Der 65-Jährige soll Berichten zufolge die operative Kontrolle über das Team behalten. Die Mavericks gewannen 2011 angeführt von Nowitzki ihre bislang einzige NBA-Meisterschaft.","pubDate":"2023-11-30 06:34:00","image_url":"https://rp-online.de/imgs/32/1/1/7/4/0/2/7/5/3/tok_9b526fa36a16e40715af09df0a431c6c/w950_h950_x1500_y1000_DPA_bfunk_dpa_5FAEFC007644C6B3-412af0f9ffe5afff.jpg","source_id":"rp_online","source_priority":605562,"country":["germany"],"category":["sports"],"language":"german"},{"article_id":"43cb2eb3f7b47c402bf36f3dcc614c56","title":"Julien Stéphan et le Stade Rennais poursuivent en 3-4-3 même en Europe","link":"https://www.lequipe.fr/Football/Actualites/Julien-stephan-et-le-stade-rennais-poursuivent-en-3-4-3-meme-en-europe/1434186#xtor=RSS-1","keywords":["Foot, C3, Rennes"],"creator":["Emery Taisne"],"video_url":null,"description":"Vainqueur dans un schéma en 3-4-3 contre Reims (3-1), dimanche, le Stade Rennais devrait à nouveau se présenter à trois derrière ce soir contre le Maccabi.","content":"C'est une option qui avait déjà été envisagée pour rebooster les résultats du Stade Rennais lorsque Bruno Genesio en était encore l'entraîneur : pour sa première sur le banc face à Reims (3-1) samedi dernier, Julien Stéphan a bousculé les habitudes de ses joueurs en instaurant un 3-4-3 a priori amené à perdurer. L'idée consistait à renforcer l'axe et rassurer un groupe en perte de confiance, pas assez tueur devant et beaucoup trop perméable derrière. observe l'ancien défenseur Alain Roche qui officiait en tant que consultant pour Canal+ dimanche au Roazhon Park. Belocian suspendu Rennes a eu le mauvais réflexe de se recroqueviller après l'ouverture du score d'Amine Gouiri, il a une nouvelle fois manqué de concentration sur le but d'Oumar Diakité juste avant la pause et il a concédé beaucoup de situations... Mais en termes d'implication, de rigueur et de dépassement de soi, tout le groupe a élevé le curseur. Bourigeaud a cavalé dans son couloir droit, Arnaud Kalimuendo a abattu un gros travail défensif. Et si la moyenne d'âge de sa défense centrale n'a pas subitement décollé, le trio Wooh-Belocian-Theate a plutôt donné des gages de solidité. , reprend Roche. , a insisté Arthur Theate, plutôt friand de ce schéma à trois derrière. Tactiquement, son principal inconvénient réside au milieu, où les Rennais pourraient très vite se retrouver en infériorité contre des équipes qui évoluent à trois dans ce secteur de jeu. , souligne Frédéric Antonetti, passé sur le banc rennais entre 2009 et 2013. Mercredi, Stéphan a rappelé que tout était une question d'animation et de philosophie de jeu. Il devra faire ce soir sans Jeanuël Belocian, suspendu, alors que Warmed Omari effectue, lui, son retour. En cas de succès, le Stade Rennais sera assuré de terminer a minima à la deuxième place du groupe.","pubDate":"2023-11-30 06:30:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/julien-stephan-p-lahalle-l-equipe/1500000001875708/0:0,1997:1331-665-335-70/b6e2e.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"1f68e04d7496380d72d20c91317c0ca2","title":"Ботев Враца си връща защитник","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/botev-vraca-si-vryshta-zashtitnik-765843","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Ботев Враца обмисля да си върне левия бек Том Рапнуи. Французинът премина в ЦСКА 1948, но така и не можа да се наложи и основно е използван от дубъла. Врачани ще търсят подсилване именно в крайните защитници. Както е известно, Момичл Цветанов изненадващо си тръгна от стадион „Христо Ботев“ и не се знае дали ще се върне. Рапнуи нямал нищо против да облече екипа на врачани. 22-годишният французин не попада в плановете на столичани, които са готови да го върнат във Враца.","pubDate":"2023-11-30 06:21:00","image_url":"https://m3.netinfo.bg/media/images/50514/50514231/960-600-tom-rapnui.jpg","source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"2d1007bcee03989a0630e95708a80bec","title":"Brighton's Fati, Lamptey out for 'long time', says De Zebri","link":"https://www.straitstimes.com/sport/football/brightons-fati-lamptey-out-for-long-time-says-de-zebri","keywords":null,"creator":["The Straits Times"],"video_url":null,"description":"November 30, 2023 2:16 PMBrighton & Hove Albion forward Ansu Fati and defender Tariq Lamptey will both be sidelined for a significant period after picking up injuries at the weekend, manager Roberto De Zerbi said.","content":"Brighton & Hove Albion forward Ansu Fati and defender Tariq Lamptey will both be sidelined for a significant period after picking up injuries at the weekend, manager Roberto De Zerbi said. Lamptey and Barcelona loanee Fati went down injured in the first half of Brighton's 3-2 victory at Nottingham Forest on Saturday, when they ended their six-game winless run in the Premier League. Brighton, who face AEK Athens in the Europa League later on Thursday, have been struggling with a number of key players out of action, including Kaoru Mitoma, Danny Welbeck, Solly March and Julio Enciso. \"Ansu and Lamptey are both injured,\" Italian De Zebri told reporters on Wednesday. \"We have lost them for a long time, I think.\" Brighton are second in Group B on seven points from four games, a point behind Marseille. They lost to AEK in their campaign opener but have the chance to make up for that defeat in Athens. The lengthy injury list makes their task harder but De Zebri said they had to focus on the players who are fit. \"We will have to compete,\" he added. \"I don't know if we will win, but we will fight to win the game for sure.\" REUTERS","pubDate":"2023-11-30 06:16:22","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"e9f499cc94730fd82408ab2ff028ab67","title":"Лудогорец гостува на Спартак Търнава в търсене на нова победа в ЛК","link":"https://gong.bg/bg-football/evrouchastnici/multimedia/video/ludogorec-gostuva-na-spartak-tyrnava-v-tyrsene-na-nova-pobeda-v-lk-765840","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Отборът на Лудогорец гостува на Спартак Търнава в мач от груповата фаза в Лигата на конференциите. Двубоят стартира в 22:00 часа българско време и ще бъде предаван пряко по MAX Sport 3. Разградчани влизат в мача след изненадваща загуба у дома срещу Славия (2:3) в последния кръг на efbet Лига. Това бе и първа загуба за българския шампион в първенството ни след завръщането на Георги Дерменджиев. В първия мач между Лудогорец и Спартак Търнава \"орлите\" записаха категоричен успех с 4:0 в Разград. Победата бе изкована през втората част, когато паднаха и четирите гола във вратата на словаците, а с основна заслуга тогава бе Якуб Пьотровски, който реализира две от попаденията. Ситуацията в Група H е заплетена като Фенербахче води с 9 точки, а Нордселанд е втори със 7 пункта. Лудогорец пък е с точка зад датчаните, които днес приемат Фенербахче. Именно затова за разградчани е много важно да победят Търнава и да се надяват на благоприятен развой в другата среща, с който да се озоват в позициите, даващи право на участие в следващата фаза на Лига на конференциите. Спартак Търнава обаче влиза в днешния сблъсък след пет поредни успеха в първенството на Словакия и равенство в Дания с Нордселанд. Андрей Джурич няма да е на разположение за тима, както и Азис Осени, а пък Ян Бернат ще виси до последно. За гостуването в Търнава Дерменджиев има сериозни кадрови проблеми. Националът Спас Делев отпадна в последния момент заради настинка. Халфът Иван Йорданов също не попадна в групата за Словакия. 23-годишният национал се възстановява след операция на херния. Аут от сметките на Дерменджиев е и Марсел Хайстер. Трайно контузен пък е Диниш Алмейда.","pubDate":"2023-11-30 06:11:00","image_url":"https://m4.netinfo.bg/media/images/50600/50600022/960-600-ludogorec-vs-spartak-tyrnava.jpg","source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"4f7d1c2a8d5931e9cb1c6b9d0f849671","title":"Wanyama hopes to steer Kenya’s 3×3 team into first ever Olympics","link":"https://www.capitalfm.co.ke/sports/2023/11/30/wanyama-hopes-to-steer-kenyas-3x3-team-into-first-ever-olympics/?utm_source=rss&utm_medium=rss&utm_campaign=wanyama-hopes-to-steer-kenyas-3x3-team-into-first-ever-olympics","keywords":["Basketball","Sports","featured"],"creator":["Timothy Olobulu"],"video_url":null,"description":"NAIROBI, Kenya, Nov 30 – Lithuania-based Mercy Wanyama has made the final Kenyan team for the 3×3 Africa Cup which starts in Egypt on Friday, and the forward has voiwed to use her European experience to help the team clinch a qualifier slot. Wanyama, who has recently joined Lithuanian league side BC Siauliai believes they […] The post Wanyama hopes to steer Kenya’s 3×3 team into first ever Olympics appeared first on Capital Sports.","content":"Wanyama, who has recently joined Lithuanian league side BC Siauliai believes they have a strong team and can easily battle to clinch the Africa Cup and book a direct ticket to the Universality One, which gives them a chance to qualify for the Olympic Games. The younger sister to football royalty Victor Wanyama and MacDonald Mariga will be playing the 3×3 for the first time, but says she is ready. “It feels great to join up with the team. It is my first time on the 3×3 but I understand the game. We will do our best as a team,” Wanyama said. She adds; Every player wants to represent their country at the Olympics and for us it is not different. We want to go there and give our best to be in Paris. This is very big for us because Kenya has never qualified for the Olympics in basketball and we want to make history for the 50million+ Kenyans.” Wanyama has spent the last six years in Europe and played in Spain last season before making the switch to Lithuania, where she has already curved her niche and is a dependable player for her club. She hopes her experience can help the team in Egypt. “I have really grown. I am not the same Mercy I was five years ago. I am bringing what I have learnt on that side and with the talented players we have from the local league, I believe we will do great things,” she notes. The team will be skippered by KPA’s Natalie Akinyi, and will also include teammate Hilda Indasi and Zetech University’s Madina Okot. Captain Natalie says the team is ready to battle out and win the Africa Cup, which gives them a direct ticket to the Olympic qualifiers. “We have a very good team compared to last year and we want to go to the Olympics. Each one of us wants to be called an Olympian so we are ready to give our all in Egypt. Playing at the Olympics is a good platform to showcase our talents and our target is to give it a very good shot,” said the KPA point guard. The team will be coached by Evelyn Kedogo, who says they have trained really well and are looking to go all out and clinch the title. “The training has been really good and we had a Strength and Conditioning coach for the first time and this has really helped us to build our physicality. I believe we are ready as a team and we have what it takes to win,” noted the coach. The Kenyan women team is currently ranked fourth in Africa. They will clash with Nigeria, Mali, Madagascar and Benin in their group. Winning all matches will earn them a direct slot in the semi-finals.","pubDate":"2023-11-30 06:07:37","image_url":"https://www.capitalfm.co.ke/sports/files/2023/11/IMG_5979-1024x665.jpg","source_id":"capitalfm","source_priority":143748,"country":["kenya"],"category":["sports"],"language":"english"},{"article_id":"de464f1a09ae2413eebb9940ba79d09b","title":"Programme TV foot : à quelle heure et sur quelle chaîne voir les matchs de ce soir (30 novembre 2023) ?","link":"https://www.lequipe.fr/Football/Actualites/Programme-tv-foot-a-quelle-heure-et-sur-quelle-chaine-voir-les-matchs-de-ce-soir-30-novembre-2023/1434233#xtor=RSS-1","keywords":["Foot"],"creator":["Base de données"],"video_url":null,"description":"Retrouvez l'intégralité des retransmissions des matches de football du jour retransmis sur toutes les chaînes du bouquet TNT, Câble et Satellite. Ligue 1, Ligue 2, Premier League, coupes d'Europe... Suivez tous les matches en direct sur votre télévision ou en streaming.","content":"Retrouvez l'intégralité du . - Multizone : à 18h45 en direct sur RMC Sport Live 4 - Multizone : à 21 heures en direct sur RMC Sport Live 4 - Sturm Graz - Rakow Czestochowa : à 18h45 en direct sur RMC Sport Live 10 - AEK Athènes - Brighton : à 18h45 en direct sur RMC Sport Live 5 - Atalanta Bergame - Sporting Portugal : à 18h45 en direct sur RMC Sport Live 6 - TSC Backa Topola - West Ham : à 18h45 en direct sur RMC Sport Live 7 - Sparta Prague - Betis Séville : à 18h45 en direct sur RMC Sport Live 8 - Fribourg - Olympiakos : à 18h45 en direct sur RMC Sport Live 9 - Maccabi Haïfa - Rennes : à 18h45 en direct sur RMC Sport UHD et RMC Sport 1 - Marseille - Ajax Amsterdam : à 21 heures en clair et en direct sur M6 et Canal+ Foot - Molde FK - Karabagh FC : à 21 heures en direct sur RMC Sport Live 10 - Liverpool - Linz ASK : à 21 heures en direct sur RMC Sport Live 3 - Villarreal - Panathinaïkos : à 21 heures en direct sur RMC Sport Live 5 - Servette Genève - AS Rome : à 21 heures en direct sur RMC Sport Live 6 - BK Häcken - Bayer Leverkusen : à 21 heures en direct sur RMC Sport Live 7 - Glasgow Rangers - Aris Limassol : à 21 heures en direct sur RMC Sport Live 8 - Sheriff Tiraspol - Slavia Prague : à 21 heures en direct sur RMC Sport Live 9 - Toulouse - Union Saint-Gilloise : à 21 heures en direct sur RMC Sport UHD et RMC Sport 1 - FC Astana - Dinamo Zagreb : à 16h30 en direct sur RMC Sport Live 3 - Besiktas - Club Bruges : à 18h45 en direct sur RMC Sport Live 11 - KI Klaksvik - Slovan Bratislava : à 18h45 en direct sur RMC Sport Live 12 - Bodo/Glimt - FC Lugano : à 18h45 en direct sur RMC Sport Live 14 - La Gantoise - Zorya Lougansk : à 18h45 en direct sur RMC Sport Live 15 - HJK Helsinki - Aberdeen : à 18h45 en direct sur RMC Sport Live 16 - KF Ballkani - Viktoria Plzen : à 18h45 en direct sur RMC Sport Live 17 - Olimpija Ljubljana - Lille : à 18h45 en direct sur RMC Sport Live 3 - Eintracht Francfort - PAOK Salonique : à 21 heures en direct sur RMC Sport Live 11 - Fiorentina - Racing Genk : à 21 heures en direct sur RMC Sport Live 12 - FC Nordsjälland - Fenerbahçe : à 21 heures en direct sur RMC Sport Live 13 - Cukaricki Belgrade - Ferencvaros : à 21 heures en direct sur RMC Sport Live 14 - Spartak Trnava - Ludogorets Razgrad : à 21 heures en direct sur RMC Sport Live 15 - AZ Alkmaar - Zrinjski Mostar : à 18h45 en direct sur RMC Sport Live 13 - Breidablik - Maccabi Tel-Aviv : à 14 heures en direct sur RMC Sport Live 3 - Abha Club - Al-Ahli FC : à 16 heures en direct sur Canal+ Foot","pubDate":"2023-11-30 06:00:44","image_url":"https://medias.lequipe.fr/img-photo-jpg/-/1500000001560312/4:0,2500:1664-665-335-70/77bc2.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"b7172f44de3d796f88e8fb2a9a741ea3","title":"Ranked! The 10 best Barcelona sides ever","link":"https://www.fourfourtwo.com/features/ranked-the-10-best-barcelona-sides-ever","keywords":["Lists"],"creator":["mark.j.white@futurenet.com (Mark White)"],"video_url":null,"description":"Delving into the depths of the best Barcelona sides ever – from Rivaldo to Ronaldinho, Maradona to Messi","content":"In 2011, Pep Guardiola won his second Champions League title as Barcelona manager with arguably the greatest performance his side had ever delivered - and what a stage to do it. It was a display that had everything you’d associate with Barcelona. Control, dominance and attacking intent throughout as Barca toyed with like a cat with a ball of string. Yet when asked whether this side had surpassed the ‘Dream Team’ that Guardiola himself had been a part of under Johan Cruyff, Pep was coy to answer. Instead, he said that this side would never have been possible with Cruyff’s team. The way that Guardiola saw it, his philosophy was merely a continuation of his mentor’s and that the way - the correct way to play - was the most important thing. Well, we’re going to pose the questions that Pep himself wouldn’t answer. Which team was the best? There are plenty to choose from… In an El Classico tie in 1983, Diego Maradona rounded the goalkeeper and was about to score, before a flying tackle came in from Juan Jose. Maradona stood still, waiting for the defender to smack into the post, slotting the ball into the empty net. The Argentine was the first Barcelona player to be given a standing ovation by a Bernabeu audience. He was an undisputed world-beater and would have won more in Spain, perhaps, had it not been for bad luck and ill-discipline. He suffered hepatitis, before a broken ankle - caused by Andoni “the Butcher of Bilbao” Goikoetxea - though sometimes he was to blame for trouble. At one point, Diego trashed the Camp Nou trophy room because he wasn’t allowed his passport - while his Barca career ended with him in the centre of a mass brawl, kicking and punching anyone in an shirt, after an on-pitch argument broke out into a shocking fight. Long before Barca execs were trying to offload Maradona to for his nonsense though, Maradona was the jewel of the side under legendary managers Udo Lattek - who managed in their glory years - and Cesar Luis Menotti - who won the World Cup with Argentina in 1978. Bernd Schuster was in that side too - a future star. It was a pleasure to watch the Argentine at the time, given free roam in front of a solid defence and hard-working midfield, often partnering Lobo Carrasco up top for the Blaugrana. It was a great side but not one that won a league trophy. Long before Barcelona became wedded to the beautiful Cruyffian ideals that would come to define the club, another kind of philosopher was at the reigns of the club. Helenio Herrera won La Liga in 1950 and 1951 with and arrived in Catalonia as the king of “catenaccio”, a style of play that relied on a sweeper-type defender to act as a door lock and keep the defence tight. Herrera is often likened to Jose Mourinho for his larger-than-life persona and tactics which history has chalked up as dour compared to more “progressive” managers - but that’s not to say that Barca didn’t still play fluid, attacking football at times that later presidents would have been proud of. Hungarian Laszlo Kubala and 1960 Ballon d’Or winner Luis Suarez were the two stars of the side, which won La Liga in 1958/59 and 1959/60. Herrera left the club in 1960 after clashing with Kubala one too many times, taking charge of the Spanish national side before going to and winning two European Cups with his talisman Suarez. Barca were the first side to ever knock Real Madrid out of the European Cup, too, during Herrera’s time at the club - it’s a case of maybe what could have been for this phenomenally talented side, despite the domestic dominance. Maybe that first wait for a European title could have come sooner. Imagine having Bobby Robson on your bench, Jose Mourinho as his translator and Pep Guardiola as your captain. You should be fine for leadership, right? Now imagine you’ve got Ronaldo up front, too. But this was a tough time in Catalonia. Johan Cruyff, the club’s modern founding father, had just left - Robson stepped up though, winning the UEFA Cup Winners' Cup, the Copa Del Rey and finishing second in La Liga. “He arrived as if he was in Barcelona for the last 20 years,” former president Joan Gaspart beamed of the once England boss. Robson’s side were tactically flexible, extremely intelligent and had talent in spades. Of course, Ronaldo’s stellar season leading the line was the big talking point of the campaign - he hit an incredible 47 goals in all competitions - but the likes of Luis Figo and Hristo Stoichov were still reliable forces, too. Both Ronaldo and Robson were at their peak of their powers, here. This was to be a one-season wonder for both, though - Louis van Gaal replaced Sir Bobby, while R9 went to Inter. The memories of that campaign - one in which expectations were sharply adjusted before it began - are still sweet, to this day. The foundations for the ‘Dream Team’ of 1992 had its foundations laid decades before. Johan Cruyff joining the club as a player in 1973 was a clear catalyst but even before that, Barca geared up for a possession-based style by hiring Vic Buckingham in 1969 - a pioneer push-and-run style before he went to to work on total football - before replacing Buckingham with Rinus Michels in 1971. Michels had overseen the dominant, multiple Eredivisie-winning Ajax sides of the 1960s and lifted the European Cup in 1971. This was a piece of what Barcelona wanted and so they tempted the Dutchman to the Camp Nou to work his magic. A year later he brought Cruyff - for a record transfer fee - and the jigsaw was complete. Cruyff turned down Real Madrid - saying he could never join a club “associated with Franco” - and won La Liga in his first season, beating Real 5-0 on their own patch. Michels weaved his total football masterplan to devastating effect that night, with Cruyff spraying passes from deep for the likes of Carles Rexach and Juan Carlos to run onto, exhausting the opposition defence. Cruyff picked up the European footballer of the Year awards in 1973 and 1974. Few would successfully mark him until Franz Beckenbauer managed to get one over the Dutchman at the World Cup final of 1974. A European Cup never came but Cruyff excelled in Catalonia as a player. “[My] philosophy does not correspond with the culture of the country.” Louis van Gaal said when he left Barcelona in the new millenium. As a player, he was a substitute to Cruyff at Ajax; he rebuilt Ajax as a manager after Cruyff left and was the natural successor to him at Barcelona - he loved possession and relied on the academy at his fingertips. So surely his philosophy should’ve corresponded? Cruyff disagreed - he was said to despise van Gaal’s less enthralling style of play and Bobby Robson even said that he felt he was brought in for one season specifically as a buffer between Cruyff and van Gaal. When he arrived though, van Gaal brought a raft of fellow countrymen, such as Kluivert, the De Boer brothers, Boudewijn Zenden and Ruud Hesp, rebuilding the side in his image. The Dutchman came in just as Ronaldo was packing for Inter and had to implement a rigorous system to compensate - just as he did when Dennis Bergkamp left for I Nerazzurri while he was at Ajax. For sheer talent though, van Gaal's was still one of the greatest Barca sides ever. Van Gaal won two La Ligas in Spain so the decision to hire him was somewhat vindicated, at least. After an unconvincing double in his first season - if there is such a thing - Barca began controlling games far more a season later, relying on incredible flair from Ballon d’Or-winning Rivaldo. They did exit the Champions League in the group stage two seasons in a row - quite the blemish - but it was a hell of a squad while it lasted. When cracks began to show in 2000, Louis left to manage the Netherlands’ ill-fated 2002 World Cup qualification campaign. At least there, no one could complain that he picked too many Dutchmen. “What has Barcelona won in 100 years? How many Champions Leagues?” van Gaal questioned in his post-exit interview. “In six years at Ajax I won more than Barcelona had won in 100 years.” Unbelievable, really, that he had a second spell after that comment. There were some who were concerned with the idea of Frank Rijkaard managing a club of Barcelona’s stature. He was, to say the least, a volatile character - but the temper he displayed as a player melted away as he became a figure of calm in the dugout. Rijkaard ended a trophy drought of six years, making big-name signings in his first season in charge in the form Samuel Eto’o and Deco. The team revolved around the talents of Ronaldinho, as Rijkaard oversaw an exodus of older stars - Dutch trio Philip Cocu, Patrick Kluivert and Michael Reiziger all saw their contracts terminated, while Luis Enrique and Marc Overmars retired. The result was instant. Barcelona won the league playing football with flair, thanks to their exciting attack. A season later, they made very little change but drafted in youth product Lionel Messi a little more - whatever happened to that fella? - producing the first iconic front three that the little genius was a part of, alongside Ronaldinho and Eto’o. In 2006, Barcelona retained the league title again ahead of Real Madrid before breaking hearts in Paris to lift their second Champions League title. Frank Rijkaard had a short spell at but has largely left the picture as far as management is concerned - he’s the second-longest serving Barca boss since Cruyff, either way. By 2015, Barcelona hadn’t won a Champions League title since Pep Guardiola’s last one in 2011 - astonishing, really, considering the calibre of their players and the contingency plan that Pep himself put in place. But the semi-finals of the competition would pair up one club legend with another, as Pep’s new side, , took on Luis Enrique’s Barca. Guardiola’s Camp Nou return was a sour one, with his team tied in knots by trident. Having Messi, Suarez and Neymar in your team was enough for anyone - they netted an unprecedented 122 goals in all competitions that campaign and beyond that this team didn’t need much more coaching to overcome Pep’s evolving ideals. Players like Pique, Rakitic, Iniesta, Busquets and Alves coached themselves by now. Messi famously folded Jerome Boateng inside out before chipping Manuel Neuer with his right foot. It summed up the season - even against world-class opposition, just a moment of genius was enough. This was proof, too, that there was life without Pep Guardiola. - take note. Barcelona won the treble, obliterating all before them with arguably the most potent attack of all time. It’s not the prettiest side they ever built but it’s probably the most ferocious. It was said that in British music in the 1990s, everyone was influenced by Oasis whether they wanted to be or not - you either kicked against them or embraced them. Well, Cruyff was the parallel in European football at the time. Camp Nou attendances were at 40,000 spectators just a decade prior. Barcelona weren’t winning trophies around this time, of course, but they weren’t winning plaudits either: Terry Venables and Luis Aragones had both deployed pragmatic tactics and the Cules were growing tired of their team. Enter Johan Cruyff. A Cup Winners’ Cup winner with Ajax, Catalonia’s favourite adopted son brought in his 4-3-3/3-4-3 hybrid, drawing from the La Masia academy and teaching Barcelona a new way to play. He moved Guardiola from the wing to become the tempo-setter in midfield, while Ronald Koeman would step out from being a centre-back to start play at the base of midfield. Barcelona had won two La Liga titles in a 30-year stretch before Cruyff arrived. Under the Dutchman’s free-flowing philosophy, they lifted four in a row and completed their first European Cup triumph in 1992 - thanks to a rocket from the gallivanting Koeman. He didn’t just put together a successful team, he created a style of play, celebrated the world over, that would become ingrained into the DNA of a club. He’s arguably the most influential man in the game ever - and this was his managerial masterpiece. It’s sometimes levelled at Pep Guardiola that he never gives himself a challenge - he always manages the big guns. People forget though that when he took over Barcelona, they hadn’t won anything for two seasons - they were a shadow of their former Rijkaard-led side and in one of his first missions at the club, he went to war with his bosses. Lionel Messi wanted to represent Argentina at the 2008 Beijing Olympics, something Barcelona weren’t keen on him risking himself for. Pep argued his case, stating what a strong learning opportunity it was for him as a player, winning gold in Barcelona in 1992. Pep won the battle, Messi followed in his mentor’s footsteps and brought home gold. It was the first real sign of this young player showing he was a winner - Guardiola had such faith in him that he sold Ronaldinho and Deco to clear space for Messi to play. It was a bold move at the time and it could have backfired so easily - yet it proved to be a masterstroke. The early faith in Messi paid dividends, as Samuel Eto’o and Thierry Henry combined with the little genius to devastating effect. Xavi and Andres Iniesta become generals of Pep’s philosophy - the same positional play that he’d been educated in - as Barcelona swept to a magnificent treble. It showed a glimpse of what this incredible young manager - and his unbelievable protege - could deliver. Guardiola became the youngest manager of all time to ever win the Champions League in 2009. Plenty happened between Pep Guardiola’s two Champions League titles. Eto’o was swapped for Zlatan Ibrahimovic - disastrously - as Zlatan left 12 months later, spitting feathers at Pep, while Eto’o lifted a consecutive treble with Jose Mourinho’s Inter Milan. Mourinho, still angry at not getting Guardiola’s job in 2008, made sure to make a beast of himself when he knocked his adversary out of the Champions League semi-final. Henry, Marquez, Toure, Hleb, Gudjohnsen and Sylvinho were out - David Villa now led the line, Pedro had burst through the academy, Sergio Busquets was the No.6 and Javier Mascherano was Gerard Pique’s pitbull alongside him. Pep’s first Barcelona team was good - but this really felt like his own side, moulded in his image. By now, Lionel Messi had reached god level, netting 53 times in 55 games of this campaign. This was the season that perhaps Pep Guardiola still has to match up to. The football was absolutely exquisite. The team was otherworldly. They won 16 La Liga matches in a row, including the Clasico 5-0 and then dismantled Sir Alex Ferguson’s Manchester United in the Champions League final at Wembley. There has perhaps never been a team this good in world football. A beaten Ferguson admitted that Messi was the finest player he’d ever seen. Football perfection is something that Barca have been searching for, throughout their history. They’ve come so very near so very many times - but this is definitely their best case for it.","pubDate":"2023-11-30 06:00:32","image_url":"https://cdn.mos.cms.futurecdn.net/3QjZvJz8cPT8phSVBb3gNn.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"87f50bf23dbcd2367fc8b312b6192e35","title":"Kickoff | Sundowns star not giving up on Bafana future","link":"https://www.snl24.com/kickoff/sanews/premiership/mamelodi-sundowns/sundowns-star-not-giving-up-on-bafana-future-20231129","keywords":null,"creator":null,"video_url":null,"description":"Defender Terrence Mashego is refusing to throw in the towel in the possibly of making the Bafana Bafana that will play in the Afcon set to kick-off in January 2024.","content":"Mashego joined The Brazilians ahead of the 23/24 season but has struggled to cement a starting position due to injuries and competition and by since the making the switch from Cape Town City. The 25-year-old has made 10 appearances across all competitions for Sundowns, starting just two and has been riddled by injuries. | The lack of playing time has also cost Mashego a spot in recent Bafana squad, with his last call-up coming in September last year – where he had to withdraw due to injury. However, speaking at the Tswhane derby press conference, Mashego revealed that he has not closed the door on Bafana. \"I still have a chance (to make it to the Afcon squad), Mashego said. \"There is about ten games remaining before the finals (AFCON)are played. and I would say, there is still a chance and there are no regrets,\" the left-back explained Mashego. \"It’s a conversation that I had with my dad that I don’t want to retire as a player, who just played football. \"I said, I want to win titles. I want to look back one day and say, you know what, I achieved this and that. That’s why I joined Sundowns, to compete and win. | Bafana’s last three matches saw right back Nyiko Mobbie replaced by Sundowns’ Khuliso Mudau. \"That’s why I say there is a bit of a chance,\" added Mashego. \"As you saw, there is a bit of a rotation (at Bafana) and also I managed get my first 90 minutes this season. I’m looking to build on that and maybe I will get more game time hence there is still a chance.\"","pubDate":"2023-11-30 06:00:20","image_url":"https://cdn.24.co.za/files/Cms/General/d/10004/73bddb5b3fea4a03a20b367b2afe27c3.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"}]}