{"newsArray":[{"article_id":"6d456d8d0b6b764077c6b43e2fae1ab0","title":"Αστέρας Τρίπολης: Εκτός οι Τζουκάνοβιτς, Γκος","link":"https://www.gazzetta.gr/football/kypello-elladas/2281159/asteras-tripolis-ektos-oi-tzoykanobits-gkos","keywords":["Ποδόσφαιρο","Κύπελλο Ελλάδας","Αστέρας Τρίπολης","Newsroom"],"creator":null,"video_url":null,"description":"Ο Αστέρας Τρίπολης ολοκλήρωσε την προετοιμασία του για το αυριανό παιχνίδι Κυπέλλου με τον Πανσερραϊκό, όπου δεν υπολογίζονται οι Τζουκάνοβιτς και Γκος.","content":"Χωρίς απρόοπτα ολοκλήρωσε ο Αστέρας Τρίπολης την προετοιμασία του για το αυριανό (5/12) ματς Κυπέλλου με τον Πανσερραϊκό , που θα είναι το πρώτο του ζευγαριού για τη φάση των «16». Ο Μίλαν Ράσταβατς άφησε εκτός αποστολής τους Τζουκάνοβιτς και Γκος, όμως επιστρέφουν οι Χουχούμης, Γκρόζντανιτς, Ντιαρά, Κωστέας. Αυτή αποτελείται από τους εξής: Παπαδόπουλος, Σγουρής, Γραμματικάκης, Γκαρθία, Χουχούμης, Καρμόνα, Πίτσου, Καστάνιο, Αλβαρες, Γκρόζντανιτς, Βαλιέντε, Μπαρτόλο, Μουνάφο, Σουρλής, Ντιαρά, Σίτο, Αλάγκμπε, Ζουγλής, Μιριτέλο, Κρέσπι, Μάντζης, Καλτσάς, Κωστέας.","pubDate":"2023-12-04 19:34:17","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"7c65c968b52c4e2d63f1c9654d12d237","title":"Montse Tomé y Aitana Bonmatí: una bronca en el vestuario, un cambio a destiempo y una llamada pública de atención","link":"https://elpais.com/deportes/futbol/2023-12-04/montse-tome-y-aitana-bonmati-una-bronca-en-el-vestuario-un-cambio-a-destiempo-y-una-llamada-publica-de-atencion.html","keywords":["Fútbol","Futbolistas","Entrenadores","Competiciones","Deportes","Selección española","Selección española fútbol","Bonmatí","Montse Tomé","Jennifer Hermoso"],"creator":["Nadia Tronchoni"],"video_url":null,"description":"La seleccionadora refuerza su autoridad en el vestuario de España y tras perder ante Italia: “Equipo somos todos, todos tenemos que sumar”","content":"Aitana Bonmatí volvió a entrenarse ayer. No sufría ninguna lesión ni dolencia grave. Pero se ausentó del último entrenamiento con el equipo nacional por un resfriado. Tampoco se sintió bien, así lo explicó ella misma, tras jugar el primer tiempo contra Italia el viernes. Y pidió el cambio. Lo pidió tan tarde que al staff de España le costó reaccionar; aquello provocó que también se avisara tarde a la delantera Esther González, que ni siquiera había calentado, de que tenía que saltar al campo y en esos minutos en que la selección jugó en inferioridad numérica, el rival marcó: 1-1. Y el vía crucis del encuentro no había hecho más que comenzar. El partido terminó 2-3. La Roja contaba su primera derrota en los partidos de clasificación para la Nations League. Aunque, pese a todo, la derrota de Suecia les permitió irse a dormir con su billete para la final four del próximo febrero en el bolsillo. En todo este embrollo, cuyo culebrón se ha alargado hasta la previa del último partido de la liguilla, este martes (España se mide a Suecia, a las 19.00; La 1), no explicó la Balón de Oro que instantes antes de pedir al cuerpo técnico ser sustituida y no disputar la segunda parte se había enzarzado en una discusión con la seleccionadora Montse Tomé, que supuestamente le habría pedido más intensidad a la futbolista. La reacción de Aitana estuvo fuera de lugar. “Se pasó de frenada”, confiesan fuentes cercanas al vestuario. “Ella es vehemente, super competitiva”, explican en Las Rozas. Y en las declaraciones posteriores al partido, la entrenadora, que lleva exactamente tres meses en el cargo y sustituye al destituido Jorge Vilda, no tuvo inconveniente en señalar a Bonmatí: “Empezamos con 10 porque Aitana avisa tarde de que no está disponible”. La jugadora, por su parte, asume que avisa tarde, pero no se encontraba bien y prefirió que otra jugadora entrara en su lugar. “Las sensaciones no eran muy buenas, llevaba unos días con malestar, resfriada, mucha mucosidad. El descanso a menudo sirve para reposar esas sensaciones y ver cómo te sientes”, explica su entorno. Y el desenlace del partido acaba animando la crisis. Bonmatí, señalada como la mejor jugadora de España en el Mundial, la mejor futbolista del 2023 según France Football , siente que hubo un problema y que ahora se busca un culpable. “En un equipo hay intercambio de opiniones. Y a menudo se hace una montaña de situaciones muy cotidianas en el día a día de un vestuario. Cierto que, del mensaje de la seleccionadora, se entiende que la culpabiliza”, indican fuentes cercanas. Que España jugara con diez durante los tres minutos en que encajó el gol del empate y perdió el control del partido no puede ser culpa de una jugadora. “Que en la Federación no se trabaje con tranquilidad tampoco ayuda a buscar la excelencia”, apuntan fuentes del vestuario. Dos voces diferentes de la selección asumen que en el equipo femenino se trabaja con miedo después de la crisis que devino tras el beso del ya expresidente Luis Rubiales a la delantera Jenni Hermoso —quien, por cierto, ha recuperado sus galones como cuarta capitana del equipo—: “Todo el mundo quiere que nos salgan mal las cosas”, admiten desde Las Rozas. En ese camino —hacia la profesionalidad y la naturalidad— en que el equipo está inmerso desde agosto, la seleccionadora Tomé trata, con declaraciones públicas como las del viernes, de ganarse la autoridad y el respeto del vestuario. “Desde que comenzamos en septiembre el camino no ha sido fácil. Pero hemos conseguido imponernos con profesionalidad, trabajo, humildad. Me gusta mucho esta palabra. Me gusta que todos y todas podamos serlo. Estamos en una línea positiva. No nos gusta perder y hay cosas que tenemos que ajustar, pero estamos en el camino”, declaró en la conferencia de prensa de ayer. No está claro si las formas en que lo intentó tras el partido del viernes, de las que no quiso desdecirse ayer, son las más convincentes, pero la mayoría de fuentes consultadas coinciden en que ese episodio no le pasará factura. “Montse lleva cuatro días y a veces le falta capacidad comunicativa. También picardía o ese recurrir a la picaresca para evitar que empiece el segundo tiempo con una jugadora menos. Hay muchas maneras de evitar no salir con diez”. Con polémica incluida, ni Tomé, ni Laia Aleixandri, que atendió a los medios en La Rosaleda, de Málaga, donde se espera hoy una muy buena entrada, perdieron el foco de lo que les importa: “El vestuario es lo importante, el equipo, y todo lo que ocurre dentro es bueno que lo cuidemos, que lo protejamos y que sea nuestro. Nosotros somos super exigentes y super profesionales, queremos lo mejor para todos. Ya estamos pensando en Suecia. Nuestra mente debe estar solo en eso; equipo somos todos y todos tenemos que sumar”, apuntaba Tomé. “Debemos pensar en el partido. Estamos con una ambición tremenda. Siendo una selección campeona debemos tener exigencia máxima. Lo que sucedió no puede volver a suceder”, añadía Aleixandri. Puedes seguir a EL PAÍS Deportes en Facebook y X , o apuntarte aquí para recibir nuestra newsletter semanal . Redactora jefa de la sección de Deportes y experta en motociclismo. Ha estado en cinco Rally Dakar y le apasionan el fútbol y la política. Se inició en la radio y empezó a escribir en el diario La Razón. Es Licenciada en Periodismo por la Universidad de Valencia, Máster en Fútbol en la UV y Executive Master en Marketing Digital por el IEBS.","pubDate":"2023-12-04 19:34:02","image_url":"https://imagenes.elpais.com/resizer/FvYWVVsNOfs-49cY9-xl-zvZlys=/arc-anglerfish-eu-central-1-prod-prisa/public/NV53ATMUJJANVEJNZNSNXKDFI4.jpg","source_id":"elpais","source_priority":2530,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"a741dda2e9567d6ef3ce45223d13a9df","title":"Λουτσέσκου: «Αν βρούμε παίκτες ικανούς να αναβαθμίσουν το ρόστερ μας, θα τους πάρουμε»","link":"https://www.gazzetta.gr/football/superleague/2281158/loytseskoy-broyme-paiktes-ikanoys-na-anabathmisoyn-roster-mas-tha-toys","keywords":["Ποδόσφαιρο","Superleague","ΠΑΟΚ","Λαμία","Ραζβάν Λουτσέσκου","Newsroom"],"creator":null,"video_url":null,"description":"Την ικανοποίησή του για τη νίκη επί της Λαμίας και κυρίως την εμφάνιση, έμεινε ο Ραζβάν Λουτσέσκου με τον τεχνικό του ΠΑΟΚ να αναφέρει πως αν βρεθούν παίκτες ικανοί να κάνουν την διαφορά θα αποκτηθούν.","content":"Εξαιρετικά ενδιαφέρουσα ήταν ακόμα μία συνέντευξη Τύπου του Ραζβάν Λουτσέσκου . Ο Ρουμάνος τεχνικός μιλώντας μετά τη νίκη του ΠΑΟΚ επί της Λαμίας , αναφέρθηκε στο ματς, αλλά στα μεταγραφικά επισημαίνοντας πως αν βρεθούν ποδοσφαιριστές που θα μπορούν να κάνουν την διαφορά και να αναβαθμίσουν το υπάρχον ρόστερ, τότε θα αποκτηθούν. Αναλυτικά ο τεχνικός του ΠΑΟΚ ανέφερε τα εξής: Για την εικόνα της ομάδας του και το τι ήταν το πιο σημαντικό σε αυτό το ματς: «Περίμενα να σκοράρουμε περισσότερα γκολ, είχαμε αρκετές ευκαιρίες και έπρεπε να τις εκμεταλλευτούμε. Όταν σου δίνονται αυτές οι ευκαιρίες πρέπει να τις κάνεις γκολ. Είχαμε απέναντι μας μια ομάδα που φέτος έχει παίξει πολύ καλά και έχει δημιουργήσει προβλήματα, εμείς προερχόμασταν από ένα δύσκολο και απαιτητικό ματς στην Φρανκφούρτη αλλά δείξαμε καλή νοοτροπία και είχαμε την σωστή ενέργεια στον αγωνιστικό χώρο. Πήραμε μια νίκη στη Γερμανία που θα μπορούσε να φέρει προβληματισμούς, αλλά ήταν μια πραγματικά πολύ καλή στάση από τους παίκτες σήμερα. Η νίκη μας σήμερα είναι απολύτως λογική γιατί ήμασταν καλύτεροι σε όλους τους τομείς». Για το γεγονός ότι τα σέντερ φορ του ΠΑΟΚ έχουν σκοράρει 10 γκολ από τα 51 συνολικά μέχρι στιγμής: «Θα σας πω ότι τα άλλα 41 γκολ τα έχουν βάλει παίκτες μας επίσης. Δεν έχει σημασία ποιος σκοράρει, ο στόχος είναι να μπει μέσα στο γήπεδο να παίξει καλά, να κερδίσει και να βάλει γκολ. Αν οι άλλοι έχουν βάλει 41 γκολ σημαίνει ότι έχουν κάνει καλή δουλειά και οι επιθετικοί επίσης. Γιατί τα γκολ προέρχονται και από ενέργειες των επιθετικών που δημιουργούν χώρους με τις κινήσεις τους. Έχουν συμμετοχή στα γκολ όλοι οι παίκτες και αυτό είναι το σημαντικό, γιατί οι επιθετικοί μας βοηθάνε φτιάχνοντας χώρους για τους άλλους. Είναι μια τεράστια δουλειά τόσο όταν έχουμε την μπάλα, όσο και όταν δεν την έχουμε, έχουν πολύ μεγάλη συνεισφορά οι επιθετικοί μας και δεν κρίνονται μόνο από τα γκολ τους». Για το τι είπε στον Κωνσταντέλια όταν τον έπιασε η κάμερα να γελάει και να του μιλάει: «Αφορούσε κάτι για τα επόμενα ματς. Αν ήταν κάτι άλλο θα σας το έλεγα». Για το αν θέλει να βελτιωθεί κάτι στην ομάδα σε μια περίοδο που φαίνονται να πηγαίνουν όλα καλά: «Έχει να κάνει με το θέμα το πνευματικό, το πώς θα πηγαίνουμε από το ένα ματς στο άλλο. Πρέπει να μείνουμε συγκεντρωμένοι. Μέσα σε 11 μέρες έχουμε τέσσερα παιχνίδια. Είχαμε αυτό το ματς με την Άιντραχτ, τώρα παίξαμε με την Λαμία, παιχνίδια που το καθένα τους σε κάνουν να ξοδεύεις πολύ πνευματική ενέργεια. Πρέπει να αντιμετωπίζουμε κάθε παιχνίδι ως τελικό, πρέπει να ξεχνάμε τα αποτελέσματα το επόμενο πρωί κιόλας. Πήραμε μεγάλη χαρά στην Φρανκφούρτη και έπρεπε να βρούμε ισορροπία. Και τώρα με την Λαμία πρέπει άμεσα να ξεχάσουμε τη νίκη και να αφοσιωθούμε στο ματς της Πέμπτης σε μια διοργάνωση που θέλουμε να φτάσουμε και πάλι στον τελικό. Η ομάδα βήμα βήμα γίνεται καλύτερη, πιο δυνατή γιατί μεγαλώνει ο βαθμός προσαρμογής των νέων παικτών. Όλη αυτή την περίοδο έχουμε δύσκολα παιχνίδια και η χημεία μας έχει βελτιωθεί πάρα πολύ. Με κάνει να έχω αυτοπεποίθηση όλο αυτό, με τις σχέσεις ανάμεσα στους παίκτες και το κλίμα που υπάρχει. Έχουμε πάρα πολλούς παίκτες που συμμετέχουν σε όλο αυτό που κάνουμε φέτος. Είχαμε οκτώ αλλαγές στην ενδεκάδα σε σχέση με το προηγούμενο και τα παιδιά ανταποκρίθηκαν πολύ καλά». Για τον Τάισον, για το αν μπορεί να γίνει παράδειγμα τους νέους παίκτες και το αν το περίμενε να έχει αυτή την εικόνα φέτος: «Πέρσι τον χειμώνα μου προτάθηκε από τον Γιώργο Σαββίδη αυτός ο παίκτης και είπα αμέσως ναι. Απάντησα ναι γιατί ξέρω τι παίκτης είναι, τι ποιότητα έχει και την θέληση που έχει για να παίζει. Τον γνωρίζω γιατί τον είχε παίκτη ο πατέρας μου, γνώριζα την αγάπη του για το άθλημα και για την προπόνηση. Στην Βραζιλία είχε έναν τραυματισμού και χρειαζόταν χρόνο, άρχισε να προσαρμόζεται και να δείχνει την τεράστια ποιότητα. Παίζει ένα απίστευτο ποδόσφαιρο. Όσο για το αν μπορεί να γίνει παράδειγμα, αυτός και ο Αντρέ είναι πάντα ανάμεσα στους νέους παίκτες και δεν ξέρω αν ο Τάισον και ο Αντρέ είναι αυτοί οι... νέοι ή αν είναι οι νέοι ο Κωνσταντέλιας και ο Κουλιεράκης. Καμιά φορά είναι και το ανάποδο! Έχουν ψυχή νέων παιδιών ο Τάισον και ο Αντρέ είναι πολύ σημαντικοί για το γκρουπ που έχουμε φτιάξει. Δεν ξέρω τι να σας πω για την ανανέωση του Ταισον. Παίζουμε ανά τρεις μέρες, κάθε μέρα έχουμε πολύ δουλειά. Ξυπνάω πέντε το πρωί για να αναλύσω τα παιχνίδια. Η διοίκηση γνωρίζει τι θέλω και τι πρέπει να κάνει και με το θέμα του Τάισον. Αν αρχίσουμε να χάνουμε την συγκέντρωση μας με διάφορα άλλα θέματα τότε θα χάσουμε αυτά που έχουμε καταφέρει μέχρι σήμερα. Πρέπει να προστατεύσω την δουλειά που κάνουμε. Ξέρω πάρα πολύ καλά πως αν παρεκκλίνεις είναι εύκολο να χάσεις τη συγκέντρωση. Καταλαβαίνω την ανάγκη των δημοσιογράφων για θέματα, αλλά πρέπει να μείνουμε σε αυτό και να είμαστε συγκεντρωμένοι στα παιχνίδια. Αν με ρωτάτε για το αν ο Τάισον πρέπει να είναι εδώ, τότε θα σας πω ότι ναι πρέπει να είναι. Ο Ταισον είναι ένας από τους καλύτερους παίκτες μας, ο αγαπημένος της εξέδρας, είναι χαρούμενος εδώ». Για την συζήτηση με τον Σαββίδη με τα μετεγγραφικά και τη δική του επιθυμία: «Είστε εσείς από το υπάρχον ρόστερ; Αν μπορεί να γίνει κάτι καλύτερο και μπορούμε να γίνουμε καλύτεροι, τότε θα είναι καλό για εμάς. Αν υπάρξει κάτι καλύτερο θα δούμε τι μπορεί να γίνει. Αυτό ισχύει για όλες τις ομάδες, αν έχουμε πιθανότητα να βρούμε ικανούς παίκτες για να κάνουν αναβάθμιση στο ρόστερ, τότε θα θέλαμε να το κάνουμε».","pubDate":"2023-12-04 19:31:03","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"07a794b4b81913c786349db2a383b2ad","title":"Jeffery Simmons is expected to miss multiple weeks with knee injury","link":"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jeffery-simmons-is-expected-to-miss-multiple-weeks-with-knee-injury","keywords":null,"creator":null,"video_url":null,"description":"Titans running back Derrick Henry avoided a concussion on Sunday, but a key member of the defense didn't enjoy the same luck on the injury front.","content":"Titans running back Derrick Henry avoided a concussion on Sunday, but a key member of the defense didn’t enjoy the same luck on the injury front. Defensive tackle Jeffery Simmons left their overtime loss to the Colts with a knee injury early in the second half and was ruled out a short time later. On Monday, head coach Mike Vrabel said at his press conference that Simmons is expected to miss a couple of weeks while he recovers. Simmons had two tackles before leaving Sunday’s game. He has 44 tackles, 5.5 sacks, a forced fumble, and a fumble recovery in 12 games this season. Denico Autry, Teair Tart, Kyle Peko, Jaleel Johnson, and TK McClendon Jr. are the other defensive linemen on the 53-man roster in Tennessee.","pubDate":"2023-12-04 19:23:53","image_url":null,"source_id":"profootballtalk","source_priority":267,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"2a678e2e70373951016ea690bcfed850","title":"Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness","link":"https://www.dailymail.co.uk/sport/football/article-12824321/Arsenal-Mikel-Arteta-title-injuries-Ben-White-Takehiro-Tomiyasu.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SAMI MOKBEL: The north London club's promising position comes despite suffering a clutch of injuries to key players throughout the early weeks of the season.","content":"Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness Arsenal travel to Luton on Tuesday night looking to extend their lead at the top The Gunners have suffered several injuries to key players already this season Man City are vulnerable, but come the spring they will put on the afterburners. Leaders Arsenal must seize their moment now - Listen to It's All Kicking Off By Sami Mokbel for MailOnline Published: 13:52 EST, 4 December 2023 | Updated: 14:20 EST, 4 December 2023 e-mail View comments Arsenal head coach Mikel Arteta is carefully managing his title chasing squad’s training workload to ensure their championship charge stays on track. The Gunners are top of the Premier League , two points clear of second placed Liverpool after 14 matches. The north London club’s promising position comes despite suffering a clutch of injuries to key players throughout the early weeks of the season. Most recently key defenders Takehiro Tomiyasu and Ben White have been struck by injury concerns and are among those whose workloads are being meticulously monitored to ensure their availability ahead of hectic run of matches. Arteta says he will make a late decision on Tomiyasu’s availability ahead of Tuesday’s clash at Luton after the Japan international limped off with a suspected calf issue against Wolves on Saturday. Tomiyasu has undergone a scan. Mikel Arteta is managing his squad’s training load to ensure their title charge stays on track Defender Takehiro Tomiyasu limped off with a suspected calf issue against Wolves on Saturday afternoon putting his participation in Tuesday's game at Kenilworth Road vs Luton in doubt Your browser does not support iframes. The Arsenal head coach also said on Monday that White, whose recent availability has been impacted due to what Arteta says is a ‘muscular’ problem, is feeling ‘perfect’ following his fitness concerns. Arsenal have a long list of injury problems, with Thomas Partey, Emile Smith Rowe, Fabio Vieira and Jurrien Timber all currently unavailable leaving the Gunners stretched. And Arteta and his staff are acutely aware of the importance of ensuring his players are kept fresh - particular for the use Christmas schedule. Mail Sport also understands that certain players are using private sessions away from the club’s London Colney HQ to ensure their bodies are at optimum capacity. Last season, injuries at crucial parts of the season contributed to Arsenal eventually being overtaken by Manchester City; William Saliba, Gabriel Jesus and Olekandr Zinchenko all missing important matches last season. And the Gunners are ensuring they implement a training strategy that protects players ahead of the business end of the season. ‘It's still a huge marathon ahead of us,’ said Arteta during his press conference ahead of the game at Kenilworth Road. ‘The encouragement comes from watching the team play, watching them behave every day and how hungry and willing they are to approach every training session. That's what gives me encouragement.’ Arteta revealed that defender Ben White is feeling 'perfect' following his fitness concerns IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Mikel Arteta Japan Ben White Share or comment on this article: Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-04 19:20:35","image_url":"https://i.dailymail.co.uk/1s/2023/12/04/18/78565655-0-image-a-6_1701715855113.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6fc6d6c8a994801cb34469d73af3a966","title":"Premier League : Mikel Arteta en admiration devant le club de Luton","link":"https://www.lefigaro.fr/sports/football/angleterre/premier-league-mikel-arteta-en-admiration-devant-le-club-de-luton-20231204","keywords":["Angleterre"],"creator":null,"video_url":null,"description":"Le coach d’Arsenal a déclaré qu’il admirait le club de Luton Town avant la rencontre de mardi entre son équipe et l’équipe promue.","content":"Le manager d'Arsenal, Mikel Arteta, a déclaré qu'il admirait Luton Town et son parcours \"remarquable\" pour accéder à la Premier League, ajoutant qu'il s'attendait à un match difficile à Kenilworth Road mardi. « C'est un endroit inspirant et ce qu'ils ont fait est remarquable. La façon dont ils l'ont fait et ce qu'ils transmettent est une histoire étonnante », a déclaré Arteta aux journalistes lundi. Arsenal a pris deux points d'avance sur Liverpool en tête du classement après sa victoire 2-1 sur Wolverhampton samedi, tandis que Luton, qui a gravi les échelons de la non-ligue à la Premier League en neuf ans, est 17e pour sa première saison dans l'élite, à deux points de la zone de chute. « Les joueurs de Luton méritent tout le crédit qu'ils ont reçu de la saison dernière et des matches serrés qu'ils ont eus cette saison », a déclaré Arteta. « Les deux équipes sont en train de s'affronter dans le cadre de la Coupe du Monde. Rob Edwards est un grand entraîneur et une personne très spéciale. Cela se voit à la façon dont son équipe joue. Je pense que c'est une très bonne équipe et cela ne se reflète pas dans ses résultats. C'est une source d'inspiration de jouer contre eux et nous sommes prêts à y aller ».","pubDate":"2023-12-04 19:18:54","image_url":"https://i.f1g.fr/media/cms/1660x1153_crop/2023/12/04/d9e7e8f1feedd6709af2e357b62385505c469782574f1b0da64f4aa23fbe4e32.jpg","source_id":"lefigaro","source_priority":17866,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"26fc809e9a4e3d52409c0a4f47501dd3","title":"Eight Questions That Will Shape the NFL Playoff Race","link":"https://www.theringer.com/nfl/2023/12/4/23987957/playoff-race-jalen-hurts-patrick-mahomes-kansas-city-chiefs-san-francisco-49ers","keywords":null,"creator":["Steven Ruiz"],"video_url":null,"description":null,"content":"It’s that time of the year. The calendar has flipped over to December. It’s getting dark before the late-afternoon games kick in. You’ve visited the playoff odds sites often enough that they’re the first suggestion from your browser when you start typing in the address bar. We’ve had to sit through a lot of bad football to get here, but the NFL’s playoff race has officially reached the homestretch. The Ringer ’s 2023 NFL Rankings Your hub for The Ringer ’s NFL rankings has arrived. Here we’ll feature our QB Rankings, Trade Value Rankings, and, of course, Power Rankings. Check back every week during the season as we put the league in order. All of that crappy, disjointed football we endured has left the playoff race jumbled on both sides of the bracket. There are massive fights at the top and bottom of the AFC standings, where three teams could be tied at the top with 9-3 records heading into Week 14. The wild-card race is more organized in the NFC, but San Francisco’s resounding win in Philly reopened the chase for the conference’s top seed. The Eagles remain in the driver’s seat, but their hands (talons?) are slipping off the wheel, with the Cowboys within a game of first place in the division ahead of next Sunday night’s matchup. There is plenty to sort out between now and the start of the postseason. Let’s try our best to clear up the picture by asking, and attempting to answer, eight questions that will shape the NFL’s playoff race. Sunday’s lopsided loss to the 49ers won’t derail Philadelphia’s season completely, but injury concerns for quarterback Jalen Hurts could do it if they continue to mount. Hurts briefly left the game to enter the concussion protocol, and while he did return, it’s clear that the Eagles star is far from 100 percent. Hurts has been dealing with a knee contusion since early October , which seems to have limited some of his explosiveness as a runner. But the more concerning effect can be found in the passing game, where Hurts has been a more reluctant scrambler while protecting the knee. That, combined with his tendency to hold on to the ball a bit longer, even when healthy, has put tremendous stress on the offensive line. The Eagles rank 27th in pressure rate allowed, per TruMedia, and many of those pressures have been created by Hurts himself deep into his dropbacks. Sunday’s game might have been the most extreme example of Hurts holding the ball for far too long. His average time to throw was 3.7 seconds, a season-high number that no doubt contributed to a 61.5 percent pressure rate (also a season high). It was the second week in a row in which Hurts was pressured on at least 50 percent of his dropbacks. He’s been pressured on 51 total dropbacks over the past two weeks, which leads the league, and his average time to throw on those plays is a whopping 4.41 seconds, per TruMedia, indicating that this increasing pressure rate isn’t the fault of Philly’s offensive line. And there were receivers open on some of those longer dropbacks, so we can’t blame it all on the play designs of first-year offensive coordinator Brian Johnson. If these extended plays were turning into positive gains more often, it wouldn’t be much of an issue, but many of them are turning into ineffective scrambles or throwaways. On Sunday, it was a bit of both. Hurts scrambled four times, with a success rate of 25 percent, and he didn’t pick up a first down on any of them. He also threw away the ball five times, adding to the tally of wasted downs and pushing him up to second in the NFL, with 29 throwaways on the season. Only struggling rookie Bryce Young has more (at 42!), per TruMedia. Even after a 10-2 start, the Eagles do not have much margin for error. The Cowboys are within a game of first in the division heading into next week’s rematch. If Hurts doesn’t adjust, which could require a healthier knee, that lead will be gone in a week, and the defending NFC champs will start their postseason on the road. Hurts’s uneven play isn’t Philly’s only concern after Sunday’s beatdown at the hands of the 49ers, but it’s definitely at the top of the list. Every other Kansas City loss this season has been a referendum on the state of the offense, but we can’t play that game after Sunday’s shocking home loss to Green Bay. The Chiefs scored only 19 points but did it in eight drives. One was a kneel down before the half, and the other was a desperation drive at the end of the game. So on six legitimate drives, Patrick Mahomes led his heavily scrutinized supporting cast to about 3.2 points per drive, which would lead the NFL on the season. This loss falls squarely on the defense. Related That’s the first time we’ve been able to say that about Kansas City this season. While both units have been in the top 10 in most efficiency metrics, the Chiefs have been better on the defensive side of the ball. That’s provided cover for an offense that can still score in bunches but hasn’t done it consistently this season. It would always be difficult for the defense to keep up that pace for 20 weeks, and Sunday’s ugly showing against Jordan Love’s Packers may have been the first sign of slippage. It was easily the worst defensive performance of the season for the defending Super Bowl champs. The defense set season-worst marks in total expected points added allowed, EPA allowed per play, and success rate allowed. Green Bay’s offense scored on nearly every possession and was successful in both early- and late-down situations. The Chiefs defense was thoroughly outplayed. Even after Sunday’s setback, Kansas City ranks near the league’s top in most defensive metrics. This defense is still excellent. But defensive performance is naturally volatile week to week and even more so later in the year, as attrition builds. On Sunday, the Chiefs lost two key contributors in safety Bryan Cook (ankle) and linebacker Drue Tranquill (concussion), which will necessitate major adjustments from defensive coordinator Steve Spagnuolo ahead of next week’s showdown with the Bills. On top of that, opponents now have more tape of Spagnuolo’s defense. As offenses get a better understanding of his play-calling tendencies, some of his tricks may lose effectiveness. With Josh Allen up next on the schedule, the defense won’t have to wait long before its latest big test. If we get a repeat of what happened on Sunday night in Green Bay and the offense remains inconsistent, it might be time to panic in Kansas City. Imagine asking this question a month ago. The Lions were running away with the division, and Jared Goff was forcing his way into MVP conversations. Meanwhile, Love’s first season as Green Bay’s starter had hit rock bottom, and the inexperienced quarterback had been inaccurate and indecisive. But over the past month, he’s not only been the division’s best quarterback. It hasn’t been particularly close. If you widen the scope to include the rest of the league, Love’s recent performance looks even more impressive. Over the past five weeks, he ranks second in EPA per dropback, behind Brock Purdy and Dak Prescott. He’s sixth in yards per dropback, sixth in success rate, and fourth among quarterbacks in PFF grading. And as impressive as the results have been, what Love is putting on tape is even more exciting. He’s executing Matt LaFleur’s offense even better than Aaron Rodgers did a season ago while adding the kind of playmaking flair we never saw from the aging quarterback in 2022. I’m not foolish enough to compare Love’s long-term prospects to those of the Hall of Fame quarterbacks who’ve played in Green Bay. Still, it’s hard not to draw stylistic comparisons when you watch Love throw from creative arm slots and make throws with unorthodox footwork. Jordan Love really did this on back to back plays... His poise under pressure is astounding. pic.twitter.com/z60FvxS02s That part of Love’s game separates him from a quarterback like Goff, who is thrown off whenever his pocket and throwing platform aren’t kept immaculately clean. That wasn’t a concern early in the season, when Detroit’s offensive line was mauling opponents every week, but the pass protection has regressed over the past month. Goff has been pressured on 38.1 percent of his dropbacks since Week 9. That’s the 11th-highest rate in the league over that time, and things could get worse after center Frank Ragnow left the Lions’ Sunday win in New Orleans with a knee injury. It’s looking like Ragnow avoided a significant injury, but Goff’s batterymate is expected to be sidelined as the team heads into a tricky two-game stretch against an improving Chicago team and a hot Broncos team. If Detroit drops either of those games, the NFC North race will get awfully interesting down the stretch. The Lions currently lead the division by three games, but Green Bay won’t face another team with a winning record, and Detroit still has a matchup with the Cowboys left on the schedule. Time isn’t on Green Bay’s side, but the schedule–and possibly the QB matchup—favors the Packers. If you can bottle up whatever the Eagles defense did in the first quarter of Sunday’s game, you might have a chance. Philadelphia’s defense swarmed the 49ers early on, destroying the run game and other early-down tricks and putting Purdy into obvious passing situations. San Francisco looked overwhelmed, and the game was moving too fast for its young quarterback. After the opening 15 minutes, the 49ers had managed minus-6 yards. Things changed, obviously. Whether it was because the Eagles defense lost juice or Kyle Shanahan found the right buttons to press, once it clicked for the 49ers, there was little Philly could do to stop what is arguably the greatest collection of offensive talent this league has ever seen. It feels like it’s a new star every week for the offense, but it was a total team effort during Sunday’s drubbing of the Eagles. I don’t even know where to start? How about with Deebo Samuel, who backed up all of his offseason talk with a dominant performance headlined by this 48-yard catch and run? this single play describes Deebo Samuel's game perfectly the power to shrug off an immediate LB tackle the speed to keep DBs away pic.twitter.com/sJuJEMZP9g Christian McCaffrey chipped in with 93 rushing yards and a score. George Kittle and Brandon Aiyuk were both chain movers. And, oh yeah, Purdy threw four touchdowns and averaged more than 11 yards per attempt. And, still, the most impressive offensive performance may have come from left tackle Trent Williams, whose number was called anytime the 49ers needed to pick up a first down on the ground. There is no limit on what this 49ers offense can do, especially when it’s operating ahead of the chains and Shanahan can dial up his misdirection plays that are predicated on the threat of the run. But Sunday’s game did show the path to slaying San Francisco’s multiheaded monster: If a defense can win big on first down with negative plays, it can negate the play-calling advantages that Shanahan typically provides. Those jet motions, formational shifts, and play-action fakes aren’t nearly as effective when the defense isn’t worried about run fits. The 49ers will still own the personnel advantage in almost every instance, but at least the schematic advantages are reduced. You’re not totally destroying the invading alien ship, but hey, the shields are down now! Winning the early-down matchup is easier said than done, of course. It requires not only the personnel to win one-on-ones across the field but also a sharp defensive mind. Fortunately for football nerds, San Francisco’s Week 16 opponent, the Baltimore Ravens, checks both of those boxes. (I’m fully expecting the 49ers to steamroll over their next two opponents, the Seahawks and Cardinals.) If Mike MacDonald, the NFL’s best defensive coordinator, doesn’t have the players and tactics to slow down the 49ers, then we might as well hand them the Lombardi Trophy right now. The clusterfuck at the top of the AFC standings just got more clustered and more fucked after Sunday’s slate. Assuming the Jaguars take care of business against Jake Browning’s Bengals on Monday, there are now four teams with at least a 20 percent chance of landing home field advantage throughout the playoffs: Kansas City has the longest odds of earning the top seed, but it has the most favorable schedule. Next week’s game against Buffalo is its last remaining game against a team without a losing record, and the other three teams play one another, with Jags-Ravens set for Week 15 and Ravens-Dolphins coming the week after. As dire as things look for Kansas City, it could end up in a familiar place when the season ends: at the top of the conference and playing at home in January. Neither team scored a touchdown on Sunday—Buffalo was on a bye, to be fair—but both were big winners this week. Had the Colts dropped an overtime game in Tennessee, it would have been a perfect weekend for two of 2023’s biggest disappointments, but losses by Denver, Cleveland, Pittsburgh, and New York still provide both the Chargers and Bills with a little hope going forward. Buffalo has the most straightforward path to a postseason berth. The Bills are just a game behind the Browns and Colts for the last spot in the playoff field, and both of those teams are dealing with major concerns at quarterback. Cleveland had to bring Joe Flacco off the couch to boost its injury-plagued QB room, and the Colts have to overcome Gardner Minshew’s reckless play every week. As wonky as the Bills offense has been this season, quarterback play has never been an issue. The schedule, on the other hand, is a major concern. Buffalo is in the middle of a brutal stretch that won’t let up before the playoffs. A home game against the Cowboys follows next week’s trip to Kansas City. That’s followed by what could be an elimination game against the Chargers on the eve of Christmas Eve. Los Angeles should come into the crucial game on a high. It’ll get a beatable Broncos team at home next week, followed by a road game against the Raiders before the showdown with Buffalo. It’s conceivable, if not likely, that the Chargers will have a better record when the two teams meet in late December. I feel like a sucker talking myself into this team (again), but the underlying numbers, including the conference’s seventh-best point differential, suggest that the Chargers are of playoff caliber. The defense has shown signs of improvement, and Justin Herbert had been playing elite-level football before Sunday’s rain-soaked mess in New England. Buffalo’s playoff odds sit at 14 percent as I’m writing this, per The New York Times . The Chargers have a 7 percent chance. But those numbers don’t consider that these teams employ Josh Allen and Justin Herbert. More crucially, they don’t consider that Flacco, Minshew, Russell Wilson, and Mitchell Trubisky are the quarterbacks standing in their way of a playoff push. Don’t count the Bills and Chargers out yet. Depending on how you feel about Seattle this season, he already has. Prescott kicked down the doors of any MVP debates with another near-perfect performance in a win over the Seahawks on Thursday, continuing the best stretch of play we’ve ever seen from the Cowboys quarterback. It’s not like we haven’t seen Prescott go on an extended heater before. As much shit as he gets for his team’s failures, he has been one of the NFL’s consistent producers at the quarterback position. But this latest stretch just feels different. It could end at any time because this level of play would be difficult for any quarterback to sustain, but it feels like Prescott has finally put it all together. He’s still as sharp as ever before the snap, when he basically calls the offense from the line of scrimmage, and he’s just not making any mental errors after it. On top of that, we’ve seen the return of Dak’s early-career creativity. Because he’s been a pocket passer throughout his NFL career, it’s easy to forget that he entered the league as a dual threat quarterback after playing for Dan Mullen at Mississippi State. Over the past few months, Prescott has leaned on his mobility instead of forcing passes into tight windows. His interceptions are down, and productive, chain-moving scrambles have replaced them. Prescott has looked like an MVP outside of the high-profile stinker against San Francisco. The only question about his case is the level of competition he’s faced, but that will change over the next few weeks with games against Philadelphia, Buffalo, Miami, and Detroit left on the schedule. It’s a tough slate for Dallas as a whole, but from a quarterback’s perspective, at least, it’s not the most daunting test. All of these teams have mediocre pass defenses by EPA and success rate, so the Cowboys should be able to move the ball through the air in these games. So to answer the question: Yes, Prescott should be able to keep this up against the good teams, but we’ll have to wait for January to see him against the only defense that has been able to slow him down these past few months. Rodgers returned to Jets practice this week, triggering a 21-day window for his possible return from what many assumed was a season-ending Achilles injury. But the veteran QB has said that he’d return this season only if New York’s playoff hopes were still alive, and after Sunday’s dreadful 13-8 loss to the Falcons, those hopes are now on life support. Per The New York Times , the Jets have a 1 percent chance of making the playoffs, and that number will drop down to a big fat 0 if they lose either of their next two games against the Texans and Dolphins. In other words, that sucker is dropping down to a big fat 0 very soon. In the meantime, Rodgers will get an extra week to pretend that a return in 2023 is possible, but let’s face it: The Jets were done as soon as they decided on starting Tim Boyle two weeks ago. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again.","pubDate":"2023-12-04 19:17:45","image_url":"https://cdn.vox-cdn.com/thumbor/DOSaELL24wGrSbqJPdTdeWicPZ0=/24x0:1091x800/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/72930163/QuestionsPlayoffsRace_Getty_AP_Ringer.0.jpg","source_id":"theringer","source_priority":2702,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f69edd6366edb58cf1b887943961200d","title":"Apugo Commends NFF Football Stakeholders Workshop","link":"https://promptnewsonline.com/apugo-commends-nff-football-stakeholders-workshop/?utm_source=rss&utm_medium=rss&utm_campaign=apugo-commends-nff-football-stakeholders-workshop","keywords":["Sports","Football stakeholders"],"creator":["Editor"],"video_url":null,"description":"By Andrew Abah, Abuja The President of Super Star Football Academy Hon. Victor Apugo said his Academy has a solid background and the best in Uyo having the best sporting facilities for the students Apugo who spoke in Abuja during the FIFA Talent Development Scheme for Football Stakeholders Workshop , commended NFF for putting up [...] The post Apugo Commends NFF Football Stakeholders Workshop first appeared on Prompt News.","content":"The President of Super Star Football Academy Hon. Victor Apugo said his Academy has a solid background and the best in Uyo having the best sporting facilities for the students Apugo who spoke in Abuja during the FIFA Talent Development Scheme for Football Stakeholders Workshop , commended NFF for putting up such programme which has broadened the knowledge of grassroot coaches and academies. He said the programme has enriched on how to run his academy effectively . ” I manage one of the best academies if not the best in Uyo. The Workshop has taught me to be more effective and how to identify the young talents at the lower level of football. I organise scouting program with invitation of foreign football scout.”. Apugo also emphasised the need for the NFF to regulate the prolification of academies in the country . ” I am happy NFF President Ibrahim Gusau has made it clear that all academies will henceforth registered with the football house through the States FA to avoid claims and counter claims of players. I wish also that NFF should have this kind of workshop yearly “. Said Apugo.","pubDate":"2023-12-04 19:17:21","image_url":"https://promptnewsonline.com/wp-content/uploads/2023/06/Football-e1695568140181.jpg","source_id":"promptnewsonline","source_priority":7829578,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e1ee3194de917dd6b31819a7601b9aeb","title":"FA klaagt Manchester City aan na wangedrag van woedende Haaland en teamgenoten","link":"https://www.voetbalprimeur.nl/nieuws/1165948/city-aangeklaagd-na-wangedrag-spelers-tegen-spurs.html","keywords":["Nieuws","Premier League","Manchester City","Tottenham Hotspur","Erling Haaland"],"creator":["info@voetbalprimeur.nl (VoetbalPrimeur)"],"video_url":null,"description":"De Engelse voetbalbond heeft Manchester City aangeklaagd. De reden: het gedrag van enkele spelers tijdens het spectaculaire gelijkspel met Tottenham Hotspur (3-3) van afgelopen zondag.","content":"De Engelse voetbalbond heeft Manchester City aangeklaagd. De reden: het gedrag van enkele spelers tijdens het spectaculaire gelijkspel met Tottenham Hotspur (3-3) van afgelopen zondag. Artikel verder na advertentie Tijdens die wedstrijd werd een aantal City-spelers woedend toen scheidsrechter Simon Hooper in de allerlaatste minuut verzuimde de voordeelregel toe te passen. Daardoor kon aanvaller Jack Grealish bij een 3-3 gelijke stand niet op de Spurs-goal afstomen. Een laatste kans op de overwinning werd de ploeg van manager Pep Guardiola zodoende ontnomen. BREAKING: Manchester City have been charged by the FA for failing to control their players after surrounding referee Simon Hooper in the 94th minute of their draw against Tottenham. pic.twitter.com/PMW33z7tGk Na de beslissing bestormde het halve City-elftal scheidsrechter Hooper. Onder hen bevond zich ook spits Erling Haaland , die er op z'n zachtst gezegd niet in slaagde om zijn woede te verbergen. De FA (Football Association) is van mening dat de regerend landskampioen er niet in is geslaagd om ervoor te zorgen dat de spelers zich naar behoren hebben gedragen. City heeft tot komende donderdag om te reageren op de aanklacht. Artikel verder na advertentie","pubDate":"2023-12-04 19:16:48","image_url":"https://webp.vp.cdn.pxr.nl/news/2023/12/04/9baea453e7b36b67a275269a73b118d77cdf755b.jpg?width=1200","source_id":"voetbalprimeur","source_priority":653815,"country":["netherland"],"category":["sports"],"language":"dutch"},{"article_id":"0bae64c89e70e6ad863da6f7355a4ade","title":"EPL refuse to punish referee after Man City vs Tottenham controversy","link":"https://dailypost.ng/2023/12/04/epl-refuse-to-punish-referee-after-man-city-vs-tottenham-controversy/","keywords":["Sport","EPL","Man Utd vs Tottenham"],"creator":["Ifreke Inyang"],"video_url":null,"description":"The Premier League have decided not to suspend Simon Hooper, despite his late decision not to play advantage for Manchester City against Tottenham. Hooper stopped play despite Jack Grealish running through on goal. He then awarded a free-kick for a foul on Erling Haaland, who had gotten up to play the pass to Grealish. City […] EPL refuse to punish referee after Man City vs Tottenham controversy","content":"Daily Post Nigeria EPL refuse to punish referee after Man City vs Tottenham controversy Home News Politics Metro Entertainment Sport Sport EPL refuse to punish referee after Man City vs Tottenham controversy Published on December 4, 2023 By Ifreke Inyang The Premier League have decided not to suspend Simon Hooper, despite his late decision not to play advantage for Manchester City against Tottenham. Hooper stopped play despite Jack Grealish running through on goal. He then awarded a free-kick for a foul on Erling Haaland, who had gotten up to play the pass to Grealish. City have now been charged by the Football Association for failing to control their players, with Haaland particularly furious at the final whistle. Hooper has been assigned to Liverpool’s game at Sheffield United on Wednesday. The Premier League view his mistake as a human error, and he will not be demoted. He has been previously, as he failed to award a penalty for Wolves against Manchester United earlier this season. Related Topics: EPL Man Utd vs Tottenham Don't Miss Niger Tornadoes trio doubtful for Remo Stars clash You may like EPL: Glen Johnson speaks on ex-Chelsea forward joining Man Utd EPL: Brazil reveals goalkeeper to replace Onana at Man Utd once Ratcliffe arrives EPL: Fulham must start winning games – Iwobi EPL: Fabrizio Romano confirms first manager to be sacked EPL: Poor decision – Jody Morris criticizes Chelsea star after latest win EPL: Gary Neville, Micah Richards pinpoint why Manchester City are dropping points this season Advertise About Us Contact Us Privacy-Policy Terms Copyright © Daily Post Media Ltd","pubDate":"2023-12-04 19:16:31","image_url":"https://dailypost.ng/wp-content/uploads/2023/12/MixCollage-04-Dec-2023-08-22-PM-5561.jpg","source_id":"dailypost","source_priority":55306,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"6d456d8d0b6b764077c6b43e2fae1ab0","title":"Αστέρας Τρίπολης: Εκτός οι Τζουκάνοβιτς, Γκος","link":"https://www.gazzetta.gr/football/kypello-elladas/2281159/asteras-tripolis-ektos-oi-tzoykanobits-gkos","keywords":["Ποδόσφαιρο","Κύπελλο Ελλάδας","Αστέρας Τρίπολης","Newsroom"],"creator":null,"video_url":null,"description":"Ο Αστέρας Τρίπολης ολοκλήρωσε την προετοιμασία του για το αυριανό παιχνίδι Κυπέλλου με τον Πανσερραϊκό, όπου δεν υπολογίζονται οι Τζουκάνοβιτς και Γκος.","content":"Χωρίς απρόοπτα ολοκλήρωσε ο Αστέρας Τρίπολης την προετοιμασία του για το αυριανό (5/12) ματς Κυπέλλου με τον Πανσερραϊκό , που θα είναι το πρώτο του ζευγαριού για τη φάση των «16». Ο Μίλαν Ράσταβατς άφησε εκτός αποστολής τους Τζουκάνοβιτς και Γκος, όμως επιστρέφουν οι Χουχούμης, Γκρόζντανιτς, Ντιαρά, Κωστέας. Αυτή αποτελείται από τους εξής: Παπαδόπουλος, Σγουρής, Γραμματικάκης, Γκαρθία, Χουχούμης, Καρμόνα, Πίτσου, Καστάνιο, Αλβαρες, Γκρόζντανιτς, Βαλιέντε, Μπαρτόλο, Μουνάφο, Σουρλής, Ντιαρά, Σίτο, Αλάγκμπε, Ζουγλής, Μιριτέλο, Κρέσπι, Μάντζης, Καλτσάς, Κωστέας.","pubDate":"2023-12-04 19:34:17","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"7c65c968b52c4e2d63f1c9654d12d237","title":"Montse Tomé y Aitana Bonmatí: una bronca en el vestuario, un cambio a destiempo y una llamada pública de atención","link":"https://elpais.com/deportes/futbol/2023-12-04/montse-tome-y-aitana-bonmati-una-bronca-en-el-vestuario-un-cambio-a-destiempo-y-una-llamada-publica-de-atencion.html","keywords":["Fútbol","Futbolistas","Entrenadores","Competiciones","Deportes","Selección española","Selección española fútbol","Bonmatí","Montse Tomé","Jennifer Hermoso"],"creator":["Nadia Tronchoni"],"video_url":null,"description":"La seleccionadora refuerza su autoridad en el vestuario de España y tras perder ante Italia: “Equipo somos todos, todos tenemos que sumar”","content":"Aitana Bonmatí volvió a entrenarse ayer. No sufría ninguna lesión ni dolencia grave. Pero se ausentó del último entrenamiento con el equipo nacional por un resfriado. Tampoco se sintió bien, así lo explicó ella misma, tras jugar el primer tiempo contra Italia el viernes. Y pidió el cambio. Lo pidió tan tarde que al staff de España le costó reaccionar; aquello provocó que también se avisara tarde a la delantera Esther González, que ni siquiera había calentado, de que tenía que saltar al campo y en esos minutos en que la selección jugó en inferioridad numérica, el rival marcó: 1-1. Y el vía crucis del encuentro no había hecho más que comenzar. El partido terminó 2-3. La Roja contaba su primera derrota en los partidos de clasificación para la Nations League. Aunque, pese a todo, la derrota de Suecia les permitió irse a dormir con su billete para la final four del próximo febrero en el bolsillo. En todo este embrollo, cuyo culebrón se ha alargado hasta la previa del último partido de la liguilla, este martes (España se mide a Suecia, a las 19.00; La 1), no explicó la Balón de Oro que instantes antes de pedir al cuerpo técnico ser sustituida y no disputar la segunda parte se había enzarzado en una discusión con la seleccionadora Montse Tomé, que supuestamente le habría pedido más intensidad a la futbolista. La reacción de Aitana estuvo fuera de lugar. “Se pasó de frenada”, confiesan fuentes cercanas al vestuario. “Ella es vehemente, super competitiva”, explican en Las Rozas. Y en las declaraciones posteriores al partido, la entrenadora, que lleva exactamente tres meses en el cargo y sustituye al destituido Jorge Vilda, no tuvo inconveniente en señalar a Bonmatí: “Empezamos con 10 porque Aitana avisa tarde de que no está disponible”. La jugadora, por su parte, asume que avisa tarde, pero no se encontraba bien y prefirió que otra jugadora entrara en su lugar. “Las sensaciones no eran muy buenas, llevaba unos días con malestar, resfriada, mucha mucosidad. El descanso a menudo sirve para reposar esas sensaciones y ver cómo te sientes”, explica su entorno. Y el desenlace del partido acaba animando la crisis. Bonmatí, señalada como la mejor jugadora de España en el Mundial, la mejor futbolista del 2023 según France Football , siente que hubo un problema y que ahora se busca un culpable. “En un equipo hay intercambio de opiniones. Y a menudo se hace una montaña de situaciones muy cotidianas en el día a día de un vestuario. Cierto que, del mensaje de la seleccionadora, se entiende que la culpabiliza”, indican fuentes cercanas. Que España jugara con diez durante los tres minutos en que encajó el gol del empate y perdió el control del partido no puede ser culpa de una jugadora. “Que en la Federación no se trabaje con tranquilidad tampoco ayuda a buscar la excelencia”, apuntan fuentes del vestuario. Dos voces diferentes de la selección asumen que en el equipo femenino se trabaja con miedo después de la crisis que devino tras el beso del ya expresidente Luis Rubiales a la delantera Jenni Hermoso —quien, por cierto, ha recuperado sus galones como cuarta capitana del equipo—: “Todo el mundo quiere que nos salgan mal las cosas”, admiten desde Las Rozas. En ese camino —hacia la profesionalidad y la naturalidad— en que el equipo está inmerso desde agosto, la seleccionadora Tomé trata, con declaraciones públicas como las del viernes, de ganarse la autoridad y el respeto del vestuario. “Desde que comenzamos en septiembre el camino no ha sido fácil. Pero hemos conseguido imponernos con profesionalidad, trabajo, humildad. Me gusta mucho esta palabra. Me gusta que todos y todas podamos serlo. Estamos en una línea positiva. No nos gusta perder y hay cosas que tenemos que ajustar, pero estamos en el camino”, declaró en la conferencia de prensa de ayer. No está claro si las formas en que lo intentó tras el partido del viernes, de las que no quiso desdecirse ayer, son las más convincentes, pero la mayoría de fuentes consultadas coinciden en que ese episodio no le pasará factura. “Montse lleva cuatro días y a veces le falta capacidad comunicativa. También picardía o ese recurrir a la picaresca para evitar que empiece el segundo tiempo con una jugadora menos. Hay muchas maneras de evitar no salir con diez”. Con polémica incluida, ni Tomé, ni Laia Aleixandri, que atendió a los medios en La Rosaleda, de Málaga, donde se espera hoy una muy buena entrada, perdieron el foco de lo que les importa: “El vestuario es lo importante, el equipo, y todo lo que ocurre dentro es bueno que lo cuidemos, que lo protejamos y que sea nuestro. Nosotros somos super exigentes y super profesionales, queremos lo mejor para todos. Ya estamos pensando en Suecia. Nuestra mente debe estar solo en eso; equipo somos todos y todos tenemos que sumar”, apuntaba Tomé. “Debemos pensar en el partido. Estamos con una ambición tremenda. Siendo una selección campeona debemos tener exigencia máxima. Lo que sucedió no puede volver a suceder”, añadía Aleixandri. Puedes seguir a EL PAÍS Deportes en Facebook y X , o apuntarte aquí para recibir nuestra newsletter semanal . Redactora jefa de la sección de Deportes y experta en motociclismo. Ha estado en cinco Rally Dakar y le apasionan el fútbol y la política. Se inició en la radio y empezó a escribir en el diario La Razón. Es Licenciada en Periodismo por la Universidad de Valencia, Máster en Fútbol en la UV y Executive Master en Marketing Digital por el IEBS.","pubDate":"2023-12-04 19:34:02","image_url":"https://imagenes.elpais.com/resizer/FvYWVVsNOfs-49cY9-xl-zvZlys=/arc-anglerfish-eu-central-1-prod-prisa/public/NV53ATMUJJANVEJNZNSNXKDFI4.jpg","source_id":"elpais","source_priority":2530,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"a741dda2e9567d6ef3ce45223d13a9df","title":"Λουτσέσκου: «Αν βρούμε παίκτες ικανούς να αναβαθμίσουν το ρόστερ μας, θα τους πάρουμε»","link":"https://www.gazzetta.gr/football/superleague/2281158/loytseskoy-broyme-paiktes-ikanoys-na-anabathmisoyn-roster-mas-tha-toys","keywords":["Ποδόσφαιρο","Superleague","ΠΑΟΚ","Λαμία","Ραζβάν Λουτσέσκου","Newsroom"],"creator":null,"video_url":null,"description":"Την ικανοποίησή του για τη νίκη επί της Λαμίας και κυρίως την εμφάνιση, έμεινε ο Ραζβάν Λουτσέσκου με τον τεχνικό του ΠΑΟΚ να αναφέρει πως αν βρεθούν παίκτες ικανοί να κάνουν την διαφορά θα αποκτηθούν.","content":"Εξαιρετικά ενδιαφέρουσα ήταν ακόμα μία συνέντευξη Τύπου του Ραζβάν Λουτσέσκου . Ο Ρουμάνος τεχνικός μιλώντας μετά τη νίκη του ΠΑΟΚ επί της Λαμίας , αναφέρθηκε στο ματς, αλλά στα μεταγραφικά επισημαίνοντας πως αν βρεθούν ποδοσφαιριστές που θα μπορούν να κάνουν την διαφορά και να αναβαθμίσουν το υπάρχον ρόστερ, τότε θα αποκτηθούν. Αναλυτικά ο τεχνικός του ΠΑΟΚ ανέφερε τα εξής: Για την εικόνα της ομάδας του και το τι ήταν το πιο σημαντικό σε αυτό το ματς: «Περίμενα να σκοράρουμε περισσότερα γκολ, είχαμε αρκετές ευκαιρίες και έπρεπε να τις εκμεταλλευτούμε. Όταν σου δίνονται αυτές οι ευκαιρίες πρέπει να τις κάνεις γκολ. Είχαμε απέναντι μας μια ομάδα που φέτος έχει παίξει πολύ καλά και έχει δημιουργήσει προβλήματα, εμείς προερχόμασταν από ένα δύσκολο και απαιτητικό ματς στην Φρανκφούρτη αλλά δείξαμε καλή νοοτροπία και είχαμε την σωστή ενέργεια στον αγωνιστικό χώρο. Πήραμε μια νίκη στη Γερμανία που θα μπορούσε να φέρει προβληματισμούς, αλλά ήταν μια πραγματικά πολύ καλή στάση από τους παίκτες σήμερα. Η νίκη μας σήμερα είναι απολύτως λογική γιατί ήμασταν καλύτεροι σε όλους τους τομείς». Για το γεγονός ότι τα σέντερ φορ του ΠΑΟΚ έχουν σκοράρει 10 γκολ από τα 51 συνολικά μέχρι στιγμής: «Θα σας πω ότι τα άλλα 41 γκολ τα έχουν βάλει παίκτες μας επίσης. Δεν έχει σημασία ποιος σκοράρει, ο στόχος είναι να μπει μέσα στο γήπεδο να παίξει καλά, να κερδίσει και να βάλει γκολ. Αν οι άλλοι έχουν βάλει 41 γκολ σημαίνει ότι έχουν κάνει καλή δουλειά και οι επιθετικοί επίσης. Γιατί τα γκολ προέρχονται και από ενέργειες των επιθετικών που δημιουργούν χώρους με τις κινήσεις τους. Έχουν συμμετοχή στα γκολ όλοι οι παίκτες και αυτό είναι το σημαντικό, γιατί οι επιθετικοί μας βοηθάνε φτιάχνοντας χώρους για τους άλλους. Είναι μια τεράστια δουλειά τόσο όταν έχουμε την μπάλα, όσο και όταν δεν την έχουμε, έχουν πολύ μεγάλη συνεισφορά οι επιθετικοί μας και δεν κρίνονται μόνο από τα γκολ τους». Για το τι είπε στον Κωνσταντέλια όταν τον έπιασε η κάμερα να γελάει και να του μιλάει: «Αφορούσε κάτι για τα επόμενα ματς. Αν ήταν κάτι άλλο θα σας το έλεγα». Για το αν θέλει να βελτιωθεί κάτι στην ομάδα σε μια περίοδο που φαίνονται να πηγαίνουν όλα καλά: «Έχει να κάνει με το θέμα το πνευματικό, το πώς θα πηγαίνουμε από το ένα ματς στο άλλο. Πρέπει να μείνουμε συγκεντρωμένοι. Μέσα σε 11 μέρες έχουμε τέσσερα παιχνίδια. Είχαμε αυτό το ματς με την Άιντραχτ, τώρα παίξαμε με την Λαμία, παιχνίδια που το καθένα τους σε κάνουν να ξοδεύεις πολύ πνευματική ενέργεια. Πρέπει να αντιμετωπίζουμε κάθε παιχνίδι ως τελικό, πρέπει να ξεχνάμε τα αποτελέσματα το επόμενο πρωί κιόλας. Πήραμε μεγάλη χαρά στην Φρανκφούρτη και έπρεπε να βρούμε ισορροπία. Και τώρα με την Λαμία πρέπει άμεσα να ξεχάσουμε τη νίκη και να αφοσιωθούμε στο ματς της Πέμπτης σε μια διοργάνωση που θέλουμε να φτάσουμε και πάλι στον τελικό. Η ομάδα βήμα βήμα γίνεται καλύτερη, πιο δυνατή γιατί μεγαλώνει ο βαθμός προσαρμογής των νέων παικτών. Όλη αυτή την περίοδο έχουμε δύσκολα παιχνίδια και η χημεία μας έχει βελτιωθεί πάρα πολύ. Με κάνει να έχω αυτοπεποίθηση όλο αυτό, με τις σχέσεις ανάμεσα στους παίκτες και το κλίμα που υπάρχει. Έχουμε πάρα πολλούς παίκτες που συμμετέχουν σε όλο αυτό που κάνουμε φέτος. Είχαμε οκτώ αλλαγές στην ενδεκάδα σε σχέση με το προηγούμενο και τα παιδιά ανταποκρίθηκαν πολύ καλά». Για τον Τάισον, για το αν μπορεί να γίνει παράδειγμα τους νέους παίκτες και το αν το περίμενε να έχει αυτή την εικόνα φέτος: «Πέρσι τον χειμώνα μου προτάθηκε από τον Γιώργο Σαββίδη αυτός ο παίκτης και είπα αμέσως ναι. Απάντησα ναι γιατί ξέρω τι παίκτης είναι, τι ποιότητα έχει και την θέληση που έχει για να παίζει. Τον γνωρίζω γιατί τον είχε παίκτη ο πατέρας μου, γνώριζα την αγάπη του για το άθλημα και για την προπόνηση. Στην Βραζιλία είχε έναν τραυματισμού και χρειαζόταν χρόνο, άρχισε να προσαρμόζεται και να δείχνει την τεράστια ποιότητα. Παίζει ένα απίστευτο ποδόσφαιρο. Όσο για το αν μπορεί να γίνει παράδειγμα, αυτός και ο Αντρέ είναι πάντα ανάμεσα στους νέους παίκτες και δεν ξέρω αν ο Τάισον και ο Αντρέ είναι αυτοί οι... νέοι ή αν είναι οι νέοι ο Κωνσταντέλιας και ο Κουλιεράκης. Καμιά φορά είναι και το ανάποδο! Έχουν ψυχή νέων παιδιών ο Τάισον και ο Αντρέ είναι πολύ σημαντικοί για το γκρουπ που έχουμε φτιάξει. Δεν ξέρω τι να σας πω για την ανανέωση του Ταισον. Παίζουμε ανά τρεις μέρες, κάθε μέρα έχουμε πολύ δουλειά. Ξυπνάω πέντε το πρωί για να αναλύσω τα παιχνίδια. Η διοίκηση γνωρίζει τι θέλω και τι πρέπει να κάνει και με το θέμα του Τάισον. Αν αρχίσουμε να χάνουμε την συγκέντρωση μας με διάφορα άλλα θέματα τότε θα χάσουμε αυτά που έχουμε καταφέρει μέχρι σήμερα. Πρέπει να προστατεύσω την δουλειά που κάνουμε. Ξέρω πάρα πολύ καλά πως αν παρεκκλίνεις είναι εύκολο να χάσεις τη συγκέντρωση. Καταλαβαίνω την ανάγκη των δημοσιογράφων για θέματα, αλλά πρέπει να μείνουμε σε αυτό και να είμαστε συγκεντρωμένοι στα παιχνίδια. Αν με ρωτάτε για το αν ο Τάισον πρέπει να είναι εδώ, τότε θα σας πω ότι ναι πρέπει να είναι. Ο Ταισον είναι ένας από τους καλύτερους παίκτες μας, ο αγαπημένος της εξέδρας, είναι χαρούμενος εδώ». Για την συζήτηση με τον Σαββίδη με τα μετεγγραφικά και τη δική του επιθυμία: «Είστε εσείς από το υπάρχον ρόστερ; Αν μπορεί να γίνει κάτι καλύτερο και μπορούμε να γίνουμε καλύτεροι, τότε θα είναι καλό για εμάς. Αν υπάρξει κάτι καλύτερο θα δούμε τι μπορεί να γίνει. Αυτό ισχύει για όλες τις ομάδες, αν έχουμε πιθανότητα να βρούμε ικανούς παίκτες για να κάνουν αναβάθμιση στο ρόστερ, τότε θα θέλαμε να το κάνουμε».","pubDate":"2023-12-04 19:31:03","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"07a794b4b81913c786349db2a383b2ad","title":"Jeffery Simmons is expected to miss multiple weeks with knee injury","link":"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jeffery-simmons-is-expected-to-miss-multiple-weeks-with-knee-injury","keywords":null,"creator":null,"video_url":null,"description":"Titans running back Derrick Henry avoided a concussion on Sunday, but a key member of the defense didn't enjoy the same luck on the injury front.","content":"Titans running back Derrick Henry avoided a concussion on Sunday, but a key member of the defense didn’t enjoy the same luck on the injury front. Defensive tackle Jeffery Simmons left their overtime loss to the Colts with a knee injury early in the second half and was ruled out a short time later. On Monday, head coach Mike Vrabel said at his press conference that Simmons is expected to miss a couple of weeks while he recovers. Simmons had two tackles before leaving Sunday’s game. He has 44 tackles, 5.5 sacks, a forced fumble, and a fumble recovery in 12 games this season. Denico Autry, Teair Tart, Kyle Peko, Jaleel Johnson, and TK McClendon Jr. are the other defensive linemen on the 53-man roster in Tennessee.","pubDate":"2023-12-04 19:23:53","image_url":null,"source_id":"profootballtalk","source_priority":267,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"2a678e2e70373951016ea690bcfed850","title":"Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness","link":"https://www.dailymail.co.uk/sport/football/article-12824321/Arsenal-Mikel-Arteta-title-injuries-Ben-White-Takehiro-Tomiyasu.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SAMI MOKBEL: The north London club's promising position comes despite suffering a clutch of injuries to key players throughout the early weeks of the season.","content":"Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness Arsenal travel to Luton on Tuesday night looking to extend their lead at the top The Gunners have suffered several injuries to key players already this season Man City are vulnerable, but come the spring they will put on the afterburners. Leaders Arsenal must seize their moment now - Listen to It's All Kicking Off By Sami Mokbel for MailOnline Published: 13:52 EST, 4 December 2023 | Updated: 14:20 EST, 4 December 2023 e-mail View comments Arsenal head coach Mikel Arteta is carefully managing his title chasing squad’s training workload to ensure their championship charge stays on track. The Gunners are top of the Premier League , two points clear of second placed Liverpool after 14 matches. The north London club’s promising position comes despite suffering a clutch of injuries to key players throughout the early weeks of the season. Most recently key defenders Takehiro Tomiyasu and Ben White have been struck by injury concerns and are among those whose workloads are being meticulously monitored to ensure their availability ahead of hectic run of matches. Arteta says he will make a late decision on Tomiyasu’s availability ahead of Tuesday’s clash at Luton after the Japan international limped off with a suspected calf issue against Wolves on Saturday. Tomiyasu has undergone a scan. Mikel Arteta is managing his squad’s training load to ensure their title charge stays on track Defender Takehiro Tomiyasu limped off with a suspected calf issue against Wolves on Saturday afternoon putting his participation in Tuesday's game at Kenilworth Road vs Luton in doubt Your browser does not support iframes. The Arsenal head coach also said on Monday that White, whose recent availability has been impacted due to what Arteta says is a ‘muscular’ problem, is feeling ‘perfect’ following his fitness concerns. Arsenal have a long list of injury problems, with Thomas Partey, Emile Smith Rowe, Fabio Vieira and Jurrien Timber all currently unavailable leaving the Gunners stretched. And Arteta and his staff are acutely aware of the importance of ensuring his players are kept fresh - particular for the use Christmas schedule. Mail Sport also understands that certain players are using private sessions away from the club’s London Colney HQ to ensure their bodies are at optimum capacity. Last season, injuries at crucial parts of the season contributed to Arsenal eventually being overtaken by Manchester City; William Saliba, Gabriel Jesus and Olekandr Zinchenko all missing important matches last season. And the Gunners are ensuring they implement a training strategy that protects players ahead of the business end of the season. ‘It's still a huge marathon ahead of us,’ said Arteta during his press conference ahead of the game at Kenilworth Road. ‘The encouragement comes from watching the team play, watching them behave every day and how hungry and willing they are to approach every training session. That's what gives me encouragement.’ Arteta revealed that defender Ben White is feeling 'perfect' following his fitness concerns IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Mikel Arteta Japan Ben White Share or comment on this article: Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-04 19:20:35","image_url":"https://i.dailymail.co.uk/1s/2023/12/04/18/78565655-0-image-a-6_1701715855113.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6fc6d6c8a994801cb34469d73af3a966","title":"Premier League : Mikel Arteta en admiration devant le club de Luton","link":"https://www.lefigaro.fr/sports/football/angleterre/premier-league-mikel-arteta-en-admiration-devant-le-club-de-luton-20231204","keywords":["Angleterre"],"creator":null,"video_url":null,"description":"Le coach d’Arsenal a déclaré qu’il admirait le club de Luton Town avant la rencontre de mardi entre son équipe et l’équipe promue.","content":"Le manager d'Arsenal, Mikel Arteta, a déclaré qu'il admirait Luton Town et son parcours \"remarquable\" pour accéder à la Premier League, ajoutant qu'il s'attendait à un match difficile à Kenilworth Road mardi. « C'est un endroit inspirant et ce qu'ils ont fait est remarquable. La façon dont ils l'ont fait et ce qu'ils transmettent est une histoire étonnante », a déclaré Arteta aux journalistes lundi. Arsenal a pris deux points d'avance sur Liverpool en tête du classement après sa victoire 2-1 sur Wolverhampton samedi, tandis que Luton, qui a gravi les échelons de la non-ligue à la Premier League en neuf ans, est 17e pour sa première saison dans l'élite, à deux points de la zone de chute. « Les joueurs de Luton méritent tout le crédit qu'ils ont reçu de la saison dernière et des matches serrés qu'ils ont eus cette saison », a déclaré Arteta. « Les deux équipes sont en train de s'affronter dans le cadre de la Coupe du Monde. Rob Edwards est un grand entraîneur et une personne très spéciale. Cela se voit à la façon dont son équipe joue. Je pense que c'est une très bonne équipe et cela ne se reflète pas dans ses résultats. C'est une source d'inspiration de jouer contre eux et nous sommes prêts à y aller ».","pubDate":"2023-12-04 19:18:54","image_url":"https://i.f1g.fr/media/cms/1660x1153_crop/2023/12/04/d9e7e8f1feedd6709af2e357b62385505c469782574f1b0da64f4aa23fbe4e32.jpg","source_id":"lefigaro","source_priority":17866,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"26fc809e9a4e3d52409c0a4f47501dd3","title":"Eight Questions That Will Shape the NFL Playoff Race","link":"https://www.theringer.com/nfl/2023/12/4/23987957/playoff-race-jalen-hurts-patrick-mahomes-kansas-city-chiefs-san-francisco-49ers","keywords":null,"creator":["Steven Ruiz"],"video_url":null,"description":null,"content":"It’s that time of the year. The calendar has flipped over to December. It’s getting dark before the late-afternoon games kick in. You’ve visited the playoff odds sites often enough that they’re the first suggestion from your browser when you start typing in the address bar. We’ve had to sit through a lot of bad football to get here, but the NFL’s playoff race has officially reached the homestretch. The Ringer ’s 2023 NFL Rankings Your hub for The Ringer ’s NFL rankings has arrived. Here we’ll feature our QB Rankings, Trade Value Rankings, and, of course, Power Rankings. Check back every week during the season as we put the league in order. All of that crappy, disjointed football we endured has left the playoff race jumbled on both sides of the bracket. There are massive fights at the top and bottom of the AFC standings, where three teams could be tied at the top with 9-3 records heading into Week 14. The wild-card race is more organized in the NFC, but San Francisco’s resounding win in Philly reopened the chase for the conference’s top seed. The Eagles remain in the driver’s seat, but their hands (talons?) are slipping off the wheel, with the Cowboys within a game of first place in the division ahead of next Sunday night’s matchup. There is plenty to sort out between now and the start of the postseason. Let’s try our best to clear up the picture by asking, and attempting to answer, eight questions that will shape the NFL’s playoff race. Sunday’s lopsided loss to the 49ers won’t derail Philadelphia’s season completely, but injury concerns for quarterback Jalen Hurts could do it if they continue to mount. Hurts briefly left the game to enter the concussion protocol, and while he did return, it’s clear that the Eagles star is far from 100 percent. Hurts has been dealing with a knee contusion since early October , which seems to have limited some of his explosiveness as a runner. But the more concerning effect can be found in the passing game, where Hurts has been a more reluctant scrambler while protecting the knee. That, combined with his tendency to hold on to the ball a bit longer, even when healthy, has put tremendous stress on the offensive line. The Eagles rank 27th in pressure rate allowed, per TruMedia, and many of those pressures have been created by Hurts himself deep into his dropbacks. Sunday’s game might have been the most extreme example of Hurts holding the ball for far too long. His average time to throw was 3.7 seconds, a season-high number that no doubt contributed to a 61.5 percent pressure rate (also a season high). It was the second week in a row in which Hurts was pressured on at least 50 percent of his dropbacks. He’s been pressured on 51 total dropbacks over the past two weeks, which leads the league, and his average time to throw on those plays is a whopping 4.41 seconds, per TruMedia, indicating that this increasing pressure rate isn’t the fault of Philly’s offensive line. And there were receivers open on some of those longer dropbacks, so we can’t blame it all on the play designs of first-year offensive coordinator Brian Johnson. If these extended plays were turning into positive gains more often, it wouldn’t be much of an issue, but many of them are turning into ineffective scrambles or throwaways. On Sunday, it was a bit of both. Hurts scrambled four times, with a success rate of 25 percent, and he didn’t pick up a first down on any of them. He also threw away the ball five times, adding to the tally of wasted downs and pushing him up to second in the NFL, with 29 throwaways on the season. Only struggling rookie Bryce Young has more (at 42!), per TruMedia. Even after a 10-2 start, the Eagles do not have much margin for error. The Cowboys are within a game of first in the division heading into next week’s rematch. If Hurts doesn’t adjust, which could require a healthier knee, that lead will be gone in a week, and the defending NFC champs will start their postseason on the road. Hurts’s uneven play isn’t Philly’s only concern after Sunday’s beatdown at the hands of the 49ers, but it’s definitely at the top of the list. Every other Kansas City loss this season has been a referendum on the state of the offense, but we can’t play that game after Sunday’s shocking home loss to Green Bay. The Chiefs scored only 19 points but did it in eight drives. One was a kneel down before the half, and the other was a desperation drive at the end of the game. So on six legitimate drives, Patrick Mahomes led his heavily scrutinized supporting cast to about 3.2 points per drive, which would lead the NFL on the season. This loss falls squarely on the defense. Related That’s the first time we’ve been able to say that about Kansas City this season. While both units have been in the top 10 in most efficiency metrics, the Chiefs have been better on the defensive side of the ball. That’s provided cover for an offense that can still score in bunches but hasn’t done it consistently this season. It would always be difficult for the defense to keep up that pace for 20 weeks, and Sunday’s ugly showing against Jordan Love’s Packers may have been the first sign of slippage. It was easily the worst defensive performance of the season for the defending Super Bowl champs. The defense set season-worst marks in total expected points added allowed, EPA allowed per play, and success rate allowed. Green Bay’s offense scored on nearly every possession and was successful in both early- and late-down situations. The Chiefs defense was thoroughly outplayed. Even after Sunday’s setback, Kansas City ranks near the league’s top in most defensive metrics. This defense is still excellent. But defensive performance is naturally volatile week to week and even more so later in the year, as attrition builds. On Sunday, the Chiefs lost two key contributors in safety Bryan Cook (ankle) and linebacker Drue Tranquill (concussion), which will necessitate major adjustments from defensive coordinator Steve Spagnuolo ahead of next week’s showdown with the Bills. On top of that, opponents now have more tape of Spagnuolo’s defense. As offenses get a better understanding of his play-calling tendencies, some of his tricks may lose effectiveness. With Josh Allen up next on the schedule, the defense won’t have to wait long before its latest big test. If we get a repeat of what happened on Sunday night in Green Bay and the offense remains inconsistent, it might be time to panic in Kansas City. Imagine asking this question a month ago. The Lions were running away with the division, and Jared Goff was forcing his way into MVP conversations. Meanwhile, Love’s first season as Green Bay’s starter had hit rock bottom, and the inexperienced quarterback had been inaccurate and indecisive. But over the past month, he’s not only been the division’s best quarterback. It hasn’t been particularly close. If you widen the scope to include the rest of the league, Love’s recent performance looks even more impressive. Over the past five weeks, he ranks second in EPA per dropback, behind Brock Purdy and Dak Prescott. He’s sixth in yards per dropback, sixth in success rate, and fourth among quarterbacks in PFF grading. And as impressive as the results have been, what Love is putting on tape is even more exciting. He’s executing Matt LaFleur’s offense even better than Aaron Rodgers did a season ago while adding the kind of playmaking flair we never saw from the aging quarterback in 2022. I’m not foolish enough to compare Love’s long-term prospects to those of the Hall of Fame quarterbacks who’ve played in Green Bay. Still, it’s hard not to draw stylistic comparisons when you watch Love throw from creative arm slots and make throws with unorthodox footwork. Jordan Love really did this on back to back plays... His poise under pressure is astounding. pic.twitter.com/z60FvxS02s That part of Love’s game separates him from a quarterback like Goff, who is thrown off whenever his pocket and throwing platform aren’t kept immaculately clean. That wasn’t a concern early in the season, when Detroit’s offensive line was mauling opponents every week, but the pass protection has regressed over the past month. Goff has been pressured on 38.1 percent of his dropbacks since Week 9. That’s the 11th-highest rate in the league over that time, and things could get worse after center Frank Ragnow left the Lions’ Sunday win in New Orleans with a knee injury. It’s looking like Ragnow avoided a significant injury, but Goff’s batterymate is expected to be sidelined as the team heads into a tricky two-game stretch against an improving Chicago team and a hot Broncos team. If Detroit drops either of those games, the NFC North race will get awfully interesting down the stretch. The Lions currently lead the division by three games, but Green Bay won’t face another team with a winning record, and Detroit still has a matchup with the Cowboys left on the schedule. Time isn’t on Green Bay’s side, but the schedule–and possibly the QB matchup—favors the Packers. If you can bottle up whatever the Eagles defense did in the first quarter of Sunday’s game, you might have a chance. Philadelphia’s defense swarmed the 49ers early on, destroying the run game and other early-down tricks and putting Purdy into obvious passing situations. San Francisco looked overwhelmed, and the game was moving too fast for its young quarterback. After the opening 15 minutes, the 49ers had managed minus-6 yards. Things changed, obviously. Whether it was because the Eagles defense lost juice or Kyle Shanahan found the right buttons to press, once it clicked for the 49ers, there was little Philly could do to stop what is arguably the greatest collection of offensive talent this league has ever seen. It feels like it’s a new star every week for the offense, but it was a total team effort during Sunday’s drubbing of the Eagles. I don’t even know where to start? How about with Deebo Samuel, who backed up all of his offseason talk with a dominant performance headlined by this 48-yard catch and run? this single play describes Deebo Samuel's game perfectly the power to shrug off an immediate LB tackle the speed to keep DBs away pic.twitter.com/sJuJEMZP9g Christian McCaffrey chipped in with 93 rushing yards and a score. George Kittle and Brandon Aiyuk were both chain movers. And, oh yeah, Purdy threw four touchdowns and averaged more than 11 yards per attempt. And, still, the most impressive offensive performance may have come from left tackle Trent Williams, whose number was called anytime the 49ers needed to pick up a first down on the ground. There is no limit on what this 49ers offense can do, especially when it’s operating ahead of the chains and Shanahan can dial up his misdirection plays that are predicated on the threat of the run. But Sunday’s game did show the path to slaying San Francisco’s multiheaded monster: If a defense can win big on first down with negative plays, it can negate the play-calling advantages that Shanahan typically provides. Those jet motions, formational shifts, and play-action fakes aren’t nearly as effective when the defense isn’t worried about run fits. The 49ers will still own the personnel advantage in almost every instance, but at least the schematic advantages are reduced. You’re not totally destroying the invading alien ship, but hey, the shields are down now! Winning the early-down matchup is easier said than done, of course. It requires not only the personnel to win one-on-ones across the field but also a sharp defensive mind. Fortunately for football nerds, San Francisco’s Week 16 opponent, the Baltimore Ravens, checks both of those boxes. (I’m fully expecting the 49ers to steamroll over their next two opponents, the Seahawks and Cardinals.) If Mike MacDonald, the NFL’s best defensive coordinator, doesn’t have the players and tactics to slow down the 49ers, then we might as well hand them the Lombardi Trophy right now. The clusterfuck at the top of the AFC standings just got more clustered and more fucked after Sunday’s slate. Assuming the Jaguars take care of business against Jake Browning’s Bengals on Monday, there are now four teams with at least a 20 percent chance of landing home field advantage throughout the playoffs: Kansas City has the longest odds of earning the top seed, but it has the most favorable schedule. Next week’s game against Buffalo is its last remaining game against a team without a losing record, and the other three teams play one another, with Jags-Ravens set for Week 15 and Ravens-Dolphins coming the week after. As dire as things look for Kansas City, it could end up in a familiar place when the season ends: at the top of the conference and playing at home in January. Neither team scored a touchdown on Sunday—Buffalo was on a bye, to be fair—but both were big winners this week. Had the Colts dropped an overtime game in Tennessee, it would have been a perfect weekend for two of 2023’s biggest disappointments, but losses by Denver, Cleveland, Pittsburgh, and New York still provide both the Chargers and Bills with a little hope going forward. Buffalo has the most straightforward path to a postseason berth. The Bills are just a game behind the Browns and Colts for the last spot in the playoff field, and both of those teams are dealing with major concerns at quarterback. Cleveland had to bring Joe Flacco off the couch to boost its injury-plagued QB room, and the Colts have to overcome Gardner Minshew’s reckless play every week. As wonky as the Bills offense has been this season, quarterback play has never been an issue. The schedule, on the other hand, is a major concern. Buffalo is in the middle of a brutal stretch that won’t let up before the playoffs. A home game against the Cowboys follows next week’s trip to Kansas City. That’s followed by what could be an elimination game against the Chargers on the eve of Christmas Eve. Los Angeles should come into the crucial game on a high. It’ll get a beatable Broncos team at home next week, followed by a road game against the Raiders before the showdown with Buffalo. It’s conceivable, if not likely, that the Chargers will have a better record when the two teams meet in late December. I feel like a sucker talking myself into this team (again), but the underlying numbers, including the conference’s seventh-best point differential, suggest that the Chargers are of playoff caliber. The defense has shown signs of improvement, and Justin Herbert had been playing elite-level football before Sunday’s rain-soaked mess in New England. Buffalo’s playoff odds sit at 14 percent as I’m writing this, per The New York Times . The Chargers have a 7 percent chance. But those numbers don’t consider that these teams employ Josh Allen and Justin Herbert. More crucially, they don’t consider that Flacco, Minshew, Russell Wilson, and Mitchell Trubisky are the quarterbacks standing in their way of a playoff push. Don’t count the Bills and Chargers out yet. Depending on how you feel about Seattle this season, he already has. Prescott kicked down the doors of any MVP debates with another near-perfect performance in a win over the Seahawks on Thursday, continuing the best stretch of play we’ve ever seen from the Cowboys quarterback. It’s not like we haven’t seen Prescott go on an extended heater before. As much shit as he gets for his team’s failures, he has been one of the NFL’s consistent producers at the quarterback position. But this latest stretch just feels different. It could end at any time because this level of play would be difficult for any quarterback to sustain, but it feels like Prescott has finally put it all together. He’s still as sharp as ever before the snap, when he basically calls the offense from the line of scrimmage, and he’s just not making any mental errors after it. On top of that, we’ve seen the return of Dak’s early-career creativity. Because he’s been a pocket passer throughout his NFL career, it’s easy to forget that he entered the league as a dual threat quarterback after playing for Dan Mullen at Mississippi State. Over the past few months, Prescott has leaned on his mobility instead of forcing passes into tight windows. His interceptions are down, and productive, chain-moving scrambles have replaced them. Prescott has looked like an MVP outside of the high-profile stinker against San Francisco. The only question about his case is the level of competition he’s faced, but that will change over the next few weeks with games against Philadelphia, Buffalo, Miami, and Detroit left on the schedule. It’s a tough slate for Dallas as a whole, but from a quarterback’s perspective, at least, it’s not the most daunting test. All of these teams have mediocre pass defenses by EPA and success rate, so the Cowboys should be able to move the ball through the air in these games. So to answer the question: Yes, Prescott should be able to keep this up against the good teams, but we’ll have to wait for January to see him against the only defense that has been able to slow him down these past few months. Rodgers returned to Jets practice this week, triggering a 21-day window for his possible return from what many assumed was a season-ending Achilles injury. But the veteran QB has said that he’d return this season only if New York’s playoff hopes were still alive, and after Sunday’s dreadful 13-8 loss to the Falcons, those hopes are now on life support. Per The New York Times , the Jets have a 1 percent chance of making the playoffs, and that number will drop down to a big fat 0 if they lose either of their next two games against the Texans and Dolphins. In other words, that sucker is dropping down to a big fat 0 very soon. In the meantime, Rodgers will get an extra week to pretend that a return in 2023 is possible, but let’s face it: The Jets were done as soon as they decided on starting Tim Boyle two weeks ago. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again.","pubDate":"2023-12-04 19:17:45","image_url":"https://cdn.vox-cdn.com/thumbor/DOSaELL24wGrSbqJPdTdeWicPZ0=/24x0:1091x800/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/72930163/QuestionsPlayoffsRace_Getty_AP_Ringer.0.jpg","source_id":"theringer","source_priority":2702,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f69edd6366edb58cf1b887943961200d","title":"Apugo Commends NFF Football Stakeholders Workshop","link":"https://promptnewsonline.com/apugo-commends-nff-football-stakeholders-workshop/?utm_source=rss&utm_medium=rss&utm_campaign=apugo-commends-nff-football-stakeholders-workshop","keywords":["Sports","Football stakeholders"],"creator":["Editor"],"video_url":null,"description":"By Andrew Abah, Abuja The President of Super Star Football Academy Hon. Victor Apugo said his Academy has a solid background and the best in Uyo having the best sporting facilities for the students Apugo who spoke in Abuja during the FIFA Talent Development Scheme for Football Stakeholders Workshop , commended NFF for putting up [...] The post Apugo Commends NFF Football Stakeholders Workshop first appeared on Prompt News.","content":"The President of Super Star Football Academy Hon. Victor Apugo said his Academy has a solid background and the best in Uyo having the best sporting facilities for the students Apugo who spoke in Abuja during the FIFA Talent Development Scheme for Football Stakeholders Workshop , commended NFF for putting up such programme which has broadened the knowledge of grassroot coaches and academies. He said the programme has enriched on how to run his academy effectively . ” I manage one of the best academies if not the best in Uyo. The Workshop has taught me to be more effective and how to identify the young talents at the lower level of football. I organise scouting program with invitation of foreign football scout.”. Apugo also emphasised the need for the NFF to regulate the prolification of academies in the country . ” I am happy NFF President Ibrahim Gusau has made it clear that all academies will henceforth registered with the football house through the States FA to avoid claims and counter claims of players. I wish also that NFF should have this kind of workshop yearly “. Said Apugo.","pubDate":"2023-12-04 19:17:21","image_url":"https://promptnewsonline.com/wp-content/uploads/2023/06/Football-e1695568140181.jpg","source_id":"promptnewsonline","source_priority":7829578,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e1ee3194de917dd6b31819a7601b9aeb","title":"FA klaagt Manchester City aan na wangedrag van woedende Haaland en teamgenoten","link":"https://www.voetbalprimeur.nl/nieuws/1165948/city-aangeklaagd-na-wangedrag-spelers-tegen-spurs.html","keywords":["Nieuws","Premier League","Manchester City","Tottenham Hotspur","Erling Haaland"],"creator":["info@voetbalprimeur.nl (VoetbalPrimeur)"],"video_url":null,"description":"De Engelse voetbalbond heeft Manchester City aangeklaagd. De reden: het gedrag van enkele spelers tijdens het spectaculaire gelijkspel met Tottenham Hotspur (3-3) van afgelopen zondag.","content":"De Engelse voetbalbond heeft Manchester City aangeklaagd. De reden: het gedrag van enkele spelers tijdens het spectaculaire gelijkspel met Tottenham Hotspur (3-3) van afgelopen zondag. Artikel verder na advertentie Tijdens die wedstrijd werd een aantal City-spelers woedend toen scheidsrechter Simon Hooper in de allerlaatste minuut verzuimde de voordeelregel toe te passen. Daardoor kon aanvaller Jack Grealish bij een 3-3 gelijke stand niet op de Spurs-goal afstomen. Een laatste kans op de overwinning werd de ploeg van manager Pep Guardiola zodoende ontnomen. BREAKING: Manchester City have been charged by the FA for failing to control their players after surrounding referee Simon Hooper in the 94th minute of their draw against Tottenham. pic.twitter.com/PMW33z7tGk Na de beslissing bestormde het halve City-elftal scheidsrechter Hooper. Onder hen bevond zich ook spits Erling Haaland , die er op z'n zachtst gezegd niet in slaagde om zijn woede te verbergen. De FA (Football Association) is van mening dat de regerend landskampioen er niet in is geslaagd om ervoor te zorgen dat de spelers zich naar behoren hebben gedragen. City heeft tot komende donderdag om te reageren op de aanklacht. Artikel verder na advertentie","pubDate":"2023-12-04 19:16:48","image_url":"https://webp.vp.cdn.pxr.nl/news/2023/12/04/9baea453e7b36b67a275269a73b118d77cdf755b.jpg?width=1200","source_id":"voetbalprimeur","source_priority":653815,"country":["netherland"],"category":["sports"],"language":"dutch"},{"article_id":"0bae64c89e70e6ad863da6f7355a4ade","title":"EPL refuse to punish referee after Man City vs Tottenham controversy","link":"https://dailypost.ng/2023/12/04/epl-refuse-to-punish-referee-after-man-city-vs-tottenham-controversy/","keywords":["Sport","EPL","Man Utd vs Tottenham"],"creator":["Ifreke Inyang"],"video_url":null,"description":"The Premier League have decided not to suspend Simon Hooper, despite his late decision not to play advantage for Manchester City against Tottenham. Hooper stopped play despite Jack Grealish running through on goal. He then awarded a free-kick for a foul on Erling Haaland, who had gotten up to play the pass to Grealish. City […] EPL refuse to punish referee after Man City vs Tottenham controversy","content":"Daily Post Nigeria EPL refuse to punish referee after Man City vs Tottenham controversy Home News Politics Metro Entertainment Sport Sport EPL refuse to punish referee after Man City vs Tottenham controversy Published on December 4, 2023 By Ifreke Inyang The Premier League have decided not to suspend Simon Hooper, despite his late decision not to play advantage for Manchester City against Tottenham. Hooper stopped play despite Jack Grealish running through on goal. He then awarded a free-kick for a foul on Erling Haaland, who had gotten up to play the pass to Grealish. City have now been charged by the Football Association for failing to control their players, with Haaland particularly furious at the final whistle. Hooper has been assigned to Liverpool’s game at Sheffield United on Wednesday. The Premier League view his mistake as a human error, and he will not be demoted. He has been previously, as he failed to award a penalty for Wolves against Manchester United earlier this season. Related Topics: EPL Man Utd vs Tottenham Don't Miss Niger Tornadoes trio doubtful for Remo Stars clash You may like EPL: Glen Johnson speaks on ex-Chelsea forward joining Man Utd EPL: Brazil reveals goalkeeper to replace Onana at Man Utd once Ratcliffe arrives EPL: Fulham must start winning games – Iwobi EPL: Fabrizio Romano confirms first manager to be sacked EPL: Poor decision – Jody Morris criticizes Chelsea star after latest win EPL: Gary Neville, Micah Richards pinpoint why Manchester City are dropping points this season Advertise About Us Contact Us Privacy-Policy Terms Copyright © Daily Post Media Ltd","pubDate":"2023-12-04 19:16:31","image_url":"https://dailypost.ng/wp-content/uploads/2023/12/MixCollage-04-Dec-2023-08-22-PM-5561.jpg","source_id":"dailypost","source_priority":55306,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"6d456d8d0b6b764077c6b43e2fae1ab0","title":"Αστέρας Τρίπολης: Εκτός οι Τζουκάνοβιτς, Γκος","link":"https://www.gazzetta.gr/football/kypello-elladas/2281159/asteras-tripolis-ektos-oi-tzoykanobits-gkos","keywords":["Ποδόσφαιρο","Κύπελλο Ελλάδας","Αστέρας Τρίπολης","Newsroom"],"creator":null,"video_url":null,"description":"Ο Αστέρας Τρίπολης ολοκλήρωσε την προετοιμασία του για το αυριανό παιχνίδι Κυπέλλου με τον Πανσερραϊκό, όπου δεν υπολογίζονται οι Τζουκάνοβιτς και Γκος.","content":"Χωρίς απρόοπτα ολοκλήρωσε ο Αστέρας Τρίπολης την προετοιμασία του για το αυριανό (5/12) ματς Κυπέλλου με τον Πανσερραϊκό , που θα είναι το πρώτο του ζευγαριού για τη φάση των «16». Ο Μίλαν Ράσταβατς άφησε εκτός αποστολής τους Τζουκάνοβιτς και Γκος, όμως επιστρέφουν οι Χουχούμης, Γκρόζντανιτς, Ντιαρά, Κωστέας. Αυτή αποτελείται από τους εξής: Παπαδόπουλος, Σγουρής, Γραμματικάκης, Γκαρθία, Χουχούμης, Καρμόνα, Πίτσου, Καστάνιο, Αλβαρες, Γκρόζντανιτς, Βαλιέντε, Μπαρτόλο, Μουνάφο, Σουρλής, Ντιαρά, Σίτο, Αλάγκμπε, Ζουγλής, Μιριτέλο, Κρέσπι, Μάντζης, Καλτσάς, Κωστέας.","pubDate":"2023-12-04 19:34:17","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"7c65c968b52c4e2d63f1c9654d12d237","title":"Montse Tomé y Aitana Bonmatí: una bronca en el vestuario, un cambio a destiempo y una llamada pública de atención","link":"https://elpais.com/deportes/futbol/2023-12-04/montse-tome-y-aitana-bonmati-una-bronca-en-el-vestuario-un-cambio-a-destiempo-y-una-llamada-publica-de-atencion.html","keywords":["Fútbol","Futbolistas","Entrenadores","Competiciones","Deportes","Selección española","Selección española fútbol","Bonmatí","Montse Tomé","Jennifer Hermoso"],"creator":["Nadia Tronchoni"],"video_url":null,"description":"La seleccionadora refuerza su autoridad en el vestuario de España y tras perder ante Italia: “Equipo somos todos, todos tenemos que sumar”","content":"Aitana Bonmatí volvió a entrenarse ayer. No sufría ninguna lesión ni dolencia grave. Pero se ausentó del último entrenamiento con el equipo nacional por un resfriado. Tampoco se sintió bien, así lo explicó ella misma, tras jugar el primer tiempo contra Italia el viernes. Y pidió el cambio. Lo pidió tan tarde que al staff de España le costó reaccionar; aquello provocó que también se avisara tarde a la delantera Esther González, que ni siquiera había calentado, de que tenía que saltar al campo y en esos minutos en que la selección jugó en inferioridad numérica, el rival marcó: 1-1. Y el vía crucis del encuentro no había hecho más que comenzar. El partido terminó 2-3. La Roja contaba su primera derrota en los partidos de clasificación para la Nations League. Aunque, pese a todo, la derrota de Suecia les permitió irse a dormir con su billete para la final four del próximo febrero en el bolsillo. En todo este embrollo, cuyo culebrón se ha alargado hasta la previa del último partido de la liguilla, este martes (España se mide a Suecia, a las 19.00; La 1), no explicó la Balón de Oro que instantes antes de pedir al cuerpo técnico ser sustituida y no disputar la segunda parte se había enzarzado en una discusión con la seleccionadora Montse Tomé, que supuestamente le habría pedido más intensidad a la futbolista. La reacción de Aitana estuvo fuera de lugar. “Se pasó de frenada”, confiesan fuentes cercanas al vestuario. “Ella es vehemente, super competitiva”, explican en Las Rozas. Y en las declaraciones posteriores al partido, la entrenadora, que lleva exactamente tres meses en el cargo y sustituye al destituido Jorge Vilda, no tuvo inconveniente en señalar a Bonmatí: “Empezamos con 10 porque Aitana avisa tarde de que no está disponible”. La jugadora, por su parte, asume que avisa tarde, pero no se encontraba bien y prefirió que otra jugadora entrara en su lugar. “Las sensaciones no eran muy buenas, llevaba unos días con malestar, resfriada, mucha mucosidad. El descanso a menudo sirve para reposar esas sensaciones y ver cómo te sientes”, explica su entorno. Y el desenlace del partido acaba animando la crisis. Bonmatí, señalada como la mejor jugadora de España en el Mundial, la mejor futbolista del 2023 según France Football , siente que hubo un problema y que ahora se busca un culpable. “En un equipo hay intercambio de opiniones. Y a menudo se hace una montaña de situaciones muy cotidianas en el día a día de un vestuario. Cierto que, del mensaje de la seleccionadora, se entiende que la culpabiliza”, indican fuentes cercanas. Que España jugara con diez durante los tres minutos en que encajó el gol del empate y perdió el control del partido no puede ser culpa de una jugadora. “Que en la Federación no se trabaje con tranquilidad tampoco ayuda a buscar la excelencia”, apuntan fuentes del vestuario. Dos voces diferentes de la selección asumen que en el equipo femenino se trabaja con miedo después de la crisis que devino tras el beso del ya expresidente Luis Rubiales a la delantera Jenni Hermoso —quien, por cierto, ha recuperado sus galones como cuarta capitana del equipo—: “Todo el mundo quiere que nos salgan mal las cosas”, admiten desde Las Rozas. En ese camino —hacia la profesionalidad y la naturalidad— en que el equipo está inmerso desde agosto, la seleccionadora Tomé trata, con declaraciones públicas como las del viernes, de ganarse la autoridad y el respeto del vestuario. “Desde que comenzamos en septiembre el camino no ha sido fácil. Pero hemos conseguido imponernos con profesionalidad, trabajo, humildad. Me gusta mucho esta palabra. Me gusta que todos y todas podamos serlo. Estamos en una línea positiva. No nos gusta perder y hay cosas que tenemos que ajustar, pero estamos en el camino”, declaró en la conferencia de prensa de ayer. No está claro si las formas en que lo intentó tras el partido del viernes, de las que no quiso desdecirse ayer, son las más convincentes, pero la mayoría de fuentes consultadas coinciden en que ese episodio no le pasará factura. “Montse lleva cuatro días y a veces le falta capacidad comunicativa. También picardía o ese recurrir a la picaresca para evitar que empiece el segundo tiempo con una jugadora menos. Hay muchas maneras de evitar no salir con diez”. Con polémica incluida, ni Tomé, ni Laia Aleixandri, que atendió a los medios en La Rosaleda, de Málaga, donde se espera hoy una muy buena entrada, perdieron el foco de lo que les importa: “El vestuario es lo importante, el equipo, y todo lo que ocurre dentro es bueno que lo cuidemos, que lo protejamos y que sea nuestro. Nosotros somos super exigentes y super profesionales, queremos lo mejor para todos. Ya estamos pensando en Suecia. Nuestra mente debe estar solo en eso; equipo somos todos y todos tenemos que sumar”, apuntaba Tomé. “Debemos pensar en el partido. Estamos con una ambición tremenda. Siendo una selección campeona debemos tener exigencia máxima. Lo que sucedió no puede volver a suceder”, añadía Aleixandri. Puedes seguir a EL PAÍS Deportes en Facebook y X , o apuntarte aquí para recibir nuestra newsletter semanal . Redactora jefa de la sección de Deportes y experta en motociclismo. Ha estado en cinco Rally Dakar y le apasionan el fútbol y la política. Se inició en la radio y empezó a escribir en el diario La Razón. Es Licenciada en Periodismo por la Universidad de Valencia, Máster en Fútbol en la UV y Executive Master en Marketing Digital por el IEBS.","pubDate":"2023-12-04 19:34:02","image_url":"https://imagenes.elpais.com/resizer/FvYWVVsNOfs-49cY9-xl-zvZlys=/arc-anglerfish-eu-central-1-prod-prisa/public/NV53ATMUJJANVEJNZNSNXKDFI4.jpg","source_id":"elpais","source_priority":2530,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"a741dda2e9567d6ef3ce45223d13a9df","title":"Λουτσέσκου: «Αν βρούμε παίκτες ικανούς να αναβαθμίσουν το ρόστερ μας, θα τους πάρουμε»","link":"https://www.gazzetta.gr/football/superleague/2281158/loytseskoy-broyme-paiktes-ikanoys-na-anabathmisoyn-roster-mas-tha-toys","keywords":["Ποδόσφαιρο","Superleague","ΠΑΟΚ","Λαμία","Ραζβάν Λουτσέσκου","Newsroom"],"creator":null,"video_url":null,"description":"Την ικανοποίησή του για τη νίκη επί της Λαμίας και κυρίως την εμφάνιση, έμεινε ο Ραζβάν Λουτσέσκου με τον τεχνικό του ΠΑΟΚ να αναφέρει πως αν βρεθούν παίκτες ικανοί να κάνουν την διαφορά θα αποκτηθούν.","content":"Εξαιρετικά ενδιαφέρουσα ήταν ακόμα μία συνέντευξη Τύπου του Ραζβάν Λουτσέσκου . Ο Ρουμάνος τεχνικός μιλώντας μετά τη νίκη του ΠΑΟΚ επί της Λαμίας , αναφέρθηκε στο ματς, αλλά στα μεταγραφικά επισημαίνοντας πως αν βρεθούν ποδοσφαιριστές που θα μπορούν να κάνουν την διαφορά και να αναβαθμίσουν το υπάρχον ρόστερ, τότε θα αποκτηθούν. Αναλυτικά ο τεχνικός του ΠΑΟΚ ανέφερε τα εξής: Για την εικόνα της ομάδας του και το τι ήταν το πιο σημαντικό σε αυτό το ματς: «Περίμενα να σκοράρουμε περισσότερα γκολ, είχαμε αρκετές ευκαιρίες και έπρεπε να τις εκμεταλλευτούμε. Όταν σου δίνονται αυτές οι ευκαιρίες πρέπει να τις κάνεις γκολ. Είχαμε απέναντι μας μια ομάδα που φέτος έχει παίξει πολύ καλά και έχει δημιουργήσει προβλήματα, εμείς προερχόμασταν από ένα δύσκολο και απαιτητικό ματς στην Φρανκφούρτη αλλά δείξαμε καλή νοοτροπία και είχαμε την σωστή ενέργεια στον αγωνιστικό χώρο. Πήραμε μια νίκη στη Γερμανία που θα μπορούσε να φέρει προβληματισμούς, αλλά ήταν μια πραγματικά πολύ καλή στάση από τους παίκτες σήμερα. Η νίκη μας σήμερα είναι απολύτως λογική γιατί ήμασταν καλύτεροι σε όλους τους τομείς». Για το γεγονός ότι τα σέντερ φορ του ΠΑΟΚ έχουν σκοράρει 10 γκολ από τα 51 συνολικά μέχρι στιγμής: «Θα σας πω ότι τα άλλα 41 γκολ τα έχουν βάλει παίκτες μας επίσης. Δεν έχει σημασία ποιος σκοράρει, ο στόχος είναι να μπει μέσα στο γήπεδο να παίξει καλά, να κερδίσει και να βάλει γκολ. Αν οι άλλοι έχουν βάλει 41 γκολ σημαίνει ότι έχουν κάνει καλή δουλειά και οι επιθετικοί επίσης. Γιατί τα γκολ προέρχονται και από ενέργειες των επιθετικών που δημιουργούν χώρους με τις κινήσεις τους. Έχουν συμμετοχή στα γκολ όλοι οι παίκτες και αυτό είναι το σημαντικό, γιατί οι επιθετικοί μας βοηθάνε φτιάχνοντας χώρους για τους άλλους. Είναι μια τεράστια δουλειά τόσο όταν έχουμε την μπάλα, όσο και όταν δεν την έχουμε, έχουν πολύ μεγάλη συνεισφορά οι επιθετικοί μας και δεν κρίνονται μόνο από τα γκολ τους». Για το τι είπε στον Κωνσταντέλια όταν τον έπιασε η κάμερα να γελάει και να του μιλάει: «Αφορούσε κάτι για τα επόμενα ματς. Αν ήταν κάτι άλλο θα σας το έλεγα». Για το αν θέλει να βελτιωθεί κάτι στην ομάδα σε μια περίοδο που φαίνονται να πηγαίνουν όλα καλά: «Έχει να κάνει με το θέμα το πνευματικό, το πώς θα πηγαίνουμε από το ένα ματς στο άλλο. Πρέπει να μείνουμε συγκεντρωμένοι. Μέσα σε 11 μέρες έχουμε τέσσερα παιχνίδια. Είχαμε αυτό το ματς με την Άιντραχτ, τώρα παίξαμε με την Λαμία, παιχνίδια που το καθένα τους σε κάνουν να ξοδεύεις πολύ πνευματική ενέργεια. Πρέπει να αντιμετωπίζουμε κάθε παιχνίδι ως τελικό, πρέπει να ξεχνάμε τα αποτελέσματα το επόμενο πρωί κιόλας. Πήραμε μεγάλη χαρά στην Φρανκφούρτη και έπρεπε να βρούμε ισορροπία. Και τώρα με την Λαμία πρέπει άμεσα να ξεχάσουμε τη νίκη και να αφοσιωθούμε στο ματς της Πέμπτης σε μια διοργάνωση που θέλουμε να φτάσουμε και πάλι στον τελικό. Η ομάδα βήμα βήμα γίνεται καλύτερη, πιο δυνατή γιατί μεγαλώνει ο βαθμός προσαρμογής των νέων παικτών. Όλη αυτή την περίοδο έχουμε δύσκολα παιχνίδια και η χημεία μας έχει βελτιωθεί πάρα πολύ. Με κάνει να έχω αυτοπεποίθηση όλο αυτό, με τις σχέσεις ανάμεσα στους παίκτες και το κλίμα που υπάρχει. Έχουμε πάρα πολλούς παίκτες που συμμετέχουν σε όλο αυτό που κάνουμε φέτος. Είχαμε οκτώ αλλαγές στην ενδεκάδα σε σχέση με το προηγούμενο και τα παιδιά ανταποκρίθηκαν πολύ καλά». Για τον Τάισον, για το αν μπορεί να γίνει παράδειγμα τους νέους παίκτες και το αν το περίμενε να έχει αυτή την εικόνα φέτος: «Πέρσι τον χειμώνα μου προτάθηκε από τον Γιώργο Σαββίδη αυτός ο παίκτης και είπα αμέσως ναι. Απάντησα ναι γιατί ξέρω τι παίκτης είναι, τι ποιότητα έχει και την θέληση που έχει για να παίζει. Τον γνωρίζω γιατί τον είχε παίκτη ο πατέρας μου, γνώριζα την αγάπη του για το άθλημα και για την προπόνηση. Στην Βραζιλία είχε έναν τραυματισμού και χρειαζόταν χρόνο, άρχισε να προσαρμόζεται και να δείχνει την τεράστια ποιότητα. Παίζει ένα απίστευτο ποδόσφαιρο. Όσο για το αν μπορεί να γίνει παράδειγμα, αυτός και ο Αντρέ είναι πάντα ανάμεσα στους νέους παίκτες και δεν ξέρω αν ο Τάισον και ο Αντρέ είναι αυτοί οι... νέοι ή αν είναι οι νέοι ο Κωνσταντέλιας και ο Κουλιεράκης. Καμιά φορά είναι και το ανάποδο! Έχουν ψυχή νέων παιδιών ο Τάισον και ο Αντρέ είναι πολύ σημαντικοί για το γκρουπ που έχουμε φτιάξει. Δεν ξέρω τι να σας πω για την ανανέωση του Ταισον. Παίζουμε ανά τρεις μέρες, κάθε μέρα έχουμε πολύ δουλειά. Ξυπνάω πέντε το πρωί για να αναλύσω τα παιχνίδια. Η διοίκηση γνωρίζει τι θέλω και τι πρέπει να κάνει και με το θέμα του Τάισον. Αν αρχίσουμε να χάνουμε την συγκέντρωση μας με διάφορα άλλα θέματα τότε θα χάσουμε αυτά που έχουμε καταφέρει μέχρι σήμερα. Πρέπει να προστατεύσω την δουλειά που κάνουμε. Ξέρω πάρα πολύ καλά πως αν παρεκκλίνεις είναι εύκολο να χάσεις τη συγκέντρωση. Καταλαβαίνω την ανάγκη των δημοσιογράφων για θέματα, αλλά πρέπει να μείνουμε σε αυτό και να είμαστε συγκεντρωμένοι στα παιχνίδια. Αν με ρωτάτε για το αν ο Τάισον πρέπει να είναι εδώ, τότε θα σας πω ότι ναι πρέπει να είναι. Ο Ταισον είναι ένας από τους καλύτερους παίκτες μας, ο αγαπημένος της εξέδρας, είναι χαρούμενος εδώ». Για την συζήτηση με τον Σαββίδη με τα μετεγγραφικά και τη δική του επιθυμία: «Είστε εσείς από το υπάρχον ρόστερ; Αν μπορεί να γίνει κάτι καλύτερο και μπορούμε να γίνουμε καλύτεροι, τότε θα είναι καλό για εμάς. Αν υπάρξει κάτι καλύτερο θα δούμε τι μπορεί να γίνει. Αυτό ισχύει για όλες τις ομάδες, αν έχουμε πιθανότητα να βρούμε ικανούς παίκτες για να κάνουν αναβάθμιση στο ρόστερ, τότε θα θέλαμε να το κάνουμε».","pubDate":"2023-12-04 19:31:03","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"07a794b4b81913c786349db2a383b2ad","title":"Jeffery Simmons is expected to miss multiple weeks with knee injury","link":"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jeffery-simmons-is-expected-to-miss-multiple-weeks-with-knee-injury","keywords":null,"creator":null,"video_url":null,"description":"Titans running back Derrick Henry avoided a concussion on Sunday, but a key member of the defense didn't enjoy the same luck on the injury front.","content":"Titans running back Derrick Henry avoided a concussion on Sunday, but a key member of the defense didn’t enjoy the same luck on the injury front. Defensive tackle Jeffery Simmons left their overtime loss to the Colts with a knee injury early in the second half and was ruled out a short time later. On Monday, head coach Mike Vrabel said at his press conference that Simmons is expected to miss a couple of weeks while he recovers. Simmons had two tackles before leaving Sunday’s game. He has 44 tackles, 5.5 sacks, a forced fumble, and a fumble recovery in 12 games this season. Denico Autry, Teair Tart, Kyle Peko, Jaleel Johnson, and TK McClendon Jr. are the other defensive linemen on the 53-man roster in Tennessee.","pubDate":"2023-12-04 19:23:53","image_url":null,"source_id":"profootballtalk","source_priority":267,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"2a678e2e70373951016ea690bcfed850","title":"Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness","link":"https://www.dailymail.co.uk/sport/football/article-12824321/Arsenal-Mikel-Arteta-title-injuries-Ben-White-Takehiro-Tomiyasu.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SAMI MOKBEL: The north London club's promising position comes despite suffering a clutch of injuries to key players throughout the early weeks of the season.","content":"Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness Arsenal travel to Luton on Tuesday night looking to extend their lead at the top The Gunners have suffered several injuries to key players already this season Man City are vulnerable, but come the spring they will put on the afterburners. Leaders Arsenal must seize their moment now - Listen to It's All Kicking Off By Sami Mokbel for MailOnline Published: 13:52 EST, 4 December 2023 | Updated: 14:20 EST, 4 December 2023 e-mail View comments Arsenal head coach Mikel Arteta is carefully managing his title chasing squad’s training workload to ensure their championship charge stays on track. The Gunners are top of the Premier League , two points clear of second placed Liverpool after 14 matches. The north London club’s promising position comes despite suffering a clutch of injuries to key players throughout the early weeks of the season. Most recently key defenders Takehiro Tomiyasu and Ben White have been struck by injury concerns and are among those whose workloads are being meticulously monitored to ensure their availability ahead of hectic run of matches. Arteta says he will make a late decision on Tomiyasu’s availability ahead of Tuesday’s clash at Luton after the Japan international limped off with a suspected calf issue against Wolves on Saturday. Tomiyasu has undergone a scan. Mikel Arteta is managing his squad’s training load to ensure their title charge stays on track Defender Takehiro Tomiyasu limped off with a suspected calf issue against Wolves on Saturday afternoon putting his participation in Tuesday's game at Kenilworth Road vs Luton in doubt Your browser does not support iframes. The Arsenal head coach also said on Monday that White, whose recent availability has been impacted due to what Arteta says is a ‘muscular’ problem, is feeling ‘perfect’ following his fitness concerns. Arsenal have a long list of injury problems, with Thomas Partey, Emile Smith Rowe, Fabio Vieira and Jurrien Timber all currently unavailable leaving the Gunners stretched. And Arteta and his staff are acutely aware of the importance of ensuring his players are kept fresh - particular for the use Christmas schedule. Mail Sport also understands that certain players are using private sessions away from the club’s London Colney HQ to ensure their bodies are at optimum capacity. Last season, injuries at crucial parts of the season contributed to Arsenal eventually being overtaken by Manchester City; William Saliba, Gabriel Jesus and Olekandr Zinchenko all missing important matches last season. And the Gunners are ensuring they implement a training strategy that protects players ahead of the business end of the season. ‘It's still a huge marathon ahead of us,’ said Arteta during his press conference ahead of the game at Kenilworth Road. ‘The encouragement comes from watching the team play, watching them behave every day and how hungry and willing they are to approach every training session. That's what gives me encouragement.’ Arteta revealed that defender Ben White is feeling 'perfect' following his fitness concerns IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Mikel Arteta Japan Ben White Share or comment on this article: Arsenal on red alert over training workloads with Mikel Arteta carefully managing his stars after last season's title bid was derailed by injuries - and some players are using private sessions to ensure peak fitness e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-04 19:20:35","image_url":"https://i.dailymail.co.uk/1s/2023/12/04/18/78565655-0-image-a-6_1701715855113.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6fc6d6c8a994801cb34469d73af3a966","title":"Premier League : Mikel Arteta en admiration devant le club de Luton","link":"https://www.lefigaro.fr/sports/football/angleterre/premier-league-mikel-arteta-en-admiration-devant-le-club-de-luton-20231204","keywords":["Angleterre"],"creator":null,"video_url":null,"description":"Le coach d’Arsenal a déclaré qu’il admirait le club de Luton Town avant la rencontre de mardi entre son équipe et l’équipe promue.","content":"Le manager d'Arsenal, Mikel Arteta, a déclaré qu'il admirait Luton Town et son parcours \"remarquable\" pour accéder à la Premier League, ajoutant qu'il s'attendait à un match difficile à Kenilworth Road mardi. « C'est un endroit inspirant et ce qu'ils ont fait est remarquable. La façon dont ils l'ont fait et ce qu'ils transmettent est une histoire étonnante », a déclaré Arteta aux journalistes lundi. Arsenal a pris deux points d'avance sur Liverpool en tête du classement après sa victoire 2-1 sur Wolverhampton samedi, tandis que Luton, qui a gravi les échelons de la non-ligue à la Premier League en neuf ans, est 17e pour sa première saison dans l'élite, à deux points de la zone de chute. « Les joueurs de Luton méritent tout le crédit qu'ils ont reçu de la saison dernière et des matches serrés qu'ils ont eus cette saison », a déclaré Arteta. « Les deux équipes sont en train de s'affronter dans le cadre de la Coupe du Monde. Rob Edwards est un grand entraîneur et une personne très spéciale. Cela se voit à la façon dont son équipe joue. Je pense que c'est une très bonne équipe et cela ne se reflète pas dans ses résultats. C'est une source d'inspiration de jouer contre eux et nous sommes prêts à y aller ».","pubDate":"2023-12-04 19:18:54","image_url":"https://i.f1g.fr/media/cms/1660x1153_crop/2023/12/04/d9e7e8f1feedd6709af2e357b62385505c469782574f1b0da64f4aa23fbe4e32.jpg","source_id":"lefigaro","source_priority":17866,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"26fc809e9a4e3d52409c0a4f47501dd3","title":"Eight Questions That Will Shape the NFL Playoff Race","link":"https://www.theringer.com/nfl/2023/12/4/23987957/playoff-race-jalen-hurts-patrick-mahomes-kansas-city-chiefs-san-francisco-49ers","keywords":null,"creator":["Steven Ruiz"],"video_url":null,"description":null,"content":"It’s that time of the year. The calendar has flipped over to December. It’s getting dark before the late-afternoon games kick in. You’ve visited the playoff odds sites often enough that they’re the first suggestion from your browser when you start typing in the address bar. We’ve had to sit through a lot of bad football to get here, but the NFL’s playoff race has officially reached the homestretch. The Ringer ’s 2023 NFL Rankings Your hub for The Ringer ’s NFL rankings has arrived. Here we’ll feature our QB Rankings, Trade Value Rankings, and, of course, Power Rankings. Check back every week during the season as we put the league in order. All of that crappy, disjointed football we endured has left the playoff race jumbled on both sides of the bracket. There are massive fights at the top and bottom of the AFC standings, where three teams could be tied at the top with 9-3 records heading into Week 14. The wild-card race is more organized in the NFC, but San Francisco’s resounding win in Philly reopened the chase for the conference’s top seed. The Eagles remain in the driver’s seat, but their hands (talons?) are slipping off the wheel, with the Cowboys within a game of first place in the division ahead of next Sunday night’s matchup. There is plenty to sort out between now and the start of the postseason. Let’s try our best to clear up the picture by asking, and attempting to answer, eight questions that will shape the NFL’s playoff race. Sunday’s lopsided loss to the 49ers won’t derail Philadelphia’s season completely, but injury concerns for quarterback Jalen Hurts could do it if they continue to mount. Hurts briefly left the game to enter the concussion protocol, and while he did return, it’s clear that the Eagles star is far from 100 percent. Hurts has been dealing with a knee contusion since early October , which seems to have limited some of his explosiveness as a runner. But the more concerning effect can be found in the passing game, where Hurts has been a more reluctant scrambler while protecting the knee. That, combined with his tendency to hold on to the ball a bit longer, even when healthy, has put tremendous stress on the offensive line. The Eagles rank 27th in pressure rate allowed, per TruMedia, and many of those pressures have been created by Hurts himself deep into his dropbacks. Sunday’s game might have been the most extreme example of Hurts holding the ball for far too long. His average time to throw was 3.7 seconds, a season-high number that no doubt contributed to a 61.5 percent pressure rate (also a season high). It was the second week in a row in which Hurts was pressured on at least 50 percent of his dropbacks. He’s been pressured on 51 total dropbacks over the past two weeks, which leads the league, and his average time to throw on those plays is a whopping 4.41 seconds, per TruMedia, indicating that this increasing pressure rate isn’t the fault of Philly’s offensive line. And there were receivers open on some of those longer dropbacks, so we can’t blame it all on the play designs of first-year offensive coordinator Brian Johnson. If these extended plays were turning into positive gains more often, it wouldn’t be much of an issue, but many of them are turning into ineffective scrambles or throwaways. On Sunday, it was a bit of both. Hurts scrambled four times, with a success rate of 25 percent, and he didn’t pick up a first down on any of them. He also threw away the ball five times, adding to the tally of wasted downs and pushing him up to second in the NFL, with 29 throwaways on the season. Only struggling rookie Bryce Young has more (at 42!), per TruMedia. Even after a 10-2 start, the Eagles do not have much margin for error. The Cowboys are within a game of first in the division heading into next week’s rematch. If Hurts doesn’t adjust, which could require a healthier knee, that lead will be gone in a week, and the defending NFC champs will start their postseason on the road. Hurts’s uneven play isn’t Philly’s only concern after Sunday’s beatdown at the hands of the 49ers, but it’s definitely at the top of the list. Every other Kansas City loss this season has been a referendum on the state of the offense, but we can’t play that game after Sunday’s shocking home loss to Green Bay. The Chiefs scored only 19 points but did it in eight drives. One was a kneel down before the half, and the other was a desperation drive at the end of the game. So on six legitimate drives, Patrick Mahomes led his heavily scrutinized supporting cast to about 3.2 points per drive, which would lead the NFL on the season. This loss falls squarely on the defense. Related That’s the first time we’ve been able to say that about Kansas City this season. While both units have been in the top 10 in most efficiency metrics, the Chiefs have been better on the defensive side of the ball. That’s provided cover for an offense that can still score in bunches but hasn’t done it consistently this season. It would always be difficult for the defense to keep up that pace for 20 weeks, and Sunday’s ugly showing against Jordan Love’s Packers may have been the first sign of slippage. It was easily the worst defensive performance of the season for the defending Super Bowl champs. The defense set season-worst marks in total expected points added allowed, EPA allowed per play, and success rate allowed. Green Bay’s offense scored on nearly every possession and was successful in both early- and late-down situations. The Chiefs defense was thoroughly outplayed. Even after Sunday’s setback, Kansas City ranks near the league’s top in most defensive metrics. This defense is still excellent. But defensive performance is naturally volatile week to week and even more so later in the year, as attrition builds. On Sunday, the Chiefs lost two key contributors in safety Bryan Cook (ankle) and linebacker Drue Tranquill (concussion), which will necessitate major adjustments from defensive coordinator Steve Spagnuolo ahead of next week’s showdown with the Bills. On top of that, opponents now have more tape of Spagnuolo’s defense. As offenses get a better understanding of his play-calling tendencies, some of his tricks may lose effectiveness. With Josh Allen up next on the schedule, the defense won’t have to wait long before its latest big test. If we get a repeat of what happened on Sunday night in Green Bay and the offense remains inconsistent, it might be time to panic in Kansas City. Imagine asking this question a month ago. The Lions were running away with the division, and Jared Goff was forcing his way into MVP conversations. Meanwhile, Love’s first season as Green Bay’s starter had hit rock bottom, and the inexperienced quarterback had been inaccurate and indecisive. But over the past month, he’s not only been the division’s best quarterback. It hasn’t been particularly close. If you widen the scope to include the rest of the league, Love’s recent performance looks even more impressive. Over the past five weeks, he ranks second in EPA per dropback, behind Brock Purdy and Dak Prescott. He’s sixth in yards per dropback, sixth in success rate, and fourth among quarterbacks in PFF grading. And as impressive as the results have been, what Love is putting on tape is even more exciting. He’s executing Matt LaFleur’s offense even better than Aaron Rodgers did a season ago while adding the kind of playmaking flair we never saw from the aging quarterback in 2022. I’m not foolish enough to compare Love’s long-term prospects to those of the Hall of Fame quarterbacks who’ve played in Green Bay. Still, it’s hard not to draw stylistic comparisons when you watch Love throw from creative arm slots and make throws with unorthodox footwork. Jordan Love really did this on back to back plays... His poise under pressure is astounding. pic.twitter.com/z60FvxS02s That part of Love’s game separates him from a quarterback like Goff, who is thrown off whenever his pocket and throwing platform aren’t kept immaculately clean. That wasn’t a concern early in the season, when Detroit’s offensive line was mauling opponents every week, but the pass protection has regressed over the past month. Goff has been pressured on 38.1 percent of his dropbacks since Week 9. That’s the 11th-highest rate in the league over that time, and things could get worse after center Frank Ragnow left the Lions’ Sunday win in New Orleans with a knee injury. It’s looking like Ragnow avoided a significant injury, but Goff’s batterymate is expected to be sidelined as the team heads into a tricky two-game stretch against an improving Chicago team and a hot Broncos team. If Detroit drops either of those games, the NFC North race will get awfully interesting down the stretch. The Lions currently lead the division by three games, but Green Bay won’t face another team with a winning record, and Detroit still has a matchup with the Cowboys left on the schedule. Time isn’t on Green Bay’s side, but the schedule–and possibly the QB matchup—favors the Packers. If you can bottle up whatever the Eagles defense did in the first quarter of Sunday’s game, you might have a chance. Philadelphia’s defense swarmed the 49ers early on, destroying the run game and other early-down tricks and putting Purdy into obvious passing situations. San Francisco looked overwhelmed, and the game was moving too fast for its young quarterback. After the opening 15 minutes, the 49ers had managed minus-6 yards. Things changed, obviously. Whether it was because the Eagles defense lost juice or Kyle Shanahan found the right buttons to press, once it clicked for the 49ers, there was little Philly could do to stop what is arguably the greatest collection of offensive talent this league has ever seen. It feels like it’s a new star every week for the offense, but it was a total team effort during Sunday’s drubbing of the Eagles. I don’t even know where to start? How about with Deebo Samuel, who backed up all of his offseason talk with a dominant performance headlined by this 48-yard catch and run? this single play describes Deebo Samuel's game perfectly the power to shrug off an immediate LB tackle the speed to keep DBs away pic.twitter.com/sJuJEMZP9g Christian McCaffrey chipped in with 93 rushing yards and a score. George Kittle and Brandon Aiyuk were both chain movers. And, oh yeah, Purdy threw four touchdowns and averaged more than 11 yards per attempt. And, still, the most impressive offensive performance may have come from left tackle Trent Williams, whose number was called anytime the 49ers needed to pick up a first down on the ground. There is no limit on what this 49ers offense can do, especially when it’s operating ahead of the chains and Shanahan can dial up his misdirection plays that are predicated on the threat of the run. But Sunday’s game did show the path to slaying San Francisco’s multiheaded monster: If a defense can win big on first down with negative plays, it can negate the play-calling advantages that Shanahan typically provides. Those jet motions, formational shifts, and play-action fakes aren’t nearly as effective when the defense isn’t worried about run fits. The 49ers will still own the personnel advantage in almost every instance, but at least the schematic advantages are reduced. You’re not totally destroying the invading alien ship, but hey, the shields are down now! Winning the early-down matchup is easier said than done, of course. It requires not only the personnel to win one-on-ones across the field but also a sharp defensive mind. Fortunately for football nerds, San Francisco’s Week 16 opponent, the Baltimore Ravens, checks both of those boxes. (I’m fully expecting the 49ers to steamroll over their next two opponents, the Seahawks and Cardinals.) If Mike MacDonald, the NFL’s best defensive coordinator, doesn’t have the players and tactics to slow down the 49ers, then we might as well hand them the Lombardi Trophy right now. The clusterfuck at the top of the AFC standings just got more clustered and more fucked after Sunday’s slate. Assuming the Jaguars take care of business against Jake Browning’s Bengals on Monday, there are now four teams with at least a 20 percent chance of landing home field advantage throughout the playoffs: Kansas City has the longest odds of earning the top seed, but it has the most favorable schedule. Next week’s game against Buffalo is its last remaining game against a team without a losing record, and the other three teams play one another, with Jags-Ravens set for Week 15 and Ravens-Dolphins coming the week after. As dire as things look for Kansas City, it could end up in a familiar place when the season ends: at the top of the conference and playing at home in January. Neither team scored a touchdown on Sunday—Buffalo was on a bye, to be fair—but both were big winners this week. Had the Colts dropped an overtime game in Tennessee, it would have been a perfect weekend for two of 2023’s biggest disappointments, but losses by Denver, Cleveland, Pittsburgh, and New York still provide both the Chargers and Bills with a little hope going forward. Buffalo has the most straightforward path to a postseason berth. The Bills are just a game behind the Browns and Colts for the last spot in the playoff field, and both of those teams are dealing with major concerns at quarterback. Cleveland had to bring Joe Flacco off the couch to boost its injury-plagued QB room, and the Colts have to overcome Gardner Minshew’s reckless play every week. As wonky as the Bills offense has been this season, quarterback play has never been an issue. The schedule, on the other hand, is a major concern. Buffalo is in the middle of a brutal stretch that won’t let up before the playoffs. A home game against the Cowboys follows next week’s trip to Kansas City. That’s followed by what could be an elimination game against the Chargers on the eve of Christmas Eve. Los Angeles should come into the crucial game on a high. It’ll get a beatable Broncos team at home next week, followed by a road game against the Raiders before the showdown with Buffalo. It’s conceivable, if not likely, that the Chargers will have a better record when the two teams meet in late December. I feel like a sucker talking myself into this team (again), but the underlying numbers, including the conference’s seventh-best point differential, suggest that the Chargers are of playoff caliber. The defense has shown signs of improvement, and Justin Herbert had been playing elite-level football before Sunday’s rain-soaked mess in New England. Buffalo’s playoff odds sit at 14 percent as I’m writing this, per The New York Times . The Chargers have a 7 percent chance. But those numbers don’t consider that these teams employ Josh Allen and Justin Herbert. More crucially, they don’t consider that Flacco, Minshew, Russell Wilson, and Mitchell Trubisky are the quarterbacks standing in their way of a playoff push. Don’t count the Bills and Chargers out yet. Depending on how you feel about Seattle this season, he already has. Prescott kicked down the doors of any MVP debates with another near-perfect performance in a win over the Seahawks on Thursday, continuing the best stretch of play we’ve ever seen from the Cowboys quarterback. It’s not like we haven’t seen Prescott go on an extended heater before. As much shit as he gets for his team’s failures, he has been one of the NFL’s consistent producers at the quarterback position. But this latest stretch just feels different. It could end at any time because this level of play would be difficult for any quarterback to sustain, but it feels like Prescott has finally put it all together. He’s still as sharp as ever before the snap, when he basically calls the offense from the line of scrimmage, and he’s just not making any mental errors after it. On top of that, we’ve seen the return of Dak’s early-career creativity. Because he’s been a pocket passer throughout his NFL career, it’s easy to forget that he entered the league as a dual threat quarterback after playing for Dan Mullen at Mississippi State. Over the past few months, Prescott has leaned on his mobility instead of forcing passes into tight windows. His interceptions are down, and productive, chain-moving scrambles have replaced them. Prescott has looked like an MVP outside of the high-profile stinker against San Francisco. The only question about his case is the level of competition he’s faced, but that will change over the next few weeks with games against Philadelphia, Buffalo, Miami, and Detroit left on the schedule. It’s a tough slate for Dallas as a whole, but from a quarterback’s perspective, at least, it’s not the most daunting test. All of these teams have mediocre pass defenses by EPA and success rate, so the Cowboys should be able to move the ball through the air in these games. So to answer the question: Yes, Prescott should be able to keep this up against the good teams, but we’ll have to wait for January to see him against the only defense that has been able to slow him down these past few months. Rodgers returned to Jets practice this week, triggering a 21-day window for his possible return from what many assumed was a season-ending Achilles injury. But the veteran QB has said that he’d return this season only if New York’s playoff hopes were still alive, and after Sunday’s dreadful 13-8 loss to the Falcons, those hopes are now on life support. Per The New York Times , the Jets have a 1 percent chance of making the playoffs, and that number will drop down to a big fat 0 if they lose either of their next two games against the Texans and Dolphins. In other words, that sucker is dropping down to a big fat 0 very soon. In the meantime, Rodgers will get an extra week to pretend that a return in 2023 is possible, but let’s face it: The Jets were done as soon as they decided on starting Tim Boyle two weeks ago. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again.","pubDate":"2023-12-04 19:17:45","image_url":"https://cdn.vox-cdn.com/thumbor/DOSaELL24wGrSbqJPdTdeWicPZ0=/24x0:1091x800/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/72930163/QuestionsPlayoffsRace_Getty_AP_Ringer.0.jpg","source_id":"theringer","source_priority":2702,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f69edd6366edb58cf1b887943961200d","title":"Apugo Commends NFF Football Stakeholders Workshop","link":"https://promptnewsonline.com/apugo-commends-nff-football-stakeholders-workshop/?utm_source=rss&utm_medium=rss&utm_campaign=apugo-commends-nff-football-stakeholders-workshop","keywords":["Sports","Football stakeholders"],"creator":["Editor"],"video_url":null,"description":"By Andrew Abah, Abuja The President of Super Star Football Academy Hon. Victor Apugo said his Academy has a solid background and the best in Uyo having the best sporting facilities for the students Apugo who spoke in Abuja during the FIFA Talent Development Scheme for Football Stakeholders Workshop , commended NFF for putting up [...] The post Apugo Commends NFF Football Stakeholders Workshop first appeared on Prompt News.","content":"The President of Super Star Football Academy Hon. Victor Apugo said his Academy has a solid background and the best in Uyo having the best sporting facilities for the students Apugo who spoke in Abuja during the FIFA Talent Development Scheme for Football Stakeholders Workshop , commended NFF for putting up such programme which has broadened the knowledge of grassroot coaches and academies. He said the programme has enriched on how to run his academy effectively . ” I manage one of the best academies if not the best in Uyo. The Workshop has taught me to be more effective and how to identify the young talents at the lower level of football. I organise scouting program with invitation of foreign football scout.”. Apugo also emphasised the need for the NFF to regulate the prolification of academies in the country . ” I am happy NFF President Ibrahim Gusau has made it clear that all academies will henceforth registered with the football house through the States FA to avoid claims and counter claims of players. I wish also that NFF should have this kind of workshop yearly “. Said Apugo.","pubDate":"2023-12-04 19:17:21","image_url":"https://promptnewsonline.com/wp-content/uploads/2023/06/Football-e1695568140181.jpg","source_id":"promptnewsonline","source_priority":7829578,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e1ee3194de917dd6b31819a7601b9aeb","title":"FA klaagt Manchester City aan na wangedrag van woedende Haaland en teamgenoten","link":"https://www.voetbalprimeur.nl/nieuws/1165948/city-aangeklaagd-na-wangedrag-spelers-tegen-spurs.html","keywords":["Nieuws","Premier League","Manchester City","Tottenham Hotspur","Erling Haaland"],"creator":["info@voetbalprimeur.nl (VoetbalPrimeur)"],"video_url":null,"description":"De Engelse voetbalbond heeft Manchester City aangeklaagd. De reden: het gedrag van enkele spelers tijdens het spectaculaire gelijkspel met Tottenham Hotspur (3-3) van afgelopen zondag.","content":"De Engelse voetbalbond heeft Manchester City aangeklaagd. De reden: het gedrag van enkele spelers tijdens het spectaculaire gelijkspel met Tottenham Hotspur (3-3) van afgelopen zondag. Artikel verder na advertentie Tijdens die wedstrijd werd een aantal City-spelers woedend toen scheidsrechter Simon Hooper in de allerlaatste minuut verzuimde de voordeelregel toe te passen. Daardoor kon aanvaller Jack Grealish bij een 3-3 gelijke stand niet op de Spurs-goal afstomen. Een laatste kans op de overwinning werd de ploeg van manager Pep Guardiola zodoende ontnomen. BREAKING: Manchester City have been charged by the FA for failing to control their players after surrounding referee Simon Hooper in the 94th minute of their draw against Tottenham. pic.twitter.com/PMW33z7tGk Na de beslissing bestormde het halve City-elftal scheidsrechter Hooper. Onder hen bevond zich ook spits Erling Haaland , die er op z'n zachtst gezegd niet in slaagde om zijn woede te verbergen. De FA (Football Association) is van mening dat de regerend landskampioen er niet in is geslaagd om ervoor te zorgen dat de spelers zich naar behoren hebben gedragen. City heeft tot komende donderdag om te reageren op de aanklacht. Artikel verder na advertentie","pubDate":"2023-12-04 19:16:48","image_url":"https://webp.vp.cdn.pxr.nl/news/2023/12/04/9baea453e7b36b67a275269a73b118d77cdf755b.jpg?width=1200","source_id":"voetbalprimeur","source_priority":653815,"country":["netherland"],"category":["sports"],"language":"dutch"},{"article_id":"0bae64c89e70e6ad863da6f7355a4ade","title":"EPL refuse to punish referee after Man City vs Tottenham controversy","link":"https://dailypost.ng/2023/12/04/epl-refuse-to-punish-referee-after-man-city-vs-tottenham-controversy/","keywords":["Sport","EPL","Man Utd vs Tottenham"],"creator":["Ifreke Inyang"],"video_url":null,"description":"The Premier League have decided not to suspend Simon Hooper, despite his late decision not to play advantage for Manchester City against Tottenham. Hooper stopped play despite Jack Grealish running through on goal. He then awarded a free-kick for a foul on Erling Haaland, who had gotten up to play the pass to Grealish. City […] EPL refuse to punish referee after Man City vs Tottenham controversy","content":"Daily Post Nigeria EPL refuse to punish referee after Man City vs Tottenham controversy Home News Politics Metro Entertainment Sport Sport EPL refuse to punish referee after Man City vs Tottenham controversy Published on December 4, 2023 By Ifreke Inyang The Premier League have decided not to suspend Simon Hooper, despite his late decision not to play advantage for Manchester City against Tottenham. Hooper stopped play despite Jack Grealish running through on goal. He then awarded a free-kick for a foul on Erling Haaland, who had gotten up to play the pass to Grealish. City have now been charged by the Football Association for failing to control their players, with Haaland particularly furious at the final whistle. Hooper has been assigned to Liverpool’s game at Sheffield United on Wednesday. The Premier League view his mistake as a human error, and he will not be demoted. He has been previously, as he failed to award a penalty for Wolves against Manchester United earlier this season. Related Topics: EPL Man Utd vs Tottenham Don't Miss Niger Tornadoes trio doubtful for Remo Stars clash You may like EPL: Glen Johnson speaks on ex-Chelsea forward joining Man Utd EPL: Brazil reveals goalkeeper to replace Onana at Man Utd once Ratcliffe arrives EPL: Fulham must start winning games – Iwobi EPL: Fabrizio Romano confirms first manager to be sacked EPL: Poor decision – Jody Morris criticizes Chelsea star after latest win EPL: Gary Neville, Micah Richards pinpoint why Manchester City are dropping points this season Advertise About Us Contact Us Privacy-Policy Terms Copyright © Daily Post Media Ltd","pubDate":"2023-12-04 19:16:31","image_url":"https://dailypost.ng/wp-content/uploads/2023/12/MixCollage-04-Dec-2023-08-22-PM-5561.jpg","source_id":"dailypost","source_priority":55306,"country":["nigeria"],"category":["sports"],"language":"english"}]}