{"newsArray":[{"title":"John ‘Killer’ Kilby dies aged 87: Tributes flow as Essendon mourn death of 53-year AFL club great","link":"https://7news.com.au/sport/afl/great-man-tributes-flow-as-essendon-mourn-death-of-53-year-club-great-john-killer-kilby-c-10501311","keywords":null,"creator":["Glenn Valencich"],"video_url":null,"description":"Essendon will wear black armbands against Geelong on Sunday as a mark of respect.","content":"Tributes are flowing as mourn life member John ‘Killer’ Kilby following his death at the age of 87. The long-time trainer worked at the Bombers from 1965 all the way up to 2018. He was head trainer for three premierships in 1984, 1985 and 1993 and part of the medical team for a fourth in 2000. Analysis, local footy and the biggest moments, Seven and 7plus are the home of footy shows for every fan. Stream them all for free on Essendon will wear black armbands in Sunday’s clash against Geelong at the MCG to remember Kilby. “John Kilby was part of the fabric of the Essendon Football Club,” president Dave Barham said. “His contribution across almost 60 years as a volunteer was immense. “He will be missed by everybody and we send our condolences to his family and close friends. “Killer, thank you for all you have done for this club, you will never be forgotten.” Essendon’s trainers and staff award, won last year by Sam Draper and Andrew McGrath, is named after Kilby. Such was Kilby’s relationship with players - who in the 1960s gave him his nickname - that 2010s players David Hille and Chris Heffernan bought him a Jack Russell. “It was an idea that we had some time ago now,” Hille said in 2014 of introducing Kilby to ‘Rusty’. “I think he also gives Killer a wonderful friendship.” Former player and assistant coach Robert Shaw said Essendon had lost “a great man”. “Dedicated his life to his football club,” Shaw wrote. “Loyalty and dedication to your players is unmatched. Taping ankles and serving (the) club since the 60s.” The ‘proud Tasmanian’ passed away after the AFL’s announcement that the Apple Isle would get its own team, Shaw noted. Kilby was honoured with a spot on the team’s banner when he crossed 50 years of service in 2015.","pubDate":"2023-04-30 01:09:23","image_url":"https://images.7news.com.au/publication/C-10501311/fe5eb7a4728ed359c9ff6b29cf0a4dd1928fec9c-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"SEA Games Men’s U-22 Football: Cambodia wins 4-0 against Timor-Leste","link":"https://www.khmertimeskh.com/501281661/sea-games-mens-u-22-football-cambodia-wins-4-0-against-timor-leste/","keywords":["Sports","2023 Cambodia SEA Games","Cambodia Timor-Leste"],"creator":["Ratana"],"video_url":null,"description":"Cambodian U-22 team beat their Timorese counterpart 4-0 in their first match of Men’s football for SEA Games 2023 held at the National Olympic Stadium in Phnom Penh last evening. Cambodian Kouprey team scored two… The post SEA Games Men’s U-22 Football: Cambodia wins 4-0 against Timor-Leste appeared first on Khmer Times.","content":"Cambodian U-22 team beat their Timorese counterpart 4-0 in their first match of Men’s football for SEA Games 2023 held at the National Olympic Stadium in Phnom Penh last evening. Cambodian Kouprey team scored two goals in the first half and two more in the second half, obtaining three points. Chou Sinit got the first two goals at the 38th and 45th minutes, whereas Sor Rotana earned another one at 73th minutes, and Lim Pisoth at 82th minutes. Earlier in the afternoon, Indonesia also gained three points after winning over the Philippines 3-0. As scheduled, besides Timor-Leste, Cambodia will have matches with the Philippines on May 2, Myanmar on May 7 and Indonesia on May 10. A sea of blue greeted the team as they marched onto the pitch at the 50,000-seater National Olympic Stadium in Phnom Penh, before notching their first win over Group A opponents Timor-Leste. While Cambodia have never medalled in the football competition, the first-time hosts will be hoping that the Angkor Warriors will feature at the state-of-the-art Morodok Techo National Stadium, which will host the opening ceremony, as well as the semi-finals and finals for football. In the day’s earlier Group A game, Hanoi Games bronze medallists Indonesia secured a 3-0 win over the Philippines, courtesy of a Marselino Ferdinan goal just before half-time and late strikes in the 90th minute and in stoppage time from Irfan Jauhari and Fajar Fathur Rahman respectively. Group A consists of Cambodia, Indonesia, Myanmar, the Philippines, and Timor-Leste, while Group B of Laos, Malaysia, Singapore, Thailand, and Vietnam. C. Nika – AKP","pubDate":"2023-04-30 01:06:30","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"},{"title":"Snl24.com | Tau's Al Ahly Advance, CAF Semi-Final Fixtures Confirmed!","link":"https://www.snl24.com/soccerladuma/International/African-Football/caf-champions-league-percy-taus-al-ahly-advance-to-semi-finals-20230429","keywords":null,"creator":null,"video_url":null,"description":"The fixtures for the CAF Champions League semi-finals have been confirmed following the conclusion of the quarter-finals on Saturday night.","content":"Al Ahly advanced to yet another CAF Champions League semi-final following a goalless draw against Raja Casablanca in the second leg of their quarter-final. Bafana Bafana international Percy Tau kept his spot in the Al Ahly starting line-up after bagging an assist in the 2-0 first-leg win. The home side the perfect chance to get back on level terms before the halftime break after being awarded a penalty for Aliou Dieng's foul. However, Yousri Bouzok failed to take advantage after smashing his spot-kick against the crossbar as the Egyptian held on for the lead in the tie. That penalty missed proved to be costly for the home side, who were unable to find a breakthrough in the second half, which sealed Al Ahly's spot in the semi-finals. Espérance Sportive de Tunis secured passage to the final four following a 1-1 draw away to KS Kabylie. The Tunisian side came into the clash with a 1-0 lead from the first leg, but neither side were able to find a breakthrough in the opening 45 minutes. The start of the second half was then delayed after the two sets of fans clashing in the stands. The second half eventually got underway as the home side took the lead on 49 minutes through Mohamed Ali Ben Romdhane's strike to make it 2-0 on aggregate. Adem Redjem did pull a goal back for Kabylie in the 85th minute, but it was too little too late as the Tunisians held on for a spot in the last four. Defending champions Wydad Casablanca advanced to the semi-finals after defeating Simba SC on penalties at Stade Mohamed V. After trailing the first leg 1-0, the Moroccan giants opened the scoring on the night in the 24th minute courtesy of a strike from Bouly Junior. That goal levelled tie but would be the only goal in the second leg, which sent the game to a penalty shoot-out. The Moroccan outfit managed to hold their nerve to triumph 4-3 in the shoot-out, with Shomari Kapombe and Clatous Chama missing for Simba. Wydad Casablanca v Mamelodi Sundowns ES Tunis v Al Ahly You must be to read and post comments.","pubDate":"2023-04-29 23:40:48","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Watch: Wild scenes as Wests Tigers toast drought-breaking victory over NRL premiers Penrith Panthers","link":"https://7news.com.au/sport/rugby-league/wild-scenes-as-wests-tigers-toast-drought-breaking-victory-over-nrl-premiers-c-10497556","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"The waters flowed as the NRL’s bottom side belted out the most anticipated victory song of the year.","content":"Much-maligned halfback Luke Brooks and ex-Panther Api Koroisau have combined to help the last-placed wage the biggest upset in recent memory - a 12-8 defeat of two-time reigning premiers . The win in Bathurst halts the Tigers’ losing streak after seven losses to begin the season and five to end 2022. Watch the latest sport on Channel 7 or stream for free on Penrith were stilted and error-prone in torrential rain on Saturday night but mostly fell victim to a polished Tigers side that finally delivered on the potential shown this month. “It’s not just a win, it’s a really good win,” Tigers coach Tim Sheens said. “There was no luck in it. We worked really, really hard. “We had a good game plan we thought, we prepared for the rain, and the boys carried it out almost to the letter. “That will show the guys that if they stick to what they’re prepared to do, we’ve got a decent football team there.” The result intensifies pressure on an admittedly undermanned Panthers side that has now started their premiership defence with four wins and four losses. “In the conditions, they played better,” Panthers coach Ivan Cleary said. “They deserve a lot of credit but we didn’t play real smart tonight. “We definitely feel like we added to the loss ourselves tonight.” Without injured halves partner Adam Doueihi, Brooks rose to the challenge of booting the Tigers into momentum. The Tigers’ two tries both came directly after Brooks 40/20 kicks, the first of which was in the first set of the night. After his first pinpoint kick, Brooks threaded a grubberkick through the defence to give Brandon Wakeham the opening try - all before the reigning premiers had touched the ball. “His kicking game was how we won today,” Koroisau said of Brooks. Hooker Koroisau had his best game since leaving the Panthers last year and was the Tigers’ general in the middle of the park. He came within inches of scoring a try from his own grubberkick in the first half and just after halftime, tore through the defence on a line break that could have given the Tigers a second try had there been a support runner. The performance would not have gone unnoticed by NSW coach Brad Fittler, who is set to choose between Koroisau and Damien Cook when he names his team for State of Origin I. But penalties cost the Tigers; they conceded three in the space of eight minutes in the first half and on the back of a high tackle from Brooks, the Panthers marched upfield to score their only try through Tyrone Peachey. The Tigers did well to avoid conceding points while centre Brent Naden was in the sin bin for laying a shoulder charge on Zac Hosking that is likely to earn him a suspension. “When ‘Nado’ went off to the bin we were awful,” Cleary said. In his second NRL game, Tigers fullback Jahream Bula was outstanding, setting David Nofoaluma up for his 100th career try with a cut-out pass and fielding Nathan Cleary’s high kicks with aplomb all night. Down 12-8, Penrith looked to have equalised when Nathan Cleary burst through the defence but the ball bounced free of his grasp in slippery conditions as rookie fullback Jahream Bula slid over in cover defence. It was one of 11 errors for the Panthers, many of which came in good territory. Referee Adam Gee pulled the play back to sin-bin Penrith interchange hooker Soni Luke for a hip-drop tackle on Alex Twal as the final 10 minutes approached and the Tigers held on. Injury continues to ravage the Panthers’ middle forward rotation, with Matt Eisenhuth set to join James Fisher-Harris and Spencer Leniu on the sidelines after picking up a game-ending shoulder complaint in the 15th minute. Cleary was unsure of the severity of Eisenhuth’s injury post-match.","pubDate":"2023-04-29 23:18:29","image_url":"https://images.7news.com.au/publication/C-10497556/3ce9c5c1f59c3e7d167b94fda6695bfe201292f4-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"WATCH: Back to back wins for Bulawayo Chiefs","link":"https://www.sundaynews.co.zw/watch-back-to-back-wins-for-bulawayo-chiefs/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Brandon Moyo Sports Reporter Bulawayo Chiefs . . . . . . . . . . . . . . . . . . . . . . (1) 2 Yadah . . . . . . . . . . . . . . . . . . . . . . . . […]","content":"The Sunday News Bulawayo Chiefs . . . . . . . . . . . . . . . . . . . . . . (1) 2 Yadah . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (1) 1 BULAWAYO Chiefs continued with their newly found fine form from last week after recording their second consecutive victory of the season in a Castle Lager Premier Soccer League match played yesterday against Yadah FC at Luveve Stadium. A first half goal from Farau Matare and a second half one from Billy Veremu who cancelled out Prosper Kafelapanjila’s equaliser were enough to hand Amakhosi maximum points at home. Mthokozisi Msebe, who scored a goal and two assists in the 3-2 triumph over Dynamos last Sunday was involved in both goals for Amakhosi Amahle. Msebe now has been involved in all the five goals scored by Chiefs in two matches. After a good display of football by both sides, with a couple of missed chances, it took an excellent Msebe pass to Matare to break the deadlock with 32 minutes played. Matare managed to round off the charging Yadah goal minder, Panashe Nyabunga to slot home and put the Twitter Kings into the lead. Five minutes later, the home side had the chance of doubling their lead, Matare’s header hitting the crossbar from a Msebe free kick. Caught napping at the back, the visitors counter attacked and managed to hit the back of the net through Kafelapanjila and level matters, seven minutes before the half time break. Veremu put Chiefs ahead with a well-executed header, after a brilliant cross into the box by Msebe. Searching for the equaliser, Yadah could not penetrate the Chiefs defence as they suffered their fourth defeat of the season. Lizwe Sweswe, the Chiefs gaffer, believes team morale and confidence has been key in his team finally getting it right as evidenced by the two wins in a row. “Of late the boys have been doing well, and I am happy that we are coming up in terms of the operations in terms of our systems of play. A coach will never be satisfied but the boys are working so hard and I am happy for them, this win will take us somewhere,” said Sweswe. He added that the key to taking maximum points in yesterday’s game was making sure that they were not vulnerable when defending as they were playing with three men at the back. Sweswe also believes that maintaining a winning streak is about self-belief and confidence and knowing that each and every game they play will have different approaches and strategies. His Yadah counterpart, Expense Chitukutuku was impressed with the quality of football displayed by both teams. However, he was let down by the result as they went back to the capital city empty handed. He believes they have to work on their mentality before matches as the players have been making a lot of mistakes which cost them. “The game was good, good teams with young players, good competition. We came with a good game plan after watching them play (Chiefs), we were in control of the first half and we managed to get an equaliser. These youngsters are making blunder after blunder and I think we now have to work on their mentality before going into the game,” said Chitukutuku. With Chiefs moving to nine points, Yadah remained two behind from Chiefs from the seven matches they have played. Bulawayo Chiefs: K Dube, K Sibanda, M Msebe, A Ncube (Sibanda 57 mins), M Mkolo, B Rusinga, M Gasela, D Phiri, B Veremu (Nkosilathi Ncube 90+5 mins), F Moyo, F Matare (Gama 86 mins). Yadah: P Nyabunga, B Kadamanja, M Faranando, M Mlilo, T Musariri (Chome 73 mins), C Mandivei, J Zindoga, K Nadolo (Sango 70 mins), P Kafelapanjili (Nyamakura 73 mins), B Ndereki, D Kibaki (Masiwa 70 mins). — Twitter @ brandon_malvin","pubDate":"2023-04-29 22:05:42","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Finale de la Coupe de France TFC-Nantes : historique ! Toulouse remporte le trophée en écrasant les Nantais","link":"https://www.ladepeche.fr/2023/04/29/finale-de-la-coupe-de-france-tfc-nantes-toulouse-remporte-la-coupe-de-france-dans-un-match-a-sens-unique-11166500.php","keywords":["Toulouse Football Club"],"creator":null,"video_url":null,"description":"Dans une finale à sens unique, le Toulouse Football Club s'adjuge sa deuxième Coupe de France, après celle remportée en 1957. Sur le score de 5-1, le TFC a impressionné dans un match où les Nantais étaient aux abois....","content":"4': 0-1 . Ouverture du score de Toulouse ! Logan Costa titulaire dans l'axe de la défense ouvre la marque. Sur le premier corner du match, l'inévitable Branco van den Boomen se charge de tirer le coup de pied de coin. Logan Costa seul dans les six mètres met une tête rageuse. Alban Lafont ne peut rien faire. A lire aussi : VIDEO. Le TFC remporte la Coupe de France : les doublés de Dallinga et Costa, le missile d'Aboukhlal ! Les buts de la finale historique du TFC 10': 0-2 . On prend les mêmes et on recommence. Coup franc pour Branco van den Boomen non loin du poteau de corner gauche. Le ballon est contré par Girotto au premier poteau et file au deuxième jusque dans les pieds de Spierings qui, en une touche de balle, remet la balle devant le but. Et c'est Logan Costa qui surgit de nouveau pour y mettre la tête. A lire aussi : Le TFC remporte la Coupe de France : heure d'arrivée à l'aéroport, réception au Capitole... Ce qu'il faut savoir sur le retour des héros ce dimanche 23': 0-3 . Toulouse prend le large. Sur une phase de jeu qui paraît anodine, le défenseur chilien Suazo réalise une passe incroyable de plus de 50 mètres. En profondeur sur Dallinga, l'attaquant néerlandais pique une petite balle au-dessus de Lafont A lire aussi : REPLAY. Finale Coupe de France TFC-Nantes : l'énorme match de Toulouse qui décroche le trophée en balayant les Canaris ! Revivez le match 31': 0-4 . C'est fou ! Toulouse marque le quatrième but. Van den Boomen sert Chaibi à droite qui frappe au but sur Lafont. L'ancien gardien du Téf ne parvient pas à se saisir du ballon et renvoi le ballon dans les pieds de Dallinga qui conclue dans le but vide. Score à la mi-temps : 0-4 75' : 1-4 . Nantes sauve l'honneur. Sur un penalty provoqué par Rasmus Nicolaisen, Ludovic Blas ne tremble pas face à un Kjetil Haug pas dans un grand jour. 79' : 1-5 . Toulouse parachève son récital. Sur un coup franc contré de Van den Boomen, Ado remet la balle en retrait pour Aboukhlal qui frappe à l'entrée de la surface. Le ballon est contré Lafont ne peut rien faire. Score final : 1-5 Choix fort du coach depuis le début la compétition, le défenseur Cap-Verdien Logan Costa, était évidemment présent ce soir en finale de Coupe de France pour épauler Rasmus Nicolaisen dans l'axe de la défense toulousaine. Et le suppléant de Rouault en championnat, n'a pas manqué sa finale. En marquant à la 4' et à la 10' sur coup de pied arrêtés, le joueur de 22 ans a montré la voie aux Toulousains. Il devient d'ailleurs le premier joueur à marquer un doublé aussi rapidement en Coupe de France. A lire aussi : REPLAY. Le TFC remporte la Coupe de France : grosse fiesta dans le vestiaire de Toulouse et place du Capitole ! Revivez cette journée de folie Alors si le défenseur Costa marque, l'attaquant Dallinga a eu la même idée. À la 23' et la 31', le Néerlandais s'est lui aussi offert un doublé. D'un lob astucieux premièrement et d'un plat du pied facile dans un second temps l'attaquant s'offre son sixième but en Coupe de France cette année. Dans un scénario auquel personne ne s'attendait, les Toulousains ont décidé de marquer l'histoire de la compétition. Tout d'abord grâce à son défenseur Logan Costa, qui devient le joueur a marqué le doublé le plus rapide dans une finale de Coupe de France, avec un doublé en six minutes. A lire aussi : Finale de la Coupe de France TFC-Nantes : la compo de Toulouse ! Avec quelques surprises pour cette rencontre historique Un doublé de Costa suivi d'un doublé de Thijs Dallinga, qui permet aux violets d'égaliser un autre record. En effet, avec ces quatre buts dans les 45 premières minutes, le TFC égalise la statistique du match entre Nantes et Bordeaux en 1955. Avec un début de match canon, les joueurs du TFC se sont rendus le match facile? Deux buts dans les dix premières minutes ! Qui plus est, un doublé de Logan Costa. Face à des Nantais amorphes en défense et qui touchent peu de ballons, le TéFéCé a respecté son plan de jeu... sans pressions. Et après une accalmie d'une dizaine de minutes, Toulouse remet le couvert et plie presque déjà le match avec un troisième but de Dallinga. Puis moins de dix minutes plus tard, Dallinga s'offre un doublé. Un match qui paraît irréel tant les Toulousains sont dominateurs, mais aussi parce que les Nantais ne proposent rien. A lire aussi : Finale de la Coupe de France TFC-Nantes : la justice suspend l'interdiction de distribuer cartons rouges et sifflets avant la rencontre En seconde mi-temps, le match est plus équilibré. Peut-être parce que les Nantais se sont un peu réveillés, ou alors car les Toulousains ont levé le pied. Dans vingt dernières minutes où les joueurs du TéFéCé ont laissé le ballon aux Nantais, ils concèdent un penalty, de quoi sauver l'honneur pour les Canaris. Mais ce but n'y change rien, Toulouse remet la machine en route et inscrit un cinquième but. Après la victoire 6-3 il y a 66 ans, Toulouse offre encore une pluie de but et un succès 5-1. La nuit risque d'être belle sur les bords de la Garonne.","pubDate":"2023-04-29 22:03:21","image_url":"https://images.ladepeche.fr/api/v1/images/view/644d91fd2ae00b777e62c948/standard/image.jpg?v=2","source_id":"ladepeche","category":["sports"],"country":["france"],"language":"french"},{"title":"Finale de la Coupe de France : cartons rouges, sifflets… À Saint-Denis, la contestation sociale est restée hors du stade","link":"https://www.francetvinfo.fr/sports/foot/coupe-de-france/finale-de-la-coupe-de-france-cartons-rouges-sifflets-a-saint-denis-la-contestation-sociale-est-restee-hors-du-stade_5798714.html#xtor=RSS-3-[sports]","keywords":null,"creator":null,"video_url":null,"description":"À l'occasion de la finale de la Coupe de France remportée par Toulouse face à Nantes (5-1), les syndicats souhaitaient profiter de la présence d'Emmanuel Macron à Saint-Denis, samedi, pour afficher leur contestation. Hormis de timides sifflets à la 49e minute de jeu, le football est finalement resté au cœur de l’attention.","content":"La performance sportive n'a pas été éclipsée. Les Toulousains ont remporté leur première Coupe de France, samedi 29 avril, en écrasant le FC Nantes au terme d'une finale à sens unique (5-1) . La fin d'une soirée scrutée par beaucoup en raison de la présence d'Emmanuel Macron dans les tribunes du Stade de France en pleine période de mobilisation sociale. Mis à part quelques huées entendues lorsque le chronomètre de la rencontre a affiché 49 minutes et 3 secondes, en référence au 49.3 utilisé par Elisabeth Borne pour faire passer la réforme des retraites, la contestation sera finalement restée en dehors de l'enceinte de Saint-Denis. Cartons rouges et sifflets contre les retraites Sur les coups de 17 heures, les syndicats se sont pourtant massés devant les sorties du RER B, du RER D et du métro 13 d'où commençaient à se déverser des vagues jaunes et violettes. La levée de l'arrêté préfectoral leur interdisant de distribuer des cartons rouges et des sifflets aux supporters venant d'être levée par le Tribunal administratif de Paris. \"C'était vraiment important que la justice ait autorisé cette manifestation. Dès qu'on a eu l'information, on s'est tous réunis ici pour distribuer ce carton rouge à la retraite à 64 ans , raconte Xavier, syndicaliste du SNU, qui espérait une action largement suivie dans le stade. Pour certains, cet acte de revendication politique est évident, pour d'autres moins mais quoi qu'il arrive cela permet de discuter\". Venu avec un autre ami nantais, Aurélien a justement pris les deux objets avec plaisir. \"Il faut faire le plus de bruit possible. On a l'occasion de faire passer un message, c'est important. Pour moi, la retraite c'est loin mais je le fais pour la génération du dessus\" , explique le jeune homme de 22 ans dont les parents sont peintre en bâtiment et assistante maternelle. Aurélien et Yannis ont récupéré les cartons rouges et les sifflets distribués par les syndicats aux abords du Stade de France, le 29 avril 2023. (GABRIEL JOLY) Un son de cloche similaire chez Christophe, qui a fait le déplacement avec sa famille depuis Toulouse. Ce cheminot de 62 ans a participé à toutes les journées de grèves depuis le début de la mobilisation contre la réforme des retraites. \"62 ou 63 ans, c'est déjà trop. Evidemment qu'on va tous siffler et brandir nos cartons\" . Confusion à l'entrée L'effet n'a finalement pas été celui escompté. Non seulement car pour la grande majorité des supporters, la priorité était bien la finale : Nantes pouvait espérer faire le doublé en gardant son titre quand le TFC cherchait à obtenir son premier trophée majeur. Mais aussi en raison d'une confusion au moment de pénétrer dans l'enceinte dionysienne. Lorsqu'ils se sont présentés devant leur porte, maillot de Toulouse sur le dos, Etienne et sa fille Louise ont vu les stadiers leur demander de jeter leurs cartons rouges. Une consigne passée dans un premier temps à la sécurité, alors qu'il ne s'agissait pourtant pas d'un objet interdit par le règlement intérieur stade 2023 disponible sur le site de la FFF (contrairement à \"tous les types d'instruments de musique et de cornes de brume\", y compris les sifflets pour ne pas perturber l'arbitre). Si ces fans du Tef' ont finalement pu entrer dans le stade avec les cartons, après avoir réclamé, excédés, l'intervention d'un responsable de la palpation – qui a tout compte fait indiqué qu'ils avaient \"uniquement obligation d'enlever les sifflets\" – certains ne se sont pas entêtés. Résultat, les cartons n'ont pas été nombreux à se montrer en tribunes, d'autant que le visage du président de la République n'est jamais apparu sur l'écran géant du stade. Contrairement aux Violets, largement fêtés par le public occitan.","pubDate":"2023-04-29 21:54:37","image_url":"https://www.francetvinfo.fr/pictures/cY_uyUmUn9Lel6P_wplBOwoMPGI/752x423/2023/04/29/644d87f580380_img-3437.jpg","source_id":"francetvinfo","category":["sports"],"country":["france"],"language":"french"},{"title":"Реал з хет-триком Бензема обіграв Альмерію, Барселона розгромила Бетіс: результати 32 туру Ла-Ліги","link":"https://champion.com.ua/football/2023/04/29/928101/real-z-khet-trykom-benzema-obihrav-almeriyu-barselona-rozhromyla-betis-rezultaty-32-turu-la-lihy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У межах 32-го туру іспанської Ла-Ліги Ельче вдома переміг Райо Вальєкано, Реал переграв Альмерію.Чемпіонат Іспанії - Ла-Ліга32 тур, 29 квітняЕльче - Райо Вальєкано 4:0 (1:0)Голи: 1:0 - 45+1 Тете Моренте, 2:0 - 52 Боє, 3:0 - 53 Фідель, 4:0 - 72 Гумбау...","content":"Джерело - Чемпіон . У межах 32-го туру іспанської Ла-Ліги Ельче вдома переміг Райо Вальєкано, Реал переграв Альмерію. Чемпіонат Іспанії - Ла-Ліга 32 тур, 29 квітня Ельче - Райо Вальєкано 4:0 (1:0) Голи: 1:0 - 45+1 Тете Моренте, 2:0 - 52 Боє, 3:0 - 53 Фідель, 4:0 - 72 Гумбау Реал Мадрид - Альмерія 4:2 (3:1) Голи: 1:0 - 5 Бензема, 2:0 - 17 Бензема, 3:0 - 42 Бензема (пен), 3:1 - 45+1 Лазаро, 4:1 - 47 Родріго, 4:2 - 61 Робертоне Барселона - Бетіс 4:0 (3:0) Голи: 1:0 - 14 Крістенсен, 2:0 - 36 Левандоський, 3:0 - 39 Рафінья, 4:0 - 82 Родрігес (автогол) ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-04-29 20:58:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Рома зіграла внічию з Міланом, Аталанта перемогла Торіно: результати 32 туру Серії А","link":"https://champion.com.ua/football/2023/04/29/928111/roma-zihrala-vnichyyu-z-milanom-atalanta-peremohla-torino-rezultaty-32-turu-seriyi-a","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Відбулися матчі32-го туру італійської Серії А.Чемпіонат Італії - Серія А32 тур, 29 квітняРома - Мілан 1:1 (0:0)Голи: 1:0 - 90+3 Ебрахам, 1:1 - 90+7 СалемакерсТоріно - Аталанта 1:2 (0:1)Голи: 0:1 - 34 Дзаппакоста, 1:1 - 75 Санабрія, 1:2 - 88 Сапата✅ П...","content":"Джерело - Чемпіон . Відбулися матчі 32-го туру італійської Серії А. Чемпіонат Італії - Серія А 32 тур, 29 квітня Рома - Мілан 1:1 (0:0) Голи: 1:0 - 90+3 Ебрахам, 1:1 - 90+7 Салемакерс Торіно - Аталанта 1:2 (0:1) Голи: 0:1 - 34 Дзаппакоста, 1:1 - 75 Санабрія, 1:2 - 88 Сапата ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-04-29 20:41:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Бейл відхилив пропозицію відновлення кар'єри","link":"https://champion.com.ua/football/2023/04/29/928092/beyl-vidkhylyv-propozytsiyu-vidnovlennya-karyery","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Ексгравець Реала та збірної Вельсу Гарет Бейл відхилив пропозицію про відновлення кар'єри футболіста.Про це повідомляє Goal.com.Підписати гравця намагався Рексем, але Бейл відповів відмовою.Бейл завершив кар'єруу січні поточного року. Останнім клубом...","content":"#The International 2019 на 33 млн доларів. , #Гарет Бейл Джерело - goal.com . Ексгравець Реала та збірної Вельсу Гарет Бейл відхилив пропозицію про відновлення кар'єри футболіста. Про це повідомляє Goal.com. Підписати гравця намагався Рексем, але Бейл відповів відмовою. Бейл завершив кар'єру у січні поточного року. Останнім клубом у його кар'єрі був Лос-Анджелес. Рексем виступає в п'ятому за силою дивізіоні англійського футболу. Клубом володіють голлівудські актори Раян Рейнольдс і Роб Макелхенні.","pubDate":"2023-04-29 20:35:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"John ‘Killer’ Kilby dies aged 87: Tributes flow as Essendon mourn death of 53-year AFL club great","link":"https://7news.com.au/sport/afl/great-man-tributes-flow-as-essendon-mourn-death-of-53-year-club-great-john-killer-kilby-c-10501311","keywords":null,"creator":["Glenn Valencich"],"video_url":null,"description":"Essendon will wear black armbands against Geelong on Sunday as a mark of respect.","content":"Tributes are flowing as mourn life member John ‘Killer’ Kilby following his death at the age of 87. The long-time trainer worked at the Bombers from 1965 all the way up to 2018. He was head trainer for three premierships in 1984, 1985 and 1993 and part of the medical team for a fourth in 2000. Analysis, local footy and the biggest moments, Seven and 7plus are the home of footy shows for every fan. Stream them all for free on Essendon will wear black armbands in Sunday’s clash against Geelong at the MCG to remember Kilby. “John Kilby was part of the fabric of the Essendon Football Club,” president Dave Barham said. “His contribution across almost 60 years as a volunteer was immense. “He will be missed by everybody and we send our condolences to his family and close friends. “Killer, thank you for all you have done for this club, you will never be forgotten.” Essendon’s trainers and staff award, won last year by Sam Draper and Andrew McGrath, is named after Kilby. Such was Kilby’s relationship with players - who in the 1960s gave him his nickname - that 2010s players David Hille and Chris Heffernan bought him a Jack Russell. “It was an idea that we had some time ago now,” Hille said in 2014 of introducing Kilby to ‘Rusty’. “I think he also gives Killer a wonderful friendship.” Former player and assistant coach Robert Shaw said Essendon had lost “a great man”. “Dedicated his life to his football club,” Shaw wrote. “Loyalty and dedication to your players is unmatched. Taping ankles and serving (the) club since the 60s.” The ‘proud Tasmanian’ passed away after the AFL’s announcement that the Apple Isle would get its own team, Shaw noted. Kilby was honoured with a spot on the team’s banner when he crossed 50 years of service in 2015.","pubDate":"2023-04-30 01:09:23","image_url":"https://images.7news.com.au/publication/C-10501311/fe5eb7a4728ed359c9ff6b29cf0a4dd1928fec9c-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"SEA Games Men’s U-22 Football: Cambodia wins 4-0 against Timor-Leste","link":"https://www.khmertimeskh.com/501281661/sea-games-mens-u-22-football-cambodia-wins-4-0-against-timor-leste/","keywords":["Sports","2023 Cambodia SEA Games","Cambodia Timor-Leste"],"creator":["Ratana"],"video_url":null,"description":"Cambodian U-22 team beat their Timorese counterpart 4-0 in their first match of Men’s football for SEA Games 2023 held at the National Olympic Stadium in Phnom Penh last evening. Cambodian Kouprey team scored two… The post SEA Games Men’s U-22 Football: Cambodia wins 4-0 against Timor-Leste appeared first on Khmer Times.","content":"Cambodian U-22 team beat their Timorese counterpart 4-0 in their first match of Men’s football for SEA Games 2023 held at the National Olympic Stadium in Phnom Penh last evening. Cambodian Kouprey team scored two goals in the first half and two more in the second half, obtaining three points. Chou Sinit got the first two goals at the 38th and 45th minutes, whereas Sor Rotana earned another one at 73th minutes, and Lim Pisoth at 82th minutes. Earlier in the afternoon, Indonesia also gained three points after winning over the Philippines 3-0. As scheduled, besides Timor-Leste, Cambodia will have matches with the Philippines on May 2, Myanmar on May 7 and Indonesia on May 10. A sea of blue greeted the team as they marched onto the pitch at the 50,000-seater National Olympic Stadium in Phnom Penh, before notching their first win over Group A opponents Timor-Leste. While Cambodia have never medalled in the football competition, the first-time hosts will be hoping that the Angkor Warriors will feature at the state-of-the-art Morodok Techo National Stadium, which will host the opening ceremony, as well as the semi-finals and finals for football. In the day’s earlier Group A game, Hanoi Games bronze medallists Indonesia secured a 3-0 win over the Philippines, courtesy of a Marselino Ferdinan goal just before half-time and late strikes in the 90th minute and in stoppage time from Irfan Jauhari and Fajar Fathur Rahman respectively. Group A consists of Cambodia, Indonesia, Myanmar, the Philippines, and Timor-Leste, while Group B of Laos, Malaysia, Singapore, Thailand, and Vietnam. C. Nika – AKP","pubDate":"2023-04-30 01:06:30","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"},{"title":"Snl24.com | Tau's Al Ahly Advance, CAF Semi-Final Fixtures Confirmed!","link":"https://www.snl24.com/soccerladuma/International/African-Football/caf-champions-league-percy-taus-al-ahly-advance-to-semi-finals-20230429","keywords":null,"creator":null,"video_url":null,"description":"The fixtures for the CAF Champions League semi-finals have been confirmed following the conclusion of the quarter-finals on Saturday night.","content":"Al Ahly advanced to yet another CAF Champions League semi-final following a goalless draw against Raja Casablanca in the second leg of their quarter-final. Bafana Bafana international Percy Tau kept his spot in the Al Ahly starting line-up after bagging an assist in the 2-0 first-leg win. The home side the perfect chance to get back on level terms before the halftime break after being awarded a penalty for Aliou Dieng's foul. However, Yousri Bouzok failed to take advantage after smashing his spot-kick against the crossbar as the Egyptian held on for the lead in the tie. That penalty missed proved to be costly for the home side, who were unable to find a breakthrough in the second half, which sealed Al Ahly's spot in the semi-finals. Espérance Sportive de Tunis secured passage to the final four following a 1-1 draw away to KS Kabylie. The Tunisian side came into the clash with a 1-0 lead from the first leg, but neither side were able to find a breakthrough in the opening 45 minutes. The start of the second half was then delayed after the two sets of fans clashing in the stands. The second half eventually got underway as the home side took the lead on 49 minutes through Mohamed Ali Ben Romdhane's strike to make it 2-0 on aggregate. Adem Redjem did pull a goal back for Kabylie in the 85th minute, but it was too little too late as the Tunisians held on for a spot in the last four. Defending champions Wydad Casablanca advanced to the semi-finals after defeating Simba SC on penalties at Stade Mohamed V. After trailing the first leg 1-0, the Moroccan giants opened the scoring on the night in the 24th minute courtesy of a strike from Bouly Junior. That goal levelled tie but would be the only goal in the second leg, which sent the game to a penalty shoot-out. The Moroccan outfit managed to hold their nerve to triumph 4-3 in the shoot-out, with Shomari Kapombe and Clatous Chama missing for Simba. Wydad Casablanca v Mamelodi Sundowns ES Tunis v Al Ahly You must be to read and post comments.","pubDate":"2023-04-29 23:40:48","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Watch: Wild scenes as Wests Tigers toast drought-breaking victory over NRL premiers Penrith Panthers","link":"https://7news.com.au/sport/rugby-league/wild-scenes-as-wests-tigers-toast-drought-breaking-victory-over-nrl-premiers-c-10497556","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"The waters flowed as the NRL’s bottom side belted out the most anticipated victory song of the year.","content":"Much-maligned halfback Luke Brooks and ex-Panther Api Koroisau have combined to help the last-placed wage the biggest upset in recent memory - a 12-8 defeat of two-time reigning premiers . The win in Bathurst halts the Tigers’ losing streak after seven losses to begin the season and five to end 2022. Watch the latest sport on Channel 7 or stream for free on Penrith were stilted and error-prone in torrential rain on Saturday night but mostly fell victim to a polished Tigers side that finally delivered on the potential shown this month. “It’s not just a win, it’s a really good win,” Tigers coach Tim Sheens said. “There was no luck in it. We worked really, really hard. “We had a good game plan we thought, we prepared for the rain, and the boys carried it out almost to the letter. “That will show the guys that if they stick to what they’re prepared to do, we’ve got a decent football team there.” The result intensifies pressure on an admittedly undermanned Panthers side that has now started their premiership defence with four wins and four losses. “In the conditions, they played better,” Panthers coach Ivan Cleary said. “They deserve a lot of credit but we didn’t play real smart tonight. “We definitely feel like we added to the loss ourselves tonight.” Without injured halves partner Adam Doueihi, Brooks rose to the challenge of booting the Tigers into momentum. The Tigers’ two tries both came directly after Brooks 40/20 kicks, the first of which was in the first set of the night. After his first pinpoint kick, Brooks threaded a grubberkick through the defence to give Brandon Wakeham the opening try - all before the reigning premiers had touched the ball. “His kicking game was how we won today,” Koroisau said of Brooks. Hooker Koroisau had his best game since leaving the Panthers last year and was the Tigers’ general in the middle of the park. He came within inches of scoring a try from his own grubberkick in the first half and just after halftime, tore through the defence on a line break that could have given the Tigers a second try had there been a support runner. The performance would not have gone unnoticed by NSW coach Brad Fittler, who is set to choose between Koroisau and Damien Cook when he names his team for State of Origin I. But penalties cost the Tigers; they conceded three in the space of eight minutes in the first half and on the back of a high tackle from Brooks, the Panthers marched upfield to score their only try through Tyrone Peachey. The Tigers did well to avoid conceding points while centre Brent Naden was in the sin bin for laying a shoulder charge on Zac Hosking that is likely to earn him a suspension. “When ‘Nado’ went off to the bin we were awful,” Cleary said. In his second NRL game, Tigers fullback Jahream Bula was outstanding, setting David Nofoaluma up for his 100th career try with a cut-out pass and fielding Nathan Cleary’s high kicks with aplomb all night. Down 12-8, Penrith looked to have equalised when Nathan Cleary burst through the defence but the ball bounced free of his grasp in slippery conditions as rookie fullback Jahream Bula slid over in cover defence. It was one of 11 errors for the Panthers, many of which came in good territory. Referee Adam Gee pulled the play back to sin-bin Penrith interchange hooker Soni Luke for a hip-drop tackle on Alex Twal as the final 10 minutes approached and the Tigers held on. Injury continues to ravage the Panthers’ middle forward rotation, with Matt Eisenhuth set to join James Fisher-Harris and Spencer Leniu on the sidelines after picking up a game-ending shoulder complaint in the 15th minute. Cleary was unsure of the severity of Eisenhuth’s injury post-match.","pubDate":"2023-04-29 23:18:29","image_url":"https://images.7news.com.au/publication/C-10497556/3ce9c5c1f59c3e7d167b94fda6695bfe201292f4-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"WATCH: Back to back wins for Bulawayo Chiefs","link":"https://www.sundaynews.co.zw/watch-back-to-back-wins-for-bulawayo-chiefs/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Brandon Moyo Sports Reporter Bulawayo Chiefs . . . . . . . . . . . . . . . . . . . . . . (1) 2 Yadah . . . . . . . . . . . . . . . . . . . . . . . . […]","content":"The Sunday News Bulawayo Chiefs . . . . . . . . . . . . . . . . . . . . . . (1) 2 Yadah . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (1) 1 BULAWAYO Chiefs continued with their newly found fine form from last week after recording their second consecutive victory of the season in a Castle Lager Premier Soccer League match played yesterday against Yadah FC at Luveve Stadium. A first half goal from Farau Matare and a second half one from Billy Veremu who cancelled out Prosper Kafelapanjila’s equaliser were enough to hand Amakhosi maximum points at home. Mthokozisi Msebe, who scored a goal and two assists in the 3-2 triumph over Dynamos last Sunday was involved in both goals for Amakhosi Amahle. Msebe now has been involved in all the five goals scored by Chiefs in two matches. After a good display of football by both sides, with a couple of missed chances, it took an excellent Msebe pass to Matare to break the deadlock with 32 minutes played. Matare managed to round off the charging Yadah goal minder, Panashe Nyabunga to slot home and put the Twitter Kings into the lead. Five minutes later, the home side had the chance of doubling their lead, Matare’s header hitting the crossbar from a Msebe free kick. Caught napping at the back, the visitors counter attacked and managed to hit the back of the net through Kafelapanjila and level matters, seven minutes before the half time break. Veremu put Chiefs ahead with a well-executed header, after a brilliant cross into the box by Msebe. Searching for the equaliser, Yadah could not penetrate the Chiefs defence as they suffered their fourth defeat of the season. Lizwe Sweswe, the Chiefs gaffer, believes team morale and confidence has been key in his team finally getting it right as evidenced by the two wins in a row. “Of late the boys have been doing well, and I am happy that we are coming up in terms of the operations in terms of our systems of play. A coach will never be satisfied but the boys are working so hard and I am happy for them, this win will take us somewhere,” said Sweswe. He added that the key to taking maximum points in yesterday’s game was making sure that they were not vulnerable when defending as they were playing with three men at the back. Sweswe also believes that maintaining a winning streak is about self-belief and confidence and knowing that each and every game they play will have different approaches and strategies. His Yadah counterpart, Expense Chitukutuku was impressed with the quality of football displayed by both teams. However, he was let down by the result as they went back to the capital city empty handed. He believes they have to work on their mentality before matches as the players have been making a lot of mistakes which cost them. “The game was good, good teams with young players, good competition. We came with a good game plan after watching them play (Chiefs), we were in control of the first half and we managed to get an equaliser. These youngsters are making blunder after blunder and I think we now have to work on their mentality before going into the game,” said Chitukutuku. With Chiefs moving to nine points, Yadah remained two behind from Chiefs from the seven matches they have played. Bulawayo Chiefs: K Dube, K Sibanda, M Msebe, A Ncube (Sibanda 57 mins), M Mkolo, B Rusinga, M Gasela, D Phiri, B Veremu (Nkosilathi Ncube 90+5 mins), F Moyo, F Matare (Gama 86 mins). Yadah: P Nyabunga, B Kadamanja, M Faranando, M Mlilo, T Musariri (Chome 73 mins), C Mandivei, J Zindoga, K Nadolo (Sango 70 mins), P Kafelapanjili (Nyamakura 73 mins), B Ndereki, D Kibaki (Masiwa 70 mins). — Twitter @ brandon_malvin","pubDate":"2023-04-29 22:05:42","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Finale de la Coupe de France TFC-Nantes : historique ! Toulouse remporte le trophée en écrasant les Nantais","link":"https://www.ladepeche.fr/2023/04/29/finale-de-la-coupe-de-france-tfc-nantes-toulouse-remporte-la-coupe-de-france-dans-un-match-a-sens-unique-11166500.php","keywords":["Toulouse Football Club"],"creator":null,"video_url":null,"description":"Dans une finale à sens unique, le Toulouse Football Club s'adjuge sa deuxième Coupe de France, après celle remportée en 1957. Sur le score de 5-1, le TFC a impressionné dans un match où les Nantais étaient aux abois....","content":"4': 0-1 . Ouverture du score de Toulouse ! Logan Costa titulaire dans l'axe de la défense ouvre la marque. Sur le premier corner du match, l'inévitable Branco van den Boomen se charge de tirer le coup de pied de coin. Logan Costa seul dans les six mètres met une tête rageuse. Alban Lafont ne peut rien faire. A lire aussi : VIDEO. Le TFC remporte la Coupe de France : les doublés de Dallinga et Costa, le missile d'Aboukhlal ! Les buts de la finale historique du TFC 10': 0-2 . On prend les mêmes et on recommence. Coup franc pour Branco van den Boomen non loin du poteau de corner gauche. Le ballon est contré par Girotto au premier poteau et file au deuxième jusque dans les pieds de Spierings qui, en une touche de balle, remet la balle devant le but. Et c'est Logan Costa qui surgit de nouveau pour y mettre la tête. A lire aussi : Le TFC remporte la Coupe de France : heure d'arrivée à l'aéroport, réception au Capitole... Ce qu'il faut savoir sur le retour des héros ce dimanche 23': 0-3 . Toulouse prend le large. Sur une phase de jeu qui paraît anodine, le défenseur chilien Suazo réalise une passe incroyable de plus de 50 mètres. En profondeur sur Dallinga, l'attaquant néerlandais pique une petite balle au-dessus de Lafont A lire aussi : REPLAY. Finale Coupe de France TFC-Nantes : l'énorme match de Toulouse qui décroche le trophée en balayant les Canaris ! Revivez le match 31': 0-4 . C'est fou ! Toulouse marque le quatrième but. Van den Boomen sert Chaibi à droite qui frappe au but sur Lafont. L'ancien gardien du Téf ne parvient pas à se saisir du ballon et renvoi le ballon dans les pieds de Dallinga qui conclue dans le but vide. Score à la mi-temps : 0-4 75' : 1-4 . Nantes sauve l'honneur. Sur un penalty provoqué par Rasmus Nicolaisen, Ludovic Blas ne tremble pas face à un Kjetil Haug pas dans un grand jour. 79' : 1-5 . Toulouse parachève son récital. Sur un coup franc contré de Van den Boomen, Ado remet la balle en retrait pour Aboukhlal qui frappe à l'entrée de la surface. Le ballon est contré Lafont ne peut rien faire. Score final : 1-5 Choix fort du coach depuis le début la compétition, le défenseur Cap-Verdien Logan Costa, était évidemment présent ce soir en finale de Coupe de France pour épauler Rasmus Nicolaisen dans l'axe de la défense toulousaine. Et le suppléant de Rouault en championnat, n'a pas manqué sa finale. En marquant à la 4' et à la 10' sur coup de pied arrêtés, le joueur de 22 ans a montré la voie aux Toulousains. Il devient d'ailleurs le premier joueur à marquer un doublé aussi rapidement en Coupe de France. A lire aussi : REPLAY. Le TFC remporte la Coupe de France : grosse fiesta dans le vestiaire de Toulouse et place du Capitole ! Revivez cette journée de folie Alors si le défenseur Costa marque, l'attaquant Dallinga a eu la même idée. À la 23' et la 31', le Néerlandais s'est lui aussi offert un doublé. D'un lob astucieux premièrement et d'un plat du pied facile dans un second temps l'attaquant s'offre son sixième but en Coupe de France cette année. Dans un scénario auquel personne ne s'attendait, les Toulousains ont décidé de marquer l'histoire de la compétition. Tout d'abord grâce à son défenseur Logan Costa, qui devient le joueur a marqué le doublé le plus rapide dans une finale de Coupe de France, avec un doublé en six minutes. A lire aussi : Finale de la Coupe de France TFC-Nantes : la compo de Toulouse ! Avec quelques surprises pour cette rencontre historique Un doublé de Costa suivi d'un doublé de Thijs Dallinga, qui permet aux violets d'égaliser un autre record. En effet, avec ces quatre buts dans les 45 premières minutes, le TFC égalise la statistique du match entre Nantes et Bordeaux en 1955. Avec un début de match canon, les joueurs du TFC se sont rendus le match facile? Deux buts dans les dix premières minutes ! Qui plus est, un doublé de Logan Costa. Face à des Nantais amorphes en défense et qui touchent peu de ballons, le TéFéCé a respecté son plan de jeu... sans pressions. Et après une accalmie d'une dizaine de minutes, Toulouse remet le couvert et plie presque déjà le match avec un troisième but de Dallinga. Puis moins de dix minutes plus tard, Dallinga s'offre un doublé. Un match qui paraît irréel tant les Toulousains sont dominateurs, mais aussi parce que les Nantais ne proposent rien. A lire aussi : Finale de la Coupe de France TFC-Nantes : la justice suspend l'interdiction de distribuer cartons rouges et sifflets avant la rencontre En seconde mi-temps, le match est plus équilibré. Peut-être parce que les Nantais se sont un peu réveillés, ou alors car les Toulousains ont levé le pied. Dans vingt dernières minutes où les joueurs du TéFéCé ont laissé le ballon aux Nantais, ils concèdent un penalty, de quoi sauver l'honneur pour les Canaris. Mais ce but n'y change rien, Toulouse remet la machine en route et inscrit un cinquième but. Après la victoire 6-3 il y a 66 ans, Toulouse offre encore une pluie de but et un succès 5-1. La nuit risque d'être belle sur les bords de la Garonne.","pubDate":"2023-04-29 22:03:21","image_url":"https://images.ladepeche.fr/api/v1/images/view/644d91fd2ae00b777e62c948/standard/image.jpg?v=2","source_id":"ladepeche","category":["sports"],"country":["france"],"language":"french"},{"title":"Finale de la Coupe de France : cartons rouges, sifflets… À Saint-Denis, la contestation sociale est restée hors du stade","link":"https://www.francetvinfo.fr/sports/foot/coupe-de-france/finale-de-la-coupe-de-france-cartons-rouges-sifflets-a-saint-denis-la-contestation-sociale-est-restee-hors-du-stade_5798714.html#xtor=RSS-3-[sports]","keywords":null,"creator":null,"video_url":null,"description":"À l'occasion de la finale de la Coupe de France remportée par Toulouse face à Nantes (5-1), les syndicats souhaitaient profiter de la présence d'Emmanuel Macron à Saint-Denis, samedi, pour afficher leur contestation. Hormis de timides sifflets à la 49e minute de jeu, le football est finalement resté au cœur de l’attention.","content":"La performance sportive n'a pas été éclipsée. Les Toulousains ont remporté leur première Coupe de France, samedi 29 avril, en écrasant le FC Nantes au terme d'une finale à sens unique (5-1) . La fin d'une soirée scrutée par beaucoup en raison de la présence d'Emmanuel Macron dans les tribunes du Stade de France en pleine période de mobilisation sociale. Mis à part quelques huées entendues lorsque le chronomètre de la rencontre a affiché 49 minutes et 3 secondes, en référence au 49.3 utilisé par Elisabeth Borne pour faire passer la réforme des retraites, la contestation sera finalement restée en dehors de l'enceinte de Saint-Denis. Cartons rouges et sifflets contre les retraites Sur les coups de 17 heures, les syndicats se sont pourtant massés devant les sorties du RER B, du RER D et du métro 13 d'où commençaient à se déverser des vagues jaunes et violettes. La levée de l'arrêté préfectoral leur interdisant de distribuer des cartons rouges et des sifflets aux supporters venant d'être levée par le Tribunal administratif de Paris. \"C'était vraiment important que la justice ait autorisé cette manifestation. Dès qu'on a eu l'information, on s'est tous réunis ici pour distribuer ce carton rouge à la retraite à 64 ans , raconte Xavier, syndicaliste du SNU, qui espérait une action largement suivie dans le stade. Pour certains, cet acte de revendication politique est évident, pour d'autres moins mais quoi qu'il arrive cela permet de discuter\". Venu avec un autre ami nantais, Aurélien a justement pris les deux objets avec plaisir. \"Il faut faire le plus de bruit possible. On a l'occasion de faire passer un message, c'est important. Pour moi, la retraite c'est loin mais je le fais pour la génération du dessus\" , explique le jeune homme de 22 ans dont les parents sont peintre en bâtiment et assistante maternelle. Aurélien et Yannis ont récupéré les cartons rouges et les sifflets distribués par les syndicats aux abords du Stade de France, le 29 avril 2023. (GABRIEL JOLY) Un son de cloche similaire chez Christophe, qui a fait le déplacement avec sa famille depuis Toulouse. Ce cheminot de 62 ans a participé à toutes les journées de grèves depuis le début de la mobilisation contre la réforme des retraites. \"62 ou 63 ans, c'est déjà trop. Evidemment qu'on va tous siffler et brandir nos cartons\" . Confusion à l'entrée L'effet n'a finalement pas été celui escompté. Non seulement car pour la grande majorité des supporters, la priorité était bien la finale : Nantes pouvait espérer faire le doublé en gardant son titre quand le TFC cherchait à obtenir son premier trophée majeur. Mais aussi en raison d'une confusion au moment de pénétrer dans l'enceinte dionysienne. Lorsqu'ils se sont présentés devant leur porte, maillot de Toulouse sur le dos, Etienne et sa fille Louise ont vu les stadiers leur demander de jeter leurs cartons rouges. Une consigne passée dans un premier temps à la sécurité, alors qu'il ne s'agissait pourtant pas d'un objet interdit par le règlement intérieur stade 2023 disponible sur le site de la FFF (contrairement à \"tous les types d'instruments de musique et de cornes de brume\", y compris les sifflets pour ne pas perturber l'arbitre). Si ces fans du Tef' ont finalement pu entrer dans le stade avec les cartons, après avoir réclamé, excédés, l'intervention d'un responsable de la palpation – qui a tout compte fait indiqué qu'ils avaient \"uniquement obligation d'enlever les sifflets\" – certains ne se sont pas entêtés. Résultat, les cartons n'ont pas été nombreux à se montrer en tribunes, d'autant que le visage du président de la République n'est jamais apparu sur l'écran géant du stade. Contrairement aux Violets, largement fêtés par le public occitan.","pubDate":"2023-04-29 21:54:37","image_url":"https://www.francetvinfo.fr/pictures/cY_uyUmUn9Lel6P_wplBOwoMPGI/752x423/2023/04/29/644d87f580380_img-3437.jpg","source_id":"francetvinfo","category":["sports"],"country":["france"],"language":"french"},{"title":"Реал з хет-триком Бензема обіграв Альмерію, Барселона розгромила Бетіс: результати 32 туру Ла-Ліги","link":"https://champion.com.ua/football/2023/04/29/928101/real-z-khet-trykom-benzema-obihrav-almeriyu-barselona-rozhromyla-betis-rezultaty-32-turu-la-lihy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У межах 32-го туру іспанської Ла-Ліги Ельче вдома переміг Райо Вальєкано, Реал переграв Альмерію.Чемпіонат Іспанії - Ла-Ліга32 тур, 29 квітняЕльче - Райо Вальєкано 4:0 (1:0)Голи: 1:0 - 45+1 Тете Моренте, 2:0 - 52 Боє, 3:0 - 53 Фідель, 4:0 - 72 Гумбау...","content":"Джерело - Чемпіон . У межах 32-го туру іспанської Ла-Ліги Ельче вдома переміг Райо Вальєкано, Реал переграв Альмерію. Чемпіонат Іспанії - Ла-Ліга 32 тур, 29 квітня Ельче - Райо Вальєкано 4:0 (1:0) Голи: 1:0 - 45+1 Тете Моренте, 2:0 - 52 Боє, 3:0 - 53 Фідель, 4:0 - 72 Гумбау Реал Мадрид - Альмерія 4:2 (3:1) Голи: 1:0 - 5 Бензема, 2:0 - 17 Бензема, 3:0 - 42 Бензема (пен), 3:1 - 45+1 Лазаро, 4:1 - 47 Родріго, 4:2 - 61 Робертоне Барселона - Бетіс 4:0 (3:0) Голи: 1:0 - 14 Крістенсен, 2:0 - 36 Левандоський, 3:0 - 39 Рафінья, 4:0 - 82 Родрігес (автогол) ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-04-29 20:58:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Рома зіграла внічию з Міланом, Аталанта перемогла Торіно: результати 32 туру Серії А","link":"https://champion.com.ua/football/2023/04/29/928111/roma-zihrala-vnichyyu-z-milanom-atalanta-peremohla-torino-rezultaty-32-turu-seriyi-a","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Відбулися матчі32-го туру італійської Серії А.Чемпіонат Італії - Серія А32 тур, 29 квітняРома - Мілан 1:1 (0:0)Голи: 1:0 - 90+3 Ебрахам, 1:1 - 90+7 СалемакерсТоріно - Аталанта 1:2 (0:1)Голи: 0:1 - 34 Дзаппакоста, 1:1 - 75 Санабрія, 1:2 - 88 Сапата✅ П...","content":"Джерело - Чемпіон . Відбулися матчі 32-го туру італійської Серії А. Чемпіонат Італії - Серія А 32 тур, 29 квітня Рома - Мілан 1:1 (0:0) Голи: 1:0 - 90+3 Ебрахам, 1:1 - 90+7 Салемакерс Торіно - Аталанта 1:2 (0:1) Голи: 0:1 - 34 Дзаппакоста, 1:1 - 75 Санабрія, 1:2 - 88 Сапата ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-04-29 20:41:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Бейл відхилив пропозицію відновлення кар'єри","link":"https://champion.com.ua/football/2023/04/29/928092/beyl-vidkhylyv-propozytsiyu-vidnovlennya-karyery","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Ексгравець Реала та збірної Вельсу Гарет Бейл відхилив пропозицію про відновлення кар'єри футболіста.Про це повідомляє Goal.com.Підписати гравця намагався Рексем, але Бейл відповів відмовою.Бейл завершив кар'єруу січні поточного року. Останнім клубом...","content":"#The International 2019 на 33 млн доларів. , #Гарет Бейл Джерело - goal.com . Ексгравець Реала та збірної Вельсу Гарет Бейл відхилив пропозицію про відновлення кар'єри футболіста. Про це повідомляє Goal.com. Підписати гравця намагався Рексем, але Бейл відповів відмовою. Бейл завершив кар'єру у січні поточного року. Останнім клубом у його кар'єрі був Лос-Анджелес. Рексем виступає в п'ятому за силою дивізіоні англійського футболу. Клубом володіють голлівудські актори Раян Рейнольдс і Роб Макелхенні.","pubDate":"2023-04-29 20:35:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"John ‘Killer’ Kilby dies aged 87: Tributes flow as Essendon mourn death of 53-year AFL club great","link":"https://7news.com.au/sport/afl/great-man-tributes-flow-as-essendon-mourn-death-of-53-year-club-great-john-killer-kilby-c-10501311","keywords":null,"creator":["Glenn Valencich"],"video_url":null,"description":"Essendon will wear black armbands against Geelong on Sunday as a mark of respect.","content":"Tributes are flowing as mourn life member John ‘Killer’ Kilby following his death at the age of 87. The long-time trainer worked at the Bombers from 1965 all the way up to 2018. He was head trainer for three premierships in 1984, 1985 and 1993 and part of the medical team for a fourth in 2000. Analysis, local footy and the biggest moments, Seven and 7plus are the home of footy shows for every fan. Stream them all for free on Essendon will wear black armbands in Sunday’s clash against Geelong at the MCG to remember Kilby. “John Kilby was part of the fabric of the Essendon Football Club,” president Dave Barham said. “His contribution across almost 60 years as a volunteer was immense. “He will be missed by everybody and we send our condolences to his family and close friends. “Killer, thank you for all you have done for this club, you will never be forgotten.” Essendon’s trainers and staff award, won last year by Sam Draper and Andrew McGrath, is named after Kilby. Such was Kilby’s relationship with players - who in the 1960s gave him his nickname - that 2010s players David Hille and Chris Heffernan bought him a Jack Russell. “It was an idea that we had some time ago now,” Hille said in 2014 of introducing Kilby to ‘Rusty’. “I think he also gives Killer a wonderful friendship.” Former player and assistant coach Robert Shaw said Essendon had lost “a great man”. “Dedicated his life to his football club,” Shaw wrote. “Loyalty and dedication to your players is unmatched. Taping ankles and serving (the) club since the 60s.” The ‘proud Tasmanian’ passed away after the AFL’s announcement that the Apple Isle would get its own team, Shaw noted. Kilby was honoured with a spot on the team’s banner when he crossed 50 years of service in 2015.","pubDate":"2023-04-30 01:09:23","image_url":"https://images.7news.com.au/publication/C-10501311/fe5eb7a4728ed359c9ff6b29cf0a4dd1928fec9c-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"SEA Games Men’s U-22 Football: Cambodia wins 4-0 against Timor-Leste","link":"https://www.khmertimeskh.com/501281661/sea-games-mens-u-22-football-cambodia-wins-4-0-against-timor-leste/","keywords":["Sports","2023 Cambodia SEA Games","Cambodia Timor-Leste"],"creator":["Ratana"],"video_url":null,"description":"Cambodian U-22 team beat their Timorese counterpart 4-0 in their first match of Men’s football for SEA Games 2023 held at the National Olympic Stadium in Phnom Penh last evening. Cambodian Kouprey team scored two… The post SEA Games Men’s U-22 Football: Cambodia wins 4-0 against Timor-Leste appeared first on Khmer Times.","content":"Cambodian U-22 team beat their Timorese counterpart 4-0 in their first match of Men’s football for SEA Games 2023 held at the National Olympic Stadium in Phnom Penh last evening. Cambodian Kouprey team scored two goals in the first half and two more in the second half, obtaining three points. Chou Sinit got the first two goals at the 38th and 45th minutes, whereas Sor Rotana earned another one at 73th minutes, and Lim Pisoth at 82th minutes. Earlier in the afternoon, Indonesia also gained three points after winning over the Philippines 3-0. As scheduled, besides Timor-Leste, Cambodia will have matches with the Philippines on May 2, Myanmar on May 7 and Indonesia on May 10. A sea of blue greeted the team as they marched onto the pitch at the 50,000-seater National Olympic Stadium in Phnom Penh, before notching their first win over Group A opponents Timor-Leste. While Cambodia have never medalled in the football competition, the first-time hosts will be hoping that the Angkor Warriors will feature at the state-of-the-art Morodok Techo National Stadium, which will host the opening ceremony, as well as the semi-finals and finals for football. In the day’s earlier Group A game, Hanoi Games bronze medallists Indonesia secured a 3-0 win over the Philippines, courtesy of a Marselino Ferdinan goal just before half-time and late strikes in the 90th minute and in stoppage time from Irfan Jauhari and Fajar Fathur Rahman respectively. Group A consists of Cambodia, Indonesia, Myanmar, the Philippines, and Timor-Leste, while Group B of Laos, Malaysia, Singapore, Thailand, and Vietnam. C. Nika – AKP","pubDate":"2023-04-30 01:06:30","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"},{"title":"Snl24.com | Tau's Al Ahly Advance, CAF Semi-Final Fixtures Confirmed!","link":"https://www.snl24.com/soccerladuma/International/African-Football/caf-champions-league-percy-taus-al-ahly-advance-to-semi-finals-20230429","keywords":null,"creator":null,"video_url":null,"description":"The fixtures for the CAF Champions League semi-finals have been confirmed following the conclusion of the quarter-finals on Saturday night.","content":"Al Ahly advanced to yet another CAF Champions League semi-final following a goalless draw against Raja Casablanca in the second leg of their quarter-final. Bafana Bafana international Percy Tau kept his spot in the Al Ahly starting line-up after bagging an assist in the 2-0 first-leg win. The home side the perfect chance to get back on level terms before the halftime break after being awarded a penalty for Aliou Dieng's foul. However, Yousri Bouzok failed to take advantage after smashing his spot-kick against the crossbar as the Egyptian held on for the lead in the tie. That penalty missed proved to be costly for the home side, who were unable to find a breakthrough in the second half, which sealed Al Ahly's spot in the semi-finals. Espérance Sportive de Tunis secured passage to the final four following a 1-1 draw away to KS Kabylie. The Tunisian side came into the clash with a 1-0 lead from the first leg, but neither side were able to find a breakthrough in the opening 45 minutes. The start of the second half was then delayed after the two sets of fans clashing in the stands. The second half eventually got underway as the home side took the lead on 49 minutes through Mohamed Ali Ben Romdhane's strike to make it 2-0 on aggregate. Adem Redjem did pull a goal back for Kabylie in the 85th minute, but it was too little too late as the Tunisians held on for a spot in the last four. Defending champions Wydad Casablanca advanced to the semi-finals after defeating Simba SC on penalties at Stade Mohamed V. After trailing the first leg 1-0, the Moroccan giants opened the scoring on the night in the 24th minute courtesy of a strike from Bouly Junior. That goal levelled tie but would be the only goal in the second leg, which sent the game to a penalty shoot-out. The Moroccan outfit managed to hold their nerve to triumph 4-3 in the shoot-out, with Shomari Kapombe and Clatous Chama missing for Simba. Wydad Casablanca v Mamelodi Sundowns ES Tunis v Al Ahly You must be to read and post comments.","pubDate":"2023-04-29 23:40:48","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Watch: Wild scenes as Wests Tigers toast drought-breaking victory over NRL premiers Penrith Panthers","link":"https://7news.com.au/sport/rugby-league/wild-scenes-as-wests-tigers-toast-drought-breaking-victory-over-nrl-premiers-c-10497556","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"The waters flowed as the NRL’s bottom side belted out the most anticipated victory song of the year.","content":"Much-maligned halfback Luke Brooks and ex-Panther Api Koroisau have combined to help the last-placed wage the biggest upset in recent memory - a 12-8 defeat of two-time reigning premiers . The win in Bathurst halts the Tigers’ losing streak after seven losses to begin the season and five to end 2022. Watch the latest sport on Channel 7 or stream for free on Penrith were stilted and error-prone in torrential rain on Saturday night but mostly fell victim to a polished Tigers side that finally delivered on the potential shown this month. “It’s not just a win, it’s a really good win,” Tigers coach Tim Sheens said. “There was no luck in it. We worked really, really hard. “We had a good game plan we thought, we prepared for the rain, and the boys carried it out almost to the letter. “That will show the guys that if they stick to what they’re prepared to do, we’ve got a decent football team there.” The result intensifies pressure on an admittedly undermanned Panthers side that has now started their premiership defence with four wins and four losses. “In the conditions, they played better,” Panthers coach Ivan Cleary said. “They deserve a lot of credit but we didn’t play real smart tonight. “We definitely feel like we added to the loss ourselves tonight.” Without injured halves partner Adam Doueihi, Brooks rose to the challenge of booting the Tigers into momentum. The Tigers’ two tries both came directly after Brooks 40/20 kicks, the first of which was in the first set of the night. After his first pinpoint kick, Brooks threaded a grubberkick through the defence to give Brandon Wakeham the opening try - all before the reigning premiers had touched the ball. “His kicking game was how we won today,” Koroisau said of Brooks. Hooker Koroisau had his best game since leaving the Panthers last year and was the Tigers’ general in the middle of the park. He came within inches of scoring a try from his own grubberkick in the first half and just after halftime, tore through the defence on a line break that could have given the Tigers a second try had there been a support runner. The performance would not have gone unnoticed by NSW coach Brad Fittler, who is set to choose between Koroisau and Damien Cook when he names his team for State of Origin I. But penalties cost the Tigers; they conceded three in the space of eight minutes in the first half and on the back of a high tackle from Brooks, the Panthers marched upfield to score their only try through Tyrone Peachey. The Tigers did well to avoid conceding points while centre Brent Naden was in the sin bin for laying a shoulder charge on Zac Hosking that is likely to earn him a suspension. “When ‘Nado’ went off to the bin we were awful,” Cleary said. In his second NRL game, Tigers fullback Jahream Bula was outstanding, setting David Nofoaluma up for his 100th career try with a cut-out pass and fielding Nathan Cleary’s high kicks with aplomb all night. Down 12-8, Penrith looked to have equalised when Nathan Cleary burst through the defence but the ball bounced free of his grasp in slippery conditions as rookie fullback Jahream Bula slid over in cover defence. It was one of 11 errors for the Panthers, many of which came in good territory. Referee Adam Gee pulled the play back to sin-bin Penrith interchange hooker Soni Luke for a hip-drop tackle on Alex Twal as the final 10 minutes approached and the Tigers held on. Injury continues to ravage the Panthers’ middle forward rotation, with Matt Eisenhuth set to join James Fisher-Harris and Spencer Leniu on the sidelines after picking up a game-ending shoulder complaint in the 15th minute. Cleary was unsure of the severity of Eisenhuth’s injury post-match.","pubDate":"2023-04-29 23:18:29","image_url":"https://images.7news.com.au/publication/C-10497556/3ce9c5c1f59c3e7d167b94fda6695bfe201292f4-16x9-x0y0w1304h734.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"WATCH: Back to back wins for Bulawayo Chiefs","link":"https://www.sundaynews.co.zw/watch-back-to-back-wins-for-bulawayo-chiefs/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Brandon Moyo Sports Reporter Bulawayo Chiefs . . . . . . . . . . . . . . . . . . . . . . (1) 2 Yadah . . . . . . . . . . . . . . . . . . . . . . . . […]","content":"The Sunday News Bulawayo Chiefs . . . . . . . . . . . . . . . . . . . . . . (1) 2 Yadah . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (1) 1 BULAWAYO Chiefs continued with their newly found fine form from last week after recording their second consecutive victory of the season in a Castle Lager Premier Soccer League match played yesterday against Yadah FC at Luveve Stadium. A first half goal from Farau Matare and a second half one from Billy Veremu who cancelled out Prosper Kafelapanjila’s equaliser were enough to hand Amakhosi maximum points at home. Mthokozisi Msebe, who scored a goal and two assists in the 3-2 triumph over Dynamos last Sunday was involved in both goals for Amakhosi Amahle. Msebe now has been involved in all the five goals scored by Chiefs in two matches. After a good display of football by both sides, with a couple of missed chances, it took an excellent Msebe pass to Matare to break the deadlock with 32 minutes played. Matare managed to round off the charging Yadah goal minder, Panashe Nyabunga to slot home and put the Twitter Kings into the lead. Five minutes later, the home side had the chance of doubling their lead, Matare’s header hitting the crossbar from a Msebe free kick. Caught napping at the back, the visitors counter attacked and managed to hit the back of the net through Kafelapanjila and level matters, seven minutes before the half time break. Veremu put Chiefs ahead with a well-executed header, after a brilliant cross into the box by Msebe. Searching for the equaliser, Yadah could not penetrate the Chiefs defence as they suffered their fourth defeat of the season. Lizwe Sweswe, the Chiefs gaffer, believes team morale and confidence has been key in his team finally getting it right as evidenced by the two wins in a row. “Of late the boys have been doing well, and I am happy that we are coming up in terms of the operations in terms of our systems of play. A coach will never be satisfied but the boys are working so hard and I am happy for them, this win will take us somewhere,” said Sweswe. He added that the key to taking maximum points in yesterday’s game was making sure that they were not vulnerable when defending as they were playing with three men at the back. Sweswe also believes that maintaining a winning streak is about self-belief and confidence and knowing that each and every game they play will have different approaches and strategies. His Yadah counterpart, Expense Chitukutuku was impressed with the quality of football displayed by both teams. However, he was let down by the result as they went back to the capital city empty handed. He believes they have to work on their mentality before matches as the players have been making a lot of mistakes which cost them. “The game was good, good teams with young players, good competition. We came with a good game plan after watching them play (Chiefs), we were in control of the first half and we managed to get an equaliser. These youngsters are making blunder after blunder and I think we now have to work on their mentality before going into the game,” said Chitukutuku. With Chiefs moving to nine points, Yadah remained two behind from Chiefs from the seven matches they have played. Bulawayo Chiefs: K Dube, K Sibanda, M Msebe, A Ncube (Sibanda 57 mins), M Mkolo, B Rusinga, M Gasela, D Phiri, B Veremu (Nkosilathi Ncube 90+5 mins), F Moyo, F Matare (Gama 86 mins). Yadah: P Nyabunga, B Kadamanja, M Faranando, M Mlilo, T Musariri (Chome 73 mins), C Mandivei, J Zindoga, K Nadolo (Sango 70 mins), P Kafelapanjili (Nyamakura 73 mins), B Ndereki, D Kibaki (Masiwa 70 mins). — Twitter @ brandon_malvin","pubDate":"2023-04-29 22:05:42","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Finale de la Coupe de France TFC-Nantes : historique ! Toulouse remporte le trophée en écrasant les Nantais","link":"https://www.ladepeche.fr/2023/04/29/finale-de-la-coupe-de-france-tfc-nantes-toulouse-remporte-la-coupe-de-france-dans-un-match-a-sens-unique-11166500.php","keywords":["Toulouse Football Club"],"creator":null,"video_url":null,"description":"Dans une finale à sens unique, le Toulouse Football Club s'adjuge sa deuxième Coupe de France, après celle remportée en 1957. Sur le score de 5-1, le TFC a impressionné dans un match où les Nantais étaient aux abois....","content":"4': 0-1 . Ouverture du score de Toulouse ! Logan Costa titulaire dans l'axe de la défense ouvre la marque. Sur le premier corner du match, l'inévitable Branco van den Boomen se charge de tirer le coup de pied de coin. Logan Costa seul dans les six mètres met une tête rageuse. Alban Lafont ne peut rien faire. A lire aussi : VIDEO. Le TFC remporte la Coupe de France : les doublés de Dallinga et Costa, le missile d'Aboukhlal ! Les buts de la finale historique du TFC 10': 0-2 . On prend les mêmes et on recommence. Coup franc pour Branco van den Boomen non loin du poteau de corner gauche. Le ballon est contré par Girotto au premier poteau et file au deuxième jusque dans les pieds de Spierings qui, en une touche de balle, remet la balle devant le but. Et c'est Logan Costa qui surgit de nouveau pour y mettre la tête. A lire aussi : Le TFC remporte la Coupe de France : heure d'arrivée à l'aéroport, réception au Capitole... Ce qu'il faut savoir sur le retour des héros ce dimanche 23': 0-3 . Toulouse prend le large. Sur une phase de jeu qui paraît anodine, le défenseur chilien Suazo réalise une passe incroyable de plus de 50 mètres. En profondeur sur Dallinga, l'attaquant néerlandais pique une petite balle au-dessus de Lafont A lire aussi : REPLAY. Finale Coupe de France TFC-Nantes : l'énorme match de Toulouse qui décroche le trophée en balayant les Canaris ! Revivez le match 31': 0-4 . C'est fou ! Toulouse marque le quatrième but. Van den Boomen sert Chaibi à droite qui frappe au but sur Lafont. L'ancien gardien du Téf ne parvient pas à se saisir du ballon et renvoi le ballon dans les pieds de Dallinga qui conclue dans le but vide. Score à la mi-temps : 0-4 75' : 1-4 . Nantes sauve l'honneur. Sur un penalty provoqué par Rasmus Nicolaisen, Ludovic Blas ne tremble pas face à un Kjetil Haug pas dans un grand jour. 79' : 1-5 . Toulouse parachève son récital. Sur un coup franc contré de Van den Boomen, Ado remet la balle en retrait pour Aboukhlal qui frappe à l'entrée de la surface. Le ballon est contré Lafont ne peut rien faire. Score final : 1-5 Choix fort du coach depuis le début la compétition, le défenseur Cap-Verdien Logan Costa, était évidemment présent ce soir en finale de Coupe de France pour épauler Rasmus Nicolaisen dans l'axe de la défense toulousaine. Et le suppléant de Rouault en championnat, n'a pas manqué sa finale. En marquant à la 4' et à la 10' sur coup de pied arrêtés, le joueur de 22 ans a montré la voie aux Toulousains. Il devient d'ailleurs le premier joueur à marquer un doublé aussi rapidement en Coupe de France. A lire aussi : REPLAY. Le TFC remporte la Coupe de France : grosse fiesta dans le vestiaire de Toulouse et place du Capitole ! Revivez cette journée de folie Alors si le défenseur Costa marque, l'attaquant Dallinga a eu la même idée. À la 23' et la 31', le Néerlandais s'est lui aussi offert un doublé. D'un lob astucieux premièrement et d'un plat du pied facile dans un second temps l'attaquant s'offre son sixième but en Coupe de France cette année. Dans un scénario auquel personne ne s'attendait, les Toulousains ont décidé de marquer l'histoire de la compétition. Tout d'abord grâce à son défenseur Logan Costa, qui devient le joueur a marqué le doublé le plus rapide dans une finale de Coupe de France, avec un doublé en six minutes. A lire aussi : Finale de la Coupe de France TFC-Nantes : la compo de Toulouse ! Avec quelques surprises pour cette rencontre historique Un doublé de Costa suivi d'un doublé de Thijs Dallinga, qui permet aux violets d'égaliser un autre record. En effet, avec ces quatre buts dans les 45 premières minutes, le TFC égalise la statistique du match entre Nantes et Bordeaux en 1955. Avec un début de match canon, les joueurs du TFC se sont rendus le match facile? Deux buts dans les dix premières minutes ! Qui plus est, un doublé de Logan Costa. Face à des Nantais amorphes en défense et qui touchent peu de ballons, le TéFéCé a respecté son plan de jeu... sans pressions. Et après une accalmie d'une dizaine de minutes, Toulouse remet le couvert et plie presque déjà le match avec un troisième but de Dallinga. Puis moins de dix minutes plus tard, Dallinga s'offre un doublé. Un match qui paraît irréel tant les Toulousains sont dominateurs, mais aussi parce que les Nantais ne proposent rien. A lire aussi : Finale de la Coupe de France TFC-Nantes : la justice suspend l'interdiction de distribuer cartons rouges et sifflets avant la rencontre En seconde mi-temps, le match est plus équilibré. Peut-être parce que les Nantais se sont un peu réveillés, ou alors car les Toulousains ont levé le pied. Dans vingt dernières minutes où les joueurs du TéFéCé ont laissé le ballon aux Nantais, ils concèdent un penalty, de quoi sauver l'honneur pour les Canaris. Mais ce but n'y change rien, Toulouse remet la machine en route et inscrit un cinquième but. Après la victoire 6-3 il y a 66 ans, Toulouse offre encore une pluie de but et un succès 5-1. La nuit risque d'être belle sur les bords de la Garonne.","pubDate":"2023-04-29 22:03:21","image_url":"https://images.ladepeche.fr/api/v1/images/view/644d91fd2ae00b777e62c948/standard/image.jpg?v=2","source_id":"ladepeche","category":["sports"],"country":["france"],"language":"french"},{"title":"Finale de la Coupe de France : cartons rouges, sifflets… À Saint-Denis, la contestation sociale est restée hors du stade","link":"https://www.francetvinfo.fr/sports/foot/coupe-de-france/finale-de-la-coupe-de-france-cartons-rouges-sifflets-a-saint-denis-la-contestation-sociale-est-restee-hors-du-stade_5798714.html#xtor=RSS-3-[sports]","keywords":null,"creator":null,"video_url":null,"description":"À l'occasion de la finale de la Coupe de France remportée par Toulouse face à Nantes (5-1), les syndicats souhaitaient profiter de la présence d'Emmanuel Macron à Saint-Denis, samedi, pour afficher leur contestation. Hormis de timides sifflets à la 49e minute de jeu, le football est finalement resté au cœur de l’attention.","content":"La performance sportive n'a pas été éclipsée. Les Toulousains ont remporté leur première Coupe de France, samedi 29 avril, en écrasant le FC Nantes au terme d'une finale à sens unique (5-1) . La fin d'une soirée scrutée par beaucoup en raison de la présence d'Emmanuel Macron dans les tribunes du Stade de France en pleine période de mobilisation sociale. Mis à part quelques huées entendues lorsque le chronomètre de la rencontre a affiché 49 minutes et 3 secondes, en référence au 49.3 utilisé par Elisabeth Borne pour faire passer la réforme des retraites, la contestation sera finalement restée en dehors de l'enceinte de Saint-Denis. Cartons rouges et sifflets contre les retraites Sur les coups de 17 heures, les syndicats se sont pourtant massés devant les sorties du RER B, du RER D et du métro 13 d'où commençaient à se déverser des vagues jaunes et violettes. La levée de l'arrêté préfectoral leur interdisant de distribuer des cartons rouges et des sifflets aux supporters venant d'être levée par le Tribunal administratif de Paris. \"C'était vraiment important que la justice ait autorisé cette manifestation. Dès qu'on a eu l'information, on s'est tous réunis ici pour distribuer ce carton rouge à la retraite à 64 ans , raconte Xavier, syndicaliste du SNU, qui espérait une action largement suivie dans le stade. Pour certains, cet acte de revendication politique est évident, pour d'autres moins mais quoi qu'il arrive cela permet de discuter\". Venu avec un autre ami nantais, Aurélien a justement pris les deux objets avec plaisir. \"Il faut faire le plus de bruit possible. On a l'occasion de faire passer un message, c'est important. Pour moi, la retraite c'est loin mais je le fais pour la génération du dessus\" , explique le jeune homme de 22 ans dont les parents sont peintre en bâtiment et assistante maternelle. Aurélien et Yannis ont récupéré les cartons rouges et les sifflets distribués par les syndicats aux abords du Stade de France, le 29 avril 2023. (GABRIEL JOLY) Un son de cloche similaire chez Christophe, qui a fait le déplacement avec sa famille depuis Toulouse. Ce cheminot de 62 ans a participé à toutes les journées de grèves depuis le début de la mobilisation contre la réforme des retraites. \"62 ou 63 ans, c'est déjà trop. Evidemment qu'on va tous siffler et brandir nos cartons\" . Confusion à l'entrée L'effet n'a finalement pas été celui escompté. Non seulement car pour la grande majorité des supporters, la priorité était bien la finale : Nantes pouvait espérer faire le doublé en gardant son titre quand le TFC cherchait à obtenir son premier trophée majeur. Mais aussi en raison d'une confusion au moment de pénétrer dans l'enceinte dionysienne. Lorsqu'ils se sont présentés devant leur porte, maillot de Toulouse sur le dos, Etienne et sa fille Louise ont vu les stadiers leur demander de jeter leurs cartons rouges. Une consigne passée dans un premier temps à la sécurité, alors qu'il ne s'agissait pourtant pas d'un objet interdit par le règlement intérieur stade 2023 disponible sur le site de la FFF (contrairement à \"tous les types d'instruments de musique et de cornes de brume\", y compris les sifflets pour ne pas perturber l'arbitre). Si ces fans du Tef' ont finalement pu entrer dans le stade avec les cartons, après avoir réclamé, excédés, l'intervention d'un responsable de la palpation – qui a tout compte fait indiqué qu'ils avaient \"uniquement obligation d'enlever les sifflets\" – certains ne se sont pas entêtés. Résultat, les cartons n'ont pas été nombreux à se montrer en tribunes, d'autant que le visage du président de la République n'est jamais apparu sur l'écran géant du stade. Contrairement aux Violets, largement fêtés par le public occitan.","pubDate":"2023-04-29 21:54:37","image_url":"https://www.francetvinfo.fr/pictures/cY_uyUmUn9Lel6P_wplBOwoMPGI/752x423/2023/04/29/644d87f580380_img-3437.jpg","source_id":"francetvinfo","category":["sports"],"country":["france"],"language":"french"},{"title":"Реал з хет-триком Бензема обіграв Альмерію, Барселона розгромила Бетіс: результати 32 туру Ла-Ліги","link":"https://champion.com.ua/football/2023/04/29/928101/real-z-khet-trykom-benzema-obihrav-almeriyu-barselona-rozhromyla-betis-rezultaty-32-turu-la-lihy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У межах 32-го туру іспанської Ла-Ліги Ельче вдома переміг Райо Вальєкано, Реал переграв Альмерію.Чемпіонат Іспанії - Ла-Ліга32 тур, 29 квітняЕльче - Райо Вальєкано 4:0 (1:0)Голи: 1:0 - 45+1 Тете Моренте, 2:0 - 52 Боє, 3:0 - 53 Фідель, 4:0 - 72 Гумбау...","content":"Джерело - Чемпіон . У межах 32-го туру іспанської Ла-Ліги Ельче вдома переміг Райо Вальєкано, Реал переграв Альмерію. Чемпіонат Іспанії - Ла-Ліга 32 тур, 29 квітня Ельче - Райо Вальєкано 4:0 (1:0) Голи: 1:0 - 45+1 Тете Моренте, 2:0 - 52 Боє, 3:0 - 53 Фідель, 4:0 - 72 Гумбау Реал Мадрид - Альмерія 4:2 (3:1) Голи: 1:0 - 5 Бензема, 2:0 - 17 Бензема, 3:0 - 42 Бензема (пен), 3:1 - 45+1 Лазаро, 4:1 - 47 Родріго, 4:2 - 61 Робертоне Барселона - Бетіс 4:0 (3:0) Голи: 1:0 - 14 Крістенсен, 2:0 - 36 Левандоський, 3:0 - 39 Рафінья, 4:0 - 82 Родрігес (автогол) ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-04-29 20:58:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Рома зіграла внічию з Міланом, Аталанта перемогла Торіно: результати 32 туру Серії А","link":"https://champion.com.ua/football/2023/04/29/928111/roma-zihrala-vnichyyu-z-milanom-atalanta-peremohla-torino-rezultaty-32-turu-seriyi-a","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Відбулися матчі32-го туру італійської Серії А.Чемпіонат Італії - Серія А32 тур, 29 квітняРома - Мілан 1:1 (0:0)Голи: 1:0 - 90+3 Ебрахам, 1:1 - 90+7 СалемакерсТоріно - Аталанта 1:2 (0:1)Голи: 0:1 - 34 Дзаппакоста, 1:1 - 75 Санабрія, 1:2 - 88 Сапата✅ П...","content":"Джерело - Чемпіон . Відбулися матчі 32-го туру італійської Серії А. Чемпіонат Італії - Серія А 32 тур, 29 квітня Рома - Мілан 1:1 (0:0) Голи: 1:0 - 90+3 Ебрахам, 1:1 - 90+7 Салемакерс Торіно - Аталанта 1:2 (0:1) Голи: 0:1 - 34 Дзаппакоста, 1:1 - 75 Санабрія, 1:2 - 88 Сапата ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-04-29 20:41:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Бейл відхилив пропозицію відновлення кар'єри","link":"https://champion.com.ua/football/2023/04/29/928092/beyl-vidkhylyv-propozytsiyu-vidnovlennya-karyery","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Ексгравець Реала та збірної Вельсу Гарет Бейл відхилив пропозицію про відновлення кар'єри футболіста.Про це повідомляє Goal.com.Підписати гравця намагався Рексем, але Бейл відповів відмовою.Бейл завершив кар'єруу січні поточного року. Останнім клубом...","content":"#The International 2019 на 33 млн доларів. , #Гарет Бейл Джерело - goal.com . Ексгравець Реала та збірної Вельсу Гарет Бейл відхилив пропозицію про відновлення кар'єри футболіста. Про це повідомляє Goal.com. Підписати гравця намагався Рексем, але Бейл відповів відмовою. Бейл завершив кар'єру у січні поточного року. Останнім клубом у його кар'єрі був Лос-Анджелес. Рексем виступає в п'ятому за силою дивізіоні англійського футболу. Клубом володіють голлівудські актори Раян Рейнольдс і Роб Макелхенні.","pubDate":"2023-04-29 20:35:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"}]}