{"newsArray":[{"article_id":"cd52bfafcf9dfe98f09a4a58a5bdfc90","title":"Швейцарци развенчаха мита за чужденците и България, Берое, ЦСКА - София и Лудогорец с най-много легионери","link":"https://sportal.bg/news-2023101915184895032","keywords":["БГ Футбол"],"creator":null,"video_url":null,"description":null,"content":"Чужденците в българското футболно първенство през сезон 2023/24 са 49,4 процента, което е среден резултат при изследването на статистическия институт CIES Football Observatory, базиран в Швейцария, пише БТА. Думите на селекционера на националния отбор Младен Кърстаич преди контролната среща с Албания, че чужденците в efbet Лига са прекалено много и ако тенденцията се запази, то българският футбол го чакат черни дни, предизвика сериозна полемика. Освен обичайната лавина от хейт-коментари в двете посоки в социалните мрежи, отношение взе и президентът на Професионалната лига Атанас Караиванов. Той подкрепи с факти мнението си, че Кърстаич не е прав и дори поиска уволнение за сръбския треньор. Проверка в данните швейцарската статистическа компания обаче показва, че тенденцията в България по ангажиране на чужденци не се различава много от общоевропейската. И при повечето от изследваните 31-о първенства показателите са сходните. В интерес на истината, близки резултати до българските са първенства с доста повече финансови възможности като Унгария, Швейцария и Полша, но и такива с по-ниско заплащане като Словения. Но също така и държави със сходно ниво на футбола, но с много по-голям човешки потенциал, каквато е Румъния. Интересното е, че 45 % от футболистите във френската Лига 1 са легионери. А Франция е страна номер 1 по износ на футболисти в Европа, както и Световен шампион от 2018-а година, втора на последния Мондиал в Катар и винаги в топ 4 на Лигата на Нациите. Което показва, че дори 45 на сто да са легионери, първенството пак дава футболисти за националния отбор, ако клубовете си вършат работата както трябва. Безспорен номер 1 е шампионатът на Кипър, в който 82,9 процента от футболистите са дошли извън границите на острова. Следва турската Суперлига, която в последните години отново повишава нивото си. 71,2 процента от футболистите са чужденци, но това не пречи на местните клубове да произвеждат таланти и да правят зашеметяващи трансфери. Пресен пример е продажбата на 18-годишния Арда Гюлер в Реал (Мадрид), за който Фенербахче получава за момента 20 милиона евро. Третата държава с най-много чужденци в Европа е Гърция, като в местната елитна Суперлига външните играчи са в същия размер – 71,0 %. Но това също не пречи да се вадят качествени местни топ-играчи. Идната зима или най-късно през лятото 19-годишният Янис Константелиас от ПАОК най-вероятно ще смени Солун с някое от европейските топ 5 първенства. Английската Висша лига е на 4-о място с 64,6 процента чужденци, но тази бройка нито отслабва националния отбор, нито лишава страната от бъдещи таланти, идващи от академиите. Същото може да се каже и за северните съседи от Шотландия, които имат 64,5 процента внос на играчите, но националният им отбор беше един от първите, които си гарантираха участие на Евро 2024. Близката среща на унгарския национален отбор по футбол с българския от тази пролет даде ясна представа на феновете какво представляват „маджарите“ на терена. Но в местното първенство чужденците са 47,1 процент, което по никакъв начин не намалява класата на националния тим. Същото е и за доста по-богатата Швейцария, чиито клубове разчитат на 47,9 процента футболен внос. Но националният отбор вече чака жребия за следващото Европейско първенство. В българското първенство безспорен номер 1 е отборът на Берое, придобиващ специална слава заради чужденците, които идват благодарение на новия собственик Ернан Банато. Старозагорци разчитат на 81,9 процента външни футболисти, следвани от ЦСКА - София с 81,4 и Лудогорец със 79,8. Следват Ботев (Пловдив) със 73,3 и Левски (София) с 61,8. На обратния полюс са Етър (13,6), Славия (16,8) и Славия (20,4). По отношение на възрастта на футболистите българското първенство също е в почти перфектна позиция. Категорично не може да се каже, че играят ветерани, а напротив – играчи в най-хубавата възраст за футбол. Футболистът от efbet Лига е на 26,3 години, като най-старите футболисти са в Кипър (28,6) и Гърция с 28,5. Следват Турция - 28,2, Румъния (27,5), следвани от Полша (27,1) и Унгария, Израел, Русия, Германия и Чехия с възраст 27,0. Carlsberg \"Домът на Феновете\" е новата секция на Sportal.bg за игри. С регистрацията си Вие ще можете да персонализирате Вашето съдържание и да участвате в за страхотни награди.","pubDate":"2023-10-19 15:18:48","image_url":"https://sportal365images.com/process/smp-images-production/sportal.bg/02092023/bb4818bc-7bd6-4ccd-8ecd-65c8798bbe5d.jpg","source_id":"sportal","source_priority":163647,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"1f4cd48731664442db46f60c2ee4077e","title":"New Manchester United owner wants two of the most exciting young stars in the world: report","link":"https://www.fourfourtwo.com/news/manchester-united-transfer-news-owner-wants-two-of-the-most-exciting-young-stars-in-the-world-report-florian-wirtz-bayer-leverkusen-nico-williams-athletic-club-bilbao-signings-rumours-gossip-paper-talk-mufc-luhg-ggmu","keywords":["Stories"],"creator":null,"video_url":null,"description":"Manchester United could be about to land two of the most scintillating young stars on the planet, thanks to their new investor","content":"Manchester United could be about to land two of the most exciting young superstars in world football, thanks to their new investor. Sir Jim Ratcliffe is waiting for the approval of his £1.3 billion bid for 25 per cent of , the club he's supported all of his life. The INEOS billionaire will take care of the sporting side of the business – and that could mean a squad overhaul. According to , Ratcliffe plans to install a sporting director, but already two new players have been linked with the Reds Devils. in Spain have claimed that want to rival Man United for the signing of superstar, Florian Wirtz, who is widely regarded as one of the best young footballers in Europe right now. Furthermore, star, Nico Williams, is a target on a free transfer, as cited by . Should United manage to land both, it would be a huge statement of intent from Ratcliffe, who has for spending \"dumb money\". Williams and Wirtz could theoretically replace Jadon Sancho and Antony, who have both hugely underwhelmed after landing at Old Trafford for over £150m combined. Sancho is currently exiled from the side, while Antony has only just rejoined it, following time away from the team to address allegations of assault. Wirtz would no doubt be an expensive signing, though, given that he currently has a contract that runs until 2027. With Leverkusen flying high in the Bundesliga, they would not want to lose him and could command a similar fee to the £72 million they got for Kai Havertz. Williams, however, is a free agent from next summer.","pubDate":"2023-10-19 14:53:48","image_url":"https://cdn.mos.cms.futurecdn.net/M3TiQzJGFW5uP23MhVaXaN.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"365ccec8b7171ad53d14521fc374c90a","title":"Man Utd confirm key player set to miss Sheff Utd match but two injured stars return to training","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-confirm-key-player-set-to-miss-sheff-utd-match-but-two-injured-stars-back-in-training-4378361","keywords":["Manchester United","Football","Sport"],"creator":["Michael Plant"],"video_url":null,"description":"Manchester United face the division's bottom side on Saturday night, but will be without one their regular starters.","content":"Manchester United face the division's bottom side on Saturday night, but will be without one their regular starters. have confirmed that Casemiro is unavailable for Saturday's Premier League encounter . It was confirmed by the club last week that the ex-Real Madrid star had picked up a knock while on international duty, but he played the full 90 minutes as Brazil lost to Uruguay in midweek. Advertisement Advertisement Did you know you can manage your profile, and explore all of the available newsletters from ManchesterWorld within your account. It was presumed, therefore, that Casemiro would be available for the but United announced on Thursday afternoon that he won't be an option for Erik ten Hag. \"Casemiro was absent [from training on Thursday] having remained in Brazil, on the club’s advice, to recover as swiftly as possible from a small issue picked up while playing for his country,\" the Red Devils said via . United added that Casemiro is set to return to England 'early next week' and will resume training ahead of the Champions League encounter against Copenhagen, although the 30-year-old is suspended for the game following his red card last time out against Galatasaray. After playing a starring role last term at Old Trafford, Casemiro has struggled to perform at the same level this season, and he was in United's final game before the international break: a . Advertisement Advertisement Elsewhere, with the club have confirmed that Sergio Reguilon and Sofyan Amrabat have trained this week. The latter didn't feature in either of Morocco's matches over the international break, leading to suggestions he is injured, while Reguilon hasn't played since the 1-0 win over Burnley on 23 September, due to injury. His return will be a significant boost for Ten Hag given fellow left-backs at present. Assuming both are fit to start, Reguilon and Amrabat are likely to be named in United's XI on Saturday, with the Red Devils aiming to build on that injury-time comeback against Brentford. Ten Hag is expected to give a full fitness update in Friday's press conference, with the availability of Jonny Evans, Kobbie Mainoo and Amad unclear, while Aaron Wan-Bissaka, Lisandro Martinez and Jadon Sancho are absent, along with Shaw and Malacia.","pubDate":"2023-10-19 14:53:36","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/10/19/14/GettyImages-1678208062.jpg?width=1200&auto=webp","source_id":"manchesterworld","source_priority":123384,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"520bc386f3328058507b54c7d79d9377","title":"'Really had enough' - Tony Bellew rages at Everton woes as blame shared on talkSPORT","link":"https://www.goodisonnews.com/2023/10/19/tony-bellew-rages-at-everton-players-sick-of-blaming-managers-for-woes/","keywords":["News","everton","Tony Bellew"],"creator":["Joe Roberts"],"video_url":null,"description":"Everton managers can’t continue to be blamed for the club’s struggles as the “buck needs to start stopping” with the players, according to Tony Bellew. Speaking live on talkSPORT (19 October), the former boxer claimed the Toffees have had exceptional managers in the dugout in recent history who have failed to bring results, meaning the ... The post 'Really had enough' - Tony Bellew rages at Everton woes as blame shared on talkSPORT appeared first on Goodison News.","content":"Speaking live on (19 October), the former boxer claimed the Toffees have had exceptional managers in the dugout in recent history who have failed to bring results, meaning the players must take more responsibility. Bellew insisted the club need to have faith in a manager instead of returning to the “revolving door” of appointments that has brought them no success. Bellew said: “We need some kind of stability at our club. We need to believe and stick with a manager right til the end. I’m sick of the revolving door going around and managers going in and going out – I’ve really had enough of it now. “We need to show faith in the one that we’ve got. Ultimately, instead of blaming managers, I’ve got to be totally honest, the buck needs to start stopping in the dressing room with the lads, and they all know that. “We can’t keep blaming the managers. We’ve had some of the best managers the game’s [seen]. We’ve had the likes of Carlo Ancelotti, the likes of your Ronald Koemans, your Roberto Martinez’s, your David Moyes’. “I’m sick of blaming managers. At some point or another, someone’s got to go, ‘Right, sort these out.” While the players must give 100 per cent in every minute of football they play, they can’t be solely blamed the Everton’s continued struggle in recent seasons. Everton’s managerial appointments have been mostly unsuccessful. While the likes of Koeman left after poor form, the Goodison Park faithful would kill to finish in seventh place like the Dutchman achieved. Nethertheless, Everton of 2023 is a long away from the Everton of 2017, and Toffees fans have adjusted expectations accordingly. This season, the players have put in good performances and have been adept at creating chances. The recurring problem is the poor finishing up top, but Sean Dyche will back himself to change the fortunes of the likes of Beto and Arnaut Danjuma. While managers would certainly have a huge say in recruitment, the frequent high spending on underwhelming players has been a major downfall. Then, after the “revolving door” of managers, the profile of the squad has become a hodgepodge of different bosses’ philosophies who retained little resale value after their poor form. Everton desperately needs Dyche to work at the club and bring the needed sustainability, but Goodison Park has rarely been a predictable place. .","pubDate":"2023-10-19 14:40:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2021/09/Untitled-design-2021-09-22T193613.976-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"76a6dc911de71199cad1b419e35421a2","title":"Footage of Man Utd boss Erik ten Hag's 'dreadful' pass from playing days goes viral","link":"https://www.dailystar.co.uk/sport/football/man-utd-erik-ten-hag-31230094","keywords":["Sport"],"creator":null,"video_url":null,"description":"Manchester United boss Erik ten Hag won't want to see back a clip which is going viral from his playing days where he makes a right pig's ear of a simple pass","content":"has gone viral after footage emerged of the boss horribly miscuing a pass in his playing days. The Dutchman, 53, had a solid yet unremarkable active career as a centre back for FC Twente, De Graafschap, RKC Waalwijk and FC Utrecht in his home country before retiring at the age of 32. All in all he made in excess of 300 senior appearances. Back then defenders didn't have to be as good with the ball at their feet as they are nowadays - and that showed when he would make the move into defensive midfield on occasion. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month He's been done particularly dirty by one clip in which he receives the ball on the half turn in the middle of the park and attempts to play a simple pass out to the ring wing, where one of his team-mates was waiting. But instead of finding him, Ten Hag blasted the ball into the stand for a throw-in to the opposition. The broadcast then cut to a close up camera shot of the back of his shirt to leave no doubt about who the culprit was. United fans were left embarrassed by the poor quality, with one pleading: \"Don’t tell me that’s my manager.\" Another sighed: \"That was dreadful.\" Rival fans lapped it up on social media and teased the Red Devils supporters, with one joking: \"Is this the same guy that said... eras comes to an end.\" A second quipped: \"This one didn't want Ronaldo in his team? Lmao.\" A third brutally commented: \"No wonder he is leading Man Utd to the trenches.\" And referring to the recent poor form of Andre Onana, a fourth wrote: \"Like coach like keeper.\"","pubDate":"2023-10-19 14:38:49","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31230377.ece/ALTERNATES/s98/1_eth-passjpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a1af70fb27da4029f612e18c740782b4","title":"'My team-mate used the N-word after I warned him not to – so I sparked him out'","link":"https://www.dailystar.co.uk/sport/football/leroy-lita-championship-team-mate-31229826","keywords":["Sport"],"creator":null,"video_url":null,"description":"Leroy Lita has explained how he clashed with a former team-mate after the repeated use of the N-word - before he left him in agony on the floor","content":"Leroy Lita left a former team-mate on the floor in agony after warning him not to say the N-word - but he persisted in doing so. Best known for his spells with Bristol City, and , Lita spent 14 seasons in the Football League and once had a bad falling out with a colleague. Speaking on the Under The Cosh podcast, Lita said of the incident: \"Cheltenham Races during the season, March or whatever, so we all went down there. Had a good day out with good banter and everything like that. We got back and I remember the bar we used to (go to). We were all in there, empty, it was just us in there on a Tuesday night or something like that. \"Having a drink, sat next to (his team-mate) and he started singing a song and it included the N-word. I just said: 'Alright mate, don't say that'.\" Lita explained how the team-mate insisted he wasn't using the word towards him - but the striker told him not to say it in his presence. Lita added: \"I told him 10 times, then I said if you say it one more time I'm going to smash your face in.\" The player is then said to have repeated the word while saying he wasn't using it in the direction of Lita, who then admitted to losing his cool. He added: \"I lost my head and a team-mate came over and grabbed me, he's held me for about five minutes, I said: 'Listen, hold me as long as you want, as soon as you let me go I'm going for him, end of'.\" Lita was taken outside and the team-mate he was planning to run at followed, who allegedly kept saying the word while trying to use it in defence. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month When explaining what happened after he was let go, Lita added: \"I just went boom boom boom, (he) dropped on the floor, left him. Carried on with our night. (I) give him a couple of kicks to the face. He didn't even get to throw a punch.\" Lita spoke of the aftermath and said his manager was on the phone within two hours, telling him to come and visit in the morning. The veteran forward, who now plays for Nuneaton Borough at the age of 38, said he explained the situation and why he wouldn't be apologising or shaking anyone's hand, then walked out of the manager's office, never speaking to the team-mate again.","pubDate":"2023-10-19 14:36:08","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31229964.ece/ALTERNATES/s98/0_MAIN-PICS-My-team-mate-used-the-N-word-after-I-warned-him-not-to-so-I-sparked-him-out-Leroy-L.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c3af7f0915418fac769c5fc400a836bc","title":"No UEFA competition matches to be played in Israel ‘until further notice’","link":"https://www.northwaleschronicle.co.uk/sport/national/23866798.no-uefa-competition-matches-played-israel-until-notice/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The announcement comes amid the escalating Israel-Palestine conflict","content":"European football’s governing body has announced that no UEFA competition matches will be played in Israel until further notice. Israel’s national teams and club sides Maccabi Haifa and Maccabi Tel Aviv, who are both competing in Europe, must find alternative venues outside the country to fulfil their UEFA fixtures. The announcement comes amid the escalating Israel-Palestine conflict, which was sparked earlier this month by an attack on Israeli citizens by Hamas militants. A UEFA statement read: “After a thorough evaluation of the current safety and security situation in the whole territory of Israel, the UEFA Executive Committee decided that no UEFA competition matches shall be played in Israel until further notice. Latest updates from on competitions: Belgium-Sweden qualifier abandoned with 1-1 score confirmed as final. No UEFA competition match to be played in Israel until further notice. Maccabi Haifa withdraw from . Full details: ⬇️ — UEFA (@UEFA) “The Israel Football Association and its clubs Maccabi Haifa FC and Maccabi Tel-Aviv have been requested to propose alternative venues/stadiums (which must comply with all applicable UEFA regulations) outside the territory of Israel for their home matches to be used for as long as this decision remains in force.” Israel’s national team were due to stage Euro 2024 qualifiers against Switzerland and Romania – the two teams above them in Group I – in Tel Aviv and Jerusalem respectively next month, while Maccabi Haifa are playing in the Europa League and Maccabi Tel Aviv are in the Europa Conference League. A number of UEFA competition matches involving teams from Israel had already been postponed. Earlier on Thursday, the Football Association said it will review whether to continue lighting the Wembley arch as an act of tribute following criticism over its response to the Israel-Palestine conflict. FA chief executive Mark Bullingham accepted the “hurt” caused to the Jewish community by the FA’s decision not to light the arch in the colours of the Israeli flag for last Friday’s England friendly against Australia But he set out the steps the FA had taken to respond in what it felt was the most appropriate way to “one of the most complex geopolitical conflicts on Earth”. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “This week has made us question whether we should light the arch and when, and we’ll be reviewing that in the coming weeks,” Bullingham said at the Leaders Week conference at Twickenham. “I recognise that our decision caused hurt to the Jewish community who felt that we should have lit the arch, and that we should have shown stronger support for them. “This was one of the hardest decisions we’ve had to make, and the last thing we ever wanted to do in this situation was to add to the hurt. “We aren’t asking for everyone to agree with our decision, but to understand how we reached it. “It would be easy for football to ask why we’re the only sport being talked about in this way, particularly when rugby and cricket are in the middle of their World Cups. “However, you have got to understand, and we understand, that the power of football means it will always be in the spotlight. And that’s just something we we have to accept.” The FA was heavily criticised by a number of Jewish community groups last week, while Rabbi Alex Goldberg resigned from an FA faith in football group over its response. It was also criticised for not lighting the arch by Lucy Frazer, the Cabinet minister responsible for sport. Bullingham set out the steps the FA had taken to reach the position it did. “We first saw the acts of terror unfold on Saturday, October 7, along with the rest of the country. We immediately wrote to the Israeli FA to communicate our horror at what was taking place,” he said. “We knew the situation could move very, very quickly, and was likely to escalate, so we wanted to have expert guidance, and more information available on what we should do because we had a match on Friday against Australia. “We also spoke with our Australian colleagues and other stakeholders in the game to understand the views of players, clubs, and also of the leagues. “It’s worth noting that the Australians had upcoming games against both Palestine and Lebanon, so their desire for neutrality was obviously incredibly strong. “We then had a long board meeting on the Wednesday night and heard from experts on what is one of the most complicated geopolitical conflicts on Earth. “They then left the room and we had a debate on working out what we should do. “We all felt then, and we all feel now, that football should stand for peace and humanity and the wish to show compassion for all innocent victims of this terrible conflict. “Our compassion and sympathy is clearly for families and children in particular. “We then held a minute’s silence and wore black armbands recognises issuing a statement together with the Australian Federation to explain our actions, which many other sports then followed with identical wording, and our language was also very similar to that used by the United Nations. “We were the only football body in Europe to have a minute’s silence, which was, as I said, for all innocent victims.”","pubDate":"2023-10-19 14:21:17","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17351009/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bfc636f62753c89ed3e74fa9d3d60bd2","title":"No UEFA competition matches to be played in Israel ‘until further notice’","link":"https://www.northwalespioneer.co.uk/sport/national/23866798.no-uefa-competition-matches-played-israel-until-notice/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The announcement comes amid the escalating Israel-Palestine conflict","content":"European football’s governing body has announced that no UEFA competition matches will be played in Israel until further notice. Israel’s national teams and club sides Maccabi Haifa and Maccabi Tel Aviv, who are both competing in Europe, must find alternative venues outside the country to fulfil their UEFA fixtures. The announcement comes amid the escalating Israel-Palestine conflict, which was sparked earlier this month by an attack on Israeli citizens by Hamas militants. A UEFA statement read: “After a thorough evaluation of the current safety and security situation in the whole territory of Israel, the UEFA Executive Committee decided that no UEFA competition matches shall be played in Israel until further notice. Latest updates from on competitions: Belgium-Sweden qualifier abandoned with 1-1 score confirmed as final. No UEFA competition match to be played in Israel until further notice. Maccabi Haifa withdraw from . Full details: ⬇️ — UEFA (@UEFA) “The Israel Football Association and its clubs Maccabi Haifa FC and Maccabi Tel-Aviv have been requested to propose alternative venues/stadiums (which must comply with all applicable UEFA regulations) outside the territory of Israel for their home matches to be used for as long as this decision remains in force.” Israel’s national team were due to stage Euro 2024 qualifiers against Switzerland and Romania – the two teams above them in Group I – in Tel Aviv and Jerusalem respectively next month, while Maccabi Haifa are playing in the Europa League and Maccabi Tel Aviv are in the Europa Conference League. A number of UEFA competition matches involving teams from Israel had already been postponed. Earlier on Thursday, the Football Association said it will review whether to continue lighting the Wembley arch as an act of tribute following criticism over its response to the Israel-Palestine conflict. FA chief executive Mark Bullingham accepted the “hurt” caused to the Jewish community by the FA’s decision not to light the arch in the colours of the Israeli flag for last Friday’s England friendly against Australia But he set out the steps the FA had taken to respond in what it felt was the most appropriate way to “one of the most complex geopolitical conflicts on Earth”. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “This week has made us question whether we should light the arch and when, and we’ll be reviewing that in the coming weeks,” Bullingham said at the Leaders Week conference at Twickenham. “I recognise that our decision caused hurt to the Jewish community who felt that we should have lit the arch, and that we should have shown stronger support for them. “This was one of the hardest decisions we’ve had to make, and the last thing we ever wanted to do in this situation was to add to the hurt. “We aren’t asking for everyone to agree with our decision, but to understand how we reached it. “It would be easy for football to ask why we’re the only sport being talked about in this way, particularly when rugby and cricket are in the middle of their World Cups. “However, you have got to understand, and we understand, that the power of football means it will always be in the spotlight. And that’s just something we we have to accept.” The FA was heavily criticised by a number of Jewish community groups last week, while Rabbi Alex Goldberg resigned from an FA faith in football group over its response. It was also criticised for not lighting the arch by Lucy Frazer, the Cabinet minister responsible for sport. Bullingham set out the steps the FA had taken to reach the position it did. “We first saw the acts of terror unfold on Saturday, October 7, along with the rest of the country. We immediately wrote to the Israeli FA to communicate our horror at what was taking place,” he said. “We knew the situation could move very, very quickly, and was likely to escalate, so we wanted to have expert guidance, and more information available on what we should do because we had a match on Friday against Australia. “We also spoke with our Australian colleagues and other stakeholders in the game to understand the views of players, clubs, and also of the leagues. “It’s worth noting that the Australians had upcoming games against both Palestine and Lebanon, so their desire for neutrality was obviously incredibly strong. “We then had a long board meeting on the Wednesday night and heard from experts on what is one of the most complicated geopolitical conflicts on Earth. “They then left the room and we had a debate on working out what we should do. “We all felt then, and we all feel now, that football should stand for peace and humanity and the wish to show compassion for all innocent victims of this terrible conflict. “Our compassion and sympathy is clearly for families and children in particular. “We then held a minute’s silence and wore black armbands recognises issuing a statement together with the Australian Federation to explain our actions, which many other sports then followed with identical wording, and our language was also very similar to that used by the United Nations. “We were the only football body in Europe to have a minute’s silence, which was, as I said, for all innocent victims.”","pubDate":"2023-10-19 14:21:17","image_url":"https://www.northwalespioneer.co.uk/resources/images/17351009/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f49eba1c6a9186165f642d525b686af3","title":"How to watch Sheffield United vs Man Utd on TV - and why match kicks off on Saturday night","link":"https://www.manchesterworld.uk/sport/football/manchester-united/how-to-watch-sheffield-united-vs-man-utd-on-tv-and-why-match-kicks-off-on-saturday-night-4378195","keywords":["Manchester United","Football","Sport"],"creator":["Toby Bryant"],"video_url":null,"description":"Manchester United return to Premier League action against a struggling Sheffield United this weekend at an unusual time on Saturday.","content":"Manchester United return to Premier League action against a struggling Sheffield United this weekend at an unusual time on Saturday. Manchester United are back in Premier League action this weekend following the two-week international break with a trip to Sheffield United kicking off a busy run of fixtures for the side. Red Devils supporters will hope that at Old Trafford last time out will buoy Erik ten Hag's side, who have struggled for consistency this season. Off-the-pitch distractions have continued even during the break thanks to the drawn-out takeover saga and the Dutch manager will be hoping to keep his squad focused on the game. Advertisement Advertisement Did you know you can manage your profile, and explore all of the available newsletters from ManchesterWorld within your account. A win this weekend would set up Manchester United well in the Champions League, Manchester City in the Premier League and a cup tie with Newcastle United in the next three. Premier League action returns this weekend after the international break and Manchester United travel to Bramall Lane to take on a struggling Sheffield United side on Saturday, October 21. The fixture is set to kick off at the unusual time of 8 pm on Saturday so the Red Devils will be looking to build on the last-gasp victory over Brentford under the floodlights in Yorkshire. A rare late kick-off comes with its own logistical problems for Manchester United fans travelling to Bramall Lane on Saturday but the match wasn't initially due to take place in the 8 pm slot. Advertisement Advertisement The match will take place on Saturday night due to Champions League commitments at Manchester United. The fixture had been picked for broadcasting as part of Sky Sport's Super Sunday back in August but had to be moved after the Red Devils' European commitments were confirmed. Erik ten Hag's side host FC Copenhagen at Old Trafford on Tuesday, October 24 and Premier League sides cannot play on a Sunday and the following Tuesday, hence the trip to Sheffield United was rescheduled. Broadcasters had already filled the 12:30 pm slot with Liverpool vs Everton and the 5:30 pm slot with Chelsea vs Arsenal, meaning that the Manchester United vs Sheffield United match had to take the rarely-used late slot. Sky Sports will broadcast the match on Sky Sports Main Event and Sky Sports Premier League. Coverage of the fixture will start at 7:45 pm, 15 minutes before kick-off and will go on until 10:30 pm that night. For anyone without a Sky subscription, offers a Day Membership for £11.98, which would also grant access to the Chelsea vs Arsenal match earlier in the evening. The pass lasts 24 hours so if bought after around 7:30 pm, it would still be active to catch Aston Villa vs West Ham on Sunday. Advertisement Advertisement NowTV also offer a month membership for £34.99 which grants customers access to all channels for a longer period. This would grant access to view a range of Premier League games over the next four weeks, including the Manchester derby, which is due to be broadcast by Sky Sports on Sunday, October 29.","pubDate":"2023-10-19 14:15:37","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/10/19/14/GettyImages-1722579261.jpg?width=1200&auto=webp","source_id":"manchesterworld","source_priority":123384,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2823c83e2b580942f170f2aeb900e442","title":"Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom","link":"https://www.dailymail.co.uk/sport/football/article-12648955/Optas-supercomputer-predicts-Man-Citys-title-chances-fallen-nearly-20-Man-United-no-chance-getting-four-Chelsea-likely-finish-10th-plus-close-call-bottom.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In the updated analysis by Opta 's supercomputer , which crunches 10,000 match simulations to forcast final standings, City have seen their chances of defending their crown fall by nearly 20 per cent.","content":"Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom Opta have updated their Premier League predictions have eight match days Data has produced several changes in where teams are likely to finish this term Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Tum Balogun For Mailonline Published: 15:15, 19 October 2023 | Updated: 15:15, 19 October 2023 e-mail 52 View comments Eight matches of data have altered figures predicting the final Premier League table as Manchester City 's chances of a fourth consecutive title took a hit following defeats to Wolves and Arsenal . The first two months of the season have thrown up plenty of suprises at the top of the table with Tottenham leading the way ahead of their north London rivals. Five teams have already finished the day at the top - two more than in the whole of the 2022-23 season. Lower down the league lies the likes of Manchester United and Chelsea following their poor starts. While the newly-promoted sides have struggled to adapt to the step up in quality and occupy three of the bottom four spots. In the updated analysis by Opta 's supercomputer , which crunches 10,000 match simulations to forecast final standings, City have seen their chances of defending their crown fall by nearly 20 per cent. The supercomputer gave them a 90.2 per cent chance of league success before the campaign but Pep Guardiola 's side sit in third after suffering back-to-back league defeats and now have a 73.4 per cent chance of taking the title. Opta have released updated predicitions on the final standings following the new match data Manchester City suffered back-to-back defeats for the first time in five years before the break Tottenham have been the suprise package so far and are top with six wins from eight games The biggest beneficiaries of this reduction are Arsenal and Liverpool , who have seen their chances rise by 7.3 and 8.7 per cent respectively. Opta Premier League final table predicition 1. Manchester City 2. Arsenal 3. Liverpool 4. Tottenham Hotspur 5. Newcastle United 6. Aston Villa 7. Brighton & Hove Albion 8. West Ham United 9. Manchester United 10. Chelsea 11. Crystal Palace 12. Fulham 13. Brentford 14. Wolverhampton Wanderers 15. Nottingham Forest 16. Everton 17. Burnley 18. Bournemouth 19. Luton Town 20. Sheffield United <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Mikel Arteta's Gunners are unbeaten so far this term and secured a crucial confidence-boosting 1-0 win against the Cityzens before the international break. Their most likely finishing position remains second just ahead of Jurgen Klopp's side. However, the early season pace-setters Tottenham have risen from a pre-season prediction of eighth into the top four. Ange Postecoglou has bagged successive Premier League Manager of the Month awards for his team's startling run which now has them tipped for Champions League qualification. Spurs have a 24.6 per cent chance of finishing fourth, according to Opta's figures, ahead of Newcastle and Aston Villa. The latter has experienced a similar statistical reappraisal after a promising beginning. Unai Emery's team sit level on points with Brighton in fifth and only four points off the top of a congested league table. Man United and Chelsea fans will be disheartened - but unsurprised - to see their teams predicited to finish 9th and 10th this season. That result would remarkably represent progress for a Chelsea outfit that found themselves in the bottom half last term. United have been given a 3.4 per cent chance of finishing in any of the top four places. Meanwhile, Chelsea's odds are even slimer at 0.6 per cent. The Premier League giants will hope they can recover from lacklustre starts to return to their pre-season predictions of fourth and sixth respectively. Opta's supercomputer also provides some clarity at the foot of the table. Bournemouth and Sheffield United are the only side still waiting for their first win and naturally occupy the bottom two places in the division. Your browser does not support iframes. Despite a crucial dramatic late win against Brentford in their last game, Man United sit 10th Bottom club Sheffield United are one of two winless teams in the Premier League this season After a slow start, Everton have been tipped to avoid relegation from the top-flight this year As a result, they are predicited to go down this season, with the Blades now tipped to finish bottom after the pre-season model indicated 19th was more likely. Andoni Iraola's Cherries have remained in 18th. Luton, who currently sit outside the relegation zone in 17th, are still predicted to make an immediate return to the Championship and have a 27.3 per cent chance of finishing 19th. All three teams have seen their chances of relegation significantly rise compared to the start of the season. Paul Heckingbottom's team have had the sharpest hike from 49 to 85 per cent. Burnley and Everton are seen as safer bets to escape the drop, though there is not much in it. The Toffees, Clarets and Cherries are all within 3.2 percentage points of one another to finish 17th. Luton, Burnley and Bournemouth are seperated by just one per cent to end the campaign in 18th. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Premier League Pep Guardiola Share or comment on this article: Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom e-mail Add comment Comments 53 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-19 14:15:35","image_url":"https://i.dailymail.co.uk/1s/2023/10/19/15/76756051-0-image-a-5_1697724889571.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"cd52bfafcf9dfe98f09a4a58a5bdfc90","title":"Швейцарци развенчаха мита за чужденците и България, Берое, ЦСКА - София и Лудогорец с най-много легионери","link":"https://sportal.bg/news-2023101915184895032","keywords":["БГ Футбол"],"creator":null,"video_url":null,"description":null,"content":"Чужденците в българското футболно първенство през сезон 2023/24 са 49,4 процента, което е среден резултат при изследването на статистическия институт CIES Football Observatory, базиран в Швейцария, пише БТА. Думите на селекционера на националния отбор Младен Кърстаич преди контролната среща с Албания, че чужденците в efbet Лига са прекалено много и ако тенденцията се запази, то българският футбол го чакат черни дни, предизвика сериозна полемика. Освен обичайната лавина от хейт-коментари в двете посоки в социалните мрежи, отношение взе и президентът на Професионалната лига Атанас Караиванов. Той подкрепи с факти мнението си, че Кърстаич не е прав и дори поиска уволнение за сръбския треньор. Проверка в данните швейцарската статистическа компания обаче показва, че тенденцията в България по ангажиране на чужденци не се различава много от общоевропейската. И при повечето от изследваните 31-о първенства показателите са сходните. В интерес на истината, близки резултати до българските са първенства с доста повече финансови възможности като Унгария, Швейцария и Полша, но и такива с по-ниско заплащане като Словения. Но също така и държави със сходно ниво на футбола, но с много по-голям човешки потенциал, каквато е Румъния. Интересното е, че 45 % от футболистите във френската Лига 1 са легионери. А Франция е страна номер 1 по износ на футболисти в Европа, както и Световен шампион от 2018-а година, втора на последния Мондиал в Катар и винаги в топ 4 на Лигата на Нациите. Което показва, че дори 45 на сто да са легионери, първенството пак дава футболисти за националния отбор, ако клубовете си вършат работата както трябва. Безспорен номер 1 е шампионатът на Кипър, в който 82,9 процента от футболистите са дошли извън границите на острова. Следва турската Суперлига, която в последните години отново повишава нивото си. 71,2 процента от футболистите са чужденци, но това не пречи на местните клубове да произвеждат таланти и да правят зашеметяващи трансфери. Пресен пример е продажбата на 18-годишния Арда Гюлер в Реал (Мадрид), за който Фенербахче получава за момента 20 милиона евро. Третата държава с най-много чужденци в Европа е Гърция, като в местната елитна Суперлига външните играчи са в същия размер – 71,0 %. Но това също не пречи да се вадят качествени местни топ-играчи. Идната зима или най-късно през лятото 19-годишният Янис Константелиас от ПАОК най-вероятно ще смени Солун с някое от европейските топ 5 първенства. Английската Висша лига е на 4-о място с 64,6 процента чужденци, но тази бройка нито отслабва националния отбор, нито лишава страната от бъдещи таланти, идващи от академиите. Същото може да се каже и за северните съседи от Шотландия, които имат 64,5 процента внос на играчите, но националният им отбор беше един от първите, които си гарантираха участие на Евро 2024. Близката среща на унгарския национален отбор по футбол с българския от тази пролет даде ясна представа на феновете какво представляват „маджарите“ на терена. Но в местното първенство чужденците са 47,1 процент, което по никакъв начин не намалява класата на националния тим. Същото е и за доста по-богатата Швейцария, чиито клубове разчитат на 47,9 процента футболен внос. Но националният отбор вече чака жребия за следващото Европейско първенство. В българското първенство безспорен номер 1 е отборът на Берое, придобиващ специална слава заради чужденците, които идват благодарение на новия собственик Ернан Банато. Старозагорци разчитат на 81,9 процента външни футболисти, следвани от ЦСКА - София с 81,4 и Лудогорец със 79,8. Следват Ботев (Пловдив) със 73,3 и Левски (София) с 61,8. На обратния полюс са Етър (13,6), Славия (16,8) и Славия (20,4). По отношение на възрастта на футболистите българското първенство също е в почти перфектна позиция. Категорично не може да се каже, че играят ветерани, а напротив – играчи в най-хубавата възраст за футбол. Футболистът от efbet Лига е на 26,3 години, като най-старите футболисти са в Кипър (28,6) и Гърция с 28,5. Следват Турция - 28,2, Румъния (27,5), следвани от Полша (27,1) и Унгария, Израел, Русия, Германия и Чехия с възраст 27,0. Carlsberg \"Домът на Феновете\" е новата секция на Sportal.bg за игри. С регистрацията си Вие ще можете да персонализирате Вашето съдържание и да участвате в за страхотни награди.","pubDate":"2023-10-19 15:18:48","image_url":"https://sportal365images.com/process/smp-images-production/sportal.bg/02092023/bb4818bc-7bd6-4ccd-8ecd-65c8798bbe5d.jpg","source_id":"sportal","source_priority":163647,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"1f4cd48731664442db46f60c2ee4077e","title":"New Manchester United owner wants two of the most exciting young stars in the world: report","link":"https://www.fourfourtwo.com/news/manchester-united-transfer-news-owner-wants-two-of-the-most-exciting-young-stars-in-the-world-report-florian-wirtz-bayer-leverkusen-nico-williams-athletic-club-bilbao-signings-rumours-gossip-paper-talk-mufc-luhg-ggmu","keywords":["Stories"],"creator":null,"video_url":null,"description":"Manchester United could be about to land two of the most scintillating young stars on the planet, thanks to their new investor","content":"Manchester United could be about to land two of the most exciting young superstars in world football, thanks to their new investor. Sir Jim Ratcliffe is waiting for the approval of his £1.3 billion bid for 25 per cent of , the club he's supported all of his life. The INEOS billionaire will take care of the sporting side of the business – and that could mean a squad overhaul. According to , Ratcliffe plans to install a sporting director, but already two new players have been linked with the Reds Devils. in Spain have claimed that want to rival Man United for the signing of superstar, Florian Wirtz, who is widely regarded as one of the best young footballers in Europe right now. Furthermore, star, Nico Williams, is a target on a free transfer, as cited by . Should United manage to land both, it would be a huge statement of intent from Ratcliffe, who has for spending \"dumb money\". Williams and Wirtz could theoretically replace Jadon Sancho and Antony, who have both hugely underwhelmed after landing at Old Trafford for over £150m combined. Sancho is currently exiled from the side, while Antony has only just rejoined it, following time away from the team to address allegations of assault. Wirtz would no doubt be an expensive signing, though, given that he currently has a contract that runs until 2027. With Leverkusen flying high in the Bundesliga, they would not want to lose him and could command a similar fee to the £72 million they got for Kai Havertz. Williams, however, is a free agent from next summer.","pubDate":"2023-10-19 14:53:48","image_url":"https://cdn.mos.cms.futurecdn.net/M3TiQzJGFW5uP23MhVaXaN.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"365ccec8b7171ad53d14521fc374c90a","title":"Man Utd confirm key player set to miss Sheff Utd match but two injured stars return to training","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-confirm-key-player-set-to-miss-sheff-utd-match-but-two-injured-stars-back-in-training-4378361","keywords":["Manchester United","Football","Sport"],"creator":["Michael Plant"],"video_url":null,"description":"Manchester United face the division's bottom side on Saturday night, but will be without one their regular starters.","content":"Manchester United face the division's bottom side on Saturday night, but will be without one their regular starters. have confirmed that Casemiro is unavailable for Saturday's Premier League encounter . It was confirmed by the club last week that the ex-Real Madrid star had picked up a knock while on international duty, but he played the full 90 minutes as Brazil lost to Uruguay in midweek. Advertisement Advertisement Did you know you can manage your profile, and explore all of the available newsletters from ManchesterWorld within your account. It was presumed, therefore, that Casemiro would be available for the but United announced on Thursday afternoon that he won't be an option for Erik ten Hag. \"Casemiro was absent [from training on Thursday] having remained in Brazil, on the club’s advice, to recover as swiftly as possible from a small issue picked up while playing for his country,\" the Red Devils said via . United added that Casemiro is set to return to England 'early next week' and will resume training ahead of the Champions League encounter against Copenhagen, although the 30-year-old is suspended for the game following his red card last time out against Galatasaray. After playing a starring role last term at Old Trafford, Casemiro has struggled to perform at the same level this season, and he was in United's final game before the international break: a . Advertisement Advertisement Elsewhere, with the club have confirmed that Sergio Reguilon and Sofyan Amrabat have trained this week. The latter didn't feature in either of Morocco's matches over the international break, leading to suggestions he is injured, while Reguilon hasn't played since the 1-0 win over Burnley on 23 September, due to injury. His return will be a significant boost for Ten Hag given fellow left-backs at present. Assuming both are fit to start, Reguilon and Amrabat are likely to be named in United's XI on Saturday, with the Red Devils aiming to build on that injury-time comeback against Brentford. Ten Hag is expected to give a full fitness update in Friday's press conference, with the availability of Jonny Evans, Kobbie Mainoo and Amad unclear, while Aaron Wan-Bissaka, Lisandro Martinez and Jadon Sancho are absent, along with Shaw and Malacia.","pubDate":"2023-10-19 14:53:36","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/10/19/14/GettyImages-1678208062.jpg?width=1200&auto=webp","source_id":"manchesterworld","source_priority":123384,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"520bc386f3328058507b54c7d79d9377","title":"'Really had enough' - Tony Bellew rages at Everton woes as blame shared on talkSPORT","link":"https://www.goodisonnews.com/2023/10/19/tony-bellew-rages-at-everton-players-sick-of-blaming-managers-for-woes/","keywords":["News","everton","Tony Bellew"],"creator":["Joe Roberts"],"video_url":null,"description":"Everton managers can’t continue to be blamed for the club’s struggles as the “buck needs to start stopping” with the players, according to Tony Bellew. Speaking live on talkSPORT (19 October), the former boxer claimed the Toffees have had exceptional managers in the dugout in recent history who have failed to bring results, meaning the ... The post 'Really had enough' - Tony Bellew rages at Everton woes as blame shared on talkSPORT appeared first on Goodison News.","content":"Speaking live on (19 October), the former boxer claimed the Toffees have had exceptional managers in the dugout in recent history who have failed to bring results, meaning the players must take more responsibility. Bellew insisted the club need to have faith in a manager instead of returning to the “revolving door” of appointments that has brought them no success. Bellew said: “We need some kind of stability at our club. We need to believe and stick with a manager right til the end. I’m sick of the revolving door going around and managers going in and going out – I’ve really had enough of it now. “We need to show faith in the one that we’ve got. Ultimately, instead of blaming managers, I’ve got to be totally honest, the buck needs to start stopping in the dressing room with the lads, and they all know that. “We can’t keep blaming the managers. We’ve had some of the best managers the game’s [seen]. We’ve had the likes of Carlo Ancelotti, the likes of your Ronald Koemans, your Roberto Martinez’s, your David Moyes’. “I’m sick of blaming managers. At some point or another, someone’s got to go, ‘Right, sort these out.” While the players must give 100 per cent in every minute of football they play, they can’t be solely blamed the Everton’s continued struggle in recent seasons. Everton’s managerial appointments have been mostly unsuccessful. While the likes of Koeman left after poor form, the Goodison Park faithful would kill to finish in seventh place like the Dutchman achieved. Nethertheless, Everton of 2023 is a long away from the Everton of 2017, and Toffees fans have adjusted expectations accordingly. This season, the players have put in good performances and have been adept at creating chances. The recurring problem is the poor finishing up top, but Sean Dyche will back himself to change the fortunes of the likes of Beto and Arnaut Danjuma. While managers would certainly have a huge say in recruitment, the frequent high spending on underwhelming players has been a major downfall. Then, after the “revolving door” of managers, the profile of the squad has become a hodgepodge of different bosses’ philosophies who retained little resale value after their poor form. Everton desperately needs Dyche to work at the club and bring the needed sustainability, but Goodison Park has rarely been a predictable place. .","pubDate":"2023-10-19 14:40:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2021/09/Untitled-design-2021-09-22T193613.976-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"76a6dc911de71199cad1b419e35421a2","title":"Footage of Man Utd boss Erik ten Hag's 'dreadful' pass from playing days goes viral","link":"https://www.dailystar.co.uk/sport/football/man-utd-erik-ten-hag-31230094","keywords":["Sport"],"creator":null,"video_url":null,"description":"Manchester United boss Erik ten Hag won't want to see back a clip which is going viral from his playing days where he makes a right pig's ear of a simple pass","content":"has gone viral after footage emerged of the boss horribly miscuing a pass in his playing days. The Dutchman, 53, had a solid yet unremarkable active career as a centre back for FC Twente, De Graafschap, RKC Waalwijk and FC Utrecht in his home country before retiring at the age of 32. All in all he made in excess of 300 senior appearances. Back then defenders didn't have to be as good with the ball at their feet as they are nowadays - and that showed when he would make the move into defensive midfield on occasion. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month He's been done particularly dirty by one clip in which he receives the ball on the half turn in the middle of the park and attempts to play a simple pass out to the ring wing, where one of his team-mates was waiting. But instead of finding him, Ten Hag blasted the ball into the stand for a throw-in to the opposition. The broadcast then cut to a close up camera shot of the back of his shirt to leave no doubt about who the culprit was. United fans were left embarrassed by the poor quality, with one pleading: \"Don’t tell me that’s my manager.\" Another sighed: \"That was dreadful.\" Rival fans lapped it up on social media and teased the Red Devils supporters, with one joking: \"Is this the same guy that said... eras comes to an end.\" A second quipped: \"This one didn't want Ronaldo in his team? Lmao.\" A third brutally commented: \"No wonder he is leading Man Utd to the trenches.\" And referring to the recent poor form of Andre Onana, a fourth wrote: \"Like coach like keeper.\"","pubDate":"2023-10-19 14:38:49","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31230377.ece/ALTERNATES/s98/1_eth-passjpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a1af70fb27da4029f612e18c740782b4","title":"'My team-mate used the N-word after I warned him not to – so I sparked him out'","link":"https://www.dailystar.co.uk/sport/football/leroy-lita-championship-team-mate-31229826","keywords":["Sport"],"creator":null,"video_url":null,"description":"Leroy Lita has explained how he clashed with a former team-mate after the repeated use of the N-word - before he left him in agony on the floor","content":"Leroy Lita left a former team-mate on the floor in agony after warning him not to say the N-word - but he persisted in doing so. Best known for his spells with Bristol City, and , Lita spent 14 seasons in the Football League and once had a bad falling out with a colleague. Speaking on the Under The Cosh podcast, Lita said of the incident: \"Cheltenham Races during the season, March or whatever, so we all went down there. Had a good day out with good banter and everything like that. We got back and I remember the bar we used to (go to). We were all in there, empty, it was just us in there on a Tuesday night or something like that. \"Having a drink, sat next to (his team-mate) and he started singing a song and it included the N-word. I just said: 'Alright mate, don't say that'.\" Lita explained how the team-mate insisted he wasn't using the word towards him - but the striker told him not to say it in his presence. Lita added: \"I told him 10 times, then I said if you say it one more time I'm going to smash your face in.\" The player is then said to have repeated the word while saying he wasn't using it in the direction of Lita, who then admitted to losing his cool. He added: \"I lost my head and a team-mate came over and grabbed me, he's held me for about five minutes, I said: 'Listen, hold me as long as you want, as soon as you let me go I'm going for him, end of'.\" Lita was taken outside and the team-mate he was planning to run at followed, who allegedly kept saying the word while trying to use it in defence. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month When explaining what happened after he was let go, Lita added: \"I just went boom boom boom, (he) dropped on the floor, left him. Carried on with our night. (I) give him a couple of kicks to the face. He didn't even get to throw a punch.\" Lita spoke of the aftermath and said his manager was on the phone within two hours, telling him to come and visit in the morning. The veteran forward, who now plays for Nuneaton Borough at the age of 38, said he explained the situation and why he wouldn't be apologising or shaking anyone's hand, then walked out of the manager's office, never speaking to the team-mate again.","pubDate":"2023-10-19 14:36:08","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31229964.ece/ALTERNATES/s98/0_MAIN-PICS-My-team-mate-used-the-N-word-after-I-warned-him-not-to-so-I-sparked-him-out-Leroy-L.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c3af7f0915418fac769c5fc400a836bc","title":"No UEFA competition matches to be played in Israel ‘until further notice’","link":"https://www.northwaleschronicle.co.uk/sport/national/23866798.no-uefa-competition-matches-played-israel-until-notice/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The announcement comes amid the escalating Israel-Palestine conflict","content":"European football’s governing body has announced that no UEFA competition matches will be played in Israel until further notice. Israel’s national teams and club sides Maccabi Haifa and Maccabi Tel Aviv, who are both competing in Europe, must find alternative venues outside the country to fulfil their UEFA fixtures. The announcement comes amid the escalating Israel-Palestine conflict, which was sparked earlier this month by an attack on Israeli citizens by Hamas militants. A UEFA statement read: “After a thorough evaluation of the current safety and security situation in the whole territory of Israel, the UEFA Executive Committee decided that no UEFA competition matches shall be played in Israel until further notice. Latest updates from on competitions: Belgium-Sweden qualifier abandoned with 1-1 score confirmed as final. No UEFA competition match to be played in Israel until further notice. Maccabi Haifa withdraw from . Full details: ⬇️ — UEFA (@UEFA) “The Israel Football Association and its clubs Maccabi Haifa FC and Maccabi Tel-Aviv have been requested to propose alternative venues/stadiums (which must comply with all applicable UEFA regulations) outside the territory of Israel for their home matches to be used for as long as this decision remains in force.” Israel’s national team were due to stage Euro 2024 qualifiers against Switzerland and Romania – the two teams above them in Group I – in Tel Aviv and Jerusalem respectively next month, while Maccabi Haifa are playing in the Europa League and Maccabi Tel Aviv are in the Europa Conference League. A number of UEFA competition matches involving teams from Israel had already been postponed. Earlier on Thursday, the Football Association said it will review whether to continue lighting the Wembley arch as an act of tribute following criticism over its response to the Israel-Palestine conflict. FA chief executive Mark Bullingham accepted the “hurt” caused to the Jewish community by the FA’s decision not to light the arch in the colours of the Israeli flag for last Friday’s England friendly against Australia But he set out the steps the FA had taken to respond in what it felt was the most appropriate way to “one of the most complex geopolitical conflicts on Earth”. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “This week has made us question whether we should light the arch and when, and we’ll be reviewing that in the coming weeks,” Bullingham said at the Leaders Week conference at Twickenham. “I recognise that our decision caused hurt to the Jewish community who felt that we should have lit the arch, and that we should have shown stronger support for them. “This was one of the hardest decisions we’ve had to make, and the last thing we ever wanted to do in this situation was to add to the hurt. “We aren’t asking for everyone to agree with our decision, but to understand how we reached it. “It would be easy for football to ask why we’re the only sport being talked about in this way, particularly when rugby and cricket are in the middle of their World Cups. “However, you have got to understand, and we understand, that the power of football means it will always be in the spotlight. And that’s just something we we have to accept.” The FA was heavily criticised by a number of Jewish community groups last week, while Rabbi Alex Goldberg resigned from an FA faith in football group over its response. It was also criticised for not lighting the arch by Lucy Frazer, the Cabinet minister responsible for sport. Bullingham set out the steps the FA had taken to reach the position it did. “We first saw the acts of terror unfold on Saturday, October 7, along with the rest of the country. We immediately wrote to the Israeli FA to communicate our horror at what was taking place,” he said. “We knew the situation could move very, very quickly, and was likely to escalate, so we wanted to have expert guidance, and more information available on what we should do because we had a match on Friday against Australia. “We also spoke with our Australian colleagues and other stakeholders in the game to understand the views of players, clubs, and also of the leagues. “It’s worth noting that the Australians had upcoming games against both Palestine and Lebanon, so their desire for neutrality was obviously incredibly strong. “We then had a long board meeting on the Wednesday night and heard from experts on what is one of the most complicated geopolitical conflicts on Earth. “They then left the room and we had a debate on working out what we should do. “We all felt then, and we all feel now, that football should stand for peace and humanity and the wish to show compassion for all innocent victims of this terrible conflict. “Our compassion and sympathy is clearly for families and children in particular. “We then held a minute’s silence and wore black armbands recognises issuing a statement together with the Australian Federation to explain our actions, which many other sports then followed with identical wording, and our language was also very similar to that used by the United Nations. “We were the only football body in Europe to have a minute’s silence, which was, as I said, for all innocent victims.”","pubDate":"2023-10-19 14:21:17","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17351009/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bfc636f62753c89ed3e74fa9d3d60bd2","title":"No UEFA competition matches to be played in Israel ‘until further notice’","link":"https://www.northwalespioneer.co.uk/sport/national/23866798.no-uefa-competition-matches-played-israel-until-notice/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The announcement comes amid the escalating Israel-Palestine conflict","content":"European football’s governing body has announced that no UEFA competition matches will be played in Israel until further notice. Israel’s national teams and club sides Maccabi Haifa and Maccabi Tel Aviv, who are both competing in Europe, must find alternative venues outside the country to fulfil their UEFA fixtures. The announcement comes amid the escalating Israel-Palestine conflict, which was sparked earlier this month by an attack on Israeli citizens by Hamas militants. A UEFA statement read: “After a thorough evaluation of the current safety and security situation in the whole territory of Israel, the UEFA Executive Committee decided that no UEFA competition matches shall be played in Israel until further notice. Latest updates from on competitions: Belgium-Sweden qualifier abandoned with 1-1 score confirmed as final. No UEFA competition match to be played in Israel until further notice. Maccabi Haifa withdraw from . Full details: ⬇️ — UEFA (@UEFA) “The Israel Football Association and its clubs Maccabi Haifa FC and Maccabi Tel-Aviv have been requested to propose alternative venues/stadiums (which must comply with all applicable UEFA regulations) outside the territory of Israel for their home matches to be used for as long as this decision remains in force.” Israel’s national team were due to stage Euro 2024 qualifiers against Switzerland and Romania – the two teams above them in Group I – in Tel Aviv and Jerusalem respectively next month, while Maccabi Haifa are playing in the Europa League and Maccabi Tel Aviv are in the Europa Conference League. A number of UEFA competition matches involving teams from Israel had already been postponed. Earlier on Thursday, the Football Association said it will review whether to continue lighting the Wembley arch as an act of tribute following criticism over its response to the Israel-Palestine conflict. FA chief executive Mark Bullingham accepted the “hurt” caused to the Jewish community by the FA’s decision not to light the arch in the colours of the Israeli flag for last Friday’s England friendly against Australia But he set out the steps the FA had taken to respond in what it felt was the most appropriate way to “one of the most complex geopolitical conflicts on Earth”. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “This week has made us question whether we should light the arch and when, and we’ll be reviewing that in the coming weeks,” Bullingham said at the Leaders Week conference at Twickenham. “I recognise that our decision caused hurt to the Jewish community who felt that we should have lit the arch, and that we should have shown stronger support for them. “This was one of the hardest decisions we’ve had to make, and the last thing we ever wanted to do in this situation was to add to the hurt. “We aren’t asking for everyone to agree with our decision, but to understand how we reached it. “It would be easy for football to ask why we’re the only sport being talked about in this way, particularly when rugby and cricket are in the middle of their World Cups. “However, you have got to understand, and we understand, that the power of football means it will always be in the spotlight. And that’s just something we we have to accept.” The FA was heavily criticised by a number of Jewish community groups last week, while Rabbi Alex Goldberg resigned from an FA faith in football group over its response. It was also criticised for not lighting the arch by Lucy Frazer, the Cabinet minister responsible for sport. Bullingham set out the steps the FA had taken to reach the position it did. “We first saw the acts of terror unfold on Saturday, October 7, along with the rest of the country. We immediately wrote to the Israeli FA to communicate our horror at what was taking place,” he said. “We knew the situation could move very, very quickly, and was likely to escalate, so we wanted to have expert guidance, and more information available on what we should do because we had a match on Friday against Australia. “We also spoke with our Australian colleagues and other stakeholders in the game to understand the views of players, clubs, and also of the leagues. “It’s worth noting that the Australians had upcoming games against both Palestine and Lebanon, so their desire for neutrality was obviously incredibly strong. “We then had a long board meeting on the Wednesday night and heard from experts on what is one of the most complicated geopolitical conflicts on Earth. “They then left the room and we had a debate on working out what we should do. “We all felt then, and we all feel now, that football should stand for peace and humanity and the wish to show compassion for all innocent victims of this terrible conflict. “Our compassion and sympathy is clearly for families and children in particular. “We then held a minute’s silence and wore black armbands recognises issuing a statement together with the Australian Federation to explain our actions, which many other sports then followed with identical wording, and our language was also very similar to that used by the United Nations. “We were the only football body in Europe to have a minute’s silence, which was, as I said, for all innocent victims.”","pubDate":"2023-10-19 14:21:17","image_url":"https://www.northwalespioneer.co.uk/resources/images/17351009/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f49eba1c6a9186165f642d525b686af3","title":"How to watch Sheffield United vs Man Utd on TV - and why match kicks off on Saturday night","link":"https://www.manchesterworld.uk/sport/football/manchester-united/how-to-watch-sheffield-united-vs-man-utd-on-tv-and-why-match-kicks-off-on-saturday-night-4378195","keywords":["Manchester United","Football","Sport"],"creator":["Toby Bryant"],"video_url":null,"description":"Manchester United return to Premier League action against a struggling Sheffield United this weekend at an unusual time on Saturday.","content":"Manchester United return to Premier League action against a struggling Sheffield United this weekend at an unusual time on Saturday. Manchester United are back in Premier League action this weekend following the two-week international break with a trip to Sheffield United kicking off a busy run of fixtures for the side. Red Devils supporters will hope that at Old Trafford last time out will buoy Erik ten Hag's side, who have struggled for consistency this season. Off-the-pitch distractions have continued even during the break thanks to the drawn-out takeover saga and the Dutch manager will be hoping to keep his squad focused on the game. Advertisement Advertisement Did you know you can manage your profile, and explore all of the available newsletters from ManchesterWorld within your account. A win this weekend would set up Manchester United well in the Champions League, Manchester City in the Premier League and a cup tie with Newcastle United in the next three. Premier League action returns this weekend after the international break and Manchester United travel to Bramall Lane to take on a struggling Sheffield United side on Saturday, October 21. The fixture is set to kick off at the unusual time of 8 pm on Saturday so the Red Devils will be looking to build on the last-gasp victory over Brentford under the floodlights in Yorkshire. A rare late kick-off comes with its own logistical problems for Manchester United fans travelling to Bramall Lane on Saturday but the match wasn't initially due to take place in the 8 pm slot. Advertisement Advertisement The match will take place on Saturday night due to Champions League commitments at Manchester United. The fixture had been picked for broadcasting as part of Sky Sport's Super Sunday back in August but had to be moved after the Red Devils' European commitments were confirmed. Erik ten Hag's side host FC Copenhagen at Old Trafford on Tuesday, October 24 and Premier League sides cannot play on a Sunday and the following Tuesday, hence the trip to Sheffield United was rescheduled. Broadcasters had already filled the 12:30 pm slot with Liverpool vs Everton and the 5:30 pm slot with Chelsea vs Arsenal, meaning that the Manchester United vs Sheffield United match had to take the rarely-used late slot. Sky Sports will broadcast the match on Sky Sports Main Event and Sky Sports Premier League. Coverage of the fixture will start at 7:45 pm, 15 minutes before kick-off and will go on until 10:30 pm that night. For anyone without a Sky subscription, offers a Day Membership for £11.98, which would also grant access to the Chelsea vs Arsenal match earlier in the evening. The pass lasts 24 hours so if bought after around 7:30 pm, it would still be active to catch Aston Villa vs West Ham on Sunday. Advertisement Advertisement NowTV also offer a month membership for £34.99 which grants customers access to all channels for a longer period. This would grant access to view a range of Premier League games over the next four weeks, including the Manchester derby, which is due to be broadcast by Sky Sports on Sunday, October 29.","pubDate":"2023-10-19 14:15:37","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/10/19/14/GettyImages-1722579261.jpg?width=1200&auto=webp","source_id":"manchesterworld","source_priority":123384,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2823c83e2b580942f170f2aeb900e442","title":"Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom","link":"https://www.dailymail.co.uk/sport/football/article-12648955/Optas-supercomputer-predicts-Man-Citys-title-chances-fallen-nearly-20-Man-United-no-chance-getting-four-Chelsea-likely-finish-10th-plus-close-call-bottom.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In the updated analysis by Opta 's supercomputer , which crunches 10,000 match simulations to forcast final standings, City have seen their chances of defending their crown fall by nearly 20 per cent.","content":"Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom Opta have updated their Premier League predictions have eight match days Data has produced several changes in where teams are likely to finish this term Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Tum Balogun For Mailonline Published: 15:15, 19 October 2023 | Updated: 15:15, 19 October 2023 e-mail 52 View comments Eight matches of data have altered figures predicting the final Premier League table as Manchester City 's chances of a fourth consecutive title took a hit following defeats to Wolves and Arsenal . The first two months of the season have thrown up plenty of suprises at the top of the table with Tottenham leading the way ahead of their north London rivals. Five teams have already finished the day at the top - two more than in the whole of the 2022-23 season. Lower down the league lies the likes of Manchester United and Chelsea following their poor starts. While the newly-promoted sides have struggled to adapt to the step up in quality and occupy three of the bottom four spots. In the updated analysis by Opta 's supercomputer , which crunches 10,000 match simulations to forecast final standings, City have seen their chances of defending their crown fall by nearly 20 per cent. The supercomputer gave them a 90.2 per cent chance of league success before the campaign but Pep Guardiola 's side sit in third after suffering back-to-back league defeats and now have a 73.4 per cent chance of taking the title. Opta have released updated predicitions on the final standings following the new match data Manchester City suffered back-to-back defeats for the first time in five years before the break Tottenham have been the suprise package so far and are top with six wins from eight games The biggest beneficiaries of this reduction are Arsenal and Liverpool , who have seen their chances rise by 7.3 and 8.7 per cent respectively. Opta Premier League final table predicition 1. Manchester City 2. Arsenal 3. Liverpool 4. Tottenham Hotspur 5. Newcastle United 6. Aston Villa 7. Brighton & Hove Albion 8. West Ham United 9. Manchester United 10. Chelsea 11. Crystal Palace 12. Fulham 13. Brentford 14. Wolverhampton Wanderers 15. Nottingham Forest 16. Everton 17. Burnley 18. Bournemouth 19. Luton Town 20. Sheffield United <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Mikel Arteta's Gunners are unbeaten so far this term and secured a crucial confidence-boosting 1-0 win against the Cityzens before the international break. Their most likely finishing position remains second just ahead of Jurgen Klopp's side. However, the early season pace-setters Tottenham have risen from a pre-season prediction of eighth into the top four. Ange Postecoglou has bagged successive Premier League Manager of the Month awards for his team's startling run which now has them tipped for Champions League qualification. Spurs have a 24.6 per cent chance of finishing fourth, according to Opta's figures, ahead of Newcastle and Aston Villa. The latter has experienced a similar statistical reappraisal after a promising beginning. Unai Emery's team sit level on points with Brighton in fifth and only four points off the top of a congested league table. Man United and Chelsea fans will be disheartened - but unsurprised - to see their teams predicited to finish 9th and 10th this season. That result would remarkably represent progress for a Chelsea outfit that found themselves in the bottom half last term. United have been given a 3.4 per cent chance of finishing in any of the top four places. Meanwhile, Chelsea's odds are even slimer at 0.6 per cent. The Premier League giants will hope they can recover from lacklustre starts to return to their pre-season predictions of fourth and sixth respectively. Opta's supercomputer also provides some clarity at the foot of the table. Bournemouth and Sheffield United are the only side still waiting for their first win and naturally occupy the bottom two places in the division. Your browser does not support iframes. Despite a crucial dramatic late win against Brentford in their last game, Man United sit 10th Bottom club Sheffield United are one of two winless teams in the Premier League this season After a slow start, Everton have been tipped to avoid relegation from the top-flight this year As a result, they are predicited to go down this season, with the Blades now tipped to finish bottom after the pre-season model indicated 19th was more likely. Andoni Iraola's Cherries have remained in 18th. Luton, who currently sit outside the relegation zone in 17th, are still predicted to make an immediate return to the Championship and have a 27.3 per cent chance of finishing 19th. All three teams have seen their chances of relegation significantly rise compared to the start of the season. Paul Heckingbottom's team have had the sharpest hike from 49 to 85 per cent. Burnley and Everton are seen as safer bets to escape the drop, though there is not much in it. The Toffees, Clarets and Cherries are all within 3.2 percentage points of one another to finish 17th. Luton, Burnley and Bournemouth are seperated by just one per cent to end the campaign in 18th. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Premier League Pep Guardiola Share or comment on this article: Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom e-mail Add comment Comments 53 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-19 14:15:35","image_url":"https://i.dailymail.co.uk/1s/2023/10/19/15/76756051-0-image-a-5_1697724889571.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"cd52bfafcf9dfe98f09a4a58a5bdfc90","title":"Швейцарци развенчаха мита за чужденците и България, Берое, ЦСКА - София и Лудогорец с най-много легионери","link":"https://sportal.bg/news-2023101915184895032","keywords":["БГ Футбол"],"creator":null,"video_url":null,"description":null,"content":"Чужденците в българското футболно първенство през сезон 2023/24 са 49,4 процента, което е среден резултат при изследването на статистическия институт CIES Football Observatory, базиран в Швейцария, пише БТА. Думите на селекционера на националния отбор Младен Кърстаич преди контролната среща с Албания, че чужденците в efbet Лига са прекалено много и ако тенденцията се запази, то българският футбол го чакат черни дни, предизвика сериозна полемика. Освен обичайната лавина от хейт-коментари в двете посоки в социалните мрежи, отношение взе и президентът на Професионалната лига Атанас Караиванов. Той подкрепи с факти мнението си, че Кърстаич не е прав и дори поиска уволнение за сръбския треньор. Проверка в данните швейцарската статистическа компания обаче показва, че тенденцията в България по ангажиране на чужденци не се различава много от общоевропейската. И при повечето от изследваните 31-о първенства показателите са сходните. В интерес на истината, близки резултати до българските са първенства с доста повече финансови възможности като Унгария, Швейцария и Полша, но и такива с по-ниско заплащане като Словения. Но също така и държави със сходно ниво на футбола, но с много по-голям човешки потенциал, каквато е Румъния. Интересното е, че 45 % от футболистите във френската Лига 1 са легионери. А Франция е страна номер 1 по износ на футболисти в Европа, както и Световен шампион от 2018-а година, втора на последния Мондиал в Катар и винаги в топ 4 на Лигата на Нациите. Което показва, че дори 45 на сто да са легионери, първенството пак дава футболисти за националния отбор, ако клубовете си вършат работата както трябва. Безспорен номер 1 е шампионатът на Кипър, в който 82,9 процента от футболистите са дошли извън границите на острова. Следва турската Суперлига, която в последните години отново повишава нивото си. 71,2 процента от футболистите са чужденци, но това не пречи на местните клубове да произвеждат таланти и да правят зашеметяващи трансфери. Пресен пример е продажбата на 18-годишния Арда Гюлер в Реал (Мадрид), за който Фенербахче получава за момента 20 милиона евро. Третата държава с най-много чужденци в Европа е Гърция, като в местната елитна Суперлига външните играчи са в същия размер – 71,0 %. Но това също не пречи да се вадят качествени местни топ-играчи. Идната зима или най-късно през лятото 19-годишният Янис Константелиас от ПАОК най-вероятно ще смени Солун с някое от европейските топ 5 първенства. Английската Висша лига е на 4-о място с 64,6 процента чужденци, но тази бройка нито отслабва националния отбор, нито лишава страната от бъдещи таланти, идващи от академиите. Същото може да се каже и за северните съседи от Шотландия, които имат 64,5 процента внос на играчите, но националният им отбор беше един от първите, които си гарантираха участие на Евро 2024. Близката среща на унгарския национален отбор по футбол с българския от тази пролет даде ясна представа на феновете какво представляват „маджарите“ на терена. Но в местното първенство чужденците са 47,1 процент, което по никакъв начин не намалява класата на националния тим. Същото е и за доста по-богатата Швейцария, чиито клубове разчитат на 47,9 процента футболен внос. Но националният отбор вече чака жребия за следващото Европейско първенство. В българското първенство безспорен номер 1 е отборът на Берое, придобиващ специална слава заради чужденците, които идват благодарение на новия собственик Ернан Банато. Старозагорци разчитат на 81,9 процента външни футболисти, следвани от ЦСКА - София с 81,4 и Лудогорец със 79,8. Следват Ботев (Пловдив) със 73,3 и Левски (София) с 61,8. На обратния полюс са Етър (13,6), Славия (16,8) и Славия (20,4). По отношение на възрастта на футболистите българското първенство също е в почти перфектна позиция. Категорично не може да се каже, че играят ветерани, а напротив – играчи в най-хубавата възраст за футбол. Футболистът от efbet Лига е на 26,3 години, като най-старите футболисти са в Кипър (28,6) и Гърция с 28,5. Следват Турция - 28,2, Румъния (27,5), следвани от Полша (27,1) и Унгария, Израел, Русия, Германия и Чехия с възраст 27,0. Carlsberg \"Домът на Феновете\" е новата секция на Sportal.bg за игри. С регистрацията си Вие ще можете да персонализирате Вашето съдържание и да участвате в за страхотни награди.","pubDate":"2023-10-19 15:18:48","image_url":"https://sportal365images.com/process/smp-images-production/sportal.bg/02092023/bb4818bc-7bd6-4ccd-8ecd-65c8798bbe5d.jpg","source_id":"sportal","source_priority":163647,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"1f4cd48731664442db46f60c2ee4077e","title":"New Manchester United owner wants two of the most exciting young stars in the world: report","link":"https://www.fourfourtwo.com/news/manchester-united-transfer-news-owner-wants-two-of-the-most-exciting-young-stars-in-the-world-report-florian-wirtz-bayer-leverkusen-nico-williams-athletic-club-bilbao-signings-rumours-gossip-paper-talk-mufc-luhg-ggmu","keywords":["Stories"],"creator":null,"video_url":null,"description":"Manchester United could be about to land two of the most scintillating young stars on the planet, thanks to their new investor","content":"Manchester United could be about to land two of the most exciting young superstars in world football, thanks to their new investor. Sir Jim Ratcliffe is waiting for the approval of his £1.3 billion bid for 25 per cent of , the club he's supported all of his life. The INEOS billionaire will take care of the sporting side of the business – and that could mean a squad overhaul. According to , Ratcliffe plans to install a sporting director, but already two new players have been linked with the Reds Devils. in Spain have claimed that want to rival Man United for the signing of superstar, Florian Wirtz, who is widely regarded as one of the best young footballers in Europe right now. Furthermore, star, Nico Williams, is a target on a free transfer, as cited by . Should United manage to land both, it would be a huge statement of intent from Ratcliffe, who has for spending \"dumb money\". Williams and Wirtz could theoretically replace Jadon Sancho and Antony, who have both hugely underwhelmed after landing at Old Trafford for over £150m combined. Sancho is currently exiled from the side, while Antony has only just rejoined it, following time away from the team to address allegations of assault. Wirtz would no doubt be an expensive signing, though, given that he currently has a contract that runs until 2027. With Leverkusen flying high in the Bundesliga, they would not want to lose him and could command a similar fee to the £72 million they got for Kai Havertz. Williams, however, is a free agent from next summer.","pubDate":"2023-10-19 14:53:48","image_url":"https://cdn.mos.cms.futurecdn.net/M3TiQzJGFW5uP23MhVaXaN.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"365ccec8b7171ad53d14521fc374c90a","title":"Man Utd confirm key player set to miss Sheff Utd match but two injured stars return to training","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-confirm-key-player-set-to-miss-sheff-utd-match-but-two-injured-stars-back-in-training-4378361","keywords":["Manchester United","Football","Sport"],"creator":["Michael Plant"],"video_url":null,"description":"Manchester United face the division's bottom side on Saturday night, but will be without one their regular starters.","content":"Manchester United face the division's bottom side on Saturday night, but will be without one their regular starters. have confirmed that Casemiro is unavailable for Saturday's Premier League encounter . It was confirmed by the club last week that the ex-Real Madrid star had picked up a knock while on international duty, but he played the full 90 minutes as Brazil lost to Uruguay in midweek. Advertisement Advertisement Did you know you can manage your profile, and explore all of the available newsletters from ManchesterWorld within your account. It was presumed, therefore, that Casemiro would be available for the but United announced on Thursday afternoon that he won't be an option for Erik ten Hag. \"Casemiro was absent [from training on Thursday] having remained in Brazil, on the club’s advice, to recover as swiftly as possible from a small issue picked up while playing for his country,\" the Red Devils said via . United added that Casemiro is set to return to England 'early next week' and will resume training ahead of the Champions League encounter against Copenhagen, although the 30-year-old is suspended for the game following his red card last time out against Galatasaray. After playing a starring role last term at Old Trafford, Casemiro has struggled to perform at the same level this season, and he was in United's final game before the international break: a . Advertisement Advertisement Elsewhere, with the club have confirmed that Sergio Reguilon and Sofyan Amrabat have trained this week. The latter didn't feature in either of Morocco's matches over the international break, leading to suggestions he is injured, while Reguilon hasn't played since the 1-0 win over Burnley on 23 September, due to injury. His return will be a significant boost for Ten Hag given fellow left-backs at present. Assuming both are fit to start, Reguilon and Amrabat are likely to be named in United's XI on Saturday, with the Red Devils aiming to build on that injury-time comeback against Brentford. Ten Hag is expected to give a full fitness update in Friday's press conference, with the availability of Jonny Evans, Kobbie Mainoo and Amad unclear, while Aaron Wan-Bissaka, Lisandro Martinez and Jadon Sancho are absent, along with Shaw and Malacia.","pubDate":"2023-10-19 14:53:36","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/10/19/14/GettyImages-1678208062.jpg?width=1200&auto=webp","source_id":"manchesterworld","source_priority":123384,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"520bc386f3328058507b54c7d79d9377","title":"'Really had enough' - Tony Bellew rages at Everton woes as blame shared on talkSPORT","link":"https://www.goodisonnews.com/2023/10/19/tony-bellew-rages-at-everton-players-sick-of-blaming-managers-for-woes/","keywords":["News","everton","Tony Bellew"],"creator":["Joe Roberts"],"video_url":null,"description":"Everton managers can’t continue to be blamed for the club’s struggles as the “buck needs to start stopping” with the players, according to Tony Bellew. Speaking live on talkSPORT (19 October), the former boxer claimed the Toffees have had exceptional managers in the dugout in recent history who have failed to bring results, meaning the ... The post 'Really had enough' - Tony Bellew rages at Everton woes as blame shared on talkSPORT appeared first on Goodison News.","content":"Speaking live on (19 October), the former boxer claimed the Toffees have had exceptional managers in the dugout in recent history who have failed to bring results, meaning the players must take more responsibility. Bellew insisted the club need to have faith in a manager instead of returning to the “revolving door” of appointments that has brought them no success. Bellew said: “We need some kind of stability at our club. We need to believe and stick with a manager right til the end. I’m sick of the revolving door going around and managers going in and going out – I’ve really had enough of it now. “We need to show faith in the one that we’ve got. Ultimately, instead of blaming managers, I’ve got to be totally honest, the buck needs to start stopping in the dressing room with the lads, and they all know that. “We can’t keep blaming the managers. We’ve had some of the best managers the game’s [seen]. We’ve had the likes of Carlo Ancelotti, the likes of your Ronald Koemans, your Roberto Martinez’s, your David Moyes’. “I’m sick of blaming managers. At some point or another, someone’s got to go, ‘Right, sort these out.” While the players must give 100 per cent in every minute of football they play, they can’t be solely blamed the Everton’s continued struggle in recent seasons. Everton’s managerial appointments have been mostly unsuccessful. While the likes of Koeman left after poor form, the Goodison Park faithful would kill to finish in seventh place like the Dutchman achieved. Nethertheless, Everton of 2023 is a long away from the Everton of 2017, and Toffees fans have adjusted expectations accordingly. This season, the players have put in good performances and have been adept at creating chances. The recurring problem is the poor finishing up top, but Sean Dyche will back himself to change the fortunes of the likes of Beto and Arnaut Danjuma. While managers would certainly have a huge say in recruitment, the frequent high spending on underwhelming players has been a major downfall. Then, after the “revolving door” of managers, the profile of the squad has become a hodgepodge of different bosses’ philosophies who retained little resale value after their poor form. Everton desperately needs Dyche to work at the club and bring the needed sustainability, but Goodison Park has rarely been a predictable place. .","pubDate":"2023-10-19 14:40:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2021/09/Untitled-design-2021-09-22T193613.976-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"76a6dc911de71199cad1b419e35421a2","title":"Footage of Man Utd boss Erik ten Hag's 'dreadful' pass from playing days goes viral","link":"https://www.dailystar.co.uk/sport/football/man-utd-erik-ten-hag-31230094","keywords":["Sport"],"creator":null,"video_url":null,"description":"Manchester United boss Erik ten Hag won't want to see back a clip which is going viral from his playing days where he makes a right pig's ear of a simple pass","content":"has gone viral after footage emerged of the boss horribly miscuing a pass in his playing days. The Dutchman, 53, had a solid yet unremarkable active career as a centre back for FC Twente, De Graafschap, RKC Waalwijk and FC Utrecht in his home country before retiring at the age of 32. All in all he made in excess of 300 senior appearances. Back then defenders didn't have to be as good with the ball at their feet as they are nowadays - and that showed when he would make the move into defensive midfield on occasion. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month He's been done particularly dirty by one clip in which he receives the ball on the half turn in the middle of the park and attempts to play a simple pass out to the ring wing, where one of his team-mates was waiting. But instead of finding him, Ten Hag blasted the ball into the stand for a throw-in to the opposition. The broadcast then cut to a close up camera shot of the back of his shirt to leave no doubt about who the culprit was. United fans were left embarrassed by the poor quality, with one pleading: \"Don’t tell me that’s my manager.\" Another sighed: \"That was dreadful.\" Rival fans lapped it up on social media and teased the Red Devils supporters, with one joking: \"Is this the same guy that said... eras comes to an end.\" A second quipped: \"This one didn't want Ronaldo in his team? Lmao.\" A third brutally commented: \"No wonder he is leading Man Utd to the trenches.\" And referring to the recent poor form of Andre Onana, a fourth wrote: \"Like coach like keeper.\"","pubDate":"2023-10-19 14:38:49","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31230377.ece/ALTERNATES/s98/1_eth-passjpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a1af70fb27da4029f612e18c740782b4","title":"'My team-mate used the N-word after I warned him not to – so I sparked him out'","link":"https://www.dailystar.co.uk/sport/football/leroy-lita-championship-team-mate-31229826","keywords":["Sport"],"creator":null,"video_url":null,"description":"Leroy Lita has explained how he clashed with a former team-mate after the repeated use of the N-word - before he left him in agony on the floor","content":"Leroy Lita left a former team-mate on the floor in agony after warning him not to say the N-word - but he persisted in doing so. Best known for his spells with Bristol City, and , Lita spent 14 seasons in the Football League and once had a bad falling out with a colleague. Speaking on the Under The Cosh podcast, Lita said of the incident: \"Cheltenham Races during the season, March or whatever, so we all went down there. Had a good day out with good banter and everything like that. We got back and I remember the bar we used to (go to). We were all in there, empty, it was just us in there on a Tuesday night or something like that. \"Having a drink, sat next to (his team-mate) and he started singing a song and it included the N-word. I just said: 'Alright mate, don't say that'.\" Lita explained how the team-mate insisted he wasn't using the word towards him - but the striker told him not to say it in his presence. Lita added: \"I told him 10 times, then I said if you say it one more time I'm going to smash your face in.\" The player is then said to have repeated the word while saying he wasn't using it in the direction of Lita, who then admitted to losing his cool. He added: \"I lost my head and a team-mate came over and grabbed me, he's held me for about five minutes, I said: 'Listen, hold me as long as you want, as soon as you let me go I'm going for him, end of'.\" Lita was taken outside and the team-mate he was planning to run at followed, who allegedly kept saying the word while trying to use it in defence. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month When explaining what happened after he was let go, Lita added: \"I just went boom boom boom, (he) dropped on the floor, left him. Carried on with our night. (I) give him a couple of kicks to the face. He didn't even get to throw a punch.\" Lita spoke of the aftermath and said his manager was on the phone within two hours, telling him to come and visit in the morning. The veteran forward, who now plays for Nuneaton Borough at the age of 38, said he explained the situation and why he wouldn't be apologising or shaking anyone's hand, then walked out of the manager's office, never speaking to the team-mate again.","pubDate":"2023-10-19 14:36:08","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31229964.ece/ALTERNATES/s98/0_MAIN-PICS-My-team-mate-used-the-N-word-after-I-warned-him-not-to-so-I-sparked-him-out-Leroy-L.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c3af7f0915418fac769c5fc400a836bc","title":"No UEFA competition matches to be played in Israel ‘until further notice’","link":"https://www.northwaleschronicle.co.uk/sport/national/23866798.no-uefa-competition-matches-played-israel-until-notice/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The announcement comes amid the escalating Israel-Palestine conflict","content":"European football’s governing body has announced that no UEFA competition matches will be played in Israel until further notice. Israel’s national teams and club sides Maccabi Haifa and Maccabi Tel Aviv, who are both competing in Europe, must find alternative venues outside the country to fulfil their UEFA fixtures. The announcement comes amid the escalating Israel-Palestine conflict, which was sparked earlier this month by an attack on Israeli citizens by Hamas militants. A UEFA statement read: “After a thorough evaluation of the current safety and security situation in the whole territory of Israel, the UEFA Executive Committee decided that no UEFA competition matches shall be played in Israel until further notice. Latest updates from on competitions: Belgium-Sweden qualifier abandoned with 1-1 score confirmed as final. No UEFA competition match to be played in Israel until further notice. Maccabi Haifa withdraw from . Full details: ⬇️ — UEFA (@UEFA) “The Israel Football Association and its clubs Maccabi Haifa FC and Maccabi Tel-Aviv have been requested to propose alternative venues/stadiums (which must comply with all applicable UEFA regulations) outside the territory of Israel for their home matches to be used for as long as this decision remains in force.” Israel’s national team were due to stage Euro 2024 qualifiers against Switzerland and Romania – the two teams above them in Group I – in Tel Aviv and Jerusalem respectively next month, while Maccabi Haifa are playing in the Europa League and Maccabi Tel Aviv are in the Europa Conference League. A number of UEFA competition matches involving teams from Israel had already been postponed. Earlier on Thursday, the Football Association said it will review whether to continue lighting the Wembley arch as an act of tribute following criticism over its response to the Israel-Palestine conflict. FA chief executive Mark Bullingham accepted the “hurt” caused to the Jewish community by the FA’s decision not to light the arch in the colours of the Israeli flag for last Friday’s England friendly against Australia But he set out the steps the FA had taken to respond in what it felt was the most appropriate way to “one of the most complex geopolitical conflicts on Earth”. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “This week has made us question whether we should light the arch and when, and we’ll be reviewing that in the coming weeks,” Bullingham said at the Leaders Week conference at Twickenham. “I recognise that our decision caused hurt to the Jewish community who felt that we should have lit the arch, and that we should have shown stronger support for them. “This was one of the hardest decisions we’ve had to make, and the last thing we ever wanted to do in this situation was to add to the hurt. “We aren’t asking for everyone to agree with our decision, but to understand how we reached it. “It would be easy for football to ask why we’re the only sport being talked about in this way, particularly when rugby and cricket are in the middle of their World Cups. “However, you have got to understand, and we understand, that the power of football means it will always be in the spotlight. And that’s just something we we have to accept.” The FA was heavily criticised by a number of Jewish community groups last week, while Rabbi Alex Goldberg resigned from an FA faith in football group over its response. It was also criticised for not lighting the arch by Lucy Frazer, the Cabinet minister responsible for sport. Bullingham set out the steps the FA had taken to reach the position it did. “We first saw the acts of terror unfold on Saturday, October 7, along with the rest of the country. We immediately wrote to the Israeli FA to communicate our horror at what was taking place,” he said. “We knew the situation could move very, very quickly, and was likely to escalate, so we wanted to have expert guidance, and more information available on what we should do because we had a match on Friday against Australia. “We also spoke with our Australian colleagues and other stakeholders in the game to understand the views of players, clubs, and also of the leagues. “It’s worth noting that the Australians had upcoming games against both Palestine and Lebanon, so their desire for neutrality was obviously incredibly strong. “We then had a long board meeting on the Wednesday night and heard from experts on what is one of the most complicated geopolitical conflicts on Earth. “They then left the room and we had a debate on working out what we should do. “We all felt then, and we all feel now, that football should stand for peace and humanity and the wish to show compassion for all innocent victims of this terrible conflict. “Our compassion and sympathy is clearly for families and children in particular. “We then held a minute’s silence and wore black armbands recognises issuing a statement together with the Australian Federation to explain our actions, which many other sports then followed with identical wording, and our language was also very similar to that used by the United Nations. “We were the only football body in Europe to have a minute’s silence, which was, as I said, for all innocent victims.”","pubDate":"2023-10-19 14:21:17","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17351009/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bfc636f62753c89ed3e74fa9d3d60bd2","title":"No UEFA competition matches to be played in Israel ‘until further notice’","link":"https://www.northwalespioneer.co.uk/sport/national/23866798.no-uefa-competition-matches-played-israel-until-notice/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The announcement comes amid the escalating Israel-Palestine conflict","content":"European football’s governing body has announced that no UEFA competition matches will be played in Israel until further notice. Israel’s national teams and club sides Maccabi Haifa and Maccabi Tel Aviv, who are both competing in Europe, must find alternative venues outside the country to fulfil their UEFA fixtures. The announcement comes amid the escalating Israel-Palestine conflict, which was sparked earlier this month by an attack on Israeli citizens by Hamas militants. A UEFA statement read: “After a thorough evaluation of the current safety and security situation in the whole territory of Israel, the UEFA Executive Committee decided that no UEFA competition matches shall be played in Israel until further notice. Latest updates from on competitions: Belgium-Sweden qualifier abandoned with 1-1 score confirmed as final. No UEFA competition match to be played in Israel until further notice. Maccabi Haifa withdraw from . Full details: ⬇️ — UEFA (@UEFA) “The Israel Football Association and its clubs Maccabi Haifa FC and Maccabi Tel-Aviv have been requested to propose alternative venues/stadiums (which must comply with all applicable UEFA regulations) outside the territory of Israel for their home matches to be used for as long as this decision remains in force.” Israel’s national team were due to stage Euro 2024 qualifiers against Switzerland and Romania – the two teams above them in Group I – in Tel Aviv and Jerusalem respectively next month, while Maccabi Haifa are playing in the Europa League and Maccabi Tel Aviv are in the Europa Conference League. A number of UEFA competition matches involving teams from Israel had already been postponed. Earlier on Thursday, the Football Association said it will review whether to continue lighting the Wembley arch as an act of tribute following criticism over its response to the Israel-Palestine conflict. FA chief executive Mark Bullingham accepted the “hurt” caused to the Jewish community by the FA’s decision not to light the arch in the colours of the Israeli flag for last Friday’s England friendly against Australia But he set out the steps the FA had taken to respond in what it felt was the most appropriate way to “one of the most complex geopolitical conflicts on Earth”. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “This week has made us question whether we should light the arch and when, and we’ll be reviewing that in the coming weeks,” Bullingham said at the Leaders Week conference at Twickenham. “I recognise that our decision caused hurt to the Jewish community who felt that we should have lit the arch, and that we should have shown stronger support for them. “This was one of the hardest decisions we’ve had to make, and the last thing we ever wanted to do in this situation was to add to the hurt. “We aren’t asking for everyone to agree with our decision, but to understand how we reached it. “It would be easy for football to ask why we’re the only sport being talked about in this way, particularly when rugby and cricket are in the middle of their World Cups. “However, you have got to understand, and we understand, that the power of football means it will always be in the spotlight. And that’s just something we we have to accept.” The FA was heavily criticised by a number of Jewish community groups last week, while Rabbi Alex Goldberg resigned from an FA faith in football group over its response. It was also criticised for not lighting the arch by Lucy Frazer, the Cabinet minister responsible for sport. Bullingham set out the steps the FA had taken to reach the position it did. “We first saw the acts of terror unfold on Saturday, October 7, along with the rest of the country. We immediately wrote to the Israeli FA to communicate our horror at what was taking place,” he said. “We knew the situation could move very, very quickly, and was likely to escalate, so we wanted to have expert guidance, and more information available on what we should do because we had a match on Friday against Australia. “We also spoke with our Australian colleagues and other stakeholders in the game to understand the views of players, clubs, and also of the leagues. “It’s worth noting that the Australians had upcoming games against both Palestine and Lebanon, so their desire for neutrality was obviously incredibly strong. “We then had a long board meeting on the Wednesday night and heard from experts on what is one of the most complicated geopolitical conflicts on Earth. “They then left the room and we had a debate on working out what we should do. “We all felt then, and we all feel now, that football should stand for peace and humanity and the wish to show compassion for all innocent victims of this terrible conflict. “Our compassion and sympathy is clearly for families and children in particular. “We then held a minute’s silence and wore black armbands recognises issuing a statement together with the Australian Federation to explain our actions, which many other sports then followed with identical wording, and our language was also very similar to that used by the United Nations. “We were the only football body in Europe to have a minute’s silence, which was, as I said, for all innocent victims.”","pubDate":"2023-10-19 14:21:17","image_url":"https://www.northwalespioneer.co.uk/resources/images/17351009/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f49eba1c6a9186165f642d525b686af3","title":"How to watch Sheffield United vs Man Utd on TV - and why match kicks off on Saturday night","link":"https://www.manchesterworld.uk/sport/football/manchester-united/how-to-watch-sheffield-united-vs-man-utd-on-tv-and-why-match-kicks-off-on-saturday-night-4378195","keywords":["Manchester United","Football","Sport"],"creator":["Toby Bryant"],"video_url":null,"description":"Manchester United return to Premier League action against a struggling Sheffield United this weekend at an unusual time on Saturday.","content":"Manchester United return to Premier League action against a struggling Sheffield United this weekend at an unusual time on Saturday. Manchester United are back in Premier League action this weekend following the two-week international break with a trip to Sheffield United kicking off a busy run of fixtures for the side. Red Devils supporters will hope that at Old Trafford last time out will buoy Erik ten Hag's side, who have struggled for consistency this season. Off-the-pitch distractions have continued even during the break thanks to the drawn-out takeover saga and the Dutch manager will be hoping to keep his squad focused on the game. Advertisement Advertisement Did you know you can manage your profile, and explore all of the available newsletters from ManchesterWorld within your account. A win this weekend would set up Manchester United well in the Champions League, Manchester City in the Premier League and a cup tie with Newcastle United in the next three. Premier League action returns this weekend after the international break and Manchester United travel to Bramall Lane to take on a struggling Sheffield United side on Saturday, October 21. The fixture is set to kick off at the unusual time of 8 pm on Saturday so the Red Devils will be looking to build on the last-gasp victory over Brentford under the floodlights in Yorkshire. A rare late kick-off comes with its own logistical problems for Manchester United fans travelling to Bramall Lane on Saturday but the match wasn't initially due to take place in the 8 pm slot. Advertisement Advertisement The match will take place on Saturday night due to Champions League commitments at Manchester United. The fixture had been picked for broadcasting as part of Sky Sport's Super Sunday back in August but had to be moved after the Red Devils' European commitments were confirmed. Erik ten Hag's side host FC Copenhagen at Old Trafford on Tuesday, October 24 and Premier League sides cannot play on a Sunday and the following Tuesday, hence the trip to Sheffield United was rescheduled. Broadcasters had already filled the 12:30 pm slot with Liverpool vs Everton and the 5:30 pm slot with Chelsea vs Arsenal, meaning that the Manchester United vs Sheffield United match had to take the rarely-used late slot. Sky Sports will broadcast the match on Sky Sports Main Event and Sky Sports Premier League. Coverage of the fixture will start at 7:45 pm, 15 minutes before kick-off and will go on until 10:30 pm that night. For anyone without a Sky subscription, offers a Day Membership for £11.98, which would also grant access to the Chelsea vs Arsenal match earlier in the evening. The pass lasts 24 hours so if bought after around 7:30 pm, it would still be active to catch Aston Villa vs West Ham on Sunday. Advertisement Advertisement NowTV also offer a month membership for £34.99 which grants customers access to all channels for a longer period. This would grant access to view a range of Premier League games over the next four weeks, including the Manchester derby, which is due to be broadcast by Sky Sports on Sunday, October 29.","pubDate":"2023-10-19 14:15:37","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/10/19/14/GettyImages-1722579261.jpg?width=1200&auto=webp","source_id":"manchesterworld","source_priority":123384,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2823c83e2b580942f170f2aeb900e442","title":"Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom","link":"https://www.dailymail.co.uk/sport/football/article-12648955/Optas-supercomputer-predicts-Man-Citys-title-chances-fallen-nearly-20-Man-United-no-chance-getting-four-Chelsea-likely-finish-10th-plus-close-call-bottom.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In the updated analysis by Opta 's supercomputer , which crunches 10,000 match simulations to forcast final standings, City have seen their chances of defending their crown fall by nearly 20 per cent.","content":"Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom Opta have updated their Premier League predictions have eight match days Data has produced several changes in where teams are likely to finish this term Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Tum Balogun For Mailonline Published: 15:15, 19 October 2023 | Updated: 15:15, 19 October 2023 e-mail 52 View comments Eight matches of data have altered figures predicting the final Premier League table as Manchester City 's chances of a fourth consecutive title took a hit following defeats to Wolves and Arsenal . The first two months of the season have thrown up plenty of suprises at the top of the table with Tottenham leading the way ahead of their north London rivals. Five teams have already finished the day at the top - two more than in the whole of the 2022-23 season. Lower down the league lies the likes of Manchester United and Chelsea following their poor starts. While the newly-promoted sides have struggled to adapt to the step up in quality and occupy three of the bottom four spots. In the updated analysis by Opta 's supercomputer , which crunches 10,000 match simulations to forecast final standings, City have seen their chances of defending their crown fall by nearly 20 per cent. The supercomputer gave them a 90.2 per cent chance of league success before the campaign but Pep Guardiola 's side sit in third after suffering back-to-back league defeats and now have a 73.4 per cent chance of taking the title. Opta have released updated predicitions on the final standings following the new match data Manchester City suffered back-to-back defeats for the first time in five years before the break Tottenham have been the suprise package so far and are top with six wins from eight games The biggest beneficiaries of this reduction are Arsenal and Liverpool , who have seen their chances rise by 7.3 and 8.7 per cent respectively. Opta Premier League final table predicition 1. Manchester City 2. Arsenal 3. Liverpool 4. Tottenham Hotspur 5. Newcastle United 6. Aston Villa 7. Brighton & Hove Albion 8. West Ham United 9. Manchester United 10. Chelsea 11. Crystal Palace 12. Fulham 13. Brentford 14. Wolverhampton Wanderers 15. Nottingham Forest 16. Everton 17. Burnley 18. Bournemouth 19. Luton Town 20. Sheffield United <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Mikel Arteta's Gunners are unbeaten so far this term and secured a crucial confidence-boosting 1-0 win against the Cityzens before the international break. Their most likely finishing position remains second just ahead of Jurgen Klopp's side. However, the early season pace-setters Tottenham have risen from a pre-season prediction of eighth into the top four. Ange Postecoglou has bagged successive Premier League Manager of the Month awards for his team's startling run which now has them tipped for Champions League qualification. Spurs have a 24.6 per cent chance of finishing fourth, according to Opta's figures, ahead of Newcastle and Aston Villa. The latter has experienced a similar statistical reappraisal after a promising beginning. Unai Emery's team sit level on points with Brighton in fifth and only four points off the top of a congested league table. Man United and Chelsea fans will be disheartened - but unsurprised - to see their teams predicited to finish 9th and 10th this season. That result would remarkably represent progress for a Chelsea outfit that found themselves in the bottom half last term. United have been given a 3.4 per cent chance of finishing in any of the top four places. Meanwhile, Chelsea's odds are even slimer at 0.6 per cent. The Premier League giants will hope they can recover from lacklustre starts to return to their pre-season predictions of fourth and sixth respectively. Opta's supercomputer also provides some clarity at the foot of the table. Bournemouth and Sheffield United are the only side still waiting for their first win and naturally occupy the bottom two places in the division. Your browser does not support iframes. Despite a crucial dramatic late win against Brentford in their last game, Man United sit 10th Bottom club Sheffield United are one of two winless teams in the Premier League this season After a slow start, Everton have been tipped to avoid relegation from the top-flight this year As a result, they are predicited to go down this season, with the Blades now tipped to finish bottom after the pre-season model indicated 19th was more likely. Andoni Iraola's Cherries have remained in 18th. Luton, who currently sit outside the relegation zone in 17th, are still predicted to make an immediate return to the Championship and have a 27.3 per cent chance of finishing 19th. All three teams have seen their chances of relegation significantly rise compared to the start of the season. Paul Heckingbottom's team have had the sharpest hike from 49 to 85 per cent. Burnley and Everton are seen as safer bets to escape the drop, though there is not much in it. The Toffees, Clarets and Cherries are all within 3.2 percentage points of one another to finish 17th. Luton, Burnley and Bournemouth are seperated by just one per cent to end the campaign in 18th. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Premier League Pep Guardiola Share or comment on this article: Opta's supercomputer now predicts Man City's title chances have fallen by nearly 20%, Man United have almost no chance of getting into the top four and Chelsea are likely to finish 10th - plus it's too close to call at the bottom e-mail Add comment Comments 53 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-19 14:15:35","image_url":"https://i.dailymail.co.uk/1s/2023/10/19/15/76756051-0-image-a-5_1697724889571.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"}]}