{"newsArray":[{"title":"Qui pour composer l'ossature des Espoirs avec le nouveau sélectionneur Thierry Henry ?","link":"https://www.lequipe.fr/Football/Actualites/Qui-pour-composer-l-ossature-des-espoirs-avec-le-nouveau-selectionneur-thierry-henry/1415012#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Hugo Guillemet"],"video_url":null,"description":"Thierry Henry, nommé sélectionneur de l'équipe de France Espoirs lundi, pourra s'appuyer sur des joueurs nés jusqu'en 2002 pour la campagne de qualification à l'Euro 2025. Mais des éléments des générations suivantes devraient venir étoffer son groupe.","content":"Thierry Henry sera très attendu jeudi 31 août, en tant que sélectionneur de l'équipe de France Espoirs, pour entamer les qualifications à l'Euro 2025 (déplacement en Slovénie le 11 septembre, après un match amical contre le Danemark le 7 à Nancy). Il devra pour cela piocher parmi les joueurs nés après le 1er janvier 2002. Il n'aura pas droit à la tête de gondole de la génération, Eduardo Camavinga, inamovible chez les A de Didier Deschamps, mais il devrait s'appuyer sur quelques cadres du dernier Euro Espoirs, comme Castello Lukeba (Leipzig), Bradley Barcola (Lyon) ou Arnaud Kalimuendo (Rennes). Des joueurs bien plus jeunes pourraient évidemment constituer son noyau, comme ceux de l'exceptionnelle génération 2005. Le gardien Guillaume Restes (Toulouse), le défenseur Leny Yoro (Lille), les latéraux Saël Kumbedi (Lyon) et Jeanuël Belocian (Rennes), le milieu Désiré Doué (Rennes) ou les attaquants Mathys Tel (Bayern Munich) et Eliesse Ben Seghir (Monaco) jouent déjà régulièrement dans leur club. Les 2003 devraient aussi se tailler une bonne part du gâteau, avec le latéral droit Malo Gusto (Chelsea), le meneur de jeu Rayan Cherki (Lyon) et l'attaquant Elye Wahi (Lens). L'option Zaïre-Emery, déjà Le latéral gauche Quentin Merlin (2002, Nantes) sera là, aussi, comme peut-être Johann Lepenant (Lyon), tandis que des 2004 comme Lesley Ugochukwu (Chelsea) ou Wilson Odobert (Burnley), voire Khalil Fayad (Montpellier) ou Mohamed El Arouch (Lyon) postuleront naturellement. Enfin, difficile d'imaginer que le prodige Warren Zaïre-Emery, un 2006 titulaire au PSG, n'ait pas tapé dans l'oeil d'Henry. Pour les Jeux Olympiques de Paris, la problématique sera différente car le sélectionneur pourra appeler des joueurs nés en 2001 (le gardien de Lille Lucas Chevalier, par exemple) pour constituer sa liste de 18, ainsi que trois éléments hors limite d'âge. Mais ce sera une autre équipe, qui n'existera qu'à partir de juin 2024, pour deux matches amicaux préparatoires au tournoi olympique (25 juillet - 10 août), l'objectif majeur du mandat.","pubDate":"2023-08-22 06:00:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/castello-lukeba-et-bradley-barcola-deux-membres-de-la-generation-2002-b-paquot-l-equipe/1500000001823864/327:326,1770:1288-665-335-70/ea3c8.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Стартират решителните плейофи за влизане в групите на Шампионска лига","link":"https://gong.bg/football-sviat/shampionska-liga/startirat-reshitelnite-plejofi-za-vlizane-v-grupite-na-shampionska-liga-750005","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Днес се дава старт на решителния пелйофен кръг за влизане в груповата фаза на Шампионска лига. Програмата започва с три двубоя, които ще се играят тази вечер и са с начален час 22:00. Всичко най-интересно от предстоящите сблъсъци може да намерите в Gong.bg. В първия двубой полския Раков Ченстохова се изправя срещу Копенхаген, а в безспорно най-интересната двойка тази вечер, шотландският Глазгоу Рейнджърс приема нидерландския гранд ПСВ Айндховен. Програмата ще бъде закрита с мача между Антверпен и АЕК Атина. В утрешния ден предстоят нови три сблъсъка: Макаби Хайва – Йънг Бойс Молде – Галатасарай Брага - Панатинаикос","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Лудост! Опашка за билети на \"Герена\" от ранни зори (снимка)","link":"https://gong.bg/bg-football/evrouchastnici/multimedia/video/ludost-opashka-za-bileti-na-gerena-ot-ranni-zori-snimka-749999","keywords":["no"],"creator":null,"video_url":null,"description":"Левски пуска в свободна продажба билетите за мача с Айнтрахт Франкфурт днес от 12:00 часа. До момента пропуски можеше да си закупуват хората, които имат абонаментни карти за този сезон. Очаква се стадион \"Васил Левски\" да бъде пълен в четвъртък, когато ще се проведе срещата. В социалните мрежи се появи с...","content":"Левски пуска в свободна продажба билетите за мача с Айнтрахт Франкфурт днес от 12:00 часа. До момента пропуски можеше да си закупуват хората, които имат абонаментни карти за този сезон. Очаква се стадион \"Васил Левски\" да бъде пълен в четвъртък, когато ще се проведе срещата. В социалните мрежи се появи снимка, на която се вижда, че опашка за пропуски се извива пред Сектор А на \"Герена\" още в 6:45 часа тази сутрин. източник: Facebook Билети ще се продават както там, така и на касите на Националния стадион на бул. „Гурко“.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Шампионът на Азербайджан представи защитник на Локомотив Пловдив","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/shampionyt-na-azerbajdzhan-predstavi-zashtitnik-na-lokomotiv-plovdiv-750001","keywords":["no"],"creator":null,"video_url":null,"description":"Най-успешният футболен клуб от Азербайджан в последните години – Карабах (Агдам) представи си новото попълнение от българския Локомотив (Пловдив) - десният бранител Матеус да Силва. \"Дълго проточилите се преговори приключиха успешно и вече имаме подписан договор за 2+2 години с 25-годишния защитник. ...","content":"Най-успешният футболен клуб от Азербайджан в последните години – Карабах (Агдам) представи си новото попълнение от българския Локомотив (Пловдив) - десният бранител Матеус да Силва. \"Дълго проточилите се преговори приключиха успешно и вече имаме подписан договор за 2+2 години с 25-годишния защитник. Бразилският футболист ще носи фланелката с номер 2 в нашия отбор\", се казва в официалното съобщение на Карабах. 25-годишният десен бек ще бъде картотекиран за груповата фаза на клубния турнир, в който шампионите на Азербайджан ще участват. В четвъртък те играят първи плейофен мач за попадане в Лига Европа срещу Олимпия (Любляна), а съдийска бригада начело с Георги Кабаков ще свири мача на стадион \"Стожице\". При поражение азерите ще слязат в групите на турнира Лига на Конференциите. Бразилецът дойде на Лаута преди малко повече от една година – в началото на юли 2022-а година и веднага направи впечатление с качествата си-. В миналогодишната кампания записа 32 мача във всички турнири и вкара един гол, а през тази година в първите 6 мача беше титуляр и вкара 1 гол. Въпреки че играе като десен бранител, Матеус да Силва без проблем може да бъде използван и в средата на терена - като външен халф или централен полузащитник. Според страницата за футболни сделки transfermarkt.com Локомотив (Пловдив) ще получи 350 хиляди евро за правата на бразилеца, който през зимата отказа да премине в ЦСКА 1948. Карабах е 10 пъти шампион на Азербайджан, в това число в три от последните четири сезона./ БТА","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Байерн и Интер се разбраха за Павар, остана една пречка за трансфера","link":"https://gong.bg/football-sviat/germania/multimedia/video/bajern-i-inter-se-razbraha-za-pavar-ostana-edna-prechka-za-transfera-750003","keywords":["no"],"creator":null,"video_url":null,"description":"Байерн Мюнхен постигна договорка с Интер за продажбата на фреския национал Бенжамен Павар. Защитникът ще премине в редиците на \"нерадзурите\" срещу 30 млн. евро плюс бонуси. Двата клуба преговаряха в последните няколко дни, като в крайна сметка са се разбрали за сделката. Баварците обаче ще дадат зелен...","content":"Байерн Мюнхен постигна договорка с Интер за продажбата на фреския национал Бенжамен Павар. Защитникът ще премине в редиците на \"нерадзурите\" срещу 30 млн. евро плюс бонуси. Двата клуба преговаряха в последните няколко дни, като в крайна сметка са се разбрали за сделката. Баварците обаче ще дадат зелена светлина за осъществяването на трансфера, след като си осигурят заместник на Павар. Bayern and Inter have agreed a €30m + €2-3m fee for Benjamin Pavard. But Bayern will not let the Frenchman go until they find a replacement that can play right-back and centre-back [ @AZ_Strasser ] https://t.co/OZWlOoEyUO — Bayern & Germany (@iMiaSanMia) August 21, 2023 На \"Алианц Арена\" искаха Кайл Уокър, но англичанинът избра да остане в Манчестър Сити. Според медиите в Германия другите опции са Лутшарел Геертрюда от Фейенорд и Лукас Клостерман от РБ Лайпциг. Очаква се днес или утре Байерн да уреди нов защитник, който да може да играе като десен бек и в центъра на отбраната, след което да продаде Павар на Интер.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Черно море продава голмайстора си на Бенфика","link":"https://gong.bg/bg-football/efbet-liga/cherno-more-prodava-golmajstora-si-na-benfika-750004","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Черно море е съвсем близо до страхотен изходящ трансфер. \"Моряците\" водят заключителни преговори с португалския гранд Бенфика за нападателя Матеус Машадо. Бразилецът е желан за втория отбор на \"орлите\", а във Варна усилено се говори, че сделката ще е на стойност 1 млн. евро, пише \"Мач Телеграф\". Именно готвещият се трансфер е причината Матеус Машадо да не започне като титуляр в мача с Лудогорец, спечелен от варненци с 1:0. В първите 5 кръга от първенството Матеус Машадо беше твърд титуляр и се отчете с 4 гола. Плановете на Бенфика са първоначално 20-годишният нападател да играе за втория отбор и ако се представи добре да бъде качен в първия състав. Матеус Машадо дойде във Варна в началото на годината със свободен трансфер от Корфакан.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Гросмайсторите на efbet Лига - топ 5 попадения от 6-ия кръг","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/grosmajstorite-na-efbet-liga-top-5-popadeniia-ot-6-iia-kryg-749998","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Приключи петият кръг в родния елит, в който бяха отбелязани някои от тях бяха наистина майсторски. В традиционната класация на Gong.bg - “Гросмайсторите на efbet Лига“, сме отличили най-красивите попадения. На пето място се нарежда попадението на Лучано Скуадроне от Берое при победата с 3:0 над Славия. Веднага преди него е дебютния гол на Николас Пенев. Синът на Любослав Пенев донесе успеха на Хебър при гостуването на Локомотив София с 1:0. Третата позиция е за юношата на Локомотив Пловдив Петър Андреев. Младокът се разписа с кинжален удар за победата с 1:0 над Арда на \"Лаута\". Второ място отредихме на Диего Рапосо. Бразилецът матира Ботев Пловдив за обрата на Крумовград и успеха с 2:1 на \"Колежа\". Победител в шестия кръг е Цветомир Панов. Левият защитник на Черно море вкара страхотен гол за победата с 1:0 над Лудогорец на \"Тича\". В прикаченото видео може да се насладите на още веднъж на петте попадения.","pubDate":"2023-08-22 05:43:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Oliver Roggisch im Interview : „Ich als Footballspieler? Ja, das hätte bestimmt Bock gemacht“","link":"https://rp-online.de/sport/handball/handball-bundesliga-2023-24-oliver-roggisch-von-den-rhein-neckar-loewen-erwartet-die-spannendste-saison-aller-zeiten_aid-95926357","keywords":["Sport","Handball"],"creator":["Stefan Klüttermann"],"video_url":null,"description":"Die Rhein-Neckar Löwen wollen am Mittwoch im Supercup in Düsseldorf gegen den THW Kiel den ersten Titel der neuen Handball-Saison. Der Sportliche Leiter der Löwen und Teammanager der Nationalmannschaft spricht über eine brutale Qualität in der Liga, das EM-Eröffnungsspiel im Januar und was der junge Olli Roggisch noch so hätte sportlich ausprobieren können.","content":"Herr Roggisch, mit dem Pixum Super Cup am Mittwoch in Düsseldorf beginnt die Handballsaison 2023/24. Sie wird ein . Die Ligastrapazen, dazu die Heim-EM in Januar und zum Schluss noch Olympia in Paris. Zittert man als Verantwortlicher da noch mehr als sonst, dass sich keiner verletzt? Zunächst einmal haben wir in diesem Jahr den Kader breiter aufgestellt und so mehr Alternativen. Ich hoffe, das hilft schon mal. Aber zwei große, internationale Turniere binnen sechs Monaten, plus die im Wochentakt, plus die European League, das wird hammerhart. Das weiß ich ja noch aus eigener Erfahrung. Und da kannst du im Vorfeld auch nicht alle Maßnahmen treffen, die es braucht, um die großen Belastungen bestmöglich auffangen zu können. Aber vorher schon Angst zu haben, macht keinen Sinn. Wir bereiten uns auf allen Ebenen bestmöglich vor und müssen auch kurzfristig reagieren können. Das ist ein Teil unseres Geschäfts. Und ich fürchte, dass du ohne Verletzungen eh nie durchkommst. 44 Kreisläufer TuS Schutterwald, FA Göppingen, TuSEM Essen, SC Magdeburg, RN Löwen Länderspiele 205 eltmeister 2007, 2x Sieger EHF-Pokal (2007 und 2013) Was ist am Ende der größte Wert von einem Supercup? Es geht um einen Titel. Punkt. Jedes Team würde die Saison gerne starten mit einem Titelgewinn, das ist gut für die Stimmung, das gibt Rückenwind. Wir wollen den Supercup zum vierten Mal gewinnen. Denn ein Gewinn des Supercups steht auf dem Briefkopf drauf, und so viele Titel haben wir als Rhein-Neckar Löwen nun auch noch nicht geholt, dass wir sagen, das ist ein besseres Testspiel. Jeder Titel, jeder Sieg zählt, zumal wir hier gegen den antreten. Mit den Löwen und Kiel treffen in Düsseldorf zwei der Großen in der HBL aufeinander. Nehmen wir noch Flensburg, Berlin, Magdeburg dazu. Das gibt ein schönes Hauen und Stechen an der Spitze, oder? Es wird eigentlich jedes Jahr spannender, immer enger, deswegen erwarte ich im Prinzip auch die spannendste Saison aller Zeiten. Sie haben fünf Teams genannt. Nehmen Sie noch Melsungen dazu, wo jeder darauf wartet, wann der nächste Schritt kommt. Das ist eine brutale Dichte, eine enorm große Qualität. Wir als Rhein-Neckar Löwen wollen wieder international spielen, das wollen andere aber auch. Die Budgets sind, ich will nicht sagen explodiert, aber schon schön gewachsen, entsprechend stark und breit sind die Kader aufgestellt. Das ist schon beeindruckend, was insbesondere die genannten Topklubs bieten. Ich bin gespannt. Im Fußball heißt es oft, die Qualifikation für den Europapokal sei wie ein kleiner Titelgewinn. Ist das im Handball inzwischen genauso? Das würde ich für uns schon sagen. Es ist realistisch, dass wir unter die ersten fünf der HBL-Tabelle kommen. Ganz oben sind vielleicht zwei, drei andere Teams, die ein bisschen besser aufgestellt sind. Da wollen wir wieder hinkommen. Aber wir müssen natürlich den Anspruch haben, mindestens European League zu spielen, sonst bekommst du die Spieler nicht, die du bekommen willst. Die Spieler, die den Unterscheid machen können, kommen nicht in die Bundesliga, um im Mittelfeld mitzuspielen. Wenn ich an den DHB-Pokalsieg der Löwen im April denke, fällt mir ein Wort sofort ein: Emotion. Wie lange kann man die Emotionalität eines solchen Moments als Verein konservieren? : Auch das kenne ich aus eigener Erfahrung. Jeder Titel – und der Pokalsieg ist ein großer Titel – macht noch mehr Hunger auf den nächsten Titel. Die Gier wird nur noch größer. Und das ist gut so, denn genau so ehrgeizige, hungrige Spieler wollen wir bei uns haben. Am Mittwoch haben wir in Düsseldorf die Chance auf den nächsten Titel. Ich hoffe sehr, dass weitere im Laufe der Saison dazukommen werden. Wie groß sind die Fragezeichen vor dem Start? Was nehmen die Löwen aus der Vorbereitung mit? Wenn das Testspiel gegen Wetzlar [36:25 am 16. August, Anm. d. Red.] nicht gewesen wäre, hätte ich noch ein paar Fragezeichen, aber gegen die HSG haben wir sehr, sehr vernünftig gespielt. Dass mit Olle Schefvert einer unserer Leader im Innenblock fehlt, ist aktuell unsere größte Baustelle. In der Abwehr haben wir noch Luft nach oben, nach vorne läuft es dagegen schon richtig gut. Nun können wir über Düsseldorf als Supercup-Ort nicht reden, ohne über Düsseldorf als Ort des EM-Eröffnungsspiels zu reden. In der Arena, vor einem Rekordpublikum von vielleicht 50.000 Fans. Das wird bestimmt großartig und einzigartig. Ich finde es noch schwierig, mir konkret vorzustellen, wie die Stimmung sein wird, weil man natürlich weiter weg ist in einem derart weitläufigen Stadion. Ich war jedenfalls total geflasht, wie schnell die Tickets weg waren. Die Zuschauer, die hinter dir stehen, können bei einem Heim-Turnier ein Riesenfaktor sein, der ein Team emotional treibt und trägt. Auch das habe ich beim WM-Titel 2007 als Spieler erlebt. Und ich bin mir sicher, dass das zum Auftakt in Düsseldorf ein großes Handballfest gegen die Schweiz werden wird. Von großen Fußballfesten ist die deutsche Nationalmannschaft aktuell weit entfernt. Kann der Handball aus der Schwäche des Fußballs an dieser Stelle Profit schlagen? Wir sollten vor allem für uns nutzen, dass wir den geilsten Sport der Welt haben. Unabhängig davon, was andere tun. Wir sind ein sehr nahbarer Sport, wir haben echte Typen, leben bei aller Härte Fair-Play in der Halle. Wir müssen nicht darüber reden, was andere schlecht machen, wir können selbstbewusst sagen, was wir gut machen. Echte Typen braucht es zwingend. Gerade im Kampf um die jungen Zuschauer, die keine Lust mehr haben, 60 oder 90 Minuten lang ihre ganze Aufmerksamkeit einem Sportereignis zu widmen. : Ganz genau. Und da haben wir einen Riesenvorteil. Wir haben die Typen, die es braucht, und der neue TV-Vertrag mit Dyn wird uns sehr weiterhelfen, weil wir als Liga und Vereine mehr Zugriff auf Spielszenen und Highlights haben und damit weit stärker als bisher unsere eigenen digitalen Plattformen bespielen können, um so weitaus mehr Formate, Reichweite und Aufmerksamkeit erzeugen zu können. Wir müssen deswegen jetzt auch schnell lernen, wie wir die neuen Möglichkeiten, die uns der neue Medienvertrag bietet, bestmöglich für uns nutzen. Wie man eine Sportart komplett vermarktet, kann man sicherlich in erster Linie vom Football lernen. Dessen Beliebtheit wächst in Deutschland seit Jahren rapide. Verfolgen Sie ihn auch? : Football ist ein toller Sport, den ich auch verfolge, wenn auch nicht superaktiv. Aber ich merke ja auch in der Mannschaft, dass Football auch hier ein Thema ist. Wir als Handball müssen immer gucken, was um uns herum passiert. Aber wir müssen vor allem etwas aus unserem Produkt machen. Und dabei sind wir erfolgreich, ohne die Bodenhaftung zu verlieren. Wir bieten erstklassigen Sport und einen erstklassigen Rahmen für diesen Sport. Das müssen andere erst einmal nachmachen. Wir müssen uns nicht verstecken. Der junge hätte statt im Mittelblock beim Handball aber auch in einer Offensive Line beim Football landen können, oder? In beiden Positionen kann man schließlich Gegenspieler herumschubsen. (lacht): Ich glaube ja, das hätte bestimmt Bock gemacht. Aber, wenn ich sehe, wie kurz manche Karriere in der NFL nur dauert, dann bin ich doch froh, beim Handball gelandet zu sein. Denn ich glaube Football ist nochmal eine ganz andere Sache, was die körperliche Belastung angeht. Das ist am Ende auch wahrscheinlich einfach nicht gesund.","pubDate":"2023-08-22 05:30:00","image_url":"https://rp-online.de/imgs/32/1/7/5/5/6/1/7/2/9/tok_f3290a709d0cb863683ebf143f86dee4/w940_h528_x470_y264_4af592e3f501c6a6.jpg","source_id":"rp_online","source_priority":605562,"country":["germany"],"category":["sports"],"language":"german"},{"title":"Айнтрахт прати младежки национал на Германия в Кьолн","link":"https://gong.bg/football-sviat/germania/multimedia/video/ajntraht-prati-mladezhki-nacional-na-germaniia-v-kioln-749997","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Съперникът на Левски в плейофа за влизане в групите на Лига на конференциите Айнтрахт Франкфурт даде под наем на Кьолн младежкия национал на Германия Фариде Алиду. Трансферът беше финализиран вчера. През изминалия сезон Алиду записа 15 мача за състава от Франкфурт в Бундеслигата и пет в Шампионската лига. Той има договор до 2026 година. На \"Дойче Банк Парк\" обаче прецениха, че фланговият нападател трудно ще се пребори за игрово време през този сезон и го пратиха при \"козлите\". Алиду има договор с Айнтрахт до лятото на 2026 година.","pubDate":"2023-08-22 05:25:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Изявите на Асен Митков за Левски","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/iziavite-na-asen-mitkov-za-levski-749996","keywords":["no"],"creator":null,"video_url":null,"description":"Изявите на Асен Митков за Левски...","content":"Изявите на Асен Митков за Левски","pubDate":"2023-08-22 05:18:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Qui pour composer l'ossature des Espoirs avec le nouveau sélectionneur Thierry Henry ?","link":"https://www.lequipe.fr/Football/Actualites/Qui-pour-composer-l-ossature-des-espoirs-avec-le-nouveau-selectionneur-thierry-henry/1415012#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Hugo Guillemet"],"video_url":null,"description":"Thierry Henry, nommé sélectionneur de l'équipe de France Espoirs lundi, pourra s'appuyer sur des joueurs nés jusqu'en 2002 pour la campagne de qualification à l'Euro 2025. Mais des éléments des générations suivantes devraient venir étoffer son groupe.","content":"Thierry Henry sera très attendu jeudi 31 août, en tant que sélectionneur de l'équipe de France Espoirs, pour entamer les qualifications à l'Euro 2025 (déplacement en Slovénie le 11 septembre, après un match amical contre le Danemark le 7 à Nancy). Il devra pour cela piocher parmi les joueurs nés après le 1er janvier 2002. Il n'aura pas droit à la tête de gondole de la génération, Eduardo Camavinga, inamovible chez les A de Didier Deschamps, mais il devrait s'appuyer sur quelques cadres du dernier Euro Espoirs, comme Castello Lukeba (Leipzig), Bradley Barcola (Lyon) ou Arnaud Kalimuendo (Rennes). Des joueurs bien plus jeunes pourraient évidemment constituer son noyau, comme ceux de l'exceptionnelle génération 2005. Le gardien Guillaume Restes (Toulouse), le défenseur Leny Yoro (Lille), les latéraux Saël Kumbedi (Lyon) et Jeanuël Belocian (Rennes), le milieu Désiré Doué (Rennes) ou les attaquants Mathys Tel (Bayern Munich) et Eliesse Ben Seghir (Monaco) jouent déjà régulièrement dans leur club. Les 2003 devraient aussi se tailler une bonne part du gâteau, avec le latéral droit Malo Gusto (Chelsea), le meneur de jeu Rayan Cherki (Lyon) et l'attaquant Elye Wahi (Lens). L'option Zaïre-Emery, déjà Le latéral gauche Quentin Merlin (2002, Nantes) sera là, aussi, comme peut-être Johann Lepenant (Lyon), tandis que des 2004 comme Lesley Ugochukwu (Chelsea) ou Wilson Odobert (Burnley), voire Khalil Fayad (Montpellier) ou Mohamed El Arouch (Lyon) postuleront naturellement. Enfin, difficile d'imaginer que le prodige Warren Zaïre-Emery, un 2006 titulaire au PSG, n'ait pas tapé dans l'oeil d'Henry. Pour les Jeux Olympiques de Paris, la problématique sera différente car le sélectionneur pourra appeler des joueurs nés en 2001 (le gardien de Lille Lucas Chevalier, par exemple) pour constituer sa liste de 18, ainsi que trois éléments hors limite d'âge. Mais ce sera une autre équipe, qui n'existera qu'à partir de juin 2024, pour deux matches amicaux préparatoires au tournoi olympique (25 juillet - 10 août), l'objectif majeur du mandat.","pubDate":"2023-08-22 06:00:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/castello-lukeba-et-bradley-barcola-deux-membres-de-la-generation-2002-b-paquot-l-equipe/1500000001823864/327:326,1770:1288-665-335-70/ea3c8.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Стартират решителните плейофи за влизане в групите на Шампионска лига","link":"https://gong.bg/football-sviat/shampionska-liga/startirat-reshitelnite-plejofi-za-vlizane-v-grupite-na-shampionska-liga-750005","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Днес се дава старт на решителния пелйофен кръг за влизане в груповата фаза на Шампионска лига. Програмата започва с три двубоя, които ще се играят тази вечер и са с начален час 22:00. Всичко най-интересно от предстоящите сблъсъци може да намерите в Gong.bg. В първия двубой полския Раков Ченстохова се изправя срещу Копенхаген, а в безспорно най-интересната двойка тази вечер, шотландският Глазгоу Рейнджърс приема нидерландския гранд ПСВ Айндховен. Програмата ще бъде закрита с мача между Антверпен и АЕК Атина. В утрешния ден предстоят нови три сблъсъка: Макаби Хайва – Йънг Бойс Молде – Галатасарай Брага - Панатинаикос","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Лудост! Опашка за билети на \"Герена\" от ранни зори (снимка)","link":"https://gong.bg/bg-football/evrouchastnici/multimedia/video/ludost-opashka-za-bileti-na-gerena-ot-ranni-zori-snimka-749999","keywords":["no"],"creator":null,"video_url":null,"description":"Левски пуска в свободна продажба билетите за мача с Айнтрахт Франкфурт днес от 12:00 часа. До момента пропуски можеше да си закупуват хората, които имат абонаментни карти за този сезон. Очаква се стадион \"Васил Левски\" да бъде пълен в четвъртък, когато ще се проведе срещата. В социалните мрежи се появи с...","content":"Левски пуска в свободна продажба билетите за мача с Айнтрахт Франкфурт днес от 12:00 часа. До момента пропуски можеше да си закупуват хората, които имат абонаментни карти за този сезон. Очаква се стадион \"Васил Левски\" да бъде пълен в четвъртък, когато ще се проведе срещата. В социалните мрежи се появи снимка, на която се вижда, че опашка за пропуски се извива пред Сектор А на \"Герена\" още в 6:45 часа тази сутрин. източник: Facebook Билети ще се продават както там, така и на касите на Националния стадион на бул. „Гурко“.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Шампионът на Азербайджан представи защитник на Локомотив Пловдив","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/shampionyt-na-azerbajdzhan-predstavi-zashtitnik-na-lokomotiv-plovdiv-750001","keywords":["no"],"creator":null,"video_url":null,"description":"Най-успешният футболен клуб от Азербайджан в последните години – Карабах (Агдам) представи си новото попълнение от българския Локомотив (Пловдив) - десният бранител Матеус да Силва. \"Дълго проточилите се преговори приключиха успешно и вече имаме подписан договор за 2+2 години с 25-годишния защитник. ...","content":"Най-успешният футболен клуб от Азербайджан в последните години – Карабах (Агдам) представи си новото попълнение от българския Локомотив (Пловдив) - десният бранител Матеус да Силва. \"Дълго проточилите се преговори приключиха успешно и вече имаме подписан договор за 2+2 години с 25-годишния защитник. Бразилският футболист ще носи фланелката с номер 2 в нашия отбор\", се казва в официалното съобщение на Карабах. 25-годишният десен бек ще бъде картотекиран за груповата фаза на клубния турнир, в който шампионите на Азербайджан ще участват. В четвъртък те играят първи плейофен мач за попадане в Лига Европа срещу Олимпия (Любляна), а съдийска бригада начело с Георги Кабаков ще свири мача на стадион \"Стожице\". При поражение азерите ще слязат в групите на турнира Лига на Конференциите. Бразилецът дойде на Лаута преди малко повече от една година – в началото на юли 2022-а година и веднага направи впечатление с качествата си-. В миналогодишната кампания записа 32 мача във всички турнири и вкара един гол, а през тази година в първите 6 мача беше титуляр и вкара 1 гол. Въпреки че играе като десен бранител, Матеус да Силва без проблем може да бъде използван и в средата на терена - като външен халф или централен полузащитник. Според страницата за футболни сделки transfermarkt.com Локомотив (Пловдив) ще получи 350 хиляди евро за правата на бразилеца, който през зимата отказа да премине в ЦСКА 1948. Карабах е 10 пъти шампион на Азербайджан, в това число в три от последните четири сезона./ БТА","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Байерн и Интер се разбраха за Павар, остана една пречка за трансфера","link":"https://gong.bg/football-sviat/germania/multimedia/video/bajern-i-inter-se-razbraha-za-pavar-ostana-edna-prechka-za-transfera-750003","keywords":["no"],"creator":null,"video_url":null,"description":"Байерн Мюнхен постигна договорка с Интер за продажбата на фреския национал Бенжамен Павар. Защитникът ще премине в редиците на \"нерадзурите\" срещу 30 млн. евро плюс бонуси. Двата клуба преговаряха в последните няколко дни, като в крайна сметка са се разбрали за сделката. Баварците обаче ще дадат зелен...","content":"Байерн Мюнхен постигна договорка с Интер за продажбата на фреския национал Бенжамен Павар. Защитникът ще премине в редиците на \"нерадзурите\" срещу 30 млн. евро плюс бонуси. Двата клуба преговаряха в последните няколко дни, като в крайна сметка са се разбрали за сделката. Баварците обаче ще дадат зелена светлина за осъществяването на трансфера, след като си осигурят заместник на Павар. Bayern and Inter have agreed a €30m + €2-3m fee for Benjamin Pavard. But Bayern will not let the Frenchman go until they find a replacement that can play right-back and centre-back [ @AZ_Strasser ] https://t.co/OZWlOoEyUO — Bayern & Germany (@iMiaSanMia) August 21, 2023 На \"Алианц Арена\" искаха Кайл Уокър, но англичанинът избра да остане в Манчестър Сити. Според медиите в Германия другите опции са Лутшарел Геертрюда от Фейенорд и Лукас Клостерман от РБ Лайпциг. Очаква се днес или утре Байерн да уреди нов защитник, който да може да играе като десен бек и в центъра на отбраната, след което да продаде Павар на Интер.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Черно море продава голмайстора си на Бенфика","link":"https://gong.bg/bg-football/efbet-liga/cherno-more-prodava-golmajstora-si-na-benfika-750004","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Черно море е съвсем близо до страхотен изходящ трансфер. \"Моряците\" водят заключителни преговори с португалския гранд Бенфика за нападателя Матеус Машадо. Бразилецът е желан за втория отбор на \"орлите\", а във Варна усилено се говори, че сделката ще е на стойност 1 млн. евро, пише \"Мач Телеграф\". Именно готвещият се трансфер е причината Матеус Машадо да не започне като титуляр в мача с Лудогорец, спечелен от варненци с 1:0. В първите 5 кръга от първенството Матеус Машадо беше твърд титуляр и се отчете с 4 гола. Плановете на Бенфика са първоначално 20-годишният нападател да играе за втория отбор и ако се представи добре да бъде качен в първия състав. Матеус Машадо дойде във Варна в началото на годината със свободен трансфер от Корфакан.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Гросмайсторите на efbet Лига - топ 5 попадения от 6-ия кръг","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/grosmajstorite-na-efbet-liga-top-5-popadeniia-ot-6-iia-kryg-749998","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Приключи петият кръг в родния елит, в който бяха отбелязани някои от тях бяха наистина майсторски. В традиционната класация на Gong.bg - “Гросмайсторите на efbet Лига“, сме отличили най-красивите попадения. На пето място се нарежда попадението на Лучано Скуадроне от Берое при победата с 3:0 над Славия. Веднага преди него е дебютния гол на Николас Пенев. Синът на Любослав Пенев донесе успеха на Хебър при гостуването на Локомотив София с 1:0. Третата позиция е за юношата на Локомотив Пловдив Петър Андреев. Младокът се разписа с кинжален удар за победата с 1:0 над Арда на \"Лаута\". Второ място отредихме на Диего Рапосо. Бразилецът матира Ботев Пловдив за обрата на Крумовград и успеха с 2:1 на \"Колежа\". Победител в шестия кръг е Цветомир Панов. Левият защитник на Черно море вкара страхотен гол за победата с 1:0 над Лудогорец на \"Тича\". В прикаченото видео може да се насладите на още веднъж на петте попадения.","pubDate":"2023-08-22 05:43:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Oliver Roggisch im Interview : „Ich als Footballspieler? Ja, das hätte bestimmt Bock gemacht“","link":"https://rp-online.de/sport/handball/handball-bundesliga-2023-24-oliver-roggisch-von-den-rhein-neckar-loewen-erwartet-die-spannendste-saison-aller-zeiten_aid-95926357","keywords":["Sport","Handball"],"creator":["Stefan Klüttermann"],"video_url":null,"description":"Die Rhein-Neckar Löwen wollen am Mittwoch im Supercup in Düsseldorf gegen den THW Kiel den ersten Titel der neuen Handball-Saison. Der Sportliche Leiter der Löwen und Teammanager der Nationalmannschaft spricht über eine brutale Qualität in der Liga, das EM-Eröffnungsspiel im Januar und was der junge Olli Roggisch noch so hätte sportlich ausprobieren können.","content":"Herr Roggisch, mit dem Pixum Super Cup am Mittwoch in Düsseldorf beginnt die Handballsaison 2023/24. Sie wird ein . Die Ligastrapazen, dazu die Heim-EM in Januar und zum Schluss noch Olympia in Paris. Zittert man als Verantwortlicher da noch mehr als sonst, dass sich keiner verletzt? Zunächst einmal haben wir in diesem Jahr den Kader breiter aufgestellt und so mehr Alternativen. Ich hoffe, das hilft schon mal. Aber zwei große, internationale Turniere binnen sechs Monaten, plus die im Wochentakt, plus die European League, das wird hammerhart. Das weiß ich ja noch aus eigener Erfahrung. Und da kannst du im Vorfeld auch nicht alle Maßnahmen treffen, die es braucht, um die großen Belastungen bestmöglich auffangen zu können. Aber vorher schon Angst zu haben, macht keinen Sinn. Wir bereiten uns auf allen Ebenen bestmöglich vor und müssen auch kurzfristig reagieren können. Das ist ein Teil unseres Geschäfts. Und ich fürchte, dass du ohne Verletzungen eh nie durchkommst. 44 Kreisläufer TuS Schutterwald, FA Göppingen, TuSEM Essen, SC Magdeburg, RN Löwen Länderspiele 205 eltmeister 2007, 2x Sieger EHF-Pokal (2007 und 2013) Was ist am Ende der größte Wert von einem Supercup? Es geht um einen Titel. Punkt. Jedes Team würde die Saison gerne starten mit einem Titelgewinn, das ist gut für die Stimmung, das gibt Rückenwind. Wir wollen den Supercup zum vierten Mal gewinnen. Denn ein Gewinn des Supercups steht auf dem Briefkopf drauf, und so viele Titel haben wir als Rhein-Neckar Löwen nun auch noch nicht geholt, dass wir sagen, das ist ein besseres Testspiel. Jeder Titel, jeder Sieg zählt, zumal wir hier gegen den antreten. Mit den Löwen und Kiel treffen in Düsseldorf zwei der Großen in der HBL aufeinander. Nehmen wir noch Flensburg, Berlin, Magdeburg dazu. Das gibt ein schönes Hauen und Stechen an der Spitze, oder? Es wird eigentlich jedes Jahr spannender, immer enger, deswegen erwarte ich im Prinzip auch die spannendste Saison aller Zeiten. Sie haben fünf Teams genannt. Nehmen Sie noch Melsungen dazu, wo jeder darauf wartet, wann der nächste Schritt kommt. Das ist eine brutale Dichte, eine enorm große Qualität. Wir als Rhein-Neckar Löwen wollen wieder international spielen, das wollen andere aber auch. Die Budgets sind, ich will nicht sagen explodiert, aber schon schön gewachsen, entsprechend stark und breit sind die Kader aufgestellt. Das ist schon beeindruckend, was insbesondere die genannten Topklubs bieten. Ich bin gespannt. Im Fußball heißt es oft, die Qualifikation für den Europapokal sei wie ein kleiner Titelgewinn. Ist das im Handball inzwischen genauso? Das würde ich für uns schon sagen. Es ist realistisch, dass wir unter die ersten fünf der HBL-Tabelle kommen. Ganz oben sind vielleicht zwei, drei andere Teams, die ein bisschen besser aufgestellt sind. Da wollen wir wieder hinkommen. Aber wir müssen natürlich den Anspruch haben, mindestens European League zu spielen, sonst bekommst du die Spieler nicht, die du bekommen willst. Die Spieler, die den Unterscheid machen können, kommen nicht in die Bundesliga, um im Mittelfeld mitzuspielen. Wenn ich an den DHB-Pokalsieg der Löwen im April denke, fällt mir ein Wort sofort ein: Emotion. Wie lange kann man die Emotionalität eines solchen Moments als Verein konservieren? : Auch das kenne ich aus eigener Erfahrung. Jeder Titel – und der Pokalsieg ist ein großer Titel – macht noch mehr Hunger auf den nächsten Titel. Die Gier wird nur noch größer. Und das ist gut so, denn genau so ehrgeizige, hungrige Spieler wollen wir bei uns haben. Am Mittwoch haben wir in Düsseldorf die Chance auf den nächsten Titel. Ich hoffe sehr, dass weitere im Laufe der Saison dazukommen werden. Wie groß sind die Fragezeichen vor dem Start? Was nehmen die Löwen aus der Vorbereitung mit? Wenn das Testspiel gegen Wetzlar [36:25 am 16. August, Anm. d. Red.] nicht gewesen wäre, hätte ich noch ein paar Fragezeichen, aber gegen die HSG haben wir sehr, sehr vernünftig gespielt. Dass mit Olle Schefvert einer unserer Leader im Innenblock fehlt, ist aktuell unsere größte Baustelle. In der Abwehr haben wir noch Luft nach oben, nach vorne läuft es dagegen schon richtig gut. Nun können wir über Düsseldorf als Supercup-Ort nicht reden, ohne über Düsseldorf als Ort des EM-Eröffnungsspiels zu reden. In der Arena, vor einem Rekordpublikum von vielleicht 50.000 Fans. Das wird bestimmt großartig und einzigartig. Ich finde es noch schwierig, mir konkret vorzustellen, wie die Stimmung sein wird, weil man natürlich weiter weg ist in einem derart weitläufigen Stadion. Ich war jedenfalls total geflasht, wie schnell die Tickets weg waren. Die Zuschauer, die hinter dir stehen, können bei einem Heim-Turnier ein Riesenfaktor sein, der ein Team emotional treibt und trägt. Auch das habe ich beim WM-Titel 2007 als Spieler erlebt. Und ich bin mir sicher, dass das zum Auftakt in Düsseldorf ein großes Handballfest gegen die Schweiz werden wird. Von großen Fußballfesten ist die deutsche Nationalmannschaft aktuell weit entfernt. Kann der Handball aus der Schwäche des Fußballs an dieser Stelle Profit schlagen? Wir sollten vor allem für uns nutzen, dass wir den geilsten Sport der Welt haben. Unabhängig davon, was andere tun. Wir sind ein sehr nahbarer Sport, wir haben echte Typen, leben bei aller Härte Fair-Play in der Halle. Wir müssen nicht darüber reden, was andere schlecht machen, wir können selbstbewusst sagen, was wir gut machen. Echte Typen braucht es zwingend. Gerade im Kampf um die jungen Zuschauer, die keine Lust mehr haben, 60 oder 90 Minuten lang ihre ganze Aufmerksamkeit einem Sportereignis zu widmen. : Ganz genau. Und da haben wir einen Riesenvorteil. Wir haben die Typen, die es braucht, und der neue TV-Vertrag mit Dyn wird uns sehr weiterhelfen, weil wir als Liga und Vereine mehr Zugriff auf Spielszenen und Highlights haben und damit weit stärker als bisher unsere eigenen digitalen Plattformen bespielen können, um so weitaus mehr Formate, Reichweite und Aufmerksamkeit erzeugen zu können. Wir müssen deswegen jetzt auch schnell lernen, wie wir die neuen Möglichkeiten, die uns der neue Medienvertrag bietet, bestmöglich für uns nutzen. Wie man eine Sportart komplett vermarktet, kann man sicherlich in erster Linie vom Football lernen. Dessen Beliebtheit wächst in Deutschland seit Jahren rapide. Verfolgen Sie ihn auch? : Football ist ein toller Sport, den ich auch verfolge, wenn auch nicht superaktiv. Aber ich merke ja auch in der Mannschaft, dass Football auch hier ein Thema ist. Wir als Handball müssen immer gucken, was um uns herum passiert. Aber wir müssen vor allem etwas aus unserem Produkt machen. Und dabei sind wir erfolgreich, ohne die Bodenhaftung zu verlieren. Wir bieten erstklassigen Sport und einen erstklassigen Rahmen für diesen Sport. Das müssen andere erst einmal nachmachen. Wir müssen uns nicht verstecken. Der junge hätte statt im Mittelblock beim Handball aber auch in einer Offensive Line beim Football landen können, oder? In beiden Positionen kann man schließlich Gegenspieler herumschubsen. (lacht): Ich glaube ja, das hätte bestimmt Bock gemacht. Aber, wenn ich sehe, wie kurz manche Karriere in der NFL nur dauert, dann bin ich doch froh, beim Handball gelandet zu sein. Denn ich glaube Football ist nochmal eine ganz andere Sache, was die körperliche Belastung angeht. Das ist am Ende auch wahrscheinlich einfach nicht gesund.","pubDate":"2023-08-22 05:30:00","image_url":"https://rp-online.de/imgs/32/1/7/5/5/6/1/7/2/9/tok_f3290a709d0cb863683ebf143f86dee4/w940_h528_x470_y264_4af592e3f501c6a6.jpg","source_id":"rp_online","source_priority":605562,"country":["germany"],"category":["sports"],"language":"german"},{"title":"Айнтрахт прати младежки национал на Германия в Кьолн","link":"https://gong.bg/football-sviat/germania/multimedia/video/ajntraht-prati-mladezhki-nacional-na-germaniia-v-kioln-749997","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Съперникът на Левски в плейофа за влизане в групите на Лига на конференциите Айнтрахт Франкфурт даде под наем на Кьолн младежкия национал на Германия Фариде Алиду. Трансферът беше финализиран вчера. През изминалия сезон Алиду записа 15 мача за състава от Франкфурт в Бундеслигата и пет в Шампионската лига. Той има договор до 2026 година. На \"Дойче Банк Парк\" обаче прецениха, че фланговият нападател трудно ще се пребори за игрово време през този сезон и го пратиха при \"козлите\". Алиду има договор с Айнтрахт до лятото на 2026 година.","pubDate":"2023-08-22 05:25:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Изявите на Асен Митков за Левски","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/iziavite-na-asen-mitkov-za-levski-749996","keywords":["no"],"creator":null,"video_url":null,"description":"Изявите на Асен Митков за Левски...","content":"Изявите на Асен Митков за Левски","pubDate":"2023-08-22 05:18:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Qui pour composer l'ossature des Espoirs avec le nouveau sélectionneur Thierry Henry ?","link":"https://www.lequipe.fr/Football/Actualites/Qui-pour-composer-l-ossature-des-espoirs-avec-le-nouveau-selectionneur-thierry-henry/1415012#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Hugo Guillemet"],"video_url":null,"description":"Thierry Henry, nommé sélectionneur de l'équipe de France Espoirs lundi, pourra s'appuyer sur des joueurs nés jusqu'en 2002 pour la campagne de qualification à l'Euro 2025. Mais des éléments des générations suivantes devraient venir étoffer son groupe.","content":"Thierry Henry sera très attendu jeudi 31 août, en tant que sélectionneur de l'équipe de France Espoirs, pour entamer les qualifications à l'Euro 2025 (déplacement en Slovénie le 11 septembre, après un match amical contre le Danemark le 7 à Nancy). Il devra pour cela piocher parmi les joueurs nés après le 1er janvier 2002. Il n'aura pas droit à la tête de gondole de la génération, Eduardo Camavinga, inamovible chez les A de Didier Deschamps, mais il devrait s'appuyer sur quelques cadres du dernier Euro Espoirs, comme Castello Lukeba (Leipzig), Bradley Barcola (Lyon) ou Arnaud Kalimuendo (Rennes). Des joueurs bien plus jeunes pourraient évidemment constituer son noyau, comme ceux de l'exceptionnelle génération 2005. Le gardien Guillaume Restes (Toulouse), le défenseur Leny Yoro (Lille), les latéraux Saël Kumbedi (Lyon) et Jeanuël Belocian (Rennes), le milieu Désiré Doué (Rennes) ou les attaquants Mathys Tel (Bayern Munich) et Eliesse Ben Seghir (Monaco) jouent déjà régulièrement dans leur club. Les 2003 devraient aussi se tailler une bonne part du gâteau, avec le latéral droit Malo Gusto (Chelsea), le meneur de jeu Rayan Cherki (Lyon) et l'attaquant Elye Wahi (Lens). L'option Zaïre-Emery, déjà Le latéral gauche Quentin Merlin (2002, Nantes) sera là, aussi, comme peut-être Johann Lepenant (Lyon), tandis que des 2004 comme Lesley Ugochukwu (Chelsea) ou Wilson Odobert (Burnley), voire Khalil Fayad (Montpellier) ou Mohamed El Arouch (Lyon) postuleront naturellement. Enfin, difficile d'imaginer que le prodige Warren Zaïre-Emery, un 2006 titulaire au PSG, n'ait pas tapé dans l'oeil d'Henry. Pour les Jeux Olympiques de Paris, la problématique sera différente car le sélectionneur pourra appeler des joueurs nés en 2001 (le gardien de Lille Lucas Chevalier, par exemple) pour constituer sa liste de 18, ainsi que trois éléments hors limite d'âge. Mais ce sera une autre équipe, qui n'existera qu'à partir de juin 2024, pour deux matches amicaux préparatoires au tournoi olympique (25 juillet - 10 août), l'objectif majeur du mandat.","pubDate":"2023-08-22 06:00:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/castello-lukeba-et-bradley-barcola-deux-membres-de-la-generation-2002-b-paquot-l-equipe/1500000001823864/327:326,1770:1288-665-335-70/ea3c8.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Стартират решителните плейофи за влизане в групите на Шампионска лига","link":"https://gong.bg/football-sviat/shampionska-liga/startirat-reshitelnite-plejofi-za-vlizane-v-grupite-na-shampionska-liga-750005","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Днес се дава старт на решителния пелйофен кръг за влизане в груповата фаза на Шампионска лига. Програмата започва с три двубоя, които ще се играят тази вечер и са с начален час 22:00. Всичко най-интересно от предстоящите сблъсъци може да намерите в Gong.bg. В първия двубой полския Раков Ченстохова се изправя срещу Копенхаген, а в безспорно най-интересната двойка тази вечер, шотландският Глазгоу Рейнджърс приема нидерландския гранд ПСВ Айндховен. Програмата ще бъде закрита с мача между Антверпен и АЕК Атина. В утрешния ден предстоят нови три сблъсъка: Макаби Хайва – Йънг Бойс Молде – Галатасарай Брага - Панатинаикос","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Лудост! Опашка за билети на \"Герена\" от ранни зори (снимка)","link":"https://gong.bg/bg-football/evrouchastnici/multimedia/video/ludost-opashka-za-bileti-na-gerena-ot-ranni-zori-snimka-749999","keywords":["no"],"creator":null,"video_url":null,"description":"Левски пуска в свободна продажба билетите за мача с Айнтрахт Франкфурт днес от 12:00 часа. До момента пропуски можеше да си закупуват хората, които имат абонаментни карти за този сезон. Очаква се стадион \"Васил Левски\" да бъде пълен в четвъртък, когато ще се проведе срещата. В социалните мрежи се появи с...","content":"Левски пуска в свободна продажба билетите за мача с Айнтрахт Франкфурт днес от 12:00 часа. До момента пропуски можеше да си закупуват хората, които имат абонаментни карти за този сезон. Очаква се стадион \"Васил Левски\" да бъде пълен в четвъртък, когато ще се проведе срещата. В социалните мрежи се появи снимка, на която се вижда, че опашка за пропуски се извива пред Сектор А на \"Герена\" още в 6:45 часа тази сутрин. източник: Facebook Билети ще се продават както там, така и на касите на Националния стадион на бул. „Гурко“.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Шампионът на Азербайджан представи защитник на Локомотив Пловдив","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/shampionyt-na-azerbajdzhan-predstavi-zashtitnik-na-lokomotiv-plovdiv-750001","keywords":["no"],"creator":null,"video_url":null,"description":"Най-успешният футболен клуб от Азербайджан в последните години – Карабах (Агдам) представи си новото попълнение от българския Локомотив (Пловдив) - десният бранител Матеус да Силва. \"Дълго проточилите се преговори приключиха успешно и вече имаме подписан договор за 2+2 години с 25-годишния защитник. ...","content":"Най-успешният футболен клуб от Азербайджан в последните години – Карабах (Агдам) представи си новото попълнение от българския Локомотив (Пловдив) - десният бранител Матеус да Силва. \"Дълго проточилите се преговори приключиха успешно и вече имаме подписан договор за 2+2 години с 25-годишния защитник. Бразилският футболист ще носи фланелката с номер 2 в нашия отбор\", се казва в официалното съобщение на Карабах. 25-годишният десен бек ще бъде картотекиран за груповата фаза на клубния турнир, в който шампионите на Азербайджан ще участват. В четвъртък те играят първи плейофен мач за попадане в Лига Европа срещу Олимпия (Любляна), а съдийска бригада начело с Георги Кабаков ще свири мача на стадион \"Стожице\". При поражение азерите ще слязат в групите на турнира Лига на Конференциите. Бразилецът дойде на Лаута преди малко повече от една година – в началото на юли 2022-а година и веднага направи впечатление с качествата си-. В миналогодишната кампания записа 32 мача във всички турнири и вкара един гол, а през тази година в първите 6 мача беше титуляр и вкара 1 гол. Въпреки че играе като десен бранител, Матеус да Силва без проблем може да бъде използван и в средата на терена - като външен халф или централен полузащитник. Според страницата за футболни сделки transfermarkt.com Локомотив (Пловдив) ще получи 350 хиляди евро за правата на бразилеца, който през зимата отказа да премине в ЦСКА 1948. Карабах е 10 пъти шампион на Азербайджан, в това число в три от последните четири сезона./ БТА","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Байерн и Интер се разбраха за Павар, остана една пречка за трансфера","link":"https://gong.bg/football-sviat/germania/multimedia/video/bajern-i-inter-se-razbraha-za-pavar-ostana-edna-prechka-za-transfera-750003","keywords":["no"],"creator":null,"video_url":null,"description":"Байерн Мюнхен постигна договорка с Интер за продажбата на фреския национал Бенжамен Павар. Защитникът ще премине в редиците на \"нерадзурите\" срещу 30 млн. евро плюс бонуси. Двата клуба преговаряха в последните няколко дни, като в крайна сметка са се разбрали за сделката. Баварците обаче ще дадат зелен...","content":"Байерн Мюнхен постигна договорка с Интер за продажбата на фреския национал Бенжамен Павар. Защитникът ще премине в редиците на \"нерадзурите\" срещу 30 млн. евро плюс бонуси. Двата клуба преговаряха в последните няколко дни, като в крайна сметка са се разбрали за сделката. Баварците обаче ще дадат зелена светлина за осъществяването на трансфера, след като си осигурят заместник на Павар. Bayern and Inter have agreed a €30m + €2-3m fee for Benjamin Pavard. But Bayern will not let the Frenchman go until they find a replacement that can play right-back and centre-back [ @AZ_Strasser ] https://t.co/OZWlOoEyUO — Bayern & Germany (@iMiaSanMia) August 21, 2023 На \"Алианц Арена\" искаха Кайл Уокър, но англичанинът избра да остане в Манчестър Сити. Според медиите в Германия другите опции са Лутшарел Геертрюда от Фейенорд и Лукас Клостерман от РБ Лайпциг. Очаква се днес или утре Байерн да уреди нов защитник, който да може да играе като десен бек и в центъра на отбраната, след което да продаде Павар на Интер.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Черно море продава голмайстора си на Бенфика","link":"https://gong.bg/bg-football/efbet-liga/cherno-more-prodava-golmajstora-si-na-benfika-750004","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Черно море е съвсем близо до страхотен изходящ трансфер. \"Моряците\" водят заключителни преговори с португалския гранд Бенфика за нападателя Матеус Машадо. Бразилецът е желан за втория отбор на \"орлите\", а във Варна усилено се говори, че сделката ще е на стойност 1 млн. евро, пише \"Мач Телеграф\". Именно готвещият се трансфер е причината Матеус Машадо да не започне като титуляр в мача с Лудогорец, спечелен от варненци с 1:0. В първите 5 кръга от първенството Матеус Машадо беше твърд титуляр и се отчете с 4 гола. Плановете на Бенфика са първоначално 20-годишният нападател да играе за втория отбор и ако се представи добре да бъде качен в първия състав. Матеус Машадо дойде във Варна в началото на годината със свободен трансфер от Корфакан.","pubDate":"2023-08-22 05:48:59","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Гросмайсторите на efbet Лига - топ 5 попадения от 6-ия кръг","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/grosmajstorite-na-efbet-liga-top-5-popadeniia-ot-6-iia-kryg-749998","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Приключи петият кръг в родния елит, в който бяха отбелязани някои от тях бяха наистина майсторски. В традиционната класация на Gong.bg - “Гросмайсторите на efbet Лига“, сме отличили най-красивите попадения. На пето място се нарежда попадението на Лучано Скуадроне от Берое при победата с 3:0 над Славия. Веднага преди него е дебютния гол на Николас Пенев. Синът на Любослав Пенев донесе успеха на Хебър при гостуването на Локомотив София с 1:0. Третата позиция е за юношата на Локомотив Пловдив Петър Андреев. Младокът се разписа с кинжален удар за победата с 1:0 над Арда на \"Лаута\". Второ място отредихме на Диего Рапосо. Бразилецът матира Ботев Пловдив за обрата на Крумовград и успеха с 2:1 на \"Колежа\". Победител в шестия кръг е Цветомир Панов. Левият защитник на Черно море вкара страхотен гол за победата с 1:0 над Лудогорец на \"Тича\". В прикаченото видео може да се насладите на още веднъж на петте попадения.","pubDate":"2023-08-22 05:43:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Oliver Roggisch im Interview : „Ich als Footballspieler? Ja, das hätte bestimmt Bock gemacht“","link":"https://rp-online.de/sport/handball/handball-bundesliga-2023-24-oliver-roggisch-von-den-rhein-neckar-loewen-erwartet-die-spannendste-saison-aller-zeiten_aid-95926357","keywords":["Sport","Handball"],"creator":["Stefan Klüttermann"],"video_url":null,"description":"Die Rhein-Neckar Löwen wollen am Mittwoch im Supercup in Düsseldorf gegen den THW Kiel den ersten Titel der neuen Handball-Saison. Der Sportliche Leiter der Löwen und Teammanager der Nationalmannschaft spricht über eine brutale Qualität in der Liga, das EM-Eröffnungsspiel im Januar und was der junge Olli Roggisch noch so hätte sportlich ausprobieren können.","content":"Herr Roggisch, mit dem Pixum Super Cup am Mittwoch in Düsseldorf beginnt die Handballsaison 2023/24. Sie wird ein . Die Ligastrapazen, dazu die Heim-EM in Januar und zum Schluss noch Olympia in Paris. Zittert man als Verantwortlicher da noch mehr als sonst, dass sich keiner verletzt? Zunächst einmal haben wir in diesem Jahr den Kader breiter aufgestellt und so mehr Alternativen. Ich hoffe, das hilft schon mal. Aber zwei große, internationale Turniere binnen sechs Monaten, plus die im Wochentakt, plus die European League, das wird hammerhart. Das weiß ich ja noch aus eigener Erfahrung. Und da kannst du im Vorfeld auch nicht alle Maßnahmen treffen, die es braucht, um die großen Belastungen bestmöglich auffangen zu können. Aber vorher schon Angst zu haben, macht keinen Sinn. Wir bereiten uns auf allen Ebenen bestmöglich vor und müssen auch kurzfristig reagieren können. Das ist ein Teil unseres Geschäfts. Und ich fürchte, dass du ohne Verletzungen eh nie durchkommst. 44 Kreisläufer TuS Schutterwald, FA Göppingen, TuSEM Essen, SC Magdeburg, RN Löwen Länderspiele 205 eltmeister 2007, 2x Sieger EHF-Pokal (2007 und 2013) Was ist am Ende der größte Wert von einem Supercup? Es geht um einen Titel. Punkt. Jedes Team würde die Saison gerne starten mit einem Titelgewinn, das ist gut für die Stimmung, das gibt Rückenwind. Wir wollen den Supercup zum vierten Mal gewinnen. Denn ein Gewinn des Supercups steht auf dem Briefkopf drauf, und so viele Titel haben wir als Rhein-Neckar Löwen nun auch noch nicht geholt, dass wir sagen, das ist ein besseres Testspiel. Jeder Titel, jeder Sieg zählt, zumal wir hier gegen den antreten. Mit den Löwen und Kiel treffen in Düsseldorf zwei der Großen in der HBL aufeinander. Nehmen wir noch Flensburg, Berlin, Magdeburg dazu. Das gibt ein schönes Hauen und Stechen an der Spitze, oder? Es wird eigentlich jedes Jahr spannender, immer enger, deswegen erwarte ich im Prinzip auch die spannendste Saison aller Zeiten. Sie haben fünf Teams genannt. Nehmen Sie noch Melsungen dazu, wo jeder darauf wartet, wann der nächste Schritt kommt. Das ist eine brutale Dichte, eine enorm große Qualität. Wir als Rhein-Neckar Löwen wollen wieder international spielen, das wollen andere aber auch. Die Budgets sind, ich will nicht sagen explodiert, aber schon schön gewachsen, entsprechend stark und breit sind die Kader aufgestellt. Das ist schon beeindruckend, was insbesondere die genannten Topklubs bieten. Ich bin gespannt. Im Fußball heißt es oft, die Qualifikation für den Europapokal sei wie ein kleiner Titelgewinn. Ist das im Handball inzwischen genauso? Das würde ich für uns schon sagen. Es ist realistisch, dass wir unter die ersten fünf der HBL-Tabelle kommen. Ganz oben sind vielleicht zwei, drei andere Teams, die ein bisschen besser aufgestellt sind. Da wollen wir wieder hinkommen. Aber wir müssen natürlich den Anspruch haben, mindestens European League zu spielen, sonst bekommst du die Spieler nicht, die du bekommen willst. Die Spieler, die den Unterscheid machen können, kommen nicht in die Bundesliga, um im Mittelfeld mitzuspielen. Wenn ich an den DHB-Pokalsieg der Löwen im April denke, fällt mir ein Wort sofort ein: Emotion. Wie lange kann man die Emotionalität eines solchen Moments als Verein konservieren? : Auch das kenne ich aus eigener Erfahrung. Jeder Titel – und der Pokalsieg ist ein großer Titel – macht noch mehr Hunger auf den nächsten Titel. Die Gier wird nur noch größer. Und das ist gut so, denn genau so ehrgeizige, hungrige Spieler wollen wir bei uns haben. Am Mittwoch haben wir in Düsseldorf die Chance auf den nächsten Titel. Ich hoffe sehr, dass weitere im Laufe der Saison dazukommen werden. Wie groß sind die Fragezeichen vor dem Start? Was nehmen die Löwen aus der Vorbereitung mit? Wenn das Testspiel gegen Wetzlar [36:25 am 16. August, Anm. d. Red.] nicht gewesen wäre, hätte ich noch ein paar Fragezeichen, aber gegen die HSG haben wir sehr, sehr vernünftig gespielt. Dass mit Olle Schefvert einer unserer Leader im Innenblock fehlt, ist aktuell unsere größte Baustelle. In der Abwehr haben wir noch Luft nach oben, nach vorne läuft es dagegen schon richtig gut. Nun können wir über Düsseldorf als Supercup-Ort nicht reden, ohne über Düsseldorf als Ort des EM-Eröffnungsspiels zu reden. In der Arena, vor einem Rekordpublikum von vielleicht 50.000 Fans. Das wird bestimmt großartig und einzigartig. Ich finde es noch schwierig, mir konkret vorzustellen, wie die Stimmung sein wird, weil man natürlich weiter weg ist in einem derart weitläufigen Stadion. Ich war jedenfalls total geflasht, wie schnell die Tickets weg waren. Die Zuschauer, die hinter dir stehen, können bei einem Heim-Turnier ein Riesenfaktor sein, der ein Team emotional treibt und trägt. Auch das habe ich beim WM-Titel 2007 als Spieler erlebt. Und ich bin mir sicher, dass das zum Auftakt in Düsseldorf ein großes Handballfest gegen die Schweiz werden wird. Von großen Fußballfesten ist die deutsche Nationalmannschaft aktuell weit entfernt. Kann der Handball aus der Schwäche des Fußballs an dieser Stelle Profit schlagen? Wir sollten vor allem für uns nutzen, dass wir den geilsten Sport der Welt haben. Unabhängig davon, was andere tun. Wir sind ein sehr nahbarer Sport, wir haben echte Typen, leben bei aller Härte Fair-Play in der Halle. Wir müssen nicht darüber reden, was andere schlecht machen, wir können selbstbewusst sagen, was wir gut machen. Echte Typen braucht es zwingend. Gerade im Kampf um die jungen Zuschauer, die keine Lust mehr haben, 60 oder 90 Minuten lang ihre ganze Aufmerksamkeit einem Sportereignis zu widmen. : Ganz genau. Und da haben wir einen Riesenvorteil. Wir haben die Typen, die es braucht, und der neue TV-Vertrag mit Dyn wird uns sehr weiterhelfen, weil wir als Liga und Vereine mehr Zugriff auf Spielszenen und Highlights haben und damit weit stärker als bisher unsere eigenen digitalen Plattformen bespielen können, um so weitaus mehr Formate, Reichweite und Aufmerksamkeit erzeugen zu können. Wir müssen deswegen jetzt auch schnell lernen, wie wir die neuen Möglichkeiten, die uns der neue Medienvertrag bietet, bestmöglich für uns nutzen. Wie man eine Sportart komplett vermarktet, kann man sicherlich in erster Linie vom Football lernen. Dessen Beliebtheit wächst in Deutschland seit Jahren rapide. Verfolgen Sie ihn auch? : Football ist ein toller Sport, den ich auch verfolge, wenn auch nicht superaktiv. Aber ich merke ja auch in der Mannschaft, dass Football auch hier ein Thema ist. Wir als Handball müssen immer gucken, was um uns herum passiert. Aber wir müssen vor allem etwas aus unserem Produkt machen. Und dabei sind wir erfolgreich, ohne die Bodenhaftung zu verlieren. Wir bieten erstklassigen Sport und einen erstklassigen Rahmen für diesen Sport. Das müssen andere erst einmal nachmachen. Wir müssen uns nicht verstecken. Der junge hätte statt im Mittelblock beim Handball aber auch in einer Offensive Line beim Football landen können, oder? In beiden Positionen kann man schließlich Gegenspieler herumschubsen. (lacht): Ich glaube ja, das hätte bestimmt Bock gemacht. Aber, wenn ich sehe, wie kurz manche Karriere in der NFL nur dauert, dann bin ich doch froh, beim Handball gelandet zu sein. Denn ich glaube Football ist nochmal eine ganz andere Sache, was die körperliche Belastung angeht. Das ist am Ende auch wahrscheinlich einfach nicht gesund.","pubDate":"2023-08-22 05:30:00","image_url":"https://rp-online.de/imgs/32/1/7/5/5/6/1/7/2/9/tok_f3290a709d0cb863683ebf143f86dee4/w940_h528_x470_y264_4af592e3f501c6a6.jpg","source_id":"rp_online","source_priority":605562,"country":["germany"],"category":["sports"],"language":"german"},{"title":"Айнтрахт прати младежки национал на Германия в Кьолн","link":"https://gong.bg/football-sviat/germania/multimedia/video/ajntraht-prati-mladezhki-nacional-na-germaniia-v-kioln-749997","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Съперникът на Левски в плейофа за влизане в групите на Лига на конференциите Айнтрахт Франкфурт даде под наем на Кьолн младежкия национал на Германия Фариде Алиду. Трансферът беше финализиран вчера. През изминалия сезон Алиду записа 15 мача за състава от Франкфурт в Бундеслигата и пет в Шампионската лига. Той има договор до 2026 година. На \"Дойче Банк Парк\" обаче прецениха, че фланговият нападател трудно ще се пребори за игрово време през този сезон и го пратиха при \"козлите\". Алиду има договор с Айнтрахт до лятото на 2026 година.","pubDate":"2023-08-22 05:25:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"title":"Изявите на Асен Митков за Левски","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/iziavite-na-asen-mitkov-za-levski-749996","keywords":["no"],"creator":null,"video_url":null,"description":"Изявите на Асен Митков за Левски...","content":"Изявите на Асен Митков за Левски","pubDate":"2023-08-22 05:18:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"}]}