{"newsArray":[{"article_id":"bad5fdad8d700829f088541a6ab5d363","title":"Three things Jurgen Klopp got right as Liverpool ease to victory over Nottingham Forest","link":"https://www.dailystar.co.uk/sport/football/jurgen-klopp-liverpool-prem-victory-31309357","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool eased to a comfortable win over Nottingham Forest which makes it back-to-back Premier League wins for Jurgen Klopp and his side","content":"secured a 3-0 victory against Nottingham Forest in the in a game they dominated for large parts of it. Diogo Jota opened the scoring for the home side after tapping in from close range as Matt Turner could only parry Darwin Nunez's efforts. The Uruguayan finally made his way on the scoresheet four minutes later after latching onto Dominick Szoboszlai's pass. Mohamed Salah made it three after Matt Turner was caught in no man's land leaving the Egyptian to score into an empty net. The victory - which is Liverpool's second in a row since earlier this month - lifted them above into third in the Premier League but a win for Pep Guardiola's side in the Manchester derby on Sunday afternoon (October 29) will lift the reigning champions above Liverpool. had to do without Luis Diaz after the which meant he was left out of the squad with Jota taking his place in the starting line-up as the Portuguese star by lifting his number seven shirt after scoring the opener. The absence of Diaz as well as several continuing injuries and a didn't hamper Liverpool as takes a look at the things Klopp got right during the game. The Uruguyuan endured a difficult first season at the club having been found guilty of missing a plethora of guilt-edge chances. His overall play was lacking at many times last year as fans began wondering whether Nunez was the future of the team's strikeforce. Despite beginning the season as second-fiddle to Cody Gakpo, the 24-year-old fought his way back into the starting line-up and has netted six goals in all competitions this season including the second in their 3-0 win against Nottingham Forest on Sunday (October 29). His protection of the ball, improving build-up play and goal-scoring instincts were all on show in Liverpool's victory as he continues going from strength to strength under Jurgen Klopp. Klopp's current squad may just be the best he's had at Liverpool since arriving at the club in 2015 and has allowed him to rotate his squad without having to make a compromise on quality. Keeping top players happy when they may not start every game is an underrated quality in a manager and an attribute Klopp has in abundance. The likes of Diogo Jota, Cody Gakpo and Harvey Elliott may not be the first names on the team-sheet but they remain an important part of Liverpool and Jota's goals as well as the positive cameos of Elliott and Gakpo just goes to show how the Liverpool boss has perfected the morale of his team. The Liverpool boss had been criticised by some by not starting Ibrahima Konate in Liverpool's 5-1 victory over Toulouse in the Europa League on Thursday (October 26). The French international has only played just 378 minutes of Premier League action this season after playing just 18 games in the 2022/23 campaign. Klopp shared his frustrations about Konate's injury issues in an interview with where he said: \"I love absolutely everything about Ibou, but the problem is Ibou had injury problems from time to time and Mr Deschamps played him 90 and 87 minutes in the two games (for France).\" He's been careful with overplaying the defender but started him in Liverpool's 3-0 win on Sunday where he put in a faultless performance and earned a clean sheet.","pubDate":"2023-10-29 16:05:09","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309541.ece/ALTERNATES/s98/1_Liverpool-FC-v-Nottingham-Forest-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5658017f25634cc17eb731a6e9e07a94","title":"Claudio Ranieri performs 'greatest miracle of career' as Serie A side make history","link":"https://www.dailystar.co.uk/sport/football/claudio-ranieri-cagliari-serie-a-31309295","keywords":["Sport"],"creator":null,"video_url":null,"description":"He might be 72, but Claudio Ranieri is still capable of creating moments of magic like the one he did with Leicester City - inspiring his Cagliari side to a stunning 4-3 victory","content":"Claudio Ranieri's Cagliari made history as they came back from 3-0 down to win in the sixth minute of stoppage time. Former boss Ranieri has endured a struggling start to the season in Sardinia with his newly-promoted side, heading into Sunday's (October 29) home clash with Frosinone winless in their first nine games. It looked like things were going to go from bad to worse for the Tinkerman when the visitors headed into the break two to the good, with Cagliari midfielder Marco Mancosu also missing a penalty to add to their woes. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Frosinone's Marco Brescianini made it three less than four minutes after the restart and it looked to be game over. But some inspired changes by Ranieri turned the tide in remarkable fashion. Leonardo Pavoletti set up fellow substitute Gaetano Oristanio to draw one back with a little under 20 minutes to go, then Antoine Makoumbou reduced the deficit to just one shortly after. Striker Pavoletti then became the hero, first levelling in the 90+4th minute before he found a dramatic last-gasp winner. A VAR check left hearts in mouths, but the goal stood and Ranieri was soon celebrating victory with his players. It's the first time in Serie A history that a team has fought back from 3-0 to win after the 70th minute, with one fan suggesting: \"The greatest miracle of Claudio Ranieri’s career?!\" Another hit back: \"No bigger miracle than Leicester league champions.\" While one added: \"Second greatest.\" Others were chuffed to see Ranieri get back to winning ways. \"It feels so good to watch him succeed wherever he goes. Good things happens to good people,\" hailed one, and another commented: \"He's the miracle man!\"","pubDate":"2023-10-29 16:00:23","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309472.ece/ALTERNATES/s98/0_Cagliari-Calcio-v-Frosinone-Calcio-Serie-A-TIM.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"71ae6f311922e7f2acbf303c6ccd0b2f","title":"Palhinha stunner earns Fulham draw at Brighton","link":"https://www.skysports.com/football/brighton-and-hove-albion-vs-fulham/report/482684","keywords":null,"creator":null,"video_url":null,"description":"Joao Palhinha hit a stunning second-half equaliser to earn a point for Fulham in a 1-1 draw at Brighton.","content":"Joao Palhinha hit a stunning second-half equaliser to earn a point for Fulham in a 1-1 draw at Brighton. Fulham then survived a late onslaught to maintain their unbeaten record against the Seagulls from all seven of their Premier League meetings. Roberto De Zerbi made six changes from Brighton's Thursday night victory over Ajax and his refreshed side dominated possession in the first-half as Evan Ferguson expertly slotted home in the 26th minute. However Fulham began to wear the hosts down and became bolder with their approach in the second period before Palhinha crashed a wonderful effort from the edge of the box high into the net. Brighton: Steele (7), Julio (7), Webster (7), Dunk (7), Dahoud (7), Gross (7), Lallana (6), Baleba (6), Mitoma (7), Adingra (6), Ferguson (7). Subs: Fati (6), Gilmour (6), Buonanotte (6), Veltman (6), Pedro (n/a). Fulham: Leno (7), Bassey (7), Reed (6), Jimenez (6), Ream (7), Decordova-Reid (6), Willian (6), Castagne (7), Iwobi (7), Palhinha (8), Robinson (6). Subs: Pereira (6), Muniz (6), Wilson (6), Cairney (n/a), Lukic (n/a) Player of the Match: Joao Palhinha Brighton dominated possession from the outset and had Bernd Leno to thank for flying to his left to push away Carlos Baleba's shot from the edge of the box and then deny Simon Adingra from close range. Baleba, Adingra and Kaoru Mitoma all shot off target within four minutes of each other as the Brighton onslaught continued. Fulham kept giving possession back to the hosts and Joao Palhinha showed his frustration, catching Pascal Gross in the face with a stray arm that went unpunished. Brighton, though, finally went ahead when Igor Julio intercepted Harrison Reed's forward pass and the centre-back found gross, who moved it on to Ferguson and he coolly guided a low shot into the bottom left corner. Live Premier League table Premier League results Watch Premier League highlights Get Sky Sports Fulham did improve in the final stages of the first-half although it took Lewis Dunk hitting the crossbar from a free-kick shortly after the break and then the introductions of Andreas Pereira, Rodrigo Muniz and Harry Wilson to really spark them into life. Brighton were being overrun in midfield as Fulham pushed higher up the pitch to stop them playing out from the back and it was Alex Iwobi who won the ball deep in the home side's half before finding Wilson, who teed up Palhinha to slam a perfect strike into the top right corner. Muniz then saw his clever close-range flick saved by Jason Steele with Brighton wobbling. However, the hosts recovered for the final 10 minutes, seeing substitute Ansu Fati denied by Leno and had a certain goal prevented by Antonee Robinson from Adam Webster's header. Play Fantasy Premier League and see more stats here Brighton are back in action next Saturday with a trip to Everton , kick-off 3pm. They then travel to Ajax on Thursday November 9 in the Europa League, kick-off 5.45pm. Meanwhile, Fulham face a trip to Ipswich in the Carabao Cup fourth round on Wednesday, kick-off 7.45pm. They then host Man Utd on Saturday November 4, kick-off 12.30pm. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-29 16:00:00","image_url":"https://e0.365dm.com/23/10/1920x1080/skysports-premier-league-fulham_6340557.jpg?20231029154150","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3a72fc9ed84c6822cc08955b77f59bf3","title":"Francis Ngannou attempted 'superman punch' on Tyson Fury on advice of Mike Tyson","link":"https://www.dailystar.co.uk/sport/boxing/fury-ngannou-superman-mike-tyson-31309074","keywords":["Sport"],"creator":null,"video_url":null,"description":"Boxing legend Mike Tyson told UFC star Francis Ngannou to use a 'superman punch' on Saturday night when he faced off against heavyweight champion Tyson Fury in Saudi Arabia","content":"revealed ringside that he told UFC star Francis Ngannou to do a 'superman punch' against . Ngannou, fighting in what was his professional debut, went up against heavyweight world champion Fury in Saudi Arabia on Saturday night . Fury had described the contest beforehand as if Ngannou were a table tennis player taking on Novak Djokovic. However, come round 10, when Ngannou launched into his superman punch, there was no doubt that Fury could not have been more wrong. In the third round of the fight that went the distance, the 37-year-old UFC brawler landed a monstrous blow on Fury . The huge blow stunned Fury, who struggled to regain his composure immediately after, with Ngannou looking increasingly confident - clearly enough to attempt to land the 'superman punch' right at the end of the bout. Sadly for Ngannou, he didn't make a solid connection with him punch. But that didn't stop boxing legend Mike Tyson from revealing ringside during the 10th round that he had told Ngannou to pull it out in Saudi Arabia. \"Oh, Superman punch, superman punch, that's how they do it in the UFC,\" Tyson can be heard saying on an Instagram story uploaded to his account. \"You teach him that?\" asked the individual filming Tyson, to which the legendary boxer replied: \"Not that one, nah. I told him to use it though!\" Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Even the Blonde Bomber, Ebanie Bridges, was ecstatic to see Ngannou pull out the superman punch. Taking to social media the day after the fight in Saudi Arabia, Bridges wrote: \"I wish that superman punch from @francis_ngannou landed properly lastnight… imagine that. it woulda been epic… KO by superman punch.\" However, moments after the tenth round, it was revealed Fury had somehow won the fight via split decision, something which caused uproar on social media. Having talked about how Ngannou would have no chance in the ring against him, Fury was left embarrassed. And his fight against Ngannou . While the fight has been agreed to, promoter Frank Warren announced after the battle in Saudi Arabia that Fury would need time to heal, making it more like he and Usyk face off around the beginning of 2024.","pubDate":"2023-10-29 15:43:10","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309323.ece/ALTERNATES/s98/2_F9m5Bz3WoAM4znR-1jpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"90b6018d30b81387eedfaf15be908253","title":"Gerwyn Price 'bottles' 7-0 lead as Danny Noppert launches incredible comeback to win","link":"https://www.dailystar.co.uk/sport/darts/darts-gerwyn-price-danny-noppert-31309393","keywords":["Sport"],"creator":null,"video_url":null,"description":"Darts fans have been left shocked as Gerwyn Price \"bottled\" a 7-0 lead in the European Championships as he lost to Danny Noppert in an amazing comeback performance","content":"fans have been left shocked as Danny Noppert launched an incredible comeback win against . Noppert had found himself 7-0 down in a race to ten at the European Championships, and seemingly crashing out to the Welsh superstar. However, Price would only go onto claim one more leg as Noppert landed seven 180s on his way to winning 10-8. The Dutchman has won legions of fans in Dortmund, and he joked earlier in the week: \"I'm not the really boring player that everyone thinks. But sometimes I just need to keep calm. If I'm celebrating too hard, adrenaline goes too high and then sometimes I can struggle.\" Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month \"That is astonishing! Even more astonishing that Price actually missed 3 darts from 28 for a 9-3 lead,\" one fan said. While a second replied: \"Huge bottle that!\" \"Wow wow wow...this is why darts is the greatest sport,\" a third said. And another added: \"Two excellent quarter finals the next two have a lot to live up to!\" Price was caught in two minds about travelling to Germany for the tournament, with the finals clashing with his daughters birthday. He explained: \"I want to be here, then I don't want to be here. There's things going on at home. \"It's my daughter's birthday this weekend so I'd rather be home than be here. I was caught in two minds so it's one of those things.\"","pubDate":"2023-10-29 15:34:59","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309428.ece/ALTERNATES/s98/0_danny-2.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f2b4453859656cc71c932805afbadf37","title":"Dominic Calvert-Lewin strike gives Everton victory at West Ham","link":"https://www.northwalespioneer.co.uk/sport/national/23886999.dominic-calvert-lewin-strike-gives-everton-victory-west-ham/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Calvert-Lewin’s goal was his 50th in the Premier League for Everton.","content":"Everton ended a difficult week on a positive note as Dominic Calvert-Lewin fired them to a 1-0 win at West Ham. The Toffees were playing their first match since the death of chairman Bill Kenwright on Monday at the age of 78. It had been emotional week, too, for Hammers manager David Moyes, who formed a close friendship with Kenwright during his 11-year spell in charge at Goodison Park. But while West Ham slumped to a third defeat in eight days following reverses at Aston Villa and in the Europa League at Olympiacos, Everton were able to put some more breathing space between themselves and the bottom three with a second away win of the season. Calvert-Lewin’s goal was his 50th in the Premier League for Everton, joining Romelu Lukaku, Duncan Ferguson and Tim Cahill in reaching the half-century. It came six minutes into the second half after a first half that will not live long in the memory. West Ham created an early opportunity when Lucas Paqueta skilfully lifted the ball over Nathan Patterson and drilled in a low cross which Jarrod Bowen could only slice wide. Moments later Paqueta showed the side of his game which so infuriates Moyes, gifting the ball to Jack Harrison who burst through only to fire too close to Hammers keeper Alphonse Areola. Ghana winger Mohammed Kudus, making first Premier League start for West Ham, showed he is already getting used to the darker arts of English football after he was chopped down by James Tarkowski. As Jordan Pickford raced out of his goal to tell the youngster to get up, Kudus shoved the England keeper away in a skirmish which earned both a booking. Calvert-Lewin had his first chance from Vitalii Mykolenko’s cross but the striker headed over. A torturous half was summed up by the audible sigh which echoed around the London Stadium when five minutes of stoppage time was announced. The game desperately needed a goal and it almost came through Bowen, who got on the end of a James Ward-Prowse free-kick but guided his header too high. Instead the goal arrived at the other end after Jarrad Branthwaite won the ball back for Everton in midfield and fed Calvert-Lewin. The former England forward played a one-two with Harrison before executing a Cruyff turn which left both Kurt Zouma and Nayef Aguerd flat-footed and firing low past Areola. It was Calvert-Lewin’s sixth goal in all competitions against the Hammers, the most he has scored against one single club. Everton almost doubled the lead when Zouma and Aguerd got in another tangle but Areola got down well to tip Aboulaye Doucoure’s shot wide. The closest West Ham came to an equaliser was a Said Benrahma volley which Pickford kept out at his near post to secure the points.","pubDate":"2023-10-29 15:22:44","image_url":"https://www.northwalespioneer.co.uk/resources/images/17382650/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d06d16f3612b191ecbf0994c022ee6af","title":"Dominic Calvert-Lewin strike gives Everton victory at West Ham","link":"https://www.southwalesguardian.co.uk/sport/national/23886999.dominic-calvert-lewin-strike-gives-everton-victory-west-ham/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Calvert-Lewin’s goal was his 50th in the Premier League for Everton.","content":"Everton ended a difficult week on a positive note as Dominic Calvert-Lewin fired them to a 1-0 win at West Ham. The Toffees were playing their first match since the death of chairman Bill Kenwright on Monday at the age of 78. It had been emotional week, too, for Hammers manager David Moyes, who formed a close friendship with Kenwright during his 11-year spell in charge at Goodison Park. But while West Ham slumped to a third defeat in eight days following reverses at Aston Villa and in the Europa League at Olympiacos, Everton were able to put some more breathing space between themselves and the bottom three with a second away win of the season. Calvert-Lewin’s goal was his 50th in the Premier League for Everton, joining Romelu Lukaku, Duncan Ferguson and Tim Cahill in reaching the half-century. It came six minutes into the second half after a first half that will not live long in the memory. West Ham created an early opportunity when Lucas Paqueta skilfully lifted the ball over Nathan Patterson and drilled in a low cross which Jarrod Bowen could only slice wide. Moments later Paqueta showed the side of his game which so infuriates Moyes, gifting the ball to Jack Harrison who burst through only to fire too close to Hammers keeper Alphonse Areola. Ghana winger Mohammed Kudus, making first Premier League start for West Ham, showed he is already getting used to the darker arts of English football after he was chopped down by James Tarkowski. As Jordan Pickford raced out of his goal to tell the youngster to get up, Kudus shoved the England keeper away in a skirmish which earned both a booking. Calvert-Lewin had his first chance from Vitalii Mykolenko’s cross but the striker headed over. A torturous half was summed up by the audible sigh which echoed around the London Stadium when five minutes of stoppage time was announced. The game desperately needed a goal and it almost came through Bowen, who got on the end of a James Ward-Prowse free-kick but guided his header too high. Instead the goal arrived at the other end after Jarrad Branthwaite won the ball back for Everton in midfield and fed Calvert-Lewin. The former England forward played a one-two with Harrison before executing a Cruyff turn which left both Kurt Zouma and Nayef Aguerd flat-footed and firing low past Areola. It was Calvert-Lewin’s sixth goal in all competitions against the Hammers, the most he has scored against one single club. Everton almost doubled the lead when Zouma and Aguerd got in another tangle but Areola got down well to tip Aboulaye Doucoure’s shot wide. The closest West Ham came to an equaliser was a Said Benrahma volley which Pickford kept out at his near post to secure the points.","pubDate":"2023-10-29 15:22:44","image_url":"https://www.southwalesguardian.co.uk/resources/images/17382650/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c51269155fa80e0899c0bdd88faad03b","title":"Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia","link":"https://www.dailymail.co.uk/sport/boxing/article-12685075/Tyson-Fury-vs-Francis-Ngannou-LIVE-reactions-fallout-pundits-celebrities-Gypsy-King-secures-controversial-split-decision-victory-UFC-star-Saudi-Arabia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Recap Mail Sport's live blog for all the latest news and reactions after Tyson Fury controversially beat Francis Ngannou by split decision in Riyadh, Saudi Arabia","content":"Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia By Daniel Davis For Mailonline Published: 08:26 GMT, 29 October 2023 | Updated: 15:02 GMT, 29 October 2023 e-mail 30 shares 43 View comments Advertisement Recap Mail Sport's live blog for all the latest news and reactions after Tyson Fury controversially beat Francis Ngannou by split decision in Riyadh, Saudi Arabia. This live blog has now closed. 14:43 A recap We're set to round off this live blog now, but just as a reminder... Tyson Fury narrowly saw off Francis Ngannou in Saudi Arabia last night. Fury was knocked to the canvas in the third round before recovering. His next fight, against Oleksandr Usyk, is not expected to be in December. 14:06 More on the news Frank Warren has revealed Tyson Fury is 'unlikely' to face Oleksandr Usyk this year. After a controversial win over MMA fighter Francis Ngannou, Fury will most likely face Ukrainian fighter Usyk 'early next year' according to Warren. With discussions between the two undefeated fighters lasting almost a year, a fight between Fury and Usyk was eventually penned in September. Though with an original date of 23 December, it is looking more likely to be the start of 2024. You can find more details below. Tyson Fury is 'UNLIKELY' to face Oleksandr Usyk this year Frank Warren has revealed that Tyson Fury is 'unlikely' to face Oleksandr Usyk this year. Mail Online 13:14 Fury v Usyk update This will come as absolutely no surprise to many. 12:39 Fury's next fight When will Tyson Fury return to the ring? Who will his opponent be? Looking for the answers to these questions? Well, you're in luck! Follow the link below for all the details. When will Tyson Fury fight next after victory over Francis Ngannou? Tyson Fury avoided one of the biggest shocks in boxing history by the skin of his teeth against Francis Ngannou and next up is likely to be Oleksandr Usyk. Mail Sport has all the details. Mail Online 12:03 Super-fran! Francis Ngannou attempted a superman punch in the final round of the fight. Ngannou exceeded all expectations in the clash, dropping Fury with a clubbing left hook in the third round, and employing a measured approach. Heading into the tenth round Ngannou had the star-studded crowd in attendance behind him, and appeared to be building in confidence. Then, with less than a minute remaining in the bout, the former UFC star pumped a jab before launching into a superman punch that bemused the commentary team. For more details, click below. Francis Ngannou attempts a SUPERMAN PUNCH in his clash with Tyson Fury Ngannou exceeded all expectations, dropping Fury, and employing a measured approach throughout preventing Fury from landing any sustained offence. Mail Online 11:50 McGregor: Fury 'couldn't hold' Ngannou Conor McGregor has shared his thoughts on the heavyweight clash between Tyson Fury and Francis Ngannou. He lauded Fury for his performance, saying: 'Lovely shot that caught him on the back of the head, a bit off balance as well. 'Fair play to Tyson, he's a tough man as well. Strong chin. 'And Jesus, Ngannou is a powerful boy as well. Tyson couldn't hold him. He was just missing with that backhand.' Read more below. Conor McGregor says Tyson Fury 'couldn't hold' Francis Ngannou Conor McGregor shared his thoughts on the heavyweight clash between Tyson Fury and Francis Ngannou which saw the Gypsy King pick up a controversial victory. Mail Online 11:15 He has a point! Andy Murray has waded into the debate. 10:56 Fury split decision win 'a joke' Luke Campbell has hit out at Tyson Fury's 'joke' victory over Francis Ngannou and insisted the judges' scorecards are 'destroying the sport' after the controversy. 'What a joke that is. Destroying the sport,' Campbell wrote on his X account. A follow-up post read: 'I see a lot of excuses coming.' Do you agree with him? Let us know! Luke Campbell calls Tyson Fury's split decision win 'a joke' Former lightweight world title challenger Campbell wasn't impressed by the spectacle. 'What a joke that is. Destroying the sport,' Campbell wrote on his X account. Mail Online 10:32 Eubank Jr: Fury deserved to lose Chris Eubank Jr believes Tyson Fury deserved to lose his 'Battle of the Baddest' clash against Francis Ngannou in Saudi Arabia last night. Giving his take, Eubank Jr insisted the Gypsy King was lucky and that he didn't spend enough time in the gym gearing up before his controversial victory. He wrote on X: 'Watching from ringside I thought Ngannou won the fight. It was close but he was the aggressor, landed heavier shots & scored a knockdown. 'Fury deserved to lose after having so much trouble against a man who has never boxed before… too much time filming Netflix specials not enough time in the gym I'm guessing. Unlucky Francis.' For more details, click the link below! Eubank Jr insists Fury 'deserved to LOSE' against Ngannou Chris Eubank Jr believes Tyson Fury deserved to lose his 'Battle of the Baddest' clash against Francis Ngannou. Mail Online 10:15 Lewis questions Fury's camp Former heavyweight champion Lennox Lewis has questioned Tyson Fury's preparation for his crossover bout against former UFC fighter Francis Ngannou. Fury was awarded the win by split decision in Saudi Arabia yesterday but only after he had been knocked down in the third round by his impressive opponent. The Gypsy King's WBC heavyweight belt was not on the line in Riyadh, and he struggled to get to grips with Ngannou in a sluggish performance. Lewis, a three-time heavyweight champion, criticised Fury's approach to the fight. Check out his full quotes below. Lewis questions whether Fury had a full camp ahead of Ngannou fight Fury was awarded the win by split decision in Saudi Arabia on Saturday but only after he had been knocked down in the third round by Ngannou. Mail Online 09:50 Stats reveal Fury was deserving winner Punch stats Tyson Fury's controversial victory against Francis Ngannou have shed new light on their blistering showdown in Saudi Arabia last night. While Ngannou did enjoy arguably the most memorable moment of the fight, stats show that Fury landed more punches over the course of the ten rounds. According to Compubox, Fury landed 71 of his 223 total punches, while Ngannou managed to score with 59 from 231 attempted. Also, though Fury did enjoy the edge in total punches landed, Ngannou landed more power punches than the lineal heavyweight champion, with 37 to Fury's 32. Find out more below! Punch stats reveal who REALLY came out on top in Fury vs Ngannou Despite the massive disparity in boxing experience, the former UFC Heavyweight Champion defied all expectations in Saudi Arabia on Saturday. Mail Online 09:31 Ngannou set for top 10 ranking Francis Ngannou's head coach Dewey Cooper has claimed the president of the WBC said the former UFC champion will be ranked in the top ten heavyweights. Speaking outside the ring after the fight, Cooper was asked if there was any chance Ngannou would fight the likes of Deontay Wilder and Anthony Joshua. Cooper said: 'Mauricio Sulaiman, the president of WBC, said he is going to rank him in the top ten because he is better than most of the heavyweights in the top ten. 'He said that in the ring, so absolutely you'll see him again.' For more on this story, click below. Dewey Cooper claims WBC president will rank Ngannou in top ten Francis Ngannou's head coach Dewey Cooper has claimed the president of the WBC said the former UFC champion will be ranked in the top ten heayweights. Mail Online 09:10 Too many yes men? Billy Joe Saunders has suggested Tyson Fury has 'too many yes men' in his entourage after the Gypsy King scraped his victory over Francis Ngannou. On Instagram, Saunders said: 'Too many yes men in camp, not switched on from the [the] word go. But he [will] be switched on for the Ukrainian [Oleksandr Usyk].' Do you agree with his comments? Let us know! 09:00 Hearn: 'Ngannou won by two rounds' Eddie Hearn believes Francis Ngannou beat Tyson Fury 'by two rounds'. One judge scored the contest 95-94 in favour of Ngannou, while the other two controversially handed the fight to Fury 96-93 and 95-94. 'I am absolutely lost for words. Francis Ngannou has never boxed before and fair play to him, I didn't think he was overly impressive, but Tyson Fury looked like he'd never laced up a pair of gloves before,' Hearn told Matchroom's YouTube channel. 'He got dropped in the third round, he never threw a punch and Ngannou never threw a punch after. I thought Ngannou won by two rounds. Boxing world has gone mad.' You can read his full quotes below. Eddie Hearn claims Francis Ngannou beat Tyson Fury 'by two rounds' Hearn gave a scathing assessment of Fury and claimed his December heavyweight showdown with Oleksandr Usyk is dead. Mail Online 08:45 Usyk: 'Fury didn't take him seriously enough' Oleksandr Usyk wasn't quite sure what to make of Tyson Fury's largely unconvincing display, having sat at ringside in Riyadh to watch the chaos unfold. His head-scratching reaction after Fury crashed to the canvas was equally telling. 'I had an impression that he was playing. I'm not thinking about [whether he was playing possum] but I will be training 100 per cent,' Usyk told Fight Hub TV. 'But listen, it's boxing. Maybe it was the element of surprise. Maybe. I think it was [a] show.' Check out Usyk's full quotes below. Usyk suggests Fury didn't take Ngannou seriously enough The Ukrainian heavyweight champion sat at ringside in Riyadh to watch Fury ahead of their showdown in December and the Ukrainian didn't know how to read it. Mail Online 08:37 Jeff Powell's report Tyson Fury, his massive paymasters, the Kingdom of Saudi Arabia and the best laid plans of world heavyweight boxing were shaken to the roots before the Gypsy King staged the narrowest of escapes from the sensational loss of his unbeaten record. A single point on the third card of a split decision saved the hundreds of millions of dollars in waiting for Fury to dispute with Oleksandr Usyk and preserved a shot at the honour of becoming the first undisputed world heavyweight champion for more than a decade. The Ukrainian, holder of the other title belts not in the fiefdom of the Gypsy King, was sitting at ringside and how he must have been wishing this had been his night in the ring with a Fury as sluggish and disjointed as this. You can read Jeff's full report via the link below. Tyson Fury survives almighty scare to beat Francis Ngannou on points JEFF POWELL IN RIYADH: A single point on the third card of a split decision saved the hundreds of millions of dollars in waiting for Fury to dispute with Oleksandr Usyk. Mail Online 08:32 Fury survives! Wow! That was an absolute war. Welcome along to Mail Sport's coverage of all the reaction and fallout from Tyson Fury's controversial split decision victory over Francis Ngannou in Saudi Arabia. Fury was dropped by the mixed martial artist but clung on for an uneasy triumph. Who saw THAT coming? Key Updates Fury survives! View post TOP STORIES Punch stats reveal Tyson Fury WAS the deserved winner in controversial victory over boxing newbie Francis Ngannou in Saudi Arabia with the Gypsy King landing 12 more punches than his rival Eddie Hearn claims Francis Ngannou beat Tyson Fury 'by two rounds' and says heavyweight showdown with Oleksandr Usyk is DEAD after lacklustre display... as he boasts Anthony Joshua would easily knock out the Gypsy King Tyson Fury vs Francis Ngannou RECAP: All the reaction from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over his ex-UFC star opponent Lennox Lewis questions whether Tyson Fury had a full camp ahead of Francis Ngannou fight as boxing world reacts to the Gypsy King's underwhelming victory in Saudi Arabia LeBron James blasts Tyson Fury's split-decision win over Francis Ngannou after the 'Gypsy King' suffered a third-round knockdown in suspect victory: 'Exactly why I don't watch boxing!' Tyson Fury is 'UNLIKELY' to face Oleksandr Usyk this year, reveals promoter Frank Warren as Gypsy King 'needs time' after Francis Ngannou gave 'one of the toughest fights of the last decade' Tyson Fury survives an almighty scare against boxing newcomer Francis Ngannou... as the Gypsy King battles back from third round knock down to secure a split decision victory on the judges scorecards Cristiano Ronaldo, Kanye West and Conor McGregor are among the famous faces in Saudi Arabia for Tyson Fury's Battle of the Baddest fight against Francis Ngannou Francis Ngannou KNOCKS DOWN Tyson Fury in the third round - after cutting him one round earlier - as former UFC champion stuns sports fans with his display against the champion Conor McGregor reveals he's held talks with Saudi Arabia over a BOXING match against Manny Pacquiao… as he confirms he WILL make a near three-year UFC return in April 2024 Luke Campbell calls Tyson Fury's controversial split decision victory over Francis Ngannou 'a JOKE' and says the Gypsy King will have 'a lot of excuses' coming after hugely unconvincing display World champion accepts Tyson Fury challenge after Gypsy King claimed brother Tommy Fury is 'the money fight' for boxing's biggest stars: 'I'd happily beat the c**p out of him' Inside Francis Ngannou's stunning car collection with former UFC champion boasting a £421k Rolls Royce Phantom and £270k Ghost Sadio Mane, Cristiano Ronaldo and Allan Saint-Maximin are among the footballers at Tyson Fury vs Francis Ngannou - with fellow Saudi Pro League stars Aymeric Laporte and Franck Kessie also in attendance Francis Ngannou attempts a SUPERMAN PUNCH in the tenth round of his clash with Tyson Fury... after knocking down the WBC Heavyweight Champion earlier in the fight Kanye West wears Premier League kit to Tyson Fury vs Francis Ngannou super fight - but team does the shirt belong to? Fans are trying to figure out the owner of the black shirt with yellow trim Heartwarming footage shows Cristiano Ronaldo asking Israel Adesanya for an update on Alex Volkanovski after the Aussie's brutal knockout and mental health concerns Boxing fans claim Francis Ngannou was 'ROBBED' of win against Tyson Fury as judges rule Gypsy King as the winner by split decision, despite Ngannou knocking Fury down in third round Lennox Lewis insists he would've beaten Tyson Fury in a battle of legendary British heavyweights... as he reveals the game plan the late Emanuel Steward would have given him to face the Gypsy King Rio Ferdinand claims Cristiano Ronaldo left his peers starstruck at the gala ahead of Tyson Fury vs Francis Ngannou - where names like Kanye West and Eminem were present - insisting 'there's superstars and then there's this guy' Fabio Wardley knocks out David Adeleye in the seventh-round in British heavyweight title grudge match on the Tyson Fury vs Francis Ngannou undercard Tyson Fury tells Cristiano Ronaldo he's 'the greatest footballer that has ever lived' - snubbing Lionel Messi - as they embrace at Champions Gala in Riyadh ahead of 'Battle of the Baddest' with Francis Ngannou Mike Tyson hilariously bites back at a reporter after Battle of the Baddest fight between Tyson Fury and Francis Ngannou - but claims the former MMA star WASN'T robbed despite his defeat Oleksandr Usyk suggests Tyson Fury didn't take Francis Ngannou seriously enough after Gypsy King's unconvincing split decision win... as Ukrainian's reaction to shock third round knockdown is revealed Amir Khan tells fan to 'shut the f**k up' after being ridiculed for awkward video where he gifts rap star Eminem a limited edition watch and wraps it on his wrist for him Cristiano Ronaldo is seemingly BOOED by spectators as he takes his seat ringside to watch Tyson Fury take on Francis Ngannou in Riyadh... or are they paying homage to an iconic sui celebration? Fury vs Ngannou: Israel Adesanya in line for over £100,000 payout after placing $20,000 on Gypsy King to be KO'd by 'The Predator' in the Battle of the Baddest - as former UFC champ embraces Cristiano Ronaldo before Riyadh showdown When is Tyson Fury's next fight and who will be his opponent after the Gypsy King's split decision victory against Francis Ngannou? The rise of Francis Ngannou: From walking six miles to school in Africa to sleeping rough in Paris and borrowing money to LIVE - even after becoming a UFC champion - 'The Predator' has hit the big time with Tyson Fury fight Tyson Fury and Oleksandr Usyk share unexpected embrace ahead of his Battle of the Baddest fight against Francis Ngannou after the date announcement for their Christmas clash Tyson Fury threatens to SUE Oleksandr Usyk as he sets a hard deadline for their heavyweight unification fight Francis Ngannou's trainer Dewey Cooper claims WBC president will rank the former UFC champion in top 10 heavyweights after fight against Tyson Fury Tyson Fury breaks silence on missing birth of seventh baby with wife Paris Fury: 'Daddy's gotta do what daddy's gotta do' Fans slam 'pure trash' opening ceremony ahead of Tyson Fury's 'Battle of the Baddest' fight against Francis Ngannou, claiming they 'came for a scrap not a concert' Conor McGregor says Tyson Fury 'couldn't hold' Francis Ngannou and marvels at his former UFC peer's formidable power as he fuels Oleksandr Usyk v Fury rumours for next clash Cristiano Ronaldo, Lionel Messi and Kylian Mbappe move over! Meet the Roman athlete who's '£15BILLION fortune' eclipses the wealth of football's elite at the top of 2023's sports rich list Lennox Lewis claims 'I thought Tyson Fury WON' his fight against Francis Ngannou, despite being knocked to the canvas in the third round with the three-time heavyweight champion claiming 'this was like a warm-up fight' A topless face-off with Mike Tyson, trashing a stage, headbutting a glass wall - and lashing out at KSI: The bizarre pre-fight antics of Tyson Fury's hellraising father John - as bemused fans brand him 'the most embarrassing man on the planet' Tyson Fury addressed prime minister Rishi Sunak with emotional knife crime plea after cousin was stabbed to death Tyson Fury has an estimated £130m net worth and a five-inch height advantage on Francis Ngannou, but the former UFC champ's £421k Rolls Royce is worth more than the Gypsy King's cars and his punches can reach further! TALE OF THE TAPE for Saturday's fight Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury Chris Eubank Jr insists Tyson Fury 'deserved to LOSE' against Francis Ngannou... as he claims the victorious Gypsy King had spent 'too much time filming Netflix specials rather than in the gym' John Fury furiously warns KSI he will 'hound him to DEATH and ruin his career' if the YouTube star doesn't pay up £200,000 after losing bet in his boxing defeat against his son Tommy Tyson Fury weighs in heavier than Francis Ngannou ahead of their Battle of the Baddest clash in Saudi Arabia... with the Gypsy King tipping the scales at 277lbs - nine pounds more than his weight ahead of victory over Derek Chisora last December Tyson Fury looks in lean shape after cutting down his 'love handles' in a remarkable body transformation in just seven weeks before fighting Francis Ngannou Manny Pacquiao confirms that he is 'working' on a fight with Amir Khan to take place next year... as the boxing legend also says he hopes to compete at the Paris 2024 Summer Olympics Joseph Parker KNOCKS OUT Simon Kean with a sensational third-round uppercut on the Tyson Fury vs Francis Ngannou undercard as the former WBO champion improves to 3-0 in 2023 Tyson Fury's face is left battered and bruised after his split decision victory over Francis Ngannou... while the former MMA star looks fine despite defeat Man United 0-1 Man City - Premier League LIVE: Erling Haaland scores a penalty to give visitors the lead in the Manchester derby Liverpool 3-0 Nottingham Forest: Reds cruise to comfortable win at Anfield with Diogo Jota, Darwin Nunez and Mo Salah finding the net Premier League LIVE: Diogo Jota, Darwin Nunez and Mo Salah give Liverpool 3-0 lead over Forest while high-flying Aston Villa take control against Luton and Joao Palhinha draws Fulham level at Brighton Former Canadian tennis star Eugenie Bouchard joined by friends to show off incredible physique dressed in lacey catwoman outfit for Halloween CHRIS FOY'S RUGBY WORLD CUP HIGHLIGHTS: Portugal's progress gets Cristiano Ronaldo's seal of approval, Antoine Dupont's injury grips a nation, Fiji steal hearts and was France vs South Africa the greatest Test EVER? Jamie Carragher jokes the 'prawn sandwich brigade' have taken their seats at Old Trafford as the Liverpool legend pokes fun at Roy Keane ahead of the Manchester derby Eddie Jones labelled 'pathetic' by Sir Clive Woodward after Australian likened coaching the Wallabies to 'eating s***' as England legend urges Japan NOT to hire outgoing boss Olympiacos' fierce derby with Panathinaikos is abandoned after a player is struck by a FIREWORK while warming up on the touchline - as his team-mates refuse to return from the dressing room to finish the clash Joey Barton is SACKED as manager of Bristol Rovers, hours after he called rival boss Steve Evans a 'fat man' and a 'weeble' in his final game which left the team stuck 16th in League One Southampton 3-1 Birmingham: Wayne Rooney suffers a third successive defeat since taking charge of the Blues as the Saints cruise to victory Harry Kane scores incredible goal FROM HIS OWN HALF as he hits a hat-trick with Bayern Munich hitting EIGHT second-half goals in thrashing of Darmstadt - with three players sent off! Carlo Ancelotti says Jude Bellingham can 'easily reach 20-25 goals' for Real Madrid this season after the 20-year-old 'veteran' scored twice in their 2-1 win over Barcelona Sheffield United break record for the worst EVER start to a Premier League season after Arsenal defeat... with Paul Heckingbottom's side picking up just one point from their first 10 games England boss Shaun Wane labels Tonga 'disgraceful' after 14-4 victory over the Pacific Islanders to clinch series win in Huddersfield Eddie Jones resigns as Australia boss after disastrous Rugby World Cup campaign England could MISS OUT on 2025 ICC Champions Trophy if they don't finish in the top seven rankings of the ongoing ODI World Cup Aston Villa 3-1 Luton Town: Ruthless Villa put the Hatters to the sword as McGinn, Diaby and a Lockyer own goal seal win Diogo Jota holds up Luis Diaz No 7 shirt as he dedicates goal against Nottingham Forest to Liverpool team-mate whose parents were kidnapped in Colombia West Ham 0-1 Everton: Dominic Calvert-Lewin scores his 50th Premier League goal to secure Toffees win as they remember Bill Kenwright Erik ten Hag reveals Man United defensive duo Jonny Evans and Victor Lindelof were given the nod over Raphael Varane for the Manchester derby for 'TACTICAL reasons' Travis Kelce 'wants KIDS with Taylor Swift in the next year or so' and she is 'all in' on the plans - and the Chiefs star has also spoken about marrying the singer as whirlwind romance hots up BREAKING NEWS: The mother of Liverpool star Luis Diaz 'has been rescued from a kidnapping in Colombia by assailants on motorcycles' - but the player's father is still missing New Zealand 11-12 South Africa - Rugby World Cup final LIVE: Springboks RETAIN their crown after nerve-shredding finish in Paris... as they become first side to lift trophy for a fourth time EXCLUSIVE: No Taylor = Sad Travis! Glum-faced Kelce is spotted at the Chiefs' hotel in snowy Denver as he prepares to face the Broncos WITHOUT his popstar girlfriend watching on from the stands Springboks reign once more! South Africa retain their World Cup crown after nerve-shredding 12-11 win over New Zealand in Paris - their third consecutive victory by just ONE point... as they become first side to lift trophy for a fourth time Robbie Fowler is sacked by Saudi side Al-Qadsiah after four months despite an unbeaten start... with the former Liverpool star named manager of the month in September! Travis Kelce dances to Taylor Swift classic 'Love Story' in Texas bar and sends the Swifties wild with viral video after watching the Rangers win their World Series game Son who stabbed AFL coach father Phil Walsh to death in frenzied knife attack is back in full detention after decline in his mental health OLIVER HOLT: Jude Bellingham is Il Fenomeno, the King of Madrid and the impact he is having in Spain feels almost other-worldly after El Clasico heroics... he is only 20 yet he is taking European football by storm Novak Djokovic and Rita Ora among celebrities spotted at Rugby World Cup final as Mika performs in France, for New Zealand v South Africa clash Gillingham fan is arrested and given a lifetime ban after vile racist gesture targeting Newport County goalscorer Omar Bogle... just weeks after the club was handed a £12K fine by the FA for racist and sexist chanting Barcelona 1-2 Real Madrid: Jude Bellingham scores sensational double, hitting a 25-yard SCREAMER before finding the back of the net in injury time to help Carlo Ancelotti's side seal dramatic comeback victory to go top of LaLiga Nick Riewoldt makes major family announcement after leaving Australia for the United States: 'I missed the footy season this year' For as long as I can remember the RFU has been far too cozy, it needs shaking up if England are to win another Rugby World Cup... it's left field, but they must hire South Africa's genius coach Rassie Erasmus TNT Sports' coverage of Tyson Fury's huge crossover clash with Francis Ngannou goes DOWN just 40 minutes into the show, leaving fans furious after paying £21.95 for the fight Barcelona 1-2 Real Madrid - RECAP: Jude Bellingham scores last-gasp winner for Carlo Ancelotti's side as his heroic second-half brace sees visitors edge to victory in El Clasico World Series matchup between wildcards Texas Rangers and Arizona Diamondbacks prompts MLB to re-examine playoff format... but commissioner Rob Manfred isn't rushing to make changes Taylor Swift made the first move in Travis Kelce romance and 'cautiously reached out' when she heard how he failed to give her his number at Kansas City Eras show Taylor Swift now can't cheer Travis Kelce on in the NFL until DECEMBER - and Eras tour dates mean she WON'T be at the Super Bowl in February if the Kansas City Chiefs make it that far Luis Diaz left out of Liverpool squad for clash against Forest after his parents were kidnapped in Colombia, while authorities 'continue the search' for Reds star's father after his mum was rescued and freed Kansas City Chiefs star Travis Kelce is spotted dancing to Taylor Swift's 'Shake it Off' at Game 1 of the World Series WITHOUT pop star girlfriend An early childhood teacher, a farm manager and an accountant turned influencer... meet the All Blacks wives and partners cheering on their side as New Zealand and South Africa battle for the Rugby World Cup EXCLUSIVE: OJ Simpson looks unrecognizable as the frail NFL legend, 76, is spotted carrying groceries in Las Vegas... 28 years after being acquitted in the 'Trial of the Century' Joe Marler tells former England star to 'eat s*** after the prop was accused of 'showing a lack of respect' by snubbing Sir Bill Beaumont... as he collected his Rugby World Cup bronze medal Wolves 2-2 Newcastle - Premier League RECAP: Hwang Hee-chan twists and turns in the Magpies area before firing home fine equaliser... as Gary O'Neill's side pull themselves level to secure a point at Molineux RIATH AL-SAMARRAI: Alejandro Garnacho's tweet about Andre Onana which featured two gorilla emojis wasn't malicious... but the Man United youngster must be charged by the FA Harry Kane humbly claims his halfway line goal in Bayern Munich hat-trick 'one of the better ones in my career' as he soaks up the praise for stunning contribution to 8-0 thrashing in Bundesliga EXCLUSIVE: Paul Heckingbottom could be sacked THIS WEEKEND if Sheffield United lose at Arsenal... with former Blades boss Chris Wilder in line to replace him Arsenal 5-0 Sheffield United: Eddie Nketiah nets his first Premier League hat-trick as the Gunners cut the gap to Tottenham to two points - with Fabio Vieira and Takehiro Tomiyasu also scoring Travis Kelce is filmed receiving copious amounts of friendship bracelets from Taylor Swift fans at her Eras Tour months BEFORE he began dating the singer Saudi Arabia UFC Fighting Tyson Fury Share or comment on this article: Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia e-mail 30 shares Terrible fight and wrong winner. Fury looked all f... by hahapoo 50 Add comment Comments 43 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-29 15:02:18","image_url":"https://i.dailymail.co.uk/1s/2023/10/29/08/77135991-0-image-a-4_1698567198518.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3f1b8e8f043105e7f1ccd5850e3c2561","title":"Amir Khan caresses Mike Tyson's hands as confused boxing fans say 'this is just weird'","link":"https://www.dailystar.co.uk/sport/football/amir-khan-caresses-mike-tyson-31308548","keywords":["Sport"],"creator":null,"video_url":null,"description":"Amir Khan had boxing fans confused as the former boxer filmed himself caress the hand of Mike Tyson before the fight between Tyson Fury and Francis Ngannou","content":"A video of caressing the hand of had fans both confused and weirded out by the strange interaction. The former boxers were among the star-studded attendees for the mega-fight between Tyson Fury and Francis Ngannou, which was . The 35-year-old won by split decision, in the third round by the former UFC heavyweight, who looked at home in the boxing ring despite it being his debut. Prior to the battle between the two fighters, there was plenty of mingling between icons of sport as Amir Khan enjoyed a wholesome but bizarre moment with Mike Tyson. In a video the 36-year-old posted on his Instagram Stories, the Bolton-born brawler was caressing Tyson's hand as he seemed in awe with it as he asked the American: \"How many people you knock out with this?\" The former undisputed heavyweight champion replied: \"I don't know, 48 but 200 in the street,\" before the pair enjoyed a laugh together. Fans on social media certainly saw the quirky side to Khan's constant rubbing of Tyson's right hand as one X user wrote: \"Why did he hold his hand for so long?!\" while another bluntly stated: \"this is just weird\". Another suggested that Khan may have been in for a punch as they said: \"We all know Mike doesn’t like being touched like that, he probably had that intrusive thought to add +1 KO to the record.\" It wasn't the pair's first interaction in Saudi Arabia as the New York native made an impromptu appearance in one of Khan's interviews during the weekend. During an interview with talkSPORT, Tyson and his entourage walked through which brought a brief pause on the interview which Khan saw the funny side to as he said: \"Hey listen, when Mike Tyson's walking through, you don't want to stand in front of Mike Tyson.\" He jokingly added: \"He might punch you! When you've got walking through you, I'm like, 'Mate, let him go' because you don't wanna get hit by him. You don't wanna be in his way basically.\"","pubDate":"2023-10-29 14:55:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309008.ece/ALTERNATES/s98/1_Amir-Khan-caresses-Mike-Tysons-hands-as-confused-boxing-fans-say-this-is-just-weird.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8db7fd42cc12433b220b45634bf5ff2a","title":"Liverpool players pay perfect tribute to Luis Diaz during winger's family kidnap ordeal","link":"https://www.mirror.co.uk/sport/football/news/luiz-diaz-kidnap-parents-liverpool-31309118","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Mark Jones)"],"video_url":null,"description":"Luis Diaz was absent from the Liverpool side for Sunday's clash with Nottingham Forest at Anfield after his parents were kidnapped in Colombia on Saturday, with his father still missing","content":"Diogo Jota and Liverpool's players showed team-mate Luis Diaz that he was on their minds as they celebrated their first goal against Nottingham Forest in the wake of their absent winger's terrifying family kidnap ordeal. Jota slotted home in the 31st minute of the clash at Anfield after Forest goalkeeper Matt Turner had parried an effort from Darwin Nunez. The Portuguese, who had effectively come into Liverpool's Premier League side for Diaz, was all alone at the back post and slotted in with ease. The forward then ran towards the Reds bench with his team-mates and picked up a Diaz No.7 Liverpool shirt, holding it aloft to the crowd. Liverpool supporters responded by singing Diaz's name as they showed him that he was very much on their minds. Luis Diaz's parents' kidnapping: Latest news as Liverpool star misses match after \"tough night\" Jurgen Klopp speaks out on Luiz Diaz's \"worrying situation\" after parents' kidnapping Diaz was absent from Liverpool's matchday squad on Sunday after his parents were kidnapped in his native Colombia on Saturday evening. His mother, Cilenis Marulanda, was quickly rescued, however his father is still reported missing. Liverpool said in a statement on Sunday: \"Liverpool Football Club can confirm it is aware of an ongoing situation involving the family of Luis Diaz in Colombia. It is our fervent hope that the matter is resolved safely and at the earliest possible opportunity. In the meantime, the player’s welfare will continue to be our immediate priority.\" Jota and Liverpool's players paid tribute to their team-mate ( Image: AFP via Getty Images) Reds boss Klopp, asked about the situation ahead of the match, said: \"We had to obviously make a late change because of the private situation involving Luis Diaz. It's a worrying situation for all of us and it was a pretty tough night. I have never had that before. It's a new experience I never needed.\" Authorities in Colombia are working hard to help find Diaz's father, with the player being kept abreast of the latest situation. The Colombian attorney General's office also said in a statement: \"From the moment when Colombia's General Prosecutor's Office learned of the kidnapping of the parents of Colombian player Luis Díaz in the Barrancas area of La Guajira, a specialist team of prosecutors, CTI (Technical Investigation Team) officials and investigators from the police and military have been taking urgent action to locate these individuals, clarify the chain of events and identify the culprits.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-10-29 14:49:45","image_url":"https://i2-prod.mirror.co.uk/incoming/article31309153.ece/ALTERNATES/s615/0_Liverpool-v-Nottingham-Forest-Premier-League-Anfield.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bad5fdad8d700829f088541a6ab5d363","title":"Three things Jurgen Klopp got right as Liverpool ease to victory over Nottingham Forest","link":"https://www.dailystar.co.uk/sport/football/jurgen-klopp-liverpool-prem-victory-31309357","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool eased to a comfortable win over Nottingham Forest which makes it back-to-back Premier League wins for Jurgen Klopp and his side","content":"secured a 3-0 victory against Nottingham Forest in the in a game they dominated for large parts of it. Diogo Jota opened the scoring for the home side after tapping in from close range as Matt Turner could only parry Darwin Nunez's efforts. The Uruguayan finally made his way on the scoresheet four minutes later after latching onto Dominick Szoboszlai's pass. Mohamed Salah made it three after Matt Turner was caught in no man's land leaving the Egyptian to score into an empty net. The victory - which is Liverpool's second in a row since earlier this month - lifted them above into third in the Premier League but a win for Pep Guardiola's side in the Manchester derby on Sunday afternoon (October 29) will lift the reigning champions above Liverpool. had to do without Luis Diaz after the which meant he was left out of the squad with Jota taking his place in the starting line-up as the Portuguese star by lifting his number seven shirt after scoring the opener. The absence of Diaz as well as several continuing injuries and a didn't hamper Liverpool as takes a look at the things Klopp got right during the game. The Uruguyuan endured a difficult first season at the club having been found guilty of missing a plethora of guilt-edge chances. His overall play was lacking at many times last year as fans began wondering whether Nunez was the future of the team's strikeforce. Despite beginning the season as second-fiddle to Cody Gakpo, the 24-year-old fought his way back into the starting line-up and has netted six goals in all competitions this season including the second in their 3-0 win against Nottingham Forest on Sunday (October 29). His protection of the ball, improving build-up play and goal-scoring instincts were all on show in Liverpool's victory as he continues going from strength to strength under Jurgen Klopp. Klopp's current squad may just be the best he's had at Liverpool since arriving at the club in 2015 and has allowed him to rotate his squad without having to make a compromise on quality. Keeping top players happy when they may not start every game is an underrated quality in a manager and an attribute Klopp has in abundance. The likes of Diogo Jota, Cody Gakpo and Harvey Elliott may not be the first names on the team-sheet but they remain an important part of Liverpool and Jota's goals as well as the positive cameos of Elliott and Gakpo just goes to show how the Liverpool boss has perfected the morale of his team. The Liverpool boss had been criticised by some by not starting Ibrahima Konate in Liverpool's 5-1 victory over Toulouse in the Europa League on Thursday (October 26). The French international has only played just 378 minutes of Premier League action this season after playing just 18 games in the 2022/23 campaign. Klopp shared his frustrations about Konate's injury issues in an interview with where he said: \"I love absolutely everything about Ibou, but the problem is Ibou had injury problems from time to time and Mr Deschamps played him 90 and 87 minutes in the two games (for France).\" He's been careful with overplaying the defender but started him in Liverpool's 3-0 win on Sunday where he put in a faultless performance and earned a clean sheet.","pubDate":"2023-10-29 16:05:09","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309541.ece/ALTERNATES/s98/1_Liverpool-FC-v-Nottingham-Forest-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5658017f25634cc17eb731a6e9e07a94","title":"Claudio Ranieri performs 'greatest miracle of career' as Serie A side make history","link":"https://www.dailystar.co.uk/sport/football/claudio-ranieri-cagliari-serie-a-31309295","keywords":["Sport"],"creator":null,"video_url":null,"description":"He might be 72, but Claudio Ranieri is still capable of creating moments of magic like the one he did with Leicester City - inspiring his Cagliari side to a stunning 4-3 victory","content":"Claudio Ranieri's Cagliari made history as they came back from 3-0 down to win in the sixth minute of stoppage time. Former boss Ranieri has endured a struggling start to the season in Sardinia with his newly-promoted side, heading into Sunday's (October 29) home clash with Frosinone winless in their first nine games. It looked like things were going to go from bad to worse for the Tinkerman when the visitors headed into the break two to the good, with Cagliari midfielder Marco Mancosu also missing a penalty to add to their woes. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Frosinone's Marco Brescianini made it three less than four minutes after the restart and it looked to be game over. But some inspired changes by Ranieri turned the tide in remarkable fashion. Leonardo Pavoletti set up fellow substitute Gaetano Oristanio to draw one back with a little under 20 minutes to go, then Antoine Makoumbou reduced the deficit to just one shortly after. Striker Pavoletti then became the hero, first levelling in the 90+4th minute before he found a dramatic last-gasp winner. A VAR check left hearts in mouths, but the goal stood and Ranieri was soon celebrating victory with his players. It's the first time in Serie A history that a team has fought back from 3-0 to win after the 70th minute, with one fan suggesting: \"The greatest miracle of Claudio Ranieri’s career?!\" Another hit back: \"No bigger miracle than Leicester league champions.\" While one added: \"Second greatest.\" Others were chuffed to see Ranieri get back to winning ways. \"It feels so good to watch him succeed wherever he goes. Good things happens to good people,\" hailed one, and another commented: \"He's the miracle man!\"","pubDate":"2023-10-29 16:00:23","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309472.ece/ALTERNATES/s98/0_Cagliari-Calcio-v-Frosinone-Calcio-Serie-A-TIM.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"71ae6f311922e7f2acbf303c6ccd0b2f","title":"Palhinha stunner earns Fulham draw at Brighton","link":"https://www.skysports.com/football/brighton-and-hove-albion-vs-fulham/report/482684","keywords":null,"creator":null,"video_url":null,"description":"Joao Palhinha hit a stunning second-half equaliser to earn a point for Fulham in a 1-1 draw at Brighton.","content":"Joao Palhinha hit a stunning second-half equaliser to earn a point for Fulham in a 1-1 draw at Brighton. Fulham then survived a late onslaught to maintain their unbeaten record against the Seagulls from all seven of their Premier League meetings. Roberto De Zerbi made six changes from Brighton's Thursday night victory over Ajax and his refreshed side dominated possession in the first-half as Evan Ferguson expertly slotted home in the 26th minute. However Fulham began to wear the hosts down and became bolder with their approach in the second period before Palhinha crashed a wonderful effort from the edge of the box high into the net. Brighton: Steele (7), Julio (7), Webster (7), Dunk (7), Dahoud (7), Gross (7), Lallana (6), Baleba (6), Mitoma (7), Adingra (6), Ferguson (7). Subs: Fati (6), Gilmour (6), Buonanotte (6), Veltman (6), Pedro (n/a). Fulham: Leno (7), Bassey (7), Reed (6), Jimenez (6), Ream (7), Decordova-Reid (6), Willian (6), Castagne (7), Iwobi (7), Palhinha (8), Robinson (6). Subs: Pereira (6), Muniz (6), Wilson (6), Cairney (n/a), Lukic (n/a) Player of the Match: Joao Palhinha Brighton dominated possession from the outset and had Bernd Leno to thank for flying to his left to push away Carlos Baleba's shot from the edge of the box and then deny Simon Adingra from close range. Baleba, Adingra and Kaoru Mitoma all shot off target within four minutes of each other as the Brighton onslaught continued. Fulham kept giving possession back to the hosts and Joao Palhinha showed his frustration, catching Pascal Gross in the face with a stray arm that went unpunished. Brighton, though, finally went ahead when Igor Julio intercepted Harrison Reed's forward pass and the centre-back found gross, who moved it on to Ferguson and he coolly guided a low shot into the bottom left corner. Live Premier League table Premier League results Watch Premier League highlights Get Sky Sports Fulham did improve in the final stages of the first-half although it took Lewis Dunk hitting the crossbar from a free-kick shortly after the break and then the introductions of Andreas Pereira, Rodrigo Muniz and Harry Wilson to really spark them into life. Brighton were being overrun in midfield as Fulham pushed higher up the pitch to stop them playing out from the back and it was Alex Iwobi who won the ball deep in the home side's half before finding Wilson, who teed up Palhinha to slam a perfect strike into the top right corner. Muniz then saw his clever close-range flick saved by Jason Steele with Brighton wobbling. However, the hosts recovered for the final 10 minutes, seeing substitute Ansu Fati denied by Leno and had a certain goal prevented by Antonee Robinson from Adam Webster's header. Play Fantasy Premier League and see more stats here Brighton are back in action next Saturday with a trip to Everton , kick-off 3pm. They then travel to Ajax on Thursday November 9 in the Europa League, kick-off 5.45pm. Meanwhile, Fulham face a trip to Ipswich in the Carabao Cup fourth round on Wednesday, kick-off 7.45pm. They then host Man Utd on Saturday November 4, kick-off 12.30pm. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-29 16:00:00","image_url":"https://e0.365dm.com/23/10/1920x1080/skysports-premier-league-fulham_6340557.jpg?20231029154150","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3a72fc9ed84c6822cc08955b77f59bf3","title":"Francis Ngannou attempted 'superman punch' on Tyson Fury on advice of Mike Tyson","link":"https://www.dailystar.co.uk/sport/boxing/fury-ngannou-superman-mike-tyson-31309074","keywords":["Sport"],"creator":null,"video_url":null,"description":"Boxing legend Mike Tyson told UFC star Francis Ngannou to use a 'superman punch' on Saturday night when he faced off against heavyweight champion Tyson Fury in Saudi Arabia","content":"revealed ringside that he told UFC star Francis Ngannou to do a 'superman punch' against . Ngannou, fighting in what was his professional debut, went up against heavyweight world champion Fury in Saudi Arabia on Saturday night . Fury had described the contest beforehand as if Ngannou were a table tennis player taking on Novak Djokovic. However, come round 10, when Ngannou launched into his superman punch, there was no doubt that Fury could not have been more wrong. In the third round of the fight that went the distance, the 37-year-old UFC brawler landed a monstrous blow on Fury . The huge blow stunned Fury, who struggled to regain his composure immediately after, with Ngannou looking increasingly confident - clearly enough to attempt to land the 'superman punch' right at the end of the bout. Sadly for Ngannou, he didn't make a solid connection with him punch. But that didn't stop boxing legend Mike Tyson from revealing ringside during the 10th round that he had told Ngannou to pull it out in Saudi Arabia. \"Oh, Superman punch, superman punch, that's how they do it in the UFC,\" Tyson can be heard saying on an Instagram story uploaded to his account. \"You teach him that?\" asked the individual filming Tyson, to which the legendary boxer replied: \"Not that one, nah. I told him to use it though!\" Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Even the Blonde Bomber, Ebanie Bridges, was ecstatic to see Ngannou pull out the superman punch. Taking to social media the day after the fight in Saudi Arabia, Bridges wrote: \"I wish that superman punch from @francis_ngannou landed properly lastnight… imagine that. it woulda been epic… KO by superman punch.\" However, moments after the tenth round, it was revealed Fury had somehow won the fight via split decision, something which caused uproar on social media. Having talked about how Ngannou would have no chance in the ring against him, Fury was left embarrassed. And his fight against Ngannou . While the fight has been agreed to, promoter Frank Warren announced after the battle in Saudi Arabia that Fury would need time to heal, making it more like he and Usyk face off around the beginning of 2024.","pubDate":"2023-10-29 15:43:10","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309323.ece/ALTERNATES/s98/2_F9m5Bz3WoAM4znR-1jpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"90b6018d30b81387eedfaf15be908253","title":"Gerwyn Price 'bottles' 7-0 lead as Danny Noppert launches incredible comeback to win","link":"https://www.dailystar.co.uk/sport/darts/darts-gerwyn-price-danny-noppert-31309393","keywords":["Sport"],"creator":null,"video_url":null,"description":"Darts fans have been left shocked as Gerwyn Price \"bottled\" a 7-0 lead in the European Championships as he lost to Danny Noppert in an amazing comeback performance","content":"fans have been left shocked as Danny Noppert launched an incredible comeback win against . Noppert had found himself 7-0 down in a race to ten at the European Championships, and seemingly crashing out to the Welsh superstar. However, Price would only go onto claim one more leg as Noppert landed seven 180s on his way to winning 10-8. The Dutchman has won legions of fans in Dortmund, and he joked earlier in the week: \"I'm not the really boring player that everyone thinks. But sometimes I just need to keep calm. If I'm celebrating too hard, adrenaline goes too high and then sometimes I can struggle.\" Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month \"That is astonishing! Even more astonishing that Price actually missed 3 darts from 28 for a 9-3 lead,\" one fan said. While a second replied: \"Huge bottle that!\" \"Wow wow wow...this is why darts is the greatest sport,\" a third said. And another added: \"Two excellent quarter finals the next two have a lot to live up to!\" Price was caught in two minds about travelling to Germany for the tournament, with the finals clashing with his daughters birthday. He explained: \"I want to be here, then I don't want to be here. There's things going on at home. \"It's my daughter's birthday this weekend so I'd rather be home than be here. I was caught in two minds so it's one of those things.\"","pubDate":"2023-10-29 15:34:59","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309428.ece/ALTERNATES/s98/0_danny-2.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f2b4453859656cc71c932805afbadf37","title":"Dominic Calvert-Lewin strike gives Everton victory at West Ham","link":"https://www.northwalespioneer.co.uk/sport/national/23886999.dominic-calvert-lewin-strike-gives-everton-victory-west-ham/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Calvert-Lewin’s goal was his 50th in the Premier League for Everton.","content":"Everton ended a difficult week on a positive note as Dominic Calvert-Lewin fired them to a 1-0 win at West Ham. The Toffees were playing their first match since the death of chairman Bill Kenwright on Monday at the age of 78. It had been emotional week, too, for Hammers manager David Moyes, who formed a close friendship with Kenwright during his 11-year spell in charge at Goodison Park. But while West Ham slumped to a third defeat in eight days following reverses at Aston Villa and in the Europa League at Olympiacos, Everton were able to put some more breathing space between themselves and the bottom three with a second away win of the season. Calvert-Lewin’s goal was his 50th in the Premier League for Everton, joining Romelu Lukaku, Duncan Ferguson and Tim Cahill in reaching the half-century. It came six minutes into the second half after a first half that will not live long in the memory. West Ham created an early opportunity when Lucas Paqueta skilfully lifted the ball over Nathan Patterson and drilled in a low cross which Jarrod Bowen could only slice wide. Moments later Paqueta showed the side of his game which so infuriates Moyes, gifting the ball to Jack Harrison who burst through only to fire too close to Hammers keeper Alphonse Areola. Ghana winger Mohammed Kudus, making first Premier League start for West Ham, showed he is already getting used to the darker arts of English football after he was chopped down by James Tarkowski. As Jordan Pickford raced out of his goal to tell the youngster to get up, Kudus shoved the England keeper away in a skirmish which earned both a booking. Calvert-Lewin had his first chance from Vitalii Mykolenko’s cross but the striker headed over. A torturous half was summed up by the audible sigh which echoed around the London Stadium when five minutes of stoppage time was announced. The game desperately needed a goal and it almost came through Bowen, who got on the end of a James Ward-Prowse free-kick but guided his header too high. Instead the goal arrived at the other end after Jarrad Branthwaite won the ball back for Everton in midfield and fed Calvert-Lewin. The former England forward played a one-two with Harrison before executing a Cruyff turn which left both Kurt Zouma and Nayef Aguerd flat-footed and firing low past Areola. It was Calvert-Lewin’s sixth goal in all competitions against the Hammers, the most he has scored against one single club. Everton almost doubled the lead when Zouma and Aguerd got in another tangle but Areola got down well to tip Aboulaye Doucoure’s shot wide. The closest West Ham came to an equaliser was a Said Benrahma volley which Pickford kept out at his near post to secure the points.","pubDate":"2023-10-29 15:22:44","image_url":"https://www.northwalespioneer.co.uk/resources/images/17382650/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d06d16f3612b191ecbf0994c022ee6af","title":"Dominic Calvert-Lewin strike gives Everton victory at West Ham","link":"https://www.southwalesguardian.co.uk/sport/national/23886999.dominic-calvert-lewin-strike-gives-everton-victory-west-ham/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Calvert-Lewin’s goal was his 50th in the Premier League for Everton.","content":"Everton ended a difficult week on a positive note as Dominic Calvert-Lewin fired them to a 1-0 win at West Ham. The Toffees were playing their first match since the death of chairman Bill Kenwright on Monday at the age of 78. It had been emotional week, too, for Hammers manager David Moyes, who formed a close friendship with Kenwright during his 11-year spell in charge at Goodison Park. But while West Ham slumped to a third defeat in eight days following reverses at Aston Villa and in the Europa League at Olympiacos, Everton were able to put some more breathing space between themselves and the bottom three with a second away win of the season. Calvert-Lewin’s goal was his 50th in the Premier League for Everton, joining Romelu Lukaku, Duncan Ferguson and Tim Cahill in reaching the half-century. It came six minutes into the second half after a first half that will not live long in the memory. West Ham created an early opportunity when Lucas Paqueta skilfully lifted the ball over Nathan Patterson and drilled in a low cross which Jarrod Bowen could only slice wide. Moments later Paqueta showed the side of his game which so infuriates Moyes, gifting the ball to Jack Harrison who burst through only to fire too close to Hammers keeper Alphonse Areola. Ghana winger Mohammed Kudus, making first Premier League start for West Ham, showed he is already getting used to the darker arts of English football after he was chopped down by James Tarkowski. As Jordan Pickford raced out of his goal to tell the youngster to get up, Kudus shoved the England keeper away in a skirmish which earned both a booking. Calvert-Lewin had his first chance from Vitalii Mykolenko’s cross but the striker headed over. A torturous half was summed up by the audible sigh which echoed around the London Stadium when five minutes of stoppage time was announced. The game desperately needed a goal and it almost came through Bowen, who got on the end of a James Ward-Prowse free-kick but guided his header too high. Instead the goal arrived at the other end after Jarrad Branthwaite won the ball back for Everton in midfield and fed Calvert-Lewin. The former England forward played a one-two with Harrison before executing a Cruyff turn which left both Kurt Zouma and Nayef Aguerd flat-footed and firing low past Areola. It was Calvert-Lewin’s sixth goal in all competitions against the Hammers, the most he has scored against one single club. Everton almost doubled the lead when Zouma and Aguerd got in another tangle but Areola got down well to tip Aboulaye Doucoure’s shot wide. The closest West Ham came to an equaliser was a Said Benrahma volley which Pickford kept out at his near post to secure the points.","pubDate":"2023-10-29 15:22:44","image_url":"https://www.southwalesguardian.co.uk/resources/images/17382650/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c51269155fa80e0899c0bdd88faad03b","title":"Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia","link":"https://www.dailymail.co.uk/sport/boxing/article-12685075/Tyson-Fury-vs-Francis-Ngannou-LIVE-reactions-fallout-pundits-celebrities-Gypsy-King-secures-controversial-split-decision-victory-UFC-star-Saudi-Arabia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Recap Mail Sport's live blog for all the latest news and reactions after Tyson Fury controversially beat Francis Ngannou by split decision in Riyadh, Saudi Arabia","content":"Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia By Daniel Davis For Mailonline Published: 08:26 GMT, 29 October 2023 | Updated: 15:02 GMT, 29 October 2023 e-mail 30 shares 43 View comments Advertisement Recap Mail Sport's live blog for all the latest news and reactions after Tyson Fury controversially beat Francis Ngannou by split decision in Riyadh, Saudi Arabia. This live blog has now closed. 14:43 A recap We're set to round off this live blog now, but just as a reminder... Tyson Fury narrowly saw off Francis Ngannou in Saudi Arabia last night. Fury was knocked to the canvas in the third round before recovering. His next fight, against Oleksandr Usyk, is not expected to be in December. 14:06 More on the news Frank Warren has revealed Tyson Fury is 'unlikely' to face Oleksandr Usyk this year. After a controversial win over MMA fighter Francis Ngannou, Fury will most likely face Ukrainian fighter Usyk 'early next year' according to Warren. With discussions between the two undefeated fighters lasting almost a year, a fight between Fury and Usyk was eventually penned in September. Though with an original date of 23 December, it is looking more likely to be the start of 2024. You can find more details below. Tyson Fury is 'UNLIKELY' to face Oleksandr Usyk this year Frank Warren has revealed that Tyson Fury is 'unlikely' to face Oleksandr Usyk this year. Mail Online 13:14 Fury v Usyk update This will come as absolutely no surprise to many. 12:39 Fury's next fight When will Tyson Fury return to the ring? Who will his opponent be? Looking for the answers to these questions? Well, you're in luck! Follow the link below for all the details. When will Tyson Fury fight next after victory over Francis Ngannou? Tyson Fury avoided one of the biggest shocks in boxing history by the skin of his teeth against Francis Ngannou and next up is likely to be Oleksandr Usyk. Mail Sport has all the details. Mail Online 12:03 Super-fran! Francis Ngannou attempted a superman punch in the final round of the fight. Ngannou exceeded all expectations in the clash, dropping Fury with a clubbing left hook in the third round, and employing a measured approach. Heading into the tenth round Ngannou had the star-studded crowd in attendance behind him, and appeared to be building in confidence. Then, with less than a minute remaining in the bout, the former UFC star pumped a jab before launching into a superman punch that bemused the commentary team. For more details, click below. Francis Ngannou attempts a SUPERMAN PUNCH in his clash with Tyson Fury Ngannou exceeded all expectations, dropping Fury, and employing a measured approach throughout preventing Fury from landing any sustained offence. Mail Online 11:50 McGregor: Fury 'couldn't hold' Ngannou Conor McGregor has shared his thoughts on the heavyweight clash between Tyson Fury and Francis Ngannou. He lauded Fury for his performance, saying: 'Lovely shot that caught him on the back of the head, a bit off balance as well. 'Fair play to Tyson, he's a tough man as well. Strong chin. 'And Jesus, Ngannou is a powerful boy as well. Tyson couldn't hold him. He was just missing with that backhand.' Read more below. Conor McGregor says Tyson Fury 'couldn't hold' Francis Ngannou Conor McGregor shared his thoughts on the heavyweight clash between Tyson Fury and Francis Ngannou which saw the Gypsy King pick up a controversial victory. Mail Online 11:15 He has a point! Andy Murray has waded into the debate. 10:56 Fury split decision win 'a joke' Luke Campbell has hit out at Tyson Fury's 'joke' victory over Francis Ngannou and insisted the judges' scorecards are 'destroying the sport' after the controversy. 'What a joke that is. Destroying the sport,' Campbell wrote on his X account. A follow-up post read: 'I see a lot of excuses coming.' Do you agree with him? Let us know! Luke Campbell calls Tyson Fury's split decision win 'a joke' Former lightweight world title challenger Campbell wasn't impressed by the spectacle. 'What a joke that is. Destroying the sport,' Campbell wrote on his X account. Mail Online 10:32 Eubank Jr: Fury deserved to lose Chris Eubank Jr believes Tyson Fury deserved to lose his 'Battle of the Baddest' clash against Francis Ngannou in Saudi Arabia last night. Giving his take, Eubank Jr insisted the Gypsy King was lucky and that he didn't spend enough time in the gym gearing up before his controversial victory. He wrote on X: 'Watching from ringside I thought Ngannou won the fight. It was close but he was the aggressor, landed heavier shots & scored a knockdown. 'Fury deserved to lose after having so much trouble against a man who has never boxed before… too much time filming Netflix specials not enough time in the gym I'm guessing. Unlucky Francis.' For more details, click the link below! Eubank Jr insists Fury 'deserved to LOSE' against Ngannou Chris Eubank Jr believes Tyson Fury deserved to lose his 'Battle of the Baddest' clash against Francis Ngannou. Mail Online 10:15 Lewis questions Fury's camp Former heavyweight champion Lennox Lewis has questioned Tyson Fury's preparation for his crossover bout against former UFC fighter Francis Ngannou. Fury was awarded the win by split decision in Saudi Arabia yesterday but only after he had been knocked down in the third round by his impressive opponent. The Gypsy King's WBC heavyweight belt was not on the line in Riyadh, and he struggled to get to grips with Ngannou in a sluggish performance. Lewis, a three-time heavyweight champion, criticised Fury's approach to the fight. Check out his full quotes below. Lewis questions whether Fury had a full camp ahead of Ngannou fight Fury was awarded the win by split decision in Saudi Arabia on Saturday but only after he had been knocked down in the third round by Ngannou. Mail Online 09:50 Stats reveal Fury was deserving winner Punch stats Tyson Fury's controversial victory against Francis Ngannou have shed new light on their blistering showdown in Saudi Arabia last night. While Ngannou did enjoy arguably the most memorable moment of the fight, stats show that Fury landed more punches over the course of the ten rounds. According to Compubox, Fury landed 71 of his 223 total punches, while Ngannou managed to score with 59 from 231 attempted. Also, though Fury did enjoy the edge in total punches landed, Ngannou landed more power punches than the lineal heavyweight champion, with 37 to Fury's 32. Find out more below! Punch stats reveal who REALLY came out on top in Fury vs Ngannou Despite the massive disparity in boxing experience, the former UFC Heavyweight Champion defied all expectations in Saudi Arabia on Saturday. Mail Online 09:31 Ngannou set for top 10 ranking Francis Ngannou's head coach Dewey Cooper has claimed the president of the WBC said the former UFC champion will be ranked in the top ten heavyweights. Speaking outside the ring after the fight, Cooper was asked if there was any chance Ngannou would fight the likes of Deontay Wilder and Anthony Joshua. Cooper said: 'Mauricio Sulaiman, the president of WBC, said he is going to rank him in the top ten because he is better than most of the heavyweights in the top ten. 'He said that in the ring, so absolutely you'll see him again.' For more on this story, click below. Dewey Cooper claims WBC president will rank Ngannou in top ten Francis Ngannou's head coach Dewey Cooper has claimed the president of the WBC said the former UFC champion will be ranked in the top ten heayweights. Mail Online 09:10 Too many yes men? Billy Joe Saunders has suggested Tyson Fury has 'too many yes men' in his entourage after the Gypsy King scraped his victory over Francis Ngannou. On Instagram, Saunders said: 'Too many yes men in camp, not switched on from the [the] word go. But he [will] be switched on for the Ukrainian [Oleksandr Usyk].' Do you agree with his comments? Let us know! 09:00 Hearn: 'Ngannou won by two rounds' Eddie Hearn believes Francis Ngannou beat Tyson Fury 'by two rounds'. One judge scored the contest 95-94 in favour of Ngannou, while the other two controversially handed the fight to Fury 96-93 and 95-94. 'I am absolutely lost for words. Francis Ngannou has never boxed before and fair play to him, I didn't think he was overly impressive, but Tyson Fury looked like he'd never laced up a pair of gloves before,' Hearn told Matchroom's YouTube channel. 'He got dropped in the third round, he never threw a punch and Ngannou never threw a punch after. I thought Ngannou won by two rounds. Boxing world has gone mad.' You can read his full quotes below. Eddie Hearn claims Francis Ngannou beat Tyson Fury 'by two rounds' Hearn gave a scathing assessment of Fury and claimed his December heavyweight showdown with Oleksandr Usyk is dead. Mail Online 08:45 Usyk: 'Fury didn't take him seriously enough' Oleksandr Usyk wasn't quite sure what to make of Tyson Fury's largely unconvincing display, having sat at ringside in Riyadh to watch the chaos unfold. His head-scratching reaction after Fury crashed to the canvas was equally telling. 'I had an impression that he was playing. I'm not thinking about [whether he was playing possum] but I will be training 100 per cent,' Usyk told Fight Hub TV. 'But listen, it's boxing. Maybe it was the element of surprise. Maybe. I think it was [a] show.' Check out Usyk's full quotes below. Usyk suggests Fury didn't take Ngannou seriously enough The Ukrainian heavyweight champion sat at ringside in Riyadh to watch Fury ahead of their showdown in December and the Ukrainian didn't know how to read it. Mail Online 08:37 Jeff Powell's report Tyson Fury, his massive paymasters, the Kingdom of Saudi Arabia and the best laid plans of world heavyweight boxing were shaken to the roots before the Gypsy King staged the narrowest of escapes from the sensational loss of his unbeaten record. A single point on the third card of a split decision saved the hundreds of millions of dollars in waiting for Fury to dispute with Oleksandr Usyk and preserved a shot at the honour of becoming the first undisputed world heavyweight champion for more than a decade. The Ukrainian, holder of the other title belts not in the fiefdom of the Gypsy King, was sitting at ringside and how he must have been wishing this had been his night in the ring with a Fury as sluggish and disjointed as this. You can read Jeff's full report via the link below. Tyson Fury survives almighty scare to beat Francis Ngannou on points JEFF POWELL IN RIYADH: A single point on the third card of a split decision saved the hundreds of millions of dollars in waiting for Fury to dispute with Oleksandr Usyk. Mail Online 08:32 Fury survives! Wow! That was an absolute war. Welcome along to Mail Sport's coverage of all the reaction and fallout from Tyson Fury's controversial split decision victory over Francis Ngannou in Saudi Arabia. Fury was dropped by the mixed martial artist but clung on for an uneasy triumph. Who saw THAT coming? Key Updates Fury survives! View post TOP STORIES Punch stats reveal Tyson Fury WAS the deserved winner in controversial victory over boxing newbie Francis Ngannou in Saudi Arabia with the Gypsy King landing 12 more punches than his rival Eddie Hearn claims Francis Ngannou beat Tyson Fury 'by two rounds' and says heavyweight showdown with Oleksandr Usyk is DEAD after lacklustre display... as he boasts Anthony Joshua would easily knock out the Gypsy King Tyson Fury vs Francis Ngannou RECAP: All the reaction from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over his ex-UFC star opponent Lennox Lewis questions whether Tyson Fury had a full camp ahead of Francis Ngannou fight as boxing world reacts to the Gypsy King's underwhelming victory in Saudi Arabia LeBron James blasts Tyson Fury's split-decision win over Francis Ngannou after the 'Gypsy King' suffered a third-round knockdown in suspect victory: 'Exactly why I don't watch boxing!' Tyson Fury is 'UNLIKELY' to face Oleksandr Usyk this year, reveals promoter Frank Warren as Gypsy King 'needs time' after Francis Ngannou gave 'one of the toughest fights of the last decade' Tyson Fury survives an almighty scare against boxing newcomer Francis Ngannou... as the Gypsy King battles back from third round knock down to secure a split decision victory on the judges scorecards Cristiano Ronaldo, Kanye West and Conor McGregor are among the famous faces in Saudi Arabia for Tyson Fury's Battle of the Baddest fight against Francis Ngannou Francis Ngannou KNOCKS DOWN Tyson Fury in the third round - after cutting him one round earlier - as former UFC champion stuns sports fans with his display against the champion Conor McGregor reveals he's held talks with Saudi Arabia over a BOXING match against Manny Pacquiao… as he confirms he WILL make a near three-year UFC return in April 2024 Luke Campbell calls Tyson Fury's controversial split decision victory over Francis Ngannou 'a JOKE' and says the Gypsy King will have 'a lot of excuses' coming after hugely unconvincing display World champion accepts Tyson Fury challenge after Gypsy King claimed brother Tommy Fury is 'the money fight' for boxing's biggest stars: 'I'd happily beat the c**p out of him' Inside Francis Ngannou's stunning car collection with former UFC champion boasting a £421k Rolls Royce Phantom and £270k Ghost Sadio Mane, Cristiano Ronaldo and Allan Saint-Maximin are among the footballers at Tyson Fury vs Francis Ngannou - with fellow Saudi Pro League stars Aymeric Laporte and Franck Kessie also in attendance Francis Ngannou attempts a SUPERMAN PUNCH in the tenth round of his clash with Tyson Fury... after knocking down the WBC Heavyweight Champion earlier in the fight Kanye West wears Premier League kit to Tyson Fury vs Francis Ngannou super fight - but team does the shirt belong to? Fans are trying to figure out the owner of the black shirt with yellow trim Heartwarming footage shows Cristiano Ronaldo asking Israel Adesanya for an update on Alex Volkanovski after the Aussie's brutal knockout and mental health concerns Boxing fans claim Francis Ngannou was 'ROBBED' of win against Tyson Fury as judges rule Gypsy King as the winner by split decision, despite Ngannou knocking Fury down in third round Lennox Lewis insists he would've beaten Tyson Fury in a battle of legendary British heavyweights... as he reveals the game plan the late Emanuel Steward would have given him to face the Gypsy King Rio Ferdinand claims Cristiano Ronaldo left his peers starstruck at the gala ahead of Tyson Fury vs Francis Ngannou - where names like Kanye West and Eminem were present - insisting 'there's superstars and then there's this guy' Fabio Wardley knocks out David Adeleye in the seventh-round in British heavyweight title grudge match on the Tyson Fury vs Francis Ngannou undercard Tyson Fury tells Cristiano Ronaldo he's 'the greatest footballer that has ever lived' - snubbing Lionel Messi - as they embrace at Champions Gala in Riyadh ahead of 'Battle of the Baddest' with Francis Ngannou Mike Tyson hilariously bites back at a reporter after Battle of the Baddest fight between Tyson Fury and Francis Ngannou - but claims the former MMA star WASN'T robbed despite his defeat Oleksandr Usyk suggests Tyson Fury didn't take Francis Ngannou seriously enough after Gypsy King's unconvincing split decision win... as Ukrainian's reaction to shock third round knockdown is revealed Amir Khan tells fan to 'shut the f**k up' after being ridiculed for awkward video where he gifts rap star Eminem a limited edition watch and wraps it on his wrist for him Cristiano Ronaldo is seemingly BOOED by spectators as he takes his seat ringside to watch Tyson Fury take on Francis Ngannou in Riyadh... or are they paying homage to an iconic sui celebration? Fury vs Ngannou: Israel Adesanya in line for over £100,000 payout after placing $20,000 on Gypsy King to be KO'd by 'The Predator' in the Battle of the Baddest - as former UFC champ embraces Cristiano Ronaldo before Riyadh showdown When is Tyson Fury's next fight and who will be his opponent after the Gypsy King's split decision victory against Francis Ngannou? The rise of Francis Ngannou: From walking six miles to school in Africa to sleeping rough in Paris and borrowing money to LIVE - even after becoming a UFC champion - 'The Predator' has hit the big time with Tyson Fury fight Tyson Fury and Oleksandr Usyk share unexpected embrace ahead of his Battle of the Baddest fight against Francis Ngannou after the date announcement for their Christmas clash Tyson Fury threatens to SUE Oleksandr Usyk as he sets a hard deadline for their heavyweight unification fight Francis Ngannou's trainer Dewey Cooper claims WBC president will rank the former UFC champion in top 10 heavyweights after fight against Tyson Fury Tyson Fury breaks silence on missing birth of seventh baby with wife Paris Fury: 'Daddy's gotta do what daddy's gotta do' Fans slam 'pure trash' opening ceremony ahead of Tyson Fury's 'Battle of the Baddest' fight against Francis Ngannou, claiming they 'came for a scrap not a concert' Conor McGregor says Tyson Fury 'couldn't hold' Francis Ngannou and marvels at his former UFC peer's formidable power as he fuels Oleksandr Usyk v Fury rumours for next clash Cristiano Ronaldo, Lionel Messi and Kylian Mbappe move over! Meet the Roman athlete who's '£15BILLION fortune' eclipses the wealth of football's elite at the top of 2023's sports rich list Lennox Lewis claims 'I thought Tyson Fury WON' his fight against Francis Ngannou, despite being knocked to the canvas in the third round with the three-time heavyweight champion claiming 'this was like a warm-up fight' A topless face-off with Mike Tyson, trashing a stage, headbutting a glass wall - and lashing out at KSI: The bizarre pre-fight antics of Tyson Fury's hellraising father John - as bemused fans brand him 'the most embarrassing man on the planet' Tyson Fury addressed prime minister Rishi Sunak with emotional knife crime plea after cousin was stabbed to death Tyson Fury has an estimated £130m net worth and a five-inch height advantage on Francis Ngannou, but the former UFC champ's £421k Rolls Royce is worth more than the Gypsy King's cars and his punches can reach further! TALE OF THE TAPE for Saturday's fight Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury Chris Eubank Jr insists Tyson Fury 'deserved to LOSE' against Francis Ngannou... as he claims the victorious Gypsy King had spent 'too much time filming Netflix specials rather than in the gym' John Fury furiously warns KSI he will 'hound him to DEATH and ruin his career' if the YouTube star doesn't pay up £200,000 after losing bet in his boxing defeat against his son Tommy Tyson Fury weighs in heavier than Francis Ngannou ahead of their Battle of the Baddest clash in Saudi Arabia... with the Gypsy King tipping the scales at 277lbs - nine pounds more than his weight ahead of victory over Derek Chisora last December Tyson Fury looks in lean shape after cutting down his 'love handles' in a remarkable body transformation in just seven weeks before fighting Francis Ngannou Manny Pacquiao confirms that he is 'working' on a fight with Amir Khan to take place next year... as the boxing legend also says he hopes to compete at the Paris 2024 Summer Olympics Joseph Parker KNOCKS OUT Simon Kean with a sensational third-round uppercut on the Tyson Fury vs Francis Ngannou undercard as the former WBO champion improves to 3-0 in 2023 Tyson Fury's face is left battered and bruised after his split decision victory over Francis Ngannou... while the former MMA star looks fine despite defeat Man United 0-1 Man City - Premier League LIVE: Erling Haaland scores a penalty to give visitors the lead in the Manchester derby Liverpool 3-0 Nottingham Forest: Reds cruise to comfortable win at Anfield with Diogo Jota, Darwin Nunez and Mo Salah finding the net Premier League LIVE: Diogo Jota, Darwin Nunez and Mo Salah give Liverpool 3-0 lead over Forest while high-flying Aston Villa take control against Luton and Joao Palhinha draws Fulham level at Brighton Former Canadian tennis star Eugenie Bouchard joined by friends to show off incredible physique dressed in lacey catwoman outfit for Halloween CHRIS FOY'S RUGBY WORLD CUP HIGHLIGHTS: Portugal's progress gets Cristiano Ronaldo's seal of approval, Antoine Dupont's injury grips a nation, Fiji steal hearts and was France vs South Africa the greatest Test EVER? Jamie Carragher jokes the 'prawn sandwich brigade' have taken their seats at Old Trafford as the Liverpool legend pokes fun at Roy Keane ahead of the Manchester derby Eddie Jones labelled 'pathetic' by Sir Clive Woodward after Australian likened coaching the Wallabies to 'eating s***' as England legend urges Japan NOT to hire outgoing boss Olympiacos' fierce derby with Panathinaikos is abandoned after a player is struck by a FIREWORK while warming up on the touchline - as his team-mates refuse to return from the dressing room to finish the clash Joey Barton is SACKED as manager of Bristol Rovers, hours after he called rival boss Steve Evans a 'fat man' and a 'weeble' in his final game which left the team stuck 16th in League One Southampton 3-1 Birmingham: Wayne Rooney suffers a third successive defeat since taking charge of the Blues as the Saints cruise to victory Harry Kane scores incredible goal FROM HIS OWN HALF as he hits a hat-trick with Bayern Munich hitting EIGHT second-half goals in thrashing of Darmstadt - with three players sent off! Carlo Ancelotti says Jude Bellingham can 'easily reach 20-25 goals' for Real Madrid this season after the 20-year-old 'veteran' scored twice in their 2-1 win over Barcelona Sheffield United break record for the worst EVER start to a Premier League season after Arsenal defeat... with Paul Heckingbottom's side picking up just one point from their first 10 games England boss Shaun Wane labels Tonga 'disgraceful' after 14-4 victory over the Pacific Islanders to clinch series win in Huddersfield Eddie Jones resigns as Australia boss after disastrous Rugby World Cup campaign England could MISS OUT on 2025 ICC Champions Trophy if they don't finish in the top seven rankings of the ongoing ODI World Cup Aston Villa 3-1 Luton Town: Ruthless Villa put the Hatters to the sword as McGinn, Diaby and a Lockyer own goal seal win Diogo Jota holds up Luis Diaz No 7 shirt as he dedicates goal against Nottingham Forest to Liverpool team-mate whose parents were kidnapped in Colombia West Ham 0-1 Everton: Dominic Calvert-Lewin scores his 50th Premier League goal to secure Toffees win as they remember Bill Kenwright Erik ten Hag reveals Man United defensive duo Jonny Evans and Victor Lindelof were given the nod over Raphael Varane for the Manchester derby for 'TACTICAL reasons' Travis Kelce 'wants KIDS with Taylor Swift in the next year or so' and she is 'all in' on the plans - and the Chiefs star has also spoken about marrying the singer as whirlwind romance hots up BREAKING NEWS: The mother of Liverpool star Luis Diaz 'has been rescued from a kidnapping in Colombia by assailants on motorcycles' - but the player's father is still missing New Zealand 11-12 South Africa - Rugby World Cup final LIVE: Springboks RETAIN their crown after nerve-shredding finish in Paris... as they become first side to lift trophy for a fourth time EXCLUSIVE: No Taylor = Sad Travis! Glum-faced Kelce is spotted at the Chiefs' hotel in snowy Denver as he prepares to face the Broncos WITHOUT his popstar girlfriend watching on from the stands Springboks reign once more! South Africa retain their World Cup crown after nerve-shredding 12-11 win over New Zealand in Paris - their third consecutive victory by just ONE point... as they become first side to lift trophy for a fourth time Robbie Fowler is sacked by Saudi side Al-Qadsiah after four months despite an unbeaten start... with the former Liverpool star named manager of the month in September! Travis Kelce dances to Taylor Swift classic 'Love Story' in Texas bar and sends the Swifties wild with viral video after watching the Rangers win their World Series game Son who stabbed AFL coach father Phil Walsh to death in frenzied knife attack is back in full detention after decline in his mental health OLIVER HOLT: Jude Bellingham is Il Fenomeno, the King of Madrid and the impact he is having in Spain feels almost other-worldly after El Clasico heroics... he is only 20 yet he is taking European football by storm Novak Djokovic and Rita Ora among celebrities spotted at Rugby World Cup final as Mika performs in France, for New Zealand v South Africa clash Gillingham fan is arrested and given a lifetime ban after vile racist gesture targeting Newport County goalscorer Omar Bogle... just weeks after the club was handed a £12K fine by the FA for racist and sexist chanting Barcelona 1-2 Real Madrid: Jude Bellingham scores sensational double, hitting a 25-yard SCREAMER before finding the back of the net in injury time to help Carlo Ancelotti's side seal dramatic comeback victory to go top of LaLiga Nick Riewoldt makes major family announcement after leaving Australia for the United States: 'I missed the footy season this year' For as long as I can remember the RFU has been far too cozy, it needs shaking up if England are to win another Rugby World Cup... it's left field, but they must hire South Africa's genius coach Rassie Erasmus TNT Sports' coverage of Tyson Fury's huge crossover clash with Francis Ngannou goes DOWN just 40 minutes into the show, leaving fans furious after paying £21.95 for the fight Barcelona 1-2 Real Madrid - RECAP: Jude Bellingham scores last-gasp winner for Carlo Ancelotti's side as his heroic second-half brace sees visitors edge to victory in El Clasico World Series matchup between wildcards Texas Rangers and Arizona Diamondbacks prompts MLB to re-examine playoff format... but commissioner Rob Manfred isn't rushing to make changes Taylor Swift made the first move in Travis Kelce romance and 'cautiously reached out' when she heard how he failed to give her his number at Kansas City Eras show Taylor Swift now can't cheer Travis Kelce on in the NFL until DECEMBER - and Eras tour dates mean she WON'T be at the Super Bowl in February if the Kansas City Chiefs make it that far Luis Diaz left out of Liverpool squad for clash against Forest after his parents were kidnapped in Colombia, while authorities 'continue the search' for Reds star's father after his mum was rescued and freed Kansas City Chiefs star Travis Kelce is spotted dancing to Taylor Swift's 'Shake it Off' at Game 1 of the World Series WITHOUT pop star girlfriend An early childhood teacher, a farm manager and an accountant turned influencer... meet the All Blacks wives and partners cheering on their side as New Zealand and South Africa battle for the Rugby World Cup EXCLUSIVE: OJ Simpson looks unrecognizable as the frail NFL legend, 76, is spotted carrying groceries in Las Vegas... 28 years after being acquitted in the 'Trial of the Century' Joe Marler tells former England star to 'eat s*** after the prop was accused of 'showing a lack of respect' by snubbing Sir Bill Beaumont... as he collected his Rugby World Cup bronze medal Wolves 2-2 Newcastle - Premier League RECAP: Hwang Hee-chan twists and turns in the Magpies area before firing home fine equaliser... as Gary O'Neill's side pull themselves level to secure a point at Molineux RIATH AL-SAMARRAI: Alejandro Garnacho's tweet about Andre Onana which featured two gorilla emojis wasn't malicious... but the Man United youngster must be charged by the FA Harry Kane humbly claims his halfway line goal in Bayern Munich hat-trick 'one of the better ones in my career' as he soaks up the praise for stunning contribution to 8-0 thrashing in Bundesliga EXCLUSIVE: Paul Heckingbottom could be sacked THIS WEEKEND if Sheffield United lose at Arsenal... with former Blades boss Chris Wilder in line to replace him Arsenal 5-0 Sheffield United: Eddie Nketiah nets his first Premier League hat-trick as the Gunners cut the gap to Tottenham to two points - with Fabio Vieira and Takehiro Tomiyasu also scoring Travis Kelce is filmed receiving copious amounts of friendship bracelets from Taylor Swift fans at her Eras Tour months BEFORE he began dating the singer Saudi Arabia UFC Fighting Tyson Fury Share or comment on this article: Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia e-mail 30 shares Terrible fight and wrong winner. Fury looked all f... by hahapoo 50 Add comment Comments 43 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-29 15:02:18","image_url":"https://i.dailymail.co.uk/1s/2023/10/29/08/77135991-0-image-a-4_1698567198518.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3f1b8e8f043105e7f1ccd5850e3c2561","title":"Amir Khan caresses Mike Tyson's hands as confused boxing fans say 'this is just weird'","link":"https://www.dailystar.co.uk/sport/football/amir-khan-caresses-mike-tyson-31308548","keywords":["Sport"],"creator":null,"video_url":null,"description":"Amir Khan had boxing fans confused as the former boxer filmed himself caress the hand of Mike Tyson before the fight between Tyson Fury and Francis Ngannou","content":"A video of caressing the hand of had fans both confused and weirded out by the strange interaction. The former boxers were among the star-studded attendees for the mega-fight between Tyson Fury and Francis Ngannou, which was . The 35-year-old won by split decision, in the third round by the former UFC heavyweight, who looked at home in the boxing ring despite it being his debut. Prior to the battle between the two fighters, there was plenty of mingling between icons of sport as Amir Khan enjoyed a wholesome but bizarre moment with Mike Tyson. In a video the 36-year-old posted on his Instagram Stories, the Bolton-born brawler was caressing Tyson's hand as he seemed in awe with it as he asked the American: \"How many people you knock out with this?\" The former undisputed heavyweight champion replied: \"I don't know, 48 but 200 in the street,\" before the pair enjoyed a laugh together. Fans on social media certainly saw the quirky side to Khan's constant rubbing of Tyson's right hand as one X user wrote: \"Why did he hold his hand for so long?!\" while another bluntly stated: \"this is just weird\". Another suggested that Khan may have been in for a punch as they said: \"We all know Mike doesn’t like being touched like that, he probably had that intrusive thought to add +1 KO to the record.\" It wasn't the pair's first interaction in Saudi Arabia as the New York native made an impromptu appearance in one of Khan's interviews during the weekend. During an interview with talkSPORT, Tyson and his entourage walked through which brought a brief pause on the interview which Khan saw the funny side to as he said: \"Hey listen, when Mike Tyson's walking through, you don't want to stand in front of Mike Tyson.\" He jokingly added: \"He might punch you! When you've got walking through you, I'm like, 'Mate, let him go' because you don't wanna get hit by him. You don't wanna be in his way basically.\"","pubDate":"2023-10-29 14:55:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309008.ece/ALTERNATES/s98/1_Amir-Khan-caresses-Mike-Tysons-hands-as-confused-boxing-fans-say-this-is-just-weird.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8db7fd42cc12433b220b45634bf5ff2a","title":"Liverpool players pay perfect tribute to Luis Diaz during winger's family kidnap ordeal","link":"https://www.mirror.co.uk/sport/football/news/luiz-diaz-kidnap-parents-liverpool-31309118","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Mark Jones)"],"video_url":null,"description":"Luis Diaz was absent from the Liverpool side for Sunday's clash with Nottingham Forest at Anfield after his parents were kidnapped in Colombia on Saturday, with his father still missing","content":"Diogo Jota and Liverpool's players showed team-mate Luis Diaz that he was on their minds as they celebrated their first goal against Nottingham Forest in the wake of their absent winger's terrifying family kidnap ordeal. Jota slotted home in the 31st minute of the clash at Anfield after Forest goalkeeper Matt Turner had parried an effort from Darwin Nunez. The Portuguese, who had effectively come into Liverpool's Premier League side for Diaz, was all alone at the back post and slotted in with ease. The forward then ran towards the Reds bench with his team-mates and picked up a Diaz No.7 Liverpool shirt, holding it aloft to the crowd. Liverpool supporters responded by singing Diaz's name as they showed him that he was very much on their minds. Luis Diaz's parents' kidnapping: Latest news as Liverpool star misses match after \"tough night\" Jurgen Klopp speaks out on Luiz Diaz's \"worrying situation\" after parents' kidnapping Diaz was absent from Liverpool's matchday squad on Sunday after his parents were kidnapped in his native Colombia on Saturday evening. His mother, Cilenis Marulanda, was quickly rescued, however his father is still reported missing. Liverpool said in a statement on Sunday: \"Liverpool Football Club can confirm it is aware of an ongoing situation involving the family of Luis Diaz in Colombia. It is our fervent hope that the matter is resolved safely and at the earliest possible opportunity. In the meantime, the player’s welfare will continue to be our immediate priority.\" Jota and Liverpool's players paid tribute to their team-mate ( Image: AFP via Getty Images) Reds boss Klopp, asked about the situation ahead of the match, said: \"We had to obviously make a late change because of the private situation involving Luis Diaz. It's a worrying situation for all of us and it was a pretty tough night. I have never had that before. It's a new experience I never needed.\" Authorities in Colombia are working hard to help find Diaz's father, with the player being kept abreast of the latest situation. The Colombian attorney General's office also said in a statement: \"From the moment when Colombia's General Prosecutor's Office learned of the kidnapping of the parents of Colombian player Luis Díaz in the Barrancas area of La Guajira, a specialist team of prosecutors, CTI (Technical Investigation Team) officials and investigators from the police and military have been taking urgent action to locate these individuals, clarify the chain of events and identify the culprits.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-10-29 14:49:45","image_url":"https://i2-prod.mirror.co.uk/incoming/article31309153.ece/ALTERNATES/s615/0_Liverpool-v-Nottingham-Forest-Premier-League-Anfield.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bad5fdad8d700829f088541a6ab5d363","title":"Three things Jurgen Klopp got right as Liverpool ease to victory over Nottingham Forest","link":"https://www.dailystar.co.uk/sport/football/jurgen-klopp-liverpool-prem-victory-31309357","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool eased to a comfortable win over Nottingham Forest which makes it back-to-back Premier League wins for Jurgen Klopp and his side","content":"secured a 3-0 victory against Nottingham Forest in the in a game they dominated for large parts of it. Diogo Jota opened the scoring for the home side after tapping in from close range as Matt Turner could only parry Darwin Nunez's efforts. The Uruguayan finally made his way on the scoresheet four minutes later after latching onto Dominick Szoboszlai's pass. Mohamed Salah made it three after Matt Turner was caught in no man's land leaving the Egyptian to score into an empty net. The victory - which is Liverpool's second in a row since earlier this month - lifted them above into third in the Premier League but a win for Pep Guardiola's side in the Manchester derby on Sunday afternoon (October 29) will lift the reigning champions above Liverpool. had to do without Luis Diaz after the which meant he was left out of the squad with Jota taking his place in the starting line-up as the Portuguese star by lifting his number seven shirt after scoring the opener. The absence of Diaz as well as several continuing injuries and a didn't hamper Liverpool as takes a look at the things Klopp got right during the game. The Uruguyuan endured a difficult first season at the club having been found guilty of missing a plethora of guilt-edge chances. His overall play was lacking at many times last year as fans began wondering whether Nunez was the future of the team's strikeforce. Despite beginning the season as second-fiddle to Cody Gakpo, the 24-year-old fought his way back into the starting line-up and has netted six goals in all competitions this season including the second in their 3-0 win against Nottingham Forest on Sunday (October 29). His protection of the ball, improving build-up play and goal-scoring instincts were all on show in Liverpool's victory as he continues going from strength to strength under Jurgen Klopp. Klopp's current squad may just be the best he's had at Liverpool since arriving at the club in 2015 and has allowed him to rotate his squad without having to make a compromise on quality. Keeping top players happy when they may not start every game is an underrated quality in a manager and an attribute Klopp has in abundance. The likes of Diogo Jota, Cody Gakpo and Harvey Elliott may not be the first names on the team-sheet but they remain an important part of Liverpool and Jota's goals as well as the positive cameos of Elliott and Gakpo just goes to show how the Liverpool boss has perfected the morale of his team. The Liverpool boss had been criticised by some by not starting Ibrahima Konate in Liverpool's 5-1 victory over Toulouse in the Europa League on Thursday (October 26). The French international has only played just 378 minutes of Premier League action this season after playing just 18 games in the 2022/23 campaign. Klopp shared his frustrations about Konate's injury issues in an interview with where he said: \"I love absolutely everything about Ibou, but the problem is Ibou had injury problems from time to time and Mr Deschamps played him 90 and 87 minutes in the two games (for France).\" He's been careful with overplaying the defender but started him in Liverpool's 3-0 win on Sunday where he put in a faultless performance and earned a clean sheet.","pubDate":"2023-10-29 16:05:09","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309541.ece/ALTERNATES/s98/1_Liverpool-FC-v-Nottingham-Forest-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5658017f25634cc17eb731a6e9e07a94","title":"Claudio Ranieri performs 'greatest miracle of career' as Serie A side make history","link":"https://www.dailystar.co.uk/sport/football/claudio-ranieri-cagliari-serie-a-31309295","keywords":["Sport"],"creator":null,"video_url":null,"description":"He might be 72, but Claudio Ranieri is still capable of creating moments of magic like the one he did with Leicester City - inspiring his Cagliari side to a stunning 4-3 victory","content":"Claudio Ranieri's Cagliari made history as they came back from 3-0 down to win in the sixth minute of stoppage time. Former boss Ranieri has endured a struggling start to the season in Sardinia with his newly-promoted side, heading into Sunday's (October 29) home clash with Frosinone winless in their first nine games. It looked like things were going to go from bad to worse for the Tinkerman when the visitors headed into the break two to the good, with Cagliari midfielder Marco Mancosu also missing a penalty to add to their woes. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Frosinone's Marco Brescianini made it three less than four minutes after the restart and it looked to be game over. But some inspired changes by Ranieri turned the tide in remarkable fashion. Leonardo Pavoletti set up fellow substitute Gaetano Oristanio to draw one back with a little under 20 minutes to go, then Antoine Makoumbou reduced the deficit to just one shortly after. Striker Pavoletti then became the hero, first levelling in the 90+4th minute before he found a dramatic last-gasp winner. A VAR check left hearts in mouths, but the goal stood and Ranieri was soon celebrating victory with his players. It's the first time in Serie A history that a team has fought back from 3-0 to win after the 70th minute, with one fan suggesting: \"The greatest miracle of Claudio Ranieri’s career?!\" Another hit back: \"No bigger miracle than Leicester league champions.\" While one added: \"Second greatest.\" Others were chuffed to see Ranieri get back to winning ways. \"It feels so good to watch him succeed wherever he goes. Good things happens to good people,\" hailed one, and another commented: \"He's the miracle man!\"","pubDate":"2023-10-29 16:00:23","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309472.ece/ALTERNATES/s98/0_Cagliari-Calcio-v-Frosinone-Calcio-Serie-A-TIM.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"71ae6f311922e7f2acbf303c6ccd0b2f","title":"Palhinha stunner earns Fulham draw at Brighton","link":"https://www.skysports.com/football/brighton-and-hove-albion-vs-fulham/report/482684","keywords":null,"creator":null,"video_url":null,"description":"Joao Palhinha hit a stunning second-half equaliser to earn a point for Fulham in a 1-1 draw at Brighton.","content":"Joao Palhinha hit a stunning second-half equaliser to earn a point for Fulham in a 1-1 draw at Brighton. Fulham then survived a late onslaught to maintain their unbeaten record against the Seagulls from all seven of their Premier League meetings. Roberto De Zerbi made six changes from Brighton's Thursday night victory over Ajax and his refreshed side dominated possession in the first-half as Evan Ferguson expertly slotted home in the 26th minute. However Fulham began to wear the hosts down and became bolder with their approach in the second period before Palhinha crashed a wonderful effort from the edge of the box high into the net. Brighton: Steele (7), Julio (7), Webster (7), Dunk (7), Dahoud (7), Gross (7), Lallana (6), Baleba (6), Mitoma (7), Adingra (6), Ferguson (7). Subs: Fati (6), Gilmour (6), Buonanotte (6), Veltman (6), Pedro (n/a). Fulham: Leno (7), Bassey (7), Reed (6), Jimenez (6), Ream (7), Decordova-Reid (6), Willian (6), Castagne (7), Iwobi (7), Palhinha (8), Robinson (6). Subs: Pereira (6), Muniz (6), Wilson (6), Cairney (n/a), Lukic (n/a) Player of the Match: Joao Palhinha Brighton dominated possession from the outset and had Bernd Leno to thank for flying to his left to push away Carlos Baleba's shot from the edge of the box and then deny Simon Adingra from close range. Baleba, Adingra and Kaoru Mitoma all shot off target within four minutes of each other as the Brighton onslaught continued. Fulham kept giving possession back to the hosts and Joao Palhinha showed his frustration, catching Pascal Gross in the face with a stray arm that went unpunished. Brighton, though, finally went ahead when Igor Julio intercepted Harrison Reed's forward pass and the centre-back found gross, who moved it on to Ferguson and he coolly guided a low shot into the bottom left corner. Live Premier League table Premier League results Watch Premier League highlights Get Sky Sports Fulham did improve in the final stages of the first-half although it took Lewis Dunk hitting the crossbar from a free-kick shortly after the break and then the introductions of Andreas Pereira, Rodrigo Muniz and Harry Wilson to really spark them into life. Brighton were being overrun in midfield as Fulham pushed higher up the pitch to stop them playing out from the back and it was Alex Iwobi who won the ball deep in the home side's half before finding Wilson, who teed up Palhinha to slam a perfect strike into the top right corner. Muniz then saw his clever close-range flick saved by Jason Steele with Brighton wobbling. However, the hosts recovered for the final 10 minutes, seeing substitute Ansu Fati denied by Leno and had a certain goal prevented by Antonee Robinson from Adam Webster's header. Play Fantasy Premier League and see more stats here Brighton are back in action next Saturday with a trip to Everton , kick-off 3pm. They then travel to Ajax on Thursday November 9 in the Europa League, kick-off 5.45pm. Meanwhile, Fulham face a trip to Ipswich in the Carabao Cup fourth round on Wednesday, kick-off 7.45pm. They then host Man Utd on Saturday November 4, kick-off 12.30pm. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-29 16:00:00","image_url":"https://e0.365dm.com/23/10/1920x1080/skysports-premier-league-fulham_6340557.jpg?20231029154150","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3a72fc9ed84c6822cc08955b77f59bf3","title":"Francis Ngannou attempted 'superman punch' on Tyson Fury on advice of Mike Tyson","link":"https://www.dailystar.co.uk/sport/boxing/fury-ngannou-superman-mike-tyson-31309074","keywords":["Sport"],"creator":null,"video_url":null,"description":"Boxing legend Mike Tyson told UFC star Francis Ngannou to use a 'superman punch' on Saturday night when he faced off against heavyweight champion Tyson Fury in Saudi Arabia","content":"revealed ringside that he told UFC star Francis Ngannou to do a 'superman punch' against . Ngannou, fighting in what was his professional debut, went up against heavyweight world champion Fury in Saudi Arabia on Saturday night . Fury had described the contest beforehand as if Ngannou were a table tennis player taking on Novak Djokovic. However, come round 10, when Ngannou launched into his superman punch, there was no doubt that Fury could not have been more wrong. In the third round of the fight that went the distance, the 37-year-old UFC brawler landed a monstrous blow on Fury . The huge blow stunned Fury, who struggled to regain his composure immediately after, with Ngannou looking increasingly confident - clearly enough to attempt to land the 'superman punch' right at the end of the bout. Sadly for Ngannou, he didn't make a solid connection with him punch. But that didn't stop boxing legend Mike Tyson from revealing ringside during the 10th round that he had told Ngannou to pull it out in Saudi Arabia. \"Oh, Superman punch, superman punch, that's how they do it in the UFC,\" Tyson can be heard saying on an Instagram story uploaded to his account. \"You teach him that?\" asked the individual filming Tyson, to which the legendary boxer replied: \"Not that one, nah. I told him to use it though!\" Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Even the Blonde Bomber, Ebanie Bridges, was ecstatic to see Ngannou pull out the superman punch. Taking to social media the day after the fight in Saudi Arabia, Bridges wrote: \"I wish that superman punch from @francis_ngannou landed properly lastnight… imagine that. it woulda been epic… KO by superman punch.\" However, moments after the tenth round, it was revealed Fury had somehow won the fight via split decision, something which caused uproar on social media. Having talked about how Ngannou would have no chance in the ring against him, Fury was left embarrassed. And his fight against Ngannou . While the fight has been agreed to, promoter Frank Warren announced after the battle in Saudi Arabia that Fury would need time to heal, making it more like he and Usyk face off around the beginning of 2024.","pubDate":"2023-10-29 15:43:10","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309323.ece/ALTERNATES/s98/2_F9m5Bz3WoAM4znR-1jpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"90b6018d30b81387eedfaf15be908253","title":"Gerwyn Price 'bottles' 7-0 lead as Danny Noppert launches incredible comeback to win","link":"https://www.dailystar.co.uk/sport/darts/darts-gerwyn-price-danny-noppert-31309393","keywords":["Sport"],"creator":null,"video_url":null,"description":"Darts fans have been left shocked as Gerwyn Price \"bottled\" a 7-0 lead in the European Championships as he lost to Danny Noppert in an amazing comeback performance","content":"fans have been left shocked as Danny Noppert launched an incredible comeback win against . Noppert had found himself 7-0 down in a race to ten at the European Championships, and seemingly crashing out to the Welsh superstar. However, Price would only go onto claim one more leg as Noppert landed seven 180s on his way to winning 10-8. The Dutchman has won legions of fans in Dortmund, and he joked earlier in the week: \"I'm not the really boring player that everyone thinks. But sometimes I just need to keep calm. If I'm celebrating too hard, adrenaline goes too high and then sometimes I can struggle.\" Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month \"That is astonishing! Even more astonishing that Price actually missed 3 darts from 28 for a 9-3 lead,\" one fan said. While a second replied: \"Huge bottle that!\" \"Wow wow wow...this is why darts is the greatest sport,\" a third said. And another added: \"Two excellent quarter finals the next two have a lot to live up to!\" Price was caught in two minds about travelling to Germany for the tournament, with the finals clashing with his daughters birthday. He explained: \"I want to be here, then I don't want to be here. There's things going on at home. \"It's my daughter's birthday this weekend so I'd rather be home than be here. I was caught in two minds so it's one of those things.\"","pubDate":"2023-10-29 15:34:59","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309428.ece/ALTERNATES/s98/0_danny-2.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f2b4453859656cc71c932805afbadf37","title":"Dominic Calvert-Lewin strike gives Everton victory at West Ham","link":"https://www.northwalespioneer.co.uk/sport/national/23886999.dominic-calvert-lewin-strike-gives-everton-victory-west-ham/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Calvert-Lewin’s goal was his 50th in the Premier League for Everton.","content":"Everton ended a difficult week on a positive note as Dominic Calvert-Lewin fired them to a 1-0 win at West Ham. The Toffees were playing their first match since the death of chairman Bill Kenwright on Monday at the age of 78. It had been emotional week, too, for Hammers manager David Moyes, who formed a close friendship with Kenwright during his 11-year spell in charge at Goodison Park. But while West Ham slumped to a third defeat in eight days following reverses at Aston Villa and in the Europa League at Olympiacos, Everton were able to put some more breathing space between themselves and the bottom three with a second away win of the season. Calvert-Lewin’s goal was his 50th in the Premier League for Everton, joining Romelu Lukaku, Duncan Ferguson and Tim Cahill in reaching the half-century. It came six minutes into the second half after a first half that will not live long in the memory. West Ham created an early opportunity when Lucas Paqueta skilfully lifted the ball over Nathan Patterson and drilled in a low cross which Jarrod Bowen could only slice wide. Moments later Paqueta showed the side of his game which so infuriates Moyes, gifting the ball to Jack Harrison who burst through only to fire too close to Hammers keeper Alphonse Areola. Ghana winger Mohammed Kudus, making first Premier League start for West Ham, showed he is already getting used to the darker arts of English football after he was chopped down by James Tarkowski. As Jordan Pickford raced out of his goal to tell the youngster to get up, Kudus shoved the England keeper away in a skirmish which earned both a booking. Calvert-Lewin had his first chance from Vitalii Mykolenko’s cross but the striker headed over. A torturous half was summed up by the audible sigh which echoed around the London Stadium when five minutes of stoppage time was announced. The game desperately needed a goal and it almost came through Bowen, who got on the end of a James Ward-Prowse free-kick but guided his header too high. Instead the goal arrived at the other end after Jarrad Branthwaite won the ball back for Everton in midfield and fed Calvert-Lewin. The former England forward played a one-two with Harrison before executing a Cruyff turn which left both Kurt Zouma and Nayef Aguerd flat-footed and firing low past Areola. It was Calvert-Lewin’s sixth goal in all competitions against the Hammers, the most he has scored against one single club. Everton almost doubled the lead when Zouma and Aguerd got in another tangle but Areola got down well to tip Aboulaye Doucoure’s shot wide. The closest West Ham came to an equaliser was a Said Benrahma volley which Pickford kept out at his near post to secure the points.","pubDate":"2023-10-29 15:22:44","image_url":"https://www.northwalespioneer.co.uk/resources/images/17382650/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d06d16f3612b191ecbf0994c022ee6af","title":"Dominic Calvert-Lewin strike gives Everton victory at West Ham","link":"https://www.southwalesguardian.co.uk/sport/national/23886999.dominic-calvert-lewin-strike-gives-everton-victory-west-ham/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Calvert-Lewin’s goal was his 50th in the Premier League for Everton.","content":"Everton ended a difficult week on a positive note as Dominic Calvert-Lewin fired them to a 1-0 win at West Ham. The Toffees were playing their first match since the death of chairman Bill Kenwright on Monday at the age of 78. It had been emotional week, too, for Hammers manager David Moyes, who formed a close friendship with Kenwright during his 11-year spell in charge at Goodison Park. But while West Ham slumped to a third defeat in eight days following reverses at Aston Villa and in the Europa League at Olympiacos, Everton were able to put some more breathing space between themselves and the bottom three with a second away win of the season. Calvert-Lewin’s goal was his 50th in the Premier League for Everton, joining Romelu Lukaku, Duncan Ferguson and Tim Cahill in reaching the half-century. It came six minutes into the second half after a first half that will not live long in the memory. West Ham created an early opportunity when Lucas Paqueta skilfully lifted the ball over Nathan Patterson and drilled in a low cross which Jarrod Bowen could only slice wide. Moments later Paqueta showed the side of his game which so infuriates Moyes, gifting the ball to Jack Harrison who burst through only to fire too close to Hammers keeper Alphonse Areola. Ghana winger Mohammed Kudus, making first Premier League start for West Ham, showed he is already getting used to the darker arts of English football after he was chopped down by James Tarkowski. As Jordan Pickford raced out of his goal to tell the youngster to get up, Kudus shoved the England keeper away in a skirmish which earned both a booking. Calvert-Lewin had his first chance from Vitalii Mykolenko’s cross but the striker headed over. A torturous half was summed up by the audible sigh which echoed around the London Stadium when five minutes of stoppage time was announced. The game desperately needed a goal and it almost came through Bowen, who got on the end of a James Ward-Prowse free-kick but guided his header too high. Instead the goal arrived at the other end after Jarrad Branthwaite won the ball back for Everton in midfield and fed Calvert-Lewin. The former England forward played a one-two with Harrison before executing a Cruyff turn which left both Kurt Zouma and Nayef Aguerd flat-footed and firing low past Areola. It was Calvert-Lewin’s sixth goal in all competitions against the Hammers, the most he has scored against one single club. Everton almost doubled the lead when Zouma and Aguerd got in another tangle but Areola got down well to tip Aboulaye Doucoure’s shot wide. The closest West Ham came to an equaliser was a Said Benrahma volley which Pickford kept out at his near post to secure the points.","pubDate":"2023-10-29 15:22:44","image_url":"https://www.southwalesguardian.co.uk/resources/images/17382650/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c51269155fa80e0899c0bdd88faad03b","title":"Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia","link":"https://www.dailymail.co.uk/sport/boxing/article-12685075/Tyson-Fury-vs-Francis-Ngannou-LIVE-reactions-fallout-pundits-celebrities-Gypsy-King-secures-controversial-split-decision-victory-UFC-star-Saudi-Arabia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Recap Mail Sport's live blog for all the latest news and reactions after Tyson Fury controversially beat Francis Ngannou by split decision in Riyadh, Saudi Arabia","content":"Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia By Daniel Davis For Mailonline Published: 08:26 GMT, 29 October 2023 | Updated: 15:02 GMT, 29 October 2023 e-mail 30 shares 43 View comments Advertisement Recap Mail Sport's live blog for all the latest news and reactions after Tyson Fury controversially beat Francis Ngannou by split decision in Riyadh, Saudi Arabia. This live blog has now closed. 14:43 A recap We're set to round off this live blog now, but just as a reminder... Tyson Fury narrowly saw off Francis Ngannou in Saudi Arabia last night. Fury was knocked to the canvas in the third round before recovering. His next fight, against Oleksandr Usyk, is not expected to be in December. 14:06 More on the news Frank Warren has revealed Tyson Fury is 'unlikely' to face Oleksandr Usyk this year. After a controversial win over MMA fighter Francis Ngannou, Fury will most likely face Ukrainian fighter Usyk 'early next year' according to Warren. With discussions between the two undefeated fighters lasting almost a year, a fight between Fury and Usyk was eventually penned in September. Though with an original date of 23 December, it is looking more likely to be the start of 2024. You can find more details below. Tyson Fury is 'UNLIKELY' to face Oleksandr Usyk this year Frank Warren has revealed that Tyson Fury is 'unlikely' to face Oleksandr Usyk this year. Mail Online 13:14 Fury v Usyk update This will come as absolutely no surprise to many. 12:39 Fury's next fight When will Tyson Fury return to the ring? Who will his opponent be? Looking for the answers to these questions? Well, you're in luck! Follow the link below for all the details. When will Tyson Fury fight next after victory over Francis Ngannou? Tyson Fury avoided one of the biggest shocks in boxing history by the skin of his teeth against Francis Ngannou and next up is likely to be Oleksandr Usyk. Mail Sport has all the details. Mail Online 12:03 Super-fran! Francis Ngannou attempted a superman punch in the final round of the fight. Ngannou exceeded all expectations in the clash, dropping Fury with a clubbing left hook in the third round, and employing a measured approach. Heading into the tenth round Ngannou had the star-studded crowd in attendance behind him, and appeared to be building in confidence. Then, with less than a minute remaining in the bout, the former UFC star pumped a jab before launching into a superman punch that bemused the commentary team. For more details, click below. Francis Ngannou attempts a SUPERMAN PUNCH in his clash with Tyson Fury Ngannou exceeded all expectations, dropping Fury, and employing a measured approach throughout preventing Fury from landing any sustained offence. Mail Online 11:50 McGregor: Fury 'couldn't hold' Ngannou Conor McGregor has shared his thoughts on the heavyweight clash between Tyson Fury and Francis Ngannou. He lauded Fury for his performance, saying: 'Lovely shot that caught him on the back of the head, a bit off balance as well. 'Fair play to Tyson, he's a tough man as well. Strong chin. 'And Jesus, Ngannou is a powerful boy as well. Tyson couldn't hold him. He was just missing with that backhand.' Read more below. Conor McGregor says Tyson Fury 'couldn't hold' Francis Ngannou Conor McGregor shared his thoughts on the heavyweight clash between Tyson Fury and Francis Ngannou which saw the Gypsy King pick up a controversial victory. Mail Online 11:15 He has a point! Andy Murray has waded into the debate. 10:56 Fury split decision win 'a joke' Luke Campbell has hit out at Tyson Fury's 'joke' victory over Francis Ngannou and insisted the judges' scorecards are 'destroying the sport' after the controversy. 'What a joke that is. Destroying the sport,' Campbell wrote on his X account. A follow-up post read: 'I see a lot of excuses coming.' Do you agree with him? Let us know! Luke Campbell calls Tyson Fury's split decision win 'a joke' Former lightweight world title challenger Campbell wasn't impressed by the spectacle. 'What a joke that is. Destroying the sport,' Campbell wrote on his X account. Mail Online 10:32 Eubank Jr: Fury deserved to lose Chris Eubank Jr believes Tyson Fury deserved to lose his 'Battle of the Baddest' clash against Francis Ngannou in Saudi Arabia last night. Giving his take, Eubank Jr insisted the Gypsy King was lucky and that he didn't spend enough time in the gym gearing up before his controversial victory. He wrote on X: 'Watching from ringside I thought Ngannou won the fight. It was close but he was the aggressor, landed heavier shots & scored a knockdown. 'Fury deserved to lose after having so much trouble against a man who has never boxed before… too much time filming Netflix specials not enough time in the gym I'm guessing. Unlucky Francis.' For more details, click the link below! Eubank Jr insists Fury 'deserved to LOSE' against Ngannou Chris Eubank Jr believes Tyson Fury deserved to lose his 'Battle of the Baddest' clash against Francis Ngannou. Mail Online 10:15 Lewis questions Fury's camp Former heavyweight champion Lennox Lewis has questioned Tyson Fury's preparation for his crossover bout against former UFC fighter Francis Ngannou. Fury was awarded the win by split decision in Saudi Arabia yesterday but only after he had been knocked down in the third round by his impressive opponent. The Gypsy King's WBC heavyweight belt was not on the line in Riyadh, and he struggled to get to grips with Ngannou in a sluggish performance. Lewis, a three-time heavyweight champion, criticised Fury's approach to the fight. Check out his full quotes below. Lewis questions whether Fury had a full camp ahead of Ngannou fight Fury was awarded the win by split decision in Saudi Arabia on Saturday but only after he had been knocked down in the third round by Ngannou. Mail Online 09:50 Stats reveal Fury was deserving winner Punch stats Tyson Fury's controversial victory against Francis Ngannou have shed new light on their blistering showdown in Saudi Arabia last night. While Ngannou did enjoy arguably the most memorable moment of the fight, stats show that Fury landed more punches over the course of the ten rounds. According to Compubox, Fury landed 71 of his 223 total punches, while Ngannou managed to score with 59 from 231 attempted. Also, though Fury did enjoy the edge in total punches landed, Ngannou landed more power punches than the lineal heavyweight champion, with 37 to Fury's 32. Find out more below! Punch stats reveal who REALLY came out on top in Fury vs Ngannou Despite the massive disparity in boxing experience, the former UFC Heavyweight Champion defied all expectations in Saudi Arabia on Saturday. Mail Online 09:31 Ngannou set for top 10 ranking Francis Ngannou's head coach Dewey Cooper has claimed the president of the WBC said the former UFC champion will be ranked in the top ten heavyweights. Speaking outside the ring after the fight, Cooper was asked if there was any chance Ngannou would fight the likes of Deontay Wilder and Anthony Joshua. Cooper said: 'Mauricio Sulaiman, the president of WBC, said he is going to rank him in the top ten because he is better than most of the heavyweights in the top ten. 'He said that in the ring, so absolutely you'll see him again.' For more on this story, click below. Dewey Cooper claims WBC president will rank Ngannou in top ten Francis Ngannou's head coach Dewey Cooper has claimed the president of the WBC said the former UFC champion will be ranked in the top ten heayweights. Mail Online 09:10 Too many yes men? Billy Joe Saunders has suggested Tyson Fury has 'too many yes men' in his entourage after the Gypsy King scraped his victory over Francis Ngannou. On Instagram, Saunders said: 'Too many yes men in camp, not switched on from the [the] word go. But he [will] be switched on for the Ukrainian [Oleksandr Usyk].' Do you agree with his comments? Let us know! 09:00 Hearn: 'Ngannou won by two rounds' Eddie Hearn believes Francis Ngannou beat Tyson Fury 'by two rounds'. One judge scored the contest 95-94 in favour of Ngannou, while the other two controversially handed the fight to Fury 96-93 and 95-94. 'I am absolutely lost for words. Francis Ngannou has never boxed before and fair play to him, I didn't think he was overly impressive, but Tyson Fury looked like he'd never laced up a pair of gloves before,' Hearn told Matchroom's YouTube channel. 'He got dropped in the third round, he never threw a punch and Ngannou never threw a punch after. I thought Ngannou won by two rounds. Boxing world has gone mad.' You can read his full quotes below. Eddie Hearn claims Francis Ngannou beat Tyson Fury 'by two rounds' Hearn gave a scathing assessment of Fury and claimed his December heavyweight showdown with Oleksandr Usyk is dead. Mail Online 08:45 Usyk: 'Fury didn't take him seriously enough' Oleksandr Usyk wasn't quite sure what to make of Tyson Fury's largely unconvincing display, having sat at ringside in Riyadh to watch the chaos unfold. His head-scratching reaction after Fury crashed to the canvas was equally telling. 'I had an impression that he was playing. I'm not thinking about [whether he was playing possum] but I will be training 100 per cent,' Usyk told Fight Hub TV. 'But listen, it's boxing. Maybe it was the element of surprise. Maybe. I think it was [a] show.' Check out Usyk's full quotes below. Usyk suggests Fury didn't take Ngannou seriously enough The Ukrainian heavyweight champion sat at ringside in Riyadh to watch Fury ahead of their showdown in December and the Ukrainian didn't know how to read it. Mail Online 08:37 Jeff Powell's report Tyson Fury, his massive paymasters, the Kingdom of Saudi Arabia and the best laid plans of world heavyweight boxing were shaken to the roots before the Gypsy King staged the narrowest of escapes from the sensational loss of his unbeaten record. A single point on the third card of a split decision saved the hundreds of millions of dollars in waiting for Fury to dispute with Oleksandr Usyk and preserved a shot at the honour of becoming the first undisputed world heavyweight champion for more than a decade. The Ukrainian, holder of the other title belts not in the fiefdom of the Gypsy King, was sitting at ringside and how he must have been wishing this had been his night in the ring with a Fury as sluggish and disjointed as this. You can read Jeff's full report via the link below. Tyson Fury survives almighty scare to beat Francis Ngannou on points JEFF POWELL IN RIYADH: A single point on the third card of a split decision saved the hundreds of millions of dollars in waiting for Fury to dispute with Oleksandr Usyk. Mail Online 08:32 Fury survives! Wow! That was an absolute war. Welcome along to Mail Sport's coverage of all the reaction and fallout from Tyson Fury's controversial split decision victory over Francis Ngannou in Saudi Arabia. Fury was dropped by the mixed martial artist but clung on for an uneasy triumph. Who saw THAT coming? Key Updates Fury survives! View post TOP STORIES Punch stats reveal Tyson Fury WAS the deserved winner in controversial victory over boxing newbie Francis Ngannou in Saudi Arabia with the Gypsy King landing 12 more punches than his rival Eddie Hearn claims Francis Ngannou beat Tyson Fury 'by two rounds' and says heavyweight showdown with Oleksandr Usyk is DEAD after lacklustre display... as he boasts Anthony Joshua would easily knock out the Gypsy King Tyson Fury vs Francis Ngannou RECAP: All the reaction from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over his ex-UFC star opponent Lennox Lewis questions whether Tyson Fury had a full camp ahead of Francis Ngannou fight as boxing world reacts to the Gypsy King's underwhelming victory in Saudi Arabia LeBron James blasts Tyson Fury's split-decision win over Francis Ngannou after the 'Gypsy King' suffered a third-round knockdown in suspect victory: 'Exactly why I don't watch boxing!' Tyson Fury is 'UNLIKELY' to face Oleksandr Usyk this year, reveals promoter Frank Warren as Gypsy King 'needs time' after Francis Ngannou gave 'one of the toughest fights of the last decade' Tyson Fury survives an almighty scare against boxing newcomer Francis Ngannou... as the Gypsy King battles back from third round knock down to secure a split decision victory on the judges scorecards Cristiano Ronaldo, Kanye West and Conor McGregor are among the famous faces in Saudi Arabia for Tyson Fury's Battle of the Baddest fight against Francis Ngannou Francis Ngannou KNOCKS DOWN Tyson Fury in the third round - after cutting him one round earlier - as former UFC champion stuns sports fans with his display against the champion Conor McGregor reveals he's held talks with Saudi Arabia over a BOXING match against Manny Pacquiao… as he confirms he WILL make a near three-year UFC return in April 2024 Luke Campbell calls Tyson Fury's controversial split decision victory over Francis Ngannou 'a JOKE' and says the Gypsy King will have 'a lot of excuses' coming after hugely unconvincing display World champion accepts Tyson Fury challenge after Gypsy King claimed brother Tommy Fury is 'the money fight' for boxing's biggest stars: 'I'd happily beat the c**p out of him' Inside Francis Ngannou's stunning car collection with former UFC champion boasting a £421k Rolls Royce Phantom and £270k Ghost Sadio Mane, Cristiano Ronaldo and Allan Saint-Maximin are among the footballers at Tyson Fury vs Francis Ngannou - with fellow Saudi Pro League stars Aymeric Laporte and Franck Kessie also in attendance Francis Ngannou attempts a SUPERMAN PUNCH in the tenth round of his clash with Tyson Fury... after knocking down the WBC Heavyweight Champion earlier in the fight Kanye West wears Premier League kit to Tyson Fury vs Francis Ngannou super fight - but team does the shirt belong to? Fans are trying to figure out the owner of the black shirt with yellow trim Heartwarming footage shows Cristiano Ronaldo asking Israel Adesanya for an update on Alex Volkanovski after the Aussie's brutal knockout and mental health concerns Boxing fans claim Francis Ngannou was 'ROBBED' of win against Tyson Fury as judges rule Gypsy King as the winner by split decision, despite Ngannou knocking Fury down in third round Lennox Lewis insists he would've beaten Tyson Fury in a battle of legendary British heavyweights... as he reveals the game plan the late Emanuel Steward would have given him to face the Gypsy King Rio Ferdinand claims Cristiano Ronaldo left his peers starstruck at the gala ahead of Tyson Fury vs Francis Ngannou - where names like Kanye West and Eminem were present - insisting 'there's superstars and then there's this guy' Fabio Wardley knocks out David Adeleye in the seventh-round in British heavyweight title grudge match on the Tyson Fury vs Francis Ngannou undercard Tyson Fury tells Cristiano Ronaldo he's 'the greatest footballer that has ever lived' - snubbing Lionel Messi - as they embrace at Champions Gala in Riyadh ahead of 'Battle of the Baddest' with Francis Ngannou Mike Tyson hilariously bites back at a reporter after Battle of the Baddest fight between Tyson Fury and Francis Ngannou - but claims the former MMA star WASN'T robbed despite his defeat Oleksandr Usyk suggests Tyson Fury didn't take Francis Ngannou seriously enough after Gypsy King's unconvincing split decision win... as Ukrainian's reaction to shock third round knockdown is revealed Amir Khan tells fan to 'shut the f**k up' after being ridiculed for awkward video where he gifts rap star Eminem a limited edition watch and wraps it on his wrist for him Cristiano Ronaldo is seemingly BOOED by spectators as he takes his seat ringside to watch Tyson Fury take on Francis Ngannou in Riyadh... or are they paying homage to an iconic sui celebration? Fury vs Ngannou: Israel Adesanya in line for over £100,000 payout after placing $20,000 on Gypsy King to be KO'd by 'The Predator' in the Battle of the Baddest - as former UFC champ embraces Cristiano Ronaldo before Riyadh showdown When is Tyson Fury's next fight and who will be his opponent after the Gypsy King's split decision victory against Francis Ngannou? The rise of Francis Ngannou: From walking six miles to school in Africa to sleeping rough in Paris and borrowing money to LIVE - even after becoming a UFC champion - 'The Predator' has hit the big time with Tyson Fury fight Tyson Fury and Oleksandr Usyk share unexpected embrace ahead of his Battle of the Baddest fight against Francis Ngannou after the date announcement for their Christmas clash Tyson Fury threatens to SUE Oleksandr Usyk as he sets a hard deadline for their heavyweight unification fight Francis Ngannou's trainer Dewey Cooper claims WBC president will rank the former UFC champion in top 10 heavyweights after fight against Tyson Fury Tyson Fury breaks silence on missing birth of seventh baby with wife Paris Fury: 'Daddy's gotta do what daddy's gotta do' Fans slam 'pure trash' opening ceremony ahead of Tyson Fury's 'Battle of the Baddest' fight against Francis Ngannou, claiming they 'came for a scrap not a concert' Conor McGregor says Tyson Fury 'couldn't hold' Francis Ngannou and marvels at his former UFC peer's formidable power as he fuels Oleksandr Usyk v Fury rumours for next clash Cristiano Ronaldo, Lionel Messi and Kylian Mbappe move over! Meet the Roman athlete who's '£15BILLION fortune' eclipses the wealth of football's elite at the top of 2023's sports rich list Lennox Lewis claims 'I thought Tyson Fury WON' his fight against Francis Ngannou, despite being knocked to the canvas in the third round with the three-time heavyweight champion claiming 'this was like a warm-up fight' A topless face-off with Mike Tyson, trashing a stage, headbutting a glass wall - and lashing out at KSI: The bizarre pre-fight antics of Tyson Fury's hellraising father John - as bemused fans brand him 'the most embarrassing man on the planet' Tyson Fury addressed prime minister Rishi Sunak with emotional knife crime plea after cousin was stabbed to death Tyson Fury has an estimated £130m net worth and a five-inch height advantage on Francis Ngannou, but the former UFC champ's £421k Rolls Royce is worth more than the Gypsy King's cars and his punches can reach further! TALE OF THE TAPE for Saturday's fight Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury Chris Eubank Jr insists Tyson Fury 'deserved to LOSE' against Francis Ngannou... as he claims the victorious Gypsy King had spent 'too much time filming Netflix specials rather than in the gym' John Fury furiously warns KSI he will 'hound him to DEATH and ruin his career' if the YouTube star doesn't pay up £200,000 after losing bet in his boxing defeat against his son Tommy Tyson Fury weighs in heavier than Francis Ngannou ahead of their Battle of the Baddest clash in Saudi Arabia... with the Gypsy King tipping the scales at 277lbs - nine pounds more than his weight ahead of victory over Derek Chisora last December Tyson Fury looks in lean shape after cutting down his 'love handles' in a remarkable body transformation in just seven weeks before fighting Francis Ngannou Manny Pacquiao confirms that he is 'working' on a fight with Amir Khan to take place next year... as the boxing legend also says he hopes to compete at the Paris 2024 Summer Olympics Joseph Parker KNOCKS OUT Simon Kean with a sensational third-round uppercut on the Tyson Fury vs Francis Ngannou undercard as the former WBO champion improves to 3-0 in 2023 Tyson Fury's face is left battered and bruised after his split decision victory over Francis Ngannou... while the former MMA star looks fine despite defeat Man United 0-1 Man City - Premier League LIVE: Erling Haaland scores a penalty to give visitors the lead in the Manchester derby Liverpool 3-0 Nottingham Forest: Reds cruise to comfortable win at Anfield with Diogo Jota, Darwin Nunez and Mo Salah finding the net Premier League LIVE: Diogo Jota, Darwin Nunez and Mo Salah give Liverpool 3-0 lead over Forest while high-flying Aston Villa take control against Luton and Joao Palhinha draws Fulham level at Brighton Former Canadian tennis star Eugenie Bouchard joined by friends to show off incredible physique dressed in lacey catwoman outfit for Halloween CHRIS FOY'S RUGBY WORLD CUP HIGHLIGHTS: Portugal's progress gets Cristiano Ronaldo's seal of approval, Antoine Dupont's injury grips a nation, Fiji steal hearts and was France vs South Africa the greatest Test EVER? Jamie Carragher jokes the 'prawn sandwich brigade' have taken their seats at Old Trafford as the Liverpool legend pokes fun at Roy Keane ahead of the Manchester derby Eddie Jones labelled 'pathetic' by Sir Clive Woodward after Australian likened coaching the Wallabies to 'eating s***' as England legend urges Japan NOT to hire outgoing boss Olympiacos' fierce derby with Panathinaikos is abandoned after a player is struck by a FIREWORK while warming up on the touchline - as his team-mates refuse to return from the dressing room to finish the clash Joey Barton is SACKED as manager of Bristol Rovers, hours after he called rival boss Steve Evans a 'fat man' and a 'weeble' in his final game which left the team stuck 16th in League One Southampton 3-1 Birmingham: Wayne Rooney suffers a third successive defeat since taking charge of the Blues as the Saints cruise to victory Harry Kane scores incredible goal FROM HIS OWN HALF as he hits a hat-trick with Bayern Munich hitting EIGHT second-half goals in thrashing of Darmstadt - with three players sent off! Carlo Ancelotti says Jude Bellingham can 'easily reach 20-25 goals' for Real Madrid this season after the 20-year-old 'veteran' scored twice in their 2-1 win over Barcelona Sheffield United break record for the worst EVER start to a Premier League season after Arsenal defeat... with Paul Heckingbottom's side picking up just one point from their first 10 games England boss Shaun Wane labels Tonga 'disgraceful' after 14-4 victory over the Pacific Islanders to clinch series win in Huddersfield Eddie Jones resigns as Australia boss after disastrous Rugby World Cup campaign England could MISS OUT on 2025 ICC Champions Trophy if they don't finish in the top seven rankings of the ongoing ODI World Cup Aston Villa 3-1 Luton Town: Ruthless Villa put the Hatters to the sword as McGinn, Diaby and a Lockyer own goal seal win Diogo Jota holds up Luis Diaz No 7 shirt as he dedicates goal against Nottingham Forest to Liverpool team-mate whose parents were kidnapped in Colombia West Ham 0-1 Everton: Dominic Calvert-Lewin scores his 50th Premier League goal to secure Toffees win as they remember Bill Kenwright Erik ten Hag reveals Man United defensive duo Jonny Evans and Victor Lindelof were given the nod over Raphael Varane for the Manchester derby for 'TACTICAL reasons' Travis Kelce 'wants KIDS with Taylor Swift in the next year or so' and she is 'all in' on the plans - and the Chiefs star has also spoken about marrying the singer as whirlwind romance hots up BREAKING NEWS: The mother of Liverpool star Luis Diaz 'has been rescued from a kidnapping in Colombia by assailants on motorcycles' - but the player's father is still missing New Zealand 11-12 South Africa - Rugby World Cup final LIVE: Springboks RETAIN their crown after nerve-shredding finish in Paris... as they become first side to lift trophy for a fourth time EXCLUSIVE: No Taylor = Sad Travis! Glum-faced Kelce is spotted at the Chiefs' hotel in snowy Denver as he prepares to face the Broncos WITHOUT his popstar girlfriend watching on from the stands Springboks reign once more! South Africa retain their World Cup crown after nerve-shredding 12-11 win over New Zealand in Paris - their third consecutive victory by just ONE point... as they become first side to lift trophy for a fourth time Robbie Fowler is sacked by Saudi side Al-Qadsiah after four months despite an unbeaten start... with the former Liverpool star named manager of the month in September! Travis Kelce dances to Taylor Swift classic 'Love Story' in Texas bar and sends the Swifties wild with viral video after watching the Rangers win their World Series game Son who stabbed AFL coach father Phil Walsh to death in frenzied knife attack is back in full detention after decline in his mental health OLIVER HOLT: Jude Bellingham is Il Fenomeno, the King of Madrid and the impact he is having in Spain feels almost other-worldly after El Clasico heroics... he is only 20 yet he is taking European football by storm Novak Djokovic and Rita Ora among celebrities spotted at Rugby World Cup final as Mika performs in France, for New Zealand v South Africa clash Gillingham fan is arrested and given a lifetime ban after vile racist gesture targeting Newport County goalscorer Omar Bogle... just weeks after the club was handed a £12K fine by the FA for racist and sexist chanting Barcelona 1-2 Real Madrid: Jude Bellingham scores sensational double, hitting a 25-yard SCREAMER before finding the back of the net in injury time to help Carlo Ancelotti's side seal dramatic comeback victory to go top of LaLiga Nick Riewoldt makes major family announcement after leaving Australia for the United States: 'I missed the footy season this year' For as long as I can remember the RFU has been far too cozy, it needs shaking up if England are to win another Rugby World Cup... it's left field, but they must hire South Africa's genius coach Rassie Erasmus TNT Sports' coverage of Tyson Fury's huge crossover clash with Francis Ngannou goes DOWN just 40 minutes into the show, leaving fans furious after paying £21.95 for the fight Barcelona 1-2 Real Madrid - RECAP: Jude Bellingham scores last-gasp winner for Carlo Ancelotti's side as his heroic second-half brace sees visitors edge to victory in El Clasico World Series matchup between wildcards Texas Rangers and Arizona Diamondbacks prompts MLB to re-examine playoff format... but commissioner Rob Manfred isn't rushing to make changes Taylor Swift made the first move in Travis Kelce romance and 'cautiously reached out' when she heard how he failed to give her his number at Kansas City Eras show Taylor Swift now can't cheer Travis Kelce on in the NFL until DECEMBER - and Eras tour dates mean she WON'T be at the Super Bowl in February if the Kansas City Chiefs make it that far Luis Diaz left out of Liverpool squad for clash against Forest after his parents were kidnapped in Colombia, while authorities 'continue the search' for Reds star's father after his mum was rescued and freed Kansas City Chiefs star Travis Kelce is spotted dancing to Taylor Swift's 'Shake it Off' at Game 1 of the World Series WITHOUT pop star girlfriend An early childhood teacher, a farm manager and an accountant turned influencer... meet the All Blacks wives and partners cheering on their side as New Zealand and South Africa battle for the Rugby World Cup EXCLUSIVE: OJ Simpson looks unrecognizable as the frail NFL legend, 76, is spotted carrying groceries in Las Vegas... 28 years after being acquitted in the 'Trial of the Century' Joe Marler tells former England star to 'eat s*** after the prop was accused of 'showing a lack of respect' by snubbing Sir Bill Beaumont... as he collected his Rugby World Cup bronze medal Wolves 2-2 Newcastle - Premier League RECAP: Hwang Hee-chan twists and turns in the Magpies area before firing home fine equaliser... as Gary O'Neill's side pull themselves level to secure a point at Molineux RIATH AL-SAMARRAI: Alejandro Garnacho's tweet about Andre Onana which featured two gorilla emojis wasn't malicious... but the Man United youngster must be charged by the FA Harry Kane humbly claims his halfway line goal in Bayern Munich hat-trick 'one of the better ones in my career' as he soaks up the praise for stunning contribution to 8-0 thrashing in Bundesliga EXCLUSIVE: Paul Heckingbottom could be sacked THIS WEEKEND if Sheffield United lose at Arsenal... with former Blades boss Chris Wilder in line to replace him Arsenal 5-0 Sheffield United: Eddie Nketiah nets his first Premier League hat-trick as the Gunners cut the gap to Tottenham to two points - with Fabio Vieira and Takehiro Tomiyasu also scoring Travis Kelce is filmed receiving copious amounts of friendship bracelets from Taylor Swift fans at her Eras Tour months BEFORE he began dating the singer Saudi Arabia UFC Fighting Tyson Fury Share or comment on this article: Tyson Fury vs Francis Ngannou RECAP: All the reactions and fallout from pundits and celebrities as 'Gypsy King' secures controversial split decision victory over UFC star in Saudi Arabia e-mail 30 shares Terrible fight and wrong winner. Fury looked all f... by hahapoo 50 Add comment Comments 43 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-29 15:02:18","image_url":"https://i.dailymail.co.uk/1s/2023/10/29/08/77135991-0-image-a-4_1698567198518.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3f1b8e8f043105e7f1ccd5850e3c2561","title":"Amir Khan caresses Mike Tyson's hands as confused boxing fans say 'this is just weird'","link":"https://www.dailystar.co.uk/sport/football/amir-khan-caresses-mike-tyson-31308548","keywords":["Sport"],"creator":null,"video_url":null,"description":"Amir Khan had boxing fans confused as the former boxer filmed himself caress the hand of Mike Tyson before the fight between Tyson Fury and Francis Ngannou","content":"A video of caressing the hand of had fans both confused and weirded out by the strange interaction. The former boxers were among the star-studded attendees for the mega-fight between Tyson Fury and Francis Ngannou, which was . The 35-year-old won by split decision, in the third round by the former UFC heavyweight, who looked at home in the boxing ring despite it being his debut. Prior to the battle between the two fighters, there was plenty of mingling between icons of sport as Amir Khan enjoyed a wholesome but bizarre moment with Mike Tyson. In a video the 36-year-old posted on his Instagram Stories, the Bolton-born brawler was caressing Tyson's hand as he seemed in awe with it as he asked the American: \"How many people you knock out with this?\" The former undisputed heavyweight champion replied: \"I don't know, 48 but 200 in the street,\" before the pair enjoyed a laugh together. Fans on social media certainly saw the quirky side to Khan's constant rubbing of Tyson's right hand as one X user wrote: \"Why did he hold his hand for so long?!\" while another bluntly stated: \"this is just weird\". Another suggested that Khan may have been in for a punch as they said: \"We all know Mike doesn’t like being touched like that, he probably had that intrusive thought to add +1 KO to the record.\" It wasn't the pair's first interaction in Saudi Arabia as the New York native made an impromptu appearance in one of Khan's interviews during the weekend. During an interview with talkSPORT, Tyson and his entourage walked through which brought a brief pause on the interview which Khan saw the funny side to as he said: \"Hey listen, when Mike Tyson's walking through, you don't want to stand in front of Mike Tyson.\" He jokingly added: \"He might punch you! When you've got walking through you, I'm like, 'Mate, let him go' because you don't wanna get hit by him. You don't wanna be in his way basically.\"","pubDate":"2023-10-29 14:55:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31309008.ece/ALTERNATES/s98/1_Amir-Khan-caresses-Mike-Tysons-hands-as-confused-boxing-fans-say-this-is-just-weird.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8db7fd42cc12433b220b45634bf5ff2a","title":"Liverpool players pay perfect tribute to Luis Diaz during winger's family kidnap ordeal","link":"https://www.mirror.co.uk/sport/football/news/luiz-diaz-kidnap-parents-liverpool-31309118","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Mark Jones)"],"video_url":null,"description":"Luis Diaz was absent from the Liverpool side for Sunday's clash with Nottingham Forest at Anfield after his parents were kidnapped in Colombia on Saturday, with his father still missing","content":"Diogo Jota and Liverpool's players showed team-mate Luis Diaz that he was on their minds as they celebrated their first goal against Nottingham Forest in the wake of their absent winger's terrifying family kidnap ordeal. Jota slotted home in the 31st minute of the clash at Anfield after Forest goalkeeper Matt Turner had parried an effort from Darwin Nunez. The Portuguese, who had effectively come into Liverpool's Premier League side for Diaz, was all alone at the back post and slotted in with ease. The forward then ran towards the Reds bench with his team-mates and picked up a Diaz No.7 Liverpool shirt, holding it aloft to the crowd. Liverpool supporters responded by singing Diaz's name as they showed him that he was very much on their minds. Luis Diaz's parents' kidnapping: Latest news as Liverpool star misses match after \"tough night\" Jurgen Klopp speaks out on Luiz Diaz's \"worrying situation\" after parents' kidnapping Diaz was absent from Liverpool's matchday squad on Sunday after his parents were kidnapped in his native Colombia on Saturday evening. His mother, Cilenis Marulanda, was quickly rescued, however his father is still reported missing. Liverpool said in a statement on Sunday: \"Liverpool Football Club can confirm it is aware of an ongoing situation involving the family of Luis Diaz in Colombia. It is our fervent hope that the matter is resolved safely and at the earliest possible opportunity. In the meantime, the player’s welfare will continue to be our immediate priority.\" Jota and Liverpool's players paid tribute to their team-mate ( Image: AFP via Getty Images) Reds boss Klopp, asked about the situation ahead of the match, said: \"We had to obviously make a late change because of the private situation involving Luis Diaz. It's a worrying situation for all of us and it was a pretty tough night. I have never had that before. It's a new experience I never needed.\" Authorities in Colombia are working hard to help find Diaz's father, with the player being kept abreast of the latest situation. The Colombian attorney General's office also said in a statement: \"From the moment when Colombia's General Prosecutor's Office learned of the kidnapping of the parents of Colombian player Luis Díaz in the Barrancas area of La Guajira, a specialist team of prosecutors, CTI (Technical Investigation Team) officials and investigators from the police and military have been taking urgent action to locate these individuals, clarify the chain of events and identify the culprits.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-10-29 14:49:45","image_url":"https://i2-prod.mirror.co.uk/incoming/article31309153.ece/ALTERNATES/s615/0_Liverpool-v-Nottingham-Forest-Premier-League-Anfield.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"}]}