{"newsArray":[{"title":"Ange Postecoglou takes blame for Tottenham’s poor set-piece defending in pre-season defeat to West Ham","link":"https://www.standard.co.uk/sport/football/ange-postecoglou-tottenham-west-ham-pre-season-defending-b1095128.html","keywords":["Football","Sport"],"creator":["Simon Collings"],"video_url":null,"description":"Spurs conceded twice from corners in the space of five first-half minutes as West Ham beat them in Perth","content":"boss says he should take the blame for Spurs’ defensive woes as they lost their opening game under him to . in Perth, with Gianluca Scamacca scoring the winner after Tottenham had come back from two goals down. Tottenham looked good going forward and they had 30 shots on goal during the 90 minutes as Giovani Lo Celso and Destiny Udogie found the net. But they were undone defensively and conceded two goals shortly after set-pieces in the first-half, as Danny Ings and Divin Mubuma struck. “The goals we conceded are partly on me - we haven’t done loads of work on those kind of defensive areas and structures around set-pieces and stuff,” said Postecoglou. “I can’t expect the guys to take everything on board. I thought for the most part defensively the pressure was really good and we didn’t allow too many chances as you said. “But we don’t want to be conceding goals with them producing a small number of chances. “But that’s not the sort of stuff worked on. There are still things in our structure where we could have moved the ball quicker and guys aren’t in exactly the position they need to be. “And there are a few things we need to keep developing, as is only natural as they get fitter to play this kind of football. We’re still in the early stages. At the same time we only have three or so weeks to get ready for the first game so we’re working hard.” Tottenham created plenty of chances in this first game under Postecoglou, living up to the Australian’s brand of attacking football. Destiny Udogie headed home an equaliser on his Tottenham debut , however, had a quiet first-half and was taken off at the break with the whole of the team that started the match. Fellow striker Richarlison didn’t fair much better after the interval, hitting the post and missing a good headed chance late on. “If we keep creating those kind of chances I have no doubt that they will finish them,” said Postecoglou. “They’re both quality strikers. For me the outcomes become secondary right now. How we’re playing our football, what kind of tempo we’re playing at, our structures are much more important than the outcomes. “Obviously there were some positive things, not all positive but certainly enough there to at least from my perspective say that the boys are willing, are trying, to change the way we play.”","pubDate":"2023-07-18 13:23:43","image_url":"https://static.standard.co.uk/2023/07/18/14/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea plot third Moises Caicedo bid after Brighton reject £70m offer","link":"https://www.standard.co.uk/sport/football/chelsea-fc-caicedo-third-bid-brighton-b1095127.html","keywords":["Football","Sport"],"creator":["Nizaar Kinsella"],"video_url":null,"description":"Chelsea will continue talks over Moises Caicedo after having an improved offer for the midfielder rejected by Brighton.","content":"will continue talks over after having an improved offer for the midfielder rejected by . The latest bid from Chelsea is worth a fixed £70million with no add-ons but has been turned down as Brighton hold out for around £100m for the Ecuador international. Chelsea, who had a £60m offer rejected last month, will now consider a fresh approach for Caicedo after making him their next transfer priority. The Blues need to strengthen their midfield after losing N'Golo Kante, Mateo Kovacic, Ruben Loftus-Cheek and Mason Mount this summer, having also sold Jorginho to Arsenal in January. Chelsea are adamant they will not pay over the odds for Caicedo but have been encouraged after the 21-year-year made it clear he wants to move to Stamford Bridge. The club hopes to find a compromise closer to £80m, but negotiating a deal with Brighton will not be easy. “It's a big team, that's true,” Caicedo said in an interview in Ecuador last week. “A very historic team and I can't say no because it is a very big, historic, beautiful team. The city as well is beautiful.” Caicedo has established himself as one of the best midfielders in the Premier League at Brighton, who feel the benchmark for his price tag has been set by Declan Rice's £105m move to Arsenal. Brighton owner Tony Bloom is emboldened by West Ham's valuation of Rice and Chelsea paying £106.8m to sign Enzo Fernandez from Benfica in January.","pubDate":"2023-07-18 13:23:18","image_url":"https://static.standard.co.uk/2023/06/19/06/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night","link":"https://www.dailymail.co.uk/sport/football/article-12310953/Lionel-Messi-smiles-steps-training-field-Inter-Miami-time-ahead-expected-debut-Friday-night.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Messi was pictured alongside fellow new signing and Barcelona legend Sergio Busquets, as well as the rest of the squad at the team's Fort Lauderdale base, where spirits appeared high.","content":"Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night Lionel Messi has begun training with Inter Miami after being unveiled on Sunday He stepped out and seemed in high spirits, chatting with his new teammates DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Updated: 14:38, 18 July 2023 e-mail 29 shares View comments Lionel Messi has stepped out onto the training field for the first time as an Inter Miami player, joining his teammates early on Tuesday morning. The Argentina superstar was officially unveiled in a huge ceremony on Sunday night and the hard work starts now ahead of his expected debut on Friday. Messi was pictured alongside fellow new signing and Barcelona legend Sergio Busquets , as well as the rest of the squad at the team's Fort Lauderdale base. Messi seemed in high spirits, chatting and laughing with Josef Martinez as the players were put through a light jog at the start of the session. Inter Miami have endured a dreadful season so far and will desperately hope that the injection of Messi and Busquets to the team can revive their fortunes. Lionel Messi smiles during his first training session with Inter Miami in Fort Lauderdale Messi chats with new teammate and Inter Miami forward Josef Martinez during the session Fans are eagerly awaiting the world's best player taking to the field against Cruz Azul on Friday Fellow new signing Sergio Busquets (center) was also put through his paces by coaches The entire team seemed rejuvenated by the arrival of Barcelona legends Messi and Busquets Messi laughs as the team are addressed by coaches during the training session at Florida Blue Messi. Busquets. Whole squad's here. Our first look at @InterMiamiCF 's new star duo on the training pitch. ¿ pic.twitter.com/i5oDYbcfvP — Major League Soccer (@MLS) July 18, 2023 Off-the-field, Messi jersey sales are already through the roof and Inter Miami are expected to sell out the remainder of their matches with ease this season. Messi's first appearance in the pink of his new team is anticipated to come on Friday night in Major League Soccer's new Leagues Cup competition. Tata Martino's side face Cruz Azul at their DRV PNK Stadium, with one ticket listed for a remarkable $110,000 as fans clamor for their chance to see the GOAT in action. Share or comment on this article: Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night e-mail 29 shares Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 13:18:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/14/73339583-0-image-a-11_1689686017886.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Agent Lashes Out After Arubi’s New Deal","link":"https://www.snl24.com/soccerladuma/Local/Premiership/SuperSport-Utd/agent-confirms-new-deal-for-washington-arubi-20230718","keywords":null,"creator":null,"video_url":null,"description":"A local football intermediary has lashed out at reports which claimed that veteran goalkeeper Washington Arubi might have signed contracts with different clubs.","content":"A local football intermediary has lashed out at reports which claimed that veteran goalkeeper Washington Arubi might have signed contracts with different clubs. Some reports claimed that Arubi might have signed with Royal AM and Sekhukhune United respectively after the relegation of Marumo Gallants. As revealed by the Siya crew, after the Tshwane giants agreed to a deal with Gallants, which is the club that the 37-year-old has been playing for. Contacted for comment, Arubi’s representative Ratshibvumo Mulovhedzi from Rush Hour Sports Management confirmed the deal with the Tshwane giants. “Yes, it is true that Washington Arubi will be playing for a new club in the new season. A deal has been agreed to between SuperSport United and Marumo Gallants for the player’s services,” said Mulovhedzi. “We are excited about this deal because it ends ongoing speculation about the player’s future. As we have always maintained, the player didn’t sign with any club as he still had a contract with Marumo Gallants. Marumo Gallants chairman never said he doesn’t want to allow Washington to move on with his career, and he was happy to conclude a deal with any club that approached him. The player has been given the chairman’s blessings to join SuperSport,” concluded the intermediary.","pubDate":"2023-07-18 13:10:22","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | McCarthy’s Positive Energy Shines Through At Man United","link":"https://www.snl24.com/soccerladuma/Fan-Park/benni-mccarthy-stays-bringing-positive-vibes-to-man-united-20230718","keywords":null,"creator":null,"video_url":null,"description":"Benni McCarthy continues to be the source for good vibes at Manchester United.","content":"Manchester United's first team coach Benni McCarthy received a lovely welcome upon his return to the club, proving that he brings only good vibes to the club. Check it out! South African football legend and Man United striker coach Benni McCarthy brings the positive energy to the club, as seen in a viral video of the players welcoming him back for pre-season yesterday. Since joining Erik ten Hag's staff at the star of last season, McCarthy has been a popular member and proven vital in Marcus Rashford's resurgence among other things. Let's take a closer look... In a video that's been circulating heavily online since yesterday, McCarthy was warmly embraced by United stars Alejandro Garnacho, Victor Lindelof, Diogo Dalot, Facundo Pellistri, and Anthony Elanga on the Carrington training grounds. The former Porto, Ajax Amsterdam, and Blackburn Rovers striker got involved straight away with a rondo, looking as sharp as he did during his playing days. The comments to the post saw the likes of Lisandro Martinez and Amad Diallo showing love, showing just how many players at the club value McCarthy's presence. McCarthy has been a valuable member of Manchester United’s coaching staff since being hired by Erik ten Hag last year and has been instrumental with helping Marcus Rashford bagging 31 goals in all competitions last season. The England international has spoken highly about McCarthy in an interview with SuperSport TV, saying he's made great impact on the forwards: Tipped to be United's captain for the upcoming season, Portuguese star Bruno Fernandes is also a huge fan of Benni, and also spoke to SuperSport TV's Julia Stuart about his experience of working with his fellow FC Porto alumni. He also mentioned that type of energy that McCarthy brings to the dressing room: \"He's a really funny person, he's always positive. He's a good energy in the dressing room, [and] on the training ground.\" You must be to read and post comments.","pubDate":"2023-07-18 13:01:26","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Man Utd legend Gary Neville leads Newcastle and Arsenal stars in support of Laura Woods’ Champions League move","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-legend-gary-neville-leads-newcastle-and-arsenal-stars-in-support-of-laura-woods-champions-league-move-4222786","keywords":["Manchester United","Football","Sport"],"creator":["Toby Bryant"],"video_url":null,"description":"Laura Woods has confirmed her hotly-anticipated move to TNT Sports ahead of the new season with congratulations messages pouring in online.","content":"Laura Woods has confirmed her hotly-anticipated move to TNT Sports ahead of the new season with congratulations messages pouring in online. was one of many pundits and football stars to send well wishes to former talkSPORT presenter as she confirmed a much-expected TNT Sports appointment. The 36-year-old will be the lead presenter for Champions League coverage on the channel, which is to replace BT Sport. She is joined by Lynsey Hipgrave on Premier League coverage, Reshmin Chowdhury on Champions League matches and Jules Breach for Europa League action. Advertisement Advertisement The other major appointment come as Ally McCoist, Wood's talkSPORT radio partner, joins at TNT's major football co-commentator. Darren Fletcher and Adam Summerton will also continue in commentary roles. Elsewhere, , Peter Crouch, Joe Cole, Rachel Brown-Finnis, Owen Hargreaves, Steve McManaman, Joleon Lescott, Michael Owen, Paul Scholes and Robbie Savage have all landed punditry and co‑commentary positions. The shake-up comes after Jake Humphrey announced his departure from BT Sport in May and Des Kelly also left the broadcasters after the Champions League final. Messages of congratulations flooded in for Woods as she confirmed the news on Instagram this morning. She wrote: \"The New Chapter…Oh, hi TNT Sports. And helloooooo Champions League, *cue CL music*. A very, very proud day for me.\" Advertisement Advertisement Manchester United legend turned pundit Gary Neville was one of the first to share his excitement for Woods. He commented: \"Well done Laura and Congratulations.\" Arsenal hero Ian Wright and former Newcastle United talisman Alan Shearer also congratulated their broadcasting colleague as Ally McCoist joked that Woods had 'never told me'. Alex Scott also welcomed the 'big moves' from her friend and boxing star Tony Bellew wrote 'well done mate'. Premier League stars Ben Foster, Carlton Cole, Steve Sidwell and Danny Simpson were also on hand to welcome the news. will enter the football broadcasting world for £29.99 a month, the same price as its BT Sports predecessor. TNT merged with BT in September 2022 under the Warner Brothers/Discovery media conglomerate. Advertisement Advertisement TNT will take over Champions League rights from BT until 2027, as well as 52 Premier League games until 2025.","pubDate":"2023-07-18 13:00:01","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/07/18/12/GettyImages-1421378794.jpg?width=1200&auto=webp","source_id":"manchesterworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Politics, Property, Corporate: The Limitless ‘King Kenny’","link":"https://www.snl24.com/soccerladuma/Fan-Park/kenny-niemachs-post-professional-football-career-20230717","keywords":null,"creator":null,"video_url":null,"description":"Ex-Kaizer Chiefs player Kenny Niemach has found plenty of success after football and is now enjoying a new career path.","content":"Former Kaizer Chiefs striker Kenny Niemach has found plenty of success after football and is now enjoying a new career path in real estate. Check it out! After retiring from football at the age of 32, former striker Kenny Niemach has proven to be a man of many talents. From radio presenting to premium corporate gigs and getting involved in selling property, Niemach has found success in a host of avenues after stepping away from football. Let's take a closer look at Niemach's post football journey and his current gig in real estate. Former Amakhosi, Sundowns and Moroka Swallows gunman Kenny Niemach hasn't limited himself and his abilities after retiring relatively early. Known as \"King Kenny\" during his successful spell at the Dube Birds, Niemach has tried his hand as radio presenter and TV analyst for SuperSport and found some success in the corporate world. The 51-year-old also ventured into politics back in 2021, joining the United Independent Movement (UIM) party ahead of the Local Government elections. Niemach worked as a COO at Joburg-based IT company Yookoo Incorporated and with the company he launched a cab-hailing app, Yookoo Rider, back in 2017 to rival the likes of Uber and Bolt. Niemach is now working as a real estate broker for Rawson Property Group and uses social media as a platform to sell houses. Take a look: You must be to read and post comments.","pubDate":"2023-07-18 12:46:30","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America","link":"https://www.dailymail.co.uk/sport/football/article-12310715/Arsenal-Mikel-Arteta-son-Gabriel-14-spotted-coaching-kit-pre-season.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mikel Arteta's teenage son Gabriel was pictured in Arsenal training during their pre-season tour on Monday. The Premier League side are preparing for the new campaign at a training camp in America.","content":"Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America Mikel Arteta's son Gabriel was pictured in Arsenal's pre-season training session Gunners are currently undergoing preparation for the new season in America And Gabriel, 14, watched on in his own initialed coaching staff kit on Monday By Isaan Khan and Max Mathews For Mailonline Updated: 13:43, 18 July 2023 e-mail 2 View comments Mikel Arteta 's teenage son Gabriel was pictured in Arsenal training during their pre-season tour of America on Monday. The Premier League side are undergoing preparation for the new campaign at a training camp in America. The Gunners drew 1-1 against German side Nurnberg in their first pre-season friendly last Thursday, before they take on the MLS All-Stars a week later . And in a surprising development, Arteta's son Gabriel, just 14 years old, was spotted at Arsenal's training session open to the public on Monday. Gabriel wore a red Arsenal training shirt used by other coaches, hinting he is there as part of the coaching staff rather than training as a player. Mikel Arteta's son Gabriel, 14, was pictured in Arsenal training during pre-season on Monday The teenager stood and watched as four Gunners players worked at a public training session According to Mail Sport's Isaan Khan, he did not seem to participate in the 15-minute session According to Mail Spor t's Isaan Khan, he milled around the 15-minute session without seeming to directly participate. Pictures released on social media show Gabriel facing another coach as Rob Holding, Gabriel Jesus, Oleksandr Zinchenko and Eddie Nketiah crouch down into some coloured cones as part of their physical training. Arteta insisted on Monday that Arsenal could make further signings despite already spending more than £200million this summer. Mikel Arteta says Arsenal could make further signings despite already spending £200million Club record signing Declan Rice joined Arsenal from West Ham on Saturday for £105million Arsenal have also secured the signings of Kai Havertz (left) and Jurrien Timber (right) The Spaniard has brought in West Ham defensive midfielder Declan Rice for a club-record £105million, forward Kai Havertz from Chelsea and Ajax's Jurrien Timber. Arteta said: 'Let's see (about more signings), there's still a lot of time left in the market. 'There's a lot of expectations in some of our players, so we will have to see how things develop in the next couple of weeks. 'We will be alert, there's still time to do things and there's still time for exits obviously.' On the opening day of Arsenal's US tour on Monday, the 29-man squad — including new signings Rice, Timber and Havertz — trained at George Mason University, near Washington DC . Arteta was full of praise for £105m club-record signing Rice and backed him to succeed in north London. 'His leadership, his aura, the experience he already has in the league. He's going to bring our team to a different dimension,' added Arteta. 'He's got the physical qualities as well that we've been missing for a while.' Share or comment on this article: Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 12:43:12","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/13/73336541-0-image-m-52_1689682359357.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat","link":"https://www.dailymail.co.uk/sport/football/article-12310747/West-Ham-prove-theres-life-Declan-Rice-Harry-Kane-enjoy-Ange-Postecoglous-energy-stays-FIVE-THINGS-LEARNED-Tottenhams-pre-season-defeat.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MATT BARLOW: Tottenham suffered a 3-2 defeat to West Ham in their first game under Ange Postecoglou, on their pre-season tour of his homeland Australia.","content":"West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat West Ham secured a a 3-2 victory over Tottenham in Perth on Tuesday Gianluca Scamacca scored the winner after Spurs had come from 2-0 down Mail Sport takes a look at five things we learned from the pre-season game By Matt Barlow for MailOnline Updated: 13:55 BST, 18 July 2023 e-mail 14 shares View comments Tottenham suffered a 3-2 defeat to West Ham in their first game under Ange Postecoglou , on their pre-season tour of his homeland Australia. A quickfire double from Danny Ings and Divin Mubama gave the Hammers a 2-0 lead before Giovani Lo Celso and Destiny Udogie pulled Spurs back in the second-half. Gianluca Scamacca though netted the winner for David Moyes' side in a tough opening match for Tottenham's new manager. Postecoglou handed first outings for new signings James Maddison, Manor Solomon and Guglielmo Vicario who all started the match. Here, Sportsmail's Matt Barlow looks at five things we learned from the encounter. West Ham beat rivals Tottenham 3-2 after an impressive pre-season outing in Perth, Australia ANGE'S LICENCE TO THRILL When Ange Postecoglu says he is prepared to play with risk he means it. The starting back four in his first selection included flying Spanish full backs Pedro Porro and Sergio Reguilon, released to flood midfield but the licence to thrill left them ever so vulnerable to the counter-attack against West Ham who lined up in an orthodox 442 formation. Danny Ings’s opener was a reminder of the defensive frailties of Porro, not closing down the cross, and Reguilon, defended tamely at the back post. Divin Mubama headed in the second as Japhet Tanganga and Reguilon failed to pick up at a corner. Still, these friendlies are glorified training sessions, intended for Postecoglu to work on fitness and learn about his players - and for them to learn about the shape and rhythms he expects. They were altogether more coherent as they fought back in the second half, with Emerson Royal and Destiny Udogie at fullback and Pierre-Emile Hojbjerg screening. Ange Postecoglou played his first game as Spurs manager with risk against West Ham's 4-4-2 THERE'S LIFE AFTER RICE David Moyes seems relieved to be over the Declan Rice transfer saga and his team are proving there is life after their captain’s departure for Arsenal. They scored six against Perth Glory on Saturday and punished Tottenham’s flimsy defence shield with three. Angelo Ogbonna led the Hammers out, although the club’s social media channels thought Lukasz Fabianski was wearing the armband. Senior figures stepped up to lead in their own way. Ogbonna and Kurt Zouma made it through 45 minutes without giving Harry Kane a glimpse of goal, and kept Spurs out for almost an hour. Veteran keeper Fabianski made a string of fine saves before his team were overwhelmed by the fresh legs of Tottenham. Postecoglu made 11 half-time changes. Moyes saved his changes for later in the game and ended up with a very young team on the pitch. West Ham have started the pre-season strong despite the sale of influential star Declan Rice (Danny Ings pictured after scoring the Hammer's opener against Tottenham) West Ham proved there's life without Rice - who joined Arsenal for a massive £105m fee KANE WILL ENJOY ANGE'S ENERGY If Kane sticks around he will enjoy the whirl of energy Postecoglu is trying to generate. Kane started the first half, captain in the absence of clear-to-leave Hugo Lloris and inscrutable as his name was greeted with a pre-match huge roar in the Optus Stadium. There will be great fluidity around him in this system. Oliver Skipp and Yves Bissouma worked hard to run in support and get beyond him from midfield in the first half - and the team created plenty of chances. James Maddison tried to link up, finding him with one pass but Kane’s touch and anticipation let him down. Kane provided for others in the first half. Richarlison, who replaced him at half-time, missed chances Kane would have devoured. Harry Kane will enjoy Ange Postecoglou's style of play if he does stick around at Tottenham FORGOTTEN MEN SHINE Giovani Lo Celso, Davinson Sanchez and Ivan Perisic are among the favourites to leave Tottenham in the Postecoglu clear-out but were all influential when they came on at half time. Lo Celso scored their first, pouncing on a header by Sanchez after a cross from Perisic. Croatia international Perisic had a hand in the second. His corner was headed in by Udogie to level at 2-2 but West Ham found another from another player tipped to leave. Gianluca Scamacca came off the bench to score the winner for West Ham, having been overlooked as Moyes gave teenage striker Mubama a start. Mubama, hero of their FA Youth Cup triumph last season, scored West Ham’s second. Giovani Lo Celso (left) scored Tottenham's first goal as Spurs went on to pull themselves level Gianluca Scamacca came off the bench to sink Tottenham with a 78th minute winner DAVIES IN THE CENTRE AND PERISIC UP FRONT At a glance, Spurs have a glut of five left-backs or left wing backs, although Postecoglu’s first friendly hinted that he views Ben Davies as an option in central defence and Ivan Perisic as cover up front wide on the left. With Ryan Sessegnon injured the left-back duties were shared by Reguilon and Udogie, who was impressive on his first appearance in a Tottenham shirt either tucking inside to boost numbers in midfield or charging forward down the wing. Udogie, an Italy U21 international who was signed from Udinese last year but spent another year in Serie A on loan, scored Tottenham’s equaliser at 2-2, a glancing header from a corner delivered by Perisic, who was influential on the left of a front three. Royal was solid at right back in the second half, although caused a commotion and picked up a yellow card for a late tackle on Emerson. Ivan Perisic (pictured) and Ben Davies playing in different roles than they have for Spurs Share or comment on this article: West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat e-mail 14 shares Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 12:40:33","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/13/73337131-0-image-a-45_1689683715716.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"'The amount of people there was incredible' - Kerry dethrone All-Ireland champions","link":"https://www.the42.ie/anna-galvin-kerry-2-6121627-Jul2023/","keywords":["The kingdom"],"creator":null,"video_url":null,"description":"Anna Galvin relives the joy of her side’s All-Ireland quarter-final win over Meath at the weekend.","content":"KERRY LADIES STAR Anna Galvin says her side never considered that victory over back-to-back All-Ireland champions Meath was certain until the sound of the final whistle at Austin Stack Park on Saturday evening. In what was a repeat of last year’s All-Ireland final, the hosts exacted revenge in biblical rain to book their place in the semi-finals. First-half goals from Síofra O’Shea and Niamh Carmody provided the platform to build their victory on as they built up a 10-point lead at half-time. Meath naturally stormed into the contest after the restart with the wind assisting them, but the Royals could only manage to shave six points off the difference before the full-time whistle as they bowed out by 2-8 to 0-10. “The atmosphere was unbelievable,” beams Galvin. “We didn’t think for any moment that we had it. We knew there was going to be a big kick in them. “The amount of people there was incredible on a miserable night. We were overwhelmed with that. The following all through this year has been building and building. And then the fact we were able to get a home quarter-final was class for people who mightn’t be able to travel to games far away. The crowd were immense and so important in the end stages of the game. When Meath were attacking, we were under a lot of pressure and they were chanting. It made some difference. “There were times when I looked around and couldn’t see any of my teammates, there was just people everywhere. There was lots of jersey signing and all sorts.” On the subject of jerseys, there was some confusion online regarding the kit that the Kerry ladies were wearing. Images were posted of the jerseys from the game, showing that players were wearing the strip which featured in last year’s All-Ireland final. Some suggested it was a motivational strategy to upset their Meath opponents. Galvin explains however, that that was not the case. “So we had a gold set of jerseys that don’t have that [All-Ireland final description] on them. We just had the All-Ireland set at half-time because we were absolutely drenched, so we had the second set there. I know there’s been a bit of a narrative on Twitter that we were using it for motivation but that might have been a bit of a risky move for management if that was the case. No, it was very much to manage the weather conditions.” After capturing the Division 1 title earlier this year, Kerry lost out to Cork in the Munster final. They recovered the group stages however, picking up crucial wins against Dublin and Cavan to set-up another duel with Meath. “We were so excited,” Galvin explains when asked for Kerry’s reaction to being paired with Meath in the quarter-finals. The defending champions have been through a turbulent period lately when they were left without a manager after the shock departure of Davy Nelson. Under Nelson, Meath won just one of their seven Division 1 league games this spring and lost the Leinster final to Dublin by six points recently. Jenny Rispin came in to take over the role. But Meath are still the Brendan Martin Cup holders, who hurt Kerry badly in last year’s All-Ireland decider. “It’s great to be able to play that has knocked you out,” Galvin continues, “who you’ve had such battles with over the years. Between the league final and the All-Ireland final, we obviously wanted to prove that we could beat Meath, and perform better than we had in those other games. We definitely felt we hadn’t done ourselves justice previously. Credit to Meath, they were unbelievable those few times. We just felt like we could do better against them.” Ladies football and camogie squads around the country have been carrying out a series of protests throughout the championship to demonstrate their frustrations with the LGFA and Camogie Association regarding player welfare and minimum standards. Galvin says that it’s possible that the protests are encouraging more people to attend the matches but hopes that their efforts will ultimately lead to effective change for players. “The protests have been great in terms of raising awareness. I think it’s been massive and I think people are aware of the discrepancies but the discrepancies get talked about and then it goes away and fades away. So, the protests have maintained the promotion of it. It helps with the support as well because people are coming out to say they’re behind us as well. We don’t want this to fade away again and this is our way of saying, ‘enough is enough. We need actual action.’”","pubDate":"2023-07-18 12:31:47","image_url":"https://c2.thejournal.ie/media/2023/07/kerry-v-meath-tg4-lgfa-all-ireland-senior-championship-quarter-final-2-630x434.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Ange Postecoglou takes blame for Tottenham’s poor set-piece defending in pre-season defeat to West Ham","link":"https://www.standard.co.uk/sport/football/ange-postecoglou-tottenham-west-ham-pre-season-defending-b1095128.html","keywords":["Football","Sport"],"creator":["Simon Collings"],"video_url":null,"description":"Spurs conceded twice from corners in the space of five first-half minutes as West Ham beat them in Perth","content":"boss says he should take the blame for Spurs’ defensive woes as they lost their opening game under him to . in Perth, with Gianluca Scamacca scoring the winner after Tottenham had come back from two goals down. Tottenham looked good going forward and they had 30 shots on goal during the 90 minutes as Giovani Lo Celso and Destiny Udogie found the net. But they were undone defensively and conceded two goals shortly after set-pieces in the first-half, as Danny Ings and Divin Mubuma struck. “The goals we conceded are partly on me - we haven’t done loads of work on those kind of defensive areas and structures around set-pieces and stuff,” said Postecoglou. “I can’t expect the guys to take everything on board. I thought for the most part defensively the pressure was really good and we didn’t allow too many chances as you said. “But we don’t want to be conceding goals with them producing a small number of chances. “But that’s not the sort of stuff worked on. There are still things in our structure where we could have moved the ball quicker and guys aren’t in exactly the position they need to be. “And there are a few things we need to keep developing, as is only natural as they get fitter to play this kind of football. We’re still in the early stages. At the same time we only have three or so weeks to get ready for the first game so we’re working hard.” Tottenham created plenty of chances in this first game under Postecoglou, living up to the Australian’s brand of attacking football. Destiny Udogie headed home an equaliser on his Tottenham debut , however, had a quiet first-half and was taken off at the break with the whole of the team that started the match. Fellow striker Richarlison didn’t fair much better after the interval, hitting the post and missing a good headed chance late on. “If we keep creating those kind of chances I have no doubt that they will finish them,” said Postecoglou. “They’re both quality strikers. For me the outcomes become secondary right now. How we’re playing our football, what kind of tempo we’re playing at, our structures are much more important than the outcomes. “Obviously there were some positive things, not all positive but certainly enough there to at least from my perspective say that the boys are willing, are trying, to change the way we play.”","pubDate":"2023-07-18 13:23:43","image_url":"https://static.standard.co.uk/2023/07/18/14/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea plot third Moises Caicedo bid after Brighton reject £70m offer","link":"https://www.standard.co.uk/sport/football/chelsea-fc-caicedo-third-bid-brighton-b1095127.html","keywords":["Football","Sport"],"creator":["Nizaar Kinsella"],"video_url":null,"description":"Chelsea will continue talks over Moises Caicedo after having an improved offer for the midfielder rejected by Brighton.","content":"will continue talks over after having an improved offer for the midfielder rejected by . The latest bid from Chelsea is worth a fixed £70million with no add-ons but has been turned down as Brighton hold out for around £100m for the Ecuador international. Chelsea, who had a £60m offer rejected last month, will now consider a fresh approach for Caicedo after making him their next transfer priority. The Blues need to strengthen their midfield after losing N'Golo Kante, Mateo Kovacic, Ruben Loftus-Cheek and Mason Mount this summer, having also sold Jorginho to Arsenal in January. Chelsea are adamant they will not pay over the odds for Caicedo but have been encouraged after the 21-year-year made it clear he wants to move to Stamford Bridge. The club hopes to find a compromise closer to £80m, but negotiating a deal with Brighton will not be easy. “It's a big team, that's true,” Caicedo said in an interview in Ecuador last week. “A very historic team and I can't say no because it is a very big, historic, beautiful team. The city as well is beautiful.” Caicedo has established himself as one of the best midfielders in the Premier League at Brighton, who feel the benchmark for his price tag has been set by Declan Rice's £105m move to Arsenal. Brighton owner Tony Bloom is emboldened by West Ham's valuation of Rice and Chelsea paying £106.8m to sign Enzo Fernandez from Benfica in January.","pubDate":"2023-07-18 13:23:18","image_url":"https://static.standard.co.uk/2023/06/19/06/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night","link":"https://www.dailymail.co.uk/sport/football/article-12310953/Lionel-Messi-smiles-steps-training-field-Inter-Miami-time-ahead-expected-debut-Friday-night.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Messi was pictured alongside fellow new signing and Barcelona legend Sergio Busquets, as well as the rest of the squad at the team's Fort Lauderdale base, where spirits appeared high.","content":"Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night Lionel Messi has begun training with Inter Miami after being unveiled on Sunday He stepped out and seemed in high spirits, chatting with his new teammates DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Updated: 14:38, 18 July 2023 e-mail 29 shares View comments Lionel Messi has stepped out onto the training field for the first time as an Inter Miami player, joining his teammates early on Tuesday morning. The Argentina superstar was officially unveiled in a huge ceremony on Sunday night and the hard work starts now ahead of his expected debut on Friday. Messi was pictured alongside fellow new signing and Barcelona legend Sergio Busquets , as well as the rest of the squad at the team's Fort Lauderdale base. Messi seemed in high spirits, chatting and laughing with Josef Martinez as the players were put through a light jog at the start of the session. Inter Miami have endured a dreadful season so far and will desperately hope that the injection of Messi and Busquets to the team can revive their fortunes. Lionel Messi smiles during his first training session with Inter Miami in Fort Lauderdale Messi chats with new teammate and Inter Miami forward Josef Martinez during the session Fans are eagerly awaiting the world's best player taking to the field against Cruz Azul on Friday Fellow new signing Sergio Busquets (center) was also put through his paces by coaches The entire team seemed rejuvenated by the arrival of Barcelona legends Messi and Busquets Messi laughs as the team are addressed by coaches during the training session at Florida Blue Messi. Busquets. Whole squad's here. Our first look at @InterMiamiCF 's new star duo on the training pitch. ¿ pic.twitter.com/i5oDYbcfvP — Major League Soccer (@MLS) July 18, 2023 Off-the-field, Messi jersey sales are already through the roof and Inter Miami are expected to sell out the remainder of their matches with ease this season. Messi's first appearance in the pink of his new team is anticipated to come on Friday night in Major League Soccer's new Leagues Cup competition. Tata Martino's side face Cruz Azul at their DRV PNK Stadium, with one ticket listed for a remarkable $110,000 as fans clamor for their chance to see the GOAT in action. Share or comment on this article: Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night e-mail 29 shares Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 13:18:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/14/73339583-0-image-a-11_1689686017886.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Agent Lashes Out After Arubi’s New Deal","link":"https://www.snl24.com/soccerladuma/Local/Premiership/SuperSport-Utd/agent-confirms-new-deal-for-washington-arubi-20230718","keywords":null,"creator":null,"video_url":null,"description":"A local football intermediary has lashed out at reports which claimed that veteran goalkeeper Washington Arubi might have signed contracts with different clubs.","content":"A local football intermediary has lashed out at reports which claimed that veteran goalkeeper Washington Arubi might have signed contracts with different clubs. Some reports claimed that Arubi might have signed with Royal AM and Sekhukhune United respectively after the relegation of Marumo Gallants. As revealed by the Siya crew, after the Tshwane giants agreed to a deal with Gallants, which is the club that the 37-year-old has been playing for. Contacted for comment, Arubi’s representative Ratshibvumo Mulovhedzi from Rush Hour Sports Management confirmed the deal with the Tshwane giants. “Yes, it is true that Washington Arubi will be playing for a new club in the new season. A deal has been agreed to between SuperSport United and Marumo Gallants for the player’s services,” said Mulovhedzi. “We are excited about this deal because it ends ongoing speculation about the player’s future. As we have always maintained, the player didn’t sign with any club as he still had a contract with Marumo Gallants. Marumo Gallants chairman never said he doesn’t want to allow Washington to move on with his career, and he was happy to conclude a deal with any club that approached him. The player has been given the chairman’s blessings to join SuperSport,” concluded the intermediary.","pubDate":"2023-07-18 13:10:22","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | McCarthy’s Positive Energy Shines Through At Man United","link":"https://www.snl24.com/soccerladuma/Fan-Park/benni-mccarthy-stays-bringing-positive-vibes-to-man-united-20230718","keywords":null,"creator":null,"video_url":null,"description":"Benni McCarthy continues to be the source for good vibes at Manchester United.","content":"Manchester United's first team coach Benni McCarthy received a lovely welcome upon his return to the club, proving that he brings only good vibes to the club. Check it out! South African football legend and Man United striker coach Benni McCarthy brings the positive energy to the club, as seen in a viral video of the players welcoming him back for pre-season yesterday. Since joining Erik ten Hag's staff at the star of last season, McCarthy has been a popular member and proven vital in Marcus Rashford's resurgence among other things. Let's take a closer look... In a video that's been circulating heavily online since yesterday, McCarthy was warmly embraced by United stars Alejandro Garnacho, Victor Lindelof, Diogo Dalot, Facundo Pellistri, and Anthony Elanga on the Carrington training grounds. The former Porto, Ajax Amsterdam, and Blackburn Rovers striker got involved straight away with a rondo, looking as sharp as he did during his playing days. The comments to the post saw the likes of Lisandro Martinez and Amad Diallo showing love, showing just how many players at the club value McCarthy's presence. McCarthy has been a valuable member of Manchester United’s coaching staff since being hired by Erik ten Hag last year and has been instrumental with helping Marcus Rashford bagging 31 goals in all competitions last season. The England international has spoken highly about McCarthy in an interview with SuperSport TV, saying he's made great impact on the forwards: Tipped to be United's captain for the upcoming season, Portuguese star Bruno Fernandes is also a huge fan of Benni, and also spoke to SuperSport TV's Julia Stuart about his experience of working with his fellow FC Porto alumni. He also mentioned that type of energy that McCarthy brings to the dressing room: \"He's a really funny person, he's always positive. He's a good energy in the dressing room, [and] on the training ground.\" You must be to read and post comments.","pubDate":"2023-07-18 13:01:26","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Man Utd legend Gary Neville leads Newcastle and Arsenal stars in support of Laura Woods’ Champions League move","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-legend-gary-neville-leads-newcastle-and-arsenal-stars-in-support-of-laura-woods-champions-league-move-4222786","keywords":["Manchester United","Football","Sport"],"creator":["Toby Bryant"],"video_url":null,"description":"Laura Woods has confirmed her hotly-anticipated move to TNT Sports ahead of the new season with congratulations messages pouring in online.","content":"Laura Woods has confirmed her hotly-anticipated move to TNT Sports ahead of the new season with congratulations messages pouring in online. was one of many pundits and football stars to send well wishes to former talkSPORT presenter as she confirmed a much-expected TNT Sports appointment. The 36-year-old will be the lead presenter for Champions League coverage on the channel, which is to replace BT Sport. She is joined by Lynsey Hipgrave on Premier League coverage, Reshmin Chowdhury on Champions League matches and Jules Breach for Europa League action. Advertisement Advertisement The other major appointment come as Ally McCoist, Wood's talkSPORT radio partner, joins at TNT's major football co-commentator. Darren Fletcher and Adam Summerton will also continue in commentary roles. Elsewhere, , Peter Crouch, Joe Cole, Rachel Brown-Finnis, Owen Hargreaves, Steve McManaman, Joleon Lescott, Michael Owen, Paul Scholes and Robbie Savage have all landed punditry and co‑commentary positions. The shake-up comes after Jake Humphrey announced his departure from BT Sport in May and Des Kelly also left the broadcasters after the Champions League final. Messages of congratulations flooded in for Woods as she confirmed the news on Instagram this morning. She wrote: \"The New Chapter…Oh, hi TNT Sports. And helloooooo Champions League, *cue CL music*. A very, very proud day for me.\" Advertisement Advertisement Manchester United legend turned pundit Gary Neville was one of the first to share his excitement for Woods. He commented: \"Well done Laura and Congratulations.\" Arsenal hero Ian Wright and former Newcastle United talisman Alan Shearer also congratulated their broadcasting colleague as Ally McCoist joked that Woods had 'never told me'. Alex Scott also welcomed the 'big moves' from her friend and boxing star Tony Bellew wrote 'well done mate'. Premier League stars Ben Foster, Carlton Cole, Steve Sidwell and Danny Simpson were also on hand to welcome the news. will enter the football broadcasting world for £29.99 a month, the same price as its BT Sports predecessor. TNT merged with BT in September 2022 under the Warner Brothers/Discovery media conglomerate. Advertisement Advertisement TNT will take over Champions League rights from BT until 2027, as well as 52 Premier League games until 2025.","pubDate":"2023-07-18 13:00:01","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/07/18/12/GettyImages-1421378794.jpg?width=1200&auto=webp","source_id":"manchesterworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Politics, Property, Corporate: The Limitless ‘King Kenny’","link":"https://www.snl24.com/soccerladuma/Fan-Park/kenny-niemachs-post-professional-football-career-20230717","keywords":null,"creator":null,"video_url":null,"description":"Ex-Kaizer Chiefs player Kenny Niemach has found plenty of success after football and is now enjoying a new career path.","content":"Former Kaizer Chiefs striker Kenny Niemach has found plenty of success after football and is now enjoying a new career path in real estate. Check it out! After retiring from football at the age of 32, former striker Kenny Niemach has proven to be a man of many talents. From radio presenting to premium corporate gigs and getting involved in selling property, Niemach has found success in a host of avenues after stepping away from football. Let's take a closer look at Niemach's post football journey and his current gig in real estate. Former Amakhosi, Sundowns and Moroka Swallows gunman Kenny Niemach hasn't limited himself and his abilities after retiring relatively early. Known as \"King Kenny\" during his successful spell at the Dube Birds, Niemach has tried his hand as radio presenter and TV analyst for SuperSport and found some success in the corporate world. The 51-year-old also ventured into politics back in 2021, joining the United Independent Movement (UIM) party ahead of the Local Government elections. Niemach worked as a COO at Joburg-based IT company Yookoo Incorporated and with the company he launched a cab-hailing app, Yookoo Rider, back in 2017 to rival the likes of Uber and Bolt. Niemach is now working as a real estate broker for Rawson Property Group and uses social media as a platform to sell houses. Take a look: You must be to read and post comments.","pubDate":"2023-07-18 12:46:30","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America","link":"https://www.dailymail.co.uk/sport/football/article-12310715/Arsenal-Mikel-Arteta-son-Gabriel-14-spotted-coaching-kit-pre-season.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mikel Arteta's teenage son Gabriel was pictured in Arsenal training during their pre-season tour on Monday. The Premier League side are preparing for the new campaign at a training camp in America.","content":"Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America Mikel Arteta's son Gabriel was pictured in Arsenal's pre-season training session Gunners are currently undergoing preparation for the new season in America And Gabriel, 14, watched on in his own initialed coaching staff kit on Monday By Isaan Khan and Max Mathews For Mailonline Updated: 13:43, 18 July 2023 e-mail 2 View comments Mikel Arteta 's teenage son Gabriel was pictured in Arsenal training during their pre-season tour of America on Monday. The Premier League side are undergoing preparation for the new campaign at a training camp in America. The Gunners drew 1-1 against German side Nurnberg in their first pre-season friendly last Thursday, before they take on the MLS All-Stars a week later . And in a surprising development, Arteta's son Gabriel, just 14 years old, was spotted at Arsenal's training session open to the public on Monday. Gabriel wore a red Arsenal training shirt used by other coaches, hinting he is there as part of the coaching staff rather than training as a player. Mikel Arteta's son Gabriel, 14, was pictured in Arsenal training during pre-season on Monday The teenager stood and watched as four Gunners players worked at a public training session According to Mail Sport's Isaan Khan, he did not seem to participate in the 15-minute session According to Mail Spor t's Isaan Khan, he milled around the 15-minute session without seeming to directly participate. Pictures released on social media show Gabriel facing another coach as Rob Holding, Gabriel Jesus, Oleksandr Zinchenko and Eddie Nketiah crouch down into some coloured cones as part of their physical training. Arteta insisted on Monday that Arsenal could make further signings despite already spending more than £200million this summer. Mikel Arteta says Arsenal could make further signings despite already spending £200million Club record signing Declan Rice joined Arsenal from West Ham on Saturday for £105million Arsenal have also secured the signings of Kai Havertz (left) and Jurrien Timber (right) The Spaniard has brought in West Ham defensive midfielder Declan Rice for a club-record £105million, forward Kai Havertz from Chelsea and Ajax's Jurrien Timber. Arteta said: 'Let's see (about more signings), there's still a lot of time left in the market. 'There's a lot of expectations in some of our players, so we will have to see how things develop in the next couple of weeks. 'We will be alert, there's still time to do things and there's still time for exits obviously.' On the opening day of Arsenal's US tour on Monday, the 29-man squad — including new signings Rice, Timber and Havertz — trained at George Mason University, near Washington DC . Arteta was full of praise for £105m club-record signing Rice and backed him to succeed in north London. 'His leadership, his aura, the experience he already has in the league. He's going to bring our team to a different dimension,' added Arteta. 'He's got the physical qualities as well that we've been missing for a while.' Share or comment on this article: Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 12:43:12","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/13/73336541-0-image-m-52_1689682359357.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat","link":"https://www.dailymail.co.uk/sport/football/article-12310747/West-Ham-prove-theres-life-Declan-Rice-Harry-Kane-enjoy-Ange-Postecoglous-energy-stays-FIVE-THINGS-LEARNED-Tottenhams-pre-season-defeat.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MATT BARLOW: Tottenham suffered a 3-2 defeat to West Ham in their first game under Ange Postecoglou, on their pre-season tour of his homeland Australia.","content":"West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat West Ham secured a a 3-2 victory over Tottenham in Perth on Tuesday Gianluca Scamacca scored the winner after Spurs had come from 2-0 down Mail Sport takes a look at five things we learned from the pre-season game By Matt Barlow for MailOnline Updated: 13:55 BST, 18 July 2023 e-mail 14 shares View comments Tottenham suffered a 3-2 defeat to West Ham in their first game under Ange Postecoglou , on their pre-season tour of his homeland Australia. A quickfire double from Danny Ings and Divin Mubama gave the Hammers a 2-0 lead before Giovani Lo Celso and Destiny Udogie pulled Spurs back in the second-half. Gianluca Scamacca though netted the winner for David Moyes' side in a tough opening match for Tottenham's new manager. Postecoglou handed first outings for new signings James Maddison, Manor Solomon and Guglielmo Vicario who all started the match. Here, Sportsmail's Matt Barlow looks at five things we learned from the encounter. West Ham beat rivals Tottenham 3-2 after an impressive pre-season outing in Perth, Australia ANGE'S LICENCE TO THRILL When Ange Postecoglu says he is prepared to play with risk he means it. The starting back four in his first selection included flying Spanish full backs Pedro Porro and Sergio Reguilon, released to flood midfield but the licence to thrill left them ever so vulnerable to the counter-attack against West Ham who lined up in an orthodox 442 formation. Danny Ings’s opener was a reminder of the defensive frailties of Porro, not closing down the cross, and Reguilon, defended tamely at the back post. Divin Mubama headed in the second as Japhet Tanganga and Reguilon failed to pick up at a corner. Still, these friendlies are glorified training sessions, intended for Postecoglu to work on fitness and learn about his players - and for them to learn about the shape and rhythms he expects. They were altogether more coherent as they fought back in the second half, with Emerson Royal and Destiny Udogie at fullback and Pierre-Emile Hojbjerg screening. Ange Postecoglou played his first game as Spurs manager with risk against West Ham's 4-4-2 THERE'S LIFE AFTER RICE David Moyes seems relieved to be over the Declan Rice transfer saga and his team are proving there is life after their captain’s departure for Arsenal. They scored six against Perth Glory on Saturday and punished Tottenham’s flimsy defence shield with three. Angelo Ogbonna led the Hammers out, although the club’s social media channels thought Lukasz Fabianski was wearing the armband. Senior figures stepped up to lead in their own way. Ogbonna and Kurt Zouma made it through 45 minutes without giving Harry Kane a glimpse of goal, and kept Spurs out for almost an hour. Veteran keeper Fabianski made a string of fine saves before his team were overwhelmed by the fresh legs of Tottenham. Postecoglu made 11 half-time changes. Moyes saved his changes for later in the game and ended up with a very young team on the pitch. West Ham have started the pre-season strong despite the sale of influential star Declan Rice (Danny Ings pictured after scoring the Hammer's opener against Tottenham) West Ham proved there's life without Rice - who joined Arsenal for a massive £105m fee KANE WILL ENJOY ANGE'S ENERGY If Kane sticks around he will enjoy the whirl of energy Postecoglu is trying to generate. Kane started the first half, captain in the absence of clear-to-leave Hugo Lloris and inscrutable as his name was greeted with a pre-match huge roar in the Optus Stadium. There will be great fluidity around him in this system. Oliver Skipp and Yves Bissouma worked hard to run in support and get beyond him from midfield in the first half - and the team created plenty of chances. James Maddison tried to link up, finding him with one pass but Kane’s touch and anticipation let him down. Kane provided for others in the first half. Richarlison, who replaced him at half-time, missed chances Kane would have devoured. Harry Kane will enjoy Ange Postecoglou's style of play if he does stick around at Tottenham FORGOTTEN MEN SHINE Giovani Lo Celso, Davinson Sanchez and Ivan Perisic are among the favourites to leave Tottenham in the Postecoglu clear-out but were all influential when they came on at half time. Lo Celso scored their first, pouncing on a header by Sanchez after a cross from Perisic. Croatia international Perisic had a hand in the second. His corner was headed in by Udogie to level at 2-2 but West Ham found another from another player tipped to leave. Gianluca Scamacca came off the bench to score the winner for West Ham, having been overlooked as Moyes gave teenage striker Mubama a start. Mubama, hero of their FA Youth Cup triumph last season, scored West Ham’s second. Giovani Lo Celso (left) scored Tottenham's first goal as Spurs went on to pull themselves level Gianluca Scamacca came off the bench to sink Tottenham with a 78th minute winner DAVIES IN THE CENTRE AND PERISIC UP FRONT At a glance, Spurs have a glut of five left-backs or left wing backs, although Postecoglu’s first friendly hinted that he views Ben Davies as an option in central defence and Ivan Perisic as cover up front wide on the left. With Ryan Sessegnon injured the left-back duties were shared by Reguilon and Udogie, who was impressive on his first appearance in a Tottenham shirt either tucking inside to boost numbers in midfield or charging forward down the wing. Udogie, an Italy U21 international who was signed from Udinese last year but spent another year in Serie A on loan, scored Tottenham’s equaliser at 2-2, a glancing header from a corner delivered by Perisic, who was influential on the left of a front three. Royal was solid at right back in the second half, although caused a commotion and picked up a yellow card for a late tackle on Emerson. Ivan Perisic (pictured) and Ben Davies playing in different roles than they have for Spurs Share or comment on this article: West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat e-mail 14 shares Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 12:40:33","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/13/73337131-0-image-a-45_1689683715716.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"'The amount of people there was incredible' - Kerry dethrone All-Ireland champions","link":"https://www.the42.ie/anna-galvin-kerry-2-6121627-Jul2023/","keywords":["The kingdom"],"creator":null,"video_url":null,"description":"Anna Galvin relives the joy of her side’s All-Ireland quarter-final win over Meath at the weekend.","content":"KERRY LADIES STAR Anna Galvin says her side never considered that victory over back-to-back All-Ireland champions Meath was certain until the sound of the final whistle at Austin Stack Park on Saturday evening. In what was a repeat of last year’s All-Ireland final, the hosts exacted revenge in biblical rain to book their place in the semi-finals. First-half goals from Síofra O’Shea and Niamh Carmody provided the platform to build their victory on as they built up a 10-point lead at half-time. Meath naturally stormed into the contest after the restart with the wind assisting them, but the Royals could only manage to shave six points off the difference before the full-time whistle as they bowed out by 2-8 to 0-10. “The atmosphere was unbelievable,” beams Galvin. “We didn’t think for any moment that we had it. We knew there was going to be a big kick in them. “The amount of people there was incredible on a miserable night. We were overwhelmed with that. The following all through this year has been building and building. And then the fact we were able to get a home quarter-final was class for people who mightn’t be able to travel to games far away. The crowd were immense and so important in the end stages of the game. When Meath were attacking, we were under a lot of pressure and they were chanting. It made some difference. “There were times when I looked around and couldn’t see any of my teammates, there was just people everywhere. There was lots of jersey signing and all sorts.” On the subject of jerseys, there was some confusion online regarding the kit that the Kerry ladies were wearing. Images were posted of the jerseys from the game, showing that players were wearing the strip which featured in last year’s All-Ireland final. Some suggested it was a motivational strategy to upset their Meath opponents. Galvin explains however, that that was not the case. “So we had a gold set of jerseys that don’t have that [All-Ireland final description] on them. We just had the All-Ireland set at half-time because we were absolutely drenched, so we had the second set there. I know there’s been a bit of a narrative on Twitter that we were using it for motivation but that might have been a bit of a risky move for management if that was the case. No, it was very much to manage the weather conditions.” After capturing the Division 1 title earlier this year, Kerry lost out to Cork in the Munster final. They recovered the group stages however, picking up crucial wins against Dublin and Cavan to set-up another duel with Meath. “We were so excited,” Galvin explains when asked for Kerry’s reaction to being paired with Meath in the quarter-finals. The defending champions have been through a turbulent period lately when they were left without a manager after the shock departure of Davy Nelson. Under Nelson, Meath won just one of their seven Division 1 league games this spring and lost the Leinster final to Dublin by six points recently. Jenny Rispin came in to take over the role. But Meath are still the Brendan Martin Cup holders, who hurt Kerry badly in last year’s All-Ireland decider. “It’s great to be able to play that has knocked you out,” Galvin continues, “who you’ve had such battles with over the years. Between the league final and the All-Ireland final, we obviously wanted to prove that we could beat Meath, and perform better than we had in those other games. We definitely felt we hadn’t done ourselves justice previously. Credit to Meath, they were unbelievable those few times. We just felt like we could do better against them.” Ladies football and camogie squads around the country have been carrying out a series of protests throughout the championship to demonstrate their frustrations with the LGFA and Camogie Association regarding player welfare and minimum standards. Galvin says that it’s possible that the protests are encouraging more people to attend the matches but hopes that their efforts will ultimately lead to effective change for players. “The protests have been great in terms of raising awareness. I think it’s been massive and I think people are aware of the discrepancies but the discrepancies get talked about and then it goes away and fades away. So, the protests have maintained the promotion of it. It helps with the support as well because people are coming out to say they’re behind us as well. We don’t want this to fade away again and this is our way of saying, ‘enough is enough. We need actual action.’”","pubDate":"2023-07-18 12:31:47","image_url":"https://c2.thejournal.ie/media/2023/07/kerry-v-meath-tg4-lgfa-all-ireland-senior-championship-quarter-final-2-630x434.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Ange Postecoglou takes blame for Tottenham’s poor set-piece defending in pre-season defeat to West Ham","link":"https://www.standard.co.uk/sport/football/ange-postecoglou-tottenham-west-ham-pre-season-defending-b1095128.html","keywords":["Football","Sport"],"creator":["Simon Collings"],"video_url":null,"description":"Spurs conceded twice from corners in the space of five first-half minutes as West Ham beat them in Perth","content":"boss says he should take the blame for Spurs’ defensive woes as they lost their opening game under him to . in Perth, with Gianluca Scamacca scoring the winner after Tottenham had come back from two goals down. Tottenham looked good going forward and they had 30 shots on goal during the 90 minutes as Giovani Lo Celso and Destiny Udogie found the net. But they were undone defensively and conceded two goals shortly after set-pieces in the first-half, as Danny Ings and Divin Mubuma struck. “The goals we conceded are partly on me - we haven’t done loads of work on those kind of defensive areas and structures around set-pieces and stuff,” said Postecoglou. “I can’t expect the guys to take everything on board. I thought for the most part defensively the pressure was really good and we didn’t allow too many chances as you said. “But we don’t want to be conceding goals with them producing a small number of chances. “But that’s not the sort of stuff worked on. There are still things in our structure where we could have moved the ball quicker and guys aren’t in exactly the position they need to be. “And there are a few things we need to keep developing, as is only natural as they get fitter to play this kind of football. We’re still in the early stages. At the same time we only have three or so weeks to get ready for the first game so we’re working hard.” Tottenham created plenty of chances in this first game under Postecoglou, living up to the Australian’s brand of attacking football. Destiny Udogie headed home an equaliser on his Tottenham debut , however, had a quiet first-half and was taken off at the break with the whole of the team that started the match. Fellow striker Richarlison didn’t fair much better after the interval, hitting the post and missing a good headed chance late on. “If we keep creating those kind of chances I have no doubt that they will finish them,” said Postecoglou. “They’re both quality strikers. For me the outcomes become secondary right now. How we’re playing our football, what kind of tempo we’re playing at, our structures are much more important than the outcomes. “Obviously there were some positive things, not all positive but certainly enough there to at least from my perspective say that the boys are willing, are trying, to change the way we play.”","pubDate":"2023-07-18 13:23:43","image_url":"https://static.standard.co.uk/2023/07/18/14/newFile-2.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea plot third Moises Caicedo bid after Brighton reject £70m offer","link":"https://www.standard.co.uk/sport/football/chelsea-fc-caicedo-third-bid-brighton-b1095127.html","keywords":["Football","Sport"],"creator":["Nizaar Kinsella"],"video_url":null,"description":"Chelsea will continue talks over Moises Caicedo after having an improved offer for the midfielder rejected by Brighton.","content":"will continue talks over after having an improved offer for the midfielder rejected by . The latest bid from Chelsea is worth a fixed £70million with no add-ons but has been turned down as Brighton hold out for around £100m for the Ecuador international. Chelsea, who had a £60m offer rejected last month, will now consider a fresh approach for Caicedo after making him their next transfer priority. The Blues need to strengthen their midfield after losing N'Golo Kante, Mateo Kovacic, Ruben Loftus-Cheek and Mason Mount this summer, having also sold Jorginho to Arsenal in January. Chelsea are adamant they will not pay over the odds for Caicedo but have been encouraged after the 21-year-year made it clear he wants to move to Stamford Bridge. The club hopes to find a compromise closer to £80m, but negotiating a deal with Brighton will not be easy. “It's a big team, that's true,” Caicedo said in an interview in Ecuador last week. “A very historic team and I can't say no because it is a very big, historic, beautiful team. The city as well is beautiful.” Caicedo has established himself as one of the best midfielders in the Premier League at Brighton, who feel the benchmark for his price tag has been set by Declan Rice's £105m move to Arsenal. Brighton owner Tony Bloom is emboldened by West Ham's valuation of Rice and Chelsea paying £106.8m to sign Enzo Fernandez from Benfica in January.","pubDate":"2023-07-18 13:23:18","image_url":"https://static.standard.co.uk/2023/06/19/06/newFile-4.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night","link":"https://www.dailymail.co.uk/sport/football/article-12310953/Lionel-Messi-smiles-steps-training-field-Inter-Miami-time-ahead-expected-debut-Friday-night.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Messi was pictured alongside fellow new signing and Barcelona legend Sergio Busquets, as well as the rest of the squad at the team's Fort Lauderdale base, where spirits appeared high.","content":"Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night Lionel Messi has begun training with Inter Miami after being unveiled on Sunday He stepped out and seemed in high spirits, chatting with his new teammates DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Updated: 14:38, 18 July 2023 e-mail 29 shares View comments Lionel Messi has stepped out onto the training field for the first time as an Inter Miami player, joining his teammates early on Tuesday morning. The Argentina superstar was officially unveiled in a huge ceremony on Sunday night and the hard work starts now ahead of his expected debut on Friday. Messi was pictured alongside fellow new signing and Barcelona legend Sergio Busquets , as well as the rest of the squad at the team's Fort Lauderdale base. Messi seemed in high spirits, chatting and laughing with Josef Martinez as the players were put through a light jog at the start of the session. Inter Miami have endured a dreadful season so far and will desperately hope that the injection of Messi and Busquets to the team can revive their fortunes. Lionel Messi smiles during his first training session with Inter Miami in Fort Lauderdale Messi chats with new teammate and Inter Miami forward Josef Martinez during the session Fans are eagerly awaiting the world's best player taking to the field against Cruz Azul on Friday Fellow new signing Sergio Busquets (center) was also put through his paces by coaches The entire team seemed rejuvenated by the arrival of Barcelona legends Messi and Busquets Messi laughs as the team are addressed by coaches during the training session at Florida Blue Messi. Busquets. Whole squad's here. Our first look at @InterMiamiCF 's new star duo on the training pitch. ¿ pic.twitter.com/i5oDYbcfvP — Major League Soccer (@MLS) July 18, 2023 Off-the-field, Messi jersey sales are already through the roof and Inter Miami are expected to sell out the remainder of their matches with ease this season. Messi's first appearance in the pink of his new team is anticipated to come on Friday night in Major League Soccer's new Leagues Cup competition. Tata Martino's side face Cruz Azul at their DRV PNK Stadium, with one ticket listed for a remarkable $110,000 as fans clamor for their chance to see the GOAT in action. Share or comment on this article: Lionel Messi is all smiles as he steps out onto the training field with Inter Miami for the first time... ahead of his expected debut on Friday night e-mail 29 shares Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 13:18:13","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/14/73339583-0-image-a-11_1689686017886.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Agent Lashes Out After Arubi’s New Deal","link":"https://www.snl24.com/soccerladuma/Local/Premiership/SuperSport-Utd/agent-confirms-new-deal-for-washington-arubi-20230718","keywords":null,"creator":null,"video_url":null,"description":"A local football intermediary has lashed out at reports which claimed that veteran goalkeeper Washington Arubi might have signed contracts with different clubs.","content":"A local football intermediary has lashed out at reports which claimed that veteran goalkeeper Washington Arubi might have signed contracts with different clubs. Some reports claimed that Arubi might have signed with Royal AM and Sekhukhune United respectively after the relegation of Marumo Gallants. As revealed by the Siya crew, after the Tshwane giants agreed to a deal with Gallants, which is the club that the 37-year-old has been playing for. Contacted for comment, Arubi’s representative Ratshibvumo Mulovhedzi from Rush Hour Sports Management confirmed the deal with the Tshwane giants. “Yes, it is true that Washington Arubi will be playing for a new club in the new season. A deal has been agreed to between SuperSport United and Marumo Gallants for the player’s services,” said Mulovhedzi. “We are excited about this deal because it ends ongoing speculation about the player’s future. As we have always maintained, the player didn’t sign with any club as he still had a contract with Marumo Gallants. Marumo Gallants chairman never said he doesn’t want to allow Washington to move on with his career, and he was happy to conclude a deal with any club that approached him. The player has been given the chairman’s blessings to join SuperSport,” concluded the intermediary.","pubDate":"2023-07-18 13:10:22","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | McCarthy’s Positive Energy Shines Through At Man United","link":"https://www.snl24.com/soccerladuma/Fan-Park/benni-mccarthy-stays-bringing-positive-vibes-to-man-united-20230718","keywords":null,"creator":null,"video_url":null,"description":"Benni McCarthy continues to be the source for good vibes at Manchester United.","content":"Manchester United's first team coach Benni McCarthy received a lovely welcome upon his return to the club, proving that he brings only good vibes to the club. Check it out! South African football legend and Man United striker coach Benni McCarthy brings the positive energy to the club, as seen in a viral video of the players welcoming him back for pre-season yesterday. Since joining Erik ten Hag's staff at the star of last season, McCarthy has been a popular member and proven vital in Marcus Rashford's resurgence among other things. Let's take a closer look... In a video that's been circulating heavily online since yesterday, McCarthy was warmly embraced by United stars Alejandro Garnacho, Victor Lindelof, Diogo Dalot, Facundo Pellistri, and Anthony Elanga on the Carrington training grounds. The former Porto, Ajax Amsterdam, and Blackburn Rovers striker got involved straight away with a rondo, looking as sharp as he did during his playing days. The comments to the post saw the likes of Lisandro Martinez and Amad Diallo showing love, showing just how many players at the club value McCarthy's presence. McCarthy has been a valuable member of Manchester United’s coaching staff since being hired by Erik ten Hag last year and has been instrumental with helping Marcus Rashford bagging 31 goals in all competitions last season. The England international has spoken highly about McCarthy in an interview with SuperSport TV, saying he's made great impact on the forwards: Tipped to be United's captain for the upcoming season, Portuguese star Bruno Fernandes is also a huge fan of Benni, and also spoke to SuperSport TV's Julia Stuart about his experience of working with his fellow FC Porto alumni. He also mentioned that type of energy that McCarthy brings to the dressing room: \"He's a really funny person, he's always positive. He's a good energy in the dressing room, [and] on the training ground.\" You must be to read and post comments.","pubDate":"2023-07-18 13:01:26","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Man Utd legend Gary Neville leads Newcastle and Arsenal stars in support of Laura Woods’ Champions League move","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-legend-gary-neville-leads-newcastle-and-arsenal-stars-in-support-of-laura-woods-champions-league-move-4222786","keywords":["Manchester United","Football","Sport"],"creator":["Toby Bryant"],"video_url":null,"description":"Laura Woods has confirmed her hotly-anticipated move to TNT Sports ahead of the new season with congratulations messages pouring in online.","content":"Laura Woods has confirmed her hotly-anticipated move to TNT Sports ahead of the new season with congratulations messages pouring in online. was one of many pundits and football stars to send well wishes to former talkSPORT presenter as she confirmed a much-expected TNT Sports appointment. The 36-year-old will be the lead presenter for Champions League coverage on the channel, which is to replace BT Sport. She is joined by Lynsey Hipgrave on Premier League coverage, Reshmin Chowdhury on Champions League matches and Jules Breach for Europa League action. Advertisement Advertisement The other major appointment come as Ally McCoist, Wood's talkSPORT radio partner, joins at TNT's major football co-commentator. Darren Fletcher and Adam Summerton will also continue in commentary roles. Elsewhere, , Peter Crouch, Joe Cole, Rachel Brown-Finnis, Owen Hargreaves, Steve McManaman, Joleon Lescott, Michael Owen, Paul Scholes and Robbie Savage have all landed punditry and co‑commentary positions. The shake-up comes after Jake Humphrey announced his departure from BT Sport in May and Des Kelly also left the broadcasters after the Champions League final. Messages of congratulations flooded in for Woods as she confirmed the news on Instagram this morning. She wrote: \"The New Chapter…Oh, hi TNT Sports. And helloooooo Champions League, *cue CL music*. A very, very proud day for me.\" Advertisement Advertisement Manchester United legend turned pundit Gary Neville was one of the first to share his excitement for Woods. He commented: \"Well done Laura and Congratulations.\" Arsenal hero Ian Wright and former Newcastle United talisman Alan Shearer also congratulated their broadcasting colleague as Ally McCoist joked that Woods had 'never told me'. Alex Scott also welcomed the 'big moves' from her friend and boxing star Tony Bellew wrote 'well done mate'. Premier League stars Ben Foster, Carlton Cole, Steve Sidwell and Danny Simpson were also on hand to welcome the news. will enter the football broadcasting world for £29.99 a month, the same price as its BT Sports predecessor. TNT merged with BT in September 2022 under the Warner Brothers/Discovery media conglomerate. Advertisement Advertisement TNT will take over Champions League rights from BT until 2027, as well as 52 Premier League games until 2025.","pubDate":"2023-07-18 13:00:01","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/07/18/12/GettyImages-1421378794.jpg?width=1200&auto=webp","source_id":"manchesterworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Politics, Property, Corporate: The Limitless ‘King Kenny’","link":"https://www.snl24.com/soccerladuma/Fan-Park/kenny-niemachs-post-professional-football-career-20230717","keywords":null,"creator":null,"video_url":null,"description":"Ex-Kaizer Chiefs player Kenny Niemach has found plenty of success after football and is now enjoying a new career path.","content":"Former Kaizer Chiefs striker Kenny Niemach has found plenty of success after football and is now enjoying a new career path in real estate. Check it out! After retiring from football at the age of 32, former striker Kenny Niemach has proven to be a man of many talents. From radio presenting to premium corporate gigs and getting involved in selling property, Niemach has found success in a host of avenues after stepping away from football. Let's take a closer look at Niemach's post football journey and his current gig in real estate. Former Amakhosi, Sundowns and Moroka Swallows gunman Kenny Niemach hasn't limited himself and his abilities after retiring relatively early. Known as \"King Kenny\" during his successful spell at the Dube Birds, Niemach has tried his hand as radio presenter and TV analyst for SuperSport and found some success in the corporate world. The 51-year-old also ventured into politics back in 2021, joining the United Independent Movement (UIM) party ahead of the Local Government elections. Niemach worked as a COO at Joburg-based IT company Yookoo Incorporated and with the company he launched a cab-hailing app, Yookoo Rider, back in 2017 to rival the likes of Uber and Bolt. Niemach is now working as a real estate broker for Rawson Property Group and uses social media as a platform to sell houses. Take a look: You must be to read and post comments.","pubDate":"2023-07-18 12:46:30","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America","link":"https://www.dailymail.co.uk/sport/football/article-12310715/Arsenal-Mikel-Arteta-son-Gabriel-14-spotted-coaching-kit-pre-season.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mikel Arteta's teenage son Gabriel was pictured in Arsenal training during their pre-season tour on Monday. The Premier League side are preparing for the new campaign at a training camp in America.","content":"Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America Mikel Arteta's son Gabriel was pictured in Arsenal's pre-season training session Gunners are currently undergoing preparation for the new season in America And Gabriel, 14, watched on in his own initialed coaching staff kit on Monday By Isaan Khan and Max Mathews For Mailonline Updated: 13:43, 18 July 2023 e-mail 2 View comments Mikel Arteta 's teenage son Gabriel was pictured in Arsenal training during their pre-season tour of America on Monday. The Premier League side are undergoing preparation for the new campaign at a training camp in America. The Gunners drew 1-1 against German side Nurnberg in their first pre-season friendly last Thursday, before they take on the MLS All-Stars a week later . And in a surprising development, Arteta's son Gabriel, just 14 years old, was spotted at Arsenal's training session open to the public on Monday. Gabriel wore a red Arsenal training shirt used by other coaches, hinting he is there as part of the coaching staff rather than training as a player. Mikel Arteta's son Gabriel, 14, was pictured in Arsenal training during pre-season on Monday The teenager stood and watched as four Gunners players worked at a public training session According to Mail Sport's Isaan Khan, he did not seem to participate in the 15-minute session According to Mail Spor t's Isaan Khan, he milled around the 15-minute session without seeming to directly participate. Pictures released on social media show Gabriel facing another coach as Rob Holding, Gabriel Jesus, Oleksandr Zinchenko and Eddie Nketiah crouch down into some coloured cones as part of their physical training. Arteta insisted on Monday that Arsenal could make further signings despite already spending more than £200million this summer. Mikel Arteta says Arsenal could make further signings despite already spending £200million Club record signing Declan Rice joined Arsenal from West Ham on Saturday for £105million Arsenal have also secured the signings of Kai Havertz (left) and Jurrien Timber (right) The Spaniard has brought in West Ham defensive midfielder Declan Rice for a club-record £105million, forward Kai Havertz from Chelsea and Ajax's Jurrien Timber. Arteta said: 'Let's see (about more signings), there's still a lot of time left in the market. 'There's a lot of expectations in some of our players, so we will have to see how things develop in the next couple of weeks. 'We will be alert, there's still time to do things and there's still time for exits obviously.' On the opening day of Arsenal's US tour on Monday, the 29-man squad — including new signings Rice, Timber and Havertz — trained at George Mason University, near Washington DC . Arteta was full of praise for £105m club-record signing Rice and backed him to succeed in north London. 'His leadership, his aura, the experience he already has in the league. He's going to bring our team to a different dimension,' added Arteta. 'He's got the physical qualities as well that we've been missing for a while.' Share or comment on this article: Arsenal: Mikel Arteta's son Gabriel, 14, spotted on coaching staff at pre-season training camp in America e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 12:43:12","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/13/73336541-0-image-m-52_1689682359357.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat","link":"https://www.dailymail.co.uk/sport/football/article-12310747/West-Ham-prove-theres-life-Declan-Rice-Harry-Kane-enjoy-Ange-Postecoglous-energy-stays-FIVE-THINGS-LEARNED-Tottenhams-pre-season-defeat.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MATT BARLOW: Tottenham suffered a 3-2 defeat to West Ham in their first game under Ange Postecoglou, on their pre-season tour of his homeland Australia.","content":"West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat West Ham secured a a 3-2 victory over Tottenham in Perth on Tuesday Gianluca Scamacca scored the winner after Spurs had come from 2-0 down Mail Sport takes a look at five things we learned from the pre-season game By Matt Barlow for MailOnline Updated: 13:55 BST, 18 July 2023 e-mail 14 shares View comments Tottenham suffered a 3-2 defeat to West Ham in their first game under Ange Postecoglou , on their pre-season tour of his homeland Australia. A quickfire double from Danny Ings and Divin Mubama gave the Hammers a 2-0 lead before Giovani Lo Celso and Destiny Udogie pulled Spurs back in the second-half. Gianluca Scamacca though netted the winner for David Moyes' side in a tough opening match for Tottenham's new manager. Postecoglou handed first outings for new signings James Maddison, Manor Solomon and Guglielmo Vicario who all started the match. Here, Sportsmail's Matt Barlow looks at five things we learned from the encounter. West Ham beat rivals Tottenham 3-2 after an impressive pre-season outing in Perth, Australia ANGE'S LICENCE TO THRILL When Ange Postecoglu says he is prepared to play with risk he means it. The starting back four in his first selection included flying Spanish full backs Pedro Porro and Sergio Reguilon, released to flood midfield but the licence to thrill left them ever so vulnerable to the counter-attack against West Ham who lined up in an orthodox 442 formation. Danny Ings’s opener was a reminder of the defensive frailties of Porro, not closing down the cross, and Reguilon, defended tamely at the back post. Divin Mubama headed in the second as Japhet Tanganga and Reguilon failed to pick up at a corner. Still, these friendlies are glorified training sessions, intended for Postecoglu to work on fitness and learn about his players - and for them to learn about the shape and rhythms he expects. They were altogether more coherent as they fought back in the second half, with Emerson Royal and Destiny Udogie at fullback and Pierre-Emile Hojbjerg screening. Ange Postecoglou played his first game as Spurs manager with risk against West Ham's 4-4-2 THERE'S LIFE AFTER RICE David Moyes seems relieved to be over the Declan Rice transfer saga and his team are proving there is life after their captain’s departure for Arsenal. They scored six against Perth Glory on Saturday and punished Tottenham’s flimsy defence shield with three. Angelo Ogbonna led the Hammers out, although the club’s social media channels thought Lukasz Fabianski was wearing the armband. Senior figures stepped up to lead in their own way. Ogbonna and Kurt Zouma made it through 45 minutes without giving Harry Kane a glimpse of goal, and kept Spurs out for almost an hour. Veteran keeper Fabianski made a string of fine saves before his team were overwhelmed by the fresh legs of Tottenham. Postecoglu made 11 half-time changes. Moyes saved his changes for later in the game and ended up with a very young team on the pitch. West Ham have started the pre-season strong despite the sale of influential star Declan Rice (Danny Ings pictured after scoring the Hammer's opener against Tottenham) West Ham proved there's life without Rice - who joined Arsenal for a massive £105m fee KANE WILL ENJOY ANGE'S ENERGY If Kane sticks around he will enjoy the whirl of energy Postecoglu is trying to generate. Kane started the first half, captain in the absence of clear-to-leave Hugo Lloris and inscrutable as his name was greeted with a pre-match huge roar in the Optus Stadium. There will be great fluidity around him in this system. Oliver Skipp and Yves Bissouma worked hard to run in support and get beyond him from midfield in the first half - and the team created plenty of chances. James Maddison tried to link up, finding him with one pass but Kane’s touch and anticipation let him down. Kane provided for others in the first half. Richarlison, who replaced him at half-time, missed chances Kane would have devoured. Harry Kane will enjoy Ange Postecoglou's style of play if he does stick around at Tottenham FORGOTTEN MEN SHINE Giovani Lo Celso, Davinson Sanchez and Ivan Perisic are among the favourites to leave Tottenham in the Postecoglu clear-out but were all influential when they came on at half time. Lo Celso scored their first, pouncing on a header by Sanchez after a cross from Perisic. Croatia international Perisic had a hand in the second. His corner was headed in by Udogie to level at 2-2 but West Ham found another from another player tipped to leave. Gianluca Scamacca came off the bench to score the winner for West Ham, having been overlooked as Moyes gave teenage striker Mubama a start. Mubama, hero of their FA Youth Cup triumph last season, scored West Ham’s second. Giovani Lo Celso (left) scored Tottenham's first goal as Spurs went on to pull themselves level Gianluca Scamacca came off the bench to sink Tottenham with a 78th minute winner DAVIES IN THE CENTRE AND PERISIC UP FRONT At a glance, Spurs have a glut of five left-backs or left wing backs, although Postecoglu’s first friendly hinted that he views Ben Davies as an option in central defence and Ivan Perisic as cover up front wide on the left. With Ryan Sessegnon injured the left-back duties were shared by Reguilon and Udogie, who was impressive on his first appearance in a Tottenham shirt either tucking inside to boost numbers in midfield or charging forward down the wing. Udogie, an Italy U21 international who was signed from Udinese last year but spent another year in Serie A on loan, scored Tottenham’s equaliser at 2-2, a glancing header from a corner delivered by Perisic, who was influential on the left of a front three. Royal was solid at right back in the second half, although caused a commotion and picked up a yellow card for a late tackle on Emerson. Ivan Perisic (pictured) and Ben Davies playing in different roles than they have for Spurs Share or comment on this article: West Ham prove there's life after Declan Rice and Harry Kane will enjoy Ange Postecoglou's energy if he stays... FIVE THINGS WE LEARNED from Tottenham's pre-season defeat e-mail 14 shares Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-18 12:40:33","image_url":"https://i.dailymail.co.uk/1s/2023/07/18/13/73337131-0-image-a-45_1689683715716.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"'The amount of people there was incredible' - Kerry dethrone All-Ireland champions","link":"https://www.the42.ie/anna-galvin-kerry-2-6121627-Jul2023/","keywords":["The kingdom"],"creator":null,"video_url":null,"description":"Anna Galvin relives the joy of her side’s All-Ireland quarter-final win over Meath at the weekend.","content":"KERRY LADIES STAR Anna Galvin says her side never considered that victory over back-to-back All-Ireland champions Meath was certain until the sound of the final whistle at Austin Stack Park on Saturday evening. In what was a repeat of last year’s All-Ireland final, the hosts exacted revenge in biblical rain to book their place in the semi-finals. First-half goals from Síofra O’Shea and Niamh Carmody provided the platform to build their victory on as they built up a 10-point lead at half-time. Meath naturally stormed into the contest after the restart with the wind assisting them, but the Royals could only manage to shave six points off the difference before the full-time whistle as they bowed out by 2-8 to 0-10. “The atmosphere was unbelievable,” beams Galvin. “We didn’t think for any moment that we had it. We knew there was going to be a big kick in them. “The amount of people there was incredible on a miserable night. We were overwhelmed with that. The following all through this year has been building and building. And then the fact we were able to get a home quarter-final was class for people who mightn’t be able to travel to games far away. The crowd were immense and so important in the end stages of the game. When Meath were attacking, we were under a lot of pressure and they were chanting. It made some difference. “There were times when I looked around and couldn’t see any of my teammates, there was just people everywhere. There was lots of jersey signing and all sorts.” On the subject of jerseys, there was some confusion online regarding the kit that the Kerry ladies were wearing. Images were posted of the jerseys from the game, showing that players were wearing the strip which featured in last year’s All-Ireland final. Some suggested it was a motivational strategy to upset their Meath opponents. Galvin explains however, that that was not the case. “So we had a gold set of jerseys that don’t have that [All-Ireland final description] on them. We just had the All-Ireland set at half-time because we were absolutely drenched, so we had the second set there. I know there’s been a bit of a narrative on Twitter that we were using it for motivation but that might have been a bit of a risky move for management if that was the case. No, it was very much to manage the weather conditions.” After capturing the Division 1 title earlier this year, Kerry lost out to Cork in the Munster final. They recovered the group stages however, picking up crucial wins against Dublin and Cavan to set-up another duel with Meath. “We were so excited,” Galvin explains when asked for Kerry’s reaction to being paired with Meath in the quarter-finals. The defending champions have been through a turbulent period lately when they were left without a manager after the shock departure of Davy Nelson. Under Nelson, Meath won just one of their seven Division 1 league games this spring and lost the Leinster final to Dublin by six points recently. Jenny Rispin came in to take over the role. But Meath are still the Brendan Martin Cup holders, who hurt Kerry badly in last year’s All-Ireland decider. “It’s great to be able to play that has knocked you out,” Galvin continues, “who you’ve had such battles with over the years. Between the league final and the All-Ireland final, we obviously wanted to prove that we could beat Meath, and perform better than we had in those other games. We definitely felt we hadn’t done ourselves justice previously. Credit to Meath, they were unbelievable those few times. We just felt like we could do better against them.” Ladies football and camogie squads around the country have been carrying out a series of protests throughout the championship to demonstrate their frustrations with the LGFA and Camogie Association regarding player welfare and minimum standards. Galvin says that it’s possible that the protests are encouraging more people to attend the matches but hopes that their efforts will ultimately lead to effective change for players. “The protests have been great in terms of raising awareness. I think it’s been massive and I think people are aware of the discrepancies but the discrepancies get talked about and then it goes away and fades away. So, the protests have maintained the promotion of it. It helps with the support as well because people are coming out to say they’re behind us as well. We don’t want this to fade away again and this is our way of saying, ‘enough is enough. We need actual action.’”","pubDate":"2023-07-18 12:31:47","image_url":"https://c2.thejournal.ie/media/2023/07/kerry-v-meath-tg4-lgfa-all-ireland-senior-championship-quarter-final-2-630x434.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"}]}