{"newsArray":[{"title":"Kickoff | Saudis 'set' to make another bid for Messi!","link":"https://www.snl24.com/kickoff/worldnews/saudis-set-to-make-another-bid-for-lionel-messi-20230818","keywords":null,"creator":null,"video_url":null,"description":"Despite having only recently joined Inter Miami, Lionel Messi is reportedly set to be the subject of another massive bid from Saudi Arabia.","content":"With Al Hilal, who are owned by the Saudi Public Investment Fund (PIF), having pursued Messi prior to his move to Inter Miami, it is said the wealthy club owners are set to reignite their efforts to bring the Argentine to the Saudi Pro League after being rejected by the 2022 FIFA World Cup winner in July. According to Saudi Arabian publication , the PIF is set to initiate talks with the Florida club over the possibility of signing Messi on loan in the current 2023/24 campaign. It is claimed talks between the two teams could get underway in the next few days, with the PIF's plan being for the 36-year-old to represent one of their four teams in the Saudi top flight, namely Al Ahli, Al Hilal, Al Nassr, and Al Ittihad. The big-spending Saudis are believed to have already spent €540 million (R11.2 billion) on transfers so far in this window, with Neymar's recent move to Al Hilal from Paris Saint-Germain having commanded the highest transfer fee at €90 million (R1.8 billion). Messi himself has shone since making the switch to the US, scoring nine goals in six games and leading his new team all the way to the Leagues Cup final, which will take place on Sunday. Inter Miami's previous boss Phil Neville, meanwhile, has claimed that he knew he would not be in charge of the club for much longer following the Albiceleste captain's blockbuster arrival. He told Taylor podcast: \"I always had a feeling, deep down, I wasn't going to be here [in Miami] when he [Messi] was going to come to the club. And I say that not lacking confidence in myself but this was different, this was not signing Gonzalo Higuain or Blaise Matuidi. \"You look around the world, the way he has been at other clubs and there has always been certain managers that managed him. The bottom line for me was, forget Messi, the results weren't good enough the last month I was in the job and I knew that. That is the reason I left. \"When I look in the mirror in the morning and my friends or social media say 'it could have been you', well, no, it couldn't have. The results were not good enough. I knew the vision, I knew what the club wanted. I've been in football a long time and sometimes it is not meant to be. I am not bitter, twisted or angry.\" You must be to read and post comments.","pubDate":"2023-08-18 07:37:52","image_url":"https://cdn.24.co.za/files/Cms/General/d/3780/dfa0e2df8e074cc184da6e467e0eaaef.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"title":"Théo Walcott annonce prendre sa retraite et veut devenir consultant","link":"https://www.lequipe.fr/Football/Actualites/Theo-walcott-annonce-prendre-sa-retraite/1414231#xtor=RSS-1","keywords":["Foot, ANG"],"creator":["Maxime Dubernet"],"video_url":null,"description":"À 34 ans, Théo Walcott, ancien ailier anglais d'Arsenal, a annoncé prendre sa retraite ce vendredi. Il a indiqué vouloir se reconvertir dans le monde des médias.","content":"L'heure de la retraite a sonné pour Théo Walcott (34 ans). L'ancien ailier d'Arsenal (2006-2018) a indiqué ce vendredi matin prendre sa retraite après 18 années sur les terrains, où il aura inscrit 140 buts et délivré 103 passes décisives en 614 matches. « », souligne le joueur dans un long post Instagram. Formé à Southampton (2005-2006), l'ancien international anglais (47 sélections, 8 buts) a effectué la majeure partie de sa carrière avec le maillot des Gunners où sa vitesse de pointe était réputée en Premier League. Après un court passage à Everton (2018-2020), il est revenu dans son club formateur, à Southampton (2020-2023) où il a connu la relégation pour son ultime saison. « », continue Walcott. Annoncé dans le viseur de Reading (League One), il a révélé avoir rejeté des offres de clubs de Championship et d'équipes étrangères, notamment d'Arabie saoudite. Sa reconversion devrait se faire dans le monde des médias où, à , il aimerait devenir consultant. « , a-t-il confié à . »","pubDate":"2023-08-18 07:31:56","image_url":"https://medias.lequipe.fr/img-photo-jpg/theo-walcott-ici-sous-le-maillot-d-arsenal-a-officialise-sa-retraite-ce-vendredi-f-mons-l-equipe/1500000001822118/0:0,1998:999-665-335-70/18c02.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Luciano Spalletti devrait succéder à Roberto Mancini au poste de sélectionneur de l'Italie","link":"https://www.lequipe.fr/Football/Actualites/Luciano-spalletti-devrait-succeder-a-roberto-mancini-au-poste-de-selectionneur-de-l-italie-presse-italienne/1414230#xtor=RSS-1","keywords":["Foot, ITA"],"creator":["Maxime Dubernet"],"video_url":null,"description":"Selon la presse italienne, Luciano Spalletti devrait bien être le successeur de Roberto Mancini, démissionnaire surprise, à la tête de la Nazionale. Si tous les détails ne sont pas encore réglés, la présentation de l'ancien entraîneur de Naples pourrait avoir lieu lundi.","content":"Après quelques jours de flottement, la Fédération italienne de football (FIGC) a trouvé le successeur de Roberto Mancini au poste de sélectionneur de la Nazionale. L'élu est Luciano Spalletti (64 ans), , qui devrait signer un contrat de trois ans jusqu'en septembre 2026, selon l'édition de de vendredi. Au terme de plusieurs entretiens téléphoniques, Spalletti a donné son accord au président de la FIGC, Gabriele Gravina, qu'il doit rencontre ce vendredi pour finaliser son contrat. Après sa nomination, qui pourrait être officialisée samedi, il devrait tenir sa première conférence de presse, lundi, en tant que sélectionneur. Les négociations ont été toutefois compliquées par son contrat avec Naples, avec lequel Spalletti est encore lié jusqu'en juin 2024. Pour l'attirer, tout prétendant doit régler une clause de 3 M€. Le président des Napolitains, Aurelio De Laurentiis, avait prévenu la FIGC qu'il ne renoncerait pas à cette indemnité. Sur cette question, la FIGC explore les recours juridiques. La presse italienne se dit confiante dans la résolution de ce problème.","pubDate":"2023-08-18 07:17:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/quelques-mois-apres-avoir-quitte-le-poste-d-entraineur-principal-de-naples-luciano-spalletti-devrait-prendre-la-tete-de-la-selection-italienne-memmler-eibner-presse-sports/1500000001822115/0:0,1998:999-665-335-70/51c8e.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Dutee Chand to challenge four-year NADA ban","link":"https://indianexpress.com/article/sports/sport-others/dutee-chand-to-challenge-four-year-nada-ban-8898033/","keywords":["Sport Others","Sports"],"creator":null,"video_url":null,"description":null,"content":"Double Asian Games silver medallist Dutee Chand will challenge the four-year ban imposed on the celebrated Indian athlete by the National Anti-Doping Agency (NADA) for failing two out-of-competition dope tests for a banned substance. The 27-year-old 100m national record holder was on Thursday served the ban after two samples taken in December last year were found to contain “other anabolic agents/SARMS”, which is listed under “WADA’s 2023 prohibited list of non-specified substances”. The samples were taken on December 5 and 26 respectively and both returned positive for almost identical substances. SARMS, or selective androgen receptor modulators, are non-steroidal substances commonly used to treat osteoporosis, anaemia and wound healing in patients. Dutee’s ban will be effective from January 3 this year and all her competitive results will be scrapped from the date the first sample collection took place (December 5, 2023). Dutee’s counsel Parth Goswami told PTI on Friday that the sprinter had been a “clean athlete” all her professional career and it was a case of “unintentional consumption”. The athlete had won silver medals in 100 and 200m at the 2018 Jakarta Asian Games and holds the national record of 11.17 sec in 100m (2021). “For us, this is a clear case of unintentional consumption of a banned substance. We were clearly able to establish the source of the substance in the body, which is a substantial proof of lack of intent. The substance was never used to gain any sporting advantage,” said Goswami. “We are in process of filing an appeal. We are hopeful that we will be able to convince the appeal panel,” he added. Advertisement “Dutee is the pride of India and is a clean athlete. She has had an illustrious career of over a decade. She has undergone hundreds of dope tests internationally and nationally and has always been clean in her long career,” added Goswami. Dutee and her counsel had also claimed before NADA’s Anti-Doping Disciplinary Panel (ADDP) that it was a case of “unintentional consumption”. “The athlete and her counsel had without refuting the findings of the NDTL (National Dope Testing Laboratory) report stated that the consumption of the said substance was unintentional and the ingestion of the same had been advised by the physiotherapist who was being regularly consulted by the athlete,” said the ADDP order. Advertisement Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more “The athlete and her counsels submitted that the said physiotherapist had been attached with the athlete from the Pullela Gopichand Academy where the athlete was training under special permission.” Dutee’s counsel had submitted that the sprinter was “hyperandrogenic” owing to which she was having “severe groin pain” because of which the treatment was recommended. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More ADDP said that the athlete had “delegated the task of purchasing the drugs to her friend”, who was also a witness in the case. “(The witness) before giving his deposition had submitted an affidavit where he stated that he himself went to the shop to buy the said supplement for hormonal disbalance but, on the contrary, during his cross-examination (the witness) denied buying the said supplement in person but rather re-delegating to his manager,” ADDP noted. Also Read Vinesh Phogat undergoes knee surgery in Mumbai, vows to come back stronger Pistol shooters misfire on opening day of Worlds Women wrestlers won’t feel safe if Brij Bhushan Sharan Singh’s people win... Neeraj Chopra tweets requesting Kishore Jena’s visa issue be resolved ahe... “The admitted fact on the affidavit placed before the ADDP and the cross-examination of the witness highlights there are glaring contradictions in the fact put forth before the panel by the witnesses, thereby raising legitimate concerns regarding the reliability of the statements made by the witness,” said ADDP order.","pubDate":"2023-08-18 06:58:15","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"World chess federation bars transgender women from competing in women’s events","link":"https://indianexpress.com/article/sports/chess/world-chess-federation-bars-transgender-women-from-competing-in-womens-events-8897934/","keywords":["Chess","Sports"],"creator":null,"video_url":null,"description":null,"content":"The world’s top chess federation has ruled that transgender women cannot compete in its official events for women until its officials make an assessment of gender change. The decision by the Switzerland-based federation FIDE, published on Monday, has drawn criticism from advocacy groups and supporters of transgender rights. FIDE said it and its member federations increasingly have received recognition requests from players who identify as transgender, and that the participation of transgender women would depend on an analysis of individual cases that could take up to two years. “Change of gender is a change that has a significant impact on a player’s status and future eligibility to tournaments, therefore it can only be made if there is a relevant proof of the change provided,” the federation said. “In the event that the gender was changed from a male to a female the player has no right to participate in official FIDE events for women until further FIDE’s decision is made,” it said. Holders of women’s titles who change their genders to male would see those titles “abolished,” the federation said, while holding out the possibility of a reinstatement “if the person changes the gender back to a woman.” “If a player has changed the gender from a man into a woman, all the previous titles remain eligible,” the federation said. It acknowledged that such questions regarding transgender players were an “evolving issue for chess” and that “further policy may need to be evolved in the future in line with research evidence.” Cathy Renna, communications director for the National LGBTQ Task Force in the United States, lashed out at what she said appeared to be “a case of trans panic’ with no justification, not grounded in reality and once again marginalizing trans people.” Advertisement “The new guidelines’ on trans competitors in chess are infuriating, confusing, contradictory and a sign that the anti-trans movement, particularly those who are promoting exclusion in sports, is spreading into other areas of competitive sport and is a very disturbing development,” Renna said in an e-mail. In a written response to The Associated Press, seeking an explanation about the decision, the federation’s press office said: “Allow us to clarify that the new regulations are aimed at clearly defining the procedure on how a person who has officially changed their gender may register the fact on FIDE Directory.” The lack of such regulations caused “ambiguity,” it said, “and therefore an established order was needed to provide the right of the transgender players being properly represented on the official register of FIDE.” It said any transgender player was allowed to participate in the “open” section of its chess tournaments. Advertisement “Two years is a scope of sight that seemed reasonable for the thorough analyses of such developments,” the federation said. “It is to set a certain deadline for a new reiteration of these policies, without rushing it.” Word of the decision comes as the federation is hosting a World Cup event in Azerbaijan where top players, including No. 1-ranked Grand Master Magnus Carlsen of Norway, are attending. Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more The federation has open competitions that allow all players to take part, as well as specialized categories, such as for women, young players and even computers. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More Many sports involving intense physical activity — which chess does not — have been grappling with how to formulate policies toward transgender athletes in recent years. The International Cycling Union has joined the governing bodies of track and field and swimming as top-tier Olympic sports addressing the issue of transgender athletes and fairness in women’s events. Also Read Chess World Cup 2023 Highlights: Praggnanandhaa defeats Arjun Erigaisi in... Chess World Cup 2023 Highlights: Arjun Erigaisi and Praggnanandhaa head t... Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters ... Chess World Cup 2023 Highlights: Gukesh loses to Carlsen; Arjun Erigaisi ... Advertisement Last month, the cycling federation ruled that female transgender athletes who transitioned after male puberty will no longer be able to compete in women’s races.","pubDate":"2023-08-18 06:26:08","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"Video: Former Southampton, Arsenal and Everton player Theo Walcott retires","link":"https://www.caughtoffside.com/2023/08/18/video-former-southampton-arsenal-and-everton-player-theo-walcott-retires/","keywords":["Arsenal FC","Championship","Everton FC","Extra Time","Features - NewsNow","Football and Soccer","Mobile App Stories","Premier League","Southampton FC","Transfer News","theo walcott"],"creator":["Jason Pettigrove"],"video_url":null,"description":"After being released by Southampton this summer, Theo Walcott has decided to retire from the game at 34 years of age.Dogged by injuries during the latter part of his career, the lightning-fast winger will still be remembered fondly by Saints fans as well as Arsenal and Everton supporters.Sky Sports News report that he did have […] The post Video: Former Southampton, Arsenal and Everton player Theo Walcott retires appeared first on CaughtOffside.","content":"Dogged by injuries during the latter part of his career, the lightning-fast winger will still be remembered fondly by Saints fans as well as Arsenal and Everton supporters. Sky Sports News report that he did have offers to continue his career elsewhere, but has made the decision to call it a day. He leaves the game after making over 400 career appearances and having played 47 times for England.","pubDate":"2023-08-18 06:17:35","image_url":"https://www.caughtoffside.com/wp-content/uploads/2015/06/Theo-Walcott-Arsenal-Spurs.png","source_id":"caughtoffside","source_priority":16638,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Карасев назначен на «Спартак» – «Зенит», Медведев проиграл Звереву, Захарян точно в «Сосьедаде», УЕФА выбрал лучших, «Рубин» уволит Рахимова и другие новости","link":"https://www.sports.ru/football/1115391782-karasev-naznachen-na-spartak-zenit-medvedev-proigral-zverevu-zaxaryan-.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"1","content":"1. Главным арбитром матча «Зенит» – «Спартак» назначен Сергей Карасев , а прокомментируют самую важную игру лета Журавель и Трушечкин . Тем временем Владислав Безбородов и Сергей Иванов пропустят третий тур РПЛ подряд . 2. Даниил Медведев проиграл Александру Звереву в третьем круге турнира в Цинциннати. Еще одно раннее поражение Даниила, его волшебная игра куда-то пропала . Ну а Зверев впервые после травмы победил соперника из топ-10 . Новак Джокович прошел Гаэля Монфиса, Карлос Алькарас одолел Томми Пола. У женщин Дарья Касаткина проиграла Арине Соболенко в третьем круге. 3. Захарян едет в Ла Лигу – «Динамо» уладило разногласия с агентом игрока и выплатит ему два миллиона евро. При этом семья Арсена была на стороне агента в споре с клубом. Впрочем, проблемы позади, сегодня хавбек прилетает в Испанию . 4. Месси, Холанд и де Брюйне стали финалистами премии УЕФА лучшему игроку сезона-2022/23, Мбаппе не попал даже в топ-5 . На приз лучшему тренеру претендуют Гвардиола, Индзаги и Спаллетти , совсем немного не дотянули до топ-3 Де Дзерби и Артета. 5. Похоже, нас ждет вторая отставка в РПЛ – Рашид Рахимов уже сегодня может быть уволен из «Рубина». 6. В квалификации Лиге Европы «Шериф» прошел БАТЭ, «Астана» проиграла «Лудогорцу» , «Славия» выбила «Днепр-1». В Лиге конференций «Сабах» Мурада Мусаева по пенальти проиграл «Партизану» , «Бешикташ» победил «Нефтчи», «Динамо» Киев выбило «Арис». 7. Владимир Путин наградил главу ОКР Станислава Позднякова орденом Александра Невского. 8. Килиан Мбаппе сообщил окружению, что останется в «ПСЖ» , но через год он хочет только в «Реал». 9. Открытая категория с участием трансгендеров появится на Кубке мира по плаванию. Евгений Коротышкин ждет категорий для Железного Человека и Человека-паука . 10. «Спартак» представил красно-черную третью форму , посвященную победам над «Аяксом» в 1998 году. «Милан» показал сиренево-бирюзовую третью форму , которая символизируют инклюзивность. 11. «Салават» в память о Родионе Амирове выведет из обращения 27-й номер . 12. Сергей Бубка покинет World Athletics . Он входил в систему организации 22 года. 13. Глава FA допустил, что мужскую сборную Англии может тренировать женщина – Сарина Вигман, возглавляющая женскую национальную команду. 14. Кевин де Брюйне перенесет операцию и пропустит 3-4 месяца. Цитаты дня Лионель Месси: «Никогда не придавал значения «Золотому мячу». Думаю о нем гораздо меньше после победы на ЧМ» Шнякин о претензиях «Зенита»: «Чуть ли не от Миллера прилетело: «Что это он себе позволяет говорить «питерцы»?» Депутат Свищев: «Мы видим кризис проведения Олимпийских игр, их формат уже не вызывает в мире прежнего интереса» Слуцкий не жалеет, что назвал журналиста «19-летним дебилом»: «Вообще по барабану. Я веду себя так, как считаю нужным» Министр спорта Украины: «Не исключаю, что россияне сделают «жест доброй воли» и скажут, что не поедут на Олимпиаду»","pubDate":"2023-08-18 06:10:00","image_url":null,"source_id":"sports","source_priority":60448,"country":["russia"],"category":["sports"],"language":"russian"},{"title":"Avant la réception de l'OM en Ligue 1, Metz inquiète déjà","link":"https://www.lequipe.fr/Football/Actualites/Avant-la-reception-de-l-om-en-ligue-1-metz-inquiete-deja/1414157#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Cyril Olives-Berthet"],"video_url":null,"description":"Écrasé à Rennes (1-5) dimanche, Metz a beaucoup de travail pour se mettre au niveau de la Ligue 1.","content":"Début juillet, dans la touffeur de la salle de presse improvisée de Frescaty, Matthieu Udol avait averti les siens : Mais le latéral gauche a vu les Grenats couler à Rennes (1-5, dimanche) lors de la première journée, et l'entame de calendrier s'annonce compliquée pour le promu (OM aujourd'hui, puis Clermont, Reims, Lens, Strasbourg, Toulouse et Nice). , a pesté le capitaine messin, resté sur le banc en raison d'une maladie qui l'empêche encore d'être opérationnel pour la deuxième journée. Bölöni veut encore un joueur par ligne Au Roazhon Park, les hommes de Laszlo Bölöni ont manqué de tout, concédant notamment 29 tirs (dont 23 dans la surface). , a reconnu le coach de 70 ans. Le trio Bourigeaud-Le Fée-Santamaria a marché sur Danley Jean-Jacques et Kévin N'Doram, deux joueurs pourtant majeurs de l'entrejeu lorrain. La défense a été très naïve, à l'image de Koffi Kouao, qui a souffert face à Jérémy Doku. , a prévenu l'expérimenté Maxime Colin, tandis que Cheikh Sabaly a regretté le de l'équipe. , a rappelé Ismaël Traoré en Bretagne. Pour exister, il faut aussi recruter. Les recrues principales sont le défenseur Colin, le milieu Jean N'Guessan et deux attaquants (Simon Elisor, Benjamin Tetteh). , a regretté Bölöni, qui devrait perdre son buteur Georges Mikautadze, dont la vente a été budgétée par sa direction, et qui ne pourra pas compter sur l'ailier Ablie Jallow avant la trêve internationale de septembre. Le technicien roumain désirant encore , le club lorrain cherche toujours un joueur offensif et négocie avec l'IFK Göteborg pour le transfert du défenseur central suédois Johan Bangsbo (1,91 m, 85 kg). Cela ne sera pas un luxe pour une équipe (Sabaly) et qui doit , selon son coach.","pubDate":"2023-08-18 06:10:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/laszlo-boeloeni-et-les-rennais-se-sont-lourdement-inclines-a-rennes-1-5-en-ouverture-du-championnat-dimanche-j-m-hervio-l-equipe/1500000001821891/0:0,1994:1330-665-335-70/fe835.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports","link":"https://uaenews247.com/2023/08/18/the-new-serie-a-season-kicks-off-this-saturdaylive-and-exclusive-on-starzplay-sports/","keywords":["Sports & Recreations","STARZPLAY Sports"],"creator":["uaenews247"],"video_url":null,"description":"The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports Football is back this weekend on STARZPLAY Sports as the new Serie A season kicks off on Saturday August 19th. All 380 matches will be broadcast across two channels dedicated to the league, Abu Dhabi Sports 1 & 2 Premium which … Continue reading The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports →","content":"Football is back this weekend on as the new Serie A season kicks off on Saturday August 19th. All 380 matches will be broadcast across two channels dedicated to the league, Abu Dhabi Sports 1 & 2 Premium which are exclusively on STARZPLAY Sports. The first match on the opening day of the 2023/24 season sees newly promoted Frosinone welcome last term’s champions Napoli at 8:30pm UAE, followed by the 2022/23 UEFA Champions League finalists Inter Milan at home to Monza at 10:45pm UAE. On Sunday, last season’s UEFA Europa League finalists, Roma host Salernitana in the Stadio Olimpico at 8.30pm UAE then Udinese face Juventus at 10:45 UAE. AC Milan travel to Bologna on Monday at 10:45pm UAE rounding off the weekend’s action. Launched ahead of the new 2023/24 season, fans can now engage with the Serie A like never before with STARZPLAY Fantasy Sports. Players can make predictions around live Serie A matches, from forecasting scores and possession percentages to identifying the first goal scorer via in-game arenas, in order to win fantastic prizes. Serie A recently jumped to second in the updated UEFA League rankings for 2022-23. The combination of exciting football, incredible players, massive clubs, different title winners over the past four seasons and success in Europe including a team in each of the three UEFA finals has seen the rise of Serie A which is now ranked higher than La Liga and Bundesliga. The league is packed with star power players like Di Maria, Lautaro, Pogba, Dybala, Osimhen, Leao and Immobile. Serie A coverage includes some of the most popular commentators and analysts in the Arab world elevating the match day viewing experience. In celebration of the start of the season, STARZPLAY is offering SERIE A fans a 30% discount on the annual package. With thousands of hours of premium content including blockbuster movies, exclusive TV shows, kids’ content, Arabic series, as well as varied content via add-on channels, STARZPLAY is a leading video-on-demand subscription service in the MENA region. The service is available across 19 countries for fans to enjoy quality content anytime, anywhere, and from any device. Ranked consistently among the region’s top three subscription video on demand services, STARZPLAY Arabia ( ) streams an extensive variety of premium content covering Hollywood movies, TV shows, documentaries and same-time-as-the-US series – plus live sports, dedicated kids’ entertainment and Arabic content – to 19 countries across MENA and Pakistan. STARZPLAY has thousands of prime titles including exclusive STARZPLAY Arabia original content such as Kaboos, Say Yes to the Dress Arabia, Baghdad Central, STARZ Original content such as Power, Outlander, Spartacus and The White Queen as well as a range of content with add-ons such as AD Sports, Premier Sports (Rugby), NBA League Pass and STARZPLAY Sports, the dedicated sports package covering football (Italian Serie A and Dutch Eredivisie leagues), wrestling (All Elite Wrestling), cricket, UFC Arabia, boxing, basketball and more. STARZPLAY Arabia has secured tie ups with a host of leading, global studios, including Lionsgate, MGM, Warner Bros, Universal, Discovery and Sony Studios along with regional producers such as UMS, Eagle Films and Falcon. Until 2022, STARZ ( ), a Lionsgate company (NYSE: LGF.A, LGF.B) was the lead investor along with media and technology investment firms including SEQ Investors and Delta Partners. In early 2021, STARZPLAY Arabia secured its first independent financing in the region of US$25 million (approx. AED 92 million) from Abu Dhabi based Ruya Partners. In 2022, E-Vision, from e& and ADQ, an Abu Dhabi-based investment and holding company acquired a majority equity stake of circa 57% in the company. Reaching over 2.9 million subscribers, STARZPLAY Arabia allows subscribers to watch its full HD and 4K content via most internet-enabled devices, smart TVs and game consoles, and is widely available on regional IPTV services. Its iOS and Android apps – installed on over three million devices – also allow downloads for offline playback. : Instagram , Facebook , Twitter , TikTok , YouTube","pubDate":"2023-08-18 06:07:16","image_url":"https://2.gravatar.com/avatar/8cf576a7747fe7b37bd632f279fa3bc8f461c8fabecbc279bd79160e7a06a7bc?s=96&d=identicon&r=G","source_id":"uaenews247","source_priority":7518978,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"title":"Ireland vs India, 1st T20I tip-off XI: Rinku Singh to make his debut, Jasprit Bumrah returns, Prasidh Krishna comes in","link":"https://indianexpress.com/article/sports/cricket/ireland-vs-india-1st-t20i-tip-off-xi-rinku-singh-to-make-his-debut-jasprit-bumrah-returns-prasidh-krishna-comes-in-8897884/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"The three-match T20I series against Ireland is a chance to the likes of Jasprit Bumrah and Prasidh Krishna to prove their match fitness ahead of the Asia Cup and the ODI World Cup. At the same time it will be massive opportunity to Sanju Samson, who had a poor outing against West Indies in the T20Is to get back among the runs. India’s Gen-Next IPL performers like Ruturaj Gaikwad, Rinku Singh and Jitesh Sharma will also be eager to make impact. The fringe players like Washignton Sundar, Shahbaz Ahmed and Ravi Bishnoi to show their prowess and the comeback man Shivam Dube would be looking for a redemption. It will be interesting to see how players and the team management balance individual and team goals while keeping the big picture in mind. ALSO READ | India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE Here are few tips ahead of the first T20I: Rinku Singh to make his debut Rinku Singh, who has grabbed the headlines for his explosive batting down the order and not forget the hitting five sixes in a row in the final over to win a game, is set to make his debut. Rinku’s journey has been unique. For the first three seasons in the IPL, he hardly made an impact, managing only 77 runs. He didn’t get to play a single game in the 2021 season. In the second half of IPL 2022, he played a couple of cameos but in losing cause. But IPL 2023 proved to be a game-changer, as he amassed 474 runs at a strike rate of 149.53. After being picked for India, the explosive batter had said “it still feels like a dream.” Return of Bumrah Returning to competitive cricket after 11 months, spending countless hours on the surgeon’s table, rehab booths and practice nets, Jasprit Bumrah would be itching to hit the ground running. 💬 💬 “Very happy to be back.” Captain Jasprit Bumrah – making a comeback – takes us through his emotions ahead of the #IREvIND T20I series. #TeamIndia | @Jaspritbumrah93 pic.twitter.com/IR9Rtp26gi — BCCI (@BCCI) August 17, 2023 A two-ball nets footage reassured that he has not lost much of his pace or sharpness. One was a devilish bouncer that tied Ruturaj Gaikwad in knots that he kept away awkwardly; the other was a searing toe-crusher that Yashasvi Jaiswal negotiated with a last-second bat-jam. The 14-second clip was watched with a heave of relief by the Indian cricket fraternity. Advertisement Bumrah is arguably one of their most potent, as well as reliable, weapons in the Indian team, someone who could influence the match at any time, with the old or new ball, at the start, middle, or at the death. He was dearly missed in the T20 World Cup and World Test Championship. But the biggest prize of them is winning the World Cup at home. Prasidh also makes a comeback Just like Bumrah, even Prasidh Krishna is making a comeback to competitive cricket and before his lower back stress fracture injury which also required a surgery, the Bengaluru fast bowler was a certainty in ODI set-up. It is expected that selectors would check out Krishna’s form before taking a final call on the Asia Cup squad expected to be announced by the end of this week. Advertisement Prasidh had also bowled in the KSCA T20 tournament for G Kasturirangan Memorial Trophy tournament last month. He took four wickets (4-0-36-4) in that match for Mount Joy Cricket Club against Sir Syed Cricketers. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More Prasidh is coming back after a prolonged injury lay-off that saw him missing the action for nearly a year. The Karnataka pacer last played for India in an ODI match against Zimbabwe on August 20, 2022. IND vs IRE Head-to-head (T20Is) Matches played : 5 Ireland won: 0 India won: 5 Tied: 0 No Result: 0 Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more IND vs IRE Pitch report The average score batting first at Malahide is 167. Spinners might tend to struggle at this venue because of the small ground dimensions. The pacers might get help from the pitch but overall, it has always been a batting paradise. Ireland vs India Predicted XI Also Read India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE PCB should delete the video and apologise: Wasim Akram slams Pakistan Cri... ‘Never thought it was all over’: Jasprit Bumrah says he is ready for Worl... Ben Stokes’ Moeen Ali-inspired ‘Lol’ tweet sends England Cricket into jub... Ireland Predicted XI: Paul Stirling (c), Andrew Balbirnie, Lorcan Tucker (wk), Harry Tector, Curtis Campher, Fionn Hand, George Dockrell, Mark Adair, Barry Mccarthy, Josh Little, Ben White India predicted XI: Yashasvi Jaiswal, Ruturaj Gaikwad, Tilak Varma, Rinku Singh, Sanju Samson (wk), Shivam Dube , Washington Sundar , Arshdeep Singh, Ravi Bishnoi , Jasprit Bumrah (c), Prasidh Krishna","pubDate":"2023-08-18 06:06:35","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"Kickoff | Saudis 'set' to make another bid for Messi!","link":"https://www.snl24.com/kickoff/worldnews/saudis-set-to-make-another-bid-for-lionel-messi-20230818","keywords":null,"creator":null,"video_url":null,"description":"Despite having only recently joined Inter Miami, Lionel Messi is reportedly set to be the subject of another massive bid from Saudi Arabia.","content":"With Al Hilal, who are owned by the Saudi Public Investment Fund (PIF), having pursued Messi prior to his move to Inter Miami, it is said the wealthy club owners are set to reignite their efforts to bring the Argentine to the Saudi Pro League after being rejected by the 2022 FIFA World Cup winner in July. According to Saudi Arabian publication , the PIF is set to initiate talks with the Florida club over the possibility of signing Messi on loan in the current 2023/24 campaign. It is claimed talks between the two teams could get underway in the next few days, with the PIF's plan being for the 36-year-old to represent one of their four teams in the Saudi top flight, namely Al Ahli, Al Hilal, Al Nassr, and Al Ittihad. The big-spending Saudis are believed to have already spent €540 million (R11.2 billion) on transfers so far in this window, with Neymar's recent move to Al Hilal from Paris Saint-Germain having commanded the highest transfer fee at €90 million (R1.8 billion). Messi himself has shone since making the switch to the US, scoring nine goals in six games and leading his new team all the way to the Leagues Cup final, which will take place on Sunday. Inter Miami's previous boss Phil Neville, meanwhile, has claimed that he knew he would not be in charge of the club for much longer following the Albiceleste captain's blockbuster arrival. He told Taylor podcast: \"I always had a feeling, deep down, I wasn't going to be here [in Miami] when he [Messi] was going to come to the club. And I say that not lacking confidence in myself but this was different, this was not signing Gonzalo Higuain or Blaise Matuidi. \"You look around the world, the way he has been at other clubs and there has always been certain managers that managed him. The bottom line for me was, forget Messi, the results weren't good enough the last month I was in the job and I knew that. That is the reason I left. \"When I look in the mirror in the morning and my friends or social media say 'it could have been you', well, no, it couldn't have. The results were not good enough. I knew the vision, I knew what the club wanted. I've been in football a long time and sometimes it is not meant to be. I am not bitter, twisted or angry.\" You must be to read and post comments.","pubDate":"2023-08-18 07:37:52","image_url":"https://cdn.24.co.za/files/Cms/General/d/3780/dfa0e2df8e074cc184da6e467e0eaaef.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"title":"Théo Walcott annonce prendre sa retraite et veut devenir consultant","link":"https://www.lequipe.fr/Football/Actualites/Theo-walcott-annonce-prendre-sa-retraite/1414231#xtor=RSS-1","keywords":["Foot, ANG"],"creator":["Maxime Dubernet"],"video_url":null,"description":"À 34 ans, Théo Walcott, ancien ailier anglais d'Arsenal, a annoncé prendre sa retraite ce vendredi. Il a indiqué vouloir se reconvertir dans le monde des médias.","content":"L'heure de la retraite a sonné pour Théo Walcott (34 ans). L'ancien ailier d'Arsenal (2006-2018) a indiqué ce vendredi matin prendre sa retraite après 18 années sur les terrains, où il aura inscrit 140 buts et délivré 103 passes décisives en 614 matches. « », souligne le joueur dans un long post Instagram. Formé à Southampton (2005-2006), l'ancien international anglais (47 sélections, 8 buts) a effectué la majeure partie de sa carrière avec le maillot des Gunners où sa vitesse de pointe était réputée en Premier League. Après un court passage à Everton (2018-2020), il est revenu dans son club formateur, à Southampton (2020-2023) où il a connu la relégation pour son ultime saison. « », continue Walcott. Annoncé dans le viseur de Reading (League One), il a révélé avoir rejeté des offres de clubs de Championship et d'équipes étrangères, notamment d'Arabie saoudite. Sa reconversion devrait se faire dans le monde des médias où, à , il aimerait devenir consultant. « , a-t-il confié à . »","pubDate":"2023-08-18 07:31:56","image_url":"https://medias.lequipe.fr/img-photo-jpg/theo-walcott-ici-sous-le-maillot-d-arsenal-a-officialise-sa-retraite-ce-vendredi-f-mons-l-equipe/1500000001822118/0:0,1998:999-665-335-70/18c02.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Luciano Spalletti devrait succéder à Roberto Mancini au poste de sélectionneur de l'Italie","link":"https://www.lequipe.fr/Football/Actualites/Luciano-spalletti-devrait-succeder-a-roberto-mancini-au-poste-de-selectionneur-de-l-italie-presse-italienne/1414230#xtor=RSS-1","keywords":["Foot, ITA"],"creator":["Maxime Dubernet"],"video_url":null,"description":"Selon la presse italienne, Luciano Spalletti devrait bien être le successeur de Roberto Mancini, démissionnaire surprise, à la tête de la Nazionale. Si tous les détails ne sont pas encore réglés, la présentation de l'ancien entraîneur de Naples pourrait avoir lieu lundi.","content":"Après quelques jours de flottement, la Fédération italienne de football (FIGC) a trouvé le successeur de Roberto Mancini au poste de sélectionneur de la Nazionale. L'élu est Luciano Spalletti (64 ans), , qui devrait signer un contrat de trois ans jusqu'en septembre 2026, selon l'édition de de vendredi. Au terme de plusieurs entretiens téléphoniques, Spalletti a donné son accord au président de la FIGC, Gabriele Gravina, qu'il doit rencontre ce vendredi pour finaliser son contrat. Après sa nomination, qui pourrait être officialisée samedi, il devrait tenir sa première conférence de presse, lundi, en tant que sélectionneur. Les négociations ont été toutefois compliquées par son contrat avec Naples, avec lequel Spalletti est encore lié jusqu'en juin 2024. Pour l'attirer, tout prétendant doit régler une clause de 3 M€. Le président des Napolitains, Aurelio De Laurentiis, avait prévenu la FIGC qu'il ne renoncerait pas à cette indemnité. Sur cette question, la FIGC explore les recours juridiques. La presse italienne se dit confiante dans la résolution de ce problème.","pubDate":"2023-08-18 07:17:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/quelques-mois-apres-avoir-quitte-le-poste-d-entraineur-principal-de-naples-luciano-spalletti-devrait-prendre-la-tete-de-la-selection-italienne-memmler-eibner-presse-sports/1500000001822115/0:0,1998:999-665-335-70/51c8e.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Dutee Chand to challenge four-year NADA ban","link":"https://indianexpress.com/article/sports/sport-others/dutee-chand-to-challenge-four-year-nada-ban-8898033/","keywords":["Sport Others","Sports"],"creator":null,"video_url":null,"description":null,"content":"Double Asian Games silver medallist Dutee Chand will challenge the four-year ban imposed on the celebrated Indian athlete by the National Anti-Doping Agency (NADA) for failing two out-of-competition dope tests for a banned substance. The 27-year-old 100m national record holder was on Thursday served the ban after two samples taken in December last year were found to contain “other anabolic agents/SARMS”, which is listed under “WADA’s 2023 prohibited list of non-specified substances”. The samples were taken on December 5 and 26 respectively and both returned positive for almost identical substances. SARMS, or selective androgen receptor modulators, are non-steroidal substances commonly used to treat osteoporosis, anaemia and wound healing in patients. Dutee’s ban will be effective from January 3 this year and all her competitive results will be scrapped from the date the first sample collection took place (December 5, 2023). Dutee’s counsel Parth Goswami told PTI on Friday that the sprinter had been a “clean athlete” all her professional career and it was a case of “unintentional consumption”. The athlete had won silver medals in 100 and 200m at the 2018 Jakarta Asian Games and holds the national record of 11.17 sec in 100m (2021). “For us, this is a clear case of unintentional consumption of a banned substance. We were clearly able to establish the source of the substance in the body, which is a substantial proof of lack of intent. The substance was never used to gain any sporting advantage,” said Goswami. “We are in process of filing an appeal. We are hopeful that we will be able to convince the appeal panel,” he added. Advertisement “Dutee is the pride of India and is a clean athlete. She has had an illustrious career of over a decade. She has undergone hundreds of dope tests internationally and nationally and has always been clean in her long career,” added Goswami. Dutee and her counsel had also claimed before NADA’s Anti-Doping Disciplinary Panel (ADDP) that it was a case of “unintentional consumption”. “The athlete and her counsel had without refuting the findings of the NDTL (National Dope Testing Laboratory) report stated that the consumption of the said substance was unintentional and the ingestion of the same had been advised by the physiotherapist who was being regularly consulted by the athlete,” said the ADDP order. Advertisement Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more “The athlete and her counsels submitted that the said physiotherapist had been attached with the athlete from the Pullela Gopichand Academy where the athlete was training under special permission.” Dutee’s counsel had submitted that the sprinter was “hyperandrogenic” owing to which she was having “severe groin pain” because of which the treatment was recommended. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More ADDP said that the athlete had “delegated the task of purchasing the drugs to her friend”, who was also a witness in the case. “(The witness) before giving his deposition had submitted an affidavit where he stated that he himself went to the shop to buy the said supplement for hormonal disbalance but, on the contrary, during his cross-examination (the witness) denied buying the said supplement in person but rather re-delegating to his manager,” ADDP noted. Also Read Vinesh Phogat undergoes knee surgery in Mumbai, vows to come back stronger Pistol shooters misfire on opening day of Worlds Women wrestlers won’t feel safe if Brij Bhushan Sharan Singh’s people win... Neeraj Chopra tweets requesting Kishore Jena’s visa issue be resolved ahe... “The admitted fact on the affidavit placed before the ADDP and the cross-examination of the witness highlights there are glaring contradictions in the fact put forth before the panel by the witnesses, thereby raising legitimate concerns regarding the reliability of the statements made by the witness,” said ADDP order.","pubDate":"2023-08-18 06:58:15","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"World chess federation bars transgender women from competing in women’s events","link":"https://indianexpress.com/article/sports/chess/world-chess-federation-bars-transgender-women-from-competing-in-womens-events-8897934/","keywords":["Chess","Sports"],"creator":null,"video_url":null,"description":null,"content":"The world’s top chess federation has ruled that transgender women cannot compete in its official events for women until its officials make an assessment of gender change. The decision by the Switzerland-based federation FIDE, published on Monday, has drawn criticism from advocacy groups and supporters of transgender rights. FIDE said it and its member federations increasingly have received recognition requests from players who identify as transgender, and that the participation of transgender women would depend on an analysis of individual cases that could take up to two years. “Change of gender is a change that has a significant impact on a player’s status and future eligibility to tournaments, therefore it can only be made if there is a relevant proof of the change provided,” the federation said. “In the event that the gender was changed from a male to a female the player has no right to participate in official FIDE events for women until further FIDE’s decision is made,” it said. Holders of women’s titles who change their genders to male would see those titles “abolished,” the federation said, while holding out the possibility of a reinstatement “if the person changes the gender back to a woman.” “If a player has changed the gender from a man into a woman, all the previous titles remain eligible,” the federation said. It acknowledged that such questions regarding transgender players were an “evolving issue for chess” and that “further policy may need to be evolved in the future in line with research evidence.” Cathy Renna, communications director for the National LGBTQ Task Force in the United States, lashed out at what she said appeared to be “a case of trans panic’ with no justification, not grounded in reality and once again marginalizing trans people.” Advertisement “The new guidelines’ on trans competitors in chess are infuriating, confusing, contradictory and a sign that the anti-trans movement, particularly those who are promoting exclusion in sports, is spreading into other areas of competitive sport and is a very disturbing development,” Renna said in an e-mail. In a written response to The Associated Press, seeking an explanation about the decision, the federation’s press office said: “Allow us to clarify that the new regulations are aimed at clearly defining the procedure on how a person who has officially changed their gender may register the fact on FIDE Directory.” The lack of such regulations caused “ambiguity,” it said, “and therefore an established order was needed to provide the right of the transgender players being properly represented on the official register of FIDE.” It said any transgender player was allowed to participate in the “open” section of its chess tournaments. Advertisement “Two years is a scope of sight that seemed reasonable for the thorough analyses of such developments,” the federation said. “It is to set a certain deadline for a new reiteration of these policies, without rushing it.” Word of the decision comes as the federation is hosting a World Cup event in Azerbaijan where top players, including No. 1-ranked Grand Master Magnus Carlsen of Norway, are attending. Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more The federation has open competitions that allow all players to take part, as well as specialized categories, such as for women, young players and even computers. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More Many sports involving intense physical activity — which chess does not — have been grappling with how to formulate policies toward transgender athletes in recent years. The International Cycling Union has joined the governing bodies of track and field and swimming as top-tier Olympic sports addressing the issue of transgender athletes and fairness in women’s events. Also Read Chess World Cup 2023 Highlights: Praggnanandhaa defeats Arjun Erigaisi in... Chess World Cup 2023 Highlights: Arjun Erigaisi and Praggnanandhaa head t... Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters ... Chess World Cup 2023 Highlights: Gukesh loses to Carlsen; Arjun Erigaisi ... Advertisement Last month, the cycling federation ruled that female transgender athletes who transitioned after male puberty will no longer be able to compete in women’s races.","pubDate":"2023-08-18 06:26:08","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"Video: Former Southampton, Arsenal and Everton player Theo Walcott retires","link":"https://www.caughtoffside.com/2023/08/18/video-former-southampton-arsenal-and-everton-player-theo-walcott-retires/","keywords":["Arsenal FC","Championship","Everton FC","Extra Time","Features - NewsNow","Football and Soccer","Mobile App Stories","Premier League","Southampton FC","Transfer News","theo walcott"],"creator":["Jason Pettigrove"],"video_url":null,"description":"After being released by Southampton this summer, Theo Walcott has decided to retire from the game at 34 years of age.Dogged by injuries during the latter part of his career, the lightning-fast winger will still be remembered fondly by Saints fans as well as Arsenal and Everton supporters.Sky Sports News report that he did have […] The post Video: Former Southampton, Arsenal and Everton player Theo Walcott retires appeared first on CaughtOffside.","content":"Dogged by injuries during the latter part of his career, the lightning-fast winger will still be remembered fondly by Saints fans as well as Arsenal and Everton supporters. Sky Sports News report that he did have offers to continue his career elsewhere, but has made the decision to call it a day. He leaves the game after making over 400 career appearances and having played 47 times for England.","pubDate":"2023-08-18 06:17:35","image_url":"https://www.caughtoffside.com/wp-content/uploads/2015/06/Theo-Walcott-Arsenal-Spurs.png","source_id":"caughtoffside","source_priority":16638,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Карасев назначен на «Спартак» – «Зенит», Медведев проиграл Звереву, Захарян точно в «Сосьедаде», УЕФА выбрал лучших, «Рубин» уволит Рахимова и другие новости","link":"https://www.sports.ru/football/1115391782-karasev-naznachen-na-spartak-zenit-medvedev-proigral-zverevu-zaxaryan-.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"1","content":"1. Главным арбитром матча «Зенит» – «Спартак» назначен Сергей Карасев , а прокомментируют самую важную игру лета Журавель и Трушечкин . Тем временем Владислав Безбородов и Сергей Иванов пропустят третий тур РПЛ подряд . 2. Даниил Медведев проиграл Александру Звереву в третьем круге турнира в Цинциннати. Еще одно раннее поражение Даниила, его волшебная игра куда-то пропала . Ну а Зверев впервые после травмы победил соперника из топ-10 . Новак Джокович прошел Гаэля Монфиса, Карлос Алькарас одолел Томми Пола. У женщин Дарья Касаткина проиграла Арине Соболенко в третьем круге. 3. Захарян едет в Ла Лигу – «Динамо» уладило разногласия с агентом игрока и выплатит ему два миллиона евро. При этом семья Арсена была на стороне агента в споре с клубом. Впрочем, проблемы позади, сегодня хавбек прилетает в Испанию . 4. Месси, Холанд и де Брюйне стали финалистами премии УЕФА лучшему игроку сезона-2022/23, Мбаппе не попал даже в топ-5 . На приз лучшему тренеру претендуют Гвардиола, Индзаги и Спаллетти , совсем немного не дотянули до топ-3 Де Дзерби и Артета. 5. Похоже, нас ждет вторая отставка в РПЛ – Рашид Рахимов уже сегодня может быть уволен из «Рубина». 6. В квалификации Лиге Европы «Шериф» прошел БАТЭ, «Астана» проиграла «Лудогорцу» , «Славия» выбила «Днепр-1». В Лиге конференций «Сабах» Мурада Мусаева по пенальти проиграл «Партизану» , «Бешикташ» победил «Нефтчи», «Динамо» Киев выбило «Арис». 7. Владимир Путин наградил главу ОКР Станислава Позднякова орденом Александра Невского. 8. Килиан Мбаппе сообщил окружению, что останется в «ПСЖ» , но через год он хочет только в «Реал». 9. Открытая категория с участием трансгендеров появится на Кубке мира по плаванию. Евгений Коротышкин ждет категорий для Железного Человека и Человека-паука . 10. «Спартак» представил красно-черную третью форму , посвященную победам над «Аяксом» в 1998 году. «Милан» показал сиренево-бирюзовую третью форму , которая символизируют инклюзивность. 11. «Салават» в память о Родионе Амирове выведет из обращения 27-й номер . 12. Сергей Бубка покинет World Athletics . Он входил в систему организации 22 года. 13. Глава FA допустил, что мужскую сборную Англии может тренировать женщина – Сарина Вигман, возглавляющая женскую национальную команду. 14. Кевин де Брюйне перенесет операцию и пропустит 3-4 месяца. Цитаты дня Лионель Месси: «Никогда не придавал значения «Золотому мячу». Думаю о нем гораздо меньше после победы на ЧМ» Шнякин о претензиях «Зенита»: «Чуть ли не от Миллера прилетело: «Что это он себе позволяет говорить «питерцы»?» Депутат Свищев: «Мы видим кризис проведения Олимпийских игр, их формат уже не вызывает в мире прежнего интереса» Слуцкий не жалеет, что назвал журналиста «19-летним дебилом»: «Вообще по барабану. Я веду себя так, как считаю нужным» Министр спорта Украины: «Не исключаю, что россияне сделают «жест доброй воли» и скажут, что не поедут на Олимпиаду»","pubDate":"2023-08-18 06:10:00","image_url":null,"source_id":"sports","source_priority":60448,"country":["russia"],"category":["sports"],"language":"russian"},{"title":"Avant la réception de l'OM en Ligue 1, Metz inquiète déjà","link":"https://www.lequipe.fr/Football/Actualites/Avant-la-reception-de-l-om-en-ligue-1-metz-inquiete-deja/1414157#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Cyril Olives-Berthet"],"video_url":null,"description":"Écrasé à Rennes (1-5) dimanche, Metz a beaucoup de travail pour se mettre au niveau de la Ligue 1.","content":"Début juillet, dans la touffeur de la salle de presse improvisée de Frescaty, Matthieu Udol avait averti les siens : Mais le latéral gauche a vu les Grenats couler à Rennes (1-5, dimanche) lors de la première journée, et l'entame de calendrier s'annonce compliquée pour le promu (OM aujourd'hui, puis Clermont, Reims, Lens, Strasbourg, Toulouse et Nice). , a pesté le capitaine messin, resté sur le banc en raison d'une maladie qui l'empêche encore d'être opérationnel pour la deuxième journée. Bölöni veut encore un joueur par ligne Au Roazhon Park, les hommes de Laszlo Bölöni ont manqué de tout, concédant notamment 29 tirs (dont 23 dans la surface). , a reconnu le coach de 70 ans. Le trio Bourigeaud-Le Fée-Santamaria a marché sur Danley Jean-Jacques et Kévin N'Doram, deux joueurs pourtant majeurs de l'entrejeu lorrain. La défense a été très naïve, à l'image de Koffi Kouao, qui a souffert face à Jérémy Doku. , a prévenu l'expérimenté Maxime Colin, tandis que Cheikh Sabaly a regretté le de l'équipe. , a rappelé Ismaël Traoré en Bretagne. Pour exister, il faut aussi recruter. Les recrues principales sont le défenseur Colin, le milieu Jean N'Guessan et deux attaquants (Simon Elisor, Benjamin Tetteh). , a regretté Bölöni, qui devrait perdre son buteur Georges Mikautadze, dont la vente a été budgétée par sa direction, et qui ne pourra pas compter sur l'ailier Ablie Jallow avant la trêve internationale de septembre. Le technicien roumain désirant encore , le club lorrain cherche toujours un joueur offensif et négocie avec l'IFK Göteborg pour le transfert du défenseur central suédois Johan Bangsbo (1,91 m, 85 kg). Cela ne sera pas un luxe pour une équipe (Sabaly) et qui doit , selon son coach.","pubDate":"2023-08-18 06:10:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/laszlo-boeloeni-et-les-rennais-se-sont-lourdement-inclines-a-rennes-1-5-en-ouverture-du-championnat-dimanche-j-m-hervio-l-equipe/1500000001821891/0:0,1994:1330-665-335-70/fe835.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports","link":"https://uaenews247.com/2023/08/18/the-new-serie-a-season-kicks-off-this-saturdaylive-and-exclusive-on-starzplay-sports/","keywords":["Sports & Recreations","STARZPLAY Sports"],"creator":["uaenews247"],"video_url":null,"description":"The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports Football is back this weekend on STARZPLAY Sports as the new Serie A season kicks off on Saturday August 19th. All 380 matches will be broadcast across two channels dedicated to the league, Abu Dhabi Sports 1 & 2 Premium which … Continue reading The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports →","content":"Football is back this weekend on as the new Serie A season kicks off on Saturday August 19th. All 380 matches will be broadcast across two channels dedicated to the league, Abu Dhabi Sports 1 & 2 Premium which are exclusively on STARZPLAY Sports. The first match on the opening day of the 2023/24 season sees newly promoted Frosinone welcome last term’s champions Napoli at 8:30pm UAE, followed by the 2022/23 UEFA Champions League finalists Inter Milan at home to Monza at 10:45pm UAE. On Sunday, last season’s UEFA Europa League finalists, Roma host Salernitana in the Stadio Olimpico at 8.30pm UAE then Udinese face Juventus at 10:45 UAE. AC Milan travel to Bologna on Monday at 10:45pm UAE rounding off the weekend’s action. Launched ahead of the new 2023/24 season, fans can now engage with the Serie A like never before with STARZPLAY Fantasy Sports. Players can make predictions around live Serie A matches, from forecasting scores and possession percentages to identifying the first goal scorer via in-game arenas, in order to win fantastic prizes. Serie A recently jumped to second in the updated UEFA League rankings for 2022-23. The combination of exciting football, incredible players, massive clubs, different title winners over the past four seasons and success in Europe including a team in each of the three UEFA finals has seen the rise of Serie A which is now ranked higher than La Liga and Bundesliga. The league is packed with star power players like Di Maria, Lautaro, Pogba, Dybala, Osimhen, Leao and Immobile. Serie A coverage includes some of the most popular commentators and analysts in the Arab world elevating the match day viewing experience. In celebration of the start of the season, STARZPLAY is offering SERIE A fans a 30% discount on the annual package. With thousands of hours of premium content including blockbuster movies, exclusive TV shows, kids’ content, Arabic series, as well as varied content via add-on channels, STARZPLAY is a leading video-on-demand subscription service in the MENA region. The service is available across 19 countries for fans to enjoy quality content anytime, anywhere, and from any device. Ranked consistently among the region’s top three subscription video on demand services, STARZPLAY Arabia ( ) streams an extensive variety of premium content covering Hollywood movies, TV shows, documentaries and same-time-as-the-US series – plus live sports, dedicated kids’ entertainment and Arabic content – to 19 countries across MENA and Pakistan. STARZPLAY has thousands of prime titles including exclusive STARZPLAY Arabia original content such as Kaboos, Say Yes to the Dress Arabia, Baghdad Central, STARZ Original content such as Power, Outlander, Spartacus and The White Queen as well as a range of content with add-ons such as AD Sports, Premier Sports (Rugby), NBA League Pass and STARZPLAY Sports, the dedicated sports package covering football (Italian Serie A and Dutch Eredivisie leagues), wrestling (All Elite Wrestling), cricket, UFC Arabia, boxing, basketball and more. STARZPLAY Arabia has secured tie ups with a host of leading, global studios, including Lionsgate, MGM, Warner Bros, Universal, Discovery and Sony Studios along with regional producers such as UMS, Eagle Films and Falcon. Until 2022, STARZ ( ), a Lionsgate company (NYSE: LGF.A, LGF.B) was the lead investor along with media and technology investment firms including SEQ Investors and Delta Partners. In early 2021, STARZPLAY Arabia secured its first independent financing in the region of US$25 million (approx. AED 92 million) from Abu Dhabi based Ruya Partners. In 2022, E-Vision, from e& and ADQ, an Abu Dhabi-based investment and holding company acquired a majority equity stake of circa 57% in the company. Reaching over 2.9 million subscribers, STARZPLAY Arabia allows subscribers to watch its full HD and 4K content via most internet-enabled devices, smart TVs and game consoles, and is widely available on regional IPTV services. Its iOS and Android apps – installed on over three million devices – also allow downloads for offline playback. : Instagram , Facebook , Twitter , TikTok , YouTube","pubDate":"2023-08-18 06:07:16","image_url":"https://2.gravatar.com/avatar/8cf576a7747fe7b37bd632f279fa3bc8f461c8fabecbc279bd79160e7a06a7bc?s=96&d=identicon&r=G","source_id":"uaenews247","source_priority":7518978,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"title":"Ireland vs India, 1st T20I tip-off XI: Rinku Singh to make his debut, Jasprit Bumrah returns, Prasidh Krishna comes in","link":"https://indianexpress.com/article/sports/cricket/ireland-vs-india-1st-t20i-tip-off-xi-rinku-singh-to-make-his-debut-jasprit-bumrah-returns-prasidh-krishna-comes-in-8897884/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"The three-match T20I series against Ireland is a chance to the likes of Jasprit Bumrah and Prasidh Krishna to prove their match fitness ahead of the Asia Cup and the ODI World Cup. At the same time it will be massive opportunity to Sanju Samson, who had a poor outing against West Indies in the T20Is to get back among the runs. India’s Gen-Next IPL performers like Ruturaj Gaikwad, Rinku Singh and Jitesh Sharma will also be eager to make impact. The fringe players like Washignton Sundar, Shahbaz Ahmed and Ravi Bishnoi to show their prowess and the comeback man Shivam Dube would be looking for a redemption. It will be interesting to see how players and the team management balance individual and team goals while keeping the big picture in mind. ALSO READ | India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE Here are few tips ahead of the first T20I: Rinku Singh to make his debut Rinku Singh, who has grabbed the headlines for his explosive batting down the order and not forget the hitting five sixes in a row in the final over to win a game, is set to make his debut. Rinku’s journey has been unique. For the first three seasons in the IPL, he hardly made an impact, managing only 77 runs. He didn’t get to play a single game in the 2021 season. In the second half of IPL 2022, he played a couple of cameos but in losing cause. But IPL 2023 proved to be a game-changer, as he amassed 474 runs at a strike rate of 149.53. After being picked for India, the explosive batter had said “it still feels like a dream.” Return of Bumrah Returning to competitive cricket after 11 months, spending countless hours on the surgeon’s table, rehab booths and practice nets, Jasprit Bumrah would be itching to hit the ground running. 💬 💬 “Very happy to be back.” Captain Jasprit Bumrah – making a comeback – takes us through his emotions ahead of the #IREvIND T20I series. #TeamIndia | @Jaspritbumrah93 pic.twitter.com/IR9Rtp26gi — BCCI (@BCCI) August 17, 2023 A two-ball nets footage reassured that he has not lost much of his pace or sharpness. One was a devilish bouncer that tied Ruturaj Gaikwad in knots that he kept away awkwardly; the other was a searing toe-crusher that Yashasvi Jaiswal negotiated with a last-second bat-jam. The 14-second clip was watched with a heave of relief by the Indian cricket fraternity. Advertisement Bumrah is arguably one of their most potent, as well as reliable, weapons in the Indian team, someone who could influence the match at any time, with the old or new ball, at the start, middle, or at the death. He was dearly missed in the T20 World Cup and World Test Championship. But the biggest prize of them is winning the World Cup at home. Prasidh also makes a comeback Just like Bumrah, even Prasidh Krishna is making a comeback to competitive cricket and before his lower back stress fracture injury which also required a surgery, the Bengaluru fast bowler was a certainty in ODI set-up. It is expected that selectors would check out Krishna’s form before taking a final call on the Asia Cup squad expected to be announced by the end of this week. Advertisement Prasidh had also bowled in the KSCA T20 tournament for G Kasturirangan Memorial Trophy tournament last month. He took four wickets (4-0-36-4) in that match for Mount Joy Cricket Club against Sir Syed Cricketers. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More Prasidh is coming back after a prolonged injury lay-off that saw him missing the action for nearly a year. The Karnataka pacer last played for India in an ODI match against Zimbabwe on August 20, 2022. IND vs IRE Head-to-head (T20Is) Matches played : 5 Ireland won: 0 India won: 5 Tied: 0 No Result: 0 Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more IND vs IRE Pitch report The average score batting first at Malahide is 167. Spinners might tend to struggle at this venue because of the small ground dimensions. The pacers might get help from the pitch but overall, it has always been a batting paradise. Ireland vs India Predicted XI Also Read India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE PCB should delete the video and apologise: Wasim Akram slams Pakistan Cri... ‘Never thought it was all over’: Jasprit Bumrah says he is ready for Worl... Ben Stokes’ Moeen Ali-inspired ‘Lol’ tweet sends England Cricket into jub... Ireland Predicted XI: Paul Stirling (c), Andrew Balbirnie, Lorcan Tucker (wk), Harry Tector, Curtis Campher, Fionn Hand, George Dockrell, Mark Adair, Barry Mccarthy, Josh Little, Ben White India predicted XI: Yashasvi Jaiswal, Ruturaj Gaikwad, Tilak Varma, Rinku Singh, Sanju Samson (wk), Shivam Dube , Washington Sundar , Arshdeep Singh, Ravi Bishnoi , Jasprit Bumrah (c), Prasidh Krishna","pubDate":"2023-08-18 06:06:35","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"Kickoff | Saudis 'set' to make another bid for Messi!","link":"https://www.snl24.com/kickoff/worldnews/saudis-set-to-make-another-bid-for-lionel-messi-20230818","keywords":null,"creator":null,"video_url":null,"description":"Despite having only recently joined Inter Miami, Lionel Messi is reportedly set to be the subject of another massive bid from Saudi Arabia.","content":"With Al Hilal, who are owned by the Saudi Public Investment Fund (PIF), having pursued Messi prior to his move to Inter Miami, it is said the wealthy club owners are set to reignite their efforts to bring the Argentine to the Saudi Pro League after being rejected by the 2022 FIFA World Cup winner in July. According to Saudi Arabian publication , the PIF is set to initiate talks with the Florida club over the possibility of signing Messi on loan in the current 2023/24 campaign. It is claimed talks between the two teams could get underway in the next few days, with the PIF's plan being for the 36-year-old to represent one of their four teams in the Saudi top flight, namely Al Ahli, Al Hilal, Al Nassr, and Al Ittihad. The big-spending Saudis are believed to have already spent €540 million (R11.2 billion) on transfers so far in this window, with Neymar's recent move to Al Hilal from Paris Saint-Germain having commanded the highest transfer fee at €90 million (R1.8 billion). Messi himself has shone since making the switch to the US, scoring nine goals in six games and leading his new team all the way to the Leagues Cup final, which will take place on Sunday. Inter Miami's previous boss Phil Neville, meanwhile, has claimed that he knew he would not be in charge of the club for much longer following the Albiceleste captain's blockbuster arrival. He told Taylor podcast: \"I always had a feeling, deep down, I wasn't going to be here [in Miami] when he [Messi] was going to come to the club. And I say that not lacking confidence in myself but this was different, this was not signing Gonzalo Higuain or Blaise Matuidi. \"You look around the world, the way he has been at other clubs and there has always been certain managers that managed him. The bottom line for me was, forget Messi, the results weren't good enough the last month I was in the job and I knew that. That is the reason I left. \"When I look in the mirror in the morning and my friends or social media say 'it could have been you', well, no, it couldn't have. The results were not good enough. I knew the vision, I knew what the club wanted. I've been in football a long time and sometimes it is not meant to be. I am not bitter, twisted or angry.\" You must be to read and post comments.","pubDate":"2023-08-18 07:37:52","image_url":"https://cdn.24.co.za/files/Cms/General/d/3780/dfa0e2df8e074cc184da6e467e0eaaef.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"title":"Théo Walcott annonce prendre sa retraite et veut devenir consultant","link":"https://www.lequipe.fr/Football/Actualites/Theo-walcott-annonce-prendre-sa-retraite/1414231#xtor=RSS-1","keywords":["Foot, ANG"],"creator":["Maxime Dubernet"],"video_url":null,"description":"À 34 ans, Théo Walcott, ancien ailier anglais d'Arsenal, a annoncé prendre sa retraite ce vendredi. Il a indiqué vouloir se reconvertir dans le monde des médias.","content":"L'heure de la retraite a sonné pour Théo Walcott (34 ans). L'ancien ailier d'Arsenal (2006-2018) a indiqué ce vendredi matin prendre sa retraite après 18 années sur les terrains, où il aura inscrit 140 buts et délivré 103 passes décisives en 614 matches. « », souligne le joueur dans un long post Instagram. Formé à Southampton (2005-2006), l'ancien international anglais (47 sélections, 8 buts) a effectué la majeure partie de sa carrière avec le maillot des Gunners où sa vitesse de pointe était réputée en Premier League. Après un court passage à Everton (2018-2020), il est revenu dans son club formateur, à Southampton (2020-2023) où il a connu la relégation pour son ultime saison. « », continue Walcott. Annoncé dans le viseur de Reading (League One), il a révélé avoir rejeté des offres de clubs de Championship et d'équipes étrangères, notamment d'Arabie saoudite. Sa reconversion devrait se faire dans le monde des médias où, à , il aimerait devenir consultant. « , a-t-il confié à . »","pubDate":"2023-08-18 07:31:56","image_url":"https://medias.lequipe.fr/img-photo-jpg/theo-walcott-ici-sous-le-maillot-d-arsenal-a-officialise-sa-retraite-ce-vendredi-f-mons-l-equipe/1500000001822118/0:0,1998:999-665-335-70/18c02.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Luciano Spalletti devrait succéder à Roberto Mancini au poste de sélectionneur de l'Italie","link":"https://www.lequipe.fr/Football/Actualites/Luciano-spalletti-devrait-succeder-a-roberto-mancini-au-poste-de-selectionneur-de-l-italie-presse-italienne/1414230#xtor=RSS-1","keywords":["Foot, ITA"],"creator":["Maxime Dubernet"],"video_url":null,"description":"Selon la presse italienne, Luciano Spalletti devrait bien être le successeur de Roberto Mancini, démissionnaire surprise, à la tête de la Nazionale. Si tous les détails ne sont pas encore réglés, la présentation de l'ancien entraîneur de Naples pourrait avoir lieu lundi.","content":"Après quelques jours de flottement, la Fédération italienne de football (FIGC) a trouvé le successeur de Roberto Mancini au poste de sélectionneur de la Nazionale. L'élu est Luciano Spalletti (64 ans), , qui devrait signer un contrat de trois ans jusqu'en septembre 2026, selon l'édition de de vendredi. Au terme de plusieurs entretiens téléphoniques, Spalletti a donné son accord au président de la FIGC, Gabriele Gravina, qu'il doit rencontre ce vendredi pour finaliser son contrat. Après sa nomination, qui pourrait être officialisée samedi, il devrait tenir sa première conférence de presse, lundi, en tant que sélectionneur. Les négociations ont été toutefois compliquées par son contrat avec Naples, avec lequel Spalletti est encore lié jusqu'en juin 2024. Pour l'attirer, tout prétendant doit régler une clause de 3 M€. Le président des Napolitains, Aurelio De Laurentiis, avait prévenu la FIGC qu'il ne renoncerait pas à cette indemnité. Sur cette question, la FIGC explore les recours juridiques. La presse italienne se dit confiante dans la résolution de ce problème.","pubDate":"2023-08-18 07:17:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/quelques-mois-apres-avoir-quitte-le-poste-d-entraineur-principal-de-naples-luciano-spalletti-devrait-prendre-la-tete-de-la-selection-italienne-memmler-eibner-presse-sports/1500000001822115/0:0,1998:999-665-335-70/51c8e.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Dutee Chand to challenge four-year NADA ban","link":"https://indianexpress.com/article/sports/sport-others/dutee-chand-to-challenge-four-year-nada-ban-8898033/","keywords":["Sport Others","Sports"],"creator":null,"video_url":null,"description":null,"content":"Double Asian Games silver medallist Dutee Chand will challenge the four-year ban imposed on the celebrated Indian athlete by the National Anti-Doping Agency (NADA) for failing two out-of-competition dope tests for a banned substance. The 27-year-old 100m national record holder was on Thursday served the ban after two samples taken in December last year were found to contain “other anabolic agents/SARMS”, which is listed under “WADA’s 2023 prohibited list of non-specified substances”. The samples were taken on December 5 and 26 respectively and both returned positive for almost identical substances. SARMS, or selective androgen receptor modulators, are non-steroidal substances commonly used to treat osteoporosis, anaemia and wound healing in patients. Dutee’s ban will be effective from January 3 this year and all her competitive results will be scrapped from the date the first sample collection took place (December 5, 2023). Dutee’s counsel Parth Goswami told PTI on Friday that the sprinter had been a “clean athlete” all her professional career and it was a case of “unintentional consumption”. The athlete had won silver medals in 100 and 200m at the 2018 Jakarta Asian Games and holds the national record of 11.17 sec in 100m (2021). “For us, this is a clear case of unintentional consumption of a banned substance. We were clearly able to establish the source of the substance in the body, which is a substantial proof of lack of intent. The substance was never used to gain any sporting advantage,” said Goswami. “We are in process of filing an appeal. We are hopeful that we will be able to convince the appeal panel,” he added. Advertisement “Dutee is the pride of India and is a clean athlete. She has had an illustrious career of over a decade. She has undergone hundreds of dope tests internationally and nationally and has always been clean in her long career,” added Goswami. Dutee and her counsel had also claimed before NADA’s Anti-Doping Disciplinary Panel (ADDP) that it was a case of “unintentional consumption”. “The athlete and her counsel had without refuting the findings of the NDTL (National Dope Testing Laboratory) report stated that the consumption of the said substance was unintentional and the ingestion of the same had been advised by the physiotherapist who was being regularly consulted by the athlete,” said the ADDP order. Advertisement Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more “The athlete and her counsels submitted that the said physiotherapist had been attached with the athlete from the Pullela Gopichand Academy where the athlete was training under special permission.” Dutee’s counsel had submitted that the sprinter was “hyperandrogenic” owing to which she was having “severe groin pain” because of which the treatment was recommended. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More ADDP said that the athlete had “delegated the task of purchasing the drugs to her friend”, who was also a witness in the case. “(The witness) before giving his deposition had submitted an affidavit where he stated that he himself went to the shop to buy the said supplement for hormonal disbalance but, on the contrary, during his cross-examination (the witness) denied buying the said supplement in person but rather re-delegating to his manager,” ADDP noted. Also Read Vinesh Phogat undergoes knee surgery in Mumbai, vows to come back stronger Pistol shooters misfire on opening day of Worlds Women wrestlers won’t feel safe if Brij Bhushan Sharan Singh’s people win... Neeraj Chopra tweets requesting Kishore Jena’s visa issue be resolved ahe... “The admitted fact on the affidavit placed before the ADDP and the cross-examination of the witness highlights there are glaring contradictions in the fact put forth before the panel by the witnesses, thereby raising legitimate concerns regarding the reliability of the statements made by the witness,” said ADDP order.","pubDate":"2023-08-18 06:58:15","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"World chess federation bars transgender women from competing in women’s events","link":"https://indianexpress.com/article/sports/chess/world-chess-federation-bars-transgender-women-from-competing-in-womens-events-8897934/","keywords":["Chess","Sports"],"creator":null,"video_url":null,"description":null,"content":"The world’s top chess federation has ruled that transgender women cannot compete in its official events for women until its officials make an assessment of gender change. The decision by the Switzerland-based federation FIDE, published on Monday, has drawn criticism from advocacy groups and supporters of transgender rights. FIDE said it and its member federations increasingly have received recognition requests from players who identify as transgender, and that the participation of transgender women would depend on an analysis of individual cases that could take up to two years. “Change of gender is a change that has a significant impact on a player’s status and future eligibility to tournaments, therefore it can only be made if there is a relevant proof of the change provided,” the federation said. “In the event that the gender was changed from a male to a female the player has no right to participate in official FIDE events for women until further FIDE’s decision is made,” it said. Holders of women’s titles who change their genders to male would see those titles “abolished,” the federation said, while holding out the possibility of a reinstatement “if the person changes the gender back to a woman.” “If a player has changed the gender from a man into a woman, all the previous titles remain eligible,” the federation said. It acknowledged that such questions regarding transgender players were an “evolving issue for chess” and that “further policy may need to be evolved in the future in line with research evidence.” Cathy Renna, communications director for the National LGBTQ Task Force in the United States, lashed out at what she said appeared to be “a case of trans panic’ with no justification, not grounded in reality and once again marginalizing trans people.” Advertisement “The new guidelines’ on trans competitors in chess are infuriating, confusing, contradictory and a sign that the anti-trans movement, particularly those who are promoting exclusion in sports, is spreading into other areas of competitive sport and is a very disturbing development,” Renna said in an e-mail. In a written response to The Associated Press, seeking an explanation about the decision, the federation’s press office said: “Allow us to clarify that the new regulations are aimed at clearly defining the procedure on how a person who has officially changed their gender may register the fact on FIDE Directory.” The lack of such regulations caused “ambiguity,” it said, “and therefore an established order was needed to provide the right of the transgender players being properly represented on the official register of FIDE.” It said any transgender player was allowed to participate in the “open” section of its chess tournaments. Advertisement “Two years is a scope of sight that seemed reasonable for the thorough analyses of such developments,” the federation said. “It is to set a certain deadline for a new reiteration of these policies, without rushing it.” Word of the decision comes as the federation is hosting a World Cup event in Azerbaijan where top players, including No. 1-ranked Grand Master Magnus Carlsen of Norway, are attending. Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more The federation has open competitions that allow all players to take part, as well as specialized categories, such as for women, young players and even computers. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More Many sports involving intense physical activity — which chess does not — have been grappling with how to formulate policies toward transgender athletes in recent years. The International Cycling Union has joined the governing bodies of track and field and swimming as top-tier Olympic sports addressing the issue of transgender athletes and fairness in women’s events. Also Read Chess World Cup 2023 Highlights: Praggnanandhaa defeats Arjun Erigaisi in... Chess World Cup 2023 Highlights: Arjun Erigaisi and Praggnanandhaa head t... Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters ... Chess World Cup 2023 Highlights: Gukesh loses to Carlsen; Arjun Erigaisi ... Advertisement Last month, the cycling federation ruled that female transgender athletes who transitioned after male puberty will no longer be able to compete in women’s races.","pubDate":"2023-08-18 06:26:08","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"Video: Former Southampton, Arsenal and Everton player Theo Walcott retires","link":"https://www.caughtoffside.com/2023/08/18/video-former-southampton-arsenal-and-everton-player-theo-walcott-retires/","keywords":["Arsenal FC","Championship","Everton FC","Extra Time","Features - NewsNow","Football and Soccer","Mobile App Stories","Premier League","Southampton FC","Transfer News","theo walcott"],"creator":["Jason Pettigrove"],"video_url":null,"description":"After being released by Southampton this summer, Theo Walcott has decided to retire from the game at 34 years of age.Dogged by injuries during the latter part of his career, the lightning-fast winger will still be remembered fondly by Saints fans as well as Arsenal and Everton supporters.Sky Sports News report that he did have […] The post Video: Former Southampton, Arsenal and Everton player Theo Walcott retires appeared first on CaughtOffside.","content":"Dogged by injuries during the latter part of his career, the lightning-fast winger will still be remembered fondly by Saints fans as well as Arsenal and Everton supporters. Sky Sports News report that he did have offers to continue his career elsewhere, but has made the decision to call it a day. He leaves the game after making over 400 career appearances and having played 47 times for England.","pubDate":"2023-08-18 06:17:35","image_url":"https://www.caughtoffside.com/wp-content/uploads/2015/06/Theo-Walcott-Arsenal-Spurs.png","source_id":"caughtoffside","source_priority":16638,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Карасев назначен на «Спартак» – «Зенит», Медведев проиграл Звереву, Захарян точно в «Сосьедаде», УЕФА выбрал лучших, «Рубин» уволит Рахимова и другие новости","link":"https://www.sports.ru/football/1115391782-karasev-naznachen-na-spartak-zenit-medvedev-proigral-zverevu-zaxaryan-.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"1","content":"1. Главным арбитром матча «Зенит» – «Спартак» назначен Сергей Карасев , а прокомментируют самую важную игру лета Журавель и Трушечкин . Тем временем Владислав Безбородов и Сергей Иванов пропустят третий тур РПЛ подряд . 2. Даниил Медведев проиграл Александру Звереву в третьем круге турнира в Цинциннати. Еще одно раннее поражение Даниила, его волшебная игра куда-то пропала . Ну а Зверев впервые после травмы победил соперника из топ-10 . Новак Джокович прошел Гаэля Монфиса, Карлос Алькарас одолел Томми Пола. У женщин Дарья Касаткина проиграла Арине Соболенко в третьем круге. 3. Захарян едет в Ла Лигу – «Динамо» уладило разногласия с агентом игрока и выплатит ему два миллиона евро. При этом семья Арсена была на стороне агента в споре с клубом. Впрочем, проблемы позади, сегодня хавбек прилетает в Испанию . 4. Месси, Холанд и де Брюйне стали финалистами премии УЕФА лучшему игроку сезона-2022/23, Мбаппе не попал даже в топ-5 . На приз лучшему тренеру претендуют Гвардиола, Индзаги и Спаллетти , совсем немного не дотянули до топ-3 Де Дзерби и Артета. 5. Похоже, нас ждет вторая отставка в РПЛ – Рашид Рахимов уже сегодня может быть уволен из «Рубина». 6. В квалификации Лиге Европы «Шериф» прошел БАТЭ, «Астана» проиграла «Лудогорцу» , «Славия» выбила «Днепр-1». В Лиге конференций «Сабах» Мурада Мусаева по пенальти проиграл «Партизану» , «Бешикташ» победил «Нефтчи», «Динамо» Киев выбило «Арис». 7. Владимир Путин наградил главу ОКР Станислава Позднякова орденом Александра Невского. 8. Килиан Мбаппе сообщил окружению, что останется в «ПСЖ» , но через год он хочет только в «Реал». 9. Открытая категория с участием трансгендеров появится на Кубке мира по плаванию. Евгений Коротышкин ждет категорий для Железного Человека и Человека-паука . 10. «Спартак» представил красно-черную третью форму , посвященную победам над «Аяксом» в 1998 году. «Милан» показал сиренево-бирюзовую третью форму , которая символизируют инклюзивность. 11. «Салават» в память о Родионе Амирове выведет из обращения 27-й номер . 12. Сергей Бубка покинет World Athletics . Он входил в систему организации 22 года. 13. Глава FA допустил, что мужскую сборную Англии может тренировать женщина – Сарина Вигман, возглавляющая женскую национальную команду. 14. Кевин де Брюйне перенесет операцию и пропустит 3-4 месяца. Цитаты дня Лионель Месси: «Никогда не придавал значения «Золотому мячу». Думаю о нем гораздо меньше после победы на ЧМ» Шнякин о претензиях «Зенита»: «Чуть ли не от Миллера прилетело: «Что это он себе позволяет говорить «питерцы»?» Депутат Свищев: «Мы видим кризис проведения Олимпийских игр, их формат уже не вызывает в мире прежнего интереса» Слуцкий не жалеет, что назвал журналиста «19-летним дебилом»: «Вообще по барабану. Я веду себя так, как считаю нужным» Министр спорта Украины: «Не исключаю, что россияне сделают «жест доброй воли» и скажут, что не поедут на Олимпиаду»","pubDate":"2023-08-18 06:10:00","image_url":null,"source_id":"sports","source_priority":60448,"country":["russia"],"category":["sports"],"language":"russian"},{"title":"Avant la réception de l'OM en Ligue 1, Metz inquiète déjà","link":"https://www.lequipe.fr/Football/Actualites/Avant-la-reception-de-l-om-en-ligue-1-metz-inquiete-deja/1414157#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Cyril Olives-Berthet"],"video_url":null,"description":"Écrasé à Rennes (1-5) dimanche, Metz a beaucoup de travail pour se mettre au niveau de la Ligue 1.","content":"Début juillet, dans la touffeur de la salle de presse improvisée de Frescaty, Matthieu Udol avait averti les siens : Mais le latéral gauche a vu les Grenats couler à Rennes (1-5, dimanche) lors de la première journée, et l'entame de calendrier s'annonce compliquée pour le promu (OM aujourd'hui, puis Clermont, Reims, Lens, Strasbourg, Toulouse et Nice). , a pesté le capitaine messin, resté sur le banc en raison d'une maladie qui l'empêche encore d'être opérationnel pour la deuxième journée. Bölöni veut encore un joueur par ligne Au Roazhon Park, les hommes de Laszlo Bölöni ont manqué de tout, concédant notamment 29 tirs (dont 23 dans la surface). , a reconnu le coach de 70 ans. Le trio Bourigeaud-Le Fée-Santamaria a marché sur Danley Jean-Jacques et Kévin N'Doram, deux joueurs pourtant majeurs de l'entrejeu lorrain. La défense a été très naïve, à l'image de Koffi Kouao, qui a souffert face à Jérémy Doku. , a prévenu l'expérimenté Maxime Colin, tandis que Cheikh Sabaly a regretté le de l'équipe. , a rappelé Ismaël Traoré en Bretagne. Pour exister, il faut aussi recruter. Les recrues principales sont le défenseur Colin, le milieu Jean N'Guessan et deux attaquants (Simon Elisor, Benjamin Tetteh). , a regretté Bölöni, qui devrait perdre son buteur Georges Mikautadze, dont la vente a été budgétée par sa direction, et qui ne pourra pas compter sur l'ailier Ablie Jallow avant la trêve internationale de septembre. Le technicien roumain désirant encore , le club lorrain cherche toujours un joueur offensif et négocie avec l'IFK Göteborg pour le transfert du défenseur central suédois Johan Bangsbo (1,91 m, 85 kg). Cela ne sera pas un luxe pour une équipe (Sabaly) et qui doit , selon son coach.","pubDate":"2023-08-18 06:10:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/laszlo-boeloeni-et-les-rennais-se-sont-lourdement-inclines-a-rennes-1-5-en-ouverture-du-championnat-dimanche-j-m-hervio-l-equipe/1500000001821891/0:0,1994:1330-665-335-70/fe835.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports","link":"https://uaenews247.com/2023/08/18/the-new-serie-a-season-kicks-off-this-saturdaylive-and-exclusive-on-starzplay-sports/","keywords":["Sports & Recreations","STARZPLAY Sports"],"creator":["uaenews247"],"video_url":null,"description":"The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports Football is back this weekend on STARZPLAY Sports as the new Serie A season kicks off on Saturday August 19th. All 380 matches will be broadcast across two channels dedicated to the league, Abu Dhabi Sports 1 & 2 Premium which … Continue reading The new Serie A season kicks off this Saturday,live and exclusive on STARZPLAY Sports →","content":"Football is back this weekend on as the new Serie A season kicks off on Saturday August 19th. All 380 matches will be broadcast across two channels dedicated to the league, Abu Dhabi Sports 1 & 2 Premium which are exclusively on STARZPLAY Sports. The first match on the opening day of the 2023/24 season sees newly promoted Frosinone welcome last term’s champions Napoli at 8:30pm UAE, followed by the 2022/23 UEFA Champions League finalists Inter Milan at home to Monza at 10:45pm UAE. On Sunday, last season’s UEFA Europa League finalists, Roma host Salernitana in the Stadio Olimpico at 8.30pm UAE then Udinese face Juventus at 10:45 UAE. AC Milan travel to Bologna on Monday at 10:45pm UAE rounding off the weekend’s action. Launched ahead of the new 2023/24 season, fans can now engage with the Serie A like never before with STARZPLAY Fantasy Sports. Players can make predictions around live Serie A matches, from forecasting scores and possession percentages to identifying the first goal scorer via in-game arenas, in order to win fantastic prizes. Serie A recently jumped to second in the updated UEFA League rankings for 2022-23. The combination of exciting football, incredible players, massive clubs, different title winners over the past four seasons and success in Europe including a team in each of the three UEFA finals has seen the rise of Serie A which is now ranked higher than La Liga and Bundesliga. The league is packed with star power players like Di Maria, Lautaro, Pogba, Dybala, Osimhen, Leao and Immobile. Serie A coverage includes some of the most popular commentators and analysts in the Arab world elevating the match day viewing experience. In celebration of the start of the season, STARZPLAY is offering SERIE A fans a 30% discount on the annual package. With thousands of hours of premium content including blockbuster movies, exclusive TV shows, kids’ content, Arabic series, as well as varied content via add-on channels, STARZPLAY is a leading video-on-demand subscription service in the MENA region. The service is available across 19 countries for fans to enjoy quality content anytime, anywhere, and from any device. Ranked consistently among the region’s top three subscription video on demand services, STARZPLAY Arabia ( ) streams an extensive variety of premium content covering Hollywood movies, TV shows, documentaries and same-time-as-the-US series – plus live sports, dedicated kids’ entertainment and Arabic content – to 19 countries across MENA and Pakistan. STARZPLAY has thousands of prime titles including exclusive STARZPLAY Arabia original content such as Kaboos, Say Yes to the Dress Arabia, Baghdad Central, STARZ Original content such as Power, Outlander, Spartacus and The White Queen as well as a range of content with add-ons such as AD Sports, Premier Sports (Rugby), NBA League Pass and STARZPLAY Sports, the dedicated sports package covering football (Italian Serie A and Dutch Eredivisie leagues), wrestling (All Elite Wrestling), cricket, UFC Arabia, boxing, basketball and more. STARZPLAY Arabia has secured tie ups with a host of leading, global studios, including Lionsgate, MGM, Warner Bros, Universal, Discovery and Sony Studios along with regional producers such as UMS, Eagle Films and Falcon. Until 2022, STARZ ( ), a Lionsgate company (NYSE: LGF.A, LGF.B) was the lead investor along with media and technology investment firms including SEQ Investors and Delta Partners. In early 2021, STARZPLAY Arabia secured its first independent financing in the region of US$25 million (approx. AED 92 million) from Abu Dhabi based Ruya Partners. In 2022, E-Vision, from e& and ADQ, an Abu Dhabi-based investment and holding company acquired a majority equity stake of circa 57% in the company. Reaching over 2.9 million subscribers, STARZPLAY Arabia allows subscribers to watch its full HD and 4K content via most internet-enabled devices, smart TVs and game consoles, and is widely available on regional IPTV services. Its iOS and Android apps – installed on over three million devices – also allow downloads for offline playback. : Instagram , Facebook , Twitter , TikTok , YouTube","pubDate":"2023-08-18 06:07:16","image_url":"https://2.gravatar.com/avatar/8cf576a7747fe7b37bd632f279fa3bc8f461c8fabecbc279bd79160e7a06a7bc?s=96&d=identicon&r=G","source_id":"uaenews247","source_priority":7518978,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"title":"Ireland vs India, 1st T20I tip-off XI: Rinku Singh to make his debut, Jasprit Bumrah returns, Prasidh Krishna comes in","link":"https://indianexpress.com/article/sports/cricket/ireland-vs-india-1st-t20i-tip-off-xi-rinku-singh-to-make-his-debut-jasprit-bumrah-returns-prasidh-krishna-comes-in-8897884/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"The three-match T20I series against Ireland is a chance to the likes of Jasprit Bumrah and Prasidh Krishna to prove their match fitness ahead of the Asia Cup and the ODI World Cup. At the same time it will be massive opportunity to Sanju Samson, who had a poor outing against West Indies in the T20Is to get back among the runs. India’s Gen-Next IPL performers like Ruturaj Gaikwad, Rinku Singh and Jitesh Sharma will also be eager to make impact. The fringe players like Washignton Sundar, Shahbaz Ahmed and Ravi Bishnoi to show their prowess and the comeback man Shivam Dube would be looking for a redemption. It will be interesting to see how players and the team management balance individual and team goals while keeping the big picture in mind. ALSO READ | India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE Here are few tips ahead of the first T20I: Rinku Singh to make his debut Rinku Singh, who has grabbed the headlines for his explosive batting down the order and not forget the hitting five sixes in a row in the final over to win a game, is set to make his debut. Rinku’s journey has been unique. For the first three seasons in the IPL, he hardly made an impact, managing only 77 runs. He didn’t get to play a single game in the 2021 season. In the second half of IPL 2022, he played a couple of cameos but in losing cause. But IPL 2023 proved to be a game-changer, as he amassed 474 runs at a strike rate of 149.53. After being picked for India, the explosive batter had said “it still feels like a dream.” Return of Bumrah Returning to competitive cricket after 11 months, spending countless hours on the surgeon’s table, rehab booths and practice nets, Jasprit Bumrah would be itching to hit the ground running. 💬 💬 “Very happy to be back.” Captain Jasprit Bumrah – making a comeback – takes us through his emotions ahead of the #IREvIND T20I series. #TeamIndia | @Jaspritbumrah93 pic.twitter.com/IR9Rtp26gi — BCCI (@BCCI) August 17, 2023 A two-ball nets footage reassured that he has not lost much of his pace or sharpness. One was a devilish bouncer that tied Ruturaj Gaikwad in knots that he kept away awkwardly; the other was a searing toe-crusher that Yashasvi Jaiswal negotiated with a last-second bat-jam. The 14-second clip was watched with a heave of relief by the Indian cricket fraternity. Advertisement Bumrah is arguably one of their most potent, as well as reliable, weapons in the Indian team, someone who could influence the match at any time, with the old or new ball, at the start, middle, or at the death. He was dearly missed in the T20 World Cup and World Test Championship. But the biggest prize of them is winning the World Cup at home. Prasidh also makes a comeback Just like Bumrah, even Prasidh Krishna is making a comeback to competitive cricket and before his lower back stress fracture injury which also required a surgery, the Bengaluru fast bowler was a certainty in ODI set-up. It is expected that selectors would check out Krishna’s form before taking a final call on the Asia Cup squad expected to be announced by the end of this week. Advertisement Prasidh had also bowled in the KSCA T20 tournament for G Kasturirangan Memorial Trophy tournament last month. He took four wickets (4-0-36-4) in that match for Mount Joy Cricket Club against Sir Syed Cricketers. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More Prasidh is coming back after a prolonged injury lay-off that saw him missing the action for nearly a year. The Karnataka pacer last played for India in an ODI match against Zimbabwe on August 20, 2022. IND vs IRE Head-to-head (T20Is) Matches played : 5 Ireland won: 0 India won: 5 Tied: 0 No Result: 0 Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more IND vs IRE Pitch report The average score batting first at Malahide is 167. Spinners might tend to struggle at this venue because of the small ground dimensions. The pacers might get help from the pitch but overall, it has always been a batting paradise. Ireland vs India Predicted XI Also Read India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE PCB should delete the video and apologise: Wasim Akram slams Pakistan Cri... ‘Never thought it was all over’: Jasprit Bumrah says he is ready for Worl... Ben Stokes’ Moeen Ali-inspired ‘Lol’ tweet sends England Cricket into jub... Ireland Predicted XI: Paul Stirling (c), Andrew Balbirnie, Lorcan Tucker (wk), Harry Tector, Curtis Campher, Fionn Hand, George Dockrell, Mark Adair, Barry Mccarthy, Josh Little, Ben White India predicted XI: Yashasvi Jaiswal, Ruturaj Gaikwad, Tilak Varma, Rinku Singh, Sanju Samson (wk), Shivam Dube , Washington Sundar , Arshdeep Singh, Ravi Bishnoi , Jasprit Bumrah (c), Prasidh Krishna","pubDate":"2023-08-18 06:06:35","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"}]}