{"newsArray":[{"title":"Rewa still unbeaten","link":"https://www.fijitimes.com/rewa-still-unbeaten/","keywords":["Football","Sport","Digicel Premier League","Fiji News","Fiji Times Sport","Rewa Football","Rewa still unbeaten"],"creator":["Rohit Deo"],"video_url":null,"description":"The Rewa football side has extended its unbeaten run in the Digicel Fiji Premier League competition to six matches after a come-from-behind 3-2 win against Nadi yesterday. The Delta Tigers trailed Nadi 2-1 midway through the first spell at Prince Charles Park but equalised just before the break for a 2-all scoreline at the break. […]","content":"Labasa's Akimi Ralulu, right, battles for possession against Navua's Joseph Elder during their Digicel Premier League match at the Uprising Sports Centre in Navua on Sunday, April 23, 2023. Picture: JONACANI LALAKOBAU The Rewa football side has extended its unbeaten run in the Digicel Fiji Premier League competition to six matches after a come-from-behind 3-2 win against Nadi yesterday. The Delta Tigers trailed Nadi 2-1 midway through the first spell at Prince Charles Park but equalised just before the break for a 2-all scoreline at the break. Iosefo Verevou scored the winner for the reds in the second spell. Meanwhile, Lautoka left it late to beat 10-man Suva 2-1 at the Uprising Sports Complex in Pacific harbour. Rusiate Matererega put the whites ahead early from the penalty spot when Lautoka’s Aporosa Yada handled the ball inside his penalty box. Suva defender Joeli Ranitu was given the marching orders for his second bookable offence in the first spell. Lautoka scored two goals in the last five minutes of the match through Yada and Sairusi Nalaubu to register an important win. In other matches played yesterday, Ashneel Raju scored in the second spell to hand Labasa a 1-nil win over Navua while Nadroga edged Tailevu Naitasiri 2-1. In the lone match on Saturday, Ba beat Tavua 3-2. After six matches each, Rewa leads the stadings with 16 points followed by Lautoka on 13 points. Ba has 11 points and is in third spot followed by Suva and Labasa with 10 points each. Nadi has nine points while Tailevu Naitasiri and Nadroga have six points each. Navua and Tavua have three and one point respectively and are in danger of missing out on the Fiji FACT.","pubDate":"2023-04-24 04:16:22","image_url":null,"source_id":"fijitimes","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Botched Germany trip forces Eaglets to pick Constantine for final build up","link":"https://guardian.ng/sport/botched-germany-trip-forces-eaglets-to-pick-constantine-for-final-build-up/","keywords":["Football","Sport","Africa U-17 Tourney","Constantine","Golden Eaglets"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Nigeria’s 26-man squad were scheduled to arrive the Algerian city of Constantine, yesterday, to begin their final preparations for this year’s Africa U-17 Cup of Nations. The post Botched Germany trip forces Eaglets to pick Constantine for final build up appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Nigeria’s 26-man squad were scheduled to arrive the Algerian city of Constantine, yesterday, to begin their final preparations for this year’s Africa U-17 Cup of Nations. The team was earlier scheduled to have their final build-up to the competition in Germany, but visa hitches forced the Nigeria Football Federation (NFF) to send the squad earlier than scheduled to Algeria for the final build-up. According to the NFF, the team will now start training tomorrow in Constantine, where they will also play their Group B matches against Morocco, Zambia and South Africa. Coached by Nduka Ugbade, who was Nigeria’s captain in the maiden FIFA Cadet World Cup won by the Eaglets, the current squad is expected to get to at least the semifinals, which will guarantee the country a berth at the World Cup. “We are going to Algeria with confidence, but with level heads. We’re the champions of WAFU B, but in essence, nothing has been won. What matters now is winning a ticket to the FIFA World Cup and winning the Africa Cup. I believe we have the boys to do the job,” Ugbade told thenff.com before the team left Nigeria yesterday. The players in the team are Richard Odoh (HB Football Academy), Yahaya Danjuma Lawali (Mahanaim FC), Emmanuel Michael (Simon Ben Football Academy), Haruna Abdullahi (Kurfi Tigers Academy), Tochukwu Joseph Ogboji (Purple Crown Academy), Jeremiah Oluwaseyi Olaleke (Ablaze Football Academy), Umar Abubakar (Devine Football Academy), Abubakar Idris Abdullahi (Jega United) and Precious Tonye Williams (HB Football Academy). Others are Ifeoluwa Adewale Olowoporoku (Triple 44 Academy), Charles Adah Agada (Mavlon FC), Hope Yusuf Linus (E.E. Sporting Club), Jubril Opeyemi Azeez (Right Vision Choice Academy), Anongu Isaac Aondoakaa (FC Bathel Sporting), Israel Nwachukwu Usulor (Real Sapphire FC), Temiloluwa Oluwayimika Adelakin (Box2Box Academy), Simon Karshe Cletus (Mavlon FC), Tochukwu Simeon Ogbadibo (Jossy United) and Light Chijioke Eke (C&C Football Academy). Also in the squad are Favour Oluwasegun Daniel (G12 Football Academy), Chijioke Julius Linus (Triple 44 Academy), Quadri Oluwatobiloba Adewale (Nathaniel Boys FC), Gift Ukeh Adie (Paul E Football Academy), Musa Oluwaseyi Akinfenwa (Real Sapphire FC), Usman Ajibola Owoyemi (Triple 44 Academy) and Matthew Awodi Kingsley (Brook House Academy). Follow Us","pubDate":"2023-04-24 03:18:34","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"CAF CC:Rivers United walk tight rope as YANGA win 2-0 in Uyo","link":"https://guardian.ng/sport/caf-ccrivers-united-walk-tight-rope-as-yanga-win-2-0-in-uyo/","keywords":["Football","Sport","CAF Confederation Cup","Rivers United FC","Yanga FC"],"creator":["Guardian Nigeria"],"video_url":null,"description":"In football, they say it is not over until, the final whistle, but Nigeria’s Rivers United will have to do something extraordinary in the concluding leg of their CAF Confederation Cup quarterfinal tie against Young Africans of Tanzania to make it to the semifinal of the competition. The post CAF CC:Rivers United walk tight rope as YANGA win 2-0 in Uyo appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"In football, they say it is not over until, the final whistle, but Nigeria’s Rivers United will have to do something extraordinary in the concluding leg of their CAF Confederation Cup quarterfinal tie against Young Africans of Tanzania to make it to the semifinal of the competition. Playing at home, yesterday, in Uyo, the Pride of Rivers, Nigeria’s only surviving team in African inter-club competitions, were taught lessons on marksmanship by the Tanzanians, who scored two second-half goals to inch close to the semifinals of the competition. The Tanzanian Premier League champions came into the game talking about vengeance because Rivers United beat them home and away in the same competition two years ago. Most Nigerian thought the talks were just to psyche themselves up, but they showed in their composure and movement that a lot has happened since their last meeting with the Stanley Eguma-led Rivers United. Rivers United had the best of the opportunities in the first half, but there were always signs that YANGA had surprises up their sleeves each time they ventured forward. And in the second half, there was no holding them back as they went for the kill. Fiston Mayele scored two second-half goals for YANGA, who now have a massive advantage going into next weekend’s home tie in Dar es Salaam, where they will be staring at a first-ever continental semi-final appearance. An excited YANGA Head Coach, Nasreddine Nabi, described the victory in Uyo as dream come through. “I am delighted to win, because it is not easy to come to Nigeria and win. We played well and took our chances, but the game is far from over. We still have the second leg and we need to do even better to ensure we qualify,” he said. Mayele silenced the Godswill Akpabio Stadium crowd in the 73rd minute when he was picked out by a brilliant through ball from skipper Bakari Mwamnyeto. The Congolese import ran to the pass before hitting it past the keeper first time. The second goal came through the same route, with Mwamnyeto passing back a recycled ball from a set piece to Mayele, who made no mistake with the second goal. Rivers had some chances too and their best fell on skipper Nwagua Nyima, who was put through on goal by Gideon Duru, but he could not guide the ball into the net with the keeper beaten at the back post. Although the task now before Rivers United seems almost impossible, a 3-0 win in Tanzania will take them to the semifinals. It looks difficult, but it is also achievable. Follow Us","pubDate":"2023-04-24 03:18:20","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Barea : Fabiano Costa, non disponible","link":"https://midi-madagasikara.mg/2023/04/24/barea-fabiano-costa-non-disponible/","keywords":["Sports","Barea","Fabiano Costa","Football","Madagascar"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Après l’officialisation du départ du Français, Nicolas Dupuis à la tête des Barea A, le poste est vacant. La fédération malgache de football a annoncé que son futur successeur sera connu d’ici peu de temps. Parmi les noms cités par les férus du football figurent le technicien portugais, Fabiano Costa, Eric Rabesandratana ou encore Arsène […] L’article <strong>Barea</strong> : <strong>Fabiano Costa, non disponible</strong> est apparu en premier sur Midi Madagasikara.","content":"Après l’officialisation du départ du Français, Nicolas Dupuis à la tête des Barea A, le poste est vacant. La fédération malgache de football a annoncé que son futur successeur sera connu d’ici peu de temps. Parmi les noms cités par les férus du football figurent le technicien portugais, Fabiano Costa, Eric Rabesandratana ou encore Arsène Malabary. Fabiano Costa, ancien coach-assistant des Barea du temps de Rabesandratana, est le plus plébiscité mais ne pourra pas diriger la sélection dans l’immédiat. « Pour le moment, ce ne serait pas possible d’être sélectionneur des Barea. C’était mon objectif de retravailler avec Madagascar, j’ai prévenu tout le monde bien avant mes autres propositions, que j’avais notamment d’Arabie, mais ils n’ont rien fait. Dans un avenir proche, peut-être après les élections du président de la fédération, je serais toujours disponible pour aider le football malgache « , nous a-t-il lancé. Ce technicien portugais s’est fait respecter par les joueurs des Barea. Et sa technicité et son savoir-faire étaient un plus quand il était dans le staff technique d’Eric Rabesandratana lors des qualifications pour la Coupe du monde 2022. T.H","pubDate":"2023-04-24 03:01:00","image_url":null,"source_id":"madagasikara","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"Murió Juan Carlos Sarnari, autor del primer gol de River en la Libertadores","link":"https://www.pagina12.com.ar/543023-murio-juan-carlos-sarnari-autor-del-primer-gol-de-river-en-l","keywords":null,"creator":["Página/12"],"video_url":null,"description":null,"content":"El exfutbolista Juan Carlos Sarnari, quien jugó en River y la Selección, murió a los 81 años en Colombia , según confirmaron las autoridades del club Independiente Santa Fe, donde supo ser ídolo. El \"Nene\" , un volante de gran técnica y llegada al área rival, entró en la historia de River al ser nada menos el encargado de anotar el primer gol del club en la Copa Libertadores, en la década del '60. Fue en la edición de 1966 y justamente contra Boca, con triunfo 2-1 con goles de Sarnari a los 35 minutos, Daniel Bayo a los 41 y descuento de Alfredo Rojas en el segundo tiempo para el Xeneize. Aquel River dirigido por Renato Cesarini fue subcampeón de esa Libertadores , luego de caer con Peñarol de Montevideo en la final desempate disputada en Chile. En tanto que también dejó su marca en la Selección Argentina, con la cual disputó el Mundial de Inglaterra 1966 y la Copa América del año siguiente. Fue uno de los jugadores más jóvenes en debutar con la Albiceleste, al hacerlo con 18 años en un partido ante Costa Rica (2-0) por el Panamericano de 1960. En total, sumó 6 partidos y un gol en la Selección Nacional. Sarnari nació en Firmat, provincia de Santa Fe, donde dio sus primeros pasos en el Firmat Football Club. A River llegó a los 17 años y debutó en 1959. Luego pasó a préstamo a Huracán en 1963 y volvió al Millonario al año para compartir equipo con leyendas como Amadeo Carrizo, Oscar Mas, Ermindo Onega, Daniel Ortega, Luis Cubilla y el brasileño Delem. Posteriormente, su carrera continuó en Universidad de Chile, Universidad Católica y Deportes La Serena , también en el país trasandino, y en Independiente Santa Fe .","pubDate":"2023-04-24 03:01:00","image_url":"https://images.pagina12.com.ar/styles/width960/public/2023-04/719039-fuvvfmcxsaa-lgr.jpg?itok=EFp28UuK","source_id":"pagina12","category":["sports"],"country":["argentina"],"language":"spanish"},{"title":"Aston Villa dream still on as road to Europe laid out","link":"https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-transfer-unai-emery-26764330","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Jake Bayliss)"],"video_url":null,"description":"Latest Aston Villa news from BirminghamLive as Tottenham rout helps keep alive hopes of European football for Unai Emery's team after qualification route explained in wake of Man Utd reaching FA Cup final","content":"Aston Villa headlines for Monday, April 24. Villa can keep living Unai Emery dream The \"cup finals\" are coming thick and fast for Aston Villa. A 10-game winning-run may have set them on their way to Premier League promotion four years ago, but Unai Emery’s men face an even more daunting task in their bid to play European football next term. Emery’s Villa stretched their unbeaten run to nine games as they claimed an important point at Brentford on Saturday. Their recent statement victory over Newcastle proved that Villa belong in the battle for the European spots. However, they now face another six \"cup finals\" as they tussle with Tottenham, Brighton and Liverpool for position. Next up, a vital clash with Fulham on Tuesday night. Three points would see Villa leap into 5th at Tottenham's expense. The Villa Park crowd, who were in full voice against Newcastle, will know exactly what is at stake. Read the full story READ: Players all saying same thing as Villa dressing room reacts to Brentford draw READ: 'The only negative' - Villa sent Euro message after Newcastle demolition of Spurs Euro roadmap set out Aston Villa have the dream of European football in their own hands as Unai Emery’s side head towards their final six games of the season. A phenomenal run of form has seen Villa shoot up the table, from battling relegation at the start of Emery’s reign, then eyeing a top-ten finish to genuine contenders for European football. Their remaining fixtures see the club in control of their own destiny, with vital games against Manchester United, Liverpool, Tottenham Hotspur and Brighton all still to come. And with Manchester City now set to meet Manchester United in the FA Cup final at Wembley next month, we have taken a closer look at the permutations that could see Villa qualify for European football… Read the full story Villa face transfer blow Aston Villa could be set for an early summer transfer blow after it was reported that Tottenham have made the first move to sign Pedro Goncalves. According to Portuguese outlet Record, via Sportwitness , Spurs have made contact with Sporting Lisbon in order to try to beat Villa to the attacking midfielder's signature. It is said the 24-year-old has an €80m buyout clause, with the player’s former club Famalicão due half the fee. Sporting are said to want the full €80m, although are likely to negotiate. Villa were reportedly among four Premier League clubs to send scouts to watch Juventus take on Sporting Lisbon in the Europa League this week. Read the full story Luiz reacts to crucial goal Aston Villa midfielder Douglas Luiz has outlined his joy at scoring the side’s late equalising goal in the 1-1 draw against Brentford. Villa looked to be heading for a first league defeat in nine games, when they fell behind to Ivan Toney’s strike at the Gtech Community Stadium on Saturday afternoon. The striker found the net in the 65th minute, following the half time substitution of Emi Martinez due to illness. But with just three minutes left to play, Luiz stepped up to finish past David Raya and ensure that Villa took something from the game and maintain their unbeaten run. The result leaves Villa in sixth place in the table, just two points behind Tottenham, ahead of their clash against Newcastle on Sunday. Read the full story","pubDate":"2023-04-24 03:00:00","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article26456128.ece/ALTERNATES/s615/0_GettyImages-1248075881.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Football : Sitraka Andriambolanoro rêve d’intégrer les Barea A","link":"https://midi-madagasikara.mg/2023/04/24/football-sitraka-andriambolanoro-reve-dintegrer-les-barea-a/","keywords":["Sports","Barea A","Football","Madagascar","Sitraka Andriambolanoro"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"D’Antafana à Toamasina au FC Giroud de Toulouse, Sitraka Andriambolanoro Danielson joue toujours au football. Sélectionné au sein des Barea U23, il a joué avec l’équipe malgache au tournoi du DOM-TOM CUP en France. A 25 ans, du haut de ses 1m78 pour 76 kg, son rêve le plus fou est de jouer avec les […] L’article <strong>Football</strong> : <strong>Sitraka Andriambolanoro rêve d’intégrer les Barea A</strong> est apparu en premier sur Midi Madagasikara.","content":"D’Antafana à Toamasina au FC Giroud de Toulouse, Sitraka Andriambolanoro Danielson joue toujours au football. Sélectionné au sein des Barea U23, il a joué avec l’équipe malgache au tournoi du DOM-TOM CUP en France. A 25 ans, du haut de ses 1m78 pour 76 kg, son rêve le plus fou est de jouer avec les Barea A. Comme tous les joueurs de football du monde entier, son rêve est qu’un jour, il puisse intégrer la sélection nationale. « Mon rêve, c’est de devenir joueur au plus haut niveau et d’être sélectionné avec la sélection A », nous a-t-il confié. En 2021, il a été appelé avec la sélection des Barea U23 préparant les éliminatoires de la Coupe d’Afrique des Nations (CAN) U23 et les Jeux Olympiques de Paris 2024. Il n’a pas pu disputer les matchs éliminatoires en raison déjà de l’âge et de la concurrence au niveau de son poste. Sitraka, lui, a commencé à jouer au football depuis tout petit à Toamasina avec Antafana jusqu’en U13 en 2011 avant de rejoindre Olive Vert en 2012. C’est en regardant les vidéos de l’international brésilien, Ronaldinho qu’il a commencé à aimer cette discipline. Puis, en 2013, il s’est installé en France où il participé au Mondial Pupille de Plomelin avec Ajesaia. Au début, il évolue au poste d’attaquant, mais, actuellement, il est défenseur. « Depuis, les U17, je joue en tant que défenseur avec l’AS Colomier de Toulouse. Maintenant, je suis avec le FC Giroud de Toulouse et ce depuis 2020 », nous a-t-il expliqué. Il est très attaché à ses origines malgaches et ne rate aucun événement lié au football de la Grande Ile. Il participe régulièrement à la Rencontre Nationale Sportive (RNS) et cette année, à Vichy, il était avec l’équipe de l’ASGM 91. Sa formation a été éliminée en demi-finale de la compétition. En 2019 et 2022, il faisait partie des joueurs ayant disputé le tournoi DOM-TOM Cup où Madagascar est invité. « C’est une fierté de représenter son pays. J’aimais bien l’ambiance qui régnait au sein du groupe. Il y a le niveau car il y a pas mal de joueurs évoluant en national », a-t-il continué. Il a fini sa formation en animateur social et dans le cadre du football, il suit une formation d’entraîneur où il commence à s’occuper des petits. « C’est une activité bénévole, je coache les U9 et U10. Je ne compte pas faire carrière comme entraîneur, mais, juste j’aime aider les enfants et les autres, c’est la raison pour laquelle, je le fais actuellement ». Son emploi du temps est très chargé avec le travail, le football et toujours le football. « Je travaille uniquement dans la matinée du lundi au vendredi. Je prends un petit repos l’après-midi, les mardis et jeudis soir, je suis les entraînements avec mon club, les mercredis après-midi, je coach les jeunes U9 et U10 et le samedi, c’est le jour du match ». La passion du football en est très grande pour Sitraka, et malgré son emploi du temps très chargé, il ne compte pas encore lâcher les crampons d’ici là. T.H","pubDate":"2023-04-24 03:00:00","image_url":null,"source_id":"madagasikara","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"Bundesliga: Union Berlin Edge Out Borussia Monchengladbach, Bayer Leverkusen Beat RB Leipzig","link":"https://www.news18.com/football/bundesliga-union-berlin-edge-out-borussia-monchengladbach-bayer-leverkusen-beat-rb-leipzig-7621111.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Sheraldo Becker netted the solitary strike of the game for Union as the side from Berlin edged out Monchengladbach 1-0 to consolidate the third position in the league. Elsewhere, Xabi Alonso's Leverkusen earned a 2-0 win against Leipzig","content":"Sheraldo Becker scored for Union Berlin to strengthen its chances of Champions League qualification with a 1-0 win at Borussia Mönchengladbach. At the start of the campaign, Union was just targeting survival from what is only its fourth season in the Bundesliga after clinching promotion in 2019. IPL 2023: Orange Cap Complete List of Batters with Most Runs, Check here But Becker’s strike on the hour-mark Sunday was enough for the modest Köpenick-based club to consolidate third place with only five rounds remaining. “To be up there after 29 rounds and mixing at the top does not happen by accident, but then you’ve earned it,” Gladbach forward Jonas Hofmann said. Union opened a four-point gap on fifth-place Leipzig in the race for Champions League qualification. Germany’s top four qualify for Europe’s premier competition. It was a typical battling performance from Union, and one goal was enough to clinch the team’s 16th win of the season. Union defender Jerome Roussillon lobbed a cross over the Gladbach defense and Becker allowed it to drop before meeting the ball with his right boot to send it inside the left post. Union coach Urs Fischer took the exhausted Becker off with just under a quarter-hour remaining, giving the Suriname winger an affectionate hug and bringing a smile to his face with whatever he said in his ear. Union next faces in-form Bayer Leverkusen in Köpenick on Saturday. “In the Bundesliga you get absolutely no presents,” Fischer said. “We’re on a good path, but nothing is settled yet.” Leverkusen Beat Leipzig Leverkusen is reaping the benefit of Xabi Alonso’s coaching. Leverkusen showed its resilient side with a 2-0 win over direct rival Leipzig, which dropped out of the top four. Goals from Adam Hlozek and a late penalty from Nadiem Amiri secured Leverkusen’s win and stretched its unbeaten run to 13 games across all competitions. It’s been a remarkable turnaround. Leverkusen was second from bottom in the Bundesliga with just five points from the opening eight rounds when former Spain star Alonso was appointed coach in place of the fired Gerardo Seoane. Leipzig played well for long periods but found no answer to the home team’s resolute defending or ability to surge forward thanks to the speed of its attackers. Hlozek scored five minutes before the break when Robert Andrich played a perfectly weighted through ball for Moussa Diaby to race onto on the right. Diaby whipped in a cross behind Leipzig’s defenders for the incoming Hlozek to side-foot inside the left post. Hlozek was playing in place of Leverkusen star Florian Wirtz, watching from the stands after complaining of stomach problems. Timo Werner, Dominik Szoboszlai and Christopher Nkunku all went close for Leipzig, which pushed hard for an equalizer until Szoboszlai conceded the penalty in the 85th for bringing down Jeremie Frimpong. Amiri duly sealed the result from the spot. “To win like (we did) today is not easy,\" Alonso said. “We’re not used to it. But our mentality and experience helped us. I’m very proud of the team.” Leverkusen hasn’t lost a game since a 3-2 defeat at home to Mainz on Feb. 19. On Thursday it reached the Europa League semifinals with a 4-1 win at Union Saint-Gilloise. IPL 2023 Points Table : Check Team Standings, Team Points, Wins, Losses & Orange Cap , Purple Cap Earlier, Freiburg strengthened its case for Champions League qualification with a 4-0 rout of relegation-threatened Schalke. Michael Gregoritsch scored twice for the home team to move fourth. Leverkusen is six points behind Freiburg. On Saturday, Mainz defeated Bayern Munich 3-1 to give Borussia Dortmund the chance to take over as league leader. Dortmund took its chance. Read all the Latest Sports News , Check Out Orange Cap and Purple Cap holder details here","pubDate":"2023-04-24 02:47:34","image_url":"https://images.news18.com/ibnlive/uploads/2023/04/copy-of-sports-2023-04-24t081556.821-16823043743x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"FOOTBALL-OPL -Sept équipes sur huit qualifiées","link":"https://lexpress.mg/24/04/2023/football-opl-sept-equipes-sur-huit-qualifiees/","keywords":["Sport"],"creator":["Serge Rasanda"],"video_url":null,"description":"Carton plein pour la conférence Sud. Sept clubs sur huit ont validé leur ticket pour les play-offs de l’Orange Pro League. Les quatre qualifiés du Sud sont tous connus. Mama FC et Disciples FC ont arraché leur billet ce week-end lors de leur match en retard et rejoignent Elgeco Plus et Cffa, déjà qualifiés. Il […] L’article FOOTBALL-OPL -Sept équipes sur huit qualifiées est apparu en premier sur L'Express de Madagascar.","content":"Carton plein pour la conférence Sud. Sept clubs sur huit ont validé leur ticket pour les play-offs de l’Orange Pro League. Les quatre qualifiés du Sud sont tous connus. Mama FC et Disciples FC ont arraché leur billet ce week-end lors de leur match en retard et rejoignent Elgeco Plus et Cffa, déjà qualifiés. Il y a tout de même un petit chamboulement en tête du classement du groupe. A domicile, Elgeco Plus qui a défait Cffa s’installe en position de leader après sa victoire de 1 à 0 ce samedi au By-Pass. L’unique but de la victoire du club détenteur de la coupe de Madagascar a été signé Mamisoa, le Barea U23, sur un coup franc dès l’entame de la rencontre (3e). Elgeco Plus occupe ainsi la première place devant l’équipe d’Andoharanofotsy. Les deux formations sont créditées de 28 points mais Elgeco Plus a battu Cffa en rencontre directe. «Nous avons marqué précocement. Les deux équipes ont été dos à dos en première période et nous avons par la suite dominé au retour des vestiaires. Nous avons su garder notre avantage» confie l’entraineur de l’Elgeco Plus, Raux Auguste. «Nous avons raté deux occasions nettes. Les joueurs n’ont pas été dans leur meilleure forme … alors que l’objectif était de rester en tête du groupe» a mentionné pour sa part Titi Rasoanaivo, coach du Cffa. Mama FC se trouve à la troisième place avec 21 unités et Disciples FC complète le top4 (17 points). Ces deux équipes se sont neutralisées sur un score de un partout dimanche au By-Pass. Dans la conférence Nord, trois équipes ont déjà validé leur qualification à savoir Fosa Juniors FC, leader intouchable avec 34 points, suivi de Cosfa crédité de 25 points et AS Fanalamanga (21 points). À domicile, Fosa s’est imposé à Mahajanga hier sur le score de 2 buts à 0 contre les Militaires, grâce au doublé du Barea Chan, Jean Yves (58e, 65e). Deux équipes disputeront le quatrième et dernier ticket du groupe Nord en l’occurrence Ajesaia, quatrième provisoire (19 points) et qui aura encore un match à jouer et Asa Diana, classé sixième avec 12 points. Ce dernier aura de son côté, trois matches de poule.","pubDate":"2023-04-24 02:36:37","image_url":null,"source_id":"lexpress","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"FOOTBALL – JEUX DES ILES – Roro projette une détection à la Réunion","link":"https://lexpress.mg/24/04/2023/football-jeux-des-iles-roro-projette-une-detection-a-la-reunion/","keywords":["Sport"],"creator":["Serge Rasanda"],"video_url":null,"description":"Planning de préparation pour les quatre mois qui restent. Le sélectionneur des Barea en vue des jeux des Iles de l’Océan Indien, Romuald Félix Rakotondrabe alias «Roro», nommé récemment le 18 avril a remis le même jour auprès de la direction technique nationale son planning de préparation. Un regroupement d’au moins cinq jours sera prévu […] L’article FOOTBALL – JEUX DES ILES – Roro projette une détection à la Réunion est apparu en premier sur L'Express de Madagascar.","content":"Planning de préparation pour les quatre mois qui restent. Le sélectionneur des Barea en vue des jeux des Iles de l’Océan Indien, Romuald Félix Rakotondrabe alias «Roro», nommé récemment le 18 avril a remis le même jour auprès de la direction technique nationale son planning de préparation. Un regroupement d’au moins cinq jours sera prévu toutes les fin du mois jusqu’aux jeux des Iles, prévus se tenir à Madagascar du 25 aout au 3 septembre. De plus, il faut aussi jongler le rassemblement avec les play-offs ou la phase finale de l’Orange Pro League et la coupe de Madagascar. «Pour démarrer le regroupement, au lieu de fin avril, le premier rassemblement est programmé au début mai, puis fin juin et fin juillet avant le stage bloqué vers début aout» indique Roro Rakotondrabe. Le sélectionneur a demandé auprès des dirigeants de la fédération un déplacement à La Réunion pour détecter des expatriés ou binationaux qui y sont actuellement en plein championnat. Plus d’une dizaine d’expatriés évoluent à la Petite Ile. «Je veux voir de mes yeux leur forme du moment, est-ce qu’ils sont en forme physiquement et techniquement» souligne l’entraineur national. L’or dans le viseur «Je vais aussi parler avec chacun des joueurs, de notre ambition de récupérer la médaille d’or et de leur expliquer ma philosophie pour éviter d’intégrer des joueurs qui n’ont pas cette ambition là et pourront perturber la préparation à la veille des jeux» précise le sélectionneur. Mais tout dépendra également de leur disponibilité. Pour démarrer la préparation, le coach médaillé de bronze au championnat d’Afrique des nations (Chan 2023) effectuera la détection des joueurs durant les matches en retard de l’OPL puis les Play-offs. Madagascar a ravi la médaille d’or pour la dernière fois il y a vingt-ans, aux Seychelles en 1993. Trente-cinq ou quarante présélectionnés effectueront le premier regroupement. Certains seront retenus en fonction de leur forme, d’autres quitteront la présélection et d’autres rejoindront le groupe.","pubDate":"2023-04-24 02:35:59","image_url":null,"source_id":"lexpress","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"Rewa still unbeaten","link":"https://www.fijitimes.com/rewa-still-unbeaten/","keywords":["Football","Sport","Digicel Premier League","Fiji News","Fiji Times Sport","Rewa Football","Rewa still unbeaten"],"creator":["Rohit Deo"],"video_url":null,"description":"The Rewa football side has extended its unbeaten run in the Digicel Fiji Premier League competition to six matches after a come-from-behind 3-2 win against Nadi yesterday. The Delta Tigers trailed Nadi 2-1 midway through the first spell at Prince Charles Park but equalised just before the break for a 2-all scoreline at the break. […]","content":"Labasa's Akimi Ralulu, right, battles for possession against Navua's Joseph Elder during their Digicel Premier League match at the Uprising Sports Centre in Navua on Sunday, April 23, 2023. Picture: JONACANI LALAKOBAU The Rewa football side has extended its unbeaten run in the Digicel Fiji Premier League competition to six matches after a come-from-behind 3-2 win against Nadi yesterday. The Delta Tigers trailed Nadi 2-1 midway through the first spell at Prince Charles Park but equalised just before the break for a 2-all scoreline at the break. Iosefo Verevou scored the winner for the reds in the second spell. Meanwhile, Lautoka left it late to beat 10-man Suva 2-1 at the Uprising Sports Complex in Pacific harbour. Rusiate Matererega put the whites ahead early from the penalty spot when Lautoka’s Aporosa Yada handled the ball inside his penalty box. Suva defender Joeli Ranitu was given the marching orders for his second bookable offence in the first spell. Lautoka scored two goals in the last five minutes of the match through Yada and Sairusi Nalaubu to register an important win. In other matches played yesterday, Ashneel Raju scored in the second spell to hand Labasa a 1-nil win over Navua while Nadroga edged Tailevu Naitasiri 2-1. In the lone match on Saturday, Ba beat Tavua 3-2. After six matches each, Rewa leads the stadings with 16 points followed by Lautoka on 13 points. Ba has 11 points and is in third spot followed by Suva and Labasa with 10 points each. Nadi has nine points while Tailevu Naitasiri and Nadroga have six points each. Navua and Tavua have three and one point respectively and are in danger of missing out on the Fiji FACT.","pubDate":"2023-04-24 04:16:22","image_url":null,"source_id":"fijitimes","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Botched Germany trip forces Eaglets to pick Constantine for final build up","link":"https://guardian.ng/sport/botched-germany-trip-forces-eaglets-to-pick-constantine-for-final-build-up/","keywords":["Football","Sport","Africa U-17 Tourney","Constantine","Golden Eaglets"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Nigeria’s 26-man squad were scheduled to arrive the Algerian city of Constantine, yesterday, to begin their final preparations for this year’s Africa U-17 Cup of Nations. The post Botched Germany trip forces Eaglets to pick Constantine for final build up appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Nigeria’s 26-man squad were scheduled to arrive the Algerian city of Constantine, yesterday, to begin their final preparations for this year’s Africa U-17 Cup of Nations. The team was earlier scheduled to have their final build-up to the competition in Germany, but visa hitches forced the Nigeria Football Federation (NFF) to send the squad earlier than scheduled to Algeria for the final build-up. According to the NFF, the team will now start training tomorrow in Constantine, where they will also play their Group B matches against Morocco, Zambia and South Africa. Coached by Nduka Ugbade, who was Nigeria’s captain in the maiden FIFA Cadet World Cup won by the Eaglets, the current squad is expected to get to at least the semifinals, which will guarantee the country a berth at the World Cup. “We are going to Algeria with confidence, but with level heads. We’re the champions of WAFU B, but in essence, nothing has been won. What matters now is winning a ticket to the FIFA World Cup and winning the Africa Cup. I believe we have the boys to do the job,” Ugbade told thenff.com before the team left Nigeria yesterday. The players in the team are Richard Odoh (HB Football Academy), Yahaya Danjuma Lawali (Mahanaim FC), Emmanuel Michael (Simon Ben Football Academy), Haruna Abdullahi (Kurfi Tigers Academy), Tochukwu Joseph Ogboji (Purple Crown Academy), Jeremiah Oluwaseyi Olaleke (Ablaze Football Academy), Umar Abubakar (Devine Football Academy), Abubakar Idris Abdullahi (Jega United) and Precious Tonye Williams (HB Football Academy). Others are Ifeoluwa Adewale Olowoporoku (Triple 44 Academy), Charles Adah Agada (Mavlon FC), Hope Yusuf Linus (E.E. Sporting Club), Jubril Opeyemi Azeez (Right Vision Choice Academy), Anongu Isaac Aondoakaa (FC Bathel Sporting), Israel Nwachukwu Usulor (Real Sapphire FC), Temiloluwa Oluwayimika Adelakin (Box2Box Academy), Simon Karshe Cletus (Mavlon FC), Tochukwu Simeon Ogbadibo (Jossy United) and Light Chijioke Eke (C&C Football Academy). Also in the squad are Favour Oluwasegun Daniel (G12 Football Academy), Chijioke Julius Linus (Triple 44 Academy), Quadri Oluwatobiloba Adewale (Nathaniel Boys FC), Gift Ukeh Adie (Paul E Football Academy), Musa Oluwaseyi Akinfenwa (Real Sapphire FC), Usman Ajibola Owoyemi (Triple 44 Academy) and Matthew Awodi Kingsley (Brook House Academy). Follow Us","pubDate":"2023-04-24 03:18:34","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"CAF CC:Rivers United walk tight rope as YANGA win 2-0 in Uyo","link":"https://guardian.ng/sport/caf-ccrivers-united-walk-tight-rope-as-yanga-win-2-0-in-uyo/","keywords":["Football","Sport","CAF Confederation Cup","Rivers United FC","Yanga FC"],"creator":["Guardian Nigeria"],"video_url":null,"description":"In football, they say it is not over until, the final whistle, but Nigeria’s Rivers United will have to do something extraordinary in the concluding leg of their CAF Confederation Cup quarterfinal tie against Young Africans of Tanzania to make it to the semifinal of the competition. The post CAF CC:Rivers United walk tight rope as YANGA win 2-0 in Uyo appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"In football, they say it is not over until, the final whistle, but Nigeria’s Rivers United will have to do something extraordinary in the concluding leg of their CAF Confederation Cup quarterfinal tie against Young Africans of Tanzania to make it to the semifinal of the competition. Playing at home, yesterday, in Uyo, the Pride of Rivers, Nigeria’s only surviving team in African inter-club competitions, were taught lessons on marksmanship by the Tanzanians, who scored two second-half goals to inch close to the semifinals of the competition. The Tanzanian Premier League champions came into the game talking about vengeance because Rivers United beat them home and away in the same competition two years ago. Most Nigerian thought the talks were just to psyche themselves up, but they showed in their composure and movement that a lot has happened since their last meeting with the Stanley Eguma-led Rivers United. Rivers United had the best of the opportunities in the first half, but there were always signs that YANGA had surprises up their sleeves each time they ventured forward. And in the second half, there was no holding them back as they went for the kill. Fiston Mayele scored two second-half goals for YANGA, who now have a massive advantage going into next weekend’s home tie in Dar es Salaam, where they will be staring at a first-ever continental semi-final appearance. An excited YANGA Head Coach, Nasreddine Nabi, described the victory in Uyo as dream come through. “I am delighted to win, because it is not easy to come to Nigeria and win. We played well and took our chances, but the game is far from over. We still have the second leg and we need to do even better to ensure we qualify,” he said. Mayele silenced the Godswill Akpabio Stadium crowd in the 73rd minute when he was picked out by a brilliant through ball from skipper Bakari Mwamnyeto. The Congolese import ran to the pass before hitting it past the keeper first time. The second goal came through the same route, with Mwamnyeto passing back a recycled ball from a set piece to Mayele, who made no mistake with the second goal. Rivers had some chances too and their best fell on skipper Nwagua Nyima, who was put through on goal by Gideon Duru, but he could not guide the ball into the net with the keeper beaten at the back post. Although the task now before Rivers United seems almost impossible, a 3-0 win in Tanzania will take them to the semifinals. It looks difficult, but it is also achievable. Follow Us","pubDate":"2023-04-24 03:18:20","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Barea : Fabiano Costa, non disponible","link":"https://midi-madagasikara.mg/2023/04/24/barea-fabiano-costa-non-disponible/","keywords":["Sports","Barea","Fabiano Costa","Football","Madagascar"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Après l’officialisation du départ du Français, Nicolas Dupuis à la tête des Barea A, le poste est vacant. La fédération malgache de football a annoncé que son futur successeur sera connu d’ici peu de temps. Parmi les noms cités par les férus du football figurent le technicien portugais, Fabiano Costa, Eric Rabesandratana ou encore Arsène […] L’article <strong>Barea</strong> : <strong>Fabiano Costa, non disponible</strong> est apparu en premier sur Midi Madagasikara.","content":"Après l’officialisation du départ du Français, Nicolas Dupuis à la tête des Barea A, le poste est vacant. La fédération malgache de football a annoncé que son futur successeur sera connu d’ici peu de temps. Parmi les noms cités par les férus du football figurent le technicien portugais, Fabiano Costa, Eric Rabesandratana ou encore Arsène Malabary. Fabiano Costa, ancien coach-assistant des Barea du temps de Rabesandratana, est le plus plébiscité mais ne pourra pas diriger la sélection dans l’immédiat. « Pour le moment, ce ne serait pas possible d’être sélectionneur des Barea. C’était mon objectif de retravailler avec Madagascar, j’ai prévenu tout le monde bien avant mes autres propositions, que j’avais notamment d’Arabie, mais ils n’ont rien fait. Dans un avenir proche, peut-être après les élections du président de la fédération, je serais toujours disponible pour aider le football malgache « , nous a-t-il lancé. Ce technicien portugais s’est fait respecter par les joueurs des Barea. Et sa technicité et son savoir-faire étaient un plus quand il était dans le staff technique d’Eric Rabesandratana lors des qualifications pour la Coupe du monde 2022. T.H","pubDate":"2023-04-24 03:01:00","image_url":null,"source_id":"madagasikara","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"Murió Juan Carlos Sarnari, autor del primer gol de River en la Libertadores","link":"https://www.pagina12.com.ar/543023-murio-juan-carlos-sarnari-autor-del-primer-gol-de-river-en-l","keywords":null,"creator":["Página/12"],"video_url":null,"description":null,"content":"El exfutbolista Juan Carlos Sarnari, quien jugó en River y la Selección, murió a los 81 años en Colombia , según confirmaron las autoridades del club Independiente Santa Fe, donde supo ser ídolo. El \"Nene\" , un volante de gran técnica y llegada al área rival, entró en la historia de River al ser nada menos el encargado de anotar el primer gol del club en la Copa Libertadores, en la década del '60. Fue en la edición de 1966 y justamente contra Boca, con triunfo 2-1 con goles de Sarnari a los 35 minutos, Daniel Bayo a los 41 y descuento de Alfredo Rojas en el segundo tiempo para el Xeneize. Aquel River dirigido por Renato Cesarini fue subcampeón de esa Libertadores , luego de caer con Peñarol de Montevideo en la final desempate disputada en Chile. En tanto que también dejó su marca en la Selección Argentina, con la cual disputó el Mundial de Inglaterra 1966 y la Copa América del año siguiente. Fue uno de los jugadores más jóvenes en debutar con la Albiceleste, al hacerlo con 18 años en un partido ante Costa Rica (2-0) por el Panamericano de 1960. En total, sumó 6 partidos y un gol en la Selección Nacional. Sarnari nació en Firmat, provincia de Santa Fe, donde dio sus primeros pasos en el Firmat Football Club. A River llegó a los 17 años y debutó en 1959. Luego pasó a préstamo a Huracán en 1963 y volvió al Millonario al año para compartir equipo con leyendas como Amadeo Carrizo, Oscar Mas, Ermindo Onega, Daniel Ortega, Luis Cubilla y el brasileño Delem. Posteriormente, su carrera continuó en Universidad de Chile, Universidad Católica y Deportes La Serena , también en el país trasandino, y en Independiente Santa Fe .","pubDate":"2023-04-24 03:01:00","image_url":"https://images.pagina12.com.ar/styles/width960/public/2023-04/719039-fuvvfmcxsaa-lgr.jpg?itok=EFp28UuK","source_id":"pagina12","category":["sports"],"country":["argentina"],"language":"spanish"},{"title":"Aston Villa dream still on as road to Europe laid out","link":"https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-transfer-unai-emery-26764330","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Jake Bayliss)"],"video_url":null,"description":"Latest Aston Villa news from BirminghamLive as Tottenham rout helps keep alive hopes of European football for Unai Emery's team after qualification route explained in wake of Man Utd reaching FA Cup final","content":"Aston Villa headlines for Monday, April 24. Villa can keep living Unai Emery dream The \"cup finals\" are coming thick and fast for Aston Villa. A 10-game winning-run may have set them on their way to Premier League promotion four years ago, but Unai Emery’s men face an even more daunting task in their bid to play European football next term. Emery’s Villa stretched their unbeaten run to nine games as they claimed an important point at Brentford on Saturday. Their recent statement victory over Newcastle proved that Villa belong in the battle for the European spots. However, they now face another six \"cup finals\" as they tussle with Tottenham, Brighton and Liverpool for position. Next up, a vital clash with Fulham on Tuesday night. Three points would see Villa leap into 5th at Tottenham's expense. The Villa Park crowd, who were in full voice against Newcastle, will know exactly what is at stake. Read the full story READ: Players all saying same thing as Villa dressing room reacts to Brentford draw READ: 'The only negative' - Villa sent Euro message after Newcastle demolition of Spurs Euro roadmap set out Aston Villa have the dream of European football in their own hands as Unai Emery’s side head towards their final six games of the season. A phenomenal run of form has seen Villa shoot up the table, from battling relegation at the start of Emery’s reign, then eyeing a top-ten finish to genuine contenders for European football. Their remaining fixtures see the club in control of their own destiny, with vital games against Manchester United, Liverpool, Tottenham Hotspur and Brighton all still to come. And with Manchester City now set to meet Manchester United in the FA Cup final at Wembley next month, we have taken a closer look at the permutations that could see Villa qualify for European football… Read the full story Villa face transfer blow Aston Villa could be set for an early summer transfer blow after it was reported that Tottenham have made the first move to sign Pedro Goncalves. According to Portuguese outlet Record, via Sportwitness , Spurs have made contact with Sporting Lisbon in order to try to beat Villa to the attacking midfielder's signature. It is said the 24-year-old has an €80m buyout clause, with the player’s former club Famalicão due half the fee. Sporting are said to want the full €80m, although are likely to negotiate. Villa were reportedly among four Premier League clubs to send scouts to watch Juventus take on Sporting Lisbon in the Europa League this week. Read the full story Luiz reacts to crucial goal Aston Villa midfielder Douglas Luiz has outlined his joy at scoring the side’s late equalising goal in the 1-1 draw against Brentford. Villa looked to be heading for a first league defeat in nine games, when they fell behind to Ivan Toney’s strike at the Gtech Community Stadium on Saturday afternoon. The striker found the net in the 65th minute, following the half time substitution of Emi Martinez due to illness. But with just three minutes left to play, Luiz stepped up to finish past David Raya and ensure that Villa took something from the game and maintain their unbeaten run. The result leaves Villa in sixth place in the table, just two points behind Tottenham, ahead of their clash against Newcastle on Sunday. Read the full story","pubDate":"2023-04-24 03:00:00","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article26456128.ece/ALTERNATES/s615/0_GettyImages-1248075881.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Football : Sitraka Andriambolanoro rêve d’intégrer les Barea A","link":"https://midi-madagasikara.mg/2023/04/24/football-sitraka-andriambolanoro-reve-dintegrer-les-barea-a/","keywords":["Sports","Barea A","Football","Madagascar","Sitraka Andriambolanoro"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"D’Antafana à Toamasina au FC Giroud de Toulouse, Sitraka Andriambolanoro Danielson joue toujours au football. Sélectionné au sein des Barea U23, il a joué avec l’équipe malgache au tournoi du DOM-TOM CUP en France. A 25 ans, du haut de ses 1m78 pour 76 kg, son rêve le plus fou est de jouer avec les […] L’article <strong>Football</strong> : <strong>Sitraka Andriambolanoro rêve d’intégrer les Barea A</strong> est apparu en premier sur Midi Madagasikara.","content":"D’Antafana à Toamasina au FC Giroud de Toulouse, Sitraka Andriambolanoro Danielson joue toujours au football. Sélectionné au sein des Barea U23, il a joué avec l’équipe malgache au tournoi du DOM-TOM CUP en France. A 25 ans, du haut de ses 1m78 pour 76 kg, son rêve le plus fou est de jouer avec les Barea A. Comme tous les joueurs de football du monde entier, son rêve est qu’un jour, il puisse intégrer la sélection nationale. « Mon rêve, c’est de devenir joueur au plus haut niveau et d’être sélectionné avec la sélection A », nous a-t-il confié. En 2021, il a été appelé avec la sélection des Barea U23 préparant les éliminatoires de la Coupe d’Afrique des Nations (CAN) U23 et les Jeux Olympiques de Paris 2024. Il n’a pas pu disputer les matchs éliminatoires en raison déjà de l’âge et de la concurrence au niveau de son poste. Sitraka, lui, a commencé à jouer au football depuis tout petit à Toamasina avec Antafana jusqu’en U13 en 2011 avant de rejoindre Olive Vert en 2012. C’est en regardant les vidéos de l’international brésilien, Ronaldinho qu’il a commencé à aimer cette discipline. Puis, en 2013, il s’est installé en France où il participé au Mondial Pupille de Plomelin avec Ajesaia. Au début, il évolue au poste d’attaquant, mais, actuellement, il est défenseur. « Depuis, les U17, je joue en tant que défenseur avec l’AS Colomier de Toulouse. Maintenant, je suis avec le FC Giroud de Toulouse et ce depuis 2020 », nous a-t-il expliqué. Il est très attaché à ses origines malgaches et ne rate aucun événement lié au football de la Grande Ile. Il participe régulièrement à la Rencontre Nationale Sportive (RNS) et cette année, à Vichy, il était avec l’équipe de l’ASGM 91. Sa formation a été éliminée en demi-finale de la compétition. En 2019 et 2022, il faisait partie des joueurs ayant disputé le tournoi DOM-TOM Cup où Madagascar est invité. « C’est une fierté de représenter son pays. J’aimais bien l’ambiance qui régnait au sein du groupe. Il y a le niveau car il y a pas mal de joueurs évoluant en national », a-t-il continué. Il a fini sa formation en animateur social et dans le cadre du football, il suit une formation d’entraîneur où il commence à s’occuper des petits. « C’est une activité bénévole, je coache les U9 et U10. Je ne compte pas faire carrière comme entraîneur, mais, juste j’aime aider les enfants et les autres, c’est la raison pour laquelle, je le fais actuellement ». Son emploi du temps est très chargé avec le travail, le football et toujours le football. « Je travaille uniquement dans la matinée du lundi au vendredi. Je prends un petit repos l’après-midi, les mardis et jeudis soir, je suis les entraînements avec mon club, les mercredis après-midi, je coach les jeunes U9 et U10 et le samedi, c’est le jour du match ». La passion du football en est très grande pour Sitraka, et malgré son emploi du temps très chargé, il ne compte pas encore lâcher les crampons d’ici là. T.H","pubDate":"2023-04-24 03:00:00","image_url":null,"source_id":"madagasikara","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"Bundesliga: Union Berlin Edge Out Borussia Monchengladbach, Bayer Leverkusen Beat RB Leipzig","link":"https://www.news18.com/football/bundesliga-union-berlin-edge-out-borussia-monchengladbach-bayer-leverkusen-beat-rb-leipzig-7621111.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Sheraldo Becker netted the solitary strike of the game for Union as the side from Berlin edged out Monchengladbach 1-0 to consolidate the third position in the league. Elsewhere, Xabi Alonso's Leverkusen earned a 2-0 win against Leipzig","content":"Sheraldo Becker scored for Union Berlin to strengthen its chances of Champions League qualification with a 1-0 win at Borussia Mönchengladbach. At the start of the campaign, Union was just targeting survival from what is only its fourth season in the Bundesliga after clinching promotion in 2019. IPL 2023: Orange Cap Complete List of Batters with Most Runs, Check here But Becker’s strike on the hour-mark Sunday was enough for the modest Köpenick-based club to consolidate third place with only five rounds remaining. “To be up there after 29 rounds and mixing at the top does not happen by accident, but then you’ve earned it,” Gladbach forward Jonas Hofmann said. Union opened a four-point gap on fifth-place Leipzig in the race for Champions League qualification. Germany’s top four qualify for Europe’s premier competition. It was a typical battling performance from Union, and one goal was enough to clinch the team’s 16th win of the season. Union defender Jerome Roussillon lobbed a cross over the Gladbach defense and Becker allowed it to drop before meeting the ball with his right boot to send it inside the left post. Union coach Urs Fischer took the exhausted Becker off with just under a quarter-hour remaining, giving the Suriname winger an affectionate hug and bringing a smile to his face with whatever he said in his ear. Union next faces in-form Bayer Leverkusen in Köpenick on Saturday. “In the Bundesliga you get absolutely no presents,” Fischer said. “We’re on a good path, but nothing is settled yet.” Leverkusen Beat Leipzig Leverkusen is reaping the benefit of Xabi Alonso’s coaching. Leverkusen showed its resilient side with a 2-0 win over direct rival Leipzig, which dropped out of the top four. Goals from Adam Hlozek and a late penalty from Nadiem Amiri secured Leverkusen’s win and stretched its unbeaten run to 13 games across all competitions. It’s been a remarkable turnaround. Leverkusen was second from bottom in the Bundesliga with just five points from the opening eight rounds when former Spain star Alonso was appointed coach in place of the fired Gerardo Seoane. Leipzig played well for long periods but found no answer to the home team’s resolute defending or ability to surge forward thanks to the speed of its attackers. Hlozek scored five minutes before the break when Robert Andrich played a perfectly weighted through ball for Moussa Diaby to race onto on the right. Diaby whipped in a cross behind Leipzig’s defenders for the incoming Hlozek to side-foot inside the left post. Hlozek was playing in place of Leverkusen star Florian Wirtz, watching from the stands after complaining of stomach problems. Timo Werner, Dominik Szoboszlai and Christopher Nkunku all went close for Leipzig, which pushed hard for an equalizer until Szoboszlai conceded the penalty in the 85th for bringing down Jeremie Frimpong. Amiri duly sealed the result from the spot. “To win like (we did) today is not easy,\" Alonso said. “We’re not used to it. But our mentality and experience helped us. I’m very proud of the team.” Leverkusen hasn’t lost a game since a 3-2 defeat at home to Mainz on Feb. 19. On Thursday it reached the Europa League semifinals with a 4-1 win at Union Saint-Gilloise. IPL 2023 Points Table : Check Team Standings, Team Points, Wins, Losses & Orange Cap , Purple Cap Earlier, Freiburg strengthened its case for Champions League qualification with a 4-0 rout of relegation-threatened Schalke. Michael Gregoritsch scored twice for the home team to move fourth. Leverkusen is six points behind Freiburg. On Saturday, Mainz defeated Bayern Munich 3-1 to give Borussia Dortmund the chance to take over as league leader. Dortmund took its chance. Read all the Latest Sports News , Check Out Orange Cap and Purple Cap holder details here","pubDate":"2023-04-24 02:47:34","image_url":"https://images.news18.com/ibnlive/uploads/2023/04/copy-of-sports-2023-04-24t081556.821-16823043743x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"FOOTBALL-OPL -Sept équipes sur huit qualifiées","link":"https://lexpress.mg/24/04/2023/football-opl-sept-equipes-sur-huit-qualifiees/","keywords":["Sport"],"creator":["Serge Rasanda"],"video_url":null,"description":"Carton plein pour la conférence Sud. Sept clubs sur huit ont validé leur ticket pour les play-offs de l’Orange Pro League. Les quatre qualifiés du Sud sont tous connus. Mama FC et Disciples FC ont arraché leur billet ce week-end lors de leur match en retard et rejoignent Elgeco Plus et Cffa, déjà qualifiés. Il […] L’article FOOTBALL-OPL -Sept équipes sur huit qualifiées est apparu en premier sur L'Express de Madagascar.","content":"Carton plein pour la conférence Sud. Sept clubs sur huit ont validé leur ticket pour les play-offs de l’Orange Pro League. Les quatre qualifiés du Sud sont tous connus. Mama FC et Disciples FC ont arraché leur billet ce week-end lors de leur match en retard et rejoignent Elgeco Plus et Cffa, déjà qualifiés. Il y a tout de même un petit chamboulement en tête du classement du groupe. A domicile, Elgeco Plus qui a défait Cffa s’installe en position de leader après sa victoire de 1 à 0 ce samedi au By-Pass. L’unique but de la victoire du club détenteur de la coupe de Madagascar a été signé Mamisoa, le Barea U23, sur un coup franc dès l’entame de la rencontre (3e). Elgeco Plus occupe ainsi la première place devant l’équipe d’Andoharanofotsy. Les deux formations sont créditées de 28 points mais Elgeco Plus a battu Cffa en rencontre directe. «Nous avons marqué précocement. Les deux équipes ont été dos à dos en première période et nous avons par la suite dominé au retour des vestiaires. Nous avons su garder notre avantage» confie l’entraineur de l’Elgeco Plus, Raux Auguste. «Nous avons raté deux occasions nettes. Les joueurs n’ont pas été dans leur meilleure forme … alors que l’objectif était de rester en tête du groupe» a mentionné pour sa part Titi Rasoanaivo, coach du Cffa. Mama FC se trouve à la troisième place avec 21 unités et Disciples FC complète le top4 (17 points). Ces deux équipes se sont neutralisées sur un score de un partout dimanche au By-Pass. Dans la conférence Nord, trois équipes ont déjà validé leur qualification à savoir Fosa Juniors FC, leader intouchable avec 34 points, suivi de Cosfa crédité de 25 points et AS Fanalamanga (21 points). À domicile, Fosa s’est imposé à Mahajanga hier sur le score de 2 buts à 0 contre les Militaires, grâce au doublé du Barea Chan, Jean Yves (58e, 65e). Deux équipes disputeront le quatrième et dernier ticket du groupe Nord en l’occurrence Ajesaia, quatrième provisoire (19 points) et qui aura encore un match à jouer et Asa Diana, classé sixième avec 12 points. Ce dernier aura de son côté, trois matches de poule.","pubDate":"2023-04-24 02:36:37","image_url":null,"source_id":"lexpress","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"FOOTBALL – JEUX DES ILES – Roro projette une détection à la Réunion","link":"https://lexpress.mg/24/04/2023/football-jeux-des-iles-roro-projette-une-detection-a-la-reunion/","keywords":["Sport"],"creator":["Serge Rasanda"],"video_url":null,"description":"Planning de préparation pour les quatre mois qui restent. Le sélectionneur des Barea en vue des jeux des Iles de l’Océan Indien, Romuald Félix Rakotondrabe alias «Roro», nommé récemment le 18 avril a remis le même jour auprès de la direction technique nationale son planning de préparation. Un regroupement d’au moins cinq jours sera prévu […] L’article FOOTBALL – JEUX DES ILES – Roro projette une détection à la Réunion est apparu en premier sur L'Express de Madagascar.","content":"Planning de préparation pour les quatre mois qui restent. Le sélectionneur des Barea en vue des jeux des Iles de l’Océan Indien, Romuald Félix Rakotondrabe alias «Roro», nommé récemment le 18 avril a remis le même jour auprès de la direction technique nationale son planning de préparation. Un regroupement d’au moins cinq jours sera prévu toutes les fin du mois jusqu’aux jeux des Iles, prévus se tenir à Madagascar du 25 aout au 3 septembre. De plus, il faut aussi jongler le rassemblement avec les play-offs ou la phase finale de l’Orange Pro League et la coupe de Madagascar. «Pour démarrer le regroupement, au lieu de fin avril, le premier rassemblement est programmé au début mai, puis fin juin et fin juillet avant le stage bloqué vers début aout» indique Roro Rakotondrabe. Le sélectionneur a demandé auprès des dirigeants de la fédération un déplacement à La Réunion pour détecter des expatriés ou binationaux qui y sont actuellement en plein championnat. Plus d’une dizaine d’expatriés évoluent à la Petite Ile. «Je veux voir de mes yeux leur forme du moment, est-ce qu’ils sont en forme physiquement et techniquement» souligne l’entraineur national. L’or dans le viseur «Je vais aussi parler avec chacun des joueurs, de notre ambition de récupérer la médaille d’or et de leur expliquer ma philosophie pour éviter d’intégrer des joueurs qui n’ont pas cette ambition là et pourront perturber la préparation à la veille des jeux» précise le sélectionneur. Mais tout dépendra également de leur disponibilité. Pour démarrer la préparation, le coach médaillé de bronze au championnat d’Afrique des nations (Chan 2023) effectuera la détection des joueurs durant les matches en retard de l’OPL puis les Play-offs. Madagascar a ravi la médaille d’or pour la dernière fois il y a vingt-ans, aux Seychelles en 1993. Trente-cinq ou quarante présélectionnés effectueront le premier regroupement. Certains seront retenus en fonction de leur forme, d’autres quitteront la présélection et d’autres rejoindront le groupe.","pubDate":"2023-04-24 02:35:59","image_url":null,"source_id":"lexpress","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"Rewa still unbeaten","link":"https://www.fijitimes.com/rewa-still-unbeaten/","keywords":["Football","Sport","Digicel Premier League","Fiji News","Fiji Times Sport","Rewa Football","Rewa still unbeaten"],"creator":["Rohit Deo"],"video_url":null,"description":"The Rewa football side has extended its unbeaten run in the Digicel Fiji Premier League competition to six matches after a come-from-behind 3-2 win against Nadi yesterday. The Delta Tigers trailed Nadi 2-1 midway through the first spell at Prince Charles Park but equalised just before the break for a 2-all scoreline at the break. […]","content":"Labasa's Akimi Ralulu, right, battles for possession against Navua's Joseph Elder during their Digicel Premier League match at the Uprising Sports Centre in Navua on Sunday, April 23, 2023. Picture: JONACANI LALAKOBAU The Rewa football side has extended its unbeaten run in the Digicel Fiji Premier League competition to six matches after a come-from-behind 3-2 win against Nadi yesterday. The Delta Tigers trailed Nadi 2-1 midway through the first spell at Prince Charles Park but equalised just before the break for a 2-all scoreline at the break. Iosefo Verevou scored the winner for the reds in the second spell. Meanwhile, Lautoka left it late to beat 10-man Suva 2-1 at the Uprising Sports Complex in Pacific harbour. Rusiate Matererega put the whites ahead early from the penalty spot when Lautoka’s Aporosa Yada handled the ball inside his penalty box. Suva defender Joeli Ranitu was given the marching orders for his second bookable offence in the first spell. Lautoka scored two goals in the last five minutes of the match through Yada and Sairusi Nalaubu to register an important win. In other matches played yesterday, Ashneel Raju scored in the second spell to hand Labasa a 1-nil win over Navua while Nadroga edged Tailevu Naitasiri 2-1. In the lone match on Saturday, Ba beat Tavua 3-2. After six matches each, Rewa leads the stadings with 16 points followed by Lautoka on 13 points. Ba has 11 points and is in third spot followed by Suva and Labasa with 10 points each. Nadi has nine points while Tailevu Naitasiri and Nadroga have six points each. Navua and Tavua have three and one point respectively and are in danger of missing out on the Fiji FACT.","pubDate":"2023-04-24 04:16:22","image_url":null,"source_id":"fijitimes","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Botched Germany trip forces Eaglets to pick Constantine for final build up","link":"https://guardian.ng/sport/botched-germany-trip-forces-eaglets-to-pick-constantine-for-final-build-up/","keywords":["Football","Sport","Africa U-17 Tourney","Constantine","Golden Eaglets"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Nigeria’s 26-man squad were scheduled to arrive the Algerian city of Constantine, yesterday, to begin their final preparations for this year’s Africa U-17 Cup of Nations. The post Botched Germany trip forces Eaglets to pick Constantine for final build up appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Nigeria’s 26-man squad were scheduled to arrive the Algerian city of Constantine, yesterday, to begin their final preparations for this year’s Africa U-17 Cup of Nations. The team was earlier scheduled to have their final build-up to the competition in Germany, but visa hitches forced the Nigeria Football Federation (NFF) to send the squad earlier than scheduled to Algeria for the final build-up. According to the NFF, the team will now start training tomorrow in Constantine, where they will also play their Group B matches against Morocco, Zambia and South Africa. Coached by Nduka Ugbade, who was Nigeria’s captain in the maiden FIFA Cadet World Cup won by the Eaglets, the current squad is expected to get to at least the semifinals, which will guarantee the country a berth at the World Cup. “We are going to Algeria with confidence, but with level heads. We’re the champions of WAFU B, but in essence, nothing has been won. What matters now is winning a ticket to the FIFA World Cup and winning the Africa Cup. I believe we have the boys to do the job,” Ugbade told thenff.com before the team left Nigeria yesterday. The players in the team are Richard Odoh (HB Football Academy), Yahaya Danjuma Lawali (Mahanaim FC), Emmanuel Michael (Simon Ben Football Academy), Haruna Abdullahi (Kurfi Tigers Academy), Tochukwu Joseph Ogboji (Purple Crown Academy), Jeremiah Oluwaseyi Olaleke (Ablaze Football Academy), Umar Abubakar (Devine Football Academy), Abubakar Idris Abdullahi (Jega United) and Precious Tonye Williams (HB Football Academy). Others are Ifeoluwa Adewale Olowoporoku (Triple 44 Academy), Charles Adah Agada (Mavlon FC), Hope Yusuf Linus (E.E. Sporting Club), Jubril Opeyemi Azeez (Right Vision Choice Academy), Anongu Isaac Aondoakaa (FC Bathel Sporting), Israel Nwachukwu Usulor (Real Sapphire FC), Temiloluwa Oluwayimika Adelakin (Box2Box Academy), Simon Karshe Cletus (Mavlon FC), Tochukwu Simeon Ogbadibo (Jossy United) and Light Chijioke Eke (C&C Football Academy). Also in the squad are Favour Oluwasegun Daniel (G12 Football Academy), Chijioke Julius Linus (Triple 44 Academy), Quadri Oluwatobiloba Adewale (Nathaniel Boys FC), Gift Ukeh Adie (Paul E Football Academy), Musa Oluwaseyi Akinfenwa (Real Sapphire FC), Usman Ajibola Owoyemi (Triple 44 Academy) and Matthew Awodi Kingsley (Brook House Academy). Follow Us","pubDate":"2023-04-24 03:18:34","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"CAF CC:Rivers United walk tight rope as YANGA win 2-0 in Uyo","link":"https://guardian.ng/sport/caf-ccrivers-united-walk-tight-rope-as-yanga-win-2-0-in-uyo/","keywords":["Football","Sport","CAF Confederation Cup","Rivers United FC","Yanga FC"],"creator":["Guardian Nigeria"],"video_url":null,"description":"In football, they say it is not over until, the final whistle, but Nigeria’s Rivers United will have to do something extraordinary in the concluding leg of their CAF Confederation Cup quarterfinal tie against Young Africans of Tanzania to make it to the semifinal of the competition. The post CAF CC:Rivers United walk tight rope as YANGA win 2-0 in Uyo appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"In football, they say it is not over until, the final whistle, but Nigeria’s Rivers United will have to do something extraordinary in the concluding leg of their CAF Confederation Cup quarterfinal tie against Young Africans of Tanzania to make it to the semifinal of the competition. Playing at home, yesterday, in Uyo, the Pride of Rivers, Nigeria’s only surviving team in African inter-club competitions, were taught lessons on marksmanship by the Tanzanians, who scored two second-half goals to inch close to the semifinals of the competition. The Tanzanian Premier League champions came into the game talking about vengeance because Rivers United beat them home and away in the same competition two years ago. Most Nigerian thought the talks were just to psyche themselves up, but they showed in their composure and movement that a lot has happened since their last meeting with the Stanley Eguma-led Rivers United. Rivers United had the best of the opportunities in the first half, but there were always signs that YANGA had surprises up their sleeves each time they ventured forward. And in the second half, there was no holding them back as they went for the kill. Fiston Mayele scored two second-half goals for YANGA, who now have a massive advantage going into next weekend’s home tie in Dar es Salaam, where they will be staring at a first-ever continental semi-final appearance. An excited YANGA Head Coach, Nasreddine Nabi, described the victory in Uyo as dream come through. “I am delighted to win, because it is not easy to come to Nigeria and win. We played well and took our chances, but the game is far from over. We still have the second leg and we need to do even better to ensure we qualify,” he said. Mayele silenced the Godswill Akpabio Stadium crowd in the 73rd minute when he was picked out by a brilliant through ball from skipper Bakari Mwamnyeto. The Congolese import ran to the pass before hitting it past the keeper first time. The second goal came through the same route, with Mwamnyeto passing back a recycled ball from a set piece to Mayele, who made no mistake with the second goal. Rivers had some chances too and their best fell on skipper Nwagua Nyima, who was put through on goal by Gideon Duru, but he could not guide the ball into the net with the keeper beaten at the back post. Although the task now before Rivers United seems almost impossible, a 3-0 win in Tanzania will take them to the semifinals. It looks difficult, but it is also achievable. Follow Us","pubDate":"2023-04-24 03:18:20","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Barea : Fabiano Costa, non disponible","link":"https://midi-madagasikara.mg/2023/04/24/barea-fabiano-costa-non-disponible/","keywords":["Sports","Barea","Fabiano Costa","Football","Madagascar"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Après l’officialisation du départ du Français, Nicolas Dupuis à la tête des Barea A, le poste est vacant. La fédération malgache de football a annoncé que son futur successeur sera connu d’ici peu de temps. Parmi les noms cités par les férus du football figurent le technicien portugais, Fabiano Costa, Eric Rabesandratana ou encore Arsène […] L’article <strong>Barea</strong> : <strong>Fabiano Costa, non disponible</strong> est apparu en premier sur Midi Madagasikara.","content":"Après l’officialisation du départ du Français, Nicolas Dupuis à la tête des Barea A, le poste est vacant. La fédération malgache de football a annoncé que son futur successeur sera connu d’ici peu de temps. Parmi les noms cités par les férus du football figurent le technicien portugais, Fabiano Costa, Eric Rabesandratana ou encore Arsène Malabary. Fabiano Costa, ancien coach-assistant des Barea du temps de Rabesandratana, est le plus plébiscité mais ne pourra pas diriger la sélection dans l’immédiat. « Pour le moment, ce ne serait pas possible d’être sélectionneur des Barea. C’était mon objectif de retravailler avec Madagascar, j’ai prévenu tout le monde bien avant mes autres propositions, que j’avais notamment d’Arabie, mais ils n’ont rien fait. Dans un avenir proche, peut-être après les élections du président de la fédération, je serais toujours disponible pour aider le football malgache « , nous a-t-il lancé. Ce technicien portugais s’est fait respecter par les joueurs des Barea. Et sa technicité et son savoir-faire étaient un plus quand il était dans le staff technique d’Eric Rabesandratana lors des qualifications pour la Coupe du monde 2022. T.H","pubDate":"2023-04-24 03:01:00","image_url":null,"source_id":"madagasikara","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"Murió Juan Carlos Sarnari, autor del primer gol de River en la Libertadores","link":"https://www.pagina12.com.ar/543023-murio-juan-carlos-sarnari-autor-del-primer-gol-de-river-en-l","keywords":null,"creator":["Página/12"],"video_url":null,"description":null,"content":"El exfutbolista Juan Carlos Sarnari, quien jugó en River y la Selección, murió a los 81 años en Colombia , según confirmaron las autoridades del club Independiente Santa Fe, donde supo ser ídolo. El \"Nene\" , un volante de gran técnica y llegada al área rival, entró en la historia de River al ser nada menos el encargado de anotar el primer gol del club en la Copa Libertadores, en la década del '60. Fue en la edición de 1966 y justamente contra Boca, con triunfo 2-1 con goles de Sarnari a los 35 minutos, Daniel Bayo a los 41 y descuento de Alfredo Rojas en el segundo tiempo para el Xeneize. Aquel River dirigido por Renato Cesarini fue subcampeón de esa Libertadores , luego de caer con Peñarol de Montevideo en la final desempate disputada en Chile. En tanto que también dejó su marca en la Selección Argentina, con la cual disputó el Mundial de Inglaterra 1966 y la Copa América del año siguiente. Fue uno de los jugadores más jóvenes en debutar con la Albiceleste, al hacerlo con 18 años en un partido ante Costa Rica (2-0) por el Panamericano de 1960. En total, sumó 6 partidos y un gol en la Selección Nacional. Sarnari nació en Firmat, provincia de Santa Fe, donde dio sus primeros pasos en el Firmat Football Club. A River llegó a los 17 años y debutó en 1959. Luego pasó a préstamo a Huracán en 1963 y volvió al Millonario al año para compartir equipo con leyendas como Amadeo Carrizo, Oscar Mas, Ermindo Onega, Daniel Ortega, Luis Cubilla y el brasileño Delem. Posteriormente, su carrera continuó en Universidad de Chile, Universidad Católica y Deportes La Serena , también en el país trasandino, y en Independiente Santa Fe .","pubDate":"2023-04-24 03:01:00","image_url":"https://images.pagina12.com.ar/styles/width960/public/2023-04/719039-fuvvfmcxsaa-lgr.jpg?itok=EFp28UuK","source_id":"pagina12","category":["sports"],"country":["argentina"],"language":"spanish"},{"title":"Aston Villa dream still on as road to Europe laid out","link":"https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-transfer-unai-emery-26764330","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Jake Bayliss)"],"video_url":null,"description":"Latest Aston Villa news from BirminghamLive as Tottenham rout helps keep alive hopes of European football for Unai Emery's team after qualification route explained in wake of Man Utd reaching FA Cup final","content":"Aston Villa headlines for Monday, April 24. Villa can keep living Unai Emery dream The \"cup finals\" are coming thick and fast for Aston Villa. A 10-game winning-run may have set them on their way to Premier League promotion four years ago, but Unai Emery’s men face an even more daunting task in their bid to play European football next term. Emery’s Villa stretched their unbeaten run to nine games as they claimed an important point at Brentford on Saturday. Their recent statement victory over Newcastle proved that Villa belong in the battle for the European spots. However, they now face another six \"cup finals\" as they tussle with Tottenham, Brighton and Liverpool for position. Next up, a vital clash with Fulham on Tuesday night. Three points would see Villa leap into 5th at Tottenham's expense. The Villa Park crowd, who were in full voice against Newcastle, will know exactly what is at stake. Read the full story READ: Players all saying same thing as Villa dressing room reacts to Brentford draw READ: 'The only negative' - Villa sent Euro message after Newcastle demolition of Spurs Euro roadmap set out Aston Villa have the dream of European football in their own hands as Unai Emery’s side head towards their final six games of the season. A phenomenal run of form has seen Villa shoot up the table, from battling relegation at the start of Emery’s reign, then eyeing a top-ten finish to genuine contenders for European football. Their remaining fixtures see the club in control of their own destiny, with vital games against Manchester United, Liverpool, Tottenham Hotspur and Brighton all still to come. And with Manchester City now set to meet Manchester United in the FA Cup final at Wembley next month, we have taken a closer look at the permutations that could see Villa qualify for European football… Read the full story Villa face transfer blow Aston Villa could be set for an early summer transfer blow after it was reported that Tottenham have made the first move to sign Pedro Goncalves. According to Portuguese outlet Record, via Sportwitness , Spurs have made contact with Sporting Lisbon in order to try to beat Villa to the attacking midfielder's signature. It is said the 24-year-old has an €80m buyout clause, with the player’s former club Famalicão due half the fee. Sporting are said to want the full €80m, although are likely to negotiate. Villa were reportedly among four Premier League clubs to send scouts to watch Juventus take on Sporting Lisbon in the Europa League this week. Read the full story Luiz reacts to crucial goal Aston Villa midfielder Douglas Luiz has outlined his joy at scoring the side’s late equalising goal in the 1-1 draw against Brentford. Villa looked to be heading for a first league defeat in nine games, when they fell behind to Ivan Toney’s strike at the Gtech Community Stadium on Saturday afternoon. The striker found the net in the 65th minute, following the half time substitution of Emi Martinez due to illness. But with just three minutes left to play, Luiz stepped up to finish past David Raya and ensure that Villa took something from the game and maintain their unbeaten run. The result leaves Villa in sixth place in the table, just two points behind Tottenham, ahead of their clash against Newcastle on Sunday. Read the full story","pubDate":"2023-04-24 03:00:00","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article26456128.ece/ALTERNATES/s615/0_GettyImages-1248075881.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Football : Sitraka Andriambolanoro rêve d’intégrer les Barea A","link":"https://midi-madagasikara.mg/2023/04/24/football-sitraka-andriambolanoro-reve-dintegrer-les-barea-a/","keywords":["Sports","Barea A","Football","Madagascar","Sitraka Andriambolanoro"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"D’Antafana à Toamasina au FC Giroud de Toulouse, Sitraka Andriambolanoro Danielson joue toujours au football. Sélectionné au sein des Barea U23, il a joué avec l’équipe malgache au tournoi du DOM-TOM CUP en France. A 25 ans, du haut de ses 1m78 pour 76 kg, son rêve le plus fou est de jouer avec les […] L’article <strong>Football</strong> : <strong>Sitraka Andriambolanoro rêve d’intégrer les Barea A</strong> est apparu en premier sur Midi Madagasikara.","content":"D’Antafana à Toamasina au FC Giroud de Toulouse, Sitraka Andriambolanoro Danielson joue toujours au football. Sélectionné au sein des Barea U23, il a joué avec l’équipe malgache au tournoi du DOM-TOM CUP en France. A 25 ans, du haut de ses 1m78 pour 76 kg, son rêve le plus fou est de jouer avec les Barea A. Comme tous les joueurs de football du monde entier, son rêve est qu’un jour, il puisse intégrer la sélection nationale. « Mon rêve, c’est de devenir joueur au plus haut niveau et d’être sélectionné avec la sélection A », nous a-t-il confié. En 2021, il a été appelé avec la sélection des Barea U23 préparant les éliminatoires de la Coupe d’Afrique des Nations (CAN) U23 et les Jeux Olympiques de Paris 2024. Il n’a pas pu disputer les matchs éliminatoires en raison déjà de l’âge et de la concurrence au niveau de son poste. Sitraka, lui, a commencé à jouer au football depuis tout petit à Toamasina avec Antafana jusqu’en U13 en 2011 avant de rejoindre Olive Vert en 2012. C’est en regardant les vidéos de l’international brésilien, Ronaldinho qu’il a commencé à aimer cette discipline. Puis, en 2013, il s’est installé en France où il participé au Mondial Pupille de Plomelin avec Ajesaia. Au début, il évolue au poste d’attaquant, mais, actuellement, il est défenseur. « Depuis, les U17, je joue en tant que défenseur avec l’AS Colomier de Toulouse. Maintenant, je suis avec le FC Giroud de Toulouse et ce depuis 2020 », nous a-t-il expliqué. Il est très attaché à ses origines malgaches et ne rate aucun événement lié au football de la Grande Ile. Il participe régulièrement à la Rencontre Nationale Sportive (RNS) et cette année, à Vichy, il était avec l’équipe de l’ASGM 91. Sa formation a été éliminée en demi-finale de la compétition. En 2019 et 2022, il faisait partie des joueurs ayant disputé le tournoi DOM-TOM Cup où Madagascar est invité. « C’est une fierté de représenter son pays. J’aimais bien l’ambiance qui régnait au sein du groupe. Il y a le niveau car il y a pas mal de joueurs évoluant en national », a-t-il continué. Il a fini sa formation en animateur social et dans le cadre du football, il suit une formation d’entraîneur où il commence à s’occuper des petits. « C’est une activité bénévole, je coache les U9 et U10. Je ne compte pas faire carrière comme entraîneur, mais, juste j’aime aider les enfants et les autres, c’est la raison pour laquelle, je le fais actuellement ». Son emploi du temps est très chargé avec le travail, le football et toujours le football. « Je travaille uniquement dans la matinée du lundi au vendredi. Je prends un petit repos l’après-midi, les mardis et jeudis soir, je suis les entraînements avec mon club, les mercredis après-midi, je coach les jeunes U9 et U10 et le samedi, c’est le jour du match ». La passion du football en est très grande pour Sitraka, et malgré son emploi du temps très chargé, il ne compte pas encore lâcher les crampons d’ici là. T.H","pubDate":"2023-04-24 03:00:00","image_url":null,"source_id":"madagasikara","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"Bundesliga: Union Berlin Edge Out Borussia Monchengladbach, Bayer Leverkusen Beat RB Leipzig","link":"https://www.news18.com/football/bundesliga-union-berlin-edge-out-borussia-monchengladbach-bayer-leverkusen-beat-rb-leipzig-7621111.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Sheraldo Becker netted the solitary strike of the game for Union as the side from Berlin edged out Monchengladbach 1-0 to consolidate the third position in the league. Elsewhere, Xabi Alonso's Leverkusen earned a 2-0 win against Leipzig","content":"Sheraldo Becker scored for Union Berlin to strengthen its chances of Champions League qualification with a 1-0 win at Borussia Mönchengladbach. At the start of the campaign, Union was just targeting survival from what is only its fourth season in the Bundesliga after clinching promotion in 2019. IPL 2023: Orange Cap Complete List of Batters with Most Runs, Check here But Becker’s strike on the hour-mark Sunday was enough for the modest Köpenick-based club to consolidate third place with only five rounds remaining. “To be up there after 29 rounds and mixing at the top does not happen by accident, but then you’ve earned it,” Gladbach forward Jonas Hofmann said. Union opened a four-point gap on fifth-place Leipzig in the race for Champions League qualification. Germany’s top four qualify for Europe’s premier competition. It was a typical battling performance from Union, and one goal was enough to clinch the team’s 16th win of the season. Union defender Jerome Roussillon lobbed a cross over the Gladbach defense and Becker allowed it to drop before meeting the ball with his right boot to send it inside the left post. Union coach Urs Fischer took the exhausted Becker off with just under a quarter-hour remaining, giving the Suriname winger an affectionate hug and bringing a smile to his face with whatever he said in his ear. Union next faces in-form Bayer Leverkusen in Köpenick on Saturday. “In the Bundesliga you get absolutely no presents,” Fischer said. “We’re on a good path, but nothing is settled yet.” Leverkusen Beat Leipzig Leverkusen is reaping the benefit of Xabi Alonso’s coaching. Leverkusen showed its resilient side with a 2-0 win over direct rival Leipzig, which dropped out of the top four. Goals from Adam Hlozek and a late penalty from Nadiem Amiri secured Leverkusen’s win and stretched its unbeaten run to 13 games across all competitions. It’s been a remarkable turnaround. Leverkusen was second from bottom in the Bundesliga with just five points from the opening eight rounds when former Spain star Alonso was appointed coach in place of the fired Gerardo Seoane. Leipzig played well for long periods but found no answer to the home team’s resolute defending or ability to surge forward thanks to the speed of its attackers. Hlozek scored five minutes before the break when Robert Andrich played a perfectly weighted through ball for Moussa Diaby to race onto on the right. Diaby whipped in a cross behind Leipzig’s defenders for the incoming Hlozek to side-foot inside the left post. Hlozek was playing in place of Leverkusen star Florian Wirtz, watching from the stands after complaining of stomach problems. Timo Werner, Dominik Szoboszlai and Christopher Nkunku all went close for Leipzig, which pushed hard for an equalizer until Szoboszlai conceded the penalty in the 85th for bringing down Jeremie Frimpong. Amiri duly sealed the result from the spot. “To win like (we did) today is not easy,\" Alonso said. “We’re not used to it. But our mentality and experience helped us. I’m very proud of the team.” Leverkusen hasn’t lost a game since a 3-2 defeat at home to Mainz on Feb. 19. On Thursday it reached the Europa League semifinals with a 4-1 win at Union Saint-Gilloise. IPL 2023 Points Table : Check Team Standings, Team Points, Wins, Losses & Orange Cap , Purple Cap Earlier, Freiburg strengthened its case for Champions League qualification with a 4-0 rout of relegation-threatened Schalke. Michael Gregoritsch scored twice for the home team to move fourth. Leverkusen is six points behind Freiburg. On Saturday, Mainz defeated Bayern Munich 3-1 to give Borussia Dortmund the chance to take over as league leader. Dortmund took its chance. Read all the Latest Sports News , Check Out Orange Cap and Purple Cap holder details here","pubDate":"2023-04-24 02:47:34","image_url":"https://images.news18.com/ibnlive/uploads/2023/04/copy-of-sports-2023-04-24t081556.821-16823043743x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"FOOTBALL-OPL -Sept équipes sur huit qualifiées","link":"https://lexpress.mg/24/04/2023/football-opl-sept-equipes-sur-huit-qualifiees/","keywords":["Sport"],"creator":["Serge Rasanda"],"video_url":null,"description":"Carton plein pour la conférence Sud. Sept clubs sur huit ont validé leur ticket pour les play-offs de l’Orange Pro League. Les quatre qualifiés du Sud sont tous connus. Mama FC et Disciples FC ont arraché leur billet ce week-end lors de leur match en retard et rejoignent Elgeco Plus et Cffa, déjà qualifiés. Il […] L’article FOOTBALL-OPL -Sept équipes sur huit qualifiées est apparu en premier sur L'Express de Madagascar.","content":"Carton plein pour la conférence Sud. Sept clubs sur huit ont validé leur ticket pour les play-offs de l’Orange Pro League. Les quatre qualifiés du Sud sont tous connus. Mama FC et Disciples FC ont arraché leur billet ce week-end lors de leur match en retard et rejoignent Elgeco Plus et Cffa, déjà qualifiés. Il y a tout de même un petit chamboulement en tête du classement du groupe. A domicile, Elgeco Plus qui a défait Cffa s’installe en position de leader après sa victoire de 1 à 0 ce samedi au By-Pass. L’unique but de la victoire du club détenteur de la coupe de Madagascar a été signé Mamisoa, le Barea U23, sur un coup franc dès l’entame de la rencontre (3e). Elgeco Plus occupe ainsi la première place devant l’équipe d’Andoharanofotsy. Les deux formations sont créditées de 28 points mais Elgeco Plus a battu Cffa en rencontre directe. «Nous avons marqué précocement. Les deux équipes ont été dos à dos en première période et nous avons par la suite dominé au retour des vestiaires. Nous avons su garder notre avantage» confie l’entraineur de l’Elgeco Plus, Raux Auguste. «Nous avons raté deux occasions nettes. Les joueurs n’ont pas été dans leur meilleure forme … alors que l’objectif était de rester en tête du groupe» a mentionné pour sa part Titi Rasoanaivo, coach du Cffa. Mama FC se trouve à la troisième place avec 21 unités et Disciples FC complète le top4 (17 points). Ces deux équipes se sont neutralisées sur un score de un partout dimanche au By-Pass. Dans la conférence Nord, trois équipes ont déjà validé leur qualification à savoir Fosa Juniors FC, leader intouchable avec 34 points, suivi de Cosfa crédité de 25 points et AS Fanalamanga (21 points). À domicile, Fosa s’est imposé à Mahajanga hier sur le score de 2 buts à 0 contre les Militaires, grâce au doublé du Barea Chan, Jean Yves (58e, 65e). Deux équipes disputeront le quatrième et dernier ticket du groupe Nord en l’occurrence Ajesaia, quatrième provisoire (19 points) et qui aura encore un match à jouer et Asa Diana, classé sixième avec 12 points. Ce dernier aura de son côté, trois matches de poule.","pubDate":"2023-04-24 02:36:37","image_url":null,"source_id":"lexpress","category":["sports"],"country":["madagascar"],"language":"french"},{"title":"FOOTBALL – JEUX DES ILES – Roro projette une détection à la Réunion","link":"https://lexpress.mg/24/04/2023/football-jeux-des-iles-roro-projette-une-detection-a-la-reunion/","keywords":["Sport"],"creator":["Serge Rasanda"],"video_url":null,"description":"Planning de préparation pour les quatre mois qui restent. Le sélectionneur des Barea en vue des jeux des Iles de l’Océan Indien, Romuald Félix Rakotondrabe alias «Roro», nommé récemment le 18 avril a remis le même jour auprès de la direction technique nationale son planning de préparation. Un regroupement d’au moins cinq jours sera prévu […] L’article FOOTBALL – JEUX DES ILES – Roro projette une détection à la Réunion est apparu en premier sur L'Express de Madagascar.","content":"Planning de préparation pour les quatre mois qui restent. Le sélectionneur des Barea en vue des jeux des Iles de l’Océan Indien, Romuald Félix Rakotondrabe alias «Roro», nommé récemment le 18 avril a remis le même jour auprès de la direction technique nationale son planning de préparation. Un regroupement d’au moins cinq jours sera prévu toutes les fin du mois jusqu’aux jeux des Iles, prévus se tenir à Madagascar du 25 aout au 3 septembre. De plus, il faut aussi jongler le rassemblement avec les play-offs ou la phase finale de l’Orange Pro League et la coupe de Madagascar. «Pour démarrer le regroupement, au lieu de fin avril, le premier rassemblement est programmé au début mai, puis fin juin et fin juillet avant le stage bloqué vers début aout» indique Roro Rakotondrabe. Le sélectionneur a demandé auprès des dirigeants de la fédération un déplacement à La Réunion pour détecter des expatriés ou binationaux qui y sont actuellement en plein championnat. Plus d’une dizaine d’expatriés évoluent à la Petite Ile. «Je veux voir de mes yeux leur forme du moment, est-ce qu’ils sont en forme physiquement et techniquement» souligne l’entraineur national. L’or dans le viseur «Je vais aussi parler avec chacun des joueurs, de notre ambition de récupérer la médaille d’or et de leur expliquer ma philosophie pour éviter d’intégrer des joueurs qui n’ont pas cette ambition là et pourront perturber la préparation à la veille des jeux» précise le sélectionneur. Mais tout dépendra également de leur disponibilité. Pour démarrer la préparation, le coach médaillé de bronze au championnat d’Afrique des nations (Chan 2023) effectuera la détection des joueurs durant les matches en retard de l’OPL puis les Play-offs. Madagascar a ravi la médaille d’or pour la dernière fois il y a vingt-ans, aux Seychelles en 1993. Trente-cinq ou quarante présélectionnés effectueront le premier regroupement. Certains seront retenus en fonction de leur forme, d’autres quitteront la présélection et d’autres rejoindront le groupe.","pubDate":"2023-04-24 02:35:59","image_url":null,"source_id":"lexpress","category":["sports"],"country":["madagascar"],"language":"french"}]}