{"newsArray":[{"title":"After 12 months out of football, Greenwood cleared of rape charges","link":"https://guardian.ng/sport/after-12-months-out-of-football-greenwood-cleared-of-rape-charges/","keywords":["Football","Sport","Man United","Mason Greenwood"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Man United footballer, Mason Greenwood, has been cleared of attempted rape and assault charges, reports planetradio.co.uk. The post After 12 months out of football, Greenwood cleared of rape charges appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Man United footballer, Mason Greenwood, has been cleared of attempted rape and assault charges, reports planetradio.co.uk. Charges including attempted rape and assault against Manchester United forward Mason Greenwood have been discontinued by the Crown Prosecution Service, the report said. Greater Manchester Police said criminal proceedings against a 21-year-old man had been discontinued as of February 2. Chief Superintendent, Michaela Kerr, GMP’s head of public protection, said: “Given the significant media coverage of this case, it is only fair that we share the news that the 21-year-old man, who had been arrested and charged in connection with an investigation opened in January 2022, no longer faces criminal proceedings in relation to this. “The investigation team has remained in regular contact with the legal team, providing any updates of note, and so understand the rationale for the discontinuation of proceedings at this stage, and that this decision has not been taken lightly. “Despite the media and public’s interest in this case, we have decided not to comment on it in any further detail.” “I would, however, like to use this opportunity to reiterate GMP’s commitment to investigating allegations of violence against women and girls and supporting those affected, regardless of their circumstances, throughout what can be a hard and upsetting time for them. “An ever increasing number of officers are receiving specialist training and the force is more consistently utilising tools, available via the criminal justice system, to keep people safe and care for victims. “If you feel you are or might be a victim, please don’t let this case put you off asking for help.” During the trial, the Manchester United forward was suspended by the club, with all his privileges withdrawn pending the determination of the case. It is yet unknown whether Manchester United will reabsorb Greenwood into their team. Follow Us","pubDate":"2023-02-03 03:09:01","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Police issue arrest warrant for Joe Mixon after he allegedly pointing a firearm at a woman","link":"https://www.dailymail.co.uk/sport/nfl/article-11708055/Police-issue-arrest-warrant-Joe-Mixon-allegedly-pointing-firearm-woman.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon on account of aggravated menacing, according to several reports on Thursday night.","content":"Cincinnati police issue arrest warrant for Bengals star Joe Mixon after he allegedly pointed a firearm at a woman and said: 'You should be popped in the face, I should shoot you, the police can't get me' - but his furious agent says charges will be DROPPED The incident was allegedly on Jan 21, before the Bengals beat the Buffalo Bills The Bengals season ended at the weekend with defeat by Kansas City Chiefs Mixon, 26, allegedly said to a woman that he would shoot her in the face His agent, however, issued a tense response saying charges will be dropped Click here for all your latest international Sports news from DailyMail.com By Jack Bezants For Dailymail.Com Published: 00:14, 3 February 2023 | Updated: 03:02, 3 February 2023 e-mail 259 shares 23 View comments An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon on account of aggravated menacing, according to several reports on Thursday night. Court documents say Mixon allegedly pointed a firearm at a woman on January 21 and said: 'You should be popped in the face, I should shoot you, the police can't get me.' The Bengals said in a statement: 'The club is aware misdemeanor charges have been raised against Joe Mixon. The club is investigating the situation and will not comment further at this time.' January 21 was the day before the Bengals beat the Buffalo Bills 27-10 in the playoffs. If Mixon is convicted, he could face up to 180 days in jail and fined according to Ohio's state laws. An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon Mixon allegedly pointed a firearm at a woman's face and said 'I should shoot you' But NFL Network reporter Tom Pelissero claimed Mixon's agent said the accusations will be dropped on Friday morning. He quoted Mixon's agent Peter Schaffer as saying: 'It was a rush judgement. They're dropping the charges first thing in the morning. 'I really feel the police have an obligation before they file charges - because of the damage that can be done to the person's reputation - to do their work. They should be held to a higher standard because I don't play with people's lives.' The 26-year-old Mixon has just completed his sixth season in the NFL. The Bengals were eliminated from the playoffs on Sunday, losing 23-20 to the Kansas City Chiefs, who advance to the Super Bowl to play the Philadelphia Eagles. Mixon rushed 210 times for 814 yards and got seven touchdowns in the 2022 season. Mixon played college football at Oklahoma and was selected by the Bengals in the 2017 draft. In 2014 at Oklahoma, he was suspended for a season after punching a woman, Amelia Molitor, in the face. She was left with a broken jaw and cheekbone and they settled out of court three years later. 'I'm thankful Mia and I were able to talk privately,' Mixon said after the settlement was reached in 2017. 'I was able to apologize to her one-to-one. The incident allegedly occurred the day before Mixon played for the Bengals against the Bills Mixon's current Bengals deal, signed in 2020, runs up to 2024 and is worth $48million 'The way I reacted that night, that's not me. That's not the way I was raised. I think she understands that. 'Talking together helps move us past what happened. I know I have to keep working to be a better person, and this is another step in that direction.' In 2020, he signed a four-year contract extension with the Bengals worth $48m. Share or comment on this article: Police issue arrest warrant for Joe Mixon after he allegedly pointing a firearm at a woman e-mail 259 shares Add comment Comments 23 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 03:02:42","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/00/67274631-0-image-a-16_1675385174885.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever black QB matchup","link":"https://www.dailymail.co.uk/sport/cincinnati-bengals/article-11708357/Patrick-Mahomes-calls-special-battle-Jalen-Hurts-Super-Bowls-black-QB-matchup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Players like Doug Williams and Donovan McNabb have previously paved the way for Mahomes and Hurts, and Mahomes recognizes the significance of him and Hurts facing off.","content":"Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever matchup of black quarterbacks, and says he's in a 'good spot' following high ankle sprain Patrick Mahomes' Chiefs will take on Jalen Hurts' Eagles on February 12 Both teams are 16-3 and Philadelphia are favored by 1.5 points for the game Click here for all your latest international Sports news from DailyMail.com By Jake Nisse For Dailymail.Com Published: 02:49 GMT, 3 February 2023 | Updated: 02:59 GMT, 3 February 2023 e-mail View comments Patrick Mahomes has called it 'special' to face off against Jalen Hurts in the Super Bowl on February 12, in what will be the first ever matchup of two black quarterbacks in the game's history. Players like Doug Williams and Donovan McNabb have previously paved the way for black quarterbacks, and Mahomes recognizes the significance of him and Hurts facing off. 'To be on the world stage and have two black quarterbacks start in the Super Bowl, I think it's special, and I've learned more and more about the history of the Black quarterback since I've been in this league,' Mahomes told reporters Thursday. 'The guys that came before me and Jalen set the stage for this, and now, I'm just glad that we can kind of set the stage for guys that are kids that are coming up now. 'You've seen over time, whenever Doug Williams or Michael Vick, Donovan McNabb go out and play great football, it gives other guys like me and Jalen chances to have this platform and have this spot on an NFL team. Patrick Mahomes recognized the significance of two black quarterbacks facing off next week Jalen Hurts had a tremendous season for the Eagles, who enter the game with a 16-3 record 'And so, if we can continue to show that we can consistently be great, I think it'll just continue to open doors, for other kids growing up to follow their dreams, to be a quarterback of the NFL team. It's good that we have guys like Jalen on the other side. He's a great person and obviously a great quarterback.' Mahomes and Hurts' matchup comes 35 years after Williams became the first black quarterback to start in a Super Bowl. He excelled in that game for Washington, throwing for 340 yards and four touchdowns and leading his team to a 42-10 win. Both Mahomes and Hurts come into the Super Bowl on the back of stellar seasons, as the former led the league in passing yards and touchdowns and the latter earned MVP buzz with his dual-threat prowess. Mahomes suffered a high-ankle sprain in the divisional round vs. the Jaguars, but played last week vs. the Bengals and said he did not aggravate the injury in the AFC Championship. Other than [some general soreness], I feel I'm in a good spot,' he said. Share or comment on this article: Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever black QB matchup e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:59:58","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/02/67277019-0-image-a-57_1675391635867.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Super Bowl: Could Patrick Mahomes be on track to catch Tom Brady, Peyton Manning and Aaron Rodgers?","link":"https://www.dailymail.co.uk/sport/nfl/article-11567543/Super-Bowl-Patrick-Mahomes-track-catch-Tom-Brady-Peyton-Manning-Aaron-Rodgers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mahomes, while he does not have the same level of experience, could already be on track to eclipsing Brady, Manning and Co. after punching his ticket to Super Bowl LVII against the Philadelphia Eagles.","content":"After leading the Chiefs to their third Super Bowl in four years and one ring already on his finger, could Patrick Mahomes be on track to catch - and even surpass - Tom Brady, Peyton Manning and Aaron Rodgers as one of the NFL's best? Patrick Mahomes is heading to his third Super Bowl appearance with the Chiefs The Kansas City QB could match Tom Brady, Peyton manning and Aaron Rodgers Click here for all your latest international Sports news from DailyMail.com By Isabel Baldwin For Dailymail.Com Published: 02:55, 3 February 2023 | Updated: 02:55, 3 February 2023 e-mail 2 View comments With seven Super Bowl titles, the most in NFL history, no one can come close to Tom Brady and his GOAT status, yet. But Patrick Mahomes, in his fifth season as the Kansas City Chiefs starting quarterback, could be on track to at least put up a challenge and catch the star, as well as NFL veterans Aaron Rodgers and Peyton Manning. Brady was in familiar territory on January 16 with none better in NFL history than the Bucs quarterback in the postseason - but Tampa Bay and the veteran's playoff run came to a crashing end in the wild card round. Kansas City's Patrick Mahomes (right) could be on track to challenge Tom Brady (left) and Co. Meanwhile, Rodgers’ Super Bowl hopes came to an end before the playoffs even began as the Green Bay Packers agonizingly missed out on the final day of the regular season. And Manning is quite content talking about football from his sofa on Manning-cast, rather than playing these days. Meanwhile, although he does not have the same level of experience at age 27, Mahomes could already be on track to eclipsing them all after punching his ticket to Super Bowl LVII against the Philadelphia Eagles. After his recent playoff performances and the Chiefs' third Super Bowl appearance in four years on the horizon, the statistics seem to spell out a bright narrative for the future. He threw for two touchdowns against the Cincinnati Bengals in the AFC Championship - his fifth consecutive as a starter - Sunday and when his team needed him most, he scampered for five yards and drew a flag for a late hit to set up Harrison Butker’s 45-yard game-winning field goal - all on a high ankle sprain. Mahomes led the Chiefs to their third Super Bowl appearance in four years on Sunday The 27-year-old threw for two touchdowns and crucially scrambled to set up the winning kick Mahomes, in just five trips to the playoffs in five seasons in the league so far, has recorded a completion percentage of 66.7, has thrown for 32 touchdowns and 3,902 yards and has a rating of 106.1. In comparison, Brady threw just 20 touchdowns in his first four seasons in the playoffs and 3,217 yards. Brady has played more postseason games than any player in NFL history with 48. Following this season, he has a passer rating of 89.8, has thrown 88 touchdowns and has thrown for 13,400 yards in the playoffs alone. But on average in the postseason, Brady's pass completion rate is 62.5 percent and while he has won more AFC Championship games than he has lost, it suggests that he has often had to rely on a team performance to rally through. Veteran Brady has played more postseason games than any player in NFL history with 48 Brady led the Buccaneers to victory over Mahomes's Kansas City Chiefs at Super Bowl LV Manning during his time with both the Indianapolis Colts and Denver Broncos registered a passer rate of 87.4 and a completion rate of 63.2 percent. Rodgers, while achieving back-to-back MVP awards last year thanks to the help of psychedelic drug ayahuasca, has played significantly less games in the playoffs than Brady and Manning across his 18-season career - and only nine more than Mahomes has already racked up. Peyton Manning won one Super Bowl with the Colts in 2007 and another with the Broncos in 2016 Through 22 games, he does have a slightly better passer rating and completion rate than Brady and Manning with 100.1 and 64.7 percent but it still fails to quite match Mahomes. In his 13 games in the postseason so far Mahomes has an average of 300 yards per game and 21 yards more than Brady's average, 29 more than Manning and 32 more than Rodgers. Furthermore, Mahomes has just seven interceptions to his 28 touchdowns meaning his touchdown to interceptions ratio of 4.1 absolutely obliterates Brady's of 2.2 over his playoffs career. The postseason figures can be examined to death but every player and fan knows there's one thing that means the most - the Super Bowl. Incredible postseason performances can mean nothing if a player ultimately cannot wrap up their playoff charge with a ring. The greatest win when it counts the most, and that's exactly what Brady has done - seven times. Packers quarterback Aaron Rodgers won back-to-back MVP award at the end of last season Manning has two Super Bowl wins to his name from the 2006 and 2015 seasons, while Rodgers has just the one ring - the same number that Mahomes already has. Mahomes has clinched the one but also knows the bitter disappointment of having come so close following the Chiefs' 2021 defeat to Brady’s Bucs. Yet, he will have another shot at a ring and the chance to level manning and surpass Rodgers in Arizona on February 12. And it's not just that star trio that Mahomes is catching up. In fact, he has already surpassed some NFL Hall of Famers, having more passing touchdowns than John Elway, Steve Young, Troy Aikman, and Roger Staubach. Mahomes is already showing he can match the best in the regular season too. Mahomes has started his career by putting up passing numbers like no other player in NFL history. Mahomes already has one ring to his names after Kansas City won Super Bowl LIV Mahomes had the 37th 300-yard passing game of his career against the LA Chargers on November 20th, which ties the record for the most 300-yard games in a player's first seven NFL seasons. Dan Marino, with 37 300-yard games from 1983 to 1989, has owned the record since the 1980s. This is only Mahomes' sixth NFL season, and he only played in one game as a rookie, meaning he has reached 37 300-yard games far faster than Marino did. Mahomes had started 73 games in his career before hitting that mark; Marino got his 37th 300-yard game in his 101st career start. Mahomes then surpassed Marino’s 37 by hitting four more 300-yard games before the end of the regular season, taking his total to 41. Now in his fifth season as the Chiefs' starting quarterback, over the last four seasons (2018-2021), Mahomes led the league in both passing yards (18,707) and touchdown passes (151). Mahomes tied Dan Marino's record for most 300-yard games in a player's first seven seasons He has also led the Chiefs to their seventh straight AFC West Title after they beat the Houston Texans in overtime on December 18 before heading their charge through the playoffs to the AFC Championship crown and a Super Bowl spot. Even Brady has admitted that he would currently struggle to replicate what Mahomes is doing in the league. On his Let's Go! podcast earlier in the season, Brady said: 'Then I see other players, let's say like Patrick Mahomes or today's Lamar Jackson. I go, 'f***, I can't do any of that.' How did they do that? It blows me away because however they're playing, I don't see the game the way they see it.' Even Brady has admitted that he would currently struggle to replicate what Mahomes is doing Mahomes has also garnered comparisons to Brady and Manning from his peers, most recently from Bengals wide receiver Tyler Boyd. Boyd likened Mahomes vs. Cincinnati quarterback Joe Burrow to the rivalry between Brady and Manning ahead of the pair's clash during the Bengals' 27-24 win over Kansas City on December 4. Mahomes and the Chiefs beat the Bengals in a thrilling 23-20 AFC Championship game in the dying seconds on Sunday. 'It's going back to that quarterback fight. I look at it like Manning and Brady,' Boyd said. 'You can't stop them. It comes down to whoever excels and takes advantage of their opportunities in drives and scores points. These are the types of games that we have to take care of the football and not turn it over.' Mahomes and Bengals' Joe Burrow (right) have garnered comparisons to Brady and Manning Mahomes has often shot down these comparisons in the past due to the early stages of their careers. And he has a point, he has a long way to go to match the longevity and success of Brady and Manning’s careers - but this could be just the start. Mahomes has a long career ahead of him and say he plays another 11 years, taking him to age 38, based on the figures he has already posted, he could be sitting on around 90 postseason touchdown passes. The current holder of that record - to no one's surprise - is Brady with 88. With one SuperBowl win under his belt at just age 27, Mahomes has already shown he has the talent and potential to add more, not just on February 12 but beyond, and could even threaten Brady's seven. Share or comment on this article: Super Bowl: Could Patrick Mahomes be on track to catch Tom Brady, Peyton Manning and Aaron Rodgers? e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:55:06","image_url":"https://i.dailymail.co.uk/1s/2023/01/31/21/67181699-0-image-a-19_1675201808921.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Fernandez set for Chelsea debut, Arsenal renew title charge","link":"https://www.thephuketnews.com/fernandez-set-for-chelsea-debut-arsenal-renew-title-charge-87040.php","keywords":null,"creator":null,"video_url":null,"description":"FOOTBALL: The clock is ticking for Chelsea manager Graham Potter to turn unprecedented spending into results, starting against Fulham this evening (Feb 3), as new Everton manager Sean Dyche prepares for a baptism of fire against Premier League leaders Arsenal.","content":"Jurgen Klopp’s Liverpool travel to face struggling Wolves, desperate to pull themselves out of a slump that has left them playing catch-up, while Tottenham host champions Manchester City. British-record signing Enzo Fernandez, a World Cup winner with Argentina last December, could make his debut at Stamford Bridge in the west London derby after completing a £107 million (B4.3 billion) move from Benfica. Mykhailo Mudryk is also in line for his first start since joining from Shakhtar Donetsk in a blockbuster January transfer window for the club for a fee that could rise to 100mn euros (B3.6bn). Chelsea’s overall spend in their first season under new ownership fronted by LA Dodgers co-owner Todd Boehly has now surpassed £500mn but the Blues are languishing in 10 th in the Premier League table, 10 points off the top four. Potter admits he has a challenge on his hands to keep all his stars happy as he tries to turn Chelsea’s fortunes around. “We have to create an environment where there’s healthy competition and they can push each other,” Potter said yesterday. “There’s going to be frustration at times because only 11 can play. “But we’ve got a lot of important games and we need to improve our results so it’s about playing, supporting the team and being ready to play.” Marco Silva’s Fulham beat Chelsea for the first time since 2006 when the sides met last month at Craven Cottage and are above their illustrious neighbours in the table. Another victory for the white half of west London would secure a first-ever league double over Chelsea in a single season. Dyche’s daunting debut The contrast in mood between Arsenal and Everton fans could hardly be starker ahead of their meeting at Goodison Park tomorrow. Arsenal are on course for a first league title since 2003/04 with the luxury of a five-point lead over Manchester City and a game in hand. The Gunners will be hoping their January business is enough to get them over the line despite missing out on their top two targets - Mudryk and Brighton’s Moises Caicedo. Jorginho’s arrival from Chelsea this week adds depth and an old head to Mikel Arteta’s young squad while Leandro Trossard boosts his attacking options. Everton were the only Premier League club not to make a January signing and former Burnley boss Sean Dyche knows he has a mountain to climb. The Toffees’ 69-year stay in the English top flight is at severe risk and further protests from supporters against the club’s board are planned for after the match. “There’s a big challenge ahead but one I’m ready for and want to take on,” Dyche told Everton TV. “We want to change the shape of this club going forwards, remodel it in our style, but remodel it in a way we can win.” Guardiola’s Cancelo culture Manchester City manager Pep Guardiola showed his ruthless streak as Joao Cancelo was allowed to move on loan to Bayern Munich this week. The Portuguese full-back was an important figure in City’s title wins over the past two seasons but his departure is further evidence that Guardiola is trying to spark a reaction from his squad. He questioned whether his side had the hunger to hunt down Arsenal despite a dramatic comeback from 2-0 down to beat Tottenham 4-2 last month. Now Guardiola has gambled, knowing that his daring call on Cancelo leaves him short on full-back options for the rest of the season. City might be eight points behind the leaders before Sunday’s game against Spurs, who could be without manager Antonio Conte after he underwent surgery to remove his gallbladder, but they have title-winning nous and enviable strength in depth. Fixtures (all Phuket times) Saturday Chelsea v Fulham (3am) Everton v Arsenal (7:30pm) Aston Villa v Leicester (10pm) Brentford v Southampton (10pm) Brighton v Bournemouth (10pm) Man Utd v Crystal Palace (10pm) Wolves v Liverpool (10pm) Sunday Newcastle v West Ham (12:30am) Nottingham Forest v Leeds (9pm) Tottenham v Man City (11:30pm)","pubDate":"2023-02-03 02:43:00","image_url":" \n\t\t","source_id":"thephuketnews","category":["sports"],"country":["thailand"],"language":"english"},{"title":"Glamorous Aston Villa star Alisha Lehmann beats tennis legend Roger Federer in popularity contest","link":"https://www.dailymail.co.uk/sport/football/article-11707979/Glamorous-Aston-Villa-star-Alisha-Lehmann-beats-tennis-legend-Roger-Federer-popularity-contest.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Retired tennis legend Roger Federer is not used to second place, but he has been handed an unflattering L on the social media stage with a little known football player usurping him at the top.","content":"How a glamorous 24-year-old football star you've never heard of beat tennis legend Roger Federer into second place in sporting popularity contest Alisha Lehmann is the most popular Swiss athlete on Instagram She pips Federer who recently retired with 20 grand slam titles Lehmann posts sometimes raunchy images to her account By Josh Alston For Daily Mail Australia Published: 21:37 EST, 2 February 2023 | Updated: 21:38 EST, 2 February 2023 e-mail View comments Retired tennis legend Roger Federer is not used to finishing in second place, but he has been handed an unflattering loss on the social media stage with a little-known football player usurping him at the top. Along with his 20 Grand Slam singles titles, a career Grand Slam (winning all four Grand Slams at least once) and 103 ATP singles titles including 20 major titles, Federer was also the Swiss king of Instagram. However, he has now surrendered that title with glamourous Aston Villa star Alisha Lehmann now taking the mantle as the most followed Swiss sports star on the platform. Not even cutting a striking figure at the Christian Dior Haute Couture Spring Summer 2023 show as part of Paris Fashion Week could help Federer remain top spot on social media Lehmann plays for Aston Villa and the Switzerland national team and has become the most popular Swiss personality on Instagram, overtaking the grand slam icon The Aston Villa star also posts a range of glamourous and raunchy photos to her social media The great Federer has 11.2m followers on the platform while Lehmann has now overtaken him with 11.4m fans. While there are plenty of images of Lehmann plying her trade in the English FA Women's National League on her profile, she has something that Federer will never match: a raunchy side. She has posted bikini photos of herself in glamorous locations around the world like Miami and Rio de Janeiro . The footballer recently became single after splitting from fellow Aston Villa star Douglas Luiz, and her 2023 calendar has probably helped boost her online profile as well. Lehmann has notched 32 appearances for Aston Villa and has also played eight games for Everton and 42 matches for West Ham United Images like this, taken at Miami Beach, have earned Lehmann plenty of praise with one follower commenting: 'I was looking for the meaning of perfection and I found this' Lehmann also once dated former Chelsea Women's star Ramona Bachmann. Fellow Swiss tennis stars Stan Wawrinka (1.2 million followers), rising tennis star Belinda Bencic (427k followers) and the retired Martina Hingis (313k Followers) fall well behind Federer and Lehmann. In other sports Arsenal midfielder Granit Xhaka (2.9 million followers), popular alpine skiing star Marco Odermatt (237K followers), track sprinter Mujinga Kambundji (133K followers) were also well down the pecking order. And while Lehmann has dethroned Federer on the Swiss stage, she has work some to do to catch the global Instagram leaders. Federer has 20 grand slams and signed off from international tennis with a classy letter to his supporters on Instagram (pictured below) View this post on Instagram A post shared by Roger Federer (@rogerfederer) Former Portugal , Manchester United and Real Madrid star Cristiano Ronaldo - who now plays for Saudi Professional League club Al Nassr - tops all athletes with more than 520million followers. It is one area where he trumps great rival Lionel Messi, who comes in second with 406million - although he does have a World Cup victory to his name. While technically no longer an athlete, former WWE star Dwayne 'The Rock' Johnson is third with 354million followers, with Indian cricket hero Virat Kohli (228million) and Brazillian football star Neymar Jr (197million) rounding out the top five. Share or comment on this article: Glamorous Aston Villa star Alisha Lehmann beats tennis legend Roger Federer in popularity contest e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:38:04","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/01/67274975-0-image-a-40_1675386190151.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am","link":"https://247newsaroundtheworld.com/sports/gareth-bale-shows-off-his-incredible-golfing-ability-at-the-pebble-beach-pro-am/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Gareth Bale shows off his incredible golfing ability at the Pebble Beach… The post Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am appeared first on 247 News Around The World.","content":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am by nearly holing out from the CART PATH – after Jon Rahm was left amazed at his game… while Bills QB Josh Allen gets off to a great start in his group By Jake Fenner For Dailymail.Com Published: 13:34 EST, 2 February 2023 | Updated: 20:44 EST, 2 February 2023 Gareth Bale impressed with his golfing skill during the opening round of the Pebble Beach Pro-Am in California. Facing a shot off the greenside cart path, Bale pulled his wedge out to try and land the ball softly near the cup. He bounced the ball off the edge of the pavement – sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green and then softly rolled and settled for a short putt. Meanwhile, fellow athlete and NFL quarterback Josh Allen began his day with a great drive with his group playing on the nearby Spyglass Hill course. Gareth Bale impressed with a miraculous cart path save at the Pebble Beach Pro-Am Bale bounced the ball off the edge, sending the ball sailing over the rough and on the green See also Tottenham complete loan signing of Pedro Porro with view to £40million permanent transfer from Sporting Lisbon after resurrecting collapsed on deadline day Allen surprised NFL fans by turning up to this event, just days after saying that he would be skipping the Pro Bowl Games. The quarterback said that he’d be sitting out the festivities in Las Vegas due to an elbow injury. Bale just recently announced his retirement from professional football, just months after he led Wales in their first World Cup since 1958. Last week, Bale took part in another Pro-Am just before the Farmers Insurance Open teed off at Torrey Pines in San Diego. His play drew praise from Spanish golfer Jon Rahm – who said it ‘doesn’t seem fair’ that Bale is ‘so good at football and golf’. Bale’s love of golf is well known and he is said to have a three-hole golf course at his house but the hobby had been a controversial issue during his soccer career. It was a source on contempt in particular during his time with Real Madrid, where he won five Champions League titles. He posed, while on international duty with Wales, with a banner that read, ‘Wales. Golf. Madrid. In That Order’ – a move which sparked a backlash among supporters of the club. Allen surprised many NFL fans by spurning the Pro Bowl to play at this year’s golf tournament See also Sportsman arrested in Ireland, suspected of passing police intel from corrupt cops to gangs Share or comment on this article: Post source: Daily mail","pubDate":"2023-02-03 02:33:22","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Benfica manager Roger Schmidt insists the club are bigger than Enzo Fernandez and he only wants players who are ‘happy to play’ after £106.8m Chelsea transfer","link":"https://247newsaroundtheworld.com/sports/benfica-manager-roger-schmidt-insists-the-club-are-bigger-than-enzo-fernandez-and-he-only-wants-players-who-are-happy-to-play-after-106-8m-chelsea-transfer/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Benfica boss Roger Schmidt has sent a dig to Enzo Fernandez after… The post Benfica manager Roger Schmidt insists the club are bigger than Enzo Fernandez and he only wants players who are ‘happy to play’ after £106.8m Chelsea transfer appeared first on 247 News Around The World.","content":"Benfica boss Roger Schmidt has sent a dig to Enzo Fernandez after he completed his British transfer record move to Chelsea. The 22-year-old signed for the Blues in the final hours of deadline day for a fee of £106.8million. AFP Schmidt is not happy with Fernandez Getty The 22-year-old is on his way to Chelsea He only joined Benfica in the summer from River Plate but has already moved on to pastures new following his World Cup win with Argentina. However, after Benfica’s 3-0 against Arouca on Tuesday night, his former boss Schmidt was not slow to criticise the midfielder. He said: “It’s always difficult to lose a good player in the winter market, but today we showed that we are a good team without him, that we are capable of playing good football without him, that the players are focused on getting the most points, to be champions. “Benfica is much bigger than a player. We just need players who are happy to play for Benfica, who are passionate. “We had a player who wanted to leave and a club willing to pay the clause, we couldn’t do anything. We accepted and looked ahead.” Fernandez emerged as one of football’s brightest talents in Qatar when he won the World Cup’s Young Player of the Tournament award. CHELSEAFC.COM Chelsea will soon welcome their new record signing Getty He helped Argentina win the World Cup in Qatar Greenwood latest, Martinelli ‘signs new Arsenal deal’, Ayew snubs Everton for Forest Man United forward Mason Greenwood has all criminal charges against him dropped Man United forward Greenwood breaks silence after criminal charges are dropped Manchester United statement after criminal charges against Mason Greenwood are dropped Arsenal star Tomiyasu reveals ‘aggressive’ forward he least enjoys facing in training Why one Newcastle player will only secure Carabao Cup winners’ medal if Man United win He made 29 appearances for Benfica but will soon arrive at Chelsea as their eighth arrival of the January window. Fernandez’s move is also a British transfer record, surpassing Jack Grealish’s £100million transfer from Aston Villa to Manchester City. The midfield star will join a Chelsea team who sit tenth in the Premier League table. Graham Potter’s side will need a big push in the second half of the season if they are to finish in the top four. talkSPORT BET OFFER OF THE DAY Get up to £40 in free bets* – CLAIM HERE 18+ New customers only. Opt in, bet up to £40 (min. £20) on selected events at odds of 2.00+, in 7 days. Get up to £40 in free bets on selected events. Bonuses expire in 7 days. Card payments only. T&Cs apply, see below. begambleaware.org | Please gamble responsibly SEE ALL FREE BETS HERE See also Newcastle complete the signing of Anthony Gordon for £40m - plus £5m in add-ons","pubDate":"2023-02-03 01:45:47","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am","link":"https://www.dailymail.co.uk/sport/golf/article-11707073/Gareth-Bale-shows-incredible-golfing-ability-Josh-Allen-forgets-sport-hes-playing.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"He bounced the ball off the edge of the pavement - sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green.","content":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am by nearly holing out from the CART PATH - after Jon Rahm was left amazed at his game... while Bills QB Josh Allen gets off to a great start in his group Gareth Bale has had plenty of time to work on his golf game since retirement Meanwhile, Josh Allen drove the ball well after skipping the NFL's Pro Bowl Click here for all your latest international Sports news from DailyMail.com By Jake Fenner For Dailymail.Com Published: 18:34 GMT, 2 February 2023 | Updated: 01:44 GMT, 3 February 2023 e-mail 124 shares 29 View comments Gareth Bale impressed with his golfing skill during the opening round of the Pebble Beach Pro-Am in California . Facing a shot off the greenside cart path, Bale pulled his wedge out to try and land the ball softly near the cup. He bounced the ball off the edge of the pavement - sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green and then softly rolled and settled for a short putt. Meanwhile, fellow athlete and NFL quarterback Josh Allen began his day with a great drive with his group playing on the nearby Spyglass Hill course. Multi-sport athlete ⚽️ The cart path is no problem @GarethBale11 . pic.twitter.com/7EOuM3IE4M — PGA TOUR (@PGATOUR) February 2, 2023 Gareth Bale impressed with a miraculous cart path save at the Pebble Beach Pro-Am Bale bounced the ball off the edge, sending the ball sailing over the rough and on the green Allen surprised NFL fans by turning up to this event , just days after saying that he would be skipping the Pro Bowl Games. The quarterback said that he'd be sitting out the festivities in Las Vegas due to an elbow injury. Bale just recently announced his retirement from professional football, just months after he led Wales in their first World Cup since 1958. Last week, Bale took part in another Pro-Am just before the Farmers Insurance Open teed off at Torrey Pines in San Diego. His play drew praise from Spanish golfer Jon Rahm - who said it 'doesn't seem fair' that Bale is 'so good at football and golf'. Bale's love of golf is well known and he is said to have a three-hole golf course at his house but the hobby had been a controversial issue during his soccer career. It was a source on contempt in particular during his time with Real Madrid, where he won five Champions League titles. He posed, while on international duty with Wales, with a banner that read, 'Wales. Golf. Madrid. In That Order' - a move which sparked a backlash among supporters of the club. Allen surprised many NFL fans by spurning the Pro Bowl to play at this year's golf tournament Starting strong 💪 @JoshAllenQB is off to a hot start after his opening tee shot @ATTProAm . pic.twitter.com/iDKa67XU2V — PGA TOUR (@PGATOUR) February 2, 2023 Share or comment on this article: Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am e-mail 124 shares Add comment Comments 29 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 01:44:27","image_url":"https://i.dailymail.co.uk/1s/2023/02/02/18/67263595-0-image-a-8_1675364095598.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Neville apologises for 'clumsy like' on tweet calling Man United's Greenwood an 'innocent man'","link":"https://www.dailymail.co.uk/sport/football/article-11707131/Neville-apologises-clumsy-like-tweet-calling-Man-Uniteds-Greenwood-innocent-man.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against Mason Greenwood were dropped on Thursday.","content":"Gary Neville apologises for 'clumsy like' of a tweet calling Mason Greenwood an 'innocent man' after charges against Man United forward were dropped... with the Red Devils icon insisting he 'obviously condemns' violence against women Pundit Gary Neville has insisted he obviously condemns violence against women Neville liked a tweet calling Man United's Mason Greenwood an 'innocent man' All charges were dropped against United forward Greenwood , 21, on Thursday By Max Mathews For Mailonline Published: 19:47, 2 February 2023 | Updated: 01:39, 3 February 2023 e-mail 304 shares 4 View comments Gary Neville has issued a statement insisting he 'obviously condemns' violence against women - after being criticised for liking a tweet describing Mason Greenwood as an 'innocent man' . Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against M anchester United forward Greenwood were dropped on Thursday , a year after he was arrested. And United icon Neville was criticised online for liking a tweet from former Chief Crown Prosecutor for North West England Nazir Afzal declaring Greenwood's innocence - something he admitted was 'clumsy'. The Sky Sports pundit later tweeted: 'I liked a tweet relating to the Mason Greenwood news this afternoon from Nazir Afzal. (the former director of public prosecutions). 'This like is being misinterpreted. It was a clumsy like as I obviously condemn any violence against women.' Gary Neville has issued a statement saying he 'obviously' condemns violence against women after being criticised for liking tweets about Mason Greenwood's charges being dropped I liked a tweet relating to the Mason Greenwood news this afternoon from Nazir Afzal. ( the former director of public prosecutions ). This like is being misinterpreted. It was a clumsy like as I obviously condemn any violence against women. — Gary Neville (@GNev2) February 2, 2023 Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against the Man United forward were dropped on Thursday The tweets from Afzal read: 'Mason Greenwood has had all charges against him dropped by the Prosecutors. What's changed you may ask? It appears that (some) witnesses will no longer support a prosecution & new evidence came to light It happens He is an innocent man, that's all we need to know. 'You are innocent till PROVEN guilty. We don't have trial by media, We don't have evidence that any witnesses were lying, We don't do 'victim or complainant blaming'. Prosecutors have to be sure there is a realistic prospect of conviction by a jury on the evidence they have. They don't.' Neville has since un-liked those tweets. It is also believed he retweeted one of the tweets but has also since undone that action. A Crown Prosecution Service spokesperson said: 'We have a duty to keep cases under continuous review. In this case a combination of the withdrawal of key witnesses and new material that came to light meant there was no longer a realistic prospect of conviction. 'In these circumstances, we are under a duty to stop the case. We have explained our decision to all parties. We would always encourage any potential victims to come forward and report to police and we will prosecute wherever our legal test is met.' To which United responded: ''Manchester United notes the decision of the Crown Prosecution Service that all charges against Mason Greenwood have been dropped. The club will now conduct its own process before determining next steps. We will not make any further comment until that process is complete.' Greenwood himself said in a statement: 'I am relieved that this matter is now over and I would like to thank my family, loved ones and friends for their support. There will be no further comment at this time.' There are now questions over whether Greenwood will play for the club again . Neville had liked two tweets from Nazir Afzal, one calling Greenwood an 'innocent man' He remains on United's squad list and, in a possible indication he could resume his football career, is still present on the first-team squad page on United's official website. Greenwood was included among Under 21 players on United's official Premier League squad list at the beginning of the season despite being suspended by the club. His biography on the club website makes no mention of the charges against him with the last update mentioning a new contract until 2025 he signed in 2021 and his passing of 100 appearances for the club. The player, who has been capped once for the Three Lions, was first held in January over allegations relating to a young woman, after images and videos were posted online. He was later suspended from United on full pay and removed from the FIFA 22 game. Greenwood last featured for the Red Devils on January 22, 2022, in a 1-0 win over West Ham. He has been suspended by the club since that point. Greenwood's profile remains on United's official website despite the club suspending him The forward is listed alongside other United players on the first-team squad page Greenwood was listed in the Under 21 (Contract and Scholars) section of United's squad list for the Premier League at the beginning of the season Share or comment on this article: Neville apologises for 'clumsy like' on tweet calling Man United's Greenwood an 'innocent man' e-mail 304 shares Add comment Comments 4 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 01:39:11","image_url":"https://i.dailymail.co.uk/1s/2023/02/02/19/67264903-0-image-a-44_1675366059627.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"After 12 months out of football, Greenwood cleared of rape charges","link":"https://guardian.ng/sport/after-12-months-out-of-football-greenwood-cleared-of-rape-charges/","keywords":["Football","Sport","Man United","Mason Greenwood"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Man United footballer, Mason Greenwood, has been cleared of attempted rape and assault charges, reports planetradio.co.uk. The post After 12 months out of football, Greenwood cleared of rape charges appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Man United footballer, Mason Greenwood, has been cleared of attempted rape and assault charges, reports planetradio.co.uk. Charges including attempted rape and assault against Manchester United forward Mason Greenwood have been discontinued by the Crown Prosecution Service, the report said. Greater Manchester Police said criminal proceedings against a 21-year-old man had been discontinued as of February 2. Chief Superintendent, Michaela Kerr, GMP’s head of public protection, said: “Given the significant media coverage of this case, it is only fair that we share the news that the 21-year-old man, who had been arrested and charged in connection with an investigation opened in January 2022, no longer faces criminal proceedings in relation to this. “The investigation team has remained in regular contact with the legal team, providing any updates of note, and so understand the rationale for the discontinuation of proceedings at this stage, and that this decision has not been taken lightly. “Despite the media and public’s interest in this case, we have decided not to comment on it in any further detail.” “I would, however, like to use this opportunity to reiterate GMP’s commitment to investigating allegations of violence against women and girls and supporting those affected, regardless of their circumstances, throughout what can be a hard and upsetting time for them. “An ever increasing number of officers are receiving specialist training and the force is more consistently utilising tools, available via the criminal justice system, to keep people safe and care for victims. “If you feel you are or might be a victim, please don’t let this case put you off asking for help.” During the trial, the Manchester United forward was suspended by the club, with all his privileges withdrawn pending the determination of the case. It is yet unknown whether Manchester United will reabsorb Greenwood into their team. Follow Us","pubDate":"2023-02-03 03:09:01","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Police issue arrest warrant for Joe Mixon after he allegedly pointing a firearm at a woman","link":"https://www.dailymail.co.uk/sport/nfl/article-11708055/Police-issue-arrest-warrant-Joe-Mixon-allegedly-pointing-firearm-woman.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon on account of aggravated menacing, according to several reports on Thursday night.","content":"Cincinnati police issue arrest warrant for Bengals star Joe Mixon after he allegedly pointed a firearm at a woman and said: 'You should be popped in the face, I should shoot you, the police can't get me' - but his furious agent says charges will be DROPPED The incident was allegedly on Jan 21, before the Bengals beat the Buffalo Bills The Bengals season ended at the weekend with defeat by Kansas City Chiefs Mixon, 26, allegedly said to a woman that he would shoot her in the face His agent, however, issued a tense response saying charges will be dropped Click here for all your latest international Sports news from DailyMail.com By Jack Bezants For Dailymail.Com Published: 00:14, 3 February 2023 | Updated: 03:02, 3 February 2023 e-mail 259 shares 23 View comments An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon on account of aggravated menacing, according to several reports on Thursday night. Court documents say Mixon allegedly pointed a firearm at a woman on January 21 and said: 'You should be popped in the face, I should shoot you, the police can't get me.' The Bengals said in a statement: 'The club is aware misdemeanor charges have been raised against Joe Mixon. The club is investigating the situation and will not comment further at this time.' January 21 was the day before the Bengals beat the Buffalo Bills 27-10 in the playoffs. If Mixon is convicted, he could face up to 180 days in jail and fined according to Ohio's state laws. An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon Mixon allegedly pointed a firearm at a woman's face and said 'I should shoot you' But NFL Network reporter Tom Pelissero claimed Mixon's agent said the accusations will be dropped on Friday morning. He quoted Mixon's agent Peter Schaffer as saying: 'It was a rush judgement. They're dropping the charges first thing in the morning. 'I really feel the police have an obligation before they file charges - because of the damage that can be done to the person's reputation - to do their work. They should be held to a higher standard because I don't play with people's lives.' The 26-year-old Mixon has just completed his sixth season in the NFL. The Bengals were eliminated from the playoffs on Sunday, losing 23-20 to the Kansas City Chiefs, who advance to the Super Bowl to play the Philadelphia Eagles. Mixon rushed 210 times for 814 yards and got seven touchdowns in the 2022 season. Mixon played college football at Oklahoma and was selected by the Bengals in the 2017 draft. In 2014 at Oklahoma, he was suspended for a season after punching a woman, Amelia Molitor, in the face. She was left with a broken jaw and cheekbone and they settled out of court three years later. 'I'm thankful Mia and I were able to talk privately,' Mixon said after the settlement was reached in 2017. 'I was able to apologize to her one-to-one. The incident allegedly occurred the day before Mixon played for the Bengals against the Bills Mixon's current Bengals deal, signed in 2020, runs up to 2024 and is worth $48million 'The way I reacted that night, that's not me. That's not the way I was raised. I think she understands that. 'Talking together helps move us past what happened. I know I have to keep working to be a better person, and this is another step in that direction.' In 2020, he signed a four-year contract extension with the Bengals worth $48m. Share or comment on this article: Police issue arrest warrant for Joe Mixon after he allegedly pointing a firearm at a woman e-mail 259 shares Add comment Comments 23 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 03:02:42","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/00/67274631-0-image-a-16_1675385174885.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever black QB matchup","link":"https://www.dailymail.co.uk/sport/cincinnati-bengals/article-11708357/Patrick-Mahomes-calls-special-battle-Jalen-Hurts-Super-Bowls-black-QB-matchup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Players like Doug Williams and Donovan McNabb have previously paved the way for Mahomes and Hurts, and Mahomes recognizes the significance of him and Hurts facing off.","content":"Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever matchup of black quarterbacks, and says he's in a 'good spot' following high ankle sprain Patrick Mahomes' Chiefs will take on Jalen Hurts' Eagles on February 12 Both teams are 16-3 and Philadelphia are favored by 1.5 points for the game Click here for all your latest international Sports news from DailyMail.com By Jake Nisse For Dailymail.Com Published: 02:49 GMT, 3 February 2023 | Updated: 02:59 GMT, 3 February 2023 e-mail View comments Patrick Mahomes has called it 'special' to face off against Jalen Hurts in the Super Bowl on February 12, in what will be the first ever matchup of two black quarterbacks in the game's history. Players like Doug Williams and Donovan McNabb have previously paved the way for black quarterbacks, and Mahomes recognizes the significance of him and Hurts facing off. 'To be on the world stage and have two black quarterbacks start in the Super Bowl, I think it's special, and I've learned more and more about the history of the Black quarterback since I've been in this league,' Mahomes told reporters Thursday. 'The guys that came before me and Jalen set the stage for this, and now, I'm just glad that we can kind of set the stage for guys that are kids that are coming up now. 'You've seen over time, whenever Doug Williams or Michael Vick, Donovan McNabb go out and play great football, it gives other guys like me and Jalen chances to have this platform and have this spot on an NFL team. Patrick Mahomes recognized the significance of two black quarterbacks facing off next week Jalen Hurts had a tremendous season for the Eagles, who enter the game with a 16-3 record 'And so, if we can continue to show that we can consistently be great, I think it'll just continue to open doors, for other kids growing up to follow their dreams, to be a quarterback of the NFL team. It's good that we have guys like Jalen on the other side. He's a great person and obviously a great quarterback.' Mahomes and Hurts' matchup comes 35 years after Williams became the first black quarterback to start in a Super Bowl. He excelled in that game for Washington, throwing for 340 yards and four touchdowns and leading his team to a 42-10 win. Both Mahomes and Hurts come into the Super Bowl on the back of stellar seasons, as the former led the league in passing yards and touchdowns and the latter earned MVP buzz with his dual-threat prowess. Mahomes suffered a high-ankle sprain in the divisional round vs. the Jaguars, but played last week vs. the Bengals and said he did not aggravate the injury in the AFC Championship. Other than [some general soreness], I feel I'm in a good spot,' he said. Share or comment on this article: Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever black QB matchup e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:59:58","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/02/67277019-0-image-a-57_1675391635867.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Super Bowl: Could Patrick Mahomes be on track to catch Tom Brady, Peyton Manning and Aaron Rodgers?","link":"https://www.dailymail.co.uk/sport/nfl/article-11567543/Super-Bowl-Patrick-Mahomes-track-catch-Tom-Brady-Peyton-Manning-Aaron-Rodgers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mahomes, while he does not have the same level of experience, could already be on track to eclipsing Brady, Manning and Co. after punching his ticket to Super Bowl LVII against the Philadelphia Eagles.","content":"After leading the Chiefs to their third Super Bowl in four years and one ring already on his finger, could Patrick Mahomes be on track to catch - and even surpass - Tom Brady, Peyton Manning and Aaron Rodgers as one of the NFL's best? Patrick Mahomes is heading to his third Super Bowl appearance with the Chiefs The Kansas City QB could match Tom Brady, Peyton manning and Aaron Rodgers Click here for all your latest international Sports news from DailyMail.com By Isabel Baldwin For Dailymail.Com Published: 02:55, 3 February 2023 | Updated: 02:55, 3 February 2023 e-mail 2 View comments With seven Super Bowl titles, the most in NFL history, no one can come close to Tom Brady and his GOAT status, yet. But Patrick Mahomes, in his fifth season as the Kansas City Chiefs starting quarterback, could be on track to at least put up a challenge and catch the star, as well as NFL veterans Aaron Rodgers and Peyton Manning. Brady was in familiar territory on January 16 with none better in NFL history than the Bucs quarterback in the postseason - but Tampa Bay and the veteran's playoff run came to a crashing end in the wild card round. Kansas City's Patrick Mahomes (right) could be on track to challenge Tom Brady (left) and Co. Meanwhile, Rodgers’ Super Bowl hopes came to an end before the playoffs even began as the Green Bay Packers agonizingly missed out on the final day of the regular season. And Manning is quite content talking about football from his sofa on Manning-cast, rather than playing these days. Meanwhile, although he does not have the same level of experience at age 27, Mahomes could already be on track to eclipsing them all after punching his ticket to Super Bowl LVII against the Philadelphia Eagles. After his recent playoff performances and the Chiefs' third Super Bowl appearance in four years on the horizon, the statistics seem to spell out a bright narrative for the future. He threw for two touchdowns against the Cincinnati Bengals in the AFC Championship - his fifth consecutive as a starter - Sunday and when his team needed him most, he scampered for five yards and drew a flag for a late hit to set up Harrison Butker’s 45-yard game-winning field goal - all on a high ankle sprain. Mahomes led the Chiefs to their third Super Bowl appearance in four years on Sunday The 27-year-old threw for two touchdowns and crucially scrambled to set up the winning kick Mahomes, in just five trips to the playoffs in five seasons in the league so far, has recorded a completion percentage of 66.7, has thrown for 32 touchdowns and 3,902 yards and has a rating of 106.1. In comparison, Brady threw just 20 touchdowns in his first four seasons in the playoffs and 3,217 yards. Brady has played more postseason games than any player in NFL history with 48. Following this season, he has a passer rating of 89.8, has thrown 88 touchdowns and has thrown for 13,400 yards in the playoffs alone. But on average in the postseason, Brady's pass completion rate is 62.5 percent and while he has won more AFC Championship games than he has lost, it suggests that he has often had to rely on a team performance to rally through. Veteran Brady has played more postseason games than any player in NFL history with 48 Brady led the Buccaneers to victory over Mahomes's Kansas City Chiefs at Super Bowl LV Manning during his time with both the Indianapolis Colts and Denver Broncos registered a passer rate of 87.4 and a completion rate of 63.2 percent. Rodgers, while achieving back-to-back MVP awards last year thanks to the help of psychedelic drug ayahuasca, has played significantly less games in the playoffs than Brady and Manning across his 18-season career - and only nine more than Mahomes has already racked up. Peyton Manning won one Super Bowl with the Colts in 2007 and another with the Broncos in 2016 Through 22 games, he does have a slightly better passer rating and completion rate than Brady and Manning with 100.1 and 64.7 percent but it still fails to quite match Mahomes. In his 13 games in the postseason so far Mahomes has an average of 300 yards per game and 21 yards more than Brady's average, 29 more than Manning and 32 more than Rodgers. Furthermore, Mahomes has just seven interceptions to his 28 touchdowns meaning his touchdown to interceptions ratio of 4.1 absolutely obliterates Brady's of 2.2 over his playoffs career. The postseason figures can be examined to death but every player and fan knows there's one thing that means the most - the Super Bowl. Incredible postseason performances can mean nothing if a player ultimately cannot wrap up their playoff charge with a ring. The greatest win when it counts the most, and that's exactly what Brady has done - seven times. Packers quarterback Aaron Rodgers won back-to-back MVP award at the end of last season Manning has two Super Bowl wins to his name from the 2006 and 2015 seasons, while Rodgers has just the one ring - the same number that Mahomes already has. Mahomes has clinched the one but also knows the bitter disappointment of having come so close following the Chiefs' 2021 defeat to Brady’s Bucs. Yet, he will have another shot at a ring and the chance to level manning and surpass Rodgers in Arizona on February 12. And it's not just that star trio that Mahomes is catching up. In fact, he has already surpassed some NFL Hall of Famers, having more passing touchdowns than John Elway, Steve Young, Troy Aikman, and Roger Staubach. Mahomes is already showing he can match the best in the regular season too. Mahomes has started his career by putting up passing numbers like no other player in NFL history. Mahomes already has one ring to his names after Kansas City won Super Bowl LIV Mahomes had the 37th 300-yard passing game of his career against the LA Chargers on November 20th, which ties the record for the most 300-yard games in a player's first seven NFL seasons. Dan Marino, with 37 300-yard games from 1983 to 1989, has owned the record since the 1980s. This is only Mahomes' sixth NFL season, and he only played in one game as a rookie, meaning he has reached 37 300-yard games far faster than Marino did. Mahomes had started 73 games in his career before hitting that mark; Marino got his 37th 300-yard game in his 101st career start. Mahomes then surpassed Marino’s 37 by hitting four more 300-yard games before the end of the regular season, taking his total to 41. Now in his fifth season as the Chiefs' starting quarterback, over the last four seasons (2018-2021), Mahomes led the league in both passing yards (18,707) and touchdown passes (151). Mahomes tied Dan Marino's record for most 300-yard games in a player's first seven seasons He has also led the Chiefs to their seventh straight AFC West Title after they beat the Houston Texans in overtime on December 18 before heading their charge through the playoffs to the AFC Championship crown and a Super Bowl spot. Even Brady has admitted that he would currently struggle to replicate what Mahomes is doing in the league. On his Let's Go! podcast earlier in the season, Brady said: 'Then I see other players, let's say like Patrick Mahomes or today's Lamar Jackson. I go, 'f***, I can't do any of that.' How did they do that? It blows me away because however they're playing, I don't see the game the way they see it.' Even Brady has admitted that he would currently struggle to replicate what Mahomes is doing Mahomes has also garnered comparisons to Brady and Manning from his peers, most recently from Bengals wide receiver Tyler Boyd. Boyd likened Mahomes vs. Cincinnati quarterback Joe Burrow to the rivalry between Brady and Manning ahead of the pair's clash during the Bengals' 27-24 win over Kansas City on December 4. Mahomes and the Chiefs beat the Bengals in a thrilling 23-20 AFC Championship game in the dying seconds on Sunday. 'It's going back to that quarterback fight. I look at it like Manning and Brady,' Boyd said. 'You can't stop them. It comes down to whoever excels and takes advantage of their opportunities in drives and scores points. These are the types of games that we have to take care of the football and not turn it over.' Mahomes and Bengals' Joe Burrow (right) have garnered comparisons to Brady and Manning Mahomes has often shot down these comparisons in the past due to the early stages of their careers. And he has a point, he has a long way to go to match the longevity and success of Brady and Manning’s careers - but this could be just the start. Mahomes has a long career ahead of him and say he plays another 11 years, taking him to age 38, based on the figures he has already posted, he could be sitting on around 90 postseason touchdown passes. The current holder of that record - to no one's surprise - is Brady with 88. With one SuperBowl win under his belt at just age 27, Mahomes has already shown he has the talent and potential to add more, not just on February 12 but beyond, and could even threaten Brady's seven. Share or comment on this article: Super Bowl: Could Patrick Mahomes be on track to catch Tom Brady, Peyton Manning and Aaron Rodgers? e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:55:06","image_url":"https://i.dailymail.co.uk/1s/2023/01/31/21/67181699-0-image-a-19_1675201808921.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Fernandez set for Chelsea debut, Arsenal renew title charge","link":"https://www.thephuketnews.com/fernandez-set-for-chelsea-debut-arsenal-renew-title-charge-87040.php","keywords":null,"creator":null,"video_url":null,"description":"FOOTBALL: The clock is ticking for Chelsea manager Graham Potter to turn unprecedented spending into results, starting against Fulham this evening (Feb 3), as new Everton manager Sean Dyche prepares for a baptism of fire against Premier League leaders Arsenal.","content":"Jurgen Klopp’s Liverpool travel to face struggling Wolves, desperate to pull themselves out of a slump that has left them playing catch-up, while Tottenham host champions Manchester City. British-record signing Enzo Fernandez, a World Cup winner with Argentina last December, could make his debut at Stamford Bridge in the west London derby after completing a £107 million (B4.3 billion) move from Benfica. Mykhailo Mudryk is also in line for his first start since joining from Shakhtar Donetsk in a blockbuster January transfer window for the club for a fee that could rise to 100mn euros (B3.6bn). Chelsea’s overall spend in their first season under new ownership fronted by LA Dodgers co-owner Todd Boehly has now surpassed £500mn but the Blues are languishing in 10 th in the Premier League table, 10 points off the top four. Potter admits he has a challenge on his hands to keep all his stars happy as he tries to turn Chelsea’s fortunes around. “We have to create an environment where there’s healthy competition and they can push each other,” Potter said yesterday. “There’s going to be frustration at times because only 11 can play. “But we’ve got a lot of important games and we need to improve our results so it’s about playing, supporting the team and being ready to play.” Marco Silva’s Fulham beat Chelsea for the first time since 2006 when the sides met last month at Craven Cottage and are above their illustrious neighbours in the table. Another victory for the white half of west London would secure a first-ever league double over Chelsea in a single season. Dyche’s daunting debut The contrast in mood between Arsenal and Everton fans could hardly be starker ahead of their meeting at Goodison Park tomorrow. Arsenal are on course for a first league title since 2003/04 with the luxury of a five-point lead over Manchester City and a game in hand. The Gunners will be hoping their January business is enough to get them over the line despite missing out on their top two targets - Mudryk and Brighton’s Moises Caicedo. Jorginho’s arrival from Chelsea this week adds depth and an old head to Mikel Arteta’s young squad while Leandro Trossard boosts his attacking options. Everton were the only Premier League club not to make a January signing and former Burnley boss Sean Dyche knows he has a mountain to climb. The Toffees’ 69-year stay in the English top flight is at severe risk and further protests from supporters against the club’s board are planned for after the match. “There’s a big challenge ahead but one I’m ready for and want to take on,” Dyche told Everton TV. “We want to change the shape of this club going forwards, remodel it in our style, but remodel it in a way we can win.” Guardiola’s Cancelo culture Manchester City manager Pep Guardiola showed his ruthless streak as Joao Cancelo was allowed to move on loan to Bayern Munich this week. The Portuguese full-back was an important figure in City’s title wins over the past two seasons but his departure is further evidence that Guardiola is trying to spark a reaction from his squad. He questioned whether his side had the hunger to hunt down Arsenal despite a dramatic comeback from 2-0 down to beat Tottenham 4-2 last month. Now Guardiola has gambled, knowing that his daring call on Cancelo leaves him short on full-back options for the rest of the season. City might be eight points behind the leaders before Sunday’s game against Spurs, who could be without manager Antonio Conte after he underwent surgery to remove his gallbladder, but they have title-winning nous and enviable strength in depth. Fixtures (all Phuket times) Saturday Chelsea v Fulham (3am) Everton v Arsenal (7:30pm) Aston Villa v Leicester (10pm) Brentford v Southampton (10pm) Brighton v Bournemouth (10pm) Man Utd v Crystal Palace (10pm) Wolves v Liverpool (10pm) Sunday Newcastle v West Ham (12:30am) Nottingham Forest v Leeds (9pm) Tottenham v Man City (11:30pm)","pubDate":"2023-02-03 02:43:00","image_url":" \n\t\t","source_id":"thephuketnews","category":["sports"],"country":["thailand"],"language":"english"},{"title":"Glamorous Aston Villa star Alisha Lehmann beats tennis legend Roger Federer in popularity contest","link":"https://www.dailymail.co.uk/sport/football/article-11707979/Glamorous-Aston-Villa-star-Alisha-Lehmann-beats-tennis-legend-Roger-Federer-popularity-contest.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Retired tennis legend Roger Federer is not used to second place, but he has been handed an unflattering L on the social media stage with a little known football player usurping him at the top.","content":"How a glamorous 24-year-old football star you've never heard of beat tennis legend Roger Federer into second place in sporting popularity contest Alisha Lehmann is the most popular Swiss athlete on Instagram She pips Federer who recently retired with 20 grand slam titles Lehmann posts sometimes raunchy images to her account By Josh Alston For Daily Mail Australia Published: 21:37 EST, 2 February 2023 | Updated: 21:38 EST, 2 February 2023 e-mail View comments Retired tennis legend Roger Federer is not used to finishing in second place, but he has been handed an unflattering loss on the social media stage with a little-known football player usurping him at the top. Along with his 20 Grand Slam singles titles, a career Grand Slam (winning all four Grand Slams at least once) and 103 ATP singles titles including 20 major titles, Federer was also the Swiss king of Instagram. However, he has now surrendered that title with glamourous Aston Villa star Alisha Lehmann now taking the mantle as the most followed Swiss sports star on the platform. Not even cutting a striking figure at the Christian Dior Haute Couture Spring Summer 2023 show as part of Paris Fashion Week could help Federer remain top spot on social media Lehmann plays for Aston Villa and the Switzerland national team and has become the most popular Swiss personality on Instagram, overtaking the grand slam icon The Aston Villa star also posts a range of glamourous and raunchy photos to her social media The great Federer has 11.2m followers on the platform while Lehmann has now overtaken him with 11.4m fans. While there are plenty of images of Lehmann plying her trade in the English FA Women's National League on her profile, she has something that Federer will never match: a raunchy side. She has posted bikini photos of herself in glamorous locations around the world like Miami and Rio de Janeiro . The footballer recently became single after splitting from fellow Aston Villa star Douglas Luiz, and her 2023 calendar has probably helped boost her online profile as well. Lehmann has notched 32 appearances for Aston Villa and has also played eight games for Everton and 42 matches for West Ham United Images like this, taken at Miami Beach, have earned Lehmann plenty of praise with one follower commenting: 'I was looking for the meaning of perfection and I found this' Lehmann also once dated former Chelsea Women's star Ramona Bachmann. Fellow Swiss tennis stars Stan Wawrinka (1.2 million followers), rising tennis star Belinda Bencic (427k followers) and the retired Martina Hingis (313k Followers) fall well behind Federer and Lehmann. In other sports Arsenal midfielder Granit Xhaka (2.9 million followers), popular alpine skiing star Marco Odermatt (237K followers), track sprinter Mujinga Kambundji (133K followers) were also well down the pecking order. And while Lehmann has dethroned Federer on the Swiss stage, she has work some to do to catch the global Instagram leaders. Federer has 20 grand slams and signed off from international tennis with a classy letter to his supporters on Instagram (pictured below) View this post on Instagram A post shared by Roger Federer (@rogerfederer) Former Portugal , Manchester United and Real Madrid star Cristiano Ronaldo - who now plays for Saudi Professional League club Al Nassr - tops all athletes with more than 520million followers. It is one area where he trumps great rival Lionel Messi, who comes in second with 406million - although he does have a World Cup victory to his name. While technically no longer an athlete, former WWE star Dwayne 'The Rock' Johnson is third with 354million followers, with Indian cricket hero Virat Kohli (228million) and Brazillian football star Neymar Jr (197million) rounding out the top five. Share or comment on this article: Glamorous Aston Villa star Alisha Lehmann beats tennis legend Roger Federer in popularity contest e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:38:04","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/01/67274975-0-image-a-40_1675386190151.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am","link":"https://247newsaroundtheworld.com/sports/gareth-bale-shows-off-his-incredible-golfing-ability-at-the-pebble-beach-pro-am/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Gareth Bale shows off his incredible golfing ability at the Pebble Beach… The post Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am appeared first on 247 News Around The World.","content":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am by nearly holing out from the CART PATH – after Jon Rahm was left amazed at his game… while Bills QB Josh Allen gets off to a great start in his group By Jake Fenner For Dailymail.Com Published: 13:34 EST, 2 February 2023 | Updated: 20:44 EST, 2 February 2023 Gareth Bale impressed with his golfing skill during the opening round of the Pebble Beach Pro-Am in California. Facing a shot off the greenside cart path, Bale pulled his wedge out to try and land the ball softly near the cup. He bounced the ball off the edge of the pavement – sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green and then softly rolled and settled for a short putt. Meanwhile, fellow athlete and NFL quarterback Josh Allen began his day with a great drive with his group playing on the nearby Spyglass Hill course. Gareth Bale impressed with a miraculous cart path save at the Pebble Beach Pro-Am Bale bounced the ball off the edge, sending the ball sailing over the rough and on the green See also Tottenham complete loan signing of Pedro Porro with view to £40million permanent transfer from Sporting Lisbon after resurrecting collapsed on deadline day Allen surprised NFL fans by turning up to this event, just days after saying that he would be skipping the Pro Bowl Games. The quarterback said that he’d be sitting out the festivities in Las Vegas due to an elbow injury. Bale just recently announced his retirement from professional football, just months after he led Wales in their first World Cup since 1958. Last week, Bale took part in another Pro-Am just before the Farmers Insurance Open teed off at Torrey Pines in San Diego. His play drew praise from Spanish golfer Jon Rahm – who said it ‘doesn’t seem fair’ that Bale is ‘so good at football and golf’. Bale’s love of golf is well known and he is said to have a three-hole golf course at his house but the hobby had been a controversial issue during his soccer career. It was a source on contempt in particular during his time with Real Madrid, where he won five Champions League titles. He posed, while on international duty with Wales, with a banner that read, ‘Wales. Golf. Madrid. In That Order’ – a move which sparked a backlash among supporters of the club. Allen surprised many NFL fans by spurning the Pro Bowl to play at this year’s golf tournament See also Sportsman arrested in Ireland, suspected of passing police intel from corrupt cops to gangs Share or comment on this article: Post source: Daily mail","pubDate":"2023-02-03 02:33:22","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Benfica manager Roger Schmidt insists the club are bigger than Enzo Fernandez and he only wants players who are ‘happy to play’ after £106.8m Chelsea transfer","link":"https://247newsaroundtheworld.com/sports/benfica-manager-roger-schmidt-insists-the-club-are-bigger-than-enzo-fernandez-and-he-only-wants-players-who-are-happy-to-play-after-106-8m-chelsea-transfer/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Benfica boss Roger Schmidt has sent a dig to Enzo Fernandez after… The post Benfica manager Roger Schmidt insists the club are bigger than Enzo Fernandez and he only wants players who are ‘happy to play’ after £106.8m Chelsea transfer appeared first on 247 News Around The World.","content":"Benfica boss Roger Schmidt has sent a dig to Enzo Fernandez after he completed his British transfer record move to Chelsea. The 22-year-old signed for the Blues in the final hours of deadline day for a fee of £106.8million. AFP Schmidt is not happy with Fernandez Getty The 22-year-old is on his way to Chelsea He only joined Benfica in the summer from River Plate but has already moved on to pastures new following his World Cup win with Argentina. However, after Benfica’s 3-0 against Arouca on Tuesday night, his former boss Schmidt was not slow to criticise the midfielder. He said: “It’s always difficult to lose a good player in the winter market, but today we showed that we are a good team without him, that we are capable of playing good football without him, that the players are focused on getting the most points, to be champions. “Benfica is much bigger than a player. We just need players who are happy to play for Benfica, who are passionate. “We had a player who wanted to leave and a club willing to pay the clause, we couldn’t do anything. We accepted and looked ahead.” Fernandez emerged as one of football’s brightest talents in Qatar when he won the World Cup’s Young Player of the Tournament award. CHELSEAFC.COM Chelsea will soon welcome their new record signing Getty He helped Argentina win the World Cup in Qatar Greenwood latest, Martinelli ‘signs new Arsenal deal’, Ayew snubs Everton for Forest Man United forward Mason Greenwood has all criminal charges against him dropped Man United forward Greenwood breaks silence after criminal charges are dropped Manchester United statement after criminal charges against Mason Greenwood are dropped Arsenal star Tomiyasu reveals ‘aggressive’ forward he least enjoys facing in training Why one Newcastle player will only secure Carabao Cup winners’ medal if Man United win He made 29 appearances for Benfica but will soon arrive at Chelsea as their eighth arrival of the January window. Fernandez’s move is also a British transfer record, surpassing Jack Grealish’s £100million transfer from Aston Villa to Manchester City. The midfield star will join a Chelsea team who sit tenth in the Premier League table. Graham Potter’s side will need a big push in the second half of the season if they are to finish in the top four. talkSPORT BET OFFER OF THE DAY Get up to £40 in free bets* – CLAIM HERE 18+ New customers only. Opt in, bet up to £40 (min. £20) on selected events at odds of 2.00+, in 7 days. Get up to £40 in free bets on selected events. Bonuses expire in 7 days. Card payments only. T&Cs apply, see below. begambleaware.org | Please gamble responsibly SEE ALL FREE BETS HERE See also Newcastle complete the signing of Anthony Gordon for £40m - plus £5m in add-ons","pubDate":"2023-02-03 01:45:47","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am","link":"https://www.dailymail.co.uk/sport/golf/article-11707073/Gareth-Bale-shows-incredible-golfing-ability-Josh-Allen-forgets-sport-hes-playing.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"He bounced the ball off the edge of the pavement - sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green.","content":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am by nearly holing out from the CART PATH - after Jon Rahm was left amazed at his game... while Bills QB Josh Allen gets off to a great start in his group Gareth Bale has had plenty of time to work on his golf game since retirement Meanwhile, Josh Allen drove the ball well after skipping the NFL's Pro Bowl Click here for all your latest international Sports news from DailyMail.com By Jake Fenner For Dailymail.Com Published: 18:34 GMT, 2 February 2023 | Updated: 01:44 GMT, 3 February 2023 e-mail 124 shares 29 View comments Gareth Bale impressed with his golfing skill during the opening round of the Pebble Beach Pro-Am in California . Facing a shot off the greenside cart path, Bale pulled his wedge out to try and land the ball softly near the cup. He bounced the ball off the edge of the pavement - sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green and then softly rolled and settled for a short putt. Meanwhile, fellow athlete and NFL quarterback Josh Allen began his day with a great drive with his group playing on the nearby Spyglass Hill course. Multi-sport athlete ⚽️ The cart path is no problem @GarethBale11 . pic.twitter.com/7EOuM3IE4M — PGA TOUR (@PGATOUR) February 2, 2023 Gareth Bale impressed with a miraculous cart path save at the Pebble Beach Pro-Am Bale bounced the ball off the edge, sending the ball sailing over the rough and on the green Allen surprised NFL fans by turning up to this event , just days after saying that he would be skipping the Pro Bowl Games. The quarterback said that he'd be sitting out the festivities in Las Vegas due to an elbow injury. Bale just recently announced his retirement from professional football, just months after he led Wales in their first World Cup since 1958. Last week, Bale took part in another Pro-Am just before the Farmers Insurance Open teed off at Torrey Pines in San Diego. His play drew praise from Spanish golfer Jon Rahm - who said it 'doesn't seem fair' that Bale is 'so good at football and golf'. Bale's love of golf is well known and he is said to have a three-hole golf course at his house but the hobby had been a controversial issue during his soccer career. It was a source on contempt in particular during his time with Real Madrid, where he won five Champions League titles. He posed, while on international duty with Wales, with a banner that read, 'Wales. Golf. Madrid. In That Order' - a move which sparked a backlash among supporters of the club. Allen surprised many NFL fans by spurning the Pro Bowl to play at this year's golf tournament Starting strong 💪 @JoshAllenQB is off to a hot start after his opening tee shot @ATTProAm . pic.twitter.com/iDKa67XU2V — PGA TOUR (@PGATOUR) February 2, 2023 Share or comment on this article: Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am e-mail 124 shares Add comment Comments 29 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 01:44:27","image_url":"https://i.dailymail.co.uk/1s/2023/02/02/18/67263595-0-image-a-8_1675364095598.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Neville apologises for 'clumsy like' on tweet calling Man United's Greenwood an 'innocent man'","link":"https://www.dailymail.co.uk/sport/football/article-11707131/Neville-apologises-clumsy-like-tweet-calling-Man-Uniteds-Greenwood-innocent-man.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against Mason Greenwood were dropped on Thursday.","content":"Gary Neville apologises for 'clumsy like' of a tweet calling Mason Greenwood an 'innocent man' after charges against Man United forward were dropped... with the Red Devils icon insisting he 'obviously condemns' violence against women Pundit Gary Neville has insisted he obviously condemns violence against women Neville liked a tweet calling Man United's Mason Greenwood an 'innocent man' All charges were dropped against United forward Greenwood , 21, on Thursday By Max Mathews For Mailonline Published: 19:47, 2 February 2023 | Updated: 01:39, 3 February 2023 e-mail 304 shares 4 View comments Gary Neville has issued a statement insisting he 'obviously condemns' violence against women - after being criticised for liking a tweet describing Mason Greenwood as an 'innocent man' . Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against M anchester United forward Greenwood were dropped on Thursday , a year after he was arrested. And United icon Neville was criticised online for liking a tweet from former Chief Crown Prosecutor for North West England Nazir Afzal declaring Greenwood's innocence - something he admitted was 'clumsy'. The Sky Sports pundit later tweeted: 'I liked a tweet relating to the Mason Greenwood news this afternoon from Nazir Afzal. (the former director of public prosecutions). 'This like is being misinterpreted. It was a clumsy like as I obviously condemn any violence against women.' Gary Neville has issued a statement saying he 'obviously' condemns violence against women after being criticised for liking tweets about Mason Greenwood's charges being dropped I liked a tweet relating to the Mason Greenwood news this afternoon from Nazir Afzal. ( the former director of public prosecutions ). This like is being misinterpreted. It was a clumsy like as I obviously condemn any violence against women. — Gary Neville (@GNev2) February 2, 2023 Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against the Man United forward were dropped on Thursday The tweets from Afzal read: 'Mason Greenwood has had all charges against him dropped by the Prosecutors. What's changed you may ask? It appears that (some) witnesses will no longer support a prosecution & new evidence came to light It happens He is an innocent man, that's all we need to know. 'You are innocent till PROVEN guilty. We don't have trial by media, We don't have evidence that any witnesses were lying, We don't do 'victim or complainant blaming'. Prosecutors have to be sure there is a realistic prospect of conviction by a jury on the evidence they have. They don't.' Neville has since un-liked those tweets. It is also believed he retweeted one of the tweets but has also since undone that action. A Crown Prosecution Service spokesperson said: 'We have a duty to keep cases under continuous review. In this case a combination of the withdrawal of key witnesses and new material that came to light meant there was no longer a realistic prospect of conviction. 'In these circumstances, we are under a duty to stop the case. We have explained our decision to all parties. We would always encourage any potential victims to come forward and report to police and we will prosecute wherever our legal test is met.' To which United responded: ''Manchester United notes the decision of the Crown Prosecution Service that all charges against Mason Greenwood have been dropped. The club will now conduct its own process before determining next steps. We will not make any further comment until that process is complete.' Greenwood himself said in a statement: 'I am relieved that this matter is now over and I would like to thank my family, loved ones and friends for their support. There will be no further comment at this time.' There are now questions over whether Greenwood will play for the club again . Neville had liked two tweets from Nazir Afzal, one calling Greenwood an 'innocent man' He remains on United's squad list and, in a possible indication he could resume his football career, is still present on the first-team squad page on United's official website. Greenwood was included among Under 21 players on United's official Premier League squad list at the beginning of the season despite being suspended by the club. His biography on the club website makes no mention of the charges against him with the last update mentioning a new contract until 2025 he signed in 2021 and his passing of 100 appearances for the club. The player, who has been capped once for the Three Lions, was first held in January over allegations relating to a young woman, after images and videos were posted online. He was later suspended from United on full pay and removed from the FIFA 22 game. Greenwood last featured for the Red Devils on January 22, 2022, in a 1-0 win over West Ham. He has been suspended by the club since that point. Greenwood's profile remains on United's official website despite the club suspending him The forward is listed alongside other United players on the first-team squad page Greenwood was listed in the Under 21 (Contract and Scholars) section of United's squad list for the Premier League at the beginning of the season Share or comment on this article: Neville apologises for 'clumsy like' on tweet calling Man United's Greenwood an 'innocent man' e-mail 304 shares Add comment Comments 4 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 01:39:11","image_url":"https://i.dailymail.co.uk/1s/2023/02/02/19/67264903-0-image-a-44_1675366059627.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"After 12 months out of football, Greenwood cleared of rape charges","link":"https://guardian.ng/sport/after-12-months-out-of-football-greenwood-cleared-of-rape-charges/","keywords":["Football","Sport","Man United","Mason Greenwood"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Man United footballer, Mason Greenwood, has been cleared of attempted rape and assault charges, reports planetradio.co.uk. The post After 12 months out of football, Greenwood cleared of rape charges appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Man United footballer, Mason Greenwood, has been cleared of attempted rape and assault charges, reports planetradio.co.uk. Charges including attempted rape and assault against Manchester United forward Mason Greenwood have been discontinued by the Crown Prosecution Service, the report said. Greater Manchester Police said criminal proceedings against a 21-year-old man had been discontinued as of February 2. Chief Superintendent, Michaela Kerr, GMP’s head of public protection, said: “Given the significant media coverage of this case, it is only fair that we share the news that the 21-year-old man, who had been arrested and charged in connection with an investigation opened in January 2022, no longer faces criminal proceedings in relation to this. “The investigation team has remained in regular contact with the legal team, providing any updates of note, and so understand the rationale for the discontinuation of proceedings at this stage, and that this decision has not been taken lightly. “Despite the media and public’s interest in this case, we have decided not to comment on it in any further detail.” “I would, however, like to use this opportunity to reiterate GMP’s commitment to investigating allegations of violence against women and girls and supporting those affected, regardless of their circumstances, throughout what can be a hard and upsetting time for them. “An ever increasing number of officers are receiving specialist training and the force is more consistently utilising tools, available via the criminal justice system, to keep people safe and care for victims. “If you feel you are or might be a victim, please don’t let this case put you off asking for help.” During the trial, the Manchester United forward was suspended by the club, with all his privileges withdrawn pending the determination of the case. It is yet unknown whether Manchester United will reabsorb Greenwood into their team. Follow Us","pubDate":"2023-02-03 03:09:01","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Police issue arrest warrant for Joe Mixon after he allegedly pointing a firearm at a woman","link":"https://www.dailymail.co.uk/sport/nfl/article-11708055/Police-issue-arrest-warrant-Joe-Mixon-allegedly-pointing-firearm-woman.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon on account of aggravated menacing, according to several reports on Thursday night.","content":"Cincinnati police issue arrest warrant for Bengals star Joe Mixon after he allegedly pointed a firearm at a woman and said: 'You should be popped in the face, I should shoot you, the police can't get me' - but his furious agent says charges will be DROPPED The incident was allegedly on Jan 21, before the Bengals beat the Buffalo Bills The Bengals season ended at the weekend with defeat by Kansas City Chiefs Mixon, 26, allegedly said to a woman that he would shoot her in the face His agent, however, issued a tense response saying charges will be dropped Click here for all your latest international Sports news from DailyMail.com By Jack Bezants For Dailymail.Com Published: 00:14, 3 February 2023 | Updated: 03:02, 3 February 2023 e-mail 259 shares 23 View comments An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon on account of aggravated menacing, according to several reports on Thursday night. Court documents say Mixon allegedly pointed a firearm at a woman on January 21 and said: 'You should be popped in the face, I should shoot you, the police can't get me.' The Bengals said in a statement: 'The club is aware misdemeanor charges have been raised against Joe Mixon. The club is investigating the situation and will not comment further at this time.' January 21 was the day before the Bengals beat the Buffalo Bills 27-10 in the playoffs. If Mixon is convicted, he could face up to 180 days in jail and fined according to Ohio's state laws. An arrest warrant has been issued for Cincinnati Bengals running back Joe Mixon Mixon allegedly pointed a firearm at a woman's face and said 'I should shoot you' But NFL Network reporter Tom Pelissero claimed Mixon's agent said the accusations will be dropped on Friday morning. He quoted Mixon's agent Peter Schaffer as saying: 'It was a rush judgement. They're dropping the charges first thing in the morning. 'I really feel the police have an obligation before they file charges - because of the damage that can be done to the person's reputation - to do their work. They should be held to a higher standard because I don't play with people's lives.' The 26-year-old Mixon has just completed his sixth season in the NFL. The Bengals were eliminated from the playoffs on Sunday, losing 23-20 to the Kansas City Chiefs, who advance to the Super Bowl to play the Philadelphia Eagles. Mixon rushed 210 times for 814 yards and got seven touchdowns in the 2022 season. Mixon played college football at Oklahoma and was selected by the Bengals in the 2017 draft. In 2014 at Oklahoma, he was suspended for a season after punching a woman, Amelia Molitor, in the face. She was left with a broken jaw and cheekbone and they settled out of court three years later. 'I'm thankful Mia and I were able to talk privately,' Mixon said after the settlement was reached in 2017. 'I was able to apologize to her one-to-one. The incident allegedly occurred the day before Mixon played for the Bengals against the Bills Mixon's current Bengals deal, signed in 2020, runs up to 2024 and is worth $48million 'The way I reacted that night, that's not me. That's not the way I was raised. I think she understands that. 'Talking together helps move us past what happened. I know I have to keep working to be a better person, and this is another step in that direction.' In 2020, he signed a four-year contract extension with the Bengals worth $48m. Share or comment on this article: Police issue arrest warrant for Joe Mixon after he allegedly pointing a firearm at a woman e-mail 259 shares Add comment Comments 23 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 03:02:42","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/00/67274631-0-image-a-16_1675385174885.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever black QB matchup","link":"https://www.dailymail.co.uk/sport/cincinnati-bengals/article-11708357/Patrick-Mahomes-calls-special-battle-Jalen-Hurts-Super-Bowls-black-QB-matchup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Players like Doug Williams and Donovan McNabb have previously paved the way for Mahomes and Hurts, and Mahomes recognizes the significance of him and Hurts facing off.","content":"Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever matchup of black quarterbacks, and says he's in a 'good spot' following high ankle sprain Patrick Mahomes' Chiefs will take on Jalen Hurts' Eagles on February 12 Both teams are 16-3 and Philadelphia are favored by 1.5 points for the game Click here for all your latest international Sports news from DailyMail.com By Jake Nisse For Dailymail.Com Published: 02:49 GMT, 3 February 2023 | Updated: 02:59 GMT, 3 February 2023 e-mail View comments Patrick Mahomes has called it 'special' to face off against Jalen Hurts in the Super Bowl on February 12, in what will be the first ever matchup of two black quarterbacks in the game's history. Players like Doug Williams and Donovan McNabb have previously paved the way for black quarterbacks, and Mahomes recognizes the significance of him and Hurts facing off. 'To be on the world stage and have two black quarterbacks start in the Super Bowl, I think it's special, and I've learned more and more about the history of the Black quarterback since I've been in this league,' Mahomes told reporters Thursday. 'The guys that came before me and Jalen set the stage for this, and now, I'm just glad that we can kind of set the stage for guys that are kids that are coming up now. 'You've seen over time, whenever Doug Williams or Michael Vick, Donovan McNabb go out and play great football, it gives other guys like me and Jalen chances to have this platform and have this spot on an NFL team. Patrick Mahomes recognized the significance of two black quarterbacks facing off next week Jalen Hurts had a tremendous season for the Eagles, who enter the game with a 16-3 record 'And so, if we can continue to show that we can consistently be great, I think it'll just continue to open doors, for other kids growing up to follow their dreams, to be a quarterback of the NFL team. It's good that we have guys like Jalen on the other side. He's a great person and obviously a great quarterback.' Mahomes and Hurts' matchup comes 35 years after Williams became the first black quarterback to start in a Super Bowl. He excelled in that game for Washington, throwing for 340 yards and four touchdowns and leading his team to a 42-10 win. Both Mahomes and Hurts come into the Super Bowl on the back of stellar seasons, as the former led the league in passing yards and touchdowns and the latter earned MVP buzz with his dual-threat prowess. Mahomes suffered a high-ankle sprain in the divisional round vs. the Jaguars, but played last week vs. the Bengals and said he did not aggravate the injury in the AFC Championship. Other than [some general soreness], I feel I'm in a good spot,' he said. Share or comment on this article: Patrick Mahomes calls it 'special' to battle Jalen Hurts in Super Bowl's first ever black QB matchup e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:59:58","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/02/67277019-0-image-a-57_1675391635867.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Super Bowl: Could Patrick Mahomes be on track to catch Tom Brady, Peyton Manning and Aaron Rodgers?","link":"https://www.dailymail.co.uk/sport/nfl/article-11567543/Super-Bowl-Patrick-Mahomes-track-catch-Tom-Brady-Peyton-Manning-Aaron-Rodgers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Mahomes, while he does not have the same level of experience, could already be on track to eclipsing Brady, Manning and Co. after punching his ticket to Super Bowl LVII against the Philadelphia Eagles.","content":"After leading the Chiefs to their third Super Bowl in four years and one ring already on his finger, could Patrick Mahomes be on track to catch - and even surpass - Tom Brady, Peyton Manning and Aaron Rodgers as one of the NFL's best? Patrick Mahomes is heading to his third Super Bowl appearance with the Chiefs The Kansas City QB could match Tom Brady, Peyton manning and Aaron Rodgers Click here for all your latest international Sports news from DailyMail.com By Isabel Baldwin For Dailymail.Com Published: 02:55, 3 February 2023 | Updated: 02:55, 3 February 2023 e-mail 2 View comments With seven Super Bowl titles, the most in NFL history, no one can come close to Tom Brady and his GOAT status, yet. But Patrick Mahomes, in his fifth season as the Kansas City Chiefs starting quarterback, could be on track to at least put up a challenge and catch the star, as well as NFL veterans Aaron Rodgers and Peyton Manning. Brady was in familiar territory on January 16 with none better in NFL history than the Bucs quarterback in the postseason - but Tampa Bay and the veteran's playoff run came to a crashing end in the wild card round. Kansas City's Patrick Mahomes (right) could be on track to challenge Tom Brady (left) and Co. Meanwhile, Rodgers’ Super Bowl hopes came to an end before the playoffs even began as the Green Bay Packers agonizingly missed out on the final day of the regular season. And Manning is quite content talking about football from his sofa on Manning-cast, rather than playing these days. Meanwhile, although he does not have the same level of experience at age 27, Mahomes could already be on track to eclipsing them all after punching his ticket to Super Bowl LVII against the Philadelphia Eagles. After his recent playoff performances and the Chiefs' third Super Bowl appearance in four years on the horizon, the statistics seem to spell out a bright narrative for the future. He threw for two touchdowns against the Cincinnati Bengals in the AFC Championship - his fifth consecutive as a starter - Sunday and when his team needed him most, he scampered for five yards and drew a flag for a late hit to set up Harrison Butker’s 45-yard game-winning field goal - all on a high ankle sprain. Mahomes led the Chiefs to their third Super Bowl appearance in four years on Sunday The 27-year-old threw for two touchdowns and crucially scrambled to set up the winning kick Mahomes, in just five trips to the playoffs in five seasons in the league so far, has recorded a completion percentage of 66.7, has thrown for 32 touchdowns and 3,902 yards and has a rating of 106.1. In comparison, Brady threw just 20 touchdowns in his first four seasons in the playoffs and 3,217 yards. Brady has played more postseason games than any player in NFL history with 48. Following this season, he has a passer rating of 89.8, has thrown 88 touchdowns and has thrown for 13,400 yards in the playoffs alone. But on average in the postseason, Brady's pass completion rate is 62.5 percent and while he has won more AFC Championship games than he has lost, it suggests that he has often had to rely on a team performance to rally through. Veteran Brady has played more postseason games than any player in NFL history with 48 Brady led the Buccaneers to victory over Mahomes's Kansas City Chiefs at Super Bowl LV Manning during his time with both the Indianapolis Colts and Denver Broncos registered a passer rate of 87.4 and a completion rate of 63.2 percent. Rodgers, while achieving back-to-back MVP awards last year thanks to the help of psychedelic drug ayahuasca, has played significantly less games in the playoffs than Brady and Manning across his 18-season career - and only nine more than Mahomes has already racked up. Peyton Manning won one Super Bowl with the Colts in 2007 and another with the Broncos in 2016 Through 22 games, he does have a slightly better passer rating and completion rate than Brady and Manning with 100.1 and 64.7 percent but it still fails to quite match Mahomes. In his 13 games in the postseason so far Mahomes has an average of 300 yards per game and 21 yards more than Brady's average, 29 more than Manning and 32 more than Rodgers. Furthermore, Mahomes has just seven interceptions to his 28 touchdowns meaning his touchdown to interceptions ratio of 4.1 absolutely obliterates Brady's of 2.2 over his playoffs career. The postseason figures can be examined to death but every player and fan knows there's one thing that means the most - the Super Bowl. Incredible postseason performances can mean nothing if a player ultimately cannot wrap up their playoff charge with a ring. The greatest win when it counts the most, and that's exactly what Brady has done - seven times. Packers quarterback Aaron Rodgers won back-to-back MVP award at the end of last season Manning has two Super Bowl wins to his name from the 2006 and 2015 seasons, while Rodgers has just the one ring - the same number that Mahomes already has. Mahomes has clinched the one but also knows the bitter disappointment of having come so close following the Chiefs' 2021 defeat to Brady’s Bucs. Yet, he will have another shot at a ring and the chance to level manning and surpass Rodgers in Arizona on February 12. And it's not just that star trio that Mahomes is catching up. In fact, he has already surpassed some NFL Hall of Famers, having more passing touchdowns than John Elway, Steve Young, Troy Aikman, and Roger Staubach. Mahomes is already showing he can match the best in the regular season too. Mahomes has started his career by putting up passing numbers like no other player in NFL history. Mahomes already has one ring to his names after Kansas City won Super Bowl LIV Mahomes had the 37th 300-yard passing game of his career against the LA Chargers on November 20th, which ties the record for the most 300-yard games in a player's first seven NFL seasons. Dan Marino, with 37 300-yard games from 1983 to 1989, has owned the record since the 1980s. This is only Mahomes' sixth NFL season, and he only played in one game as a rookie, meaning he has reached 37 300-yard games far faster than Marino did. Mahomes had started 73 games in his career before hitting that mark; Marino got his 37th 300-yard game in his 101st career start. Mahomes then surpassed Marino’s 37 by hitting four more 300-yard games before the end of the regular season, taking his total to 41. Now in his fifth season as the Chiefs' starting quarterback, over the last four seasons (2018-2021), Mahomes led the league in both passing yards (18,707) and touchdown passes (151). Mahomes tied Dan Marino's record for most 300-yard games in a player's first seven seasons He has also led the Chiefs to their seventh straight AFC West Title after they beat the Houston Texans in overtime on December 18 before heading their charge through the playoffs to the AFC Championship crown and a Super Bowl spot. Even Brady has admitted that he would currently struggle to replicate what Mahomes is doing in the league. On his Let's Go! podcast earlier in the season, Brady said: 'Then I see other players, let's say like Patrick Mahomes or today's Lamar Jackson. I go, 'f***, I can't do any of that.' How did they do that? It blows me away because however they're playing, I don't see the game the way they see it.' Even Brady has admitted that he would currently struggle to replicate what Mahomes is doing Mahomes has also garnered comparisons to Brady and Manning from his peers, most recently from Bengals wide receiver Tyler Boyd. Boyd likened Mahomes vs. Cincinnati quarterback Joe Burrow to the rivalry between Brady and Manning ahead of the pair's clash during the Bengals' 27-24 win over Kansas City on December 4. Mahomes and the Chiefs beat the Bengals in a thrilling 23-20 AFC Championship game in the dying seconds on Sunday. 'It's going back to that quarterback fight. I look at it like Manning and Brady,' Boyd said. 'You can't stop them. It comes down to whoever excels and takes advantage of their opportunities in drives and scores points. These are the types of games that we have to take care of the football and not turn it over.' Mahomes and Bengals' Joe Burrow (right) have garnered comparisons to Brady and Manning Mahomes has often shot down these comparisons in the past due to the early stages of their careers. And he has a point, he has a long way to go to match the longevity and success of Brady and Manning’s careers - but this could be just the start. Mahomes has a long career ahead of him and say he plays another 11 years, taking him to age 38, based on the figures he has already posted, he could be sitting on around 90 postseason touchdown passes. The current holder of that record - to no one's surprise - is Brady with 88. With one SuperBowl win under his belt at just age 27, Mahomes has already shown he has the talent and potential to add more, not just on February 12 but beyond, and could even threaten Brady's seven. Share or comment on this article: Super Bowl: Could Patrick Mahomes be on track to catch Tom Brady, Peyton Manning and Aaron Rodgers? e-mail Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:55:06","image_url":"https://i.dailymail.co.uk/1s/2023/01/31/21/67181699-0-image-a-19_1675201808921.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Fernandez set for Chelsea debut, Arsenal renew title charge","link":"https://www.thephuketnews.com/fernandez-set-for-chelsea-debut-arsenal-renew-title-charge-87040.php","keywords":null,"creator":null,"video_url":null,"description":"FOOTBALL: The clock is ticking for Chelsea manager Graham Potter to turn unprecedented spending into results, starting against Fulham this evening (Feb 3), as new Everton manager Sean Dyche prepares for a baptism of fire against Premier League leaders Arsenal.","content":"Jurgen Klopp’s Liverpool travel to face struggling Wolves, desperate to pull themselves out of a slump that has left them playing catch-up, while Tottenham host champions Manchester City. British-record signing Enzo Fernandez, a World Cup winner with Argentina last December, could make his debut at Stamford Bridge in the west London derby after completing a £107 million (B4.3 billion) move from Benfica. Mykhailo Mudryk is also in line for his first start since joining from Shakhtar Donetsk in a blockbuster January transfer window for the club for a fee that could rise to 100mn euros (B3.6bn). Chelsea’s overall spend in their first season under new ownership fronted by LA Dodgers co-owner Todd Boehly has now surpassed £500mn but the Blues are languishing in 10 th in the Premier League table, 10 points off the top four. Potter admits he has a challenge on his hands to keep all his stars happy as he tries to turn Chelsea’s fortunes around. “We have to create an environment where there’s healthy competition and they can push each other,” Potter said yesterday. “There’s going to be frustration at times because only 11 can play. “But we’ve got a lot of important games and we need to improve our results so it’s about playing, supporting the team and being ready to play.” Marco Silva’s Fulham beat Chelsea for the first time since 2006 when the sides met last month at Craven Cottage and are above their illustrious neighbours in the table. Another victory for the white half of west London would secure a first-ever league double over Chelsea in a single season. Dyche’s daunting debut The contrast in mood between Arsenal and Everton fans could hardly be starker ahead of their meeting at Goodison Park tomorrow. Arsenal are on course for a first league title since 2003/04 with the luxury of a five-point lead over Manchester City and a game in hand. The Gunners will be hoping their January business is enough to get them over the line despite missing out on their top two targets - Mudryk and Brighton’s Moises Caicedo. Jorginho’s arrival from Chelsea this week adds depth and an old head to Mikel Arteta’s young squad while Leandro Trossard boosts his attacking options. Everton were the only Premier League club not to make a January signing and former Burnley boss Sean Dyche knows he has a mountain to climb. The Toffees’ 69-year stay in the English top flight is at severe risk and further protests from supporters against the club’s board are planned for after the match. “There’s a big challenge ahead but one I’m ready for and want to take on,” Dyche told Everton TV. “We want to change the shape of this club going forwards, remodel it in our style, but remodel it in a way we can win.” Guardiola’s Cancelo culture Manchester City manager Pep Guardiola showed his ruthless streak as Joao Cancelo was allowed to move on loan to Bayern Munich this week. The Portuguese full-back was an important figure in City’s title wins over the past two seasons but his departure is further evidence that Guardiola is trying to spark a reaction from his squad. He questioned whether his side had the hunger to hunt down Arsenal despite a dramatic comeback from 2-0 down to beat Tottenham 4-2 last month. Now Guardiola has gambled, knowing that his daring call on Cancelo leaves him short on full-back options for the rest of the season. City might be eight points behind the leaders before Sunday’s game against Spurs, who could be without manager Antonio Conte after he underwent surgery to remove his gallbladder, but they have title-winning nous and enviable strength in depth. Fixtures (all Phuket times) Saturday Chelsea v Fulham (3am) Everton v Arsenal (7:30pm) Aston Villa v Leicester (10pm) Brentford v Southampton (10pm) Brighton v Bournemouth (10pm) Man Utd v Crystal Palace (10pm) Wolves v Liverpool (10pm) Sunday Newcastle v West Ham (12:30am) Nottingham Forest v Leeds (9pm) Tottenham v Man City (11:30pm)","pubDate":"2023-02-03 02:43:00","image_url":" \n\t\t","source_id":"thephuketnews","category":["sports"],"country":["thailand"],"language":"english"},{"title":"Glamorous Aston Villa star Alisha Lehmann beats tennis legend Roger Federer in popularity contest","link":"https://www.dailymail.co.uk/sport/football/article-11707979/Glamorous-Aston-Villa-star-Alisha-Lehmann-beats-tennis-legend-Roger-Federer-popularity-contest.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Retired tennis legend Roger Federer is not used to second place, but he has been handed an unflattering L on the social media stage with a little known football player usurping him at the top.","content":"How a glamorous 24-year-old football star you've never heard of beat tennis legend Roger Federer into second place in sporting popularity contest Alisha Lehmann is the most popular Swiss athlete on Instagram She pips Federer who recently retired with 20 grand slam titles Lehmann posts sometimes raunchy images to her account By Josh Alston For Daily Mail Australia Published: 21:37 EST, 2 February 2023 | Updated: 21:38 EST, 2 February 2023 e-mail View comments Retired tennis legend Roger Federer is not used to finishing in second place, but he has been handed an unflattering loss on the social media stage with a little-known football player usurping him at the top. Along with his 20 Grand Slam singles titles, a career Grand Slam (winning all four Grand Slams at least once) and 103 ATP singles titles including 20 major titles, Federer was also the Swiss king of Instagram. However, he has now surrendered that title with glamourous Aston Villa star Alisha Lehmann now taking the mantle as the most followed Swiss sports star on the platform. Not even cutting a striking figure at the Christian Dior Haute Couture Spring Summer 2023 show as part of Paris Fashion Week could help Federer remain top spot on social media Lehmann plays for Aston Villa and the Switzerland national team and has become the most popular Swiss personality on Instagram, overtaking the grand slam icon The Aston Villa star also posts a range of glamourous and raunchy photos to her social media The great Federer has 11.2m followers on the platform while Lehmann has now overtaken him with 11.4m fans. While there are plenty of images of Lehmann plying her trade in the English FA Women's National League on her profile, she has something that Federer will never match: a raunchy side. She has posted bikini photos of herself in glamorous locations around the world like Miami and Rio de Janeiro . The footballer recently became single after splitting from fellow Aston Villa star Douglas Luiz, and her 2023 calendar has probably helped boost her online profile as well. Lehmann has notched 32 appearances for Aston Villa and has also played eight games for Everton and 42 matches for West Ham United Images like this, taken at Miami Beach, have earned Lehmann plenty of praise with one follower commenting: 'I was looking for the meaning of perfection and I found this' Lehmann also once dated former Chelsea Women's star Ramona Bachmann. Fellow Swiss tennis stars Stan Wawrinka (1.2 million followers), rising tennis star Belinda Bencic (427k followers) and the retired Martina Hingis (313k Followers) fall well behind Federer and Lehmann. In other sports Arsenal midfielder Granit Xhaka (2.9 million followers), popular alpine skiing star Marco Odermatt (237K followers), track sprinter Mujinga Kambundji (133K followers) were also well down the pecking order. And while Lehmann has dethroned Federer on the Swiss stage, she has work some to do to catch the global Instagram leaders. Federer has 20 grand slams and signed off from international tennis with a classy letter to his supporters on Instagram (pictured below) View this post on Instagram A post shared by Roger Federer (@rogerfederer) Former Portugal , Manchester United and Real Madrid star Cristiano Ronaldo - who now plays for Saudi Professional League club Al Nassr - tops all athletes with more than 520million followers. It is one area where he trumps great rival Lionel Messi, who comes in second with 406million - although he does have a World Cup victory to his name. While technically no longer an athlete, former WWE star Dwayne 'The Rock' Johnson is third with 354million followers, with Indian cricket hero Virat Kohli (228million) and Brazillian football star Neymar Jr (197million) rounding out the top five. Share or comment on this article: Glamorous Aston Villa star Alisha Lehmann beats tennis legend Roger Federer in popularity contest e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 02:38:04","image_url":"https://i.dailymail.co.uk/1s/2023/02/03/01/67274975-0-image-a-40_1675386190151.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am","link":"https://247newsaroundtheworld.com/sports/gareth-bale-shows-off-his-incredible-golfing-ability-at-the-pebble-beach-pro-am/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Gareth Bale shows off his incredible golfing ability at the Pebble Beach… The post Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am appeared first on 247 News Around The World.","content":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am by nearly holing out from the CART PATH – after Jon Rahm was left amazed at his game… while Bills QB Josh Allen gets off to a great start in his group By Jake Fenner For Dailymail.Com Published: 13:34 EST, 2 February 2023 | Updated: 20:44 EST, 2 February 2023 Gareth Bale impressed with his golfing skill during the opening round of the Pebble Beach Pro-Am in California. Facing a shot off the greenside cart path, Bale pulled his wedge out to try and land the ball softly near the cup. He bounced the ball off the edge of the pavement – sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green and then softly rolled and settled for a short putt. Meanwhile, fellow athlete and NFL quarterback Josh Allen began his day with a great drive with his group playing on the nearby Spyglass Hill course. Gareth Bale impressed with a miraculous cart path save at the Pebble Beach Pro-Am Bale bounced the ball off the edge, sending the ball sailing over the rough and on the green See also Tottenham complete loan signing of Pedro Porro with view to £40million permanent transfer from Sporting Lisbon after resurrecting collapsed on deadline day Allen surprised NFL fans by turning up to this event, just days after saying that he would be skipping the Pro Bowl Games. The quarterback said that he’d be sitting out the festivities in Las Vegas due to an elbow injury. Bale just recently announced his retirement from professional football, just months after he led Wales in their first World Cup since 1958. Last week, Bale took part in another Pro-Am just before the Farmers Insurance Open teed off at Torrey Pines in San Diego. His play drew praise from Spanish golfer Jon Rahm – who said it ‘doesn’t seem fair’ that Bale is ‘so good at football and golf’. Bale’s love of golf is well known and he is said to have a three-hole golf course at his house but the hobby had been a controversial issue during his soccer career. It was a source on contempt in particular during his time with Real Madrid, where he won five Champions League titles. He posed, while on international duty with Wales, with a banner that read, ‘Wales. Golf. Madrid. In That Order’ – a move which sparked a backlash among supporters of the club. Allen surprised many NFL fans by spurning the Pro Bowl to play at this year’s golf tournament See also Sportsman arrested in Ireland, suspected of passing police intel from corrupt cops to gangs Share or comment on this article: Post source: Daily mail","pubDate":"2023-02-03 02:33:22","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Benfica manager Roger Schmidt insists the club are bigger than Enzo Fernandez and he only wants players who are ‘happy to play’ after £106.8m Chelsea transfer","link":"https://247newsaroundtheworld.com/sports/benfica-manager-roger-schmidt-insists-the-club-are-bigger-than-enzo-fernandez-and-he-only-wants-players-who-are-happy-to-play-after-106-8m-chelsea-transfer/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Benfica boss Roger Schmidt has sent a dig to Enzo Fernandez after… The post Benfica manager Roger Schmidt insists the club are bigger than Enzo Fernandez and he only wants players who are ‘happy to play’ after £106.8m Chelsea transfer appeared first on 247 News Around The World.","content":"Benfica boss Roger Schmidt has sent a dig to Enzo Fernandez after he completed his British transfer record move to Chelsea. The 22-year-old signed for the Blues in the final hours of deadline day for a fee of £106.8million. AFP Schmidt is not happy with Fernandez Getty The 22-year-old is on his way to Chelsea He only joined Benfica in the summer from River Plate but has already moved on to pastures new following his World Cup win with Argentina. However, after Benfica’s 3-0 against Arouca on Tuesday night, his former boss Schmidt was not slow to criticise the midfielder. He said: “It’s always difficult to lose a good player in the winter market, but today we showed that we are a good team without him, that we are capable of playing good football without him, that the players are focused on getting the most points, to be champions. “Benfica is much bigger than a player. We just need players who are happy to play for Benfica, who are passionate. “We had a player who wanted to leave and a club willing to pay the clause, we couldn’t do anything. We accepted and looked ahead.” Fernandez emerged as one of football’s brightest talents in Qatar when he won the World Cup’s Young Player of the Tournament award. CHELSEAFC.COM Chelsea will soon welcome their new record signing Getty He helped Argentina win the World Cup in Qatar Greenwood latest, Martinelli ‘signs new Arsenal deal’, Ayew snubs Everton for Forest Man United forward Mason Greenwood has all criminal charges against him dropped Man United forward Greenwood breaks silence after criminal charges are dropped Manchester United statement after criminal charges against Mason Greenwood are dropped Arsenal star Tomiyasu reveals ‘aggressive’ forward he least enjoys facing in training Why one Newcastle player will only secure Carabao Cup winners’ medal if Man United win He made 29 appearances for Benfica but will soon arrive at Chelsea as their eighth arrival of the January window. Fernandez’s move is also a British transfer record, surpassing Jack Grealish’s £100million transfer from Aston Villa to Manchester City. The midfield star will join a Chelsea team who sit tenth in the Premier League table. Graham Potter’s side will need a big push in the second half of the season if they are to finish in the top four. talkSPORT BET OFFER OF THE DAY Get up to £40 in free bets* – CLAIM HERE 18+ New customers only. Opt in, bet up to £40 (min. £20) on selected events at odds of 2.00+, in 7 days. Get up to £40 in free bets on selected events. Bonuses expire in 7 days. Card payments only. T&Cs apply, see below. begambleaware.org | Please gamble responsibly SEE ALL FREE BETS HERE See also Newcastle complete the signing of Anthony Gordon for £40m - plus £5m in add-ons","pubDate":"2023-02-03 01:45:47","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am","link":"https://www.dailymail.co.uk/sport/golf/article-11707073/Gareth-Bale-shows-incredible-golfing-ability-Josh-Allen-forgets-sport-hes-playing.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"He bounced the ball off the edge of the pavement - sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green.","content":"Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am by nearly holing out from the CART PATH - after Jon Rahm was left amazed at his game... while Bills QB Josh Allen gets off to a great start in his group Gareth Bale has had plenty of time to work on his golf game since retirement Meanwhile, Josh Allen drove the ball well after skipping the NFL's Pro Bowl Click here for all your latest international Sports news from DailyMail.com By Jake Fenner For Dailymail.Com Published: 18:34 GMT, 2 February 2023 | Updated: 01:44 GMT, 3 February 2023 e-mail 124 shares 29 View comments Gareth Bale impressed with his golfing skill during the opening round of the Pebble Beach Pro-Am in California . Facing a shot off the greenside cart path, Bale pulled his wedge out to try and land the ball softly near the cup. He bounced the ball off the edge of the pavement - sending the ball flying over most of the rough. Luckily for the former Wales international footballer, the ball checked up on the collar of the green and then softly rolled and settled for a short putt. Meanwhile, fellow athlete and NFL quarterback Josh Allen began his day with a great drive with his group playing on the nearby Spyglass Hill course. Multi-sport athlete ⚽️ The cart path is no problem @GarethBale11 . pic.twitter.com/7EOuM3IE4M — PGA TOUR (@PGATOUR) February 2, 2023 Gareth Bale impressed with a miraculous cart path save at the Pebble Beach Pro-Am Bale bounced the ball off the edge, sending the ball sailing over the rough and on the green Allen surprised NFL fans by turning up to this event , just days after saying that he would be skipping the Pro Bowl Games. The quarterback said that he'd be sitting out the festivities in Las Vegas due to an elbow injury. Bale just recently announced his retirement from professional football, just months after he led Wales in their first World Cup since 1958. Last week, Bale took part in another Pro-Am just before the Farmers Insurance Open teed off at Torrey Pines in San Diego. His play drew praise from Spanish golfer Jon Rahm - who said it 'doesn't seem fair' that Bale is 'so good at football and golf'. Bale's love of golf is well known and he is said to have a three-hole golf course at his house but the hobby had been a controversial issue during his soccer career. It was a source on contempt in particular during his time with Real Madrid, where he won five Champions League titles. He posed, while on international duty with Wales, with a banner that read, 'Wales. Golf. Madrid. In That Order' - a move which sparked a backlash among supporters of the club. Allen surprised many NFL fans by spurning the Pro Bowl to play at this year's golf tournament Starting strong 💪 @JoshAllenQB is off to a hot start after his opening tee shot @ATTProAm . pic.twitter.com/iDKa67XU2V — PGA TOUR (@PGATOUR) February 2, 2023 Share or comment on this article: Gareth Bale shows off his incredible golfing ability at the Pebble Beach Pro-Am e-mail 124 shares Add comment Comments 29 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 01:44:27","image_url":"https://i.dailymail.co.uk/1s/2023/02/02/18/67263595-0-image-a-8_1675364095598.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Neville apologises for 'clumsy like' on tweet calling Man United's Greenwood an 'innocent man'","link":"https://www.dailymail.co.uk/sport/football/article-11707131/Neville-apologises-clumsy-like-tweet-calling-Man-Uniteds-Greenwood-innocent-man.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against Mason Greenwood were dropped on Thursday.","content":"Gary Neville apologises for 'clumsy like' of a tweet calling Mason Greenwood an 'innocent man' after charges against Man United forward were dropped... with the Red Devils icon insisting he 'obviously condemns' violence against women Pundit Gary Neville has insisted he obviously condemns violence against women Neville liked a tweet calling Man United's Mason Greenwood an 'innocent man' All charges were dropped against United forward Greenwood , 21, on Thursday By Max Mathews For Mailonline Published: 19:47, 2 February 2023 | Updated: 01:39, 3 February 2023 e-mail 304 shares 4 View comments Gary Neville has issued a statement insisting he 'obviously condemns' violence against women - after being criticised for liking a tweet describing Mason Greenwood as an 'innocent man' . Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against M anchester United forward Greenwood were dropped on Thursday , a year after he was arrested. And United icon Neville was criticised online for liking a tweet from former Chief Crown Prosecutor for North West England Nazir Afzal declaring Greenwood's innocence - something he admitted was 'clumsy'. The Sky Sports pundit later tweeted: 'I liked a tweet relating to the Mason Greenwood news this afternoon from Nazir Afzal. (the former director of public prosecutions). 'This like is being misinterpreted. It was a clumsy like as I obviously condemn any violence against women.' Gary Neville has issued a statement saying he 'obviously' condemns violence against women after being criticised for liking tweets about Mason Greenwood's charges being dropped I liked a tweet relating to the Mason Greenwood news this afternoon from Nazir Afzal. ( the former director of public prosecutions ). This like is being misinterpreted. It was a clumsy like as I obviously condemn any violence against women. — Gary Neville (@GNev2) February 2, 2023 Charges of attempted rape, controlling and coercive behaviour and one count of assault occasioning actual bodily harm against the Man United forward were dropped on Thursday The tweets from Afzal read: 'Mason Greenwood has had all charges against him dropped by the Prosecutors. What's changed you may ask? It appears that (some) witnesses will no longer support a prosecution & new evidence came to light It happens He is an innocent man, that's all we need to know. 'You are innocent till PROVEN guilty. We don't have trial by media, We don't have evidence that any witnesses were lying, We don't do 'victim or complainant blaming'. Prosecutors have to be sure there is a realistic prospect of conviction by a jury on the evidence they have. They don't.' Neville has since un-liked those tweets. It is also believed he retweeted one of the tweets but has also since undone that action. A Crown Prosecution Service spokesperson said: 'We have a duty to keep cases under continuous review. In this case a combination of the withdrawal of key witnesses and new material that came to light meant there was no longer a realistic prospect of conviction. 'In these circumstances, we are under a duty to stop the case. We have explained our decision to all parties. We would always encourage any potential victims to come forward and report to police and we will prosecute wherever our legal test is met.' To which United responded: ''Manchester United notes the decision of the Crown Prosecution Service that all charges against Mason Greenwood have been dropped. The club will now conduct its own process before determining next steps. We will not make any further comment until that process is complete.' Greenwood himself said in a statement: 'I am relieved that this matter is now over and I would like to thank my family, loved ones and friends for their support. There will be no further comment at this time.' There are now questions over whether Greenwood will play for the club again . Neville had liked two tweets from Nazir Afzal, one calling Greenwood an 'innocent man' He remains on United's squad list and, in a possible indication he could resume his football career, is still present on the first-team squad page on United's official website. Greenwood was included among Under 21 players on United's official Premier League squad list at the beginning of the season despite being suspended by the club. His biography on the club website makes no mention of the charges against him with the last update mentioning a new contract until 2025 he signed in 2021 and his passing of 100 appearances for the club. The player, who has been capped once for the Three Lions, was first held in January over allegations relating to a young woman, after images and videos were posted online. He was later suspended from United on full pay and removed from the FIFA 22 game. Greenwood last featured for the Red Devils on January 22, 2022, in a 1-0 win over West Ham. He has been suspended by the club since that point. Greenwood's profile remains on United's official website despite the club suspending him The forward is listed alongside other United players on the first-team squad page Greenwood was listed in the Under 21 (Contract and Scholars) section of United's squad list for the Premier League at the beginning of the season Share or comment on this article: Neville apologises for 'clumsy like' on tweet calling Man United's Greenwood an 'innocent man' e-mail 304 shares Add comment Comments 4 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-03 01:39:11","image_url":"https://i.dailymail.co.uk/1s/2023/02/02/19/67264903-0-image-a-44_1675366059627.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"}]}