{"newsArray":[{"title":"Sergija Ramosa optužili da je PSG nazvao ‘ku****** sinom‘, on se brani: ‘Rekao sam nešto potpuno drugo‘","link":"https://sportske.jutarnji.hr/sn/nogomet/liga-prvaka/sergija-ramosa-optuzili-da-je-psg-nazvao-ku-sinom-on-se-brani-rekao-sam-nesto-potpuno-drugo-15314086","keywords":["Liga prvaka"],"creator":null,"video_url":null,"description":"Nova sezona, stara priča. Paris Saint-Germain ispao je iz Lige prvaka već u osmini finala, kao i prošle godine, unatoč tomu što se mogu pohvaliti najatraktivnijim imenima nogometnog svijeta. Lionel Messi i Kylian Mbappe već su pokazali da mogu sve i svašta, ali riješiti prvi \"kompleks\" Parka prinčev...","content":"Nova sezona, stara priča. Paris Saint-Germain ispao je iz Lige prvaka već u osmini finala, kao i prošle godine, unatoč tomu što se mogu pohvaliti najatraktivnijim imenima nogometnog svijeta. Lionel Messi i Kylian Mbappe već su pokazali da mogu sve i svašta, ali riješiti prvi \"kompleks\" Parka prinčeva, to ne mogu. Barem ne još. Nakon utakmice na Alianz Areni, gdje je PSG poražen i u drugom ogledu protiv Bayerna (uk. 0:3), Argentinac i Francuz pretrpjeli su salvu kritika tamošnjih i stranih medija, ali najveće neugodnosti proživljavao je Sergio Ramos . Naime, kamere su uhvatile španjolskog braniča kako nešto govori samom sebi u trenutku kada je shvatio da za PSG nema budućnosti na ovosezonskom europskom podiju. U mnogim medijima čitači s usana ustvrdili su da Ramos \"sočno\" psuje, što i ne bi bio neki problem, da te psovke nisu bile na račun vlastitog kluba. - J**** kur** koja je rodila Pariz, kur***** sina - navodno je kazao stoper sebi \"u bradu\". Naravno, nije trebalo dugo da se video proširi društvenim mrežama, a navijačima se nije svidjelo viđeno, pa su mnogi vrijeđali stopera u komentarima. Stoga je Ramos bio primoran reagirati putem Twitter profila. Kaže, nepristojno se izražavao, ali uopće nije rekao ono za što ga optužuju, čak nije ni spomenuo ime kluba. \"Obično se ne nadovezujem na ovakve teme, ali ne želim da se govori nešto što se nije dogodilo. Ni u jednom trenutku nisam spomenuo Pariz, nego sam pustio razočarani ‘pssss‘ ili ‘pff‘ u kontekstu izraza (bezobraznog, priznajem) koji smo navikli koristiti u nogometu. Nemojmo izmišljati nešto čega nema\", napisao je Ramos. Bivši stoper Real Madrida imao je jednu dobru šansu protiv Bayerna nakon kornera, ali ipak nije naciljao okvir gola. Nakon utakmice poraženo je kazao: - Duboko sam razočaran, nismo bili na razini kakvu zahtjev aLiga prvaka. Nismo se pozabavili malim detaljima, a oni su ključni. Naš glavni cilj je nestao, to je bolno, ali prvaci se rađaju nakon poraza i kuju u nevoljama.","pubDate":"2023-03-10 08:00:26","image_url":"https://static.jutarnji.hr/images/slike/2023/03/10/28244807.jpg","source_id":"jutarnji","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Илиан Илиев: Трансферът на Босанчич е финансово изгоден за Черно море","link":"https://gong.bg/bg-football/efbet-liga/ilian-iliev-transferyt-na-bosanchich-e-finansovo-izgoden-za-cherno-more-724412","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Черно море спечели 7 точки от първите си четири мача и се намира в челната шестица. Именно това е първата цел на тима за този сезон. В интервю за Gong.bg треньорът на \"моряците\" Илиан Илиев коментира старта на тима във втория полусезон, предстоящото гостуване на шампиона Лудогорец и двата последни трансфера, които направи варненският клуб. - Г-н Илиев, как видяхте Черно море в първите четири пролетни мача? - От спечеленото на чужд терен съм доволен, но от представянето ни у дома – не, и това трябва да го променим, тъй като мачовете, които ни предстоят, са също толкова важни, колкото и предишните. Имаме контрол на мачовете у дома, но в завършващата фаза има много какво да се желае. За съжаление, опциите ни в атака са ограничени, тъй като новите играчи още не са получили права или са с проблеми. - Кое ви харесва в играта на тима и кои грешки не трябва да повтаряте? - Като държане и владеене на топката се подобрихме, а на моменти преходът ни като загубим топката също е добър. Необходимо е обаче да коригираме грешките, които допускаме в дефанзивен план, и заради които изгубихме точки. Особено голове като тези в последния мач, не бива да допускаме занапред. Искам да се подобрим във всяко едно отношение, но най-вече да не подценяваме дадени ситуации в защита и да реагираме по-добре на тях. - Защо напролет Черно море побеждава навън, а не успява да спечели на \"Тича\"? - На чужд терен имаме повече пространства и стават по-отворени мачове, докато у дома съперниците са по-затворени. Ние обаче тряба да намираме верните решения за противодействие срещу сгъстена защита. Другото е, че играем по-освободено като гости, а на свой терен с малко напрежение, може би, защото искаме да печелим победи на всяка цена и на \"Тича\". Но трябва да преодолеем това напрежение, за да се справяме по-добре и пред нашата публика, защото имаме тяхната подкрепа. - Излязохте с позиция за решението на ВАР срещу Черно море в последната среща. След като минаха няколко дни, какво мислите за това отсъждане, което отмени дузпа във ваша полза? - Прави ми впечатление, че се третират по различен начин такива ситуации. По време на това първенство в пет случая не ни дадоха дузпа за игра с ръка, в други ни дадоха, а пък в домакинството ни с Ботев Враца не отсъдиха дузпа за гостите при подобно положение. Явно критерият е различен, но това, което направи Станислав Тодоров в двубоя ни с Ботев Пловдив, е меко казано неразбираемо. Гледахме Челси и Дортмунд и там ВАР помогна на рефера да отсъди дузпа. Същата ситуация беше и на нашия мач, отсъди дузпа главния съдия, но Станислав Тодоров отмени решението му, много рядко ВАР би отменил дузпа при такова положение. Ако критериите на ВАР в България и Шампионска лига са различни, това е доста притеснително, или пък ВАР у нас облагодетелства определени отбори. - Лудогорец загуби последната си среща у дома, но вече има нов треньор. Как искате да се представи Черно море в неделя в Разград? - Това, което се случи в предния мач на Лудогорец, не е добре за нас, а качествата на Ивайло Петев са известни и няма какво да ги коментирам. Когато има нов треньор, има и различен импулс за играчите, и мобилизацията на Лудогорец срещу нас няма да е както от мача с Пирин, когато подцениха нещата. Не е идеален момент за Черно море това гостуване, но трябва да се справяме, тъй като много е сгъстено зад нас и пред нас в класирането, и се нуждаем от точки. - Само за няколко дни Черно море направи два трансфера. Как се стигна до продажбата на Петър Босанчич и завръщането на Влатко Дробаров? - Като се прибирахме от Благоевград, получихме съобщение от агента на Босанчич, че той има предложение, което е финансово изгодно за Черно море. Обсъдихме го с ръководството и се свързахме с Влатко, който беше свободен и след като се разбрахме с него, приехме офертата на латвийците за Петър. Този осъществен трансфер на Босанчич е добър от финансова гледна точка за клуба ни. - Дробаров не е играл дълго, а Даниел Димов още не е в оптимална форма, и това Ви затруднява при избора на втори централен защитник. - Не съм съгласен, че имаме трудности с избора за втори централен защитник за мача с Лудогорец. Росен Стефанов се представи много добре в подготовката и има пълното доверие, както на треньорите, така и на съотборниците си. При Влатко няма игрова практика, тъй като отдавна не е участвал в официални мачове, но е човек, който познава обстановката, тренирал е и физически е добре. Въпрос на време е да си върне формата. За Даниел е най-важно, че преодоля бързо травмата в глезена, въпреки че има още леки проблеми. По-трудното е свързано с нерва в десния крак, но с всеки изминал ден състоянието му се подобрява. - Кога ще може да разчитате на двамата бразилци и португалеца? - С бразилците е сложно заради работните визи, не зависи от нас, а от държавните институции. Надяваме се да получат скоро такива. Що се отнася до Едгар Пачеко, той няма такъв проблем, но пък дойде контузен. В последния мач за своя бивш тим, преди да разтрогне договора си, е получил разтежение и сега се възстановява. - Отново има четирима юноши на Черно море - Иван Дюлгеров, Виктор Попов, Илиан Илиев и Мартин Минчев, са повикани в националния отбор, това радва ли ви? - Естествено, че сме радостни и доволни. Това е признание за работата на всички в клуба през последните години. Да си там е признание, но идва и трудното, а то е, че те трябва да се опитат да помогнат на националния отбор да направи следващата крачка в развитието си, а именно да се опита да се пребори със силните противници в нашата група.","pubDate":"2023-03-10 07:40:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Моуриньо не остана доволен от резултата въпреки победата над Сосиедад","link":"https://gong.bg/football-sviat/liga-evropa/multimedia/video/mourinio-ne-ostana-dovolen-ot-rezultata-vypreki-pobedata-nad-sosiedad-724410","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Старши треньорът на Рома - Жозе Моуриньо, беше щастлив след успеха с 2:0 над Реал Сосиедад в първи 1/8-финален сблъсък между двата тима в турнира Лига Европа. Португалецът обаче не остана доволен от резултата и не го прие като „добър“, тъй като ще се разбере дали той е бил такъв едва след изиграването на реванша в Испания след седмица. „Хареса ми организацията в играта, старанието, емпатията на терена. Помагахме си един на друг. Трудно е да се играе срещу отбори, които използват схема \"диамант\" в средата на терена. Вече сме играли срещу такива като РБ Залцбург и Емполи, но е трудно. Трябваше да покажем силен характер, защото когато не владееш топката дълго време, психиката е от огромно значение. Контролирахме мача, въпреки че по-малко владеехме топката. Този резултат би бил добър, само ако не допуснем три гола в реванша. Никога не бих казал, че един резултат е добър след първия мач“, сподели Моуриньо. Gulliver/GettyImages 38 снимки Специалния обаче отново се оплака от късата резервна скамейка, с която разполага и си пожела да има някой от играчите на Байерн. „Пускането на Ел Шаарауи сред титулярите бе стратегически ход, но не бе лесно да избера. Нямам нападатели на пейката, дори Солбакен го няма. Спомням си вчерашния мач, в който Байерн имаше Гнабри, Сане и Мане на пейката. Щях да съм доволен да имам и само един от тях“, каза още Моуриньо. 💬 “It went to plan. All credit to the lads.” 🗣️ José Mourinho after tonight’s victory! 👉 https://t.co/Axg2KxHp40 #ASRoma #UEL #RomaRealSociedad pic.twitter.com/odoyjFJZZ3 — AS Roma English (@ASRomaEN) March 9, 2023","pubDate":"2023-03-10 07:34:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Юнайтед ще пробва да отмъкне млада звезда на Реал","link":"https://gong.bg/football-sviat/ispania/multimedia/video/iunajted-shte-probva-da-otmykne-mlada-zvezda-na-real-724407","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Манчестър Юнайтед има амбициозна цел да привлече в състава си халфа на Реал Мадрид Едуардо Камавинга. Почти сигурно Ерик тен Хаг ще получи солиден бюджет за летни попълнения, за да продължи възходящото развитие на отбора. Една от целите на нидерландския специалист е подсилване на халфовата линия, в която според него няма достатъчно дълбочина. Именно заради това той се е насочил към френския национал, твърди \"Фишайес\". В момента Юнайтед разполага с Каземиро, Кристиан Ериксен, Фред, Марсел Забитцер и Скот Мактоминей в средната си линия. Само първите трима обаче влизат в дългосрочните планове на Тен Хаг, като бъдещето на Мактоминей и Забитцер е неясно, като шотландецът вероятно ще бъде продаден, а австриецът ще се завърне в Байерн след изтичане на наема му. Така подсилване на халфовата линия ще е от ключово значение, а в клуба са се насочили към доста амбициозна цел в лицето на Камавинга. Твърди се, че на \"Олд Трафорд\" са готови да извадят 130 милиона евро в опит на изкушат Реал да се раздели с този футболист. Дори и такава сума обаче може да се окаже недостатъчна за привличането на Камавинга. 20-годишният френски национал бе взет на \"Сантиаго Бернабеу\" през 2021 година с идеята да бъде дългосрочна алтернатива на Лука Модрич и Тони Кроос. Така че \"белия балет\" много трудно ще се раздели с него, още повече, че футболистът показва сериозно развитие откакто пристигна в клуба. До момента той има 79 мача, 2 гола и 3 асистенции за мадридчани.","pubDate":"2023-03-10 07:22:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Тежък удар за Славия","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/tezhyk-udar-za-slaviia-724406","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"След трите поредни загуби минорното настроение в Славия се задълбочава и от новините за състоянието на халфа Иван Минчев. Техничарят от Казанлък, който преди време стигна и до националния отбор, записа само един официален мач за 2023-а година. Той започна при поражението от Хебър Пазарджик и бе сменен в 80-ата минута. След това треньорският щаб го е гласял за титуляр и срещу Ботев Враца, но в последния момент той е отпаднал от състава. Прегледът е показал, че има друго разкъсване на мускула, пише „Мач Телеграф“. Сега ще трябва да почине по-дълго и ще е на разположение чак през месец април. Lap.bg 38 снимки Минчев не игра заради травма в мачовете с Пирин и Лудогорец. Така Галин Иванов е без алтернатива и единствено другият ветеран Дарко Тасевски е опция пред треньора Златомир Загорчич. „Белите“ имат сериозни проблеми в средата на терена след трансфер на Кемело Нгуена в латвийския ФК Рига. Младите таланти Крум Стоянов и Чунг Нгуен До все още не са готови да играят решителна роля в тежките битки от елита.","pubDate":"2023-03-10 07:16:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Brighton and Ecuador star makes Grimsby Town statement ahead of FA Cup quarter-final tie","link":"https://www.grimsbytelegraph.co.uk/sport/football/football-news/brighton-star-makes-grimsby-statement-8230356","keywords":["Sport"],"creator":["newsdesk@grimsbytelegraph.co.uk (Sam Allen)"],"video_url":null,"description":"The Mariners take on Roberto De Zerbi's high-flying Brighton side in the FA Cup quarter-finals","content":"Brighton and Hove Albion star Moises Caicedo has said they will not take Grimsby Town lightly when they meet in the FA Cup quarter-finals on March 19. It has been quite the journey so far for Paul Hurst’s Mariners team to reach the last eight for the first time in 84 years, with records broken and expectations defied on multiple occasions. It will be the second away game in a row against Premier League opposition when Town take on the Seagulls, but arguably another step up in competition with Brighton pushing for European football in what has been a stellar league campaign for them so far. READ MORE: Evan Khouri handed rare Grimsby Town start as young prospect continues to impress Paul Hurst 21-year-old Caicedo, who played for his native Ecuador at the recent World Cup in Qatar, is one of the many young stars in Roberto De Zerbi’s Brighton team having missed just one league game all season playing as a defensive midfielder. The ultimate goal for Caicedo and Brighton this season is to break into the top four and play in the Champions League next season and if not that at least secure European football. However, as the third-highest-ranked team of the eight left in the FA Cup, they also sense an opportunity to win silverware. On paper, a home tie against Grimsby was the best possible draw for De Zerbi’s side in that quest for cup glory, but Caceido and his Brighton teammates will not be taking them lightly when they face off at the Amex on Sunday, March 19. The Ecuadorian international said: “We are trying to get into the Champions League. That is the dream of the team, to get to the highest point possible and bring happiness to the fans, who are always supporting us. It will be very difficult, but we are very convinced we can do it together. We want to keep going until the end and we are sure we will do it. “We know this cup is something we have to fight for, as well, and give our all against any team we come up against. We are not under any illusions, we know Grimsby will still be a very hard opponent. Every game is different, but I know how important it is for Brighton. We will give everything to try and bring this cup here to Brighton.” READ NEXT Latest Grimsby Town updates and transfer news Grimsby Town's mission to resurrect home superiority continues after Newport County display Grimsby Town supporters snap up tickets for historic FA Cup quarter-final away at Brighton Paul Hurst provides Kieran Green update with his month-long absence felt at Grimsby Town 'Hard watch' - Paul Hurst's brutal assessment of Grimsby Town home draw with Newport County","pubDate":"2023-03-10 06:00:00","image_url":"https://i2-prod.sussexlive.co.uk/sport/football/football-news/article8215546.ece/ALTERNATES/s615/0_GettyImages-1471208872.jpg","source_id":"grimsbytetelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AC Milan Enggan Jemawa di Liga Champions","link":"https://sport.detik.com/sepakbola/uefa/d-6610754/ac-milan-enggan-jemawa-di-liga-champions","keywords":null,"creator":null,"video_url":null,"description":"AC Milan melaju ke perempatfinal Liga Champions. Rossoneri sadar diri kualitas mereka masih di bawah tim-tim lainnya semisal Bayern Munich atau Real Madrid.","content":"AC Milan Enggan Jemawa di Liga Champions Bayu Baskoro - Sepakbola Jumat, 10 Mar 2023 10:40 WIB AC Milan lolos ke perempatfinal Liga Champions. (Foto: Getty Images/Craig Mercer/MB Media) Milan - AC Milan melaju ke perempatfinal Liga Champions . Rossoneri sadar diri kualitas mereka masih di bawah tim-tim lainnya semisal Bayern Munich atau Real Madrid. Milan melaju ke delapan besar usai menyingkirkan wakil Inggris, Tottenham Hotspur. Pasukan Stefano Pioli menang agregat 1-0 atas The Lilywhites. Ini menjadi keberhasilan pertama Milan ke perempatfinal Liga Champions dalam sedekade. Kali terakhir mereka melakukannya pada 2012. ADVERTISEMENT SCROLL TO RESUME CONTENT Baca juga: AC Milan, Raksasa Eropa yang Coba Bangun dari Tidur AC Milan sendiri bisa dibilang salah satu raksasa Eropa. Klub yang bermarkas di San Siro itu punya 7 titel Liga Champions, hanya kalah dari Real Madrid (14). Kali terakhir Milan mengangkat gelar Liga Champions yakni pada 2007. Antusiasme kepada Rossoneri untuk bisa meraih lagi Trofi Si Kuping Besar pun membuncah seiring keberhasilan mereka lolos ke perempatfinal. Direktur teknik Milan, Paolo Maldini , punya pendapat berbeda. Menurutnya, Olivier Giroud cs masih jauh untuk dapat mengakhiri puasa gelar Liga Champions. Baca juga: Milan ke Perempatfinal Liga Champions, Pioli: Tak Ada yang Mustahil [Gambas:Twitter] \"Tujuan kami musim ini adalah finis di empat besar dan melewati babak penyisihan grup Liga Champions. Ini akan sulit di Serie A, tetapi kami harus mendapatkan tempat itu,\" kata Maldini, dikutip dari Football Italia . \"Saya lebih suka menghindari klub Italia lainnya, karena kami ingin lebih banyak tim Serie A melangkah sejauh mungkin. Tidak masalah siapa yang kami dapatkan pada tahap ini, kami tidak merasa kami berada di level yang sama dengan Bayern Munich, Manchester City, atau Real Madrid,\" ujarnya. Baca juga: Maju ke Perempatfinal Liga Champions, Milan Tidak Takut Siapapun! Simak Video \" Singkirkan Tottenham, AC Milan Lolos ke Perempatfinal Liga Champions \" [Gambas:Video 20detik] (bay/bay) ac milan paolo maldini liga champions liga champions 2022/2023","pubDate":"2023-03-10 03:40:35","image_url":null,"source_id":"detik","category":["sports"],"country":["indonesia"],"language":"indonesian"},{"title":"FIFA head of refs wants all stoppage time added in blowouts","link":"https://www.arabnews.com/node/2265976/football","keywords":null,"creator":["romulo"],"video_url":null,"description":"Fri, 2023-03-10 05:45 GENEVA: FIFA wants full stoppage time added even in blowouts though its refereeing chief said Thursday a “mercy rule” that baseball uses at some levels could be debated in the future to end games at 90 minutes. Liverpool’s 7-0 rout of Manchester United on Sunday had only three minutes added at the end despite six-second-half goals, FIFA head of refereeing Pierluigi Collina told reporters in a briefing.Main category: FootballSport","content":"GENEVA: FIFA wants full stoppage time added even in blowouts though its refereeing chief said Thursday a “mercy rule” that baseball uses at some levels could be debated in the future to end games at 90 minutes. Liverpool’s 7-0 rout of Manchester United on Sunday had only three minutes added at the end despite six-second-half goals, FIFA head of refereeing Pierluigi Collina told reporters in a briefing. The 2022 World Cup in Qatar showcased a push by FIFA and Collina to give fans more entertainment by having referees add accurate amounts for stoppages such as goal celebrations, substitutions, injuries and time-wasting. It led to so-called 100-minute games and meant Spain’s 7-0 rout of Costa Rica in the group stage had eight minutes of added time, Collina said. It let Alvaro Morata score the seventh goal. Though Morata’s goal was not crucial in the final Group E standings, Spain did advance ahead of Germany on the tiebreaker of goal difference. “In some competitions the goal difference in the entire competition may be decisive at the end for the ranking,” Collina said. “So even one goal scored or not scored could make the difference.” In 1989, Arsenal won the English league title over Liverpool on the tiebreaker of goals scored with the teams’ goal difference identical. The teams met in the last game of the season and Arsenal’s 2-0 win at Liverpool was sealed by a goal in second-half stoppage time. Collina acknowledged that lengthy added time in games such as Liverpool’s lopsided win last weekend could be viewed as “something not really understandable,” though he suggested consistency was key. “At the World Cup people knew what to expect,” said the former top match official, who refereed the 2002 final. “Where there is consistency on the field of play every decision is better.” FIFA and soccer’s rule-making panel known as IFAB want World Cup-style timekeeping to be adopted globally next season so 100-minute games should become routine in domestic leagues. Still, Collina did suggest soccer could one day look for inspiration from baseball to control the length of games. Baseball’s “mercy rule,” used at international tournaments and at some US collegiate levels, ends a game when one team builds a big lead after a certain number of innings. “Maybe in the future we may consider within the laws of the game to say that additional time has not to be given at the end of the match if there is a difference of ‘x’ goals between the teams,” Collina said. “At a certain stage we need to consider what is common sense or what is not.”","pubDate":"2023-03-10 02:51:46","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Man United beat Betis 4-1 in rousing response to Liverpool rout","link":"https://www.arabnews.com/node/2265971/football","keywords":null,"creator":["romulo"],"video_url":null,"description":"Fri, 2023-03-10 05:26 MANCHESTER, England: Marcus Rashford and Bruno Fernandes struck as Manchester United beat Real Betis 4-1 on Thursday and began the healing process after Sunday’s humiliating 7-0 rout by Liverpool. Erik ten Hag’s players delivered a rousing response to the defeat at Anfield, with the Europa League quarterfinals within reach after a commanding round-of-16 first-leg win. Antony and Wout Weghorst were also on target at Old Trafford, with Ayoze Perez scoring for Betis.Main category: FootballSport","content":"MANCHESTER, England: Marcus Rashford and Bruno Fernandes struck as Manchester United beat Real Betis 4-1 on Thursday and began the healing process after Sunday’s humiliating 7-0 rout by Liverpool. Erik ten Hag’s players delivered a rousing response to the defeat at Anfield, with the Europa League quarterfinals within reach after a commanding round-of-16 first-leg win. Antony and Wout Weghorst were also on target at Old Trafford, with Ayoze Perez scoring for Betis. United could have taken an even more commanding lead into next week’s second leg after Weghorst, Rashford and Antony all failed to capitalize on further openings. Ten Hag had given his players the chance to make amends for Sunday by naming an unchanged lineup to the one at Liverpool. It had the desired effect, with Rashford smashing United in front after six minutes. United could have extended the lead, but the game was even at halftime after on-loan Leicester forward Perez fired low shot past David de Gea in the 32nd. Antony put United back in front seven minutes into the second half with a curling effort into the top corner from outside of the box. Fernandes made it 3-1 when he headed in Luke Shaw’s corner in the 58th. Perhaps the biggest cheer of the night came when Weghorst lashed the ball home in the 82nd after missing a host of earlier chances. Substitute Sven Michel salvaged a 3-3 draw for Union Berlin against Union Saint-Gilloise with a goal a minute from the end in the German capital. Victor Boniface scored twice for Union Saint-Gilloise, including the go-ahead goal in the 72nd minute before Michel’s equalizer. The two sides already met in the group stage this season. The Belgian Union won 1-0 in Berlin while the German Union won by the same score in Brussels. At Stadio Olimpico in Rome, Jose Mourinho’s Roma made a step toward advancing with a 2-0 victory over Real Sociedad. Tammy Abraham set up the opening goal for Stephan El Shaarawy to finish a fast counter in the first half before substitute defender Marash Kumbulla doubled the advantage with a close-range header three minutes from time. Bayer Leverkusen had the same advantage over Ferencvaros after their first-leg game. Kerem Demirbay opened the scoring for Leverkusen in the 10th, and Edmond Tapsoba added the second toward the end for the hosts. EUROPA CONFERENCE LEAGUE Michail Antonio struck twice late in the first half to guide West Ham past AEK Larnaca 2-0 in Cyprus. Despite a troubled season in the Premier League, the Hammers have been cruising in the third-tier European competition with a perfect record. Said Benrahma crossed for Antonio’s first with the striker doubling the advantage in stoppage time for his first two goals in the European campaign this season. Manu Trigueros put Villarreal — a Champions League semifinalist last season, ahead in the first half before Anders Dreyer tied it at 1-1 with a second-half goal for Anderlecht in the draw in Brussels. Nice beat Sheriff away in Moldova 1-0.","pubDate":"2023-03-10 02:29:17","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Football's greatest revenge missions as Bournemouth aim to avenge 9-0 Liverpool defeat","link":"https://www.mirror.co.uk/sport/football/news/liverpool-bournemouth-man-utd-villa-29413142","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"A little over six months after shipping nine goals away to Liverpool, Bournemouth can follow some other Premier League sides in taking sweet revenge in the return fixture","content":"Bournemouth have made plenty of progress since their 9-0 loss at Anfield , but it will still sting for those involved in August. Six different Reds players were on target in a match which equalled the Cherries' worst ever league loss and ended up being the beginning of the end for then-manager Scott Parker . Bournemouth go into the reverse fixture bottom of the table under Parker's successor Gary O'Neil, but a spirited performance against Arsenal last time out might well give them hope. Suffering a heavy loss and then coming back to beat the same opponent later that year is easier said than done, but O'Neil's side wouldn't be the first to achieve the feat. Here, Mirror Football looks back at some other examples. Virgil van Dijk sends warning as Trent Alexander-Arnold and Mo Salah problem resurfaces Ex-Liverpool manager's daughter cashes in huge 350/1 bet on Man Utd thrashing Southampton v Leicester, 2019-20 For a while, Southampton's 9-0 loss at home to Leicester in October 2019 was all anyone could talk about when Ralph Hasenhuttl's side played on TV. Right up until they lost 9-0 at Manchester United the following season, which, yeah, it's not the best of reasons, is it? In the interim, though, Saints put the Leicester loss behind them in the best possible way. After allowing Ayoze Perez and Jamie Vardy to both hit hat-tricks at St Mary's, they fell behind to Dennis Praet's opener at the King Power Stadium, but came back to win 2-1 thanks to Danny Ings' late effort. Leicester had been second going into the game, but that kicked off a run of one win in seven which eventually saw them tailspin and miss out on the top four altogether. Southampton , meanwhile, recovered to finish 11th after dropping into the bottom three with that 9-0 loss. What is your favourite footballing revenge mission? Have your say in the comments section Southampton's home defeat was the joint-worst in Premier League history ( Image: Getty Images) \"It was a very important game for us this season to see how we play now - we have changed our mindset and worked hard to play in a successful way,\" Hasenhuttl said after the away win. \"Watching this team is enjoyable at the moment.\" Crystal Palace v Liverpool, 1989-90 If Liverpool need any motivation to avoid a slip-up on Saturday, all they'll need to do is look back 30-odd years. Back then, Kenny Dalglish's side thrashed Crystal Palace en route to the league title but saw their double dreams dashed by the same opponents. The 9-0 September win at Anfield was famous for coming via eight different scorers, with Steve Nicol the only man to bag a brace. The Reds also won 2-0 at Selhurst Park in January, but failed to make it three out of three in the FA Cup semi-finals. Palace's extra-time win sent them to Wembley ( Image: Mirrorpix) In a topsy-turvy game at Villa Park, Liverpool went in front early but trailed going into the final 10 minutes. A quickfire double from Steve McMahon and John Barnes restored their lead, only for Andy Gray to send the game into extra-time and Alan Pardew to deliver Palace's winner. Palace ended up falling short in the final, losing a replay to Manchester United after another dramatic draw at Wembley. However, the revenge against Liverpool - coupled with avoiding the drop - meant there were still plenty of positives. Wigan v Man Utd, 2011-12 Wigan's record against Man Utd was unspeakably bad going into their April 2012 meeting, with 14 defeats from 14. Back in the 2009-10 season, the Latics had lost 5-0 home and away against Alex Ferguson's side, and a Dimitar Berbatov hat-trick ensured they were beaten by the same scoreline on Boxing Day in 2011. Shaun Maloney gave Wigan their first ever win against Man Utd ( Image: Getty Images) When United came to the DW Stadium for the reverse fixture, Roberto Martinez's side were down in 19th. A first ever victory over the league leaders would have been useful, but history suggested it was far from likely. Unlikely doesn't mean impossible, though. Shaun Maloney cut in to score a 50th-minute winner under the lights, sparking a late break for survival while also denting the opposition's title hopes. \"Phil Dowd had a bad game and never got to grips with it, but Wigan were the better team and deserved it,\" Man Utd boss Ferguson said. \"It was one of these off-nights. It is unavoidable sometimes.\" West Germany v Hungary, 1954 World Cup A chance for revenge in the league will always be there if you lose the first meeting. In a major international tournament, though, this kind of thing is much rarer. West Germany came back from 2-0 down to win the 1954 World Cup final ( Image: Hulton Archive) It's not entirely without precedent, though. Portugal fluffed their lines in Euro 2004, losing to Greece in the group stage and the final, but West Germany had a better and more dramatic turnaround half a century earlier. Sepp Herberger's team were handed an 8-3 thrashing by the Magic Magyars in the group stage, with Sandor Kocsis scoring a hat-trick. A play-off victory over Turkey saw them through to the knockout rounds, though, with victories over Yugoslavia and Austria setting up a rematch in the final. When Hungary went 2-0 up inside 10 minutes, some might have feared another thrashing, but it was all square long before the break. In the 84th minute, Helmut Rahn popped up with his second and West Germany's third, denying the Hungarians a first World Cup. “Rahn was and is one of the last legends,” Franz Beckenbauer would later say, per The Ringer . “He shaped an entire generation.” Sweden under-21s v France under-21s, 2014 Layvin Kurzawa's joy was short-lived ( Image: JONATHAN NACKSTRAND/AFP via Getty Images) Not the heaviest of defeats, sure, but one of the sweeter revenge missions. And it's all down to how Les Bleus marked their victory. With no nations qualifying automatically for the European under-21 Championships, group winners France and Sweden were drawn together in a two-legged play-off. France won the first leg 2-0, and looked to have thwarted a dramatic Swedish turnaround in Halmstad when Layvin Kurzawa seemingly sent them through on away goals. Kurzawa, now at Fulham but then at Monaco, made a point of celebrating in the faces of the opposition after scoring with a diving header three minutes from time. There was still time for Oscar Lewicki to deliver a late winner, though, and you can guess how Sweden marked the occasion . Sunderland v Southampton, 2015 Sunderland's 8-0 defeat at Southampton in October 2014 was nothing short of calamitous. The Black Cats really lived up to the bad luck associated with the animal of their nickname, with three different players scoring own goals. Jordi Gomez completed Sunderland's revenge mission against Southampton ( Image: AFP/Getty Images) Manager Gus Poyet survived that defeat, but was sacked in the spring with his team fighting what looked increasingly like a losing battle against the drop. Dick Advocaat arrived after a six-game winless run, and the return game against Southampton was looming large. As it turns out, there was nothing for the strugglers to worry about. Two Jordi Gomez penalties brought a 2-1 win, with James Ward-Prowse sent off for the visitors, and Advocaat went on to lead his team to safety. Some may point to the eight winless games which saw Advocaat to get the sack at the start of the following season. That's hardly the point here, though. Man Utd v Spurs and Liverpool v Aston Villa, 2021 Liverpool left things very late against Aston Villa ( Image: Clive Brunskill/POOL/EPA-EFE/REX/Shutterstock) On one remarkable day in September 2020, Tottenham won 6-1 at Old Trafford and Liverpool - unbeaten since beginning their title defence - fell to a 7-2 loss away to Aston Villa. The wait for a shot at revenge was a long one, with the return fixtures not until April, but it was worth it. Spurs had topped the league in December, but by the spring even a top four finish looked unlikely. Son Heung-min gave them a half-time lead at home to United, but the visitors hit three after the break to increase the pressure on manager Jose Mourinho , who would be gone just days later. One day before the game at the Tottenham Hotspur Stadium, Liverpool welcomed Villa to Anfield looking to keep their own top four hopes alive. It wasn't a hammering, but the manner of the win - a comeback sealed in stoppage-time by Trent Alexander-Arnold - might have made it even sweeter. The combination of results lifted Jurgen Klopp's team above Spurs in the battle for Champions League football. Victory over Bournemouth on Saturday could do the same, but Liverpool will know it's often not quite that straightforward.","pubDate":"2023-03-10 02:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29415322.ece/ALTERNATES/s615/0_Liverpool-v-Bournemouth-Premier-League-Anfield.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sergija Ramosa optužili da je PSG nazvao ‘ku****** sinom‘, on se brani: ‘Rekao sam nešto potpuno drugo‘","link":"https://sportske.jutarnji.hr/sn/nogomet/liga-prvaka/sergija-ramosa-optuzili-da-je-psg-nazvao-ku-sinom-on-se-brani-rekao-sam-nesto-potpuno-drugo-15314086","keywords":["Liga prvaka"],"creator":null,"video_url":null,"description":"Nova sezona, stara priča. Paris Saint-Germain ispao je iz Lige prvaka već u osmini finala, kao i prošle godine, unatoč tomu što se mogu pohvaliti najatraktivnijim imenima nogometnog svijeta. Lionel Messi i Kylian Mbappe već su pokazali da mogu sve i svašta, ali riješiti prvi \"kompleks\" Parka prinčev...","content":"Nova sezona, stara priča. Paris Saint-Germain ispao je iz Lige prvaka već u osmini finala, kao i prošle godine, unatoč tomu što se mogu pohvaliti najatraktivnijim imenima nogometnog svijeta. Lionel Messi i Kylian Mbappe već su pokazali da mogu sve i svašta, ali riješiti prvi \"kompleks\" Parka prinčeva, to ne mogu. Barem ne još. Nakon utakmice na Alianz Areni, gdje je PSG poražen i u drugom ogledu protiv Bayerna (uk. 0:3), Argentinac i Francuz pretrpjeli su salvu kritika tamošnjih i stranih medija, ali najveće neugodnosti proživljavao je Sergio Ramos . Naime, kamere su uhvatile španjolskog braniča kako nešto govori samom sebi u trenutku kada je shvatio da za PSG nema budućnosti na ovosezonskom europskom podiju. U mnogim medijima čitači s usana ustvrdili su da Ramos \"sočno\" psuje, što i ne bi bio neki problem, da te psovke nisu bile na račun vlastitog kluba. - J**** kur** koja je rodila Pariz, kur***** sina - navodno je kazao stoper sebi \"u bradu\". Naravno, nije trebalo dugo da se video proširi društvenim mrežama, a navijačima se nije svidjelo viđeno, pa su mnogi vrijeđali stopera u komentarima. Stoga je Ramos bio primoran reagirati putem Twitter profila. Kaže, nepristojno se izražavao, ali uopće nije rekao ono za što ga optužuju, čak nije ni spomenuo ime kluba. \"Obično se ne nadovezujem na ovakve teme, ali ne želim da se govori nešto što se nije dogodilo. Ni u jednom trenutku nisam spomenuo Pariz, nego sam pustio razočarani ‘pssss‘ ili ‘pff‘ u kontekstu izraza (bezobraznog, priznajem) koji smo navikli koristiti u nogometu. Nemojmo izmišljati nešto čega nema\", napisao je Ramos. Bivši stoper Real Madrida imao je jednu dobru šansu protiv Bayerna nakon kornera, ali ipak nije naciljao okvir gola. Nakon utakmice poraženo je kazao: - Duboko sam razočaran, nismo bili na razini kakvu zahtjev aLiga prvaka. Nismo se pozabavili malim detaljima, a oni su ključni. Naš glavni cilj je nestao, to je bolno, ali prvaci se rađaju nakon poraza i kuju u nevoljama.","pubDate":"2023-03-10 08:00:26","image_url":"https://static.jutarnji.hr/images/slike/2023/03/10/28244807.jpg","source_id":"jutarnji","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Илиан Илиев: Трансферът на Босанчич е финансово изгоден за Черно море","link":"https://gong.bg/bg-football/efbet-liga/ilian-iliev-transferyt-na-bosanchich-e-finansovo-izgoden-za-cherno-more-724412","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Черно море спечели 7 точки от първите си четири мача и се намира в челната шестица. Именно това е първата цел на тима за този сезон. В интервю за Gong.bg треньорът на \"моряците\" Илиан Илиев коментира старта на тима във втория полусезон, предстоящото гостуване на шампиона Лудогорец и двата последни трансфера, които направи варненският клуб. - Г-н Илиев, как видяхте Черно море в първите четири пролетни мача? - От спечеленото на чужд терен съм доволен, но от представянето ни у дома – не, и това трябва да го променим, тъй като мачовете, които ни предстоят, са също толкова важни, колкото и предишните. Имаме контрол на мачовете у дома, но в завършващата фаза има много какво да се желае. За съжаление, опциите ни в атака са ограничени, тъй като новите играчи още не са получили права или са с проблеми. - Кое ви харесва в играта на тима и кои грешки не трябва да повтаряте? - Като държане и владеене на топката се подобрихме, а на моменти преходът ни като загубим топката също е добър. Необходимо е обаче да коригираме грешките, които допускаме в дефанзивен план, и заради които изгубихме точки. Особено голове като тези в последния мач, не бива да допускаме занапред. Искам да се подобрим във всяко едно отношение, но най-вече да не подценяваме дадени ситуации в защита и да реагираме по-добре на тях. - Защо напролет Черно море побеждава навън, а не успява да спечели на \"Тича\"? - На чужд терен имаме повече пространства и стават по-отворени мачове, докато у дома съперниците са по-затворени. Ние обаче тряба да намираме верните решения за противодействие срещу сгъстена защита. Другото е, че играем по-освободено като гости, а на свой терен с малко напрежение, може би, защото искаме да печелим победи на всяка цена и на \"Тича\". Но трябва да преодолеем това напрежение, за да се справяме по-добре и пред нашата публика, защото имаме тяхната подкрепа. - Излязохте с позиция за решението на ВАР срещу Черно море в последната среща. След като минаха няколко дни, какво мислите за това отсъждане, което отмени дузпа във ваша полза? - Прави ми впечатление, че се третират по различен начин такива ситуации. По време на това първенство в пет случая не ни дадоха дузпа за игра с ръка, в други ни дадоха, а пък в домакинството ни с Ботев Враца не отсъдиха дузпа за гостите при подобно положение. Явно критерият е различен, но това, което направи Станислав Тодоров в двубоя ни с Ботев Пловдив, е меко казано неразбираемо. Гледахме Челси и Дортмунд и там ВАР помогна на рефера да отсъди дузпа. Същата ситуация беше и на нашия мач, отсъди дузпа главния съдия, но Станислав Тодоров отмени решението му, много рядко ВАР би отменил дузпа при такова положение. Ако критериите на ВАР в България и Шампионска лига са различни, това е доста притеснително, или пък ВАР у нас облагодетелства определени отбори. - Лудогорец загуби последната си среща у дома, но вече има нов треньор. Как искате да се представи Черно море в неделя в Разград? - Това, което се случи в предния мач на Лудогорец, не е добре за нас, а качествата на Ивайло Петев са известни и няма какво да ги коментирам. Когато има нов треньор, има и различен импулс за играчите, и мобилизацията на Лудогорец срещу нас няма да е както от мача с Пирин, когато подцениха нещата. Не е идеален момент за Черно море това гостуване, но трябва да се справяме, тъй като много е сгъстено зад нас и пред нас в класирането, и се нуждаем от точки. - Само за няколко дни Черно море направи два трансфера. Как се стигна до продажбата на Петър Босанчич и завръщането на Влатко Дробаров? - Като се прибирахме от Благоевград, получихме съобщение от агента на Босанчич, че той има предложение, което е финансово изгодно за Черно море. Обсъдихме го с ръководството и се свързахме с Влатко, който беше свободен и след като се разбрахме с него, приехме офертата на латвийците за Петър. Този осъществен трансфер на Босанчич е добър от финансова гледна точка за клуба ни. - Дробаров не е играл дълго, а Даниел Димов още не е в оптимална форма, и това Ви затруднява при избора на втори централен защитник. - Не съм съгласен, че имаме трудности с избора за втори централен защитник за мача с Лудогорец. Росен Стефанов се представи много добре в подготовката и има пълното доверие, както на треньорите, така и на съотборниците си. При Влатко няма игрова практика, тъй като отдавна не е участвал в официални мачове, но е човек, който познава обстановката, тренирал е и физически е добре. Въпрос на време е да си върне формата. За Даниел е най-важно, че преодоля бързо травмата в глезена, въпреки че има още леки проблеми. По-трудното е свързано с нерва в десния крак, но с всеки изминал ден състоянието му се подобрява. - Кога ще може да разчитате на двамата бразилци и португалеца? - С бразилците е сложно заради работните визи, не зависи от нас, а от държавните институции. Надяваме се да получат скоро такива. Що се отнася до Едгар Пачеко, той няма такъв проблем, но пък дойде контузен. В последния мач за своя бивш тим, преди да разтрогне договора си, е получил разтежение и сега се възстановява. - Отново има четирима юноши на Черно море - Иван Дюлгеров, Виктор Попов, Илиан Илиев и Мартин Минчев, са повикани в националния отбор, това радва ли ви? - Естествено, че сме радостни и доволни. Това е признание за работата на всички в клуба през последните години. Да си там е признание, но идва и трудното, а то е, че те трябва да се опитат да помогнат на националния отбор да направи следващата крачка в развитието си, а именно да се опита да се пребори със силните противници в нашата група.","pubDate":"2023-03-10 07:40:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Моуриньо не остана доволен от резултата въпреки победата над Сосиедад","link":"https://gong.bg/football-sviat/liga-evropa/multimedia/video/mourinio-ne-ostana-dovolen-ot-rezultata-vypreki-pobedata-nad-sosiedad-724410","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Старши треньорът на Рома - Жозе Моуриньо, беше щастлив след успеха с 2:0 над Реал Сосиедад в първи 1/8-финален сблъсък между двата тима в турнира Лига Европа. Португалецът обаче не остана доволен от резултата и не го прие като „добър“, тъй като ще се разбере дали той е бил такъв едва след изиграването на реванша в Испания след седмица. „Хареса ми организацията в играта, старанието, емпатията на терена. Помагахме си един на друг. Трудно е да се играе срещу отбори, които използват схема \"диамант\" в средата на терена. Вече сме играли срещу такива като РБ Залцбург и Емполи, но е трудно. Трябваше да покажем силен характер, защото когато не владееш топката дълго време, психиката е от огромно значение. Контролирахме мача, въпреки че по-малко владеехме топката. Този резултат би бил добър, само ако не допуснем три гола в реванша. Никога не бих казал, че един резултат е добър след първия мач“, сподели Моуриньо. Gulliver/GettyImages 38 снимки Специалния обаче отново се оплака от късата резервна скамейка, с която разполага и си пожела да има някой от играчите на Байерн. „Пускането на Ел Шаарауи сред титулярите бе стратегически ход, но не бе лесно да избера. Нямам нападатели на пейката, дори Солбакен го няма. Спомням си вчерашния мач, в който Байерн имаше Гнабри, Сане и Мане на пейката. Щях да съм доволен да имам и само един от тях“, каза още Моуриньо. 💬 “It went to plan. All credit to the lads.” 🗣️ José Mourinho after tonight’s victory! 👉 https://t.co/Axg2KxHp40 #ASRoma #UEL #RomaRealSociedad pic.twitter.com/odoyjFJZZ3 — AS Roma English (@ASRomaEN) March 9, 2023","pubDate":"2023-03-10 07:34:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Юнайтед ще пробва да отмъкне млада звезда на Реал","link":"https://gong.bg/football-sviat/ispania/multimedia/video/iunajted-shte-probva-da-otmykne-mlada-zvezda-na-real-724407","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Манчестър Юнайтед има амбициозна цел да привлече в състава си халфа на Реал Мадрид Едуардо Камавинга. Почти сигурно Ерик тен Хаг ще получи солиден бюджет за летни попълнения, за да продължи възходящото развитие на отбора. Една от целите на нидерландския специалист е подсилване на халфовата линия, в която според него няма достатъчно дълбочина. Именно заради това той се е насочил към френския национал, твърди \"Фишайес\". В момента Юнайтед разполага с Каземиро, Кристиан Ериксен, Фред, Марсел Забитцер и Скот Мактоминей в средната си линия. Само първите трима обаче влизат в дългосрочните планове на Тен Хаг, като бъдещето на Мактоминей и Забитцер е неясно, като шотландецът вероятно ще бъде продаден, а австриецът ще се завърне в Байерн след изтичане на наема му. Така подсилване на халфовата линия ще е от ключово значение, а в клуба са се насочили към доста амбициозна цел в лицето на Камавинга. Твърди се, че на \"Олд Трафорд\" са готови да извадят 130 милиона евро в опит на изкушат Реал да се раздели с този футболист. Дори и такава сума обаче може да се окаже недостатъчна за привличането на Камавинга. 20-годишният френски национал бе взет на \"Сантиаго Бернабеу\" през 2021 година с идеята да бъде дългосрочна алтернатива на Лука Модрич и Тони Кроос. Така че \"белия балет\" много трудно ще се раздели с него, още повече, че футболистът показва сериозно развитие откакто пристигна в клуба. До момента той има 79 мача, 2 гола и 3 асистенции за мадридчани.","pubDate":"2023-03-10 07:22:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Тежък удар за Славия","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/tezhyk-udar-za-slaviia-724406","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"След трите поредни загуби минорното настроение в Славия се задълбочава и от новините за състоянието на халфа Иван Минчев. Техничарят от Казанлък, който преди време стигна и до националния отбор, записа само един официален мач за 2023-а година. Той започна при поражението от Хебър Пазарджик и бе сменен в 80-ата минута. След това треньорският щаб го е гласял за титуляр и срещу Ботев Враца, но в последния момент той е отпаднал от състава. Прегледът е показал, че има друго разкъсване на мускула, пише „Мач Телеграф“. Сега ще трябва да почине по-дълго и ще е на разположение чак през месец април. Lap.bg 38 снимки Минчев не игра заради травма в мачовете с Пирин и Лудогорец. Така Галин Иванов е без алтернатива и единствено другият ветеран Дарко Тасевски е опция пред треньора Златомир Загорчич. „Белите“ имат сериозни проблеми в средата на терена след трансфер на Кемело Нгуена в латвийския ФК Рига. Младите таланти Крум Стоянов и Чунг Нгуен До все още не са готови да играят решителна роля в тежките битки от елита.","pubDate":"2023-03-10 07:16:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Brighton and Ecuador star makes Grimsby Town statement ahead of FA Cup quarter-final tie","link":"https://www.grimsbytelegraph.co.uk/sport/football/football-news/brighton-star-makes-grimsby-statement-8230356","keywords":["Sport"],"creator":["newsdesk@grimsbytelegraph.co.uk (Sam Allen)"],"video_url":null,"description":"The Mariners take on Roberto De Zerbi's high-flying Brighton side in the FA Cup quarter-finals","content":"Brighton and Hove Albion star Moises Caicedo has said they will not take Grimsby Town lightly when they meet in the FA Cup quarter-finals on March 19. It has been quite the journey so far for Paul Hurst’s Mariners team to reach the last eight for the first time in 84 years, with records broken and expectations defied on multiple occasions. It will be the second away game in a row against Premier League opposition when Town take on the Seagulls, but arguably another step up in competition with Brighton pushing for European football in what has been a stellar league campaign for them so far. READ MORE: Evan Khouri handed rare Grimsby Town start as young prospect continues to impress Paul Hurst 21-year-old Caicedo, who played for his native Ecuador at the recent World Cup in Qatar, is one of the many young stars in Roberto De Zerbi’s Brighton team having missed just one league game all season playing as a defensive midfielder. The ultimate goal for Caicedo and Brighton this season is to break into the top four and play in the Champions League next season and if not that at least secure European football. However, as the third-highest-ranked team of the eight left in the FA Cup, they also sense an opportunity to win silverware. On paper, a home tie against Grimsby was the best possible draw for De Zerbi’s side in that quest for cup glory, but Caceido and his Brighton teammates will not be taking them lightly when they face off at the Amex on Sunday, March 19. The Ecuadorian international said: “We are trying to get into the Champions League. That is the dream of the team, to get to the highest point possible and bring happiness to the fans, who are always supporting us. It will be very difficult, but we are very convinced we can do it together. We want to keep going until the end and we are sure we will do it. “We know this cup is something we have to fight for, as well, and give our all against any team we come up against. We are not under any illusions, we know Grimsby will still be a very hard opponent. Every game is different, but I know how important it is for Brighton. We will give everything to try and bring this cup here to Brighton.” READ NEXT Latest Grimsby Town updates and transfer news Grimsby Town's mission to resurrect home superiority continues after Newport County display Grimsby Town supporters snap up tickets for historic FA Cup quarter-final away at Brighton Paul Hurst provides Kieran Green update with his month-long absence felt at Grimsby Town 'Hard watch' - Paul Hurst's brutal assessment of Grimsby Town home draw with Newport County","pubDate":"2023-03-10 06:00:00","image_url":"https://i2-prod.sussexlive.co.uk/sport/football/football-news/article8215546.ece/ALTERNATES/s615/0_GettyImages-1471208872.jpg","source_id":"grimsbytetelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AC Milan Enggan Jemawa di Liga Champions","link":"https://sport.detik.com/sepakbola/uefa/d-6610754/ac-milan-enggan-jemawa-di-liga-champions","keywords":null,"creator":null,"video_url":null,"description":"AC Milan melaju ke perempatfinal Liga Champions. Rossoneri sadar diri kualitas mereka masih di bawah tim-tim lainnya semisal Bayern Munich atau Real Madrid.","content":"AC Milan Enggan Jemawa di Liga Champions Bayu Baskoro - Sepakbola Jumat, 10 Mar 2023 10:40 WIB AC Milan lolos ke perempatfinal Liga Champions. (Foto: Getty Images/Craig Mercer/MB Media) Milan - AC Milan melaju ke perempatfinal Liga Champions . Rossoneri sadar diri kualitas mereka masih di bawah tim-tim lainnya semisal Bayern Munich atau Real Madrid. Milan melaju ke delapan besar usai menyingkirkan wakil Inggris, Tottenham Hotspur. Pasukan Stefano Pioli menang agregat 1-0 atas The Lilywhites. Ini menjadi keberhasilan pertama Milan ke perempatfinal Liga Champions dalam sedekade. Kali terakhir mereka melakukannya pada 2012. ADVERTISEMENT SCROLL TO RESUME CONTENT Baca juga: AC Milan, Raksasa Eropa yang Coba Bangun dari Tidur AC Milan sendiri bisa dibilang salah satu raksasa Eropa. Klub yang bermarkas di San Siro itu punya 7 titel Liga Champions, hanya kalah dari Real Madrid (14). Kali terakhir Milan mengangkat gelar Liga Champions yakni pada 2007. Antusiasme kepada Rossoneri untuk bisa meraih lagi Trofi Si Kuping Besar pun membuncah seiring keberhasilan mereka lolos ke perempatfinal. Direktur teknik Milan, Paolo Maldini , punya pendapat berbeda. Menurutnya, Olivier Giroud cs masih jauh untuk dapat mengakhiri puasa gelar Liga Champions. Baca juga: Milan ke Perempatfinal Liga Champions, Pioli: Tak Ada yang Mustahil [Gambas:Twitter] \"Tujuan kami musim ini adalah finis di empat besar dan melewati babak penyisihan grup Liga Champions. Ini akan sulit di Serie A, tetapi kami harus mendapatkan tempat itu,\" kata Maldini, dikutip dari Football Italia . \"Saya lebih suka menghindari klub Italia lainnya, karena kami ingin lebih banyak tim Serie A melangkah sejauh mungkin. Tidak masalah siapa yang kami dapatkan pada tahap ini, kami tidak merasa kami berada di level yang sama dengan Bayern Munich, Manchester City, atau Real Madrid,\" ujarnya. Baca juga: Maju ke Perempatfinal Liga Champions, Milan Tidak Takut Siapapun! Simak Video \" Singkirkan Tottenham, AC Milan Lolos ke Perempatfinal Liga Champions \" [Gambas:Video 20detik] (bay/bay) ac milan paolo maldini liga champions liga champions 2022/2023","pubDate":"2023-03-10 03:40:35","image_url":null,"source_id":"detik","category":["sports"],"country":["indonesia"],"language":"indonesian"},{"title":"FIFA head of refs wants all stoppage time added in blowouts","link":"https://www.arabnews.com/node/2265976/football","keywords":null,"creator":["romulo"],"video_url":null,"description":"Fri, 2023-03-10 05:45 GENEVA: FIFA wants full stoppage time added even in blowouts though its refereeing chief said Thursday a “mercy rule” that baseball uses at some levels could be debated in the future to end games at 90 minutes. Liverpool’s 7-0 rout of Manchester United on Sunday had only three minutes added at the end despite six-second-half goals, FIFA head of refereeing Pierluigi Collina told reporters in a briefing.Main category: FootballSport","content":"GENEVA: FIFA wants full stoppage time added even in blowouts though its refereeing chief said Thursday a “mercy rule” that baseball uses at some levels could be debated in the future to end games at 90 minutes. Liverpool’s 7-0 rout of Manchester United on Sunday had only three minutes added at the end despite six-second-half goals, FIFA head of refereeing Pierluigi Collina told reporters in a briefing. The 2022 World Cup in Qatar showcased a push by FIFA and Collina to give fans more entertainment by having referees add accurate amounts for stoppages such as goal celebrations, substitutions, injuries and time-wasting. It led to so-called 100-minute games and meant Spain’s 7-0 rout of Costa Rica in the group stage had eight minutes of added time, Collina said. It let Alvaro Morata score the seventh goal. Though Morata’s goal was not crucial in the final Group E standings, Spain did advance ahead of Germany on the tiebreaker of goal difference. “In some competitions the goal difference in the entire competition may be decisive at the end for the ranking,” Collina said. “So even one goal scored or not scored could make the difference.” In 1989, Arsenal won the English league title over Liverpool on the tiebreaker of goals scored with the teams’ goal difference identical. The teams met in the last game of the season and Arsenal’s 2-0 win at Liverpool was sealed by a goal in second-half stoppage time. Collina acknowledged that lengthy added time in games such as Liverpool’s lopsided win last weekend could be viewed as “something not really understandable,” though he suggested consistency was key. “At the World Cup people knew what to expect,” said the former top match official, who refereed the 2002 final. “Where there is consistency on the field of play every decision is better.” FIFA and soccer’s rule-making panel known as IFAB want World Cup-style timekeeping to be adopted globally next season so 100-minute games should become routine in domestic leagues. Still, Collina did suggest soccer could one day look for inspiration from baseball to control the length of games. Baseball’s “mercy rule,” used at international tournaments and at some US collegiate levels, ends a game when one team builds a big lead after a certain number of innings. “Maybe in the future we may consider within the laws of the game to say that additional time has not to be given at the end of the match if there is a difference of ‘x’ goals between the teams,” Collina said. “At a certain stage we need to consider what is common sense or what is not.”","pubDate":"2023-03-10 02:51:46","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Man United beat Betis 4-1 in rousing response to Liverpool rout","link":"https://www.arabnews.com/node/2265971/football","keywords":null,"creator":["romulo"],"video_url":null,"description":"Fri, 2023-03-10 05:26 MANCHESTER, England: Marcus Rashford and Bruno Fernandes struck as Manchester United beat Real Betis 4-1 on Thursday and began the healing process after Sunday’s humiliating 7-0 rout by Liverpool. Erik ten Hag’s players delivered a rousing response to the defeat at Anfield, with the Europa League quarterfinals within reach after a commanding round-of-16 first-leg win. Antony and Wout Weghorst were also on target at Old Trafford, with Ayoze Perez scoring for Betis.Main category: FootballSport","content":"MANCHESTER, England: Marcus Rashford and Bruno Fernandes struck as Manchester United beat Real Betis 4-1 on Thursday and began the healing process after Sunday’s humiliating 7-0 rout by Liverpool. Erik ten Hag’s players delivered a rousing response to the defeat at Anfield, with the Europa League quarterfinals within reach after a commanding round-of-16 first-leg win. Antony and Wout Weghorst were also on target at Old Trafford, with Ayoze Perez scoring for Betis. United could have taken an even more commanding lead into next week’s second leg after Weghorst, Rashford and Antony all failed to capitalize on further openings. Ten Hag had given his players the chance to make amends for Sunday by naming an unchanged lineup to the one at Liverpool. It had the desired effect, with Rashford smashing United in front after six minutes. United could have extended the lead, but the game was even at halftime after on-loan Leicester forward Perez fired low shot past David de Gea in the 32nd. Antony put United back in front seven minutes into the second half with a curling effort into the top corner from outside of the box. Fernandes made it 3-1 when he headed in Luke Shaw’s corner in the 58th. Perhaps the biggest cheer of the night came when Weghorst lashed the ball home in the 82nd after missing a host of earlier chances. Substitute Sven Michel salvaged a 3-3 draw for Union Berlin against Union Saint-Gilloise with a goal a minute from the end in the German capital. Victor Boniface scored twice for Union Saint-Gilloise, including the go-ahead goal in the 72nd minute before Michel’s equalizer. The two sides already met in the group stage this season. The Belgian Union won 1-0 in Berlin while the German Union won by the same score in Brussels. At Stadio Olimpico in Rome, Jose Mourinho’s Roma made a step toward advancing with a 2-0 victory over Real Sociedad. Tammy Abraham set up the opening goal for Stephan El Shaarawy to finish a fast counter in the first half before substitute defender Marash Kumbulla doubled the advantage with a close-range header three minutes from time. Bayer Leverkusen had the same advantage over Ferencvaros after their first-leg game. Kerem Demirbay opened the scoring for Leverkusen in the 10th, and Edmond Tapsoba added the second toward the end for the hosts. EUROPA CONFERENCE LEAGUE Michail Antonio struck twice late in the first half to guide West Ham past AEK Larnaca 2-0 in Cyprus. Despite a troubled season in the Premier League, the Hammers have been cruising in the third-tier European competition with a perfect record. Said Benrahma crossed for Antonio’s first with the striker doubling the advantage in stoppage time for his first two goals in the European campaign this season. Manu Trigueros put Villarreal — a Champions League semifinalist last season, ahead in the first half before Anders Dreyer tied it at 1-1 with a second-half goal for Anderlecht in the draw in Brussels. Nice beat Sheriff away in Moldova 1-0.","pubDate":"2023-03-10 02:29:17","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Football's greatest revenge missions as Bournemouth aim to avenge 9-0 Liverpool defeat","link":"https://www.mirror.co.uk/sport/football/news/liverpool-bournemouth-man-utd-villa-29413142","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"A little over six months after shipping nine goals away to Liverpool, Bournemouth can follow some other Premier League sides in taking sweet revenge in the return fixture","content":"Bournemouth have made plenty of progress since their 9-0 loss at Anfield , but it will still sting for those involved in August. Six different Reds players were on target in a match which equalled the Cherries' worst ever league loss and ended up being the beginning of the end for then-manager Scott Parker . Bournemouth go into the reverse fixture bottom of the table under Parker's successor Gary O'Neil, but a spirited performance against Arsenal last time out might well give them hope. Suffering a heavy loss and then coming back to beat the same opponent later that year is easier said than done, but O'Neil's side wouldn't be the first to achieve the feat. Here, Mirror Football looks back at some other examples. Virgil van Dijk sends warning as Trent Alexander-Arnold and Mo Salah problem resurfaces Ex-Liverpool manager's daughter cashes in huge 350/1 bet on Man Utd thrashing Southampton v Leicester, 2019-20 For a while, Southampton's 9-0 loss at home to Leicester in October 2019 was all anyone could talk about when Ralph Hasenhuttl's side played on TV. Right up until they lost 9-0 at Manchester United the following season, which, yeah, it's not the best of reasons, is it? In the interim, though, Saints put the Leicester loss behind them in the best possible way. After allowing Ayoze Perez and Jamie Vardy to both hit hat-tricks at St Mary's, they fell behind to Dennis Praet's opener at the King Power Stadium, but came back to win 2-1 thanks to Danny Ings' late effort. Leicester had been second going into the game, but that kicked off a run of one win in seven which eventually saw them tailspin and miss out on the top four altogether. Southampton , meanwhile, recovered to finish 11th after dropping into the bottom three with that 9-0 loss. What is your favourite footballing revenge mission? Have your say in the comments section Southampton's home defeat was the joint-worst in Premier League history ( Image: Getty Images) \"It was a very important game for us this season to see how we play now - we have changed our mindset and worked hard to play in a successful way,\" Hasenhuttl said after the away win. \"Watching this team is enjoyable at the moment.\" Crystal Palace v Liverpool, 1989-90 If Liverpool need any motivation to avoid a slip-up on Saturday, all they'll need to do is look back 30-odd years. Back then, Kenny Dalglish's side thrashed Crystal Palace en route to the league title but saw their double dreams dashed by the same opponents. The 9-0 September win at Anfield was famous for coming via eight different scorers, with Steve Nicol the only man to bag a brace. The Reds also won 2-0 at Selhurst Park in January, but failed to make it three out of three in the FA Cup semi-finals. Palace's extra-time win sent them to Wembley ( Image: Mirrorpix) In a topsy-turvy game at Villa Park, Liverpool went in front early but trailed going into the final 10 minutes. A quickfire double from Steve McMahon and John Barnes restored their lead, only for Andy Gray to send the game into extra-time and Alan Pardew to deliver Palace's winner. Palace ended up falling short in the final, losing a replay to Manchester United after another dramatic draw at Wembley. However, the revenge against Liverpool - coupled with avoiding the drop - meant there were still plenty of positives. Wigan v Man Utd, 2011-12 Wigan's record against Man Utd was unspeakably bad going into their April 2012 meeting, with 14 defeats from 14. Back in the 2009-10 season, the Latics had lost 5-0 home and away against Alex Ferguson's side, and a Dimitar Berbatov hat-trick ensured they were beaten by the same scoreline on Boxing Day in 2011. Shaun Maloney gave Wigan their first ever win against Man Utd ( Image: Getty Images) When United came to the DW Stadium for the reverse fixture, Roberto Martinez's side were down in 19th. A first ever victory over the league leaders would have been useful, but history suggested it was far from likely. Unlikely doesn't mean impossible, though. Shaun Maloney cut in to score a 50th-minute winner under the lights, sparking a late break for survival while also denting the opposition's title hopes. \"Phil Dowd had a bad game and never got to grips with it, but Wigan were the better team and deserved it,\" Man Utd boss Ferguson said. \"It was one of these off-nights. It is unavoidable sometimes.\" West Germany v Hungary, 1954 World Cup A chance for revenge in the league will always be there if you lose the first meeting. In a major international tournament, though, this kind of thing is much rarer. West Germany came back from 2-0 down to win the 1954 World Cup final ( Image: Hulton Archive) It's not entirely without precedent, though. Portugal fluffed their lines in Euro 2004, losing to Greece in the group stage and the final, but West Germany had a better and more dramatic turnaround half a century earlier. Sepp Herberger's team were handed an 8-3 thrashing by the Magic Magyars in the group stage, with Sandor Kocsis scoring a hat-trick. A play-off victory over Turkey saw them through to the knockout rounds, though, with victories over Yugoslavia and Austria setting up a rematch in the final. When Hungary went 2-0 up inside 10 minutes, some might have feared another thrashing, but it was all square long before the break. In the 84th minute, Helmut Rahn popped up with his second and West Germany's third, denying the Hungarians a first World Cup. “Rahn was and is one of the last legends,” Franz Beckenbauer would later say, per The Ringer . “He shaped an entire generation.” Sweden under-21s v France under-21s, 2014 Layvin Kurzawa's joy was short-lived ( Image: JONATHAN NACKSTRAND/AFP via Getty Images) Not the heaviest of defeats, sure, but one of the sweeter revenge missions. And it's all down to how Les Bleus marked their victory. With no nations qualifying automatically for the European under-21 Championships, group winners France and Sweden were drawn together in a two-legged play-off. France won the first leg 2-0, and looked to have thwarted a dramatic Swedish turnaround in Halmstad when Layvin Kurzawa seemingly sent them through on away goals. Kurzawa, now at Fulham but then at Monaco, made a point of celebrating in the faces of the opposition after scoring with a diving header three minutes from time. There was still time for Oscar Lewicki to deliver a late winner, though, and you can guess how Sweden marked the occasion . Sunderland v Southampton, 2015 Sunderland's 8-0 defeat at Southampton in October 2014 was nothing short of calamitous. The Black Cats really lived up to the bad luck associated with the animal of their nickname, with three different players scoring own goals. Jordi Gomez completed Sunderland's revenge mission against Southampton ( Image: AFP/Getty Images) Manager Gus Poyet survived that defeat, but was sacked in the spring with his team fighting what looked increasingly like a losing battle against the drop. Dick Advocaat arrived after a six-game winless run, and the return game against Southampton was looming large. As it turns out, there was nothing for the strugglers to worry about. Two Jordi Gomez penalties brought a 2-1 win, with James Ward-Prowse sent off for the visitors, and Advocaat went on to lead his team to safety. Some may point to the eight winless games which saw Advocaat to get the sack at the start of the following season. That's hardly the point here, though. Man Utd v Spurs and Liverpool v Aston Villa, 2021 Liverpool left things very late against Aston Villa ( Image: Clive Brunskill/POOL/EPA-EFE/REX/Shutterstock) On one remarkable day in September 2020, Tottenham won 6-1 at Old Trafford and Liverpool - unbeaten since beginning their title defence - fell to a 7-2 loss away to Aston Villa. The wait for a shot at revenge was a long one, with the return fixtures not until April, but it was worth it. Spurs had topped the league in December, but by the spring even a top four finish looked unlikely. Son Heung-min gave them a half-time lead at home to United, but the visitors hit three after the break to increase the pressure on manager Jose Mourinho , who would be gone just days later. One day before the game at the Tottenham Hotspur Stadium, Liverpool welcomed Villa to Anfield looking to keep their own top four hopes alive. It wasn't a hammering, but the manner of the win - a comeback sealed in stoppage-time by Trent Alexander-Arnold - might have made it even sweeter. The combination of results lifted Jurgen Klopp's team above Spurs in the battle for Champions League football. Victory over Bournemouth on Saturday could do the same, but Liverpool will know it's often not quite that straightforward.","pubDate":"2023-03-10 02:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29415322.ece/ALTERNATES/s615/0_Liverpool-v-Bournemouth-Premier-League-Anfield.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sergija Ramosa optužili da je PSG nazvao ‘ku****** sinom‘, on se brani: ‘Rekao sam nešto potpuno drugo‘","link":"https://sportske.jutarnji.hr/sn/nogomet/liga-prvaka/sergija-ramosa-optuzili-da-je-psg-nazvao-ku-sinom-on-se-brani-rekao-sam-nesto-potpuno-drugo-15314086","keywords":["Liga prvaka"],"creator":null,"video_url":null,"description":"Nova sezona, stara priča. Paris Saint-Germain ispao je iz Lige prvaka već u osmini finala, kao i prošle godine, unatoč tomu što se mogu pohvaliti najatraktivnijim imenima nogometnog svijeta. Lionel Messi i Kylian Mbappe već su pokazali da mogu sve i svašta, ali riješiti prvi \"kompleks\" Parka prinčev...","content":"Nova sezona, stara priča. Paris Saint-Germain ispao je iz Lige prvaka već u osmini finala, kao i prošle godine, unatoč tomu što se mogu pohvaliti najatraktivnijim imenima nogometnog svijeta. Lionel Messi i Kylian Mbappe već su pokazali da mogu sve i svašta, ali riješiti prvi \"kompleks\" Parka prinčeva, to ne mogu. Barem ne još. Nakon utakmice na Alianz Areni, gdje je PSG poražen i u drugom ogledu protiv Bayerna (uk. 0:3), Argentinac i Francuz pretrpjeli su salvu kritika tamošnjih i stranih medija, ali najveće neugodnosti proživljavao je Sergio Ramos . Naime, kamere su uhvatile španjolskog braniča kako nešto govori samom sebi u trenutku kada je shvatio da za PSG nema budućnosti na ovosezonskom europskom podiju. U mnogim medijima čitači s usana ustvrdili su da Ramos \"sočno\" psuje, što i ne bi bio neki problem, da te psovke nisu bile na račun vlastitog kluba. - J**** kur** koja je rodila Pariz, kur***** sina - navodno je kazao stoper sebi \"u bradu\". Naravno, nije trebalo dugo da se video proširi društvenim mrežama, a navijačima se nije svidjelo viđeno, pa su mnogi vrijeđali stopera u komentarima. Stoga je Ramos bio primoran reagirati putem Twitter profila. Kaže, nepristojno se izražavao, ali uopće nije rekao ono za što ga optužuju, čak nije ni spomenuo ime kluba. \"Obično se ne nadovezujem na ovakve teme, ali ne želim da se govori nešto što se nije dogodilo. Ni u jednom trenutku nisam spomenuo Pariz, nego sam pustio razočarani ‘pssss‘ ili ‘pff‘ u kontekstu izraza (bezobraznog, priznajem) koji smo navikli koristiti u nogometu. Nemojmo izmišljati nešto čega nema\", napisao je Ramos. Bivši stoper Real Madrida imao je jednu dobru šansu protiv Bayerna nakon kornera, ali ipak nije naciljao okvir gola. Nakon utakmice poraženo je kazao: - Duboko sam razočaran, nismo bili na razini kakvu zahtjev aLiga prvaka. Nismo se pozabavili malim detaljima, a oni su ključni. Naš glavni cilj je nestao, to je bolno, ali prvaci se rađaju nakon poraza i kuju u nevoljama.","pubDate":"2023-03-10 08:00:26","image_url":"https://static.jutarnji.hr/images/slike/2023/03/10/28244807.jpg","source_id":"jutarnji","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Илиан Илиев: Трансферът на Босанчич е финансово изгоден за Черно море","link":"https://gong.bg/bg-football/efbet-liga/ilian-iliev-transferyt-na-bosanchich-e-finansovo-izgoden-za-cherno-more-724412","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Черно море спечели 7 точки от първите си четири мача и се намира в челната шестица. Именно това е първата цел на тима за този сезон. В интервю за Gong.bg треньорът на \"моряците\" Илиан Илиев коментира старта на тима във втория полусезон, предстоящото гостуване на шампиона Лудогорец и двата последни трансфера, които направи варненският клуб. - Г-н Илиев, как видяхте Черно море в първите четири пролетни мача? - От спечеленото на чужд терен съм доволен, но от представянето ни у дома – не, и това трябва да го променим, тъй като мачовете, които ни предстоят, са също толкова важни, колкото и предишните. Имаме контрол на мачовете у дома, но в завършващата фаза има много какво да се желае. За съжаление, опциите ни в атака са ограничени, тъй като новите играчи още не са получили права или са с проблеми. - Кое ви харесва в играта на тима и кои грешки не трябва да повтаряте? - Като държане и владеене на топката се подобрихме, а на моменти преходът ни като загубим топката също е добър. Необходимо е обаче да коригираме грешките, които допускаме в дефанзивен план, и заради които изгубихме точки. Особено голове като тези в последния мач, не бива да допускаме занапред. Искам да се подобрим във всяко едно отношение, но най-вече да не подценяваме дадени ситуации в защита и да реагираме по-добре на тях. - Защо напролет Черно море побеждава навън, а не успява да спечели на \"Тича\"? - На чужд терен имаме повече пространства и стават по-отворени мачове, докато у дома съперниците са по-затворени. Ние обаче тряба да намираме верните решения за противодействие срещу сгъстена защита. Другото е, че играем по-освободено като гости, а на свой терен с малко напрежение, може би, защото искаме да печелим победи на всяка цена и на \"Тича\". Но трябва да преодолеем това напрежение, за да се справяме по-добре и пред нашата публика, защото имаме тяхната подкрепа. - Излязохте с позиция за решението на ВАР срещу Черно море в последната среща. След като минаха няколко дни, какво мислите за това отсъждане, което отмени дузпа във ваша полза? - Прави ми впечатление, че се третират по различен начин такива ситуации. По време на това първенство в пет случая не ни дадоха дузпа за игра с ръка, в други ни дадоха, а пък в домакинството ни с Ботев Враца не отсъдиха дузпа за гостите при подобно положение. Явно критерият е различен, но това, което направи Станислав Тодоров в двубоя ни с Ботев Пловдив, е меко казано неразбираемо. Гледахме Челси и Дортмунд и там ВАР помогна на рефера да отсъди дузпа. Същата ситуация беше и на нашия мач, отсъди дузпа главния съдия, но Станислав Тодоров отмени решението му, много рядко ВАР би отменил дузпа при такова положение. Ако критериите на ВАР в България и Шампионска лига са различни, това е доста притеснително, или пък ВАР у нас облагодетелства определени отбори. - Лудогорец загуби последната си среща у дома, но вече има нов треньор. Как искате да се представи Черно море в неделя в Разград? - Това, което се случи в предния мач на Лудогорец, не е добре за нас, а качествата на Ивайло Петев са известни и няма какво да ги коментирам. Когато има нов треньор, има и различен импулс за играчите, и мобилизацията на Лудогорец срещу нас няма да е както от мача с Пирин, когато подцениха нещата. Не е идеален момент за Черно море това гостуване, но трябва да се справяме, тъй като много е сгъстено зад нас и пред нас в класирането, и се нуждаем от точки. - Само за няколко дни Черно море направи два трансфера. Как се стигна до продажбата на Петър Босанчич и завръщането на Влатко Дробаров? - Като се прибирахме от Благоевград, получихме съобщение от агента на Босанчич, че той има предложение, което е финансово изгодно за Черно море. Обсъдихме го с ръководството и се свързахме с Влатко, който беше свободен и след като се разбрахме с него, приехме офертата на латвийците за Петър. Този осъществен трансфер на Босанчич е добър от финансова гледна точка за клуба ни. - Дробаров не е играл дълго, а Даниел Димов още не е в оптимална форма, и това Ви затруднява при избора на втори централен защитник. - Не съм съгласен, че имаме трудности с избора за втори централен защитник за мача с Лудогорец. Росен Стефанов се представи много добре в подготовката и има пълното доверие, както на треньорите, така и на съотборниците си. При Влатко няма игрова практика, тъй като отдавна не е участвал в официални мачове, но е човек, който познава обстановката, тренирал е и физически е добре. Въпрос на време е да си върне формата. За Даниел е най-важно, че преодоля бързо травмата в глезена, въпреки че има още леки проблеми. По-трудното е свързано с нерва в десния крак, но с всеки изминал ден състоянието му се подобрява. - Кога ще може да разчитате на двамата бразилци и португалеца? - С бразилците е сложно заради работните визи, не зависи от нас, а от държавните институции. Надяваме се да получат скоро такива. Що се отнася до Едгар Пачеко, той няма такъв проблем, но пък дойде контузен. В последния мач за своя бивш тим, преди да разтрогне договора си, е получил разтежение и сега се възстановява. - Отново има четирима юноши на Черно море - Иван Дюлгеров, Виктор Попов, Илиан Илиев и Мартин Минчев, са повикани в националния отбор, това радва ли ви? - Естествено, че сме радостни и доволни. Това е признание за работата на всички в клуба през последните години. Да си там е признание, но идва и трудното, а то е, че те трябва да се опитат да помогнат на националния отбор да направи следващата крачка в развитието си, а именно да се опита да се пребори със силните противници в нашата група.","pubDate":"2023-03-10 07:40:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Моуриньо не остана доволен от резултата въпреки победата над Сосиедад","link":"https://gong.bg/football-sviat/liga-evropa/multimedia/video/mourinio-ne-ostana-dovolen-ot-rezultata-vypreki-pobedata-nad-sosiedad-724410","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Старши треньорът на Рома - Жозе Моуриньо, беше щастлив след успеха с 2:0 над Реал Сосиедад в първи 1/8-финален сблъсък между двата тима в турнира Лига Европа. Португалецът обаче не остана доволен от резултата и не го прие като „добър“, тъй като ще се разбере дали той е бил такъв едва след изиграването на реванша в Испания след седмица. „Хареса ми организацията в играта, старанието, емпатията на терена. Помагахме си един на друг. Трудно е да се играе срещу отбори, които използват схема \"диамант\" в средата на терена. Вече сме играли срещу такива като РБ Залцбург и Емполи, но е трудно. Трябваше да покажем силен характер, защото когато не владееш топката дълго време, психиката е от огромно значение. Контролирахме мача, въпреки че по-малко владеехме топката. Този резултат би бил добър, само ако не допуснем три гола в реванша. Никога не бих казал, че един резултат е добър след първия мач“, сподели Моуриньо. Gulliver/GettyImages 38 снимки Специалния обаче отново се оплака от късата резервна скамейка, с която разполага и си пожела да има някой от играчите на Байерн. „Пускането на Ел Шаарауи сред титулярите бе стратегически ход, но не бе лесно да избера. Нямам нападатели на пейката, дори Солбакен го няма. Спомням си вчерашния мач, в който Байерн имаше Гнабри, Сане и Мане на пейката. Щях да съм доволен да имам и само един от тях“, каза още Моуриньо. 💬 “It went to plan. All credit to the lads.” 🗣️ José Mourinho after tonight’s victory! 👉 https://t.co/Axg2KxHp40 #ASRoma #UEL #RomaRealSociedad pic.twitter.com/odoyjFJZZ3 — AS Roma English (@ASRomaEN) March 9, 2023","pubDate":"2023-03-10 07:34:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Юнайтед ще пробва да отмъкне млада звезда на Реал","link":"https://gong.bg/football-sviat/ispania/multimedia/video/iunajted-shte-probva-da-otmykne-mlada-zvezda-na-real-724407","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Манчестър Юнайтед има амбициозна цел да привлече в състава си халфа на Реал Мадрид Едуардо Камавинга. Почти сигурно Ерик тен Хаг ще получи солиден бюджет за летни попълнения, за да продължи възходящото развитие на отбора. Една от целите на нидерландския специалист е подсилване на халфовата линия, в която според него няма достатъчно дълбочина. Именно заради това той се е насочил към френския национал, твърди \"Фишайес\". В момента Юнайтед разполага с Каземиро, Кристиан Ериксен, Фред, Марсел Забитцер и Скот Мактоминей в средната си линия. Само първите трима обаче влизат в дългосрочните планове на Тен Хаг, като бъдещето на Мактоминей и Забитцер е неясно, като шотландецът вероятно ще бъде продаден, а австриецът ще се завърне в Байерн след изтичане на наема му. Така подсилване на халфовата линия ще е от ключово значение, а в клуба са се насочили към доста амбициозна цел в лицето на Камавинга. Твърди се, че на \"Олд Трафорд\" са готови да извадят 130 милиона евро в опит на изкушат Реал да се раздели с този футболист. Дори и такава сума обаче може да се окаже недостатъчна за привличането на Камавинга. 20-годишният френски национал бе взет на \"Сантиаго Бернабеу\" през 2021 година с идеята да бъде дългосрочна алтернатива на Лука Модрич и Тони Кроос. Така че \"белия балет\" много трудно ще се раздели с него, още повече, че футболистът показва сериозно развитие откакто пристигна в клуба. До момента той има 79 мача, 2 гола и 3 асистенции за мадридчани.","pubDate":"2023-03-10 07:22:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Тежък удар за Славия","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/tezhyk-udar-za-slaviia-724406","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"След трите поредни загуби минорното настроение в Славия се задълбочава и от новините за състоянието на халфа Иван Минчев. Техничарят от Казанлък, който преди време стигна и до националния отбор, записа само един официален мач за 2023-а година. Той започна при поражението от Хебър Пазарджик и бе сменен в 80-ата минута. След това треньорският щаб го е гласял за титуляр и срещу Ботев Враца, но в последния момент той е отпаднал от състава. Прегледът е показал, че има друго разкъсване на мускула, пише „Мач Телеграф“. Сега ще трябва да почине по-дълго и ще е на разположение чак през месец април. Lap.bg 38 снимки Минчев не игра заради травма в мачовете с Пирин и Лудогорец. Така Галин Иванов е без алтернатива и единствено другият ветеран Дарко Тасевски е опция пред треньора Златомир Загорчич. „Белите“ имат сериозни проблеми в средата на терена след трансфер на Кемело Нгуена в латвийския ФК Рига. Младите таланти Крум Стоянов и Чунг Нгуен До все още не са готови да играят решителна роля в тежките битки от елита.","pubDate":"2023-03-10 07:16:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Brighton and Ecuador star makes Grimsby Town statement ahead of FA Cup quarter-final tie","link":"https://www.grimsbytelegraph.co.uk/sport/football/football-news/brighton-star-makes-grimsby-statement-8230356","keywords":["Sport"],"creator":["newsdesk@grimsbytelegraph.co.uk (Sam Allen)"],"video_url":null,"description":"The Mariners take on Roberto De Zerbi's high-flying Brighton side in the FA Cup quarter-finals","content":"Brighton and Hove Albion star Moises Caicedo has said they will not take Grimsby Town lightly when they meet in the FA Cup quarter-finals on March 19. It has been quite the journey so far for Paul Hurst’s Mariners team to reach the last eight for the first time in 84 years, with records broken and expectations defied on multiple occasions. It will be the second away game in a row against Premier League opposition when Town take on the Seagulls, but arguably another step up in competition with Brighton pushing for European football in what has been a stellar league campaign for them so far. READ MORE: Evan Khouri handed rare Grimsby Town start as young prospect continues to impress Paul Hurst 21-year-old Caicedo, who played for his native Ecuador at the recent World Cup in Qatar, is one of the many young stars in Roberto De Zerbi’s Brighton team having missed just one league game all season playing as a defensive midfielder. The ultimate goal for Caicedo and Brighton this season is to break into the top four and play in the Champions League next season and if not that at least secure European football. However, as the third-highest-ranked team of the eight left in the FA Cup, they also sense an opportunity to win silverware. On paper, a home tie against Grimsby was the best possible draw for De Zerbi’s side in that quest for cup glory, but Caceido and his Brighton teammates will not be taking them lightly when they face off at the Amex on Sunday, March 19. The Ecuadorian international said: “We are trying to get into the Champions League. That is the dream of the team, to get to the highest point possible and bring happiness to the fans, who are always supporting us. It will be very difficult, but we are very convinced we can do it together. We want to keep going until the end and we are sure we will do it. “We know this cup is something we have to fight for, as well, and give our all against any team we come up against. We are not under any illusions, we know Grimsby will still be a very hard opponent. Every game is different, but I know how important it is for Brighton. We will give everything to try and bring this cup here to Brighton.” READ NEXT Latest Grimsby Town updates and transfer news Grimsby Town's mission to resurrect home superiority continues after Newport County display Grimsby Town supporters snap up tickets for historic FA Cup quarter-final away at Brighton Paul Hurst provides Kieran Green update with his month-long absence felt at Grimsby Town 'Hard watch' - Paul Hurst's brutal assessment of Grimsby Town home draw with Newport County","pubDate":"2023-03-10 06:00:00","image_url":"https://i2-prod.sussexlive.co.uk/sport/football/football-news/article8215546.ece/ALTERNATES/s615/0_GettyImages-1471208872.jpg","source_id":"grimsbytetelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AC Milan Enggan Jemawa di Liga Champions","link":"https://sport.detik.com/sepakbola/uefa/d-6610754/ac-milan-enggan-jemawa-di-liga-champions","keywords":null,"creator":null,"video_url":null,"description":"AC Milan melaju ke perempatfinal Liga Champions. Rossoneri sadar diri kualitas mereka masih di bawah tim-tim lainnya semisal Bayern Munich atau Real Madrid.","content":"AC Milan Enggan Jemawa di Liga Champions Bayu Baskoro - Sepakbola Jumat, 10 Mar 2023 10:40 WIB AC Milan lolos ke perempatfinal Liga Champions. (Foto: Getty Images/Craig Mercer/MB Media) Milan - AC Milan melaju ke perempatfinal Liga Champions . Rossoneri sadar diri kualitas mereka masih di bawah tim-tim lainnya semisal Bayern Munich atau Real Madrid. Milan melaju ke delapan besar usai menyingkirkan wakil Inggris, Tottenham Hotspur. Pasukan Stefano Pioli menang agregat 1-0 atas The Lilywhites. Ini menjadi keberhasilan pertama Milan ke perempatfinal Liga Champions dalam sedekade. Kali terakhir mereka melakukannya pada 2012. ADVERTISEMENT SCROLL TO RESUME CONTENT Baca juga: AC Milan, Raksasa Eropa yang Coba Bangun dari Tidur AC Milan sendiri bisa dibilang salah satu raksasa Eropa. Klub yang bermarkas di San Siro itu punya 7 titel Liga Champions, hanya kalah dari Real Madrid (14). Kali terakhir Milan mengangkat gelar Liga Champions yakni pada 2007. Antusiasme kepada Rossoneri untuk bisa meraih lagi Trofi Si Kuping Besar pun membuncah seiring keberhasilan mereka lolos ke perempatfinal. Direktur teknik Milan, Paolo Maldini , punya pendapat berbeda. Menurutnya, Olivier Giroud cs masih jauh untuk dapat mengakhiri puasa gelar Liga Champions. Baca juga: Milan ke Perempatfinal Liga Champions, Pioli: Tak Ada yang Mustahil [Gambas:Twitter] \"Tujuan kami musim ini adalah finis di empat besar dan melewati babak penyisihan grup Liga Champions. Ini akan sulit di Serie A, tetapi kami harus mendapatkan tempat itu,\" kata Maldini, dikutip dari Football Italia . \"Saya lebih suka menghindari klub Italia lainnya, karena kami ingin lebih banyak tim Serie A melangkah sejauh mungkin. Tidak masalah siapa yang kami dapatkan pada tahap ini, kami tidak merasa kami berada di level yang sama dengan Bayern Munich, Manchester City, atau Real Madrid,\" ujarnya. Baca juga: Maju ke Perempatfinal Liga Champions, Milan Tidak Takut Siapapun! Simak Video \" Singkirkan Tottenham, AC Milan Lolos ke Perempatfinal Liga Champions \" [Gambas:Video 20detik] (bay/bay) ac milan paolo maldini liga champions liga champions 2022/2023","pubDate":"2023-03-10 03:40:35","image_url":null,"source_id":"detik","category":["sports"],"country":["indonesia"],"language":"indonesian"},{"title":"FIFA head of refs wants all stoppage time added in blowouts","link":"https://www.arabnews.com/node/2265976/football","keywords":null,"creator":["romulo"],"video_url":null,"description":"Fri, 2023-03-10 05:45 GENEVA: FIFA wants full stoppage time added even in blowouts though its refereeing chief said Thursday a “mercy rule” that baseball uses at some levels could be debated in the future to end games at 90 minutes. Liverpool’s 7-0 rout of Manchester United on Sunday had only three minutes added at the end despite six-second-half goals, FIFA head of refereeing Pierluigi Collina told reporters in a briefing.Main category: FootballSport","content":"GENEVA: FIFA wants full stoppage time added even in blowouts though its refereeing chief said Thursday a “mercy rule” that baseball uses at some levels could be debated in the future to end games at 90 minutes. Liverpool’s 7-0 rout of Manchester United on Sunday had only three minutes added at the end despite six-second-half goals, FIFA head of refereeing Pierluigi Collina told reporters in a briefing. The 2022 World Cup in Qatar showcased a push by FIFA and Collina to give fans more entertainment by having referees add accurate amounts for stoppages such as goal celebrations, substitutions, injuries and time-wasting. It led to so-called 100-minute games and meant Spain’s 7-0 rout of Costa Rica in the group stage had eight minutes of added time, Collina said. It let Alvaro Morata score the seventh goal. Though Morata’s goal was not crucial in the final Group E standings, Spain did advance ahead of Germany on the tiebreaker of goal difference. “In some competitions the goal difference in the entire competition may be decisive at the end for the ranking,” Collina said. “So even one goal scored or not scored could make the difference.” In 1989, Arsenal won the English league title over Liverpool on the tiebreaker of goals scored with the teams’ goal difference identical. The teams met in the last game of the season and Arsenal’s 2-0 win at Liverpool was sealed by a goal in second-half stoppage time. Collina acknowledged that lengthy added time in games such as Liverpool’s lopsided win last weekend could be viewed as “something not really understandable,” though he suggested consistency was key. “At the World Cup people knew what to expect,” said the former top match official, who refereed the 2002 final. “Where there is consistency on the field of play every decision is better.” FIFA and soccer’s rule-making panel known as IFAB want World Cup-style timekeeping to be adopted globally next season so 100-minute games should become routine in domestic leagues. Still, Collina did suggest soccer could one day look for inspiration from baseball to control the length of games. Baseball’s “mercy rule,” used at international tournaments and at some US collegiate levels, ends a game when one team builds a big lead after a certain number of innings. “Maybe in the future we may consider within the laws of the game to say that additional time has not to be given at the end of the match if there is a difference of ‘x’ goals between the teams,” Collina said. “At a certain stage we need to consider what is common sense or what is not.”","pubDate":"2023-03-10 02:51:46","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Man United beat Betis 4-1 in rousing response to Liverpool rout","link":"https://www.arabnews.com/node/2265971/football","keywords":null,"creator":["romulo"],"video_url":null,"description":"Fri, 2023-03-10 05:26 MANCHESTER, England: Marcus Rashford and Bruno Fernandes struck as Manchester United beat Real Betis 4-1 on Thursday and began the healing process after Sunday’s humiliating 7-0 rout by Liverpool. Erik ten Hag’s players delivered a rousing response to the defeat at Anfield, with the Europa League quarterfinals within reach after a commanding round-of-16 first-leg win. Antony and Wout Weghorst were also on target at Old Trafford, with Ayoze Perez scoring for Betis.Main category: FootballSport","content":"MANCHESTER, England: Marcus Rashford and Bruno Fernandes struck as Manchester United beat Real Betis 4-1 on Thursday and began the healing process after Sunday’s humiliating 7-0 rout by Liverpool. Erik ten Hag’s players delivered a rousing response to the defeat at Anfield, with the Europa League quarterfinals within reach after a commanding round-of-16 first-leg win. Antony and Wout Weghorst were also on target at Old Trafford, with Ayoze Perez scoring for Betis. United could have taken an even more commanding lead into next week’s second leg after Weghorst, Rashford and Antony all failed to capitalize on further openings. Ten Hag had given his players the chance to make amends for Sunday by naming an unchanged lineup to the one at Liverpool. It had the desired effect, with Rashford smashing United in front after six minutes. United could have extended the lead, but the game was even at halftime after on-loan Leicester forward Perez fired low shot past David de Gea in the 32nd. Antony put United back in front seven minutes into the second half with a curling effort into the top corner from outside of the box. Fernandes made it 3-1 when he headed in Luke Shaw’s corner in the 58th. Perhaps the biggest cheer of the night came when Weghorst lashed the ball home in the 82nd after missing a host of earlier chances. Substitute Sven Michel salvaged a 3-3 draw for Union Berlin against Union Saint-Gilloise with a goal a minute from the end in the German capital. Victor Boniface scored twice for Union Saint-Gilloise, including the go-ahead goal in the 72nd minute before Michel’s equalizer. The two sides already met in the group stage this season. The Belgian Union won 1-0 in Berlin while the German Union won by the same score in Brussels. At Stadio Olimpico in Rome, Jose Mourinho’s Roma made a step toward advancing with a 2-0 victory over Real Sociedad. Tammy Abraham set up the opening goal for Stephan El Shaarawy to finish a fast counter in the first half before substitute defender Marash Kumbulla doubled the advantage with a close-range header three minutes from time. Bayer Leverkusen had the same advantage over Ferencvaros after their first-leg game. Kerem Demirbay opened the scoring for Leverkusen in the 10th, and Edmond Tapsoba added the second toward the end for the hosts. EUROPA CONFERENCE LEAGUE Michail Antonio struck twice late in the first half to guide West Ham past AEK Larnaca 2-0 in Cyprus. Despite a troubled season in the Premier League, the Hammers have been cruising in the third-tier European competition with a perfect record. Said Benrahma crossed for Antonio’s first with the striker doubling the advantage in stoppage time for his first two goals in the European campaign this season. Manu Trigueros put Villarreal — a Champions League semifinalist last season, ahead in the first half before Anders Dreyer tied it at 1-1 with a second-half goal for Anderlecht in the draw in Brussels. Nice beat Sheriff away in Moldova 1-0.","pubDate":"2023-03-10 02:29:17","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Football's greatest revenge missions as Bournemouth aim to avenge 9-0 Liverpool defeat","link":"https://www.mirror.co.uk/sport/football/news/liverpool-bournemouth-man-utd-villa-29413142","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"A little over six months after shipping nine goals away to Liverpool, Bournemouth can follow some other Premier League sides in taking sweet revenge in the return fixture","content":"Bournemouth have made plenty of progress since their 9-0 loss at Anfield , but it will still sting for those involved in August. Six different Reds players were on target in a match which equalled the Cherries' worst ever league loss and ended up being the beginning of the end for then-manager Scott Parker . Bournemouth go into the reverse fixture bottom of the table under Parker's successor Gary O'Neil, but a spirited performance against Arsenal last time out might well give them hope. Suffering a heavy loss and then coming back to beat the same opponent later that year is easier said than done, but O'Neil's side wouldn't be the first to achieve the feat. Here, Mirror Football looks back at some other examples. Virgil van Dijk sends warning as Trent Alexander-Arnold and Mo Salah problem resurfaces Ex-Liverpool manager's daughter cashes in huge 350/1 bet on Man Utd thrashing Southampton v Leicester, 2019-20 For a while, Southampton's 9-0 loss at home to Leicester in October 2019 was all anyone could talk about when Ralph Hasenhuttl's side played on TV. Right up until they lost 9-0 at Manchester United the following season, which, yeah, it's not the best of reasons, is it? In the interim, though, Saints put the Leicester loss behind them in the best possible way. After allowing Ayoze Perez and Jamie Vardy to both hit hat-tricks at St Mary's, they fell behind to Dennis Praet's opener at the King Power Stadium, but came back to win 2-1 thanks to Danny Ings' late effort. Leicester had been second going into the game, but that kicked off a run of one win in seven which eventually saw them tailspin and miss out on the top four altogether. Southampton , meanwhile, recovered to finish 11th after dropping into the bottom three with that 9-0 loss. What is your favourite footballing revenge mission? Have your say in the comments section Southampton's home defeat was the joint-worst in Premier League history ( Image: Getty Images) \"It was a very important game for us this season to see how we play now - we have changed our mindset and worked hard to play in a successful way,\" Hasenhuttl said after the away win. \"Watching this team is enjoyable at the moment.\" Crystal Palace v Liverpool, 1989-90 If Liverpool need any motivation to avoid a slip-up on Saturday, all they'll need to do is look back 30-odd years. Back then, Kenny Dalglish's side thrashed Crystal Palace en route to the league title but saw their double dreams dashed by the same opponents. The 9-0 September win at Anfield was famous for coming via eight different scorers, with Steve Nicol the only man to bag a brace. The Reds also won 2-0 at Selhurst Park in January, but failed to make it three out of three in the FA Cup semi-finals. Palace's extra-time win sent them to Wembley ( Image: Mirrorpix) In a topsy-turvy game at Villa Park, Liverpool went in front early but trailed going into the final 10 minutes. A quickfire double from Steve McMahon and John Barnes restored their lead, only for Andy Gray to send the game into extra-time and Alan Pardew to deliver Palace's winner. Palace ended up falling short in the final, losing a replay to Manchester United after another dramatic draw at Wembley. However, the revenge against Liverpool - coupled with avoiding the drop - meant there were still plenty of positives. Wigan v Man Utd, 2011-12 Wigan's record against Man Utd was unspeakably bad going into their April 2012 meeting, with 14 defeats from 14. Back in the 2009-10 season, the Latics had lost 5-0 home and away against Alex Ferguson's side, and a Dimitar Berbatov hat-trick ensured they were beaten by the same scoreline on Boxing Day in 2011. Shaun Maloney gave Wigan their first ever win against Man Utd ( Image: Getty Images) When United came to the DW Stadium for the reverse fixture, Roberto Martinez's side were down in 19th. A first ever victory over the league leaders would have been useful, but history suggested it was far from likely. Unlikely doesn't mean impossible, though. Shaun Maloney cut in to score a 50th-minute winner under the lights, sparking a late break for survival while also denting the opposition's title hopes. \"Phil Dowd had a bad game and never got to grips with it, but Wigan were the better team and deserved it,\" Man Utd boss Ferguson said. \"It was one of these off-nights. It is unavoidable sometimes.\" West Germany v Hungary, 1954 World Cup A chance for revenge in the league will always be there if you lose the first meeting. In a major international tournament, though, this kind of thing is much rarer. West Germany came back from 2-0 down to win the 1954 World Cup final ( Image: Hulton Archive) It's not entirely without precedent, though. Portugal fluffed their lines in Euro 2004, losing to Greece in the group stage and the final, but West Germany had a better and more dramatic turnaround half a century earlier. Sepp Herberger's team were handed an 8-3 thrashing by the Magic Magyars in the group stage, with Sandor Kocsis scoring a hat-trick. A play-off victory over Turkey saw them through to the knockout rounds, though, with victories over Yugoslavia and Austria setting up a rematch in the final. When Hungary went 2-0 up inside 10 minutes, some might have feared another thrashing, but it was all square long before the break. In the 84th minute, Helmut Rahn popped up with his second and West Germany's third, denying the Hungarians a first World Cup. “Rahn was and is one of the last legends,” Franz Beckenbauer would later say, per The Ringer . “He shaped an entire generation.” Sweden under-21s v France under-21s, 2014 Layvin Kurzawa's joy was short-lived ( Image: JONATHAN NACKSTRAND/AFP via Getty Images) Not the heaviest of defeats, sure, but one of the sweeter revenge missions. And it's all down to how Les Bleus marked their victory. With no nations qualifying automatically for the European under-21 Championships, group winners France and Sweden were drawn together in a two-legged play-off. France won the first leg 2-0, and looked to have thwarted a dramatic Swedish turnaround in Halmstad when Layvin Kurzawa seemingly sent them through on away goals. Kurzawa, now at Fulham but then at Monaco, made a point of celebrating in the faces of the opposition after scoring with a diving header three minutes from time. There was still time for Oscar Lewicki to deliver a late winner, though, and you can guess how Sweden marked the occasion . Sunderland v Southampton, 2015 Sunderland's 8-0 defeat at Southampton in October 2014 was nothing short of calamitous. The Black Cats really lived up to the bad luck associated with the animal of their nickname, with three different players scoring own goals. Jordi Gomez completed Sunderland's revenge mission against Southampton ( Image: AFP/Getty Images) Manager Gus Poyet survived that defeat, but was sacked in the spring with his team fighting what looked increasingly like a losing battle against the drop. Dick Advocaat arrived after a six-game winless run, and the return game against Southampton was looming large. As it turns out, there was nothing for the strugglers to worry about. Two Jordi Gomez penalties brought a 2-1 win, with James Ward-Prowse sent off for the visitors, and Advocaat went on to lead his team to safety. Some may point to the eight winless games which saw Advocaat to get the sack at the start of the following season. That's hardly the point here, though. Man Utd v Spurs and Liverpool v Aston Villa, 2021 Liverpool left things very late against Aston Villa ( Image: Clive Brunskill/POOL/EPA-EFE/REX/Shutterstock) On one remarkable day in September 2020, Tottenham won 6-1 at Old Trafford and Liverpool - unbeaten since beginning their title defence - fell to a 7-2 loss away to Aston Villa. The wait for a shot at revenge was a long one, with the return fixtures not until April, but it was worth it. Spurs had topped the league in December, but by the spring even a top four finish looked unlikely. Son Heung-min gave them a half-time lead at home to United, but the visitors hit three after the break to increase the pressure on manager Jose Mourinho , who would be gone just days later. One day before the game at the Tottenham Hotspur Stadium, Liverpool welcomed Villa to Anfield looking to keep their own top four hopes alive. It wasn't a hammering, but the manner of the win - a comeback sealed in stoppage-time by Trent Alexander-Arnold - might have made it even sweeter. The combination of results lifted Jurgen Klopp's team above Spurs in the battle for Champions League football. Victory over Bournemouth on Saturday could do the same, but Liverpool will know it's often not quite that straightforward.","pubDate":"2023-03-10 02:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29415322.ece/ALTERNATES/s615/0_Liverpool-v-Bournemouth-Premier-League-Anfield.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"}]}