{"newsArray":[{"title":"Taekwondo star dreams of becoming IOC member","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352048.html?utm_source=fl","keywords":null,"creator":["mj6c2@koreatimes.co.kr(Jung Min-ho)"],"video_url":null,"description":"At a glance, Lee Dae-hoon might seem like a sports star who has everything. Before hanging up his uniform after the 2020 Tokyo Games, the 31-year-old was one of Korea's most decorated taekwondo athletes, having won more than 20 gold medals at international events.","content":"Taekwondo coach Lee Dae-hoon poses in this photo provided by World Taekwondo. Lee, now 31, was one of Korea's most decorated taekwondo stars before his retirement following the 2020 Tokyo Olympics. Courtesy of World Taekwondo By Jung Min-ho At a glance, Lee Dae-hoon might seem like a sports star who has everything. Before hanging up his uniform after the 2020 Tokyo Games, the 31-year-old was one of Korea's most decorated taekwondo athletes, having won more than 20 gold medals at international events. Yet there is one blemish on his near-perfect career. He could not accomplish his long-sought dream of capturing an Olympic crown. Lee, who is now competing in the World Taekwondo (WT) Championships as a coach in Baku, Azerbaijan, believes that the experience of failure could help his new dream of representing all athletes ― not just the very best of them ― as a member of the International Olympic Committee (IOC). \"Most members of the IOC Athletes' Commission were popular and have the experience of winning an Olympic gold medal. Considering their roles, however, I think those who are able to communicate well with (all) athletes about the power and meaning of sports should serve as members,\" Lee said in comments sent through the WT. \"I may not have won an Olympic gold medal. But it would be meaningful if I ― a person with good sportsmanship ― represent them as its member.\" Lee emphasized taekwondo's broad fan base, which he thinks would be helpful to represent the inclusive spirit of sports. \"Taekwondo has power. WT has more member countries than all but football. Taekwondo offers opportunities to win Olympic medals to many countries that would otherwise have no such opportunities,\" he said. \"I believe the strength of taekwondo would be my strength (in a bid to become an IOC member).\" Lee is one of the six candidates competing to fill two vacant seats assigned for male athletes at WT's Athletes' Committee. For the two other seats for women, three candidates are vying. About 900 athletes in the capital of Azerbaijan have cast their votes during the competition that runs from May 29 to June 4. The winners will be announced on June 3. The body consists of six members in total. The two others are Jaouad Achab of Belgium and Valeria Santos of Brazil, who won the seats at WT's previous event in Guadalajara, western Mexico. \"When I was an athlete, my communication with other athletes was usually short … As I'm vying (for the seat), I try to approach them more personally for more conversations. Despite my poor English, many have responded pleasantly to my attempt,\" Lee said. \"The seat at the WT committee is the first step to my challenge. I will do my best to produce the best results to reach my next goal of the IOC membership.\"","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/be3a96a671684970b52667b9dc9458af.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea coach takes trip delay in stride ahead of U-20 World Cup knockouts","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352071.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea head coach Kim Eun-jung wants to ensure a travel delay in Argentina won't affect his team's upcoming knockout match at the FIFA U-20 World Cup.","content":"Korea head coach Kim Eun-jung directs his players against Gambia during a Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap Korea head coach Kim Eun-jung wants to ensure a travel delay in Argentina won't affect his team's upcoming knockout match at the FIFA U-20 World Cup. Korea qualified for the last 16 at the tournament after playing all three group matches in Mendoza, western Argentina, over the past week. Their first knockout match is against Ecuador in Santiago del Estero in the northern part of the host country at 6 p.m. Thursday (local time), or 6 a.m. Friday in Seoul. Kim's team had been scheduled to travel to Santiago del Estero at 3 p.m. Monday on a chartered plane provided by FIFA. However, the trip was pushed back to 10 a.m. Tuesday, due to what the Korea Football Association (KFA) said were issues with charter flights. The KFA said Gambia and Italy, among other knockout-bound teams, had also experienced delays. Kim said Tuesday he will prepare his players so that the unexpected delay won't have any impact on their match. \"We were going to take Monday off anyway. So it was just a difference of having that day off here or in Mendoza,\" Kim said in Santiago del Estero, in a video clip released by the KFA. \"It would have been better if we'd enjoyed the time off here. The guys are a bit more fatigued after traveling today. But we will try to help them recover in time and get them ready to go on the day of the match.\" Korean goalkeeper Moon Hyun-ho, center, makes a stop against Gambia during the teams' Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap Kim said he was pleased with the conditions of the training facility in Santiago del Estero, compared with the one in Mendoza. \"It's several degrees warmer here than there,\" the coach said. \"As far as avoiding injuries and keeping the players healthy, I think we're in a better spot.\" Korea will be playing in the knockout stage for the third consecutive U-20 World Cup, after reaching the round of 16 in 2017 and finishing as the runners-up to Ukraine in 2019. The 2021 tournament was canceled due to the COVID-19 pandemic. If Korea beat Ecuador, they will stay in Santiago del Estero for the quarterfinal match against either Argentina or Nigeria at 2:30 p.m. Sunday, or 2:30 a.m. Monday (Korean time). (Yonhap) Korean players and coaches celebrate after finishing second in Group F at the FIFA U-20 World Cup following a goalless draw with Gambia at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/8b7eb1bd8e8d4358811366e35060e02b.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Tottenham star Son Heung-min returns home after up-and-down Premier League season","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352016.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"South Korean football icon Son Heung-min came home Tuesday after completing a tumultuous Premier League season with Tottenham Hotspur, a campaign that featured a serious injury, multiple coaching changes and a significant personal milestone. Son arrived at Incheon International Airport, west of Seoul, to great fanfare Tuesday afternoon. Judging by the reception, it would have been difficult to guess Son had just wrapped up an unproductive season, at both individual and club levels.","content":"Tottenham Hotspur star forward Son Heung-min wave hands to fans upon his arrival at Incheon International Airport, west of Seoul, Tuesday. Yonhap South Korean football icon Son Heung-min came home Tuesday after completing a tumultuous Premier League season with Tottenham Hotspur, a campaign that featured a serious injury, multiple coaching changes and a significant personal milestone. Son arrived at Incheon International Airport, west of Seoul, to great fanfare Tuesday afternoon. Judging by the reception, it would have been difficult to guess Son had just wrapped up an unproductive season, at both individual and club levels. Son made history in the 2021-2022 season by becoming the first Asian player to win the Premier League Golden Boot. He shared the honor with Mohamed Salah of Liverpool by scoring a career-high 23 goals in 35 matches. Son scored just 10 times in 36 matches this past season, barely able to reach double figures for the seventh consecutive season. Son didn't score until his seventh match of the season, as he bust out of his slump with a hat trick against Leicester City in September. Son, however, was held goalless for the next eight games, including the two immediately following the midseason break for the FIFA World Cup. And with only about three weeks before the big tournament, Son suffered broken facial bones in a collision with an opponent during a UEFA Champions League match in early November. It didn't just threaten to derail Tottenham's season; whatever hopes South Korea had of going on a deep run at the World Cup seemed to have been dashed. Son gamely played wearing a protective mask, as he captained South Korea to the round of 16 for the country's first knockout appearance in 12 years. The awe-inspiring performance in Qatar didn't quite translate to success in the Premier League. When the calendar flipped to 2023, Son was still stuck at three goals. Stuck in Premier League purgatory that is mid-table, Tottenham sacked head coach Antonio Conte in late March. Among the criticisms Conte had faced was his inability to bring the best out of Son. With caretaker boss Cristian Stellini and then his replacement Ryan Mason in charge, Son netted four goals in a five-match span in April. The goal against Brighton and Hove Albion on April 8 was Son's 100th career Premier League goal, making him the first Asian player to reach the century mark. Coaching changes did little to turn Tottenham's season around, though. They wrapped up their disappointing season with a 4-1 victory over Leeds United on Sunday. Despite the closing win, Spurs still finished in eighth place with 60 points and missed out on all European competitions for next season ― the UEFA Champions League, Europa League and Conference League. Spurs will be on the outside looking in during all continental club battles for the first time in 13 years. Son, who joined Tottenham prior to the 2015-2016 season, has played in a European club tournament every season of his career in north London. Son is longtime captain of the South Korean national team. He will suit up for the team's two friendly matches scheduled next month: against Peru on June 16 and then against El Salvador on June 20. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/511af8606234403bb213b121c3c8575f.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea clinches knockout berth at U-20 World Cup","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351854.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea has clinched a spot in the knockout stage at the FIFA U-20 World Cup in Argentina even before playing their final group stage match","content":"Korean players salute the crowd after a 2-2 draw against Honduras in a Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, in this May 25 photo provided by the Korea Football Association. Yonhap Korea has clinched a spot in the knockout stage at the FIFA U-20 World Cup in Argentina even before playing their final group stage match. Japan's 2-1 loss to Israel in Group C in Mendoza, western Argentina, on Saturday (local time) ensured that Korea will grab a ticket to the round of 16 from Group F regardless of their result against Gambia on Sunday. There are six groups of four nations in this tournament. The top two teams from each group, plus four best third-place teams, will advance to the last 16. Korea is currently in second place in Group F behind Gambia with four points. And Japan's loss meant Korea will be no worse than fourth best among all No. 3 seeds even if they lost to Gambia on Sunday. Among third-place teams, Nigeria and New Zealand have booked their knockout places with six points and four points apiece. Tunisia have three points with one match to play. Slovakia and Japan have finished their group play with three points, meaning they will finish behind Korea once the Koreans finish their group play. Korea head coach Kim Eun-jung awaits the start of a Group F match against Honduras at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, in this May 25 photo provided by the Korea Football Association. Yonhap Korea has now reached the knockouts at the third consecutive FIFA U-20 World Cup, following their runner-up finish in 2019 and an appearance in the last 16 in 2017. The 2021 tournament was canceled due to COVID-19. In Argentina, Korea beated France 2-1 to open the group stage and then played 10-man Honduras to a 2-2 draw. The group stage finale is set for 6 p.m. Sunday in Mendoza, or 6 a.m. Monday in Seoul time. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/c4f7d5cefa7f4df7917e627cb613faec.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korean soccer's standing rises on world stage","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351977.html?utm_source=fl","keywords":null,"creator":["john.duerden@gmail.com(KoreaTimes)"],"video_url":null,"description":"South Korean soccer has been flexing its muscles at home and abroad in the past week or so. The young Taeguk Warriors have made the knockout stages of the U-20 World Cup, which is taking place in Argentina while domestic organizations have been standing up for local clubs.","content":"South Korea's Cho Young-kwang, left, battles for the ball with Gambia's Mamin Sanyang during a FIFA U-20 World Cup Group F match at the Malvinas Argentinas stadium in Mendoza, Argentina, Sunday. / AP-Yonhap By John Duerden South Korean soccer has been flexing its muscles at home and abroad in the past week or so. The young Taeguk Warriors have made the knockout stages of the U-20 World Cup, which is taking place in Argentina while domestic organizations have been standing up for local clubs. The country has a good record in the U-20 World Cup, reaching the final of the last edition in 2019 (there was no 2021 competition due to the pandemic) where they lost to Ukraine. This time under the leadership of coach Kim Eun-jung, the Reds picked up an impressive 2-1 win over France in the opening game. The European team spent much of the game on top but was caught out with the perfect counter-attack that was finished by Lee Seung-won and then Korea moved further ahead in the second half. France pulled a goal back to ensure a tense finish but the game ended with three points. There was some disappointment as the second game against 10-man Honduras ended 2-2 but a place in the second round was clinched even before the final group game against Gambia. It remains to be seen which team will be the next opponent, but Korea will be looking forward to trying to match the class of 2019 and go as far as possible. Back home, however, this summer has been shaping up to become a busy one in terms of big European teams heading to the Land of the Morning Calm. Manchester City has just been crowned English Premier League champion and might become Europe's top dog later in June. Pep Guardiola's men will meet Atletico Madrid in Seoul in July. Scottish champion Celtic, which is led in attack by Korean striker Oh Hyeon-gyu, will meet Wolverhampton Wanderers of the English Premier League and Hwang Hee-chan. Roma is also due for a visit to take on Incheon United. The biggest story is that there are two European teams with Korean players who may not be coming this summer. Kim Min-jae's Napoli and Lee Kang-in's Real Mallorca had arranged two games on June 8 and 10. The second game could not go ahead as there were K League games taking place on the same date. The Korea Football Association asked the promoters to either pay a deposit or sign a contract that promised compensation if star players, assumed to be the Koreans especially, did not play. This was all the result of a match that took place in 2019, when there was a lot of controversy and bad feeling as Juventus came to Seoul and did not play Cristiano Ronaldo. The game had been heavily promoted off the back of the five-time Ballon d'Or winner but the Portuguese international stayed on the bench for the full 90 minutes, leaving many fans furious. With the promoters unwilling or unable to make those commitments, the game is not going to go ahead. It is a sign of the authorities doing what needed to be done to protect the local league in the face of foreign incursions. Now is the turn for the young players to go and make waves in Argentina.","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/69b26e9a3a50405fb9888f190b5671df.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea to face Wales in men's football friendly in Sept.","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351939.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea will travel to Wales for a men's friendly football match in September, for their first appearance in Europe under new coach Jurgen Klinsmann.","content":"This photo shows Korean players acknowledge the crowd at Seoul World Cup Stadium in Seoul following a 2-1 loss to Uruguay in a men's football friendly match, March 28. Yonhap Korea will travel to Wales for a men's friendly football match in September, for their first appearance in Europe under new coach Jurgen Klinsmann. The Korea Football Association (KFA) announced Monday afternoon that Korea and Wales will square off at Cardiff City Stadium in the Welsh capital on Sept. 7. The kickoff time will be determined later, the KFA added. The match falls during the September international match window, as set by FIFA. The KFA said it is also trying to schedule a second match during the Sept. 4-12 period, and it will likely be a non-European side because most teams on the continent will be playing qualifiers for the UEFA Euro 2024. Korea's previous matches in Europe took place in January 2022, when the Taegeuk Warriors faced Iceland and Moldova in the neutral country of Turkey. The last time Korea visited the home country of their opponents came in March 2018, when they played Northern Ireland in Belfast and Poland in the southern Polish city of Chorzow. Korea, world No. 27, and Wales, one spot above, have never faced each other before. This photo shows Son Heung-min of Korea, right, tries to dribble past Uruguay during a men's football friendly match at Seoul World Cup Stadium in Seoul, March 28. Yonhap Both countries competed at last year's FIFA World Cup in Qatar, where Korea reached the round of 16 and Wales crashed out of the group stage in their first World Cup appearance in 64 years. During the June window, Korea will host Peru on June 16 in the southeastern city of Busan and then El Salvador on June 20 in the central city of Daejeon. Klinsmann had a draw and a loss in his first two matches at the Korean helm in March. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/d093b55649ad462492a5b31dac8e7715.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Diogo Dalot signs new contract with Manchester United","link":"https://www.iol.co.za/sport/soccer/premier-league/diogo-dalot-signs-new-contract-with-manchester-united-9635baf7-4461-4547-9f09-2984ef86cfac","keywords":null,"creator":["AFP"],"video_url":null,"description":"Right back Diogo Dalot has been rewarded with a contract extension that will keep him at Old Trafford until at least 2028.","content":"London — Manchester United defender Diogo Dalot has signed a contract extension that will keep him at Old Trafford until at least 2028. Dalot's new five-year deal includes the option of a further season as the right-back is rewarded for an impressive season with the club. Erik ten Hag's team finished third in the Premier League, won the League Cup and face Manchester City in the FA Cup final on Saturday. The 24-year-old, capped 11 times by Portugal, joined United from Porto in 2018 and has gone on to make 107 appearances in all competitions. Dalot, who spent the 2020-21 season on loan at AC Milan, said: \"Playing for Manchester United is one of the highest honours that you can have in football. \"We have shared some fantastic moments over the past five years and I've grown so much and my passion for this incredible club has only increased since the day that I joined. \"As a group of players, we all feel like we are at the start of a special journey right now. \"I can assure you that I will dedicate myself relentlessly to helping this group to achieve our aims and make the fans proud of this team. \"That drive continues this week with everyone intensely focused on preparations for the FA Cup final.\" AFP Share","pubDate":"2023-05-31 17:04:55","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/c43d7566-3f0e-5ef6-883a-15f87b73d7b4&operation=CROP&offset=0x104&resize=1173x659","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"We live in the shadow of massive football stadium – fans dump litter in our gardens and smash our windows…we hate it","link":"https://www.thesun.co.uk/sport/22532282/shadow-massive-football-stadium-fans/","keywords":["Football","Sport","Homes","Premier League","Road Laws"],"creator":["Tom Duffy"],"video_url":null,"description":null,"content":"LOCALS living in the shadow of a Premier League ground claim their lives are a \"nightmare\" on match days and fear things will only get worse. Residents living next to Villa Park have told of rowdy fans urinating in gardens, smashing windows, vandalising cars and blocking driveways. Locals have taken to picking up strewn kebab wrappers and beer cans after match days at the club supported by Prince William and Tom Hanks. Some have started studying fixture lists in attempt to avoid match days, when they know their driveways will be blocked by ignorant fans. Aston Villa are set for European football next season after a remarkable turnaround in form under new gaffer Unai Emery. And the famous club have had a near 10,000 seat new stand approved in the past few months, which locals fear is just going to make the problems worse. Abu Zaman, 26, is a Villa fan but says living near the team he supports is no fun as his car has been damaged on multiple occasions. Business owner Abu, who has lived on Trinity Road all of his life, said: \"The parking and the traffic are really bad. \"We get people who scratch our cars and previously had people smash our windows. \"Our road is shut on the day. On a match day you have to wait for the game to start at which point your whole day is wasted. \"Then there's the parking, the litter and the vandalism. The roads are open but the supporters are walking on the road and blocking them. \"In the 26 years Villa have only approached us for once for planning permission for the ground extension, they don't care about the local community. \"As long as their pockets are lined, they don't care. It's all about tickets and season tickets for them. \"The roads are covered in alcohol bottles, burger wrappers, pretty much everything.\" Dad-of-one James Payne, 35, who lives on nearby Endicott Road, added: \"This is a built up area, the infrastructure can't support even more fans. \"It's bad enough as it is - having to wade through a sea of beer bottles and takeaway wrappers just to get to your front door. \"We've had people urinating in our front garden, I'm sure people act like they wouldn't usually do when they go the football. They turn into yobs. \"Someone once ripped our fence post up and began attacking a rival fan with it. It's just bonkers. \"They get famous fans like Prince William and Tom Hanks seeing all the glamour of Premier League football - but just a stones throw away for us it's a nightmare.\" Andrea Sawyers has lived on Trinity Road since 2012 and said she and her mum have to clean up huge piles of litter left behind by fans themselves. Mum-of-two Andrea said: \"I'm a bit of a Villa fan, I'm not a massive one but a fan. \"The garbage after is the problem, no one cleans up. My mum and I have to do it. All the beer glasses and bottle all over the bins. \"They throw in my garden, all the chip wrappers too. \"There's also nowhere to park your car, it's always a busy time. \"They've smashed my neighbours car windows a couple of times. It's crazy. I don't get why they have to go so crazy. \"It's mainly the rubbish, it's left to locals, you have to clean it up yourselves.\" Osman Mohammed, 30, is a council worker and has lived on Endicott Road all of his life. He says he has to plan over a week in advance before he goes out on match days before a fan blocks his drive with their car. He added: \"It gets quite busy. Our issue is we have residential parking nearby, supporters can't park there, but some try anyway. \"I sometimes look when Villa are playing and plan ahead. \"I don't leave the house at game time as I can be stuck in traffic for around an hour just to get around the corner.\" Shop owner Md Gias Uddin, 58, admitted there is a litter problem on matchdays but the increased footfall was good for local businesses. Mr Uddin, who owns a shop on Endicott Road, said: \"All of the supporters like my shop mostly, most of them say it's neat and clean. My experiences is very nice. \"The litter is problem is when the most of the people come to see the football match. \"The litter bin is full and there needs to be more bins. There are a few bins around. People will put their rubbish in the bin if there were more.\" Fellow shop owner Ash Mahmood, 59, has worked in the area for 40 years and says matchday traffic means it can take over an hour to travel a couple of miles. Ash, who owns Ash Food Fair on Witton Road, said: \"The worst part I think at the moment is the parking for the customers. Residents moves their cars and park them near me. \"When you finally get out of here, it takes a while to get out. It took me an hour to get out of Aston. \"Years ago there used to be fights around here all the time but now it's all controlled by the police.\" The Sun approached Aston Villa for comment.","pubDate":"2023-05-31 15:04:55","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"NFL bei RTL: Werner und Esume enthüllen erste Sendungs-Details ","link":"https://www.watson.de/sport/nfl/821525140-nfl-bei-rtl-experten-werner-und-esume-geben-details-der-sendung-bekannt","keywords":null,"creator":["Lukas Grybowski"],"video_url":null,"description":"Dabei wurde Björn Werner so euphorisch, dass er sich selbst bremsen musste, um nicht alle Highlights zu verraten.","content":"NFL bei RTL: Werner und Esume enthüllen erste Sendungs-Details Lange wurde spekuliert, am vergangenen Freitag war es dann offiziell: RTL stellte sein Reporter- und Expertenteam vor, das ab Anfang September regelmäßig am Sonntagabend die Spiele in der amerikanischen Football-Liga begleiten wird. Mit dabei sind bekannte Gesichter wie der zweifache Super-Bowl-Gewinner Sebastian Vollmer und die Sky-Kommentatoren Frank Buschmann und Florian Schmidt-Sommerfeld, die die bereits NFL-Spiele bei ProSieben kommentierten, ehe sie zu Sky wechselten. In den jahrelangen Übertragungen bei ProSieben entwickelten sich vor allem Ex-NFL-Spieler Björn Werner und Experte Patrick Esume zu echten Publikumslieblingen. A uch sie sind künftig Teil des NFL-Teams und verrieten in ihrem Podcast \"Football Bromance\", was sich im Vergleich zu ProSieben ändern wird. NFL auf RTL+ mit eigenem Studio Der Umfang der Spiele, die RTL übertragen wird, hat sich im Vergleich zu ProSieben nicht geändert. Bei RTL, Nitro und im Stream bei RTL+ werden insgesamt 80 Spiele inklusive Playoffs und Super Bowl gezeigt. Sonntags werden zwei Spiele im RTL-Hauptprogramm übertragen, zudem ein weiteres Spiel auf RTL+. Bei ProSieben lief das ähnlich, doch dabei wurde das dritte Spiel auf ran.de von einem Kommentator begleitet. Das wird es künftig so bei RTL+ nicht geben. Stattdessen betonte Ex-Profi Björn Werner, dass \"viel mehr Fokus\" auf diesem Spiel liegen werde und nicht \"so ein bisschen nebenbei\", wie bei ProSieben. Dort wurde während der Übertragung im Hauptprogramm zwar immer auf den Stream verwiesen, doch nur hin geschaltet, wenn die eigentliche Partie schon entschieden war und sich im Stream eine spannende Endphase andeutete. Euphorisch erklärt Werner daher: \"RTL packt da an und investiert deswegen auch in diese ganzen Menschen, die hier sind. Sie packen eine gesamte Crew in ein Studio. Sie haben ein eigenes Studio für RTL+-Spiele und, wenn... \", dann bremste sich Werner jedoch selbst und wollte noch nicht mehr Details verraten. Wechsel von Sky-Kommentator seit Dezember klar Mit Florian Schmidt-Sommerfeld ist ein weiteres bekanntes Gesicht ein Teil der NFL bei RTL. Er teilte vor drei Tagen ein tränenreiches Video bei Instagram, in denen er sich filmte, kurz nachdem er die Zusage bekam. Jeden Sonntag Football-Übertragungen nur aus der Ferne zu sehen, sei für ihn extrem schmerzhaft gewesen. Nun würde jedoch ein Traum für ihn Erfüllung gehen, zum Football zurückzukehren. Und es ist möglich, dass es noch weitere neue Gesichter gibt. Zwar sei das Team laut den beiden bereits sehr groß, \"aber vielleicht kommt noch der ein oder andere dazu\", mutmaßte Esume. Carsten Spengemann, der bisher auf ProSieben NFL-Spiele kommentierte, stand ebenfalls in Verhandlungen mit RTL. In seinem Podcast \"Die Pille für den Mann\" erklärte er, dass sein Management nach dem Wechsel der Übertragungsrechte zwei bis dreimal mit dem Kölner Sender gesprochen hätte. \" Danach hat mit mir persönlich keiner mehr gesprochen. Das ist das einzige, was ich dazu sagen kann.\" Gleichzeitig betonte er, dass er ebenfalls gerne dabei gewesen wäre.","pubDate":"2023-05-31 14:35:15","image_url":null,"source_id":"watson","category":["sports"],"country":["germany"],"language":"german"},{"title":"Latest: Portsmouth rivals reveal position over £4m Ipswich & Coventry target as Derby enter race for prolific striker","link":"https://www.portsmouth.co.uk/sport/football/portsmouth-fc/latest-portsmouth-rivals-reveal-position-over-ps4m-ipswich-coventry-target-as-derby-enter-race-for-prolific-striker-4164188","keywords":["Portsmouth FC","Football","Sport"],"creator":["Pepe Lacey"],"video_url":null,"description":"With the play-offs now complete, clubs across the EFL have turned their attentions to the upcoming transfer window.","content":null,"pubDate":"2023-05-31 13:30:00","image_url":"https://www.portsmouth.co.uk/webimg/b25lY21zOjMxMjFmMGM3LWUwNjMtNGU0NC1iYjAzLTMzYzNkMDhhMDA4MDo0YzEzODk1Yy0xN2VjLTQyMjgtOGU3OC01NDM2ZDhlMzM0MDQ=.jpg","source_id":"portsmouth","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Taekwondo star dreams of becoming IOC member","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352048.html?utm_source=fl","keywords":null,"creator":["mj6c2@koreatimes.co.kr(Jung Min-ho)"],"video_url":null,"description":"At a glance, Lee Dae-hoon might seem like a sports star who has everything. Before hanging up his uniform after the 2020 Tokyo Games, the 31-year-old was one of Korea's most decorated taekwondo athletes, having won more than 20 gold medals at international events.","content":"Taekwondo coach Lee Dae-hoon poses in this photo provided by World Taekwondo. Lee, now 31, was one of Korea's most decorated taekwondo stars before his retirement following the 2020 Tokyo Olympics. Courtesy of World Taekwondo By Jung Min-ho At a glance, Lee Dae-hoon might seem like a sports star who has everything. Before hanging up his uniform after the 2020 Tokyo Games, the 31-year-old was one of Korea's most decorated taekwondo athletes, having won more than 20 gold medals at international events. Yet there is one blemish on his near-perfect career. He could not accomplish his long-sought dream of capturing an Olympic crown. Lee, who is now competing in the World Taekwondo (WT) Championships as a coach in Baku, Azerbaijan, believes that the experience of failure could help his new dream of representing all athletes ― not just the very best of them ― as a member of the International Olympic Committee (IOC). \"Most members of the IOC Athletes' Commission were popular and have the experience of winning an Olympic gold medal. Considering their roles, however, I think those who are able to communicate well with (all) athletes about the power and meaning of sports should serve as members,\" Lee said in comments sent through the WT. \"I may not have won an Olympic gold medal. But it would be meaningful if I ― a person with good sportsmanship ― represent them as its member.\" Lee emphasized taekwondo's broad fan base, which he thinks would be helpful to represent the inclusive spirit of sports. \"Taekwondo has power. WT has more member countries than all but football. Taekwondo offers opportunities to win Olympic medals to many countries that would otherwise have no such opportunities,\" he said. \"I believe the strength of taekwondo would be my strength (in a bid to become an IOC member).\" Lee is one of the six candidates competing to fill two vacant seats assigned for male athletes at WT's Athletes' Committee. For the two other seats for women, three candidates are vying. About 900 athletes in the capital of Azerbaijan have cast their votes during the competition that runs from May 29 to June 4. The winners will be announced on June 3. The body consists of six members in total. The two others are Jaouad Achab of Belgium and Valeria Santos of Brazil, who won the seats at WT's previous event in Guadalajara, western Mexico. \"When I was an athlete, my communication with other athletes was usually short … As I'm vying (for the seat), I try to approach them more personally for more conversations. Despite my poor English, many have responded pleasantly to my attempt,\" Lee said. \"The seat at the WT committee is the first step to my challenge. I will do my best to produce the best results to reach my next goal of the IOC membership.\"","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/be3a96a671684970b52667b9dc9458af.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea coach takes trip delay in stride ahead of U-20 World Cup knockouts","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352071.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea head coach Kim Eun-jung wants to ensure a travel delay in Argentina won't affect his team's upcoming knockout match at the FIFA U-20 World Cup.","content":"Korea head coach Kim Eun-jung directs his players against Gambia during a Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap Korea head coach Kim Eun-jung wants to ensure a travel delay in Argentina won't affect his team's upcoming knockout match at the FIFA U-20 World Cup. Korea qualified for the last 16 at the tournament after playing all three group matches in Mendoza, western Argentina, over the past week. Their first knockout match is against Ecuador in Santiago del Estero in the northern part of the host country at 6 p.m. Thursday (local time), or 6 a.m. Friday in Seoul. Kim's team had been scheduled to travel to Santiago del Estero at 3 p.m. Monday on a chartered plane provided by FIFA. However, the trip was pushed back to 10 a.m. Tuesday, due to what the Korea Football Association (KFA) said were issues with charter flights. The KFA said Gambia and Italy, among other knockout-bound teams, had also experienced delays. Kim said Tuesday he will prepare his players so that the unexpected delay won't have any impact on their match. \"We were going to take Monday off anyway. So it was just a difference of having that day off here or in Mendoza,\" Kim said in Santiago del Estero, in a video clip released by the KFA. \"It would have been better if we'd enjoyed the time off here. The guys are a bit more fatigued after traveling today. But we will try to help them recover in time and get them ready to go on the day of the match.\" Korean goalkeeper Moon Hyun-ho, center, makes a stop against Gambia during the teams' Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap Kim said he was pleased with the conditions of the training facility in Santiago del Estero, compared with the one in Mendoza. \"It's several degrees warmer here than there,\" the coach said. \"As far as avoiding injuries and keeping the players healthy, I think we're in a better spot.\" Korea will be playing in the knockout stage for the third consecutive U-20 World Cup, after reaching the round of 16 in 2017 and finishing as the runners-up to Ukraine in 2019. The 2021 tournament was canceled due to the COVID-19 pandemic. If Korea beat Ecuador, they will stay in Santiago del Estero for the quarterfinal match against either Argentina or Nigeria at 2:30 p.m. Sunday, or 2:30 a.m. Monday (Korean time). (Yonhap) Korean players and coaches celebrate after finishing second in Group F at the FIFA U-20 World Cup following a goalless draw with Gambia at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/8b7eb1bd8e8d4358811366e35060e02b.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Tottenham star Son Heung-min returns home after up-and-down Premier League season","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352016.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"South Korean football icon Son Heung-min came home Tuesday after completing a tumultuous Premier League season with Tottenham Hotspur, a campaign that featured a serious injury, multiple coaching changes and a significant personal milestone. Son arrived at Incheon International Airport, west of Seoul, to great fanfare Tuesday afternoon. Judging by the reception, it would have been difficult to guess Son had just wrapped up an unproductive season, at both individual and club levels.","content":"Tottenham Hotspur star forward Son Heung-min wave hands to fans upon his arrival at Incheon International Airport, west of Seoul, Tuesday. Yonhap South Korean football icon Son Heung-min came home Tuesday after completing a tumultuous Premier League season with Tottenham Hotspur, a campaign that featured a serious injury, multiple coaching changes and a significant personal milestone. Son arrived at Incheon International Airport, west of Seoul, to great fanfare Tuesday afternoon. Judging by the reception, it would have been difficult to guess Son had just wrapped up an unproductive season, at both individual and club levels. Son made history in the 2021-2022 season by becoming the first Asian player to win the Premier League Golden Boot. He shared the honor with Mohamed Salah of Liverpool by scoring a career-high 23 goals in 35 matches. Son scored just 10 times in 36 matches this past season, barely able to reach double figures for the seventh consecutive season. Son didn't score until his seventh match of the season, as he bust out of his slump with a hat trick against Leicester City in September. Son, however, was held goalless for the next eight games, including the two immediately following the midseason break for the FIFA World Cup. And with only about three weeks before the big tournament, Son suffered broken facial bones in a collision with an opponent during a UEFA Champions League match in early November. It didn't just threaten to derail Tottenham's season; whatever hopes South Korea had of going on a deep run at the World Cup seemed to have been dashed. Son gamely played wearing a protective mask, as he captained South Korea to the round of 16 for the country's first knockout appearance in 12 years. The awe-inspiring performance in Qatar didn't quite translate to success in the Premier League. When the calendar flipped to 2023, Son was still stuck at three goals. Stuck in Premier League purgatory that is mid-table, Tottenham sacked head coach Antonio Conte in late March. Among the criticisms Conte had faced was his inability to bring the best out of Son. With caretaker boss Cristian Stellini and then his replacement Ryan Mason in charge, Son netted four goals in a five-match span in April. The goal against Brighton and Hove Albion on April 8 was Son's 100th career Premier League goal, making him the first Asian player to reach the century mark. Coaching changes did little to turn Tottenham's season around, though. They wrapped up their disappointing season with a 4-1 victory over Leeds United on Sunday. Despite the closing win, Spurs still finished in eighth place with 60 points and missed out on all European competitions for next season ― the UEFA Champions League, Europa League and Conference League. Spurs will be on the outside looking in during all continental club battles for the first time in 13 years. Son, who joined Tottenham prior to the 2015-2016 season, has played in a European club tournament every season of his career in north London. Son is longtime captain of the South Korean national team. He will suit up for the team's two friendly matches scheduled next month: against Peru on June 16 and then against El Salvador on June 20. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/511af8606234403bb213b121c3c8575f.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea clinches knockout berth at U-20 World Cup","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351854.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea has clinched a spot in the knockout stage at the FIFA U-20 World Cup in Argentina even before playing their final group stage match","content":"Korean players salute the crowd after a 2-2 draw against Honduras in a Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, in this May 25 photo provided by the Korea Football Association. Yonhap Korea has clinched a spot in the knockout stage at the FIFA U-20 World Cup in Argentina even before playing their final group stage match. Japan's 2-1 loss to Israel in Group C in Mendoza, western Argentina, on Saturday (local time) ensured that Korea will grab a ticket to the round of 16 from Group F regardless of their result against Gambia on Sunday. There are six groups of four nations in this tournament. The top two teams from each group, plus four best third-place teams, will advance to the last 16. Korea is currently in second place in Group F behind Gambia with four points. And Japan's loss meant Korea will be no worse than fourth best among all No. 3 seeds even if they lost to Gambia on Sunday. Among third-place teams, Nigeria and New Zealand have booked their knockout places with six points and four points apiece. Tunisia have three points with one match to play. Slovakia and Japan have finished their group play with three points, meaning they will finish behind Korea once the Koreans finish their group play. Korea head coach Kim Eun-jung awaits the start of a Group F match against Honduras at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, in this May 25 photo provided by the Korea Football Association. Yonhap Korea has now reached the knockouts at the third consecutive FIFA U-20 World Cup, following their runner-up finish in 2019 and an appearance in the last 16 in 2017. The 2021 tournament was canceled due to COVID-19. In Argentina, Korea beated France 2-1 to open the group stage and then played 10-man Honduras to a 2-2 draw. The group stage finale is set for 6 p.m. Sunday in Mendoza, or 6 a.m. Monday in Seoul time. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/c4f7d5cefa7f4df7917e627cb613faec.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korean soccer's standing rises on world stage","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351977.html?utm_source=fl","keywords":null,"creator":["john.duerden@gmail.com(KoreaTimes)"],"video_url":null,"description":"South Korean soccer has been flexing its muscles at home and abroad in the past week or so. The young Taeguk Warriors have made the knockout stages of the U-20 World Cup, which is taking place in Argentina while domestic organizations have been standing up for local clubs.","content":"South Korea's Cho Young-kwang, left, battles for the ball with Gambia's Mamin Sanyang during a FIFA U-20 World Cup Group F match at the Malvinas Argentinas stadium in Mendoza, Argentina, Sunday. / AP-Yonhap By John Duerden South Korean soccer has been flexing its muscles at home and abroad in the past week or so. The young Taeguk Warriors have made the knockout stages of the U-20 World Cup, which is taking place in Argentina while domestic organizations have been standing up for local clubs. The country has a good record in the U-20 World Cup, reaching the final of the last edition in 2019 (there was no 2021 competition due to the pandemic) where they lost to Ukraine. This time under the leadership of coach Kim Eun-jung, the Reds picked up an impressive 2-1 win over France in the opening game. The European team spent much of the game on top but was caught out with the perfect counter-attack that was finished by Lee Seung-won and then Korea moved further ahead in the second half. France pulled a goal back to ensure a tense finish but the game ended with three points. There was some disappointment as the second game against 10-man Honduras ended 2-2 but a place in the second round was clinched even before the final group game against Gambia. It remains to be seen which team will be the next opponent, but Korea will be looking forward to trying to match the class of 2019 and go as far as possible. Back home, however, this summer has been shaping up to become a busy one in terms of big European teams heading to the Land of the Morning Calm. Manchester City has just been crowned English Premier League champion and might become Europe's top dog later in June. Pep Guardiola's men will meet Atletico Madrid in Seoul in July. Scottish champion Celtic, which is led in attack by Korean striker Oh Hyeon-gyu, will meet Wolverhampton Wanderers of the English Premier League and Hwang Hee-chan. Roma is also due for a visit to take on Incheon United. The biggest story is that there are two European teams with Korean players who may not be coming this summer. Kim Min-jae's Napoli and Lee Kang-in's Real Mallorca had arranged two games on June 8 and 10. The second game could not go ahead as there were K League games taking place on the same date. The Korea Football Association asked the promoters to either pay a deposit or sign a contract that promised compensation if star players, assumed to be the Koreans especially, did not play. This was all the result of a match that took place in 2019, when there was a lot of controversy and bad feeling as Juventus came to Seoul and did not play Cristiano Ronaldo. The game had been heavily promoted off the back of the five-time Ballon d'Or winner but the Portuguese international stayed on the bench for the full 90 minutes, leaving many fans furious. With the promoters unwilling or unable to make those commitments, the game is not going to go ahead. It is a sign of the authorities doing what needed to be done to protect the local league in the face of foreign incursions. Now is the turn for the young players to go and make waves in Argentina.","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/69b26e9a3a50405fb9888f190b5671df.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea to face Wales in men's football friendly in Sept.","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351939.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea will travel to Wales for a men's friendly football match in September, for their first appearance in Europe under new coach Jurgen Klinsmann.","content":"This photo shows Korean players acknowledge the crowd at Seoul World Cup Stadium in Seoul following a 2-1 loss to Uruguay in a men's football friendly match, March 28. Yonhap Korea will travel to Wales for a men's friendly football match in September, for their first appearance in Europe under new coach Jurgen Klinsmann. The Korea Football Association (KFA) announced Monday afternoon that Korea and Wales will square off at Cardiff City Stadium in the Welsh capital on Sept. 7. The kickoff time will be determined later, the KFA added. The match falls during the September international match window, as set by FIFA. The KFA said it is also trying to schedule a second match during the Sept. 4-12 period, and it will likely be a non-European side because most teams on the continent will be playing qualifiers for the UEFA Euro 2024. Korea's previous matches in Europe took place in January 2022, when the Taegeuk Warriors faced Iceland and Moldova in the neutral country of Turkey. The last time Korea visited the home country of their opponents came in March 2018, when they played Northern Ireland in Belfast and Poland in the southern Polish city of Chorzow. Korea, world No. 27, and Wales, one spot above, have never faced each other before. This photo shows Son Heung-min of Korea, right, tries to dribble past Uruguay during a men's football friendly match at Seoul World Cup Stadium in Seoul, March 28. Yonhap Both countries competed at last year's FIFA World Cup in Qatar, where Korea reached the round of 16 and Wales crashed out of the group stage in their first World Cup appearance in 64 years. During the June window, Korea will host Peru on June 16 in the southeastern city of Busan and then El Salvador on June 20 in the central city of Daejeon. Klinsmann had a draw and a loss in his first two matches at the Korean helm in March. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/d093b55649ad462492a5b31dac8e7715.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Diogo Dalot signs new contract with Manchester United","link":"https://www.iol.co.za/sport/soccer/premier-league/diogo-dalot-signs-new-contract-with-manchester-united-9635baf7-4461-4547-9f09-2984ef86cfac","keywords":null,"creator":["AFP"],"video_url":null,"description":"Right back Diogo Dalot has been rewarded with a contract extension that will keep him at Old Trafford until at least 2028.","content":"London — Manchester United defender Diogo Dalot has signed a contract extension that will keep him at Old Trafford until at least 2028. Dalot's new five-year deal includes the option of a further season as the right-back is rewarded for an impressive season with the club. Erik ten Hag's team finished third in the Premier League, won the League Cup and face Manchester City in the FA Cup final on Saturday. The 24-year-old, capped 11 times by Portugal, joined United from Porto in 2018 and has gone on to make 107 appearances in all competitions. Dalot, who spent the 2020-21 season on loan at AC Milan, said: \"Playing for Manchester United is one of the highest honours that you can have in football. \"We have shared some fantastic moments over the past five years and I've grown so much and my passion for this incredible club has only increased since the day that I joined. \"As a group of players, we all feel like we are at the start of a special journey right now. \"I can assure you that I will dedicate myself relentlessly to helping this group to achieve our aims and make the fans proud of this team. \"That drive continues this week with everyone intensely focused on preparations for the FA Cup final.\" AFP Share","pubDate":"2023-05-31 17:04:55","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/c43d7566-3f0e-5ef6-883a-15f87b73d7b4&operation=CROP&offset=0x104&resize=1173x659","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"We live in the shadow of massive football stadium – fans dump litter in our gardens and smash our windows…we hate it","link":"https://www.thesun.co.uk/sport/22532282/shadow-massive-football-stadium-fans/","keywords":["Football","Sport","Homes","Premier League","Road Laws"],"creator":["Tom Duffy"],"video_url":null,"description":null,"content":"LOCALS living in the shadow of a Premier League ground claim their lives are a \"nightmare\" on match days and fear things will only get worse. Residents living next to Villa Park have told of rowdy fans urinating in gardens, smashing windows, vandalising cars and blocking driveways. Locals have taken to picking up strewn kebab wrappers and beer cans after match days at the club supported by Prince William and Tom Hanks. Some have started studying fixture lists in attempt to avoid match days, when they know their driveways will be blocked by ignorant fans. Aston Villa are set for European football next season after a remarkable turnaround in form under new gaffer Unai Emery. And the famous club have had a near 10,000 seat new stand approved in the past few months, which locals fear is just going to make the problems worse. Abu Zaman, 26, is a Villa fan but says living near the team he supports is no fun as his car has been damaged on multiple occasions. Business owner Abu, who has lived on Trinity Road all of his life, said: \"The parking and the traffic are really bad. \"We get people who scratch our cars and previously had people smash our windows. \"Our road is shut on the day. On a match day you have to wait for the game to start at which point your whole day is wasted. \"Then there's the parking, the litter and the vandalism. The roads are open but the supporters are walking on the road and blocking them. \"In the 26 years Villa have only approached us for once for planning permission for the ground extension, they don't care about the local community. \"As long as their pockets are lined, they don't care. It's all about tickets and season tickets for them. \"The roads are covered in alcohol bottles, burger wrappers, pretty much everything.\" Dad-of-one James Payne, 35, who lives on nearby Endicott Road, added: \"This is a built up area, the infrastructure can't support even more fans. \"It's bad enough as it is - having to wade through a sea of beer bottles and takeaway wrappers just to get to your front door. \"We've had people urinating in our front garden, I'm sure people act like they wouldn't usually do when they go the football. They turn into yobs. \"Someone once ripped our fence post up and began attacking a rival fan with it. It's just bonkers. \"They get famous fans like Prince William and Tom Hanks seeing all the glamour of Premier League football - but just a stones throw away for us it's a nightmare.\" Andrea Sawyers has lived on Trinity Road since 2012 and said she and her mum have to clean up huge piles of litter left behind by fans themselves. Mum-of-two Andrea said: \"I'm a bit of a Villa fan, I'm not a massive one but a fan. \"The garbage after is the problem, no one cleans up. My mum and I have to do it. All the beer glasses and bottle all over the bins. \"They throw in my garden, all the chip wrappers too. \"There's also nowhere to park your car, it's always a busy time. \"They've smashed my neighbours car windows a couple of times. It's crazy. I don't get why they have to go so crazy. \"It's mainly the rubbish, it's left to locals, you have to clean it up yourselves.\" Osman Mohammed, 30, is a council worker and has lived on Endicott Road all of his life. He says he has to plan over a week in advance before he goes out on match days before a fan blocks his drive with their car. He added: \"It gets quite busy. Our issue is we have residential parking nearby, supporters can't park there, but some try anyway. \"I sometimes look when Villa are playing and plan ahead. \"I don't leave the house at game time as I can be stuck in traffic for around an hour just to get around the corner.\" Shop owner Md Gias Uddin, 58, admitted there is a litter problem on matchdays but the increased footfall was good for local businesses. Mr Uddin, who owns a shop on Endicott Road, said: \"All of the supporters like my shop mostly, most of them say it's neat and clean. My experiences is very nice. \"The litter is problem is when the most of the people come to see the football match. \"The litter bin is full and there needs to be more bins. There are a few bins around. People will put their rubbish in the bin if there were more.\" Fellow shop owner Ash Mahmood, 59, has worked in the area for 40 years and says matchday traffic means it can take over an hour to travel a couple of miles. Ash, who owns Ash Food Fair on Witton Road, said: \"The worst part I think at the moment is the parking for the customers. Residents moves their cars and park them near me. \"When you finally get out of here, it takes a while to get out. It took me an hour to get out of Aston. \"Years ago there used to be fights around here all the time but now it's all controlled by the police.\" The Sun approached Aston Villa for comment.","pubDate":"2023-05-31 15:04:55","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"NFL bei RTL: Werner und Esume enthüllen erste Sendungs-Details ","link":"https://www.watson.de/sport/nfl/821525140-nfl-bei-rtl-experten-werner-und-esume-geben-details-der-sendung-bekannt","keywords":null,"creator":["Lukas Grybowski"],"video_url":null,"description":"Dabei wurde Björn Werner so euphorisch, dass er sich selbst bremsen musste, um nicht alle Highlights zu verraten.","content":"NFL bei RTL: Werner und Esume enthüllen erste Sendungs-Details Lange wurde spekuliert, am vergangenen Freitag war es dann offiziell: RTL stellte sein Reporter- und Expertenteam vor, das ab Anfang September regelmäßig am Sonntagabend die Spiele in der amerikanischen Football-Liga begleiten wird. Mit dabei sind bekannte Gesichter wie der zweifache Super-Bowl-Gewinner Sebastian Vollmer und die Sky-Kommentatoren Frank Buschmann und Florian Schmidt-Sommerfeld, die die bereits NFL-Spiele bei ProSieben kommentierten, ehe sie zu Sky wechselten. In den jahrelangen Übertragungen bei ProSieben entwickelten sich vor allem Ex-NFL-Spieler Björn Werner und Experte Patrick Esume zu echten Publikumslieblingen. A uch sie sind künftig Teil des NFL-Teams und verrieten in ihrem Podcast \"Football Bromance\", was sich im Vergleich zu ProSieben ändern wird. NFL auf RTL+ mit eigenem Studio Der Umfang der Spiele, die RTL übertragen wird, hat sich im Vergleich zu ProSieben nicht geändert. Bei RTL, Nitro und im Stream bei RTL+ werden insgesamt 80 Spiele inklusive Playoffs und Super Bowl gezeigt. Sonntags werden zwei Spiele im RTL-Hauptprogramm übertragen, zudem ein weiteres Spiel auf RTL+. Bei ProSieben lief das ähnlich, doch dabei wurde das dritte Spiel auf ran.de von einem Kommentator begleitet. Das wird es künftig so bei RTL+ nicht geben. Stattdessen betonte Ex-Profi Björn Werner, dass \"viel mehr Fokus\" auf diesem Spiel liegen werde und nicht \"so ein bisschen nebenbei\", wie bei ProSieben. Dort wurde während der Übertragung im Hauptprogramm zwar immer auf den Stream verwiesen, doch nur hin geschaltet, wenn die eigentliche Partie schon entschieden war und sich im Stream eine spannende Endphase andeutete. Euphorisch erklärt Werner daher: \"RTL packt da an und investiert deswegen auch in diese ganzen Menschen, die hier sind. Sie packen eine gesamte Crew in ein Studio. Sie haben ein eigenes Studio für RTL+-Spiele und, wenn... \", dann bremste sich Werner jedoch selbst und wollte noch nicht mehr Details verraten. Wechsel von Sky-Kommentator seit Dezember klar Mit Florian Schmidt-Sommerfeld ist ein weiteres bekanntes Gesicht ein Teil der NFL bei RTL. Er teilte vor drei Tagen ein tränenreiches Video bei Instagram, in denen er sich filmte, kurz nachdem er die Zusage bekam. Jeden Sonntag Football-Übertragungen nur aus der Ferne zu sehen, sei für ihn extrem schmerzhaft gewesen. Nun würde jedoch ein Traum für ihn Erfüllung gehen, zum Football zurückzukehren. Und es ist möglich, dass es noch weitere neue Gesichter gibt. Zwar sei das Team laut den beiden bereits sehr groß, \"aber vielleicht kommt noch der ein oder andere dazu\", mutmaßte Esume. Carsten Spengemann, der bisher auf ProSieben NFL-Spiele kommentierte, stand ebenfalls in Verhandlungen mit RTL. In seinem Podcast \"Die Pille für den Mann\" erklärte er, dass sein Management nach dem Wechsel der Übertragungsrechte zwei bis dreimal mit dem Kölner Sender gesprochen hätte. \" Danach hat mit mir persönlich keiner mehr gesprochen. Das ist das einzige, was ich dazu sagen kann.\" Gleichzeitig betonte er, dass er ebenfalls gerne dabei gewesen wäre.","pubDate":"2023-05-31 14:35:15","image_url":null,"source_id":"watson","category":["sports"],"country":["germany"],"language":"german"},{"title":"Latest: Portsmouth rivals reveal position over £4m Ipswich & Coventry target as Derby enter race for prolific striker","link":"https://www.portsmouth.co.uk/sport/football/portsmouth-fc/latest-portsmouth-rivals-reveal-position-over-ps4m-ipswich-coventry-target-as-derby-enter-race-for-prolific-striker-4164188","keywords":["Portsmouth FC","Football","Sport"],"creator":["Pepe Lacey"],"video_url":null,"description":"With the play-offs now complete, clubs across the EFL have turned their attentions to the upcoming transfer window.","content":null,"pubDate":"2023-05-31 13:30:00","image_url":"https://www.portsmouth.co.uk/webimg/b25lY21zOjMxMjFmMGM3LWUwNjMtNGU0NC1iYjAzLTMzYzNkMDhhMDA4MDo0YzEzODk1Yy0xN2VjLTQyMjgtOGU3OC01NDM2ZDhlMzM0MDQ=.jpg","source_id":"portsmouth","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Taekwondo star dreams of becoming IOC member","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352048.html?utm_source=fl","keywords":null,"creator":["mj6c2@koreatimes.co.kr(Jung Min-ho)"],"video_url":null,"description":"At a glance, Lee Dae-hoon might seem like a sports star who has everything. Before hanging up his uniform after the 2020 Tokyo Games, the 31-year-old was one of Korea's most decorated taekwondo athletes, having won more than 20 gold medals at international events.","content":"Taekwondo coach Lee Dae-hoon poses in this photo provided by World Taekwondo. Lee, now 31, was one of Korea's most decorated taekwondo stars before his retirement following the 2020 Tokyo Olympics. Courtesy of World Taekwondo By Jung Min-ho At a glance, Lee Dae-hoon might seem like a sports star who has everything. Before hanging up his uniform after the 2020 Tokyo Games, the 31-year-old was one of Korea's most decorated taekwondo athletes, having won more than 20 gold medals at international events. Yet there is one blemish on his near-perfect career. He could not accomplish his long-sought dream of capturing an Olympic crown. Lee, who is now competing in the World Taekwondo (WT) Championships as a coach in Baku, Azerbaijan, believes that the experience of failure could help his new dream of representing all athletes ― not just the very best of them ― as a member of the International Olympic Committee (IOC). \"Most members of the IOC Athletes' Commission were popular and have the experience of winning an Olympic gold medal. Considering their roles, however, I think those who are able to communicate well with (all) athletes about the power and meaning of sports should serve as members,\" Lee said in comments sent through the WT. \"I may not have won an Olympic gold medal. But it would be meaningful if I ― a person with good sportsmanship ― represent them as its member.\" Lee emphasized taekwondo's broad fan base, which he thinks would be helpful to represent the inclusive spirit of sports. \"Taekwondo has power. WT has more member countries than all but football. Taekwondo offers opportunities to win Olympic medals to many countries that would otherwise have no such opportunities,\" he said. \"I believe the strength of taekwondo would be my strength (in a bid to become an IOC member).\" Lee is one of the six candidates competing to fill two vacant seats assigned for male athletes at WT's Athletes' Committee. For the two other seats for women, three candidates are vying. About 900 athletes in the capital of Azerbaijan have cast their votes during the competition that runs from May 29 to June 4. The winners will be announced on June 3. The body consists of six members in total. The two others are Jaouad Achab of Belgium and Valeria Santos of Brazil, who won the seats at WT's previous event in Guadalajara, western Mexico. \"When I was an athlete, my communication with other athletes was usually short … As I'm vying (for the seat), I try to approach them more personally for more conversations. Despite my poor English, many have responded pleasantly to my attempt,\" Lee said. \"The seat at the WT committee is the first step to my challenge. I will do my best to produce the best results to reach my next goal of the IOC membership.\"","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/be3a96a671684970b52667b9dc9458af.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea coach takes trip delay in stride ahead of U-20 World Cup knockouts","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352071.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea head coach Kim Eun-jung wants to ensure a travel delay in Argentina won't affect his team's upcoming knockout match at the FIFA U-20 World Cup.","content":"Korea head coach Kim Eun-jung directs his players against Gambia during a Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap Korea head coach Kim Eun-jung wants to ensure a travel delay in Argentina won't affect his team's upcoming knockout match at the FIFA U-20 World Cup. Korea qualified for the last 16 at the tournament after playing all three group matches in Mendoza, western Argentina, over the past week. Their first knockout match is against Ecuador in Santiago del Estero in the northern part of the host country at 6 p.m. Thursday (local time), or 6 a.m. Friday in Seoul. Kim's team had been scheduled to travel to Santiago del Estero at 3 p.m. Monday on a chartered plane provided by FIFA. However, the trip was pushed back to 10 a.m. Tuesday, due to what the Korea Football Association (KFA) said were issues with charter flights. The KFA said Gambia and Italy, among other knockout-bound teams, had also experienced delays. Kim said Tuesday he will prepare his players so that the unexpected delay won't have any impact on their match. \"We were going to take Monday off anyway. So it was just a difference of having that day off here or in Mendoza,\" Kim said in Santiago del Estero, in a video clip released by the KFA. \"It would have been better if we'd enjoyed the time off here. The guys are a bit more fatigued after traveling today. But we will try to help them recover in time and get them ready to go on the day of the match.\" Korean goalkeeper Moon Hyun-ho, center, makes a stop against Gambia during the teams' Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap Kim said he was pleased with the conditions of the training facility in Santiago del Estero, compared with the one in Mendoza. \"It's several degrees warmer here than there,\" the coach said. \"As far as avoiding injuries and keeping the players healthy, I think we're in a better spot.\" Korea will be playing in the knockout stage for the third consecutive U-20 World Cup, after reaching the round of 16 in 2017 and finishing as the runners-up to Ukraine in 2019. The 2021 tournament was canceled due to the COVID-19 pandemic. If Korea beat Ecuador, they will stay in Santiago del Estero for the quarterfinal match against either Argentina or Nigeria at 2:30 p.m. Sunday, or 2:30 a.m. Monday (Korean time). (Yonhap) Korean players and coaches celebrate after finishing second in Group F at the FIFA U-20 World Cup following a goalless draw with Gambia at Estadio Malvinas Argentinas in Mendoza, Argentina, May 28. Yonhap","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/8b7eb1bd8e8d4358811366e35060e02b.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Tottenham star Son Heung-min returns home after up-and-down Premier League season","link":"https://koreatimes.co.kr/www/nation/2023/06/600_352016.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"South Korean football icon Son Heung-min came home Tuesday after completing a tumultuous Premier League season with Tottenham Hotspur, a campaign that featured a serious injury, multiple coaching changes and a significant personal milestone. Son arrived at Incheon International Airport, west of Seoul, to great fanfare Tuesday afternoon. Judging by the reception, it would have been difficult to guess Son had just wrapped up an unproductive season, at both individual and club levels.","content":"Tottenham Hotspur star forward Son Heung-min wave hands to fans upon his arrival at Incheon International Airport, west of Seoul, Tuesday. Yonhap South Korean football icon Son Heung-min came home Tuesday after completing a tumultuous Premier League season with Tottenham Hotspur, a campaign that featured a serious injury, multiple coaching changes and a significant personal milestone. Son arrived at Incheon International Airport, west of Seoul, to great fanfare Tuesday afternoon. Judging by the reception, it would have been difficult to guess Son had just wrapped up an unproductive season, at both individual and club levels. Son made history in the 2021-2022 season by becoming the first Asian player to win the Premier League Golden Boot. He shared the honor with Mohamed Salah of Liverpool by scoring a career-high 23 goals in 35 matches. Son scored just 10 times in 36 matches this past season, barely able to reach double figures for the seventh consecutive season. Son didn't score until his seventh match of the season, as he bust out of his slump with a hat trick against Leicester City in September. Son, however, was held goalless for the next eight games, including the two immediately following the midseason break for the FIFA World Cup. And with only about three weeks before the big tournament, Son suffered broken facial bones in a collision with an opponent during a UEFA Champions League match in early November. It didn't just threaten to derail Tottenham's season; whatever hopes South Korea had of going on a deep run at the World Cup seemed to have been dashed. Son gamely played wearing a protective mask, as he captained South Korea to the round of 16 for the country's first knockout appearance in 12 years. The awe-inspiring performance in Qatar didn't quite translate to success in the Premier League. When the calendar flipped to 2023, Son was still stuck at three goals. Stuck in Premier League purgatory that is mid-table, Tottenham sacked head coach Antonio Conte in late March. Among the criticisms Conte had faced was his inability to bring the best out of Son. With caretaker boss Cristian Stellini and then his replacement Ryan Mason in charge, Son netted four goals in a five-match span in April. The goal against Brighton and Hove Albion on April 8 was Son's 100th career Premier League goal, making him the first Asian player to reach the century mark. Coaching changes did little to turn Tottenham's season around, though. They wrapped up their disappointing season with a 4-1 victory over Leeds United on Sunday. Despite the closing win, Spurs still finished in eighth place with 60 points and missed out on all European competitions for next season ― the UEFA Champions League, Europa League and Conference League. Spurs will be on the outside looking in during all continental club battles for the first time in 13 years. Son, who joined Tottenham prior to the 2015-2016 season, has played in a European club tournament every season of his career in north London. Son is longtime captain of the South Korean national team. He will suit up for the team's two friendly matches scheduled next month: against Peru on June 16 and then against El Salvador on June 20. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/511af8606234403bb213b121c3c8575f.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea clinches knockout berth at U-20 World Cup","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351854.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea has clinched a spot in the knockout stage at the FIFA U-20 World Cup in Argentina even before playing their final group stage match","content":"Korean players salute the crowd after a 2-2 draw against Honduras in a Group F match at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, in this May 25 photo provided by the Korea Football Association. Yonhap Korea has clinched a spot in the knockout stage at the FIFA U-20 World Cup in Argentina even before playing their final group stage match. Japan's 2-1 loss to Israel in Group C in Mendoza, western Argentina, on Saturday (local time) ensured that Korea will grab a ticket to the round of 16 from Group F regardless of their result against Gambia on Sunday. There are six groups of four nations in this tournament. The top two teams from each group, plus four best third-place teams, will advance to the last 16. Korea is currently in second place in Group F behind Gambia with four points. And Japan's loss meant Korea will be no worse than fourth best among all No. 3 seeds even if they lost to Gambia on Sunday. Among third-place teams, Nigeria and New Zealand have booked their knockout places with six points and four points apiece. Tunisia have three points with one match to play. Slovakia and Japan have finished their group play with three points, meaning they will finish behind Korea once the Koreans finish their group play. Korea head coach Kim Eun-jung awaits the start of a Group F match against Honduras at the FIFA U-20 World Cup at Estadio Malvinas Argentinas in Mendoza, Argentina, in this May 25 photo provided by the Korea Football Association. Yonhap Korea has now reached the knockouts at the third consecutive FIFA U-20 World Cup, following their runner-up finish in 2019 and an appearance in the last 16 in 2017. The 2021 tournament was canceled due to COVID-19. In Argentina, Korea beated France 2-1 to open the group stage and then played 10-man Honduras to a 2-2 draw. The group stage finale is set for 6 p.m. Sunday in Mendoza, or 6 a.m. Monday in Seoul time. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/c4f7d5cefa7f4df7917e627cb613faec.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korean soccer's standing rises on world stage","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351977.html?utm_source=fl","keywords":null,"creator":["john.duerden@gmail.com(KoreaTimes)"],"video_url":null,"description":"South Korean soccer has been flexing its muscles at home and abroad in the past week or so. The young Taeguk Warriors have made the knockout stages of the U-20 World Cup, which is taking place in Argentina while domestic organizations have been standing up for local clubs.","content":"South Korea's Cho Young-kwang, left, battles for the ball with Gambia's Mamin Sanyang during a FIFA U-20 World Cup Group F match at the Malvinas Argentinas stadium in Mendoza, Argentina, Sunday. / AP-Yonhap By John Duerden South Korean soccer has been flexing its muscles at home and abroad in the past week or so. The young Taeguk Warriors have made the knockout stages of the U-20 World Cup, which is taking place in Argentina while domestic organizations have been standing up for local clubs. The country has a good record in the U-20 World Cup, reaching the final of the last edition in 2019 (there was no 2021 competition due to the pandemic) where they lost to Ukraine. This time under the leadership of coach Kim Eun-jung, the Reds picked up an impressive 2-1 win over France in the opening game. The European team spent much of the game on top but was caught out with the perfect counter-attack that was finished by Lee Seung-won and then Korea moved further ahead in the second half. France pulled a goal back to ensure a tense finish but the game ended with three points. There was some disappointment as the second game against 10-man Honduras ended 2-2 but a place in the second round was clinched even before the final group game against Gambia. It remains to be seen which team will be the next opponent, but Korea will be looking forward to trying to match the class of 2019 and go as far as possible. Back home, however, this summer has been shaping up to become a busy one in terms of big European teams heading to the Land of the Morning Calm. Manchester City has just been crowned English Premier League champion and might become Europe's top dog later in June. Pep Guardiola's men will meet Atletico Madrid in Seoul in July. Scottish champion Celtic, which is led in attack by Korean striker Oh Hyeon-gyu, will meet Wolverhampton Wanderers of the English Premier League and Hwang Hee-chan. Roma is also due for a visit to take on Incheon United. The biggest story is that there are two European teams with Korean players who may not be coming this summer. Kim Min-jae's Napoli and Lee Kang-in's Real Mallorca had arranged two games on June 8 and 10. The second game could not go ahead as there were K League games taking place on the same date. The Korea Football Association asked the promoters to either pay a deposit or sign a contract that promised compensation if star players, assumed to be the Koreans especially, did not play. This was all the result of a match that took place in 2019, when there was a lot of controversy and bad feeling as Juventus came to Seoul and did not play Cristiano Ronaldo. The game had been heavily promoted off the back of the five-time Ballon d'Or winner but the Portuguese international stayed on the bench for the full 90 minutes, leaving many fans furious. With the promoters unwilling or unable to make those commitments, the game is not going to go ahead. It is a sign of the authorities doing what needed to be done to protect the local league in the face of foreign incursions. Now is the turn for the young players to go and make waves in Argentina.","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/69b26e9a3a50405fb9888f190b5671df.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Korea to face Wales in men's football friendly in Sept.","link":"https://koreatimes.co.kr/www/nation/2023/06/600_351939.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea will travel to Wales for a men's friendly football match in September, for their first appearance in Europe under new coach Jurgen Klinsmann.","content":"This photo shows Korean players acknowledge the crowd at Seoul World Cup Stadium in Seoul following a 2-1 loss to Uruguay in a men's football friendly match, March 28. Yonhap Korea will travel to Wales for a men's friendly football match in September, for their first appearance in Europe under new coach Jurgen Klinsmann. The Korea Football Association (KFA) announced Monday afternoon that Korea and Wales will square off at Cardiff City Stadium in the Welsh capital on Sept. 7. The kickoff time will be determined later, the KFA added. The match falls during the September international match window, as set by FIFA. The KFA said it is also trying to schedule a second match during the Sept. 4-12 period, and it will likely be a non-European side because most teams on the continent will be playing qualifiers for the UEFA Euro 2024. Korea's previous matches in Europe took place in January 2022, when the Taegeuk Warriors faced Iceland and Moldova in the neutral country of Turkey. The last time Korea visited the home country of their opponents came in March 2018, when they played Northern Ireland in Belfast and Poland in the southern Polish city of Chorzow. Korea, world No. 27, and Wales, one spot above, have never faced each other before. This photo shows Son Heung-min of Korea, right, tries to dribble past Uruguay during a men's football friendly match at Seoul World Cup Stadium in Seoul, March 28. Yonhap Both countries competed at last year's FIFA World Cup in Qatar, where Korea reached the round of 16 and Wales crashed out of the group stage in their first World Cup appearance in 64 years. During the June window, Korea will host Peru on June 16 in the southeastern city of Busan and then El Salvador on June 20 in the central city of Daejeon. Klinsmann had a draw and a loss in his first two matches at the Korean helm in March. (Yonhap)","pubDate":"2023-05-31 19:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/d093b55649ad462492a5b31dac8e7715.jpg","source_id":"koreatimes","category":["sports"],"country":["south korea"],"language":"english"},{"title":"Diogo Dalot signs new contract with Manchester United","link":"https://www.iol.co.za/sport/soccer/premier-league/diogo-dalot-signs-new-contract-with-manchester-united-9635baf7-4461-4547-9f09-2984ef86cfac","keywords":null,"creator":["AFP"],"video_url":null,"description":"Right back Diogo Dalot has been rewarded with a contract extension that will keep him at Old Trafford until at least 2028.","content":"London — Manchester United defender Diogo Dalot has signed a contract extension that will keep him at Old Trafford until at least 2028. Dalot's new five-year deal includes the option of a further season as the right-back is rewarded for an impressive season with the club. Erik ten Hag's team finished third in the Premier League, won the League Cup and face Manchester City in the FA Cup final on Saturday. The 24-year-old, capped 11 times by Portugal, joined United from Porto in 2018 and has gone on to make 107 appearances in all competitions. Dalot, who spent the 2020-21 season on loan at AC Milan, said: \"Playing for Manchester United is one of the highest honours that you can have in football. \"We have shared some fantastic moments over the past five years and I've grown so much and my passion for this incredible club has only increased since the day that I joined. \"As a group of players, we all feel like we are at the start of a special journey right now. \"I can assure you that I will dedicate myself relentlessly to helping this group to achieve our aims and make the fans proud of this team. \"That drive continues this week with everyone intensely focused on preparations for the FA Cup final.\" AFP Share","pubDate":"2023-05-31 17:04:55","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/c43d7566-3f0e-5ef6-883a-15f87b73d7b4&operation=CROP&offset=0x104&resize=1173x659","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"We live in the shadow of massive football stadium – fans dump litter in our gardens and smash our windows…we hate it","link":"https://www.thesun.co.uk/sport/22532282/shadow-massive-football-stadium-fans/","keywords":["Football","Sport","Homes","Premier League","Road Laws"],"creator":["Tom Duffy"],"video_url":null,"description":null,"content":"LOCALS living in the shadow of a Premier League ground claim their lives are a \"nightmare\" on match days and fear things will only get worse. Residents living next to Villa Park have told of rowdy fans urinating in gardens, smashing windows, vandalising cars and blocking driveways. Locals have taken to picking up strewn kebab wrappers and beer cans after match days at the club supported by Prince William and Tom Hanks. Some have started studying fixture lists in attempt to avoid match days, when they know their driveways will be blocked by ignorant fans. Aston Villa are set for European football next season after a remarkable turnaround in form under new gaffer Unai Emery. And the famous club have had a near 10,000 seat new stand approved in the past few months, which locals fear is just going to make the problems worse. Abu Zaman, 26, is a Villa fan but says living near the team he supports is no fun as his car has been damaged on multiple occasions. Business owner Abu, who has lived on Trinity Road all of his life, said: \"The parking and the traffic are really bad. \"We get people who scratch our cars and previously had people smash our windows. \"Our road is shut on the day. On a match day you have to wait for the game to start at which point your whole day is wasted. \"Then there's the parking, the litter and the vandalism. The roads are open but the supporters are walking on the road and blocking them. \"In the 26 years Villa have only approached us for once for planning permission for the ground extension, they don't care about the local community. \"As long as their pockets are lined, they don't care. It's all about tickets and season tickets for them. \"The roads are covered in alcohol bottles, burger wrappers, pretty much everything.\" Dad-of-one James Payne, 35, who lives on nearby Endicott Road, added: \"This is a built up area, the infrastructure can't support even more fans. \"It's bad enough as it is - having to wade through a sea of beer bottles and takeaway wrappers just to get to your front door. \"We've had people urinating in our front garden, I'm sure people act like they wouldn't usually do when they go the football. They turn into yobs. \"Someone once ripped our fence post up and began attacking a rival fan with it. It's just bonkers. \"They get famous fans like Prince William and Tom Hanks seeing all the glamour of Premier League football - but just a stones throw away for us it's a nightmare.\" Andrea Sawyers has lived on Trinity Road since 2012 and said she and her mum have to clean up huge piles of litter left behind by fans themselves. Mum-of-two Andrea said: \"I'm a bit of a Villa fan, I'm not a massive one but a fan. \"The garbage after is the problem, no one cleans up. My mum and I have to do it. All the beer glasses and bottle all over the bins. \"They throw in my garden, all the chip wrappers too. \"There's also nowhere to park your car, it's always a busy time. \"They've smashed my neighbours car windows a couple of times. It's crazy. I don't get why they have to go so crazy. \"It's mainly the rubbish, it's left to locals, you have to clean it up yourselves.\" Osman Mohammed, 30, is a council worker and has lived on Endicott Road all of his life. He says he has to plan over a week in advance before he goes out on match days before a fan blocks his drive with their car. He added: \"It gets quite busy. Our issue is we have residential parking nearby, supporters can't park there, but some try anyway. \"I sometimes look when Villa are playing and plan ahead. \"I don't leave the house at game time as I can be stuck in traffic for around an hour just to get around the corner.\" Shop owner Md Gias Uddin, 58, admitted there is a litter problem on matchdays but the increased footfall was good for local businesses. Mr Uddin, who owns a shop on Endicott Road, said: \"All of the supporters like my shop mostly, most of them say it's neat and clean. My experiences is very nice. \"The litter is problem is when the most of the people come to see the football match. \"The litter bin is full and there needs to be more bins. There are a few bins around. People will put their rubbish in the bin if there were more.\" Fellow shop owner Ash Mahmood, 59, has worked in the area for 40 years and says matchday traffic means it can take over an hour to travel a couple of miles. Ash, who owns Ash Food Fair on Witton Road, said: \"The worst part I think at the moment is the parking for the customers. Residents moves their cars and park them near me. \"When you finally get out of here, it takes a while to get out. It took me an hour to get out of Aston. \"Years ago there used to be fights around here all the time but now it's all controlled by the police.\" The Sun approached Aston Villa for comment.","pubDate":"2023-05-31 15:04:55","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"NFL bei RTL: Werner und Esume enthüllen erste Sendungs-Details ","link":"https://www.watson.de/sport/nfl/821525140-nfl-bei-rtl-experten-werner-und-esume-geben-details-der-sendung-bekannt","keywords":null,"creator":["Lukas Grybowski"],"video_url":null,"description":"Dabei wurde Björn Werner so euphorisch, dass er sich selbst bremsen musste, um nicht alle Highlights zu verraten.","content":"NFL bei RTL: Werner und Esume enthüllen erste Sendungs-Details Lange wurde spekuliert, am vergangenen Freitag war es dann offiziell: RTL stellte sein Reporter- und Expertenteam vor, das ab Anfang September regelmäßig am Sonntagabend die Spiele in der amerikanischen Football-Liga begleiten wird. Mit dabei sind bekannte Gesichter wie der zweifache Super-Bowl-Gewinner Sebastian Vollmer und die Sky-Kommentatoren Frank Buschmann und Florian Schmidt-Sommerfeld, die die bereits NFL-Spiele bei ProSieben kommentierten, ehe sie zu Sky wechselten. In den jahrelangen Übertragungen bei ProSieben entwickelten sich vor allem Ex-NFL-Spieler Björn Werner und Experte Patrick Esume zu echten Publikumslieblingen. A uch sie sind künftig Teil des NFL-Teams und verrieten in ihrem Podcast \"Football Bromance\", was sich im Vergleich zu ProSieben ändern wird. NFL auf RTL+ mit eigenem Studio Der Umfang der Spiele, die RTL übertragen wird, hat sich im Vergleich zu ProSieben nicht geändert. Bei RTL, Nitro und im Stream bei RTL+ werden insgesamt 80 Spiele inklusive Playoffs und Super Bowl gezeigt. Sonntags werden zwei Spiele im RTL-Hauptprogramm übertragen, zudem ein weiteres Spiel auf RTL+. Bei ProSieben lief das ähnlich, doch dabei wurde das dritte Spiel auf ran.de von einem Kommentator begleitet. Das wird es künftig so bei RTL+ nicht geben. Stattdessen betonte Ex-Profi Björn Werner, dass \"viel mehr Fokus\" auf diesem Spiel liegen werde und nicht \"so ein bisschen nebenbei\", wie bei ProSieben. Dort wurde während der Übertragung im Hauptprogramm zwar immer auf den Stream verwiesen, doch nur hin geschaltet, wenn die eigentliche Partie schon entschieden war und sich im Stream eine spannende Endphase andeutete. Euphorisch erklärt Werner daher: \"RTL packt da an und investiert deswegen auch in diese ganzen Menschen, die hier sind. Sie packen eine gesamte Crew in ein Studio. Sie haben ein eigenes Studio für RTL+-Spiele und, wenn... \", dann bremste sich Werner jedoch selbst und wollte noch nicht mehr Details verraten. Wechsel von Sky-Kommentator seit Dezember klar Mit Florian Schmidt-Sommerfeld ist ein weiteres bekanntes Gesicht ein Teil der NFL bei RTL. Er teilte vor drei Tagen ein tränenreiches Video bei Instagram, in denen er sich filmte, kurz nachdem er die Zusage bekam. Jeden Sonntag Football-Übertragungen nur aus der Ferne zu sehen, sei für ihn extrem schmerzhaft gewesen. Nun würde jedoch ein Traum für ihn Erfüllung gehen, zum Football zurückzukehren. Und es ist möglich, dass es noch weitere neue Gesichter gibt. Zwar sei das Team laut den beiden bereits sehr groß, \"aber vielleicht kommt noch der ein oder andere dazu\", mutmaßte Esume. Carsten Spengemann, der bisher auf ProSieben NFL-Spiele kommentierte, stand ebenfalls in Verhandlungen mit RTL. In seinem Podcast \"Die Pille für den Mann\" erklärte er, dass sein Management nach dem Wechsel der Übertragungsrechte zwei bis dreimal mit dem Kölner Sender gesprochen hätte. \" Danach hat mit mir persönlich keiner mehr gesprochen. Das ist das einzige, was ich dazu sagen kann.\" Gleichzeitig betonte er, dass er ebenfalls gerne dabei gewesen wäre.","pubDate":"2023-05-31 14:35:15","image_url":null,"source_id":"watson","category":["sports"],"country":["germany"],"language":"german"},{"title":"Latest: Portsmouth rivals reveal position over £4m Ipswich & Coventry target as Derby enter race for prolific striker","link":"https://www.portsmouth.co.uk/sport/football/portsmouth-fc/latest-portsmouth-rivals-reveal-position-over-ps4m-ipswich-coventry-target-as-derby-enter-race-for-prolific-striker-4164188","keywords":["Portsmouth FC","Football","Sport"],"creator":["Pepe Lacey"],"video_url":null,"description":"With the play-offs now complete, clubs across the EFL have turned their attentions to the upcoming transfer window.","content":null,"pubDate":"2023-05-31 13:30:00","image_url":"https://www.portsmouth.co.uk/webimg/b25lY21zOjMxMjFmMGM3LWUwNjMtNGU0NC1iYjAzLTMzYzNkMDhhMDA4MDo0YzEzODk1Yy0xN2VjLTQyMjgtOGU3OC01NDM2ZDhlMzM0MDQ=.jpg","source_id":"portsmouth","category":["sports"],"country":["united kingdom"],"language":"english"}]}