{"newsArray":[{"article_id":"703878e67ac96eda41be8b4fed019eb2","title":"Martin Keown expresses safety concerns at West Ham’s London Stadium","link":"https://www.caughtoffside.com/2023/09/09/martin-keown-expresses-safety-concerns-at-west-hams-london-stadium/","keywords":["Arsenal FC","Football and Soccer","Mobile App Stories","West Ham FC","Martin Keown"],"creator":["Mehdi Gokal"],"video_url":null,"description":"Former Arsenal player turned pundit Martin Keown has raised safety concerns related to attending games at West Ham United’s London Stadium.Speaking on talkSPORT, Keown revealed that he assesses stadiums before deciding whether to attend matches and expressed unease about the atmosphere at the London Stadium.He stated that while most fans are respectful, there are occasional […] The post Martin Keown expresses safety concerns at West Ham’s London Stadium appeared first on CaughtOffside.","content":"Speaking on , Keown revealed that he assesses stadiums before deciding whether to attend matches and expressed unease about the atmosphere at the London Stadium. He stated that while most fans are respectful, there are occasional incidents, particularly when alcohol is involved, that can lead to trouble. Keown emphasised that he avoids situations where he might not feel safe and currently refrains from co-commentary due to concerns about his safety when traveling to certain stadiums. He also praised the respectful atmosphere at other football grounds, including Old Trafford, Stamford Bridge, and the Etihad Stadium, where he has experienced more positive interactions with fans. Keown said: His comments came after the shocking incident following the Arsenal vs Manchester United game where a fan allegedly headbutted Roy Keane. Footage was posted on social media of after the alleged assault. He has since then been arrested.","pubDate":"2023-09-09 15:17:03","image_url":"https://www.caughtoffside.com/wp-content/uploads/2023/09/Arsenal-legend-Martin-Keown-1.jpg","source_id":"caughtoffside","source_priority":16638,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"37937d24ef561296dc65dfb6e673ac87","title":"Сборная Бельгии обыграла Азербайджан в матче отбора на Евро-2024","link":"http://www.sovsport.ru/football/news/2:1082293","keywords":["Новости"],"creator":["info@sovsport.ru (Скороходов Максим)"],"video_url":null,"description":"Встреча прошла в Баку.","content":"На 38-й минуте забил Янник Карраско. Сборная Бельгии набрала 10 очков и поднялось на первое место в группе , Азербайджан остался с одним очком на последней строчке. Азербайджан пропустит следующий тур (в группе пять команд), Бельгия 12 сентября примет Эстонию. Карраско, 38","pubDate":"2023-09-09 14:54:48","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"90fb7b8cf87ea3c1d0dc598add7a01b5","title":"Изидор попрощался с болельщиками «Локомотива»","link":"https://www.sport-express.ru/football/rfpl/news/izidor-poproschalsya-s-bolelschikami-lokomotiva-2121376/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Французский нападающий Вильсон Изидор, перешедший в санкт-петербургский «Зенит», попрощался с болельщиками московского «Локомотива».","content":"Французский нападающий Вильсон Изидор, перешедший в «Зенит», попрощался с болельщиками «Локомотива». «Уважаемые болельщики «Локомотива». Спасибо, что приняли меня, как это должно быть, чуть более полутора лет назад в вашу семью. Я всегда отдавал все ради этой зеленой майки благодаря вашей поддержке. Спасибо персоналу, физиотерапевтам, врачам, стюардам, переводчикам. Я хотел бы назвать всех, но это заняло бы слишком много времени, потому что они всегда были очень теплы ко мне и всегда помогали мне с момента моего прибытия. Было приятно поделиться с вами моментами, и я буду помнить только хорошие. «Локо» всегда будет частью моей семьи», — написал Изидор в своих соцсетях. «Зенит» арендовал Изидора у «Локомотива» до конца сезона-2023/24. Соглашение включает в себя опцию выкупа. 23-летний француз будет играть за питерский клуб под 10-м номером, который принадлежал Малкому до его перехода в «Аль-Иттихад».","pubDate":"2023-09-09 14:54:02","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"da86d75dd8eab93bdf9ba196aece84e2","title":"Хвича Кварацхелия может перейти в «Барселону» в следующем году","link":"http://www.sovsport.ru/football/news/2:1082292","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Грузинский футболист второй сезон проводит в Серии А.","content":"По информации источника, сине-гранатовые рассчитывают совершить трансфер 22-летнего игрока в 2024 году. Сообщается, что каталонский клуб урегулировал большую часть финансовый проблем, поэтому следующем летом ожидают, что средства для покупки грузина появятся. Кварацхелия перешёл в «Наполи» в июле прошлого года. В текущем сезоне в составе неаполитанцев он сыграл два матча и отдал одну результативную передачу. Согласно порталу Transfermarkt, его трансферная стоимость оценивается в 85 миллионов евро.","pubDate":"2023-09-09 14:48:05","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"69e396373c759feb1b0b1419fa91b6ad","title":"Малком обратился к Изидору после перехода игрока в «Зенит»","link":"http://www.sovsport.ru/football/news/2:1082289","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Французский форвард получил игровой номер в питерской команде под которым раньше выступал бразилец.","content":"«Номер 10 очень удачно представлен. Удачи тебе, брат мой. Мы вместе», — написал бразильский футболист в своих соцсетях. В субботу, 9 сентября, «Зенит» взял Изидора в аренду у «Локомотива» до конца нынешнего сезона. Сделка включает в себя право выкупа нападающего. 23-летний игрок получил десятый номер в новом клубе под которым раньше выступал Малком до своего перехода в саудовский «Аль-Иттихад».","pubDate":"2023-09-09 14:39:06","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"373c3a9b0fd5eb4946a070eb12fc4461","title":"«Барселона» намерена подписать Кварацхелию в 2024 году","link":"https://www.sport-express.ru/football/italy/news/barselona-namerena-podpisat-kvaracheliyu-v-2024-godu-2121371/","keywords":["Футбол - Италия"],"creator":null,"video_url":null,"description":"«Барселона» заинтересована в подписании нападающего «Наполи» Хвичи Кварацхелии, сообщает El Nacional.","content":"«Барселона» заинтересована в подписании нападающего «Наполи» Хвичи Кварацхелии, сообщает El Nacional. По информации источника, испанский клуб намерен подписать вингера летом 2024 года. Отмечается, что руководство «Барселоны» считает, что клуб уже разобрался с большей частью финансовых проблем, и поэтому надеется, что к концу сезона средства на трансфер игрока появятся. «Наполи» оценивает Кварацхелию в 100 миллионов евро. Кварацхелия выступает за «Наполи» с июля 2022 года, он забил 14 голов и сделал 18 результативных передач в 45 матчах за неаполитанцев во всех турнирах. До этого хавбек играл за тбилисское и батумское «Динамо», а также за российские «Локомотив» и «Рубин».","pubDate":"2023-09-09 14:39:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"a5c7bcff125d83cfcc3cb187430c7e38","title":"All about the D: Amador Valley shuts down Acalanes one week after blanking Campolindo","link":"https://www.mercurynews.com/2023/09/09/all-about-the-d-amador-valley-shuts-down-acalanes-one-week-after-blanking-campolindo/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","Inside Sports"],"creator":["Mike Lefkow, Correspondent"],"video_url":null,"description":"Amador Valley overcomes 12-point deficit to edge winless Acalanes 14-12.","content":"Amador Valley coach Danny Jones can’t wait for Sept. 29. That’s when quarterback Tristan Tia, a 6-foot-3 junior, becomes eligible to play. He’s sitting out the first five games after transferring from Granada. The Dons are playing pretty well without Tia. They improved to 2-1 by rallying from a 12-point deficit to edge host Acalanes 14-12 on Friday night. Jake Goldsworthy scored on a 5-yard run and stand-in quarterback Aidan Foley ran it in from 10 yards out to rally the visitors. Both TDs came in the third quarter. Acalanes (0-3) did all its scoring in the first half with touchdowns on its first two possessions. Amador Valley has back-to-back victories over Campolindo (6-0) and Acalanes after starting the season with a seven-point loss to El Cerrito, the No. 11-ranked team in the Bay Area News Group Top 25. “Quarterback back in two games and it’s on,” Jones texted after the win over Acalanes. The trouble is, there might not be a game for Amador Valley to play on Sept. 29. The Dons were supposed to meet Novato, which backed out. Novato lists only 24 varsity players on its MaxPreps roster. Amador Valley has 45. Jones is searching for an opponent to play on Sept. 29 or Nov. 3. On the field, the Dons are winning with defense. They’ve outscored their opponents 27-26. “Aidan Foley is a gamer,” said Jones, adding that the sophomore has done a great job of managing the offense in Tia’s absence. But Foley is really a defensive back who also plays a number of positions on offense. Against Acalanes, he scored on a bootleg, putting Amador Valley in front. Acalanes twice threatened to score after that, but the visitors held. “Our defense is insane,” Jones said. Amador Valley plays Monte Vista and Foothill in non-league encounters before Tia returns. East Bay Athletic League Valley Division play opens on Oct. 6, when the Dons host Dougherty Valley.","pubDate":"2023-09-09 14:35:40","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/09/BNG-L-ACAMAFB-0908-23.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"02e0da53d171671b7a5119b3bb901f1c","title":"Todos los detalles de la Fan Zone de la selección española en Granada","link":"https://www.granadahoy.com/deportes/seleccion-espanola-trofeo-campeon-liga-naciones-Granada_0_1828317817.html","keywords":null,"creator":["Javier Aguilera"],"video_url":null,"description":"Se ubicará en el Paseo del Salón tanto el lunes como el martes y, entre otras actividades, estará expuesto por primera vez en trofeo de campeón de la Liga de las Naciones 2023","content":"La disputa el próximo martes en del partido internacional entre España y Chipre, valedero para la fase de clasificación de la Eurocopa 2024, conllevará la instalación en la capital de una Fan Zone que podrá ser visitada por los aficionados y donde se ubicará el trofeo de campeones de la Liga de las Naciones 2023 que ganó el combinado nacional. Diversas actividades amenizarán tanto el lunes, día previo al encuentro frente a , como el mismo martes, jornada del partido, en una Fan Zone que se va a ubicar en el céntrico Paseo del Salón de Granada, informó este sábado la Real Federación Española de Fútbol. Será un espacio de visita y lúdico donde la selección española será la protagonista y donde estará expuesto el trofeo de campeones de la pasada Liga de las Naciones 2023 que conquistó . Será la primera ocasión en la que este trofeo salga del Museo de la , ubicado en la Ciudad del Fútbol de Las Rozas (Madrid) y donde se encuentra expuesto al público desde el pasado mes de junio. No será el único entorchado que podrá verse en Granada, ya que las personas que visitan la también podrán fotografiarse con las Eurocopas de 2008 y 2012, y con la Copa del Mundo lograda en 2010 en Sudáfrica. El espacio estará tanto el lunes como el martes de once de la mañana a ocho de la tarde y en el mismo se podrá participar en actividades para toda la familia y en torneos de e-sports. También estará activo el mini-campo, de 13 metros de largo y 8 de ancho, donde se disputarán de fútbol de los programas Somos+ y Football+. Se realizarán también diversos , como el de entradas para el partido del martes en el Nuevo Los Cármenes; y, como es habitual, se instalará también una tienda oficial con merchandising de la selección española de fútbol. Un amplio elenco de actividades que se suman al propio partido y a la posibilidad de conocer en persona a los jugadores, a través del sorteo de la participación en un al que acceden, de forma automática, todas las personas que adquieren una entrada para el encuentro.","pubDate":"2023-09-09 14:24:50","image_url":"http://www.granadahoy.com/2023/09/09/deportes/anuncia-RFEF-Fan-Zone-Granada_1828327589_192183100_667x375.png","source_id":"granadahoy","source_priority":908972,"country":["spain"],"category":["sports"],"language":"spanish"},{"article_id":"57d31bb4567defe2e6ccbab9da04fcf3","title":"ЦСКА проявлял интерес к защитнику «Атлетико Минейро» Аране","link":"http://www.sovsport.ru/football/news/2:1082284","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Об этом рассказал агент футболиста.","content":"«У ЦСКА был интерес к Аране, но «Атлетико Минейро» не захотел отпускать игрока и начинать переговоры. Есть вероятность, что защитник перейдет в ЦСКА в этом году? Думаю, что нет», — приводит слова агента «Спорт-Экспресс». Арана присоединился к «Атлетико Минейро» в январе 2020 года. В текущем сезоне за бразильскую команду он сыграл 16 матчей и отдал одну результативную передачу. Согласно порталу Transfermarkt, его рыночная стоимость составляет 10 миллионов евро.","pubDate":"2023-09-09 14:12:22","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"e73fe78f1334963a1f52ea90ee8a7344","title":"Агент Ловата рассказал о безуспешных переговорах с ЦСКА","link":"https://www.sport-express.ru/football/rfpl/news/agent-lovata-rasskazal-o-bezuspeshnyh-peregovorah-s-cska-2121363/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Агент защитника «Слована» Лукаса Ловата Леонардо Корначини высказался о продвижении в переговорах с московским ЦСКА.","content":"Агент защитника «Слована» Лукаса Ловата Леонардо Корначини высказался о продвижении в переговорах с московским ЦСКА. «В переговорах с ЦСКА нет никакого продвижения. У нас нет соглашения ни с одним клубом. Нам с Ловатом нравится Россия, и я уверен, что это был бы хороший шаг в его карьере, но пока ничего нового. Сейчас мы ведем переговоры с другим клубом из Турции. Скорее всего, туда Ловат перейдет уже в статусе свободного агента», — приводит Metaratings.ru слова агента. Ловат выступает за «Слован» с 2020 года. В текущем сезоне 26-летний бразилец провел 9 матчей во всех турнирах, в которых отдал 3 результативные передачи. Его действующий контракт с клубом рассчитан до лета 2024 года. Портал Transfermarkt оценивает стоимость игрока в 600 тысяч евро.","pubDate":"2023-09-09 14:10:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"703878e67ac96eda41be8b4fed019eb2","title":"Martin Keown expresses safety concerns at West Ham’s London Stadium","link":"https://www.caughtoffside.com/2023/09/09/martin-keown-expresses-safety-concerns-at-west-hams-london-stadium/","keywords":["Arsenal FC","Football and Soccer","Mobile App Stories","West Ham FC","Martin Keown"],"creator":["Mehdi Gokal"],"video_url":null,"description":"Former Arsenal player turned pundit Martin Keown has raised safety concerns related to attending games at West Ham United’s London Stadium.Speaking on talkSPORT, Keown revealed that he assesses stadiums before deciding whether to attend matches and expressed unease about the atmosphere at the London Stadium.He stated that while most fans are respectful, there are occasional […] The post Martin Keown expresses safety concerns at West Ham’s London Stadium appeared first on CaughtOffside.","content":"Speaking on , Keown revealed that he assesses stadiums before deciding whether to attend matches and expressed unease about the atmosphere at the London Stadium. He stated that while most fans are respectful, there are occasional incidents, particularly when alcohol is involved, that can lead to trouble. Keown emphasised that he avoids situations where he might not feel safe and currently refrains from co-commentary due to concerns about his safety when traveling to certain stadiums. He also praised the respectful atmosphere at other football grounds, including Old Trafford, Stamford Bridge, and the Etihad Stadium, where he has experienced more positive interactions with fans. Keown said: His comments came after the shocking incident following the Arsenal vs Manchester United game where a fan allegedly headbutted Roy Keane. Footage was posted on social media of after the alleged assault. He has since then been arrested.","pubDate":"2023-09-09 15:17:03","image_url":"https://www.caughtoffside.com/wp-content/uploads/2023/09/Arsenal-legend-Martin-Keown-1.jpg","source_id":"caughtoffside","source_priority":16638,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"37937d24ef561296dc65dfb6e673ac87","title":"Сборная Бельгии обыграла Азербайджан в матче отбора на Евро-2024","link":"http://www.sovsport.ru/football/news/2:1082293","keywords":["Новости"],"creator":["info@sovsport.ru (Скороходов Максим)"],"video_url":null,"description":"Встреча прошла в Баку.","content":"На 38-й минуте забил Янник Карраско. Сборная Бельгии набрала 10 очков и поднялось на первое место в группе , Азербайджан остался с одним очком на последней строчке. Азербайджан пропустит следующий тур (в группе пять команд), Бельгия 12 сентября примет Эстонию. Карраско, 38","pubDate":"2023-09-09 14:54:48","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"90fb7b8cf87ea3c1d0dc598add7a01b5","title":"Изидор попрощался с болельщиками «Локомотива»","link":"https://www.sport-express.ru/football/rfpl/news/izidor-poproschalsya-s-bolelschikami-lokomotiva-2121376/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Французский нападающий Вильсон Изидор, перешедший в санкт-петербургский «Зенит», попрощался с болельщиками московского «Локомотива».","content":"Французский нападающий Вильсон Изидор, перешедший в «Зенит», попрощался с болельщиками «Локомотива». «Уважаемые болельщики «Локомотива». Спасибо, что приняли меня, как это должно быть, чуть более полутора лет назад в вашу семью. Я всегда отдавал все ради этой зеленой майки благодаря вашей поддержке. Спасибо персоналу, физиотерапевтам, врачам, стюардам, переводчикам. Я хотел бы назвать всех, но это заняло бы слишком много времени, потому что они всегда были очень теплы ко мне и всегда помогали мне с момента моего прибытия. Было приятно поделиться с вами моментами, и я буду помнить только хорошие. «Локо» всегда будет частью моей семьи», — написал Изидор в своих соцсетях. «Зенит» арендовал Изидора у «Локомотива» до конца сезона-2023/24. Соглашение включает в себя опцию выкупа. 23-летний француз будет играть за питерский клуб под 10-м номером, который принадлежал Малкому до его перехода в «Аль-Иттихад».","pubDate":"2023-09-09 14:54:02","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"da86d75dd8eab93bdf9ba196aece84e2","title":"Хвича Кварацхелия может перейти в «Барселону» в следующем году","link":"http://www.sovsport.ru/football/news/2:1082292","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Грузинский футболист второй сезон проводит в Серии А.","content":"По информации источника, сине-гранатовые рассчитывают совершить трансфер 22-летнего игрока в 2024 году. Сообщается, что каталонский клуб урегулировал большую часть финансовый проблем, поэтому следующем летом ожидают, что средства для покупки грузина появятся. Кварацхелия перешёл в «Наполи» в июле прошлого года. В текущем сезоне в составе неаполитанцев он сыграл два матча и отдал одну результативную передачу. Согласно порталу Transfermarkt, его трансферная стоимость оценивается в 85 миллионов евро.","pubDate":"2023-09-09 14:48:05","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"69e396373c759feb1b0b1419fa91b6ad","title":"Малком обратился к Изидору после перехода игрока в «Зенит»","link":"http://www.sovsport.ru/football/news/2:1082289","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Французский форвард получил игровой номер в питерской команде под которым раньше выступал бразилец.","content":"«Номер 10 очень удачно представлен. Удачи тебе, брат мой. Мы вместе», — написал бразильский футболист в своих соцсетях. В субботу, 9 сентября, «Зенит» взял Изидора в аренду у «Локомотива» до конца нынешнего сезона. Сделка включает в себя право выкупа нападающего. 23-летний игрок получил десятый номер в новом клубе под которым раньше выступал Малком до своего перехода в саудовский «Аль-Иттихад».","pubDate":"2023-09-09 14:39:06","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"373c3a9b0fd5eb4946a070eb12fc4461","title":"«Барселона» намерена подписать Кварацхелию в 2024 году","link":"https://www.sport-express.ru/football/italy/news/barselona-namerena-podpisat-kvaracheliyu-v-2024-godu-2121371/","keywords":["Футбол - Италия"],"creator":null,"video_url":null,"description":"«Барселона» заинтересована в подписании нападающего «Наполи» Хвичи Кварацхелии, сообщает El Nacional.","content":"«Барселона» заинтересована в подписании нападающего «Наполи» Хвичи Кварацхелии, сообщает El Nacional. По информации источника, испанский клуб намерен подписать вингера летом 2024 года. Отмечается, что руководство «Барселоны» считает, что клуб уже разобрался с большей частью финансовых проблем, и поэтому надеется, что к концу сезона средства на трансфер игрока появятся. «Наполи» оценивает Кварацхелию в 100 миллионов евро. Кварацхелия выступает за «Наполи» с июля 2022 года, он забил 14 голов и сделал 18 результативных передач в 45 матчах за неаполитанцев во всех турнирах. До этого хавбек играл за тбилисское и батумское «Динамо», а также за российские «Локомотив» и «Рубин».","pubDate":"2023-09-09 14:39:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"a5c7bcff125d83cfcc3cb187430c7e38","title":"All about the D: Amador Valley shuts down Acalanes one week after blanking Campolindo","link":"https://www.mercurynews.com/2023/09/09/all-about-the-d-amador-valley-shuts-down-acalanes-one-week-after-blanking-campolindo/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","Inside Sports"],"creator":["Mike Lefkow, Correspondent"],"video_url":null,"description":"Amador Valley overcomes 12-point deficit to edge winless Acalanes 14-12.","content":"Amador Valley coach Danny Jones can’t wait for Sept. 29. That’s when quarterback Tristan Tia, a 6-foot-3 junior, becomes eligible to play. He’s sitting out the first five games after transferring from Granada. The Dons are playing pretty well without Tia. They improved to 2-1 by rallying from a 12-point deficit to edge host Acalanes 14-12 on Friday night. Jake Goldsworthy scored on a 5-yard run and stand-in quarterback Aidan Foley ran it in from 10 yards out to rally the visitors. Both TDs came in the third quarter. Acalanes (0-3) did all its scoring in the first half with touchdowns on its first two possessions. Amador Valley has back-to-back victories over Campolindo (6-0) and Acalanes after starting the season with a seven-point loss to El Cerrito, the No. 11-ranked team in the Bay Area News Group Top 25. “Quarterback back in two games and it’s on,” Jones texted after the win over Acalanes. The trouble is, there might not be a game for Amador Valley to play on Sept. 29. The Dons were supposed to meet Novato, which backed out. Novato lists only 24 varsity players on its MaxPreps roster. Amador Valley has 45. Jones is searching for an opponent to play on Sept. 29 or Nov. 3. On the field, the Dons are winning with defense. They’ve outscored their opponents 27-26. “Aidan Foley is a gamer,” said Jones, adding that the sophomore has done a great job of managing the offense in Tia’s absence. But Foley is really a defensive back who also plays a number of positions on offense. Against Acalanes, he scored on a bootleg, putting Amador Valley in front. Acalanes twice threatened to score after that, but the visitors held. “Our defense is insane,” Jones said. Amador Valley plays Monte Vista and Foothill in non-league encounters before Tia returns. East Bay Athletic League Valley Division play opens on Oct. 6, when the Dons host Dougherty Valley.","pubDate":"2023-09-09 14:35:40","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/09/BNG-L-ACAMAFB-0908-23.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"02e0da53d171671b7a5119b3bb901f1c","title":"Todos los detalles de la Fan Zone de la selección española en Granada","link":"https://www.granadahoy.com/deportes/seleccion-espanola-trofeo-campeon-liga-naciones-Granada_0_1828317817.html","keywords":null,"creator":["Javier Aguilera"],"video_url":null,"description":"Se ubicará en el Paseo del Salón tanto el lunes como el martes y, entre otras actividades, estará expuesto por primera vez en trofeo de campeón de la Liga de las Naciones 2023","content":"La disputa el próximo martes en del partido internacional entre España y Chipre, valedero para la fase de clasificación de la Eurocopa 2024, conllevará la instalación en la capital de una Fan Zone que podrá ser visitada por los aficionados y donde se ubicará el trofeo de campeones de la Liga de las Naciones 2023 que ganó el combinado nacional. Diversas actividades amenizarán tanto el lunes, día previo al encuentro frente a , como el mismo martes, jornada del partido, en una Fan Zone que se va a ubicar en el céntrico Paseo del Salón de Granada, informó este sábado la Real Federación Española de Fútbol. Será un espacio de visita y lúdico donde la selección española será la protagonista y donde estará expuesto el trofeo de campeones de la pasada Liga de las Naciones 2023 que conquistó . Será la primera ocasión en la que este trofeo salga del Museo de la , ubicado en la Ciudad del Fútbol de Las Rozas (Madrid) y donde se encuentra expuesto al público desde el pasado mes de junio. No será el único entorchado que podrá verse en Granada, ya que las personas que visitan la también podrán fotografiarse con las Eurocopas de 2008 y 2012, y con la Copa del Mundo lograda en 2010 en Sudáfrica. El espacio estará tanto el lunes como el martes de once de la mañana a ocho de la tarde y en el mismo se podrá participar en actividades para toda la familia y en torneos de e-sports. También estará activo el mini-campo, de 13 metros de largo y 8 de ancho, donde se disputarán de fútbol de los programas Somos+ y Football+. Se realizarán también diversos , como el de entradas para el partido del martes en el Nuevo Los Cármenes; y, como es habitual, se instalará también una tienda oficial con merchandising de la selección española de fútbol. Un amplio elenco de actividades que se suman al propio partido y a la posibilidad de conocer en persona a los jugadores, a través del sorteo de la participación en un al que acceden, de forma automática, todas las personas que adquieren una entrada para el encuentro.","pubDate":"2023-09-09 14:24:50","image_url":"http://www.granadahoy.com/2023/09/09/deportes/anuncia-RFEF-Fan-Zone-Granada_1828327589_192183100_667x375.png","source_id":"granadahoy","source_priority":908972,"country":["spain"],"category":["sports"],"language":"spanish"},{"article_id":"57d31bb4567defe2e6ccbab9da04fcf3","title":"ЦСКА проявлял интерес к защитнику «Атлетико Минейро» Аране","link":"http://www.sovsport.ru/football/news/2:1082284","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Об этом рассказал агент футболиста.","content":"«У ЦСКА был интерес к Аране, но «Атлетико Минейро» не захотел отпускать игрока и начинать переговоры. Есть вероятность, что защитник перейдет в ЦСКА в этом году? Думаю, что нет», — приводит слова агента «Спорт-Экспресс». Арана присоединился к «Атлетико Минейро» в январе 2020 года. В текущем сезоне за бразильскую команду он сыграл 16 матчей и отдал одну результативную передачу. Согласно порталу Transfermarkt, его рыночная стоимость составляет 10 миллионов евро.","pubDate":"2023-09-09 14:12:22","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"e73fe78f1334963a1f52ea90ee8a7344","title":"Агент Ловата рассказал о безуспешных переговорах с ЦСКА","link":"https://www.sport-express.ru/football/rfpl/news/agent-lovata-rasskazal-o-bezuspeshnyh-peregovorah-s-cska-2121363/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Агент защитника «Слована» Лукаса Ловата Леонардо Корначини высказался о продвижении в переговорах с московским ЦСКА.","content":"Агент защитника «Слована» Лукаса Ловата Леонардо Корначини высказался о продвижении в переговорах с московским ЦСКА. «В переговорах с ЦСКА нет никакого продвижения. У нас нет соглашения ни с одним клубом. Нам с Ловатом нравится Россия, и я уверен, что это был бы хороший шаг в его карьере, но пока ничего нового. Сейчас мы ведем переговоры с другим клубом из Турции. Скорее всего, туда Ловат перейдет уже в статусе свободного агента», — приводит Metaratings.ru слова агента. Ловат выступает за «Слован» с 2020 года. В текущем сезоне 26-летний бразилец провел 9 матчей во всех турнирах, в которых отдал 3 результативные передачи. Его действующий контракт с клубом рассчитан до лета 2024 года. Портал Transfermarkt оценивает стоимость игрока в 600 тысяч евро.","pubDate":"2023-09-09 14:10:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"703878e67ac96eda41be8b4fed019eb2","title":"Martin Keown expresses safety concerns at West Ham’s London Stadium","link":"https://www.caughtoffside.com/2023/09/09/martin-keown-expresses-safety-concerns-at-west-hams-london-stadium/","keywords":["Arsenal FC","Football and Soccer","Mobile App Stories","West Ham FC","Martin Keown"],"creator":["Mehdi Gokal"],"video_url":null,"description":"Former Arsenal player turned pundit Martin Keown has raised safety concerns related to attending games at West Ham United’s London Stadium.Speaking on talkSPORT, Keown revealed that he assesses stadiums before deciding whether to attend matches and expressed unease about the atmosphere at the London Stadium.He stated that while most fans are respectful, there are occasional […] The post Martin Keown expresses safety concerns at West Ham’s London Stadium appeared first on CaughtOffside.","content":"Speaking on , Keown revealed that he assesses stadiums before deciding whether to attend matches and expressed unease about the atmosphere at the London Stadium. He stated that while most fans are respectful, there are occasional incidents, particularly when alcohol is involved, that can lead to trouble. Keown emphasised that he avoids situations where he might not feel safe and currently refrains from co-commentary due to concerns about his safety when traveling to certain stadiums. He also praised the respectful atmosphere at other football grounds, including Old Trafford, Stamford Bridge, and the Etihad Stadium, where he has experienced more positive interactions with fans. Keown said: His comments came after the shocking incident following the Arsenal vs Manchester United game where a fan allegedly headbutted Roy Keane. Footage was posted on social media of after the alleged assault. He has since then been arrested.","pubDate":"2023-09-09 15:17:03","image_url":"https://www.caughtoffside.com/wp-content/uploads/2023/09/Arsenal-legend-Martin-Keown-1.jpg","source_id":"caughtoffside","source_priority":16638,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"37937d24ef561296dc65dfb6e673ac87","title":"Сборная Бельгии обыграла Азербайджан в матче отбора на Евро-2024","link":"http://www.sovsport.ru/football/news/2:1082293","keywords":["Новости"],"creator":["info@sovsport.ru (Скороходов Максим)"],"video_url":null,"description":"Встреча прошла в Баку.","content":"На 38-й минуте забил Янник Карраско. Сборная Бельгии набрала 10 очков и поднялось на первое место в группе , Азербайджан остался с одним очком на последней строчке. Азербайджан пропустит следующий тур (в группе пять команд), Бельгия 12 сентября примет Эстонию. Карраско, 38","pubDate":"2023-09-09 14:54:48","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"90fb7b8cf87ea3c1d0dc598add7a01b5","title":"Изидор попрощался с болельщиками «Локомотива»","link":"https://www.sport-express.ru/football/rfpl/news/izidor-poproschalsya-s-bolelschikami-lokomotiva-2121376/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Французский нападающий Вильсон Изидор, перешедший в санкт-петербургский «Зенит», попрощался с болельщиками московского «Локомотива».","content":"Французский нападающий Вильсон Изидор, перешедший в «Зенит», попрощался с болельщиками «Локомотива». «Уважаемые болельщики «Локомотива». Спасибо, что приняли меня, как это должно быть, чуть более полутора лет назад в вашу семью. Я всегда отдавал все ради этой зеленой майки благодаря вашей поддержке. Спасибо персоналу, физиотерапевтам, врачам, стюардам, переводчикам. Я хотел бы назвать всех, но это заняло бы слишком много времени, потому что они всегда были очень теплы ко мне и всегда помогали мне с момента моего прибытия. Было приятно поделиться с вами моментами, и я буду помнить только хорошие. «Локо» всегда будет частью моей семьи», — написал Изидор в своих соцсетях. «Зенит» арендовал Изидора у «Локомотива» до конца сезона-2023/24. Соглашение включает в себя опцию выкупа. 23-летний француз будет играть за питерский клуб под 10-м номером, который принадлежал Малкому до его перехода в «Аль-Иттихад».","pubDate":"2023-09-09 14:54:02","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"da86d75dd8eab93bdf9ba196aece84e2","title":"Хвича Кварацхелия может перейти в «Барселону» в следующем году","link":"http://www.sovsport.ru/football/news/2:1082292","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Грузинский футболист второй сезон проводит в Серии А.","content":"По информации источника, сине-гранатовые рассчитывают совершить трансфер 22-летнего игрока в 2024 году. Сообщается, что каталонский клуб урегулировал большую часть финансовый проблем, поэтому следующем летом ожидают, что средства для покупки грузина появятся. Кварацхелия перешёл в «Наполи» в июле прошлого года. В текущем сезоне в составе неаполитанцев он сыграл два матча и отдал одну результативную передачу. Согласно порталу Transfermarkt, его трансферная стоимость оценивается в 85 миллионов евро.","pubDate":"2023-09-09 14:48:05","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"69e396373c759feb1b0b1419fa91b6ad","title":"Малком обратился к Изидору после перехода игрока в «Зенит»","link":"http://www.sovsport.ru/football/news/2:1082289","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Французский форвард получил игровой номер в питерской команде под которым раньше выступал бразилец.","content":"«Номер 10 очень удачно представлен. Удачи тебе, брат мой. Мы вместе», — написал бразильский футболист в своих соцсетях. В субботу, 9 сентября, «Зенит» взял Изидора в аренду у «Локомотива» до конца нынешнего сезона. Сделка включает в себя право выкупа нападающего. 23-летний игрок получил десятый номер в новом клубе под которым раньше выступал Малком до своего перехода в саудовский «Аль-Иттихад».","pubDate":"2023-09-09 14:39:06","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"373c3a9b0fd5eb4946a070eb12fc4461","title":"«Барселона» намерена подписать Кварацхелию в 2024 году","link":"https://www.sport-express.ru/football/italy/news/barselona-namerena-podpisat-kvaracheliyu-v-2024-godu-2121371/","keywords":["Футбол - Италия"],"creator":null,"video_url":null,"description":"«Барселона» заинтересована в подписании нападающего «Наполи» Хвичи Кварацхелии, сообщает El Nacional.","content":"«Барселона» заинтересована в подписании нападающего «Наполи» Хвичи Кварацхелии, сообщает El Nacional. По информации источника, испанский клуб намерен подписать вингера летом 2024 года. Отмечается, что руководство «Барселоны» считает, что клуб уже разобрался с большей частью финансовых проблем, и поэтому надеется, что к концу сезона средства на трансфер игрока появятся. «Наполи» оценивает Кварацхелию в 100 миллионов евро. Кварацхелия выступает за «Наполи» с июля 2022 года, он забил 14 голов и сделал 18 результативных передач в 45 матчах за неаполитанцев во всех турнирах. До этого хавбек играл за тбилисское и батумское «Динамо», а также за российские «Локомотив» и «Рубин».","pubDate":"2023-09-09 14:39:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"a5c7bcff125d83cfcc3cb187430c7e38","title":"All about the D: Amador Valley shuts down Acalanes one week after blanking Campolindo","link":"https://www.mercurynews.com/2023/09/09/all-about-the-d-amador-valley-shuts-down-acalanes-one-week-after-blanking-campolindo/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","Inside Sports"],"creator":["Mike Lefkow, Correspondent"],"video_url":null,"description":"Amador Valley overcomes 12-point deficit to edge winless Acalanes 14-12.","content":"Amador Valley coach Danny Jones can’t wait for Sept. 29. That’s when quarterback Tristan Tia, a 6-foot-3 junior, becomes eligible to play. He’s sitting out the first five games after transferring from Granada. The Dons are playing pretty well without Tia. They improved to 2-1 by rallying from a 12-point deficit to edge host Acalanes 14-12 on Friday night. Jake Goldsworthy scored on a 5-yard run and stand-in quarterback Aidan Foley ran it in from 10 yards out to rally the visitors. Both TDs came in the third quarter. Acalanes (0-3) did all its scoring in the first half with touchdowns on its first two possessions. Amador Valley has back-to-back victories over Campolindo (6-0) and Acalanes after starting the season with a seven-point loss to El Cerrito, the No. 11-ranked team in the Bay Area News Group Top 25. “Quarterback back in two games and it’s on,” Jones texted after the win over Acalanes. The trouble is, there might not be a game for Amador Valley to play on Sept. 29. The Dons were supposed to meet Novato, which backed out. Novato lists only 24 varsity players on its MaxPreps roster. Amador Valley has 45. Jones is searching for an opponent to play on Sept. 29 or Nov. 3. On the field, the Dons are winning with defense. They’ve outscored their opponents 27-26. “Aidan Foley is a gamer,” said Jones, adding that the sophomore has done a great job of managing the offense in Tia’s absence. But Foley is really a defensive back who also plays a number of positions on offense. Against Acalanes, he scored on a bootleg, putting Amador Valley in front. Acalanes twice threatened to score after that, but the visitors held. “Our defense is insane,” Jones said. Amador Valley plays Monte Vista and Foothill in non-league encounters before Tia returns. East Bay Athletic League Valley Division play opens on Oct. 6, when the Dons host Dougherty Valley.","pubDate":"2023-09-09 14:35:40","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/09/BNG-L-ACAMAFB-0908-23.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"02e0da53d171671b7a5119b3bb901f1c","title":"Todos los detalles de la Fan Zone de la selección española en Granada","link":"https://www.granadahoy.com/deportes/seleccion-espanola-trofeo-campeon-liga-naciones-Granada_0_1828317817.html","keywords":null,"creator":["Javier Aguilera"],"video_url":null,"description":"Se ubicará en el Paseo del Salón tanto el lunes como el martes y, entre otras actividades, estará expuesto por primera vez en trofeo de campeón de la Liga de las Naciones 2023","content":"La disputa el próximo martes en del partido internacional entre España y Chipre, valedero para la fase de clasificación de la Eurocopa 2024, conllevará la instalación en la capital de una Fan Zone que podrá ser visitada por los aficionados y donde se ubicará el trofeo de campeones de la Liga de las Naciones 2023 que ganó el combinado nacional. Diversas actividades amenizarán tanto el lunes, día previo al encuentro frente a , como el mismo martes, jornada del partido, en una Fan Zone que se va a ubicar en el céntrico Paseo del Salón de Granada, informó este sábado la Real Federación Española de Fútbol. Será un espacio de visita y lúdico donde la selección española será la protagonista y donde estará expuesto el trofeo de campeones de la pasada Liga de las Naciones 2023 que conquistó . Será la primera ocasión en la que este trofeo salga del Museo de la , ubicado en la Ciudad del Fútbol de Las Rozas (Madrid) y donde se encuentra expuesto al público desde el pasado mes de junio. No será el único entorchado que podrá verse en Granada, ya que las personas que visitan la también podrán fotografiarse con las Eurocopas de 2008 y 2012, y con la Copa del Mundo lograda en 2010 en Sudáfrica. El espacio estará tanto el lunes como el martes de once de la mañana a ocho de la tarde y en el mismo se podrá participar en actividades para toda la familia y en torneos de e-sports. También estará activo el mini-campo, de 13 metros de largo y 8 de ancho, donde se disputarán de fútbol de los programas Somos+ y Football+. Se realizarán también diversos , como el de entradas para el partido del martes en el Nuevo Los Cármenes; y, como es habitual, se instalará también una tienda oficial con merchandising de la selección española de fútbol. Un amplio elenco de actividades que se suman al propio partido y a la posibilidad de conocer en persona a los jugadores, a través del sorteo de la participación en un al que acceden, de forma automática, todas las personas que adquieren una entrada para el encuentro.","pubDate":"2023-09-09 14:24:50","image_url":"http://www.granadahoy.com/2023/09/09/deportes/anuncia-RFEF-Fan-Zone-Granada_1828327589_192183100_667x375.png","source_id":"granadahoy","source_priority":908972,"country":["spain"],"category":["sports"],"language":"spanish"},{"article_id":"57d31bb4567defe2e6ccbab9da04fcf3","title":"ЦСКА проявлял интерес к защитнику «Атлетико Минейро» Аране","link":"http://www.sovsport.ru/football/news/2:1082284","keywords":["Новости"],"creator":["info@sovsport.ru (Шевяков Глеб)"],"video_url":null,"description":"Об этом рассказал агент футболиста.","content":"«У ЦСКА был интерес к Аране, но «Атлетико Минейро» не захотел отпускать игрока и начинать переговоры. Есть вероятность, что защитник перейдет в ЦСКА в этом году? Думаю, что нет», — приводит слова агента «Спорт-Экспресс». Арана присоединился к «Атлетико Минейро» в январе 2020 года. В текущем сезоне за бразильскую команду он сыграл 16 матчей и отдал одну результативную передачу. Согласно порталу Transfermarkt, его рыночная стоимость составляет 10 миллионов евро.","pubDate":"2023-09-09 14:12:22","image_url":null,"source_id":"sovsport","source_priority":632561,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"e73fe78f1334963a1f52ea90ee8a7344","title":"Агент Ловата рассказал о безуспешных переговорах с ЦСКА","link":"https://www.sport-express.ru/football/rfpl/news/agent-lovata-rasskazal-o-bezuspeshnyh-peregovorah-s-cska-2121363/","keywords":["Футбол - РПЛ"],"creator":null,"video_url":null,"description":"Агент защитника «Слована» Лукаса Ловата Леонардо Корначини высказался о продвижении в переговорах с московским ЦСКА.","content":"Агент защитника «Слована» Лукаса Ловата Леонардо Корначини высказался о продвижении в переговорах с московским ЦСКА. «В переговорах с ЦСКА нет никакого продвижения. У нас нет соглашения ни с одним клубом. Нам с Ловатом нравится Россия, и я уверен, что это был бы хороший шаг в его карьере, но пока ничего нового. Сейчас мы ведем переговоры с другим клубом из Турции. Скорее всего, туда Ловат перейдет уже в статусе свободного агента», — приводит Metaratings.ru слова агента. Ловат выступает за «Слован» с 2020 года. В текущем сезоне 26-летний бразилец провел 9 матчей во всех турнирах, в которых отдал 3 результативные передачи. Его действующий контракт с клубом рассчитан до лета 2024 года. Портал Transfermarkt оценивает стоимость игрока в 600 тысяч евро.","pubDate":"2023-09-09 14:10:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"}]}