{"newsArray":[{"title":"SGFC Athletic appoint Yakub as new head coach","link":"https://guardian.ng/sport/sgfc-athletic-appoint-yakub-as-new-head-coach/","keywords":["Football","Sport","Coach Mashood Yakub","SGFC Athletics Football Club"],"creator":["Guardian Nigeria"],"video_url":null,"description":"National Division League (NLO) side, SGFC Athletics Football Club, have appointed Coach Mashood Yakub as the new head coach of the club. The post SGFC Athletic appoint Yakub as new head coach appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"National Division League (NLO) side, SGFC Athletics Football Club, have appointed Coach Mashood Yakub as the new head coach of the club. Yakub, who was coach of 36Lion FC, led the team to winning the Lagos State Oba Cup in 2013, and also won gold medal for Team Lagos in the male football team event at the Eko 2012 National Sports Festival. Speaking on the appointment of Yakub, the General Manager of the club, Olawale Olatoye, said the club took the decision to employ Coach Yakub because it believed he is the best for the role, with a perfect knowledge of the club’s philosophy and having worked severally with youth footballers. Meanwhile, the club has also announced the employment of ace reporter, Tosh Michaels, as the club’s media officer. According to Olatoye, “Tosh Michaels appointment is with immediate effect. And he is to take charge of all media-related activities for the club. “Michael is well grounded and vast in sports reportage. A sports presenter with Gerin FM Ilorin, and also an online editor with www.owosports.com.ng, he has worked with Diamond FM Ilorin.” While speaking on the club’s ambition in the forthcoming season new season in the Nigeria Nationwide League NLO, President of the club, Richard Opanuga, said one of the aims of the club is to produce talents for the next level and to develop the football career of the youth. He added that SGFC Athletics Sports Club has a plan to embark on successful development of youth programme and retention of talented players for future growth. Follow Us","pubDate":"2023-01-16 03:33:37","image_url":null,"source_id":"guardian","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Ils ont dit","link":"https://midi-madagasikara.mg/2023/01/16/ils-ont-dit-25/","keywords":["Sports","Barea","Football","Ils ont dit","Madagascar"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Roro Rakotondrabe, coach des Barea : « Je suis fier de mes joueurs, de ce qu’ils ont produit aussi sur le terrain aujourd’hui. Les Ghanéens étaient partis favoris, mais, comme je l’ai dit, le match se joue sur le terrain. Nous avons gagné dans la douleur dans un match d’une très haute intensité. Nous allons […] L’article <strong>Ils ont dit</strong> est apparu en premier sur Midi Madagasikara.","content":"Roro Rakotondrabe, coach des Barea : « Je suis fier de mes joueurs, de ce qu’ils ont produit aussi sur le terrain aujourd’hui. Les Ghanéens étaient partis favoris, mais, comme je l’ai dit, le match se joue sur le terrain. Nous avons gagné dans la douleur dans un match d’une très haute intensité. Nous allons savourer la victoire, tout en gardant les pieds sur terre, il y aura d’autres matches. L’état d’esprit de mes gars était bon. Tout le mérite revient aux joueurs, ils ont défendu courageusement et l’envie de gagner était là. Le manque d’expérience de match de haut niveau s’est fait sentir à la fin de la rencontre avec un certain relâchement ». Tsiry Tokinantenaina Olivier, homme du match : « Je suis très content d’avoir été élu homme du match. Nous avons joué notre football sans complexe et là, la victoire est à notre portée. Certes, je suis élu homme du match, mais, je dédie ce trophée à l’ensemble de l’équipe ». Walker Annor, coach des Black Galaxies : « Je suis déçus lors de la première mi-temps, il y a un style de jeu qu’on devrait suivre, mais, nous n’avons pas fait. A la deuxième mi-temps, j’ai effectué quelques changements, nous avons repris notre rythme usuel et nous arrivons à rentrer dans le match. Il y a des erreurs et des petits détails qu’on a pas pu corriger tout au long de la rencontre ». T.H L’article <strong>Ils ont dit</strong> est apparu en premier sur Midi Madagasikara.","pubDate":"2023-01-16 03:00:00","image_url":null,"source_id":"madagasikara","country":["madagascar"],"category":["sports"],"language":"french"},{"title":"Football – CHAN 2022 : Victorieux face au Ghana, les Barea en tête de la poule C","link":"https://midi-madagasikara.mg/2023/01/16/football-chan-2022-victorieux-face-au-ghana-les-barea-en-tete-de-la-poule-c/","keywords":["Sports","CHAN 2022","Football","Madagascar"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Les Barea victorieux, face aux Black Galaxies du Ghana par 2 buts à 1, prennent la première place du groupe C à Constantine. Trois points. Les Malgaches ont assuré leur entrée au Championnat d’Afrique des Nations (CHAN) 2022 en Algérie, hier, au Stade Mohamed Hamlaoui, Constantine. Les Barea, plus combatifs et déterminés, se sont imposés […] L’article <strong>Football – CHAN 2022</strong> : <strong>Victorieux face au Ghana, les Barea en tête de la poule C</strong> est apparu en premier sur Midi Madagasikara.","content":"Les Barea victorieux, face aux Black Galaxies du Ghana par 2 buts à 1, prennent la première place du groupe C à Constantine. Trois points. Les Malgaches ont assuré leur entrée au Championnat d’Afrique des Nations (CHAN) 2022 en Algérie, hier, au Stade Mohamed Hamlaoui, Constantine. Les Barea, plus combatifs et déterminés, se sont imposés contre les Black Galaxies du Ghana sur le score de 2 buts à 1. Cette première victoire met la Grande Île à la première place du Groupe C avec 3 points. (adsbygoogle = window.adsbygoogle || []).push({}); Novices de la compétition face aux demi-finalistes de la dernière édition, les protégés de Roro Rakotondrabe ne se laissaient pas intimider sur le terrain. Ils ont déjoué tous les pronostics face à un des grands favoris du groupe. La bande à Tantely a vite pris le jeu à leur compte dès l’entame de la rencontre. Les Malgaches maintenant le pressing haut, ce qui a fini par payer. Koloina Razafindranaivo, sur une belle passe de Tsiry, ouvre le score à la 10e mn. Une minute plus tard, l’arbitre a sifflé un penalty sur une main dans la surface de réparation ghanéenne. Il a fallu que l’arbitre libyen, Mutaz Ibrahim consulte la VAR pour que la décision soit annulée. Avec une belle combativité et un jeu d’équipe huilé, les offensives malgaches s’enchaînent, devant, des Ghanéens qui peinent à imposer leur jeu. Confondant vitesse et précipitation, les Malgaches manquaient la finition. A la pause, Madagascar mène par un but à zéro. On peut noter que les Ghanéens n’ont eu aucun tir cadré lors de la première mi-temps et des erreurs défensives. Au retour des vestiaires, la machine malgache semble toujours bien fonctionner. Le technicien malgache a opéré à des changements avec le premier remplacement avec la sortie de Jean Yves et l’entrée d’Onja. Avec une défense qui n’était pas homogène du côté ghanéen, les attaquants malgaches en ont profité pour mener leur offensive. Toujours sur une erreur de la défense ghanéenne, Tsiry arrive à tromper Benjamin Abaidoo et marque le second but pour les Malgaches à la 62e mn. Sur une erreur d’un centrage, Agoypong Augustine arrive à réduire l’écart à la 68e mn. Les Ghanéens sont bien rentrés dans le match et ont mis à mal la défense malgache dans les dernières minutes. Heureusement, Nina Rakotoasimbola, le gardien des Barea a sauvé sa cage dans les temps additionnel face à de belles occasions d’égalisation des Black Galaxies. Avec le forfait des Lions de l’Atlas, les Barea ne reprendront la compétition que le 23 janvier contre les Soudanais. (adsbygoogle = window.adsbygoogle || []).push({}); Feuille de match Madagascar  Titulaire : Nina Rakotoasimbola, Tantely Antoine Randrianiaina (Capitaine), Soloniaina Rajo Nirina, Rojolalaina Andriamanjato, Koloina Razafindranaivo, Lalaina Clivier Rafanomezantsoa, Arohasina Andrianarimanana dit Dax, Olivier Randriatsiferana, Jean Martin Rakotonirina, Tantely Avotriniaina Rabarijaona, Jean Yvon Razafindrakoto. Ghana  Titulaires : Danlad Ibrahim, Augustine Randolf, Solomon Adomako, Konadu Yoadom,David Sandan Abagna, Dennis-Nkrumah-Korsah, Gladson Awako (Capitaine), Dominic Nsobila, Daniel Afriyie, Abdul Razak Yusif, Razak Kasim. Arbitre : Mutaz Ibrahim (Lybie) Assistants : Abdul Aziz Bolle Jawo (Gambie), Modibo Samake (Gambie), Bamlak Tessema Weyesa (Ethiopie). VAR : Mohammed Abdallah Ibrahim (Soudan) T.H L’article <strong>Football – CHAN 2022</strong> : <strong>Victorieux face au Ghana, les Barea en tête de la poule C</strong> est apparu en premier sur Midi Madagasikara.","pubDate":"2023-01-16 03:00:00","image_url":null,"source_id":"madagasikara","country":["madagascar"],"category":["sports"],"language":"french"},{"title":"Devin Willock, Georgia football player killed in crash, remembered as 'an awesome gentle giant'","link":"https://ca.sports.yahoo.com/news/awesome-gentle-giant-jersey-product-000338624.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-16 02:21:30","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Cristiano Ronaldo's arrival has already sent Saudi Arabia's football obsessed public into a frenzy","link":"https://www.dailymail.co.uk/sport/football/article-11638255/Cristiano-Ronaldos-arrival-sent-Saudi-Arabias-football-obsessed-public-frenzy.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Look east from the hilly vantage of the King Saud University Stadium, and the skyline is dominated by the skyscrapers of central Riyadh, each having outgrown one another over the years.","content":null,"pubDate":"2023-01-16 02:15:20","image_url":"https://i.dailymail.co.uk/1s/2023/01/16/02/66608643-0-image-a-11_1673835316782.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Joseph Kosinski Says Glen Powell Hurt Himself by Going ‘110 Percent’ in ‘Top Gun: Maverick’ Beach Football Scene","link":"https://ca.sports.yahoo.com/news/joseph-kosinski-says-glen-powell-014753415.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-16 01:47:53","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Three talking points from the English Premier League this weekend","link":"https://www.capitalfm.co.ke/sports/2023/01/16/three-talking-points-from-the-english-premier-league-this-weekend/","keywords":["English Premiership","Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"LONDON, United Kingdom, Jan 16 – Arsenal tightened their grip on the Premier League title race after a weekend of two dramatic derbies saw the Gunners pull eight points clear of Manchester City. City blew a late lead to lose 2-1 at Manchester United in controversial circumstances on Saturday before Arsenal took advantage with a […] The post Three talking points from the English Premier League this weekend appeared first on Capital Sports.","content":"LONDON, United Kingdom, Jan 16 – Arsenal tightened their grip on the Premier League title race after a weekend of two dramatic derbies saw the Gunners pull eight points clear of Manchester City. City blew a late lead to lose 2-1 at Manchester United in controversial circumstances on Saturday before Arsenal took advantage with a dominant first half display to win 2-0 away at Tottenham. United’s victory and another win for Newcastle saw them open up a five-point cushion in the race for top-four finish. It is much tighter at the bottom of the table with just two points separating Leeds in 14th from Southampton in 20th. AFP Sports looks at three talking points from the Premier League weekend. Arsenal’s title to lose A 3-0 defeat at the Tottenham Hotspur Stadium in May sent Arsenal into a spiral that saw them miss out on the top four for the sixth consecutive season. Eight months on and any doubters of Mikel Arteta’s men’s ability to last the course must be beginning to waiver. Only Liverpool in 2018/19 have failed to win the Premier League title after taking at least 47 points from their opening 18 games. Moreover, City do not appear the juggernaut they have been in recent seasons with Pep Guardiola accusing his side of complacency in their 2-0 League Cup exit to Southampton last week. The World Cup break means there remains over half the season to play, including two meetings between Arsenal and City. The disparity in squad depth between the two sides also offers City hope. Arsenal were gazumped by Chelsea’s 100 million euro offer in the chase to sign Ukrainian international Mykhailo Mudryk on Sunday. But if Arteta can keep his key players fit, Arsenal look set to end a 19-year wait to be crowned champions. Simply the ‘worst’ for Liverpool Simply the ‘worst’: Jurgen Klopp after Liverpool’s 3-0 defeat to Brighton © AFP / Glyn KIRK Jurgen Klopp branded Liverpool’s 3-0 destruction at the hands of Brighton the worst performance he could recall in his entire managerial career. Klopp approached the travelling support at the Amex with his hands out in apology and took responsibility for his side’s remarkable slump from quadruple chasers last season to also-rans so far this campaign. “The same players played outstanding football matches but if things aren’t properly organised then it can look like that,” said Klopp. “My responsibility, I know that.” Sitting ninth in the table, Liverpool are a distant 10 points off the top four. With a midfield badly in need of an overhaul and the club up for sale, missing out on the Champions League next season for the first time in seven years could barely come at a worse time. But that now seems inevitable with Klopp seemingly at a loss at how to turn the sinking ship around. New year sack race Sack race?: Everton boss Frank Lampard is the favourite to be the next Premier League manager to face the axe © AFP / Lindsey Parnaby At the bottom of the table, the pressure is rising with a number of top-flight bosses hanging on to their jobs by a thread. Frank Lampard is the favourite to be next Premier League manager sacked after Everton’s 2-1 home defeat to Southampton amid unrest at Goodison Park left the Toffees off the foot of the table only on goal difference. But West Ham manager David Moyes, Leicester’s Brendan Rodgers, Bournemouth boss Gary O’Neil and Jesse Marsch of Leeds are also facing increasing calls from fans to go after a poor start to the year. Moyes has led West Ham into Europe the past two seasons, but the Hammers are now in the relegation zone despite spending over £100 million in the summer transfer market. Leicester and Bournemouth have both lost all four league games since the World Cup break, while Leeds have taken just two points from their last five matches. The post Three talking points from the English Premier League this weekend appeared first on Capital Sports.","pubDate":"2023-01-16 01:11:36","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Tottenham promise to take action after fan kicks Arsenal’s Ramsdale","link":"https://www.capitalfm.co.ke/sports/2023/01/16/tottenham-promise-to-take-action-after-fan-kicks-arsenals-ramsdale/","keywords":["English Premiership","Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"LONDON, United Kingdom, Jan 16 – Tottenham promised to take the “strongest possible action” after Arsenal goalkeeper Aaron Ramsdale was kicked by a fan following the Gunners’ 2-0 win in the north London derby on Sunday. “We are appalled by the behaviour of a supporter that attempted to attack Arsenal goalkeeper Aaron Ramsdale at the […] The post Tottenham promise to take action after fan kicks Arsenal’s Ramsdale appeared first on Capital Sports.","content":"LONDON, United Kingdom, Jan 16 – Tottenham promised to take the “strongest possible action” after Arsenal goalkeeper Aaron Ramsdale was kicked by a fan following the Gunners’ 2-0 win in the north London derby on Sunday. “We are appalled by the behaviour of a supporter that attempted to attack Arsenal goalkeeper Aaron Ramsdale at the end of today’s match,” Tottenham said in a statement. “Violence in any form has no place in football.” “The club has reviewed its CCTV footage to identify the supporter and will be working with the Met Police, Arsenal and Aaron Ramsdale to take the strongest possible action, including an immediate ban from Tottenham Hotspur Stadium.” Ramsdale made a number of crucial saves to help Arsenal move eight points clear at the top of the Premier League with their first away league win against their local rivals since 2014. The England international exchanged words with Tottenham forward Richarlison after celebrating in front of the stand behind his goal at full-time. The supporter then leapt onto the advertising boards at the side of the pitch to kick out at Ramsdale. “The Spurs fans gave me some throughout the game,” Ramsdale told Sky Sports. “I was giving some back. The people I did give it to greeted it in sportsmanlike terms but one fan tried to give me a little punch on the back. “It is a shame as it is just a game of football at the end of the day. Both sets of players tried to bring me away but thankfully nothing too drastic happened. “It is a sour taste but I’m sure we will enjoy it when we go back into the dressing room.” Tottenham manager Antonio Conte called for more respect to be shown to the players. “To be able to show always respect is better, in any moment, for the opponent, for the players,” said Conte. “I didn’t like it.” Spurs defender Eric Dier, who had his own confrontation with a fan at the Tottenham Hotspur Stadium in 2020, said the incident was “unacceptable.” The Professional Footballers Association (PFA) said such attacks are taking place “far too often” and called for tougher action to be taken against violent supporters. “Violence towards players is completely unacceptable. These types of incidents are happening far too often,” the PFA said in a statement. “Players have a right to be safe in their place of work. When a player is attacked we expect the laws and regulations that are in place to protect them to be properly enforced. “As the players’ union we treat this as a priority issue. We will be continuing to work with the authorities to demand that players and staff are better protected in their place of work.” The post Tottenham promise to take action after fan kicks Arsenal’s Ramsdale appeared first on Capital Sports.","pubDate":"2023-01-16 01:09:00","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Arteta hails Arsenal ‘courage’ as leaders sink Spurs before fan attack","link":"https://www.capitalfm.co.ke/sports/2023/01/16/arteta-hails-arsenal-courage-as-leaders-sink-spurs-before-fan-attack/","keywords":["English Premiership","Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"LONDON, United Kingdom, Jan 16 – Mikel Arteta praised Arsenal’s “courage” as the Premier League leaders powered to a 2-0 win at arch rivals Tottenham before keeping their cool when goalkeeper Aaron Ramsdale was attacked by a fan after the final whistle on Sunday. Arteta’s side were gifted the lead by Tottenham goalkeeper Hugo Lloris, […] The post Arteta hails Arsenal ‘courage’ as leaders sink Spurs before fan attack appeared first on Capital Sports.","content":"LONDON, United Kingdom, Jan 16 – Mikel Arteta praised Arsenal’s “courage” as the Premier League leaders powered to a 2-0 win at arch rivals Tottenham before keeping their cool when goalkeeper Aaron Ramsdale was attacked by a fan after the final whistle on Sunday. Arteta’s side were gifted the lead by Tottenham goalkeeper Hugo Lloris, who pushed Bukayo Saka’s cross into his own net early in the first half. Martin Odegaard added Arsenal’s second goal with a superb long-range strike before the interval. Arsenal’s first league double over Tottenham since 2013-14 moved them eight points clear of second placed Manchester City. But their celebrations were tarnished by an ugly conclusion to the derby when a Spurs fan jumped onto the pitch and tried to kick Ramsdale after the Arsenal keeper clashed with Tottenham’s Richarlison. “The Spurs fans were giving me some throughout the second half, I gave them some back, then the fan jumped over,” Ramsdale said. “It’s a sour taste but thankfully nothing too drastic happened.” Asked about the flashpoint, Arteta added: “I just want to talk about football and the beautiful game we just played. “I loved the way we played and the courage we showed. Everything we ask, they are so willing to try. They are a terrific group of players. “I think today we went another step. We won last season in big stadiums, but the way we won today was really pleasing.” Tottenham manager Antonio Conte condemned the fan attack, saying: “If it happened, it is not good. We always have to show respect for an opponent and the players. I don’t like it.” As Arsenal’s unexpected title charge gathers pace, their trip to fifth placed Tottenham was a significant test of their mettle. They passed with flying colours at a venue which had been a house of horrors for the Gunners, who had lost all three games at Tottenham’s plush new stadium since it opened in 2019. – ‘Big result’ – “It shows not only determination and courage but you have to have the belief and quality to do it against this team. That is absolutely down to the players,” Arteta said. Even losing out to Chelsea in the race to sign Shakhtar Donetsk winger Mykhailo Mudryk on Sunday could be dismissed as a minor inconvenience thanks to this statement success. Unbeaten in their last 12 league games, the Gunners are in pole position to win the title for the first time since Arsene Wenger’s Invincibles reigned supreme in 2004. With spluttering City looking more vulnerable than usual and Liverpool struggling to shake off a season-long funk, Arsenal have seized the initiative in the title race with a remarkable 15 wins from their 18 games. Next weekend’s visit from Manchester United — the only team to beat the Gunners in the league this season — stands as another crucial test for Arsenal, who still have to face City twice in the league and in the FA Cup. “Psychologically and emotionally it’s a big result. There is a big history between the clubs and this means so much to our people,” Arteta said. “It’s a great position to be in. Lets enjoy every single moment and keep working. I don’t want to do calculations, we have to focus on United.” Arsenal took the lead thanks to Lloris’ 14th minute nightmare. When Saka cut in from the right flank and guided a cross into the six-yard box, it should have been easy for Lloris to handle. But Lloris committed the latest in a growing list of costly errors with a woefully weak attempted save that let the ball squirm into the net at the near post. Arsenal controlled possession with imperious ease and Thomas Partey was inches away when his dipping long-range volley crashed off the post. Saka was proving impossible to contain and he provided the assist when Odegaard struck in the 36th minute. Rampaging forward unchecked, Saka picked out the unmarked Odegaard and the Arsenal captain drilled a fine finish past Lloris from 25 yards. The post Arteta hails Arsenal ‘courage’ as leaders sink Spurs before fan attack appeared first on Capital Sports.","pubDate":"2023-01-16 01:06:45","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Tragedy, Comedy, and Many Shanked Kicks: A Complete History of the Chargers’ Failures","link":"https://www.theringer.com/nfl/2019/12/4/20995317/chargers-losses-one-score-game-missed-kicks-pass-interference","keywords":null,"creator":["Danny Heifetz"],"video_url":null,"description":null,"content":"[Editor’s Note: The Ringer originally ran this story in 2019. It has been updated since the Chargers’ stunning collapse against the Jaguars in the wild-card round on Saturday night.] If great art makes you think and feel, then the Los Angeles Chargers have certainly turned losing into an art form. L.A. blew a 27-0 lead over the Jacksonville Jaguars in their wild-card matchup Saturday, losing 31-30. The epic collapse was a gut-wrenching loss—and also somewhat historic. It was the third-biggest blown lead in NFL playoff history, and it happened despite the Chargers winning the turnover battle 5-0. Previously, teams with no turnovers and five or more takeaways were 313-3 in NFL history. But the Chargers still found a way to lose. The loss is the latest in a long line of head-scratching, heart-stopping, stomach-churning Chargers defeats that defy the odds and define the franchise. It’s not just that the Chargers lose so many close contests and blow so many big leads. It’s how they do it. Any team can lose a game. The Chargers often redefine the word defeat. And this avant-garde phenomenon has finally been given a name: Chargering. Even Chargers head coach Brandon Staley has acknowledged it. “The history of this team when I got here,” Staley told The Athletic last year, “it was like, someone’s going to get hurt, they’re going to blow a lead, something catastrophic is going to happen. There’s this Chargering, and there’s all these external factors that I know in my life, they’re just all excuses.” Let’s go through the modern history of Chargering, beginning with one of the most painful moments in team history. Opponent: New England Patriots Score: Chargers 21, Patriots 13 Time: 6:25 left in the fourth quarter Possession: Patriots Down and distance: Fourth-and-5 Tom Brady was intercepted by Chargers safety Marlon McCree, seemingly sealing a Chargers victory and ending a half-decade of dominance from the three-time Super Bowl champions. But Troy Brown punched the ball out from McCree’s hands, and it was recovered by Pats receiver Reche Caldwell. Brady threw a touchdown pass to Caldwell five plays later to make the game 21-19. Then New England made the two-point conversion to tie it at 21. On their next drive, the Patriots kicked a field goal to take a 24-21 lead. The Chargers set up Nate Kaeding for a 54-yarder to tie the game, but he missed. The 14-2 Chargers, who had captured the no. 1 seed in the AFC behind a record 28-touchdown season from LaDainian Tomlinson, were one-and-done in the postseason. Worst of all, this might have been their best chance at a Super Bowl. The following season, the Chargers faced the undefeated Patriots in the AFC championship game with a litany of injured players, including Rivers playing on a torn ACL and Tomlinson trying to play through a knee injury, but lost 21-12. Sad Marty Schottenheimer quote : “Anytime you’re in the playoffs and lose, and certainly I have plenty of experience at it, there’s a disappointment.” A month later Chargers owner Dean Spanos fired Schottenheimer and gave us … Opponent: Denver Broncos Score: Chargers 38, Broncos 31 Time: 1:17 left in the fourth quarter Possession: Broncos Down and distance: Second-and-goal at the Chargers’ 1-yard line Denver had three plays to go 1 yard and tie the game, but quarterback Jay Cutler rolled out of the pocket and fumbled as he tried to throw. The Chargers recovered to seal the victory, but referee Ed Hochuli thought it was an incomplete pass and whistled the play dead. The whistle nullified the Chargers’ recovery. “The play should have been ruled a fumble,” Hochuli said. “By rule, the ball is dead when it hits the ground when the whistle is blown.” Denver kept the ball, and Cutler threw a touchdown to receiver Eddie Royal two plays later to make the game Chargers 38, Denver 37. Then Denver went for two. Cutler tossed the ball to Royal again and converted to give Denver the 39-38 win in regulation. It wasn’t even the only referee mistake of the day. Earlier in the game there was another awful technical issue with replay that upheld a bogus fumble ruling against the Chargers. Sad Norv Turner quote : “[Discussing] the rules or any of the calls isn’t going to change the outcome of that game. That game is going to be 39-38 forever.” Opponent: New York Jets Score: Jets 17, Chargers 7 Time: 4:42 left in the fourth quarter Possession: Chargers Down and distance: Fourth-and-2 from the Jets’ 22-yard line Nate Kaeding made 32 field goals in 2009, the most of any kicker. He had just three misses all season, which made it more devastating when he missed three kicks against the Jets in the playoffs. The final miss came from 40 yards out with under five minutes to go and would have been enough to tie considering the Chargers scored a touchdown on their final drive. This was the second time the Chargers lost to the Jets in the playoffs when Kaeding missed a 40-yard field goal with under five minutes in the game. Kaeding missed a 40-yarder in overtime against the Jets in January 2005. Sad Nate Kaeding quote : “Professionally, it’s a tough thing to get through. I’m not gonna feel sorry for myself. I feel sorry for my teammates, coaches and support staff here. I feel like I let everybody down.” Sad quote from general manager A.J. Smith: “The résumé of the San Diego Chargers has been an outstanding regular-season team and in the postseason can’t get it done.” Opponent: Kansas City Chiefs Score: Chargers 20, Chiefs 20 Time: 1:03 left in the fourth quarter Possession: Chargers Down and distance: First-and-10 at the Kansas City 15-yard line The Chargers were about to beat the division-rival Chiefs on Monday Night Football and take the sole lead in the AFC West. With the game tied, the Chargers intended to take a knee and let new kicker Nick Novak take the game-winning kick as time expired from 32 yards out. That distance is shorter than an extra point nowadays. But as Rivers went to take a knee, he fumbled the snap and the Chiefs recovered. The two teams went to overtime and the Chargers won the toss, but Rivers was stripsacked on their second play . Rivers recovered but the Chargers punted to the Chiefs, who drove down and won the game. The game likely cost the Chargers the division title. At the end of the season, San Diego ended up in a three-way tie at 8-8 for the AFC West lead, but the Broncos won the division on tiebreakers. “I’m baffled,” Chargers linebacker Takeo Spikes said after the game. Sad Philip Rivers quote : “We didn’t have an issue [with the snap] the whole game. Haven’t had an issue in years. This one’s rough.” Opponent: Denver Broncos Score: Chargers 24, Broncos 0 Time: Halftime New year, new collapse against a divisional foe on Monday Night Football . The Chargers jumped out on Peyton Manning’s Broncos for a 24-0 lead at halftime, but Denver scored 35 unanswered points in the final two quarters like a horror villain that wouldn’t die. Like in a horror movie, the main characters made some inexplicable mistakes. The comeback was possible because the Chargers turned the ball over on five of their six possessions in the second half. In the fourth quarter alone, Rivers threw three interceptions and lost a fumble. Denver’s comeback was the fourth-biggest in regular-season history at the time. Sad Norv Turner quote : “We’ve got to go play a complete game. We’ve shown through three quarters of a game what we can do.” Opponent: Baltimore Ravens Score: Chargers 13, Ravens 10 Time: 1:59 left in the fourth quarter Possession: Ravens Down and distance: Fourth-and-29 on Baltimore’s 37-yard line Failures of a certain scale are studied. The Titanic sinking, the Chernobyl nuclear disaster, and the Ravens’ converting a fourth-and-29 to beat the Chargers all qualify. Ironically, the Chargers stopped the Ravens on fourth-and-inches earlier in the game. But on fourth-and-29 with the game on the line, Ravens quarterback Joe Flacco tossed a checkdown at the line of scrimmage to running back Ray Rice. Rice ran 15 yards straight upfield, pivoted 90 degrees and outran six Chargers defenders as he crossed the Chargers’ lightning bolt logo at midfield (metaphors), curved back upfield, and then lowered his shoulder into the final two Chargers defenders. Rice gained 29 yards on fourth-and-29. Or was it 28? The referees moved the chains after Rice converted, but then the play was reviewed and the referees had to move the chains back. The new chain location and a lack of a definitive angle showing when Rice’s knee went down led the referees to stick with the call on the field: first down Baltimore. The Ravens’ Justin Tucker kicked a field goal to tie the game on the possession and then kicked the game-winner in overtime. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again. Sad Philip Rivers quote : “[Rice] did not get the first down. They just did not have a view to overturn it. He did not get it. You can’t help it. When you don’t have a view to overturn it, you cannot overturn it. I do not think anyone thinks he got it. I do not think anyone in the stadium thinks he got it. I do not think Ray Rice thinks he got it. I do not think anyone on their team thinks he got it. But he got it. They just did not have a camera view to overturn it. That’s what the referee said. He felt bad that they could not because he did not have a view. He knew his knee was down on the 35-yard line.” Sad Norv Turner quote : “Obviously, on 4th-and-29, we should have stopped them.” Spanos fired Turner after the 2012 season and gave us … Opponent: Houston Texans Score: Chargers 28, Texans 7 Time: 10:46 remaining in the third quarter The Mike McCoy era began with the Chargers jumping out to a 28-7 lead over the Houston Texans on Monday Night Football . All the Chargers had to do was bleed the clock, but from that point on the offense went three-and-out, three-and-out, pick-six, three-and-out, and three-and-out. Running just 14 plays over five drives gave the Texans enough time to kick the game-winning field goal as time expired for the 31-28 victory. Sad Philip Rivers quote : ”We’re sick, I’m sick, that we’re not 1-0.” Sad Mike McCoy quote : “This was a tough one, obviously. When you play a good team like the Houston Texans, you have an opportunity when you’re up 28-7. You have to put the game away.” Opponent: Oakland Raiders Score: Chargers 17, Raiders 12 Time: 8:53 left in the fourth quarte Possession: Chargers Down and distance: Fourth-and-25 at the Oakland 36-yard line Chargers kicker Josh Lambo drilled a 53-yard field goal with just under nine minutes left to give the team a 20-12 lead, but Oakland’s Khalil Mack was called for defensive holding on the play, giving the Chargers an automatic first down. Rivers threw a 30-yard touchdown pass to tight end Ladarius Green on the next play, but the booth review overturned the catch and ruled it incomplete. The Chargers settled for a 48-yard kick, but Lambo missed this one. The game stayed at 17-12. The Chargers fumbled on their next possession, and the game would eventually go to overtime, when Los Angeles lost. Sad Philip Rivers quote : “It’s been the story of the year, just losing close games. Doesn’t make it any easier losing another one like that.” Opponent: Kansas City Chiefs Score: Chargers 27, Chiefs 20 Time: 1:59 remaining in the fourth quarter Possession: Chiefs Down and distance: Fourth-and-10 at the Chargers’ 25-yard line The Chargers led 24-3 midway through the third quarter and 27-10 midway through the fourth, which gave them a 99.7 percent win probability and sent Chiefs fans leaving Arrowhead Stadium . Yet the Chargers were sweating it at the two-minute warning. Drew Kaser shanked a punt for just 17 yards. The Chiefs went 42 yards in four plays to tie the game at 27, won the coin toss, and then scored the game-winning touchdown in overtime without the Chargers getting the ball again. Kansas City overcame a 21-point deficit in roughly 18 minutes. Star receiver Keenan Allen also tore his ACL in this game, making him just one of the nearly 20 Chargers who landed on injured reserve by Week 4. Sad quote from tackle Joe Barksdale: “Everybody with eyes who saw the game has got to know, we have to close it. It’s not acceptable to be up by 24-3 and lose the game. We know that.” Opponent: New Orleans Saints Score: Chargers 34, Saints 21 Time: 8:39 left in the fourth quarter Possession: Chargers Down and distance: Kickoff post–field goal When Lambo kicked a field goal to make the game 34-21, the Chargers’ win probability was 98.6 percent . But their final three drives were a lost fumble, lost fumble, and interception, while the Saints finished with a touchdown, touchdown, and kneel-down to win in regulation. Angry Mike McCoy quote : “That performance in the second half is flat-out unacceptable. From the very opening kickoff return all the way to the very end. You cannot turn the ball over at critical times when you are trying to put the game away. Two times in a row. We absolutely gave this one away.” Opponent: Oakland Raiders Score: Raiders 34, Chargers 31 Time: 3:05 left in the fourth quarter Possession: Chargers Down and distance: Third-and-2 at the Raiders’ 19-yard-line The Chargers led by as much as eight midway through the third quarter but were losing by three with just three minutes left in the game. On third-and-2, Chargers running back Melvin Gordon was stuffed after gaining just 1 yard, so the Chargers lined up for a 36-yard field goal on fourth-and-1 to tie the game at 34. The holder was punter Drew Kaser, who earlier in the game had shanked a punt 16 yards at the end of the third quarter to set up a Raiders touchdown. On the field goal attempt, Kaser failed to catch the snap and the ball went flying behind him for his second major screw-up of the day. After Oakland’s loss to the Raiders , The Wall Street Journal calculated the odds of the Chargers losing their games to the Chiefs, Saints, Colts, and Raiders in the first four weeks of the season were 1 in 30 million . FiveThirtyEight calculated that, from the beginning of 2015 through this Raiders loss, the Chargers lost more win probability per game in the fourth quarter and overtime than any other two-year window for any team in the Super Bowl era. Sad Philip Rivers quote : “You can’t make this stuff up. You think, ‘Is there any other way we can find a way to do this?’” Sad Mike McCoy quote : “Just when you think you’ve seen it all, something like that happens.” Spanos fired McCoy after the season, giving us the … Opponent: Denver Broncos Score: Broncos 24, Chargers 21 Time: Five seconds left in the fourth quarter Possession: Chargers Down and distance: Fourth-and-2 at the Denver 26-yard line New city, new kicker, same Chargers. In their first game representing Los Angeles, the Chargers traveled to Denver and lined up rookie Younghoe Koo for a 44-yard kick, which doubled as his first career field goal attempt, to send the game to overtime. Koo nailed it. Unfortunately, Denver head coach Vance Joseph called a timeout to ice Koo. When he lined up for his second try, the Broncos blocked the kick . Sad Philip Rivers quote : “I think if we get to OT, we would have finished it off, but we didn’t get that chance.” Opponent: Miami Dolphins Score: Dolphins 19, Chargers 17 Time: Nine seconds left in the fourth quarter Possession: Chargers Down and distance: Third-and-1 at the Miami 26-yard line One week after Koo’s chance to be the hero was taken from him, he had another shot. The Chargers lined him up for a 44-yard field goal, this time to win the game rather than send it to overtime. He missed. YOUNGHOE MISSED IT pic.twitter.com/3dk05alTfL Adding insult to injury, the team’s celebratory cannons accidentally went off as if Koo had won the game (that’s what happens when the guy who operated your cannons for 37 years doesn’t move from San Diego to Los Angeles). After the cannons celebrated the Chargers’ loss at the Chargers’ first home game in Los Angeles, the fans in the stadium began … cheering. ESPN measured the crowd noise at the game and concluded Koo’s missed kick was the loudest cheer of the game from the crowd, made up predominantly of Dolphins fans. This was the first clue that every Chargers game would effectively be on the road. Steelers fans had turned Qualcomm Stadium in San Diego into a Pittsburgh home game before , but Dolphins fans doing it was new. Sad Philip Rivers quote : “I thought there was great energy in the stadium. Obviously the loudest roar came at the end after the missed field goal. That’s where you really got to see how many Dolphins fans there were. I heard the roar before I saw the official’s signal. I wasn’t sure which roar it was.” The Chargers’ luck turned in 2018. They played in seven one-possession games during the regular season and went 6-1 in them, en route to a 12-4 record—their best since 2009. The Chargers dominated the Baltimore Ravens in the wild-card round and held Lamar Jackson to the worst performance of his young career. Entering the divisional round, they had to like their chances against a New England team that had been slow and sluggish for the entire month of December. This was the Chargers’ best chance at a Super Bowl run in years. That team was promptly disemboweled. New England turned the Chargers inside out in a 41-28 loss that was 41-14 midway through the fourth quarter. L.A.’s luck turned around for one season, but it did not carry into the playoffs. Opponent: Tennessee Titans Score: Titans 23, Chargers 20 Time: 19 seconds left in the fourth quarter Possession: Chargers Down and distance: Second-and-1 at the Tennessee 1-yard line Chargers running back Melvin Gordon returned from his holdout after backup Austin Ekeler thrived for a month in his absence. Gordon’s return promptly clogged the Chargers’ running game. Gordon had just 20 carries for 49 yards in his first two games back, and the Chargers went from one of the best rushing teams to one of the worst. Gordon’s solution for this was publicly asking for more carries. “With the more carries you get, you run that play and you’re like, ‘OK, this is how they are playing it,’” Gordon told ESPN’s Eric D. Williams . “So when you run that play again, I know how I’m going to treat it. But when you get eight carries, you’ve seen the same play for the first time every time. There’s no feel to it, and you never get a feel for the game.” Gordon went from eight carries against Pittsburgh to 16 against Tennessee, but the 16th and final of the day was an exercise in be careful what you wish for . The Chargers were down 23-20 in the fourth quarter and got to the 1-yard line on a 15-yard pass to Ekeler originally ruled a touchdown before being overturned on replay. A false start moved the Chargers back to first-and-goal from the 6, but then a pass interference penalty put the Chargers back at the 1-yard line for first-and-goal. Rivers handed the ball to Gordon who ran in for the touchdown from the shotgun formation, but replay review once again overturned the score and put the Chargers at the 1-yard line. On second-and-1 Gordon was stuffed at the goal line, but the play was once again reviewed. The referees ruled Gordon fumbled the ball before being tackled, and the Titans recovered. Three consecutive replays, three rulings against the Chargers, and Tennessee held on for the 23-20 win. Sad Anthony Lynn quote : “I have been in the league for a long time, and I have never been in a game like this. The emotions of this game, going from winning the game to losing the game in a matter of seconds ...” Opponent: Oakland Raiders Score: Raiders 26, Chargers 24 Time: 1:02 left in the fourth quarter Possession: Chargers Down and distance: First-and-10 at the L.A. 25-yard line At the end of the fourth against Oakland, Rivers needed to move the Chargers from the 25-yard line into field goal range, but he completed zero of his seven pass attempts on the drive. Even when the Chargers were bailed out by a fourth-down penalty, they didn’t move an inch on the other seven plays. Rivers was the first player to go 0-for-7 on a drive in at least 40 seasons, according to Elias Sports . Sad Anthony Lynn quote : “I don’t have that luxury right now to think beyond the season. Right now, it’s one week at a time for me. Philip is our starting quarterback. I’m trying to figure out how to win the next game with him.” Opponent: Kansas City Chiefs Score: Chiefs 24, Chargers 17 Time: 4:20 left in the fourth quarter Possession: Chargers Down and distance: Third-and-10 at the L.A. 17-yard line One week after throwing three interceptions against the Raiders, Rivers threw four interceptions against Kansas City, including ones on the Chargers’ final two drives of the game when a touchdown would have tied the score at 24. In back-to-back weeks the Chargers lost to the division-rival Raiders and Chiefs in prime time, and the seven combined picks Rivers threw is the most for any two-game stretch of his career. Sad Philip Rivers quote : “If you could just pick and choose and never throw [interceptions] ever, I’d choose to throw zero. So I certainly don’t want to throw them, but I know it’s hurting us right now. So obviously I need to cut them out.” Opponent: Denver Broncos Score: Broncos 20, Chargers 20 Time: Nine seconds left in the fourth quarter Possession: Denver Down and distance: First-and-10 at the Denver 28-yard line The one that prompted this exercise. Drew Lock threw a ball down the sideline to Courtland Sutton, drawing the first pass interference penalty of the season called with under 10 seconds remaining. The Broncos kicked the field goal to win as time expired. This capped a stretch that ended the Chargers’ hopes for a meaningful season. A month ago the Chargers were 4-5 and fresh off of beating the Green Bay Packers. After their past three games, they’ve fallen to 4-8 and lost to each team in their division by a combined 12 points. Sad Anthony Lynn quote : “Hell, if there was something I could do to avoid being in a close game, I would have done it by now.” Opponent: Tampa Bay Buccaneers Score: Chargers 24, Buccaneers 7 Time: 1:37 left in the second quarter The Chargers were up 24-7 over Tom Brady and the Buccaneers with less than two minutes to go in the first half. But the Bucs scored just before halftime to make it 24-14, and in the second half, the Bucs tallied three touchdowns in a span of 18 offensive plays to take a 35-31 lead. The Chargers’ depleted secondary played a major role in the comeback, with reserve players giving up catches of 28 yards or more to four different Bucs in the second half alone. “It happened pretty quick,” defensive coordinator Gus Bradley said after the game. Sad Joey Bosa quote: “We’re just not finishing games. Maybe teams are figuring us out. I don’t know what it is. … We have to step on their throats and keep the intensity going for four quarters straight.” Opponent: New Orleans Saints Score: Chargers 27, Saints 27 Time: 5 seconds left in regulation Possession: Chargers Down and distance: 50-yard field goal attempt On a Monday Night Football clash between Justin Herbert and Drew Brees, the Chargers took a 17-point lead midway through the second quarter. Chargers kicker Michael Badgley had missed his first kick of the game on the opening extra point attempt, but he had the chance to redeem himself with a 50-yard would-be game winner. Instead, he doinked the kick off the upright, and the Saints won 30-27 in overtime. It was the second-largest comeback of Brees’s career and tied for the third-largest Monday Night Football comeback win since 2010 (the two larger comebacks were also against the Chargers). Sad Justin Herbert quote: “ It is going to take 30 minutes more of stretching, weightlifting, and watching film. It’s little bits that add up in the long run. I know we are really close. If we work hard and do the right things, good things will happen. I love the way this team battles and I know that we are going to stick together. Losing is tough. It always is, but we are going to learn from it. I know we are going to stick together through this.” Score: Chargers 30, Broncos 24 Time: 7 seconds left in the game Possession: Broncos Down and distance: Fourth-and-4 at the Chargers 18-yard line Blowing leads to Brady and Brees sucks, but at least they are going to be Hall of Famers. But losing like that to Drew Lock? The Chargers took a 24-3 lead over the Broncos midway through the third quarter, but the score was 30-24 by the second two-minute warning. Lock led the Broncos to the red zone on their last-chance drive and threw a prayer to tight end Albert Okwuegbunam that fell incomplete. But Chargers defensive back Brandon Facyson committed pass interference in the end zone, giving the Broncos the ball at the 1-yard line. Lock threw the game-winning touchdown pass to K.J. Hamler as time expired. The loss made the Chargers the first team to lose three games where they’d had a 17-point lead in the same season since the 2003 Atlanta Falcons. This also made it four consecutive weeks that the Chargers had blown a lead of at least 16 points. Sad Rayshawn Jenkins quote: “We have to learn how to finish. We can’t let these games like this slip away. This is the NFL. It don’t make sense.” Opponent: Las Vegas Raiders Score: Raiders 31, Chargers 26 Time: 1 second left in regulation Possession: Chargers Down and distance: Third-and-goal at the Raiders 4-yard line This wasn’t a true blown lead, as the Chargers were merely up three points in the second quarter. But they had a chance for a great comeback win. The Chargers got the ball with just under five minutes remaining down five points. But they moved down the field at a glacial pace, including a bizarre stretch after the two-minute warning where Chargers players were tackled in bounds five times in a six-play stretch. Eventually, the Chargers set up a third-and-goal at the Raiders four-yard line with just one second remaining. Herbert threw the game-winning touchdown pass to tight end Donald Parham Jr. But a replay review overturned the call, and because time had expired, the Chargers didn’t get another try on fourth down. L.A. players were celebrating on the sideline and didn’t even realize the play had been overturned until they saw the Raiders celebrating on the other sideline. Sad Anthony Lynn quote: “I don’t want to find out how many [tough losses] we can take. Right now, we’ve been kicked in the gut six times. That’s six times too many for me.” Sad Keenan Allen quote: “I could talk about this since the second week of the season. Just close games, we’re not winning them. That’s just been the story of the season.” The Chargers finished the season with a four-game win streak, but Lynn ws still fired at the end of the season. Leading to … Opponent: Raiders Score: 32-32 Time: Less than a minute left in overtime Possession: Raiders Down and distance: Third-and-4 on the Chargers 39-yard line For much of his first season, Staley avoided the blown leads and terrible losses that had plagued his predecessors. And in the final regular-season game of the 2021 season, it was the Chargers who put on a ridiculous comeback. Herbert had one of the best fourth quarters in recent NFL history, converting a fourth-and-6, a fourth-and-21 for a touchdown, a 2-point conversion, a fourth-and-10, another fourth-and-10, and then a 12-yard touchdown pass with five seconds left to force overtime. It was a supernova performance. It also was wasted. The Raiders-Chargers game had been placed on the final Sunday Night Football of the regular season because the winner would make the playoffs while the loser would not. But there was a catch: If the teams tied, both would make the playoffs. Entering the game, both teams were obviously trying to win. But as they traded field goals in overtime, the winds shifted, and an unspoken situation seemed to be unfolding. Suddenly the Raiders were facing a third-and-4 with 38 seconds left on the Chargers’ 39-yard line. If they didn’t get the first down, they could let the time expire, and both teams would advance. But rather than let the time expire, Staley called timeout. The Chargers had a bad run-defending group on the field and he wanted to make a substitution. Whatever quid pro quo may or may not have been going on, Staley’s timeout shattered it. “Hmm,” Al Michaels said on the broadcast. “I am trying to process this.” His partner, Cris Collinsworth, was in disbelief, saying the Raiders seemed like they were trying to play for a tie. Staley’s substitution didn’t work anyway. Josh Jacobs ran for 10 yards, setting the Raiders up to make a game-winning kick. They nailed it and advanced to the playoffs, eliminating the Chargers. Staley, who had already been pilloried by football traditionalists for being aggressive on fourth down all season, was excoriated. Sad Brandon Staley quote: “We are going to learn from this. We are going to grow from this and come back in a really big way together. Opponent: Jaguars Score: 27-0 Even with all of this pathetic Chargers history, Saturday’s wild-card round collapse takes the cake . It was the largest blown lead in franchise history—which is saying something. With a 27-point lead and just needing to bleed the clock, the Chargers had seven rushing yards on their seven designed carries in the second half. If you count the 10 yards the Chargers lost on a fumble on a botched handoff late in the second quarter, L.A. managed minus-3 rushing yards after going up four scores. “We choked,” linebacker Kyle Van Noy said. Sad Derwin James Jr. quote: “ Twenty-two years of playing football in my life. This one probably hurts the most.” Sad Brandon Staley quote: “The way we started the game, that’s the team that I know that we’re capable of being. In the second half, we just didn’t finish the game.”","pubDate":"2023-01-16 00:00:00","image_url":null,"source_id":"theringer","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Football : Chelsea débourse 100 milions d'euros pour recruter l'attaquant Mykhailo Mudryk","link":"https://www.europe1.fr/sport/football-chelsea-debourse-100-milions-deuros-pour-recruter-lattaquant-mykhailo-mudryk-4161290","keywords":null,"creator":null,"video_url":null,"description":"Le club de Chelsea a réalisé un gros coup. L'attaquant ukrainien Mykhailo Mudryk a signé dimanche un contrat de huit ans et demi avec le club anglais en provenance du Shakhtar Donetsk, ont annoncé les Blues.","content":null,"pubDate":"2023-01-15 23:44:00","image_url":null,"source_id":"europe1","country":["france"],"category":["sports"],"language":"french"},{"title":"Ten Hag for the title? Sleeping giants Man United are well and truly awake thanks to the Dutchman","link":"https://www.dailymail.co.uk/sport/football/article-11638341/Ten-Hag-title-Sleeping-giants-Man-United-truly-awake-thanks-Dutchman.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Let's get straight to it. Only in the befuddled thinking of football's lawmakers was Marcus Rashford not interfering with play when Bruno Fernandes scored Manchester United's equaliser.","content":null,"pubDate":"2023-01-15 23:38:27","image_url":"https://i.dailymail.co.uk/1s/2023/01/15/23/66604417-0-image-a-18_1673825904665.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Erik ten Hag hands Man Utd scouts list of transfer targets with manager keen to target hidden gems in Netherlands and Germany","link":"https://metro.co.uk/2023/01/15/erik-ten-hag-hands-manchester-united-scouts-new-list-of-targets-including-three-ajax-stars-18105077/","keywords":["Football","Sport","Erik ten Hag","Manchester United FC","Manchester United Transfer News","Netherlands football team","Premier League"],"creator":["Metro Transfer News Reporter"],"video_url":null,"description":"Ten Hag is eager to continue rebuilding the squad.","content":"Ten Hag has his eye on a number of stars playing in the Eredvisie (Picture: Getty) Erik ten Hag is eager to bolster his squad with more talent from Dutch football having handed Manchester United scouts a new list of potential transfer targets. Ten Hag returned to old side Ajax to sign Antony and Lisandro Martinez during the summer transfer window with Tyrell Malacia also brought in from Feyenoord. The experienced duo of Christian Eriksen and Casemiro also arrived at Old Trafford with Wout Weghorst arriving on loan this month. But ten Hag is keen to continue building his own squad with as many as four senior players to be made available for transfer this summer to fund the manager’s overhaul, according to a recent report. According to The Sun, the manager has informed United’s European scouts that he wants them to keep tabs on more than a dozen young Dutch stars. Ten Hag is still keen on Ajax defender Jurrien Timber, who United attempted to sign in the summer. The centre-half eventually decided to remain in Netherlands for another year but he remains highly regarded by his former manager. United were keen on Timber in the summer (Picture: Getty) The United boss is also an admirer of Timber’s club teammates Kenneth Taylor and Devyne Rensch. 20-year-old midfielder Taylor and 19-year-old right-back Rensch have both been regulars in the Ajax side this term. AZ Alkmaar’s Sweden international Jesper Karlsson and PSV Eindhoven midfielder Joey Veerman have also been ‘earmarked as targets’, according to the report.   Karlsson has scored four goals and registered three assists in 14 appearances at club level this season with Veerman also enjoying an impressive campaign with seven goals and five assists. With transfer fees continuing to soar, ten Hag is eager for the club to find hidden gems in Dutch football and also in the Bundesliga, feeling the club should ramp up their scouting in both countries. A United insider told The Sun: ‘The manager is insistent there are gems in Holland and Germany the club should take a greater interest in. ‘He feels quite strongly that United can steal a march and the scouts have been told United need to ramp things up in both Holland and Germany.’ MORE : Danny Murphy sends message to Manchester United outcast and tells him to emulate team-mate MORE : Bruno Guimaraes in tears as Newcastle United star suffers injury against Fulham For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2023-01-15 23:03:39","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Gary Neville claims Arsenal will finish third in Premier League despite going eight points clear of Manchester City in title race","link":"https://metro.co.uk/2023/01/15/gary-neville-predicts-arsenal-to-finish-third-in-premier-league-after-spurs-win-18105049/","keywords":["Football","Sport","Arsenal FC","Liverpool FC","Manchester City FC","Manchester United FC","Tottenham Hotspur FC"],"creator":["Metro Sport Reporter"],"video_url":null,"description":"Arsenal are eight points clear at the top of the table.","content":"Arsenal are eight points clear at the top of the Premier League (Shutterstock) Gary Neville believes Arsenal will not win the Premier League title despite taking a commanding lead at the top of the table following their victory over Tottenham on Sunday. Mikel Arteta’s side are now eight points clear of Manchester City after beating Spurs 2-0 at the Tottenham Hotspur Stadium. City, meanwhile, lost ground on Saturday following their 2-1 defeat to rivals Manchester United at Old Trafford. Pep Guardiola’s side can make up points as they still have to play Arsenal twice in the league and Neville believes the Premier League champions will retain their crown and backs Manchester United to finish in second place. When asked if he believes Arsenal will win the title, Neville told Sky Sports: ‘No. But I said Leicester wouldn’t win the league. ‘They won’t win the league. Manchester City will win the league, and I think Man Utd will finish second, and I know that will annoy Arsenal fans. Gary Neville has backed Manchester United to finish second this season (Reuters) ‘I’d rather Arsenal win the league than Man City. I think it would be absolutely sensational for the Premier League. ‘I think about watching the Premier League, we’ve seen City sweep up, apart from Liverpool, over the past five years. To think Arsenal could come and win it, it adds to our league, it makes our league great. ‘I’d love Man Utd to win it, but I don’t think that’s going to happen this season. ‘The reality of it is, I think at some point Man City will hit a run. Once they do, they’ve got to play Arsenal twice. With City, is Erling Haaland not getting the service, or does he need to do more? I’ll ask that question. Does he need to do more, or does he need to be patient? ‘If Erling Haaland starts to kick on, if City start to purr, if the defence starts to shore up a bit more than it has done, and they need Ruben Dias back if they can, I think City will win it. Gary Neville says Manchester City need Erling Haaland to ‘kick on’ (Getty) ‘At some point, there will be a very difficult period for Arsenal this season. Is it conceivable that Arsenal are going to continue as they are? I don’t think it is. Could they draw two and lose one in a three-game period, and if they did that, their lead is gone, and the pack is up with them? That’s what I think is going to happen, we’ll see a traditional Premier League season where a team goes out, the pacemaker, and then they’ll get drawn back in a little bit. But I still think that this season is going to be far better for Arsenal than I ever imagined it would be. ‘I know Arsenal fans will batter me, as they have been doing for the last four months, I hope you win it! I think for Mikel Arteta, it’s so difficult for young managers to break that [Antonio] Conte, [Jurgen] Klopp, [Carlo] Ancelotti, [Pep] Guardiola, [Jose] Mourinho mould and become one of those super managers. You can’t break them. ‘If Arteta wins the league this season, he breaks into that bunch. He’s doing it anyway, because his football is fantastic. But he needs to win that trophy. A Champions League, a Premier League, they are the super managers, the ones that win those trophies. ‘So, fingers crossed that they do win it, if Man Utd can’t, which I don’t think they can, because I’d rather have that for the Premier League. Man City have won too many titles for me.’ For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2023-01-15 22:53:59","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Miguel Herrera se podría asociar con Grupo Orlegi para su próximo equipo","link":"https://juanfutbol.com/mexicanos-en-el-extranjero/miguel-herrera-se-podria-asociar-con-grupo-orlegi-para-su-proximo-equipo-20230115-JFB-33341.html","keywords":["Mexicanos En El Extranjero"],"creator":["Pasten Aveleyra"],"video_url":null,"description":"Miguel Herrera no deja de candidatearse para el Tri, pero un equipo de Grupo Orlegi ya lo buscó. ¡Mi Piojo siempre en busca de chamba! Después de su último proceso con Tigres, Miguel Herrera ha estado candidateado en muchos lados, entre ellos la Selección. Pues el técnico, siempre polémico, no deja de estar en la órbita de grandes equipos. En las últimas horas salió uno diferente y podría ir a un reto diferente pero que le puede generar muchas experiencias. Un equipo de Grupo Orlegi se podría llevar a nuestro Piojo. NO DEJES DE LEER: Andrés Vaca carga contra Miguel Herrera: “firmó el ridículo más grande” ¿Se nos va a España? Así como lo leen, Herrera podría convertirse en nuevo entrenador del Sporting de Gijón, donde hay viejos conocidos como Jordan Carrillo, Juan Otero, y el último fichaje del equipo asturiano, Ignacio Jeraldino. De acuerdo con una exclusiva de Football Transfers, las pláticas están avanzando y gracias a que los dueños saben cómo trabaja, nuestro Piojo podría viajar a España. El futbol que hacen sus equipos, de querer irse para el frente y siempre buscar llenar de goles al rival ha convencido a los directivos y a cierta parte de la afición que conoce a Miguel. Miguel Herrera está entre los candidatos para dirigir al Sporting de Gijón. Lo hablaba hace unas horas con @borfgarcia en España y ahora también sale desde México. Ojo que tiene competencia. https://t.co/wToIOsxJzG— Kery (@KeryNews) January 15, 2023 ¿Miguel Herrera se despide del Tri? Sin un proyecto establecido para la Selección de cara al Mundial de 2026, Herrera ha dicho públicamente que quiere volver al banquillo del Tri en muchas ocasiones. Eso puede ser una desventaja para el Sporting, porque mi Piojo se aferra a la posibilidad de dirigir otra Copa del Mundo, y más por cómo salió de ahí, por cuestiones extra cancha y su polémica con Martinoli. En caso de que Herrera diga que no, el Sporting de Gijón y de Grupo Orlegi se llama Miguel Ramírez, un DT español que estuvo dirigiendo en la MLS. Si el Piojo llega al Sporting ayudaría a crecer de manera exponencial a Jordan, el canterano de Santos ya encantó a la afición, pero Herrera sabe sacarle lo mejor a los jóvenes. Un proyecto como el del equipo Asturiano le vendría muy bien a Miguel, eso le ayudará a crecer como entrenador y tener muchas más tablas si quiere volver al banquillo del Tri.","content":null,"pubDate":"2023-01-15 22:43:59","image_url":null,"source_id":"juanfutbol","country":["mexico"],"category":["sports"],"language":"spanish"},{"title":"Thomas Frank and Ivan Toney have Brentford fans singing about European football","link":"https://www.dailymail.co.uk/sport/football/article-11638449/Thomas-Frank-Ivan-Toney-Brentford-fans-singing-European-football.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Pound for pound, name five managers across Europe better than Brentford's Thomas Frank. Well done if you got to more than three.","content":null,"pubDate":"2023-01-15 22:43:41","image_url":"https://i.dailymail.co.uk/1s/2023/01/15/22/66602591-0-image-a-32_1673821844020.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"West Ham boss David Moyes operating on match-by-match basis but WILL be in charge for crunch relegation clash vs Everton","link":"https://www.thescottishsun.co.uk/sport/football/10067115/west-ham-moyes-in-charge-everton/","keywords":["Football","Sport","Premier League","West Ham transfer news"],"creator":["Jordan Davies"],"video_url":null,"description":null,"content":"DAVID MOYES will be in charge of West Ham’s crunch relegation clash with Everton on Saturday. It is believed the under-fire Hammers boss is now operating on a match-by-match basis after seeing his side drop into the bottom three. Pressure is mounting on David Moyes as his West Ham side continue to struggleRex West Ham have not won a Prem game since October, with Saturday’s 1-0 defeat at Wolves their seventh straight league match without a win. For the first time since September, Moyes’ men are in the relegation zone, sitting 18th after 19 games, sparking major concern in the boardroom. But Moyes WILL be in the dugout for the vital showdown with Frank Lampard’s 19th-placed Toffees at the London Stadium. However, another bad result could see the board take action in order to avoid relegation this campaign. Like Moyes, Lampard is also facing calls for his head after Everton fell to defeat against Prem basement side Southampton. The Toffee‘s have not been relegated from the top flight since 1951. A number of teams are currently facing the prospect of relegation along with West Ham, Everton and Southampton. Just two points cover the table from bottom up to 14th. HOW TO GET FREE BETS ON FOOTBALL Bournemouth, Wolves, Leicester and Leeds could all drop into the relegation zone if results don’t go their way one weekend. Meanwhile, Nottingham Forest and Crystal Palace remain just outside of touching distance, and could easily fall into the bottom three with a few poor results. Here’s West Ham’s next five fixtures","pubDate":"2023-01-15 22:37:19","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Celtic boss Ange Postecoglou gives transfer update as he reveals how many new faces he’s after this month","link":"https://www.thescottishsun.co.uk/sport/football/10066967/celtic-postecoglou-transfer-update-new-faces/","keywords":["Football","Scottish Premiership"],"creator":["Kenny MacDonald"],"video_url":null,"description":null,"content":"ANGE POSTECOGLOU wants at least one more signing in this transfer window. Celtic have already signed Alistair Johnston, Yuki Kobayashi and Tomoki Iwata this month. ReutersAnge Postecoglout wants to add further to his Celtic squad[/caption] But Viaplay Cup semi-final scorer Giorgos Giakoumakis is edging closer to a move out of Parkhead and the club have repeatedly been linked with South Korea striker Cho Gue-sung, though reports from the Far East suggest that move has stalled. After the weekend cup victory over Kilmarnock, Postecoglou admitted: “We need to strengthen further, we need to keep getting stronger. “None of the three boys we’ve signed played on Saturday, but they’re going to add to us and hopefully we’re going to get another one in the door before the end of the window. “We worked hard at the squad this year. “Last year we had a core of players who had delivered, but I just felt we needed a stronger squad to be able to tackle what we need to tackle at this club, trying to win three domestic trophies and being in the Champions League. “There’s always the possibility guys might move on for whatever reason. “It’s not about me pushing anyone out the door, everyone has decisions to make. “If something comes on the table one of them feels strongly about we’ll discuss it, but right now I’m more about bringing in than letting them go.” Postecoglou’s side will face Rangers in the cup final on February 26. The Aussie admitted he needed to win last year’s trophy to “gain the trust” of fans at the club. He said: “When you join this football club that’s the expectation, that’s the responsibility, you have as the manager of Celtic. “I knew that last year. Even though it was my first year, there was no chance of me going a year without winning anything here. “I knew I had to lay down a marker to gain the trust and faith of everyone around me. “For us, this year is about trying to win every game we play.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-01-15 22:31:25","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Rangers ace Ben Davies determined to down Celtic to end long wait for League Cup glory","link":"https://www.thescottishsun.co.uk/sport/football/10067034/rangers-davies-celtic-league-cup-glory/","keywords":["Football","Scottish Premiership"],"creator":["Andy Devlin"],"video_url":null,"description":null,"content":"BEN DAVIES revealed Rangers are determined to end their 12-year wait for Viaplay Cup glory by dumping Celtic in next month’s final. Michael Beale’s men came from behind to beat Aberdeen in extra time. Kenny RamsayBen Davies is looking forward to playing Celtic in the final[/caption] Kemar Roofe’s winner set up a final with holders Celtic and Davies is already relishing the return to Hampden. The former Preston stopper, 27, said: “I enjoyed it out there. “It’s a good stadium. Cup finals are not something I’ve experienced loads of in my career, so it’s good to be involved in one. “I’m already looking forward to it. “It’s obviously the first cup to play for in the season and it would be good to win it. “The club won the Scottish Cup last season, so we want to win this one this year. We want to win them all! “It will be good to come back here, have a good game and hopefully we can win it.” Bojan Miovski put Jim Goodwin’s Dons in front at the break, but Ryan Jack levelled for Gers just after the hour. Dons skipper Anthony Stewart was shown a straight red card in added time at the end of the 90. And second-half sub Roofe grabbed the winner with his first goal of the season four minutes into extra time. Davies said: “We made it a longer day than we needed to, but the main thing is we are through to the final. “We have gone a goal down quite a lot this season. It’s not something we are happy with. “But quite often we react well to it and keep doing what we are trying to do, keep the ball and make chances. “We scored two good goals with good moves and, yes, two was enough in the end. “I’d have liked it to be more, but we came to get through and we are through.” The sight of Roofe leaving the field injured again — this time holding his shoulder — was the only disappointment for Davies and his team-makes. The striker, who was making only his fourth appearance of the season, will now go for a scan to assess the damage. Davies said: “I haven’t spoken to him. I don’t know what he has done, to be honest. “He took his goal really well. In training he has looked good. He is hard to train against and hard to play against. “I played against him in England and he is sharp. He knows what he is doing and he knows how to score. “So it would be a blow to us if he is out for a period. We will just have to see.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-01-15 22:29:25","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Aston Villa ‘hold talks with Arnaut Danjuma’ as Villarreal winger flies to England to seal January transfer","link":"https://www.thesun.co.uk/sport/21053599/aston-villa-talks-danjuma-loan-transfer-everton-bournemouth/","keywords":["Football","Premier League","Sport","La Liga","Transfer News"],"creator":["Tony Robertson"],"video_url":null,"description":null,"content":"ARNAUT DANJUMA has arrived in England in order to seal a transfer to the Premier League, according to reports. The Villarreal star has been granted permission by his club to travel to England for “talks” over a loan transfer. GettyArnaut Danjuma is being linked with a return to the Premier League[/caption] Danjuma is wanted by a number of clubs in January According to The Athletic, Danjuma is on the radar for a number of clubs. While they have reported the interest of Bournemouth in re-signing the Dutchman on loan, a number of other parties are also interested in a transfer. Unai Emery’s Aston Villa are one of the main sides who want to bolster their attack by signing Danjuma on loan. The 25-year-old shone in a more central role at the Yellow Submarine last season, scoring 16 goals in 34 games with Emery as his manager. And now the former Arsenal coach wants to rekindle their partnership for the rest of the season in the Premier League. However, Villa will face pressure from Bournemouth and Frank Lampard‘s Everton to seal a deal. Both the Cherries and the Toffee’s are embroiled in a relegation scrap. And neither side boasts a player with more than four goals, with Kieffer Moore and Phillip Billing on four at the Vitality Stadium and Anthony Gordon and Demarai Gray on three at Goodison Park. HOW TO GET FREE BETS ON FOOTBALL Villa have Danny Ings, but he seems to have fallen out of favour at the club since Christmas, despite his equaliser against Wolves earlier this month. With both Crystal Palace and Everton interested in signing Ings, a transfer for Danjuma may consequently trigger a move for the Englishman.","pubDate":"2023-01-15 22:21:41","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Football: Barcelona ease to 3-1 victory over Real Madrid to win Super Cup","link":"https://www.straitstimes.com/sport/football/football-barcelona-ease-to-3-1-victory-over-real-madrid-to-win-super-cup","keywords":null,"creator":null,"video_url":null,"description":"January 16, 2023 5:59 AMDominant Barca take advantage of three mistakes by Real to score.","content":"MADRID - Barcelona were crowned Spanish Super Cup champions after goals from Gavi, Robert Lewandowski and Pedri earned them a 3-1 win over bitter rivals Real Madrid in Saudi Arabia on Sunday. Barcelona were dominant in every aspect of the game and took advantage of three mistakes by Real Madrid to score. They took the lead in the 33rd minute after Real defender Antonio Ruediger passed across his own area to Barca’s Sergio Busquets, who began a move that ended with Gavi all alone inside the box to score with a precise left-foot strike. Lewandowski extended the lead 12 minutes later on the counter when Frenkie de Jong found Gavi, who ghosted in behind Real’s defensive line. He sprinted through the left channel before putting it on a plate for the Polish striker, who tapped into the back of the empty net. Real Madrid, who had no shots on target in the first half, spent most of the second in panic mode, trying to avoid a bigger defeat. Yet, once again a costly mistake allowed Barcelona to score. Substitute Dani Ceballos lost the ball in midfield and Gavi sprinted forward and crossed for Pedri to fire point-black into the empty net. Karim Benzema scored a consolation goal for Real in added time, striking home on the rebound after Marc-Andre ter Stegen denied his first attempt. REUTERS","pubDate":"2023-01-15 21:59:11","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Tottenham ‘make Leandro Trossard transfer enquiry’ as they look to snap up Belgian after Brighton banishment","link":"https://www.thesun.co.uk/sport/21052403/tottenham-transfer-news-leandro-trossard-brighton/","keywords":["Football","Premier League","Sport","Transfer News"],"creator":["Kostas Lianos"],"video_url":null,"description":null,"content":"TOTTENHAM have made a transfer enquiry for Brighton star Leandro Trossard, reports suggest. Seagulls manager Roberto De Zerbi dropped Trossard from his squad that thrashed Liverpool 3-0 on Saturday due to attitude problems. Tottenham have made a transfer enquiry for Brighton star Leandro TrossardEPA The winger then reportedly boarded a Eurostar train and headed back to Belgium. According to the Daily Telegraph, Spurs are looking to take advantage of the ongoing tension at the Amex. Tottenham contacted Brighton and made an enquiry last week but there was no progress. The Belgium international’s contract has a year’s extension that can be triggered by his club and can be taken to 2024. However, the 28-year-old’s agent Josy Comhair revealed that communication between his client and De Zerbi has broken down and a January move will be “beneficial for both parties”. But the Italian head coach has opened the door for Trossard‘s return to his team. De Zerbi said: “I want to be clear about Trossard. I’m sorry for the situation. I don’t think I’ve made a mistake with him. The people inside Brighton know very well the situation. ‘I’m fine with myself and I’m ready to open the doors for him, because he’s a good guy and a very important player for us. HOW TO GET FREE BETS ON FOOTBALL “He changes the team, but he has to understand and to work with my attitude, in my way, because I am the coach, I decide the rules inside the dressing room, only this. “I’m honest, I’m very clear. When I want to say something I speak inside the family and our family is the dressing room. I don’t want to speak about the communication of his agent, because I don’t know him, I know only Leo. “I’m ready to listen to him without a problem, because this situation is important. It’s not a bad situation, it’s a great situation, because if he learns, if we improve our way, we can only improve, and to achieve our dreams there is only one way. “To be open to improve and ready to work hard, because we are Brighton, a team of medium level in this competition, so we have to think about the team more than ourselves.”","pubDate":"2023-01-15 21:54:22","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Celtic release details on how fans can watch Frank McGarvey’s funeral online","link":"https://www.thescottishsun.co.uk/sport/football/10066875/celtic-details-mcgarvey-funeral/","keywords":["Football","Celebrity deaths","funeral","Scottish Premiership"],"creator":["Graeme Macpherson"],"video_url":null,"description":null,"content":"CELTIC have released details on how fans can watch Frank McGarvey’s funeral online. The former Hoops and St Mirren striker sadly passed away from cancer recently at the age of 66. 1 Frank McGarvey will be laid to rest tomorrow McGarvey will be laid to rest tomorrow following a service at St Anthony’s Church in the southside of Glasgow. And Celtic have now provided a link for anyone wishing to follow the requiem mass service on YouTube. They wrote on Twitter: “The funeral of #CelticFC icon Frank McGarvey can be viewed on the link below tomorrow (Monday, January 16) at 1pm. “Our thoughts and prayers continue to be with the family and friends of Frank at this difficult time. Read More Football BILL LECKIE Teams like Kilmarnock don't get decisions like that against Celtic or Rangers TURF WAR Rangers boss Michael Beale slams state of Hampden pitch for 'showpiece game' “RIP. Frank. YNWA.” His family had revealed in October that he had been diagnosed with cancer and McGarvey appeared on the pitch at Parkhead to salute the fans during a 6-1 win over Hibs. He passed away on January 1. McGarvey began his career at the Buddies in 1974 and was one of Fergie’s Furies, the exciting team managed by Alex Ferguson that won promotion to the Premier League in 1977. He moved south to Liverpool in 1979 but only stayed for 10 months, signing for Celtic in 1980 where he would spend five seasons with his boyhood heroes making 245 appearances and scoring 109 goals. Most read in Football TURF WAR Rangers boss Michael Beale slams state of Hampden pitch for 'showpiece game' BOOT HIM OUT Shocking moment fan KICKS Aaron Ramsdale after Arsenal beat Tottenham BRUTAL Ally McCoist speechless after Stewart horror tackle in Gers' clash with Aberdeen VIDEO NASTY Rangers and Aberdeen semi suffers tech meltdown as VAR fails at crucial point With Celtic he won two league titles, two Scottish Cups and a League Cup – scoring the goal that won the 1985 Scottish Cup final against Dundee United. He returned to Saints that summer, scoring the winning goal against Hearts in the Scottish Cup semi-final in 1987 then helping Alex Smith’s men win the final against Dundee United. He was named player/assistant manager the following year and made his final appearance before moving on to Queen of the South and later Clyde, Shots Bon Accord and Troon. The striker was also capped seven times for Scotland. Celtic said at the time of his passing: “The thoughts and prayers of everyone at Celtic are with Frank's family at this extremely sad time.\" Saints wrote: “Frank will be forever remembered at St Mirren and our deepest condolences are with his loved ones at this time.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-01-15 21:54:15","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Michigan football getting a pair of guards back for nation's top offensive line","link":"http://rssfeeds.freep.com/~/724530620/0/freep/sports~Michigan-football-getting-a-pair-of-guards-back-for-nations-top-offensive-line/","keywords":null,"creator":["Andrew Hammond"," Detroit Free Press"],"video_url":null,"description":"Michigan guards Trevor Keegan and Zak Zinter, members of the only offensive line to win back-to-back Joe Moore awards are back for the 2023 season.       ","content":null,"pubDate":"2023-01-15 21:52:22","image_url":"https://www.gannett-cdn.com/presto/2022/12/31/PDTF/17fd12f6-4235-4f32-90e9-d3e5eeb7290d-MICHTCU_123122_kd_820.jpeg","source_id":"freep","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Tottenham vow to ban supporter who kicked Arsenal goalkeeper Aaron Ramsdale following north London derby","link":"https://metro.co.uk/2023/01/15/tottenham-vow-to-ban-supporter-who-kicked-arsenal-goalkeeper-aaron-ramsdale-18104924/","keywords":["Football","Sport","Aaron Ramsdale","Arsenal FC","Football Association","Mikel Arteta","Premier League","Tottenham Hotspur FC"],"creator":["Tony Mogan"],"video_url":null,"description":"Spurs have slammed the 'wholly unacceptable behaviour'.","content":"Ramsdale was dragged away by his manager and teammates (Picture: Getty) Tottenham have vowed to ban the supporter who aimed a kick at Arsenal goalkeeper Aaron Ramsdale following Sunday’s north London derby. Arsenal eased to a 2-0 win over their arch-rivals to extend their lead at the summit of the Premier League to eight points on Sunday. There were chaotic scenes after the final whistle however when Ramsdale was targeted by a fan who made his way down from the stands and appeared to kick the goalkeeper. Ramsdale was eventually dragged away by manager Mikel Arteta to celebrate with Arsenal fans at the other end of the pitch. Tottenham have condemned the actions and promised to take ‘the strongest action possible’ against the supporter. A statement from the club read: ‘We are appalled by the behaviour of a supporter that attempted to attack Arsenal goalkeeper Aaron Ramsdale at the end of today’s match. Violence in any form has no place in football. ‘The Club has reviewed its CCTV footage to identify the supporter and will be working with the Met Police, Arsenal and Aaron Ramsdale to take the strongest possible action, including an immediate ban from Tottenham Hotspur Stadium.’ A statement from the FA meanwhile read: ‘We strongly condemn the incident involving a spectator followed today’s Premier League fixture between Tottenham Hotspur and Arsenal. Arsenal sealed an dominant win away from home (Picture: Getty) ‘This is wholly unacceptable behaviour and we will work together with the police, the relevant authorities and the clubs to ensure the appropriate action is taken.’ Ramsdale kissed Arsenal badge on his shirt before approaching the advertising boards to pick up his water battle where the incident took place. The England international turned in a man of the match performance to help the Gunners seal the huge victory and insisted he and his teammates would have the last laugh back in the dressing room. ‘The Spurs fans were giving me some stick in the second half so I was giving them some back,’ Ramsdale told Sky Sports. ‘The few people that I did do it to, it was probably well greeted, sportsmanship-like. Then a fan tried to jump over and give me a little punch in the back. That’s what happened and it’s a shame because it is just a game of football at the end of the day. He continued: ‘I think both sets of players tried to bring me away. Thankfully nothing happened too drastically but it is a sour taste but I am sure we will enjoy it when we go back in the dressing room.’ MORE : Richard Keys blames Mikel Arteta’s ‘inflammatory behaviour’ after Arsenal goalkeeper Aaron Ramsdale is kicked by Tottenham supporter MORE : Paul Merson believes Arsenal will move for Barcelona winger Raphinha after missing out on Mykhailo Mudryk For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2023-01-15 21:49:33","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Gavi masterclass helps secure Xavi his first trophy as Barcelona boss with victory against Real Madrid in Super Cup","link":"https://www.thesun.co.uk/sport/21053478/barcelona-win-spanish-super-cup-real-madrid-gavi/","keywords":["Football","La Liga","Sport"],"creator":["Frankie Christou"],"video_url":null,"description":null,"content":"GAVI handed Xavi his first trophy as Barcelona boss with a devastating El Clasico performance in the Spanish Super Cup. The 18-year-old midfielder showed shades of his manager with a silky strike and two tasty assists to leave defending champions Real Madrid startled in Riyadh, Saudi Arabia. AFPBarcelona won the Spanish Super Cup in Saudi Arabia[/caption] Teenage sensation Gavi was superb for BarcaAFP ReutersIt’s Xavi’s first trophy as Barcelona manager[/caption] It hands Xavi his maiden piece of silverware as manager after lifting 25 trophies during his 17-years as a player at Nou Camp. Despite being held in the Middle East the fixture still had the same bite as Barca defender Ronald Araujo clattered into Vinicius Jr early on. Xavi’s side wasted no time in taking the game to Madrid as defender Araujo arrived at the back post to test Los Blancos keeper Thibaut Courtois with a header. Madrid’s midfield veterans Toni Kroos and Luka Modric were run ragged by Barca’s young midfield pivot of Gavi and Pedri. The Catalan giants could have been playing in the red and white stripes of Stoke City and you would have known it was them. The young midfielders had Xavi’s side dancing in the Saudi desert as Courtois forced a low Robert Lewandowski strike onto the woodwork. But the big Belgian had no hope of keeping out Gavi’s opener on 34 minutes. The teenage prodigy latched onto the end of a quick counter move and coolly slotted home. HOW TO GET FREE BETS ON FOOTBALL And after continuing dominating possession Barca’s sand-storm left Madrid in a whirlwind as the second arrived on the stroke of half-time. This time Gavi turned provider after he teed up Lewandowski with a slick cut back to allow the Pole to slot into an empty net. Even when Carlo Ancelotti came out after the break the Italian remained cool, calm and collected. But his eyebrow must have been raised when Ousmane Dembele raced onto Alejandro Balde’ through-ball to force Courtois into a snap save with his feet. Gavi showed no signs of slowing down as he continued to glide around the field with the ball super glued to his boots. The small Spaniard then got his midfield partner involved with the goals after a through ball set Pedri on his way to add a third. The Saudi crowd began dishing out ‘Oles!’ before Karim Benzema silenced them with a late consolation. But it was too little too late. And with Barca having a three-point lead the the top of La Liga ahead – Xavi may just have the Catalan giants purring again. ReutersBarcelona celebrate after their Super Cup triumph[/caption]","pubDate":"2023-01-15 21:44:47","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"A-League football: Emma Rolston sent off as Wellington Phoenix women fall to Perth Glory","link":"https://www.newstalkzb.co.nz/news/sport/a-league-football-emma-rolston-sent-off-as-wellington-phoenix-women-fall-to-perth-glory/","keywords":null,"creator":null,"video_url":null,"description":"Football Fern Emma Rolston saw red as the Wellington Phoenix fell to a 2-0 defeat to the Perth Glory in their A-League clash in Western Australia. Both teams had to play the majority of the match with 10 players after Phoenix forward Rolston and Glory midfielder Ella Mastrantonio were both sent off for a heated clash in the 34th minute. The altercation started when Mastrantonio kicked a prone Rolston after she was brought down in a tackle. Rolston got up and reacted by trying to push Mastrantonio away as both players got into a scuffle, ending with the Kiwi forward pushing her hand into her opponent’s in the face. Referee Casey Reibelt sent both players off, with Rolston now set to miss the Phoenix’s next clash at home to Canberra United next Sunday. Phoenix forward Emma Rolston pushes Glory midfielder Ella Mastrantonio in the face as both players are sent off. Photo / Getty The Phoenix were already down 2-0 before the red cards as they were punished for a couple of early mistakes in the opening quarter of an hour. American striker Cyera Hintzen scored from the Glory’s first shot in the sixth minute. Perth then earned a penalty in the 13th minute and Susan Phonsongkham converted from the spot. Despite their best efforts when it was 10 against 10, Wellington were unable to unlock the Perth defence and find a way back into the match. “We got punished for two mistakes which … we’ve got to hold ourselves accountable for,” Phoenix head coach Natalie Lawrence said after the game. “We need to stop making these mistakes that are leading to these goals and start taking our chances as well.” Lawrence refused to blame the longest road trip in a professional women’s football league for the result. “We knew that the travel was going to be tough, we knew that the heat was going to be tough and we prepared as much as we could for it. “There’s some fatigue amongst the girls [and] there’s a little bit of jet lag, but that’s not really an excuse that we’re willing to hide behind. “New Zealand is where we want to be and where we want to be based and travel is part of it.” The defeat means the Phoenix remain the only winless side in the league and are now six points adrift at the bottom of the table, with just one point from eight matches. Lawrence felt the team “dominated” after the two red cards. “We had more possession, we had better pass completion, we’ve had more shots, we’ve had more final third entries again than any other game this season so we’re building and getting better and better. “Game eight and yeah one point on the board but … we believe that we’ve still got 10 games to fight for. “As long as we keep sticking to our process then we believe the outcome will happen.”","content":null,"pubDate":"2023-01-15 21:28:40","image_url":"https://www.newstalkzb.co.nz/media/wkilvnsk/phoenix-forward-emma-rolston-pushes-glory-midfielder-ella-mastrantonio-in-the-face-as-both-players-are-sent-off-getty.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"'Certain clubs feel big': Tim Howard makes Aston Villa and Leeds United claim","link":"https://www.hitc.com/en-gb/2023/01/15/certain-clubs-feel-big-tim-howard-makes-aston-villa-and-leeds-united-claim/?utm_source=rss&utm_medium=rss&utm_campaign=certain-clubs-feel-big-tim-howard-makes-aston-villa-and-leeds-united-claim","keywords":["Aston Villa","Competitions","Football","Leeds United","Premier League","Teams","unai emery"],"creator":["Amir Mir"],"video_url":null,"description":"Tim Howard has stated that ‘certain clubs feel big’ and he thinks Aston Villa fall into that bracket after playing against them during his career... The post 'Certain clubs feel big': Tim Howard makes Aston Villa and Leeds United claim appeared first on HITC.","content":"Tim Howard has stated that ‘certain clubs feel big’ and he thinks Aston Villa fall into that bracket after playing against them during his career and now watching them from afar. The former Premier League goalkeeper thinks Unai Emery’s side, just like Jesse Marsch’s Leeds United, have the minerals to be a top-six club. But he thinks those at Villa Park are currently ahead of the Yorkshire side because of the amount of time they spent outside of England’s top-tier. Photo by VISIONHAUS Whilst Villa dropped down to the Championship for three seasons, it was a near-20-year wait for Leeds to return to the big time under their legendary coach, Marcelo Bielsa. Both clubs have a fine and deep-rooted history in English football, but in recent times, they just haven’t been able to match those past successes. Tim Howard thinks the good old days could return, as he shared why he thinks Emery is the perfect manager for a team like Villa, as he told NBC. “I have even played cup semi-finals at Villa Park,” said Howard. “Villa is the biggest club in the Midlands. It is tailor-made to be one of the big six. “We see it happening up at Newcastle. When you have played up and down the country like I have. Certain clubs feel big. Villa Park and Aston Villa feels big. “The fanbase is there. The stadium is there. Often they have had teams down the years that have been champion-calibre teams. “I like the manager in Unai Emery. I like that he is a builder. He has won. He didn’t have a great time at Arsenal, but he has won in Europe. I think this is an opportunity for him to build the club forward. “Leeds have been away for so incredibly long that it’s almost like, I know the history, but you have been away for too long. You have to build. Focus on finishing the top ten. If you can do that, then focus on getting into Europe. I think it’s really difficult for Leeds to do that instantly.” Photo by Neville Williams/Aston Villa FC via Getty Images VILLA ARE AHEAD OF LEEDS Things can change pretty quickly, but in terms of building blocks, Villa will feel they are currently ahead of Leeds United. The Midlands outfit beat the relegation-threatened outfit on Friday night at Villa Park, even though the away side were the better team. But Leeds need to get out of the relegation dogfight near the bottom and have some sort of stability that will allow them to look forward, just like Villa are trying to do now under their trophy-laden coach. The post 'Certain clubs feel big': Tim Howard makes Aston Villa and Leeds United claim appeared first on HITC.","pubDate":"2023-01-15 21:15:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Barcelona fear transfer for Aubameyang from Chelsea will be blocked due to ‘Dani Ceballos rule’","link":"https://www.thesun.co.uk/sport/21051624/barcelona-fear-aubameyang-transfer-blocked-chelsea/","keywords":["Football","Premier League","Sport","Barcelona transfer news","Chelsea transfer news","La Liga"],"creator":["Giacomo Pisa"],"video_url":null,"description":null,"content":"BARCELONA are reportedly looking into the possibility of re-signing Pierre-Emerick Aubameyang from Chelsea. The 33-year-old has endured a miserable spell at Stamford Bridge since arriving from the Nou Camp in September. GettyBarcelona are reportedly keen on bringing Pierre-Emerick Aubameyang back to the club[/caption] And Barca are keen on bringing Aubameyang BACK to the club already. However, the La Liga side fear they are legally unable to re-sign him, according to the Telegraph. They are said to be looking into whether they are legally allowed to pursue a move for the out of favour striker. Fifa rules say Aubameyang can only play for Chelsea or Barcelona this season. But four years ago Dani Ceballos tried to move back to Real Betis on loan from Real Madrid in January, having only swapped Betis for the Bernabeu a matter of months previously. However, Article 126.5 of the Spanish FA’s rulebook says players who have had their licence cancelled can’t get a new one of the same club in the same season. Aubameyang played once for Barca this season before joining Chelsea. So the club are fearful he legally won’t be able to play for them again this campaign. BETTING SPECIAL – BEST FOOTBALL BETTING SITES IN THE UK Aubameyang has failed to impress since joining Chelsea in £10million deal on a two-year contract. He has scored just once goal in 10 Premier League games, and has not started a match since November. Spanish outlet AS say Aubameyang is desperate to return to Barcelona no matter the cost.","pubDate":"2023-01-15 21:14:49","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Stade Rennais - PSG en direct : Rennes ouvre le score !","link":"https://www.butfootballclub.fr/ligue-1/stade-rennais-psg-en-direct-le-live-du-match-803351","keywords":null,"creator":null,"video_url":null,"description":"Ce dimanche soir (20h45, sur Prime Vidéo), le choc entre le Stade Rennais et le PSG clôt la phase aller du championnat de Ligue 1 (19e journée) au Roazhon Park. Un match que nous vous proposons de suivre en live commenté sur But! Football Club.","content":null,"pubDate":"2023-01-15 21:09:00","image_url":"https://static.butfootballclub.fr/16/2023/01/photo_article/803351/319012/1200-L-stade-rennais-psg-en-direct-le-live-du-match.jpg","source_id":"butfootballclub","country":["france"],"category":["sports"],"language":"french"}]}