{"newsArray":[{"title":"Bellingham ‘irreplaceable’, says Dortmund boss","link":"https://www.capitalfm.co.ke/sports/2023/01/26/bellingham-irreplaceable-says-dortmund-boss/","keywords":["Football","Kenya","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"BERLIN, Germany, Jan 25 – Borussia Dortmund sporting director Sebastian Kehl on Wednesday said the club wants to hold onto English teen star Jude Bellingham “for a long time”. Bellingham, 19, has already captained Dortmund, and an impressive World Cup in Qatar has several of Europe’s biggest clubs queueing up to secure his services. Speaking […] The post Bellingham ‘irreplaceable’, says Dortmund boss appeared first on Capital Sports.","content":"Bellingham, 19, has already captained Dortmund, and an impressive World Cup in Qatar has several of Europe’s biggest clubs queueing up to secure his services. Speaking with Sky Germany, Kehl said “there have been no inquiries at the moment” for the “irreplaceable” midfielder. “If you saw him last weekend, with the focus and the passion that he has on the pitch (you’d see) that he is irreplaceable for us at the moment.” Kehl said that Dortmund hope to keep Bellingham, but could not promise he will stay. “From a sporting perspective, I would be thrilled if the boy would stay and would stay a long time at Borussia Dortmund. “But I can’t predict how the situation will develop over the next few months.” Kehl refused to speculate on reports in the German press that Dortmund had offered to make Bellingham the club’s best-paid player in order to keep him at the club. “The lad is totally focused on football, on Dortmund,” he insisted. Bellingham, who sat out Dortmund’s last-minute 2-1 win at Mainz on Wednesday night, after picking up a yellow card in Sunday’s win over Augsburg, will be free to return in Sunday’s clash with Leverkusen.","pubDate":"2023-01-26 01:30:52","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Football: Rashford stars as Man Utd beat Forest to close in on League Cup final","link":"https://www.straitstimes.com/sport/football/football-rashford-stars-as-man-utd-beat-forest-to-close-in-on-league-cup-final","keywords":null,"creator":null,"video_url":null,"description":"January 26, 2023 6:19 AMMarcus Rashford netted his 18th goal of the season in the sixth minute to silence an expectant crowd.","content":"NOTTINGHAM - Marcus Rashford scored a dazzling solo goal as Manchester United beat Nottingham Forest 3-0 in the first leg of their League Cup semi-final on Wednesday to virtually book a place at Wembley next month. The England man, enjoying a purple patch following the World Cup, netted his 18th goal of the season in the sixth minute to silence an expectant crowd at the City Ground. New United loan signing Wout Weghorst scored his first goal for the club just before half-time to put the visitors in total control and Bruno Fernandes made it 3-0 late on. “I’m happy with the performance, over 90 minutes we controlled the game,” United coach Erik ten Hag said. “There was one moment which could have changed the game and we have to be aware of that and improve. “In this mood and with this spirit, he (Rashford) is unstoppable. He can be creative in the final third, to do something in the final third, some crazy stuff, fantasy and adventure.” His men are hot favourites to reach Wembley as they seek to end their six-year trophy drought, with either Newcastle or Southampton lying in wait. The second leg will take place at Old Trafford on Feb 1. Ten Hag, in his first season at the club, has revitalised United, but will be desperate to win silverware to appease the hungry fans. Brazil midfielder Casemiro was back in the United starting line-up after being suspended for Sunday’s 3-2 Premier League defeat at leaders Arsenal, which left United fourth in the table. Forest, with new boy Danilo in the starting line-up, came into the match full of confidence after just one defeat in their past seven Premier League matches had lifted them to 13th in the table. But the visitors took control immediately and opened the scoring in style. Rashford picked up the ball in his own half and raced down the left, cutting into the box between Joe Worrall and Remo Freuler before beating Wayne Hennessey at his near post with a powerful left-footed shot. Brazil winger Antony went close to making it 2-0 minutes later as United threatened to overwhelm the home team. Forest, who have won the League Cup four times, thought they had equalised midway through the first half when Sam Surridge produced a fine finish after a rampaging run through the middle by Morgan Gibbs-White. But the goal was ruled out by VAR for a tight offside against Surridge. Gustavo Scarpa stung David de Gea’s hands with an audacious volley as Forest increasingly came into the game, with Gibbs-White and Brennan Johnson a threat. But five-time winners United doubled their lead just before half-time, with Dutch forward Weghorst reacting smartly to fire home with the outside of his right foot after Hennessey had denied Antony. United supporters in the away end were singing “Wembley” at the interval and their dreams of returning to the famous old stadium for February’s final continued after the break. United were largely untroubled in the second half, coming agonisingly close to extending their lead when Christian Eriksen rattled the crossbar from the edge of the box in the 54th minute. The visitors continued to threaten sporadically and rounded off a comfortable night when Fernandes slotted home after a clever pass from substitute Anthony Elanga. “Obviously, it was a disappointing scoreline,” Forest coach Steve Cooper said. “The last thing you want to do is go to Old Trafford with this result. “Obviously, Rashford is one of the in-form players in the country, but for us to allow him to do what he did is not good enough.” Newcastle, chasing their first domestic trophy since 1955, beat Southampton 1-0 on Tuesday in their first-leg match. AFP, REUTERS","pubDate":"2023-01-25 22:19:32","image_url":null,"source_id":"straitstimes","category":["sports"],"country":["singapore"],"language":"english"},{"title":"Al Hammadi: Al Dhafra’s return to the “safe zone” is a matter of time","link":"https://thenewsglory.com/al-hammadi-al-dhafras-return-to-the-safe-zone-is-a-matter-of-time/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"The supervisor of the first team at Al Dhafra Club, Hassan Al Hammadi, said that the team began to regain its balance in the ADNOC Professional League, and that it came out with many gains, after the important victory it achieved with two goals for a goal in the last 13 round at the expense […]","content":"The supervisor of the first team at Al Dhafra Club, Hassan Al Hammadi, said that the team began to regain its balance in the ADNOC Professional League, and that it came out with many gains, after the important victory it achieved with two goals for a goal in the last 13 round at the expense of the Dibba Al Fujairah team, with whom it shares the suffering in the “bottom”. league this season. This victory allowed Al Dhafra to advance slightly on the points level, as it raised its tally to seven points in the penultimate position, leaving the last place for Dibba with only four points. Al-Hammadi told Emirates Today, “It is only a matter of time before Al Dhafra returns to the safe area in our league.” He continued, “The victory over Dibba and leaving the last place gave a great and important incentive to all the Al Dhafra Club family, as the team set its foot on the right path to move forward towards the safe area.” He added, “The match revealed the presence of important elements that were optimally invested, from distinguished players, as well as the desire of the players and the technical staff to prove their presence and take responsibility for providing the best performance and scoring goals so that the winning streak continues.” He also said: “We will not measure the result of the match with Dibba, but rather we will invest in the data and gains it yielded, including the outstanding performance of the players, and their desire to win by citizens and foreigners. It also showed the importance of the changes that were made in the winter transfer period.” And he continued: «We are pleased that all members of the system are looking forward to success and a return to the front, and this is the most important thing that the club and the football company’s managements bet on, and our confidence is high in the team, and we also realize that the misfortune that was inherent to him will leave him, and the team will return to shine in the coming period». Al Dhafra separates a point from the 12th-placed Al-Nasr team, and six points from the 11th Al-Bataeh team. Al-Nassr sporting director speaks o... Please enable JavaScript Al-Nassr sporting director speaks on Cristiano Ronaldo case Al Dhafra awaits difficult matches in the coming period, as it faces Al Nasr during the 14th round, and it will be a difficult match for both sides, in light of the improvement that occurred in their levels, as Al Nasr succeeded in a draw with Sharjah, and was ahead in the score, while Al Dhafra won against Dibba. Al Dhafra avoided relegation at the end of last season, and does not want to repeat the same scenario, and seeks to improve its position and reach the middle of the standings during the coming period. • Al Dhafra faces Al Nasr in a difficult match for both sides during the 14th round, especially since Al-Ameed is ahead of Al Dhafra by only one point. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2023-01-25 22:05:00","image_url":null,"source_id":"thenewsglory","category":["sports"],"country":["india"],"language":"english"},{"title":"CAN U17 : La date et lieu du tirage au sort devoilés !","link":"https://wiwsport.com/2023/01/25/can-u17-la-date-et-lieu-du-tirage-au-sort-devoiles/","keywords":["Equipe nationale Football","U-17"],"creator":null,"video_url":null,"description":"(wiwsport) - La Confédération Africaine de Football (CAF) a annoncé la date du tirage au sort de l’édition 2023 de la Coupe d’Afrique des Nations réservée aux joueurs de moins de 17 ans qui aura lieu du 29 avril au 19 mai 2023, en Algérie. La cérémonie se tiendra le mercredi 01 février au Cercle National de […] Cet article a été initialement publié sur wiwsport : site n°1 de l'actualité sportive du Sénégal (wiwsport.com). Article source : CAN U17 : La date et lieu du tirage au sort devoilés !","content":"La Confédération Africaine de Football (CAF) a annoncé la date du tirage au sort de l’édition 2023 de la Coupe d’Afrique des Nations réservée aux joueurs de moins de 17 ans qui aura lieu du 29 avril au 19 mai 2023, en Algérie. La cérémonie se tiendra le mercredi 01 février au Cercle National de l’Armée à Alger, en Algérie à partir de 12h00 heure locale (11h00 GMT, 13h00 heure du Caire) et sera retransmise en direct sur les plateformes numériques de la CAF et les chaînes de télévision partenaires. Le tirage au sort fait suite aux qualifications qui se sont déroulées sur tout le continent. Onze équipes dont le Sénégal, ont rejoint l’Algérie, pays hôte, pour le tournoi final des moins de 17 ans : le Maroc, le Nigeria, le Burkina Faso, le Mali, la Somalie, l’Afrique du Sud, le Soudan du Sud, le Congo et la Zambie. Les douze équipes seront réparties dans trois groupes de quatre. Les quatre demi-finalistes seront directement qualifiées pour la Coupe du monde de la catégorie prévue la même année au Pérou La Coupe d’Afrique des Nations U-17 se déroulera en Algérie du 29 avril au 19 mai dans les villes d’Alger, Constantine et Annaba qui accueillent actuellement le Championnat d’Afrique des Nations. Après 2011 et 2019, le Sénégal emmené par Serigne Saliou Dia, disputera pour la troisième fois de son histoire cette compétition, il n’a jusqu’ici jamais dépassé les phases de groupes. wiwsport.com","pubDate":"2023-01-25 21:48:37","image_url":null,"source_id":"wiwsport","category":["sports"],"country":["senegal"],"language":"french"},{"title":"Rob Vanstone: Could the Roughriders cash in by avoiding a big-money quarterback?","link":"https://leaderpost.com/sports/football/cfl/saskatchewan-roughriders/rob-vanstone-could-the-roughriders-cash-in-by-avoiding-a-big-money-quarterback","keywords":["CFL","Football","Saskatchewan Roughriders","Sports"],"creator":["Rob Vanstone"],"video_url":null,"description":"The Roughriders' offensive productivity decreased as Cody Fajardo's salary increased. Is there a lesson to be learned moving forward?","content":"Article content The pool of prospective Saskatchewan Roughriders starting quarterbacks is shallower than an episode of Cash Cab. Article content We apologize, but this video has failed to load. Try refreshing your browser, or tap here to see other videos from our team . Rob Vanstone: Could the Roughriders cash in by avoiding a big-money quarterback? Back to video Dane Evans , who will soon be unloaded by the Hamilton Tiger-Cats following their high-profile signing of Bo Levi Mitchell, looms as the leading candidate to replace Cody Fajardo behind centre with the Green and White. Article content The Roughriders’ brass has clearly stated its intention to enter training camp with a veteran quarterback. Unless Trevor Harris surprisingly opts against remaining with the Montreal Alouettes, Evans would be the best established option. The only option, quite conceivably. This could put the Roughriders in a leverage-deprived position whereby Evans is unavoidably overpaid, simply because he is available and the team is desperate. After a 6-12 season, head coach Craig Dickenson and general manager/vice-president of football operations Jeremy O’Day — both of whom are on expiring contracts — are under the gun. Article content Unless there is a significant improvement, both men will almost certainly be replaced following (or perhaps during) the 2023 season. Ergo the seeming imperative of landing a seasoned passer who, save for one glorious day when he threw five touchdown passes, did not enhance his resume in 2022. This would, under different circumstances, be the ideal time to nurture a younger quarterback and take a longer-term approach to a multi-pronged rebuilding process. But such a mindset would be incongruent with the realities that face O’Day and Dickenson, both of whom are in win-now mode. One does wonder, however, whether adherence to the conventional model might ultimately seal the fates of O’Day and Dickenson. Suppose that O’Day acquires Evans from Hamilton and simply assumes the terms of an extant deal — one that included provisions for $417,000 in hard money in 2022, according to figures published by 3DownNation.com. Article content One option would be to re-work the contract, but how low could they reasonably go? A quarterback of Evans’ experience could still be in line for, say, $350,000-plus under a restructured deal. Is that money well-spent? In a salary-capped world, maybe there is a case for spending substantially less than the conventional wage for a quarterback. We remind you of 2019, when Fajardo took home a reported $150,000 while helping Saskatchewan post a 13-5 record and finish first in the West Division. The results diminished as Fajardo’s compensation increased. During the COVID-shortened season of 2021, he made somewhere in the vicinity of $400,000 (pro-rated over a full 18 games) for an offensively challenged Saskatchewan side that went 9-5. Article content Fajardo’s hard-money total swelled to $467,000 in 2022, when the Roughriders imploded after a 4-1 start. (All the dollar data is, we remind you, courtesy of 3DownNation.) By season’s end, Fajardo had been benched, even though his struggles were symptomatic of considerably larger problems. The offensive line, for example, was a season-long sieve. The receiving corps lacked explosiveness. So what was Fajardo to do? Ultimately, did he pay the price for his price tag? Suppose that O’Day had been blessed with an additional six figures at his disposal while assembling a roster in advance of the 2022 season. Would the additional money have helped the Roughriders’ GM solidify the offensive line and/or add a playmaker or two? Article content If O’Day and his cohorts on the player-personnel side had been able to find a defensive back who was actually familiar with the concept of an interception, would the field position have provided some short fields for Fajardo and associates? When the pass rush cratered after a robust start to the season, would a few more available dollars have enabled O’Day to make a trade or entice a difference-making NFL cut to venture northward? Although we are immersed in a speculating frenzy, this much is irrefutable: Over three seasons under O’Day and Dickenson, the Roughriders’ offence was at its best when the quarterback was paid the least. Remember, too, that Saskatchewan had previously finished first in 2009, when quarterback Darian Durant was at the lower end of his earning power. (Durant made roughly $250,000 in 2009. Even in 2013, when he quarterbacked Saskatchewan to a championship, the wage was a below-market $325,000.) Article content Then there is the case of Nathan Rourke, whose hard money for 2022 was quoted at (get this) $71,500 by 3DownNation’s ubiquitous Justin Dunk. As a Canadian draftee, Rourke was available for a pittance, taking the CFL’s economics into account. It is unrealistic to think that a serviceable five-figure option is available for the Roughriders. However, what if they were to spend somewhere between $200,000 to $250,000 (including playing-time bonuses) for an as-yet-unproven quarterback of considerable promise? Would that have a liberating effect on O’Day? Could he address a multitude of deficiencies by resisting any temptation to pay big money for someone else’s discard? Could the organization, as a whole, sell something called hope? Article content So much needs to be done, after all, and the field general — despite his prominence — is only one element of the equation. If the Roughriders cannot significantly upgrade the offensive line and the receiving corps, the inevitable result will be a sitting-duck quarterback and a lame-duck regime. rvanstone@postmedia.com twitter.com/robvanstone The sports world is ever-changing, as are the times. Supplement your steady diet of sports coverage by subscribing to the Regina Leader-Post’s 306 Sports Fix newsletter. Each week, sports editor Rob Vanstone will provide additional commentary on the Roughriders, Pats and other teams/sports of interest, along with a peek behind the curtain. Click here to subscribe. Recommended from Editorial Rob Vanstone: Roughriders painted themselves into a corner at quarterback Rob Vanstone: Dane Evans is Roughriders' likeliest option at quarterback","pubDate":"2023-01-25 20:33:26","image_url":null,"source_id":"leaderpost","category":["sports"],"country":["canada"],"language":"english"},{"title":"Detroit Lions NFL mock draft 2023: Mel Kiper beefs up defense with both first-round picks","link":"http://rssfeeds.freep.com/~/725480732/0/freep/sports~Detroit-Lions-NFL-mock-draft-Mel-Kiper-beefs-up-defense-with-both-firstround-picks/","keywords":null,"creator":["Marlowe Alter"," Detroit Free Press"],"video_url":null,"description":"Mel Kiper Jr. of ESPN has Detroit Lions getting defensive with both the sixth overall pick and the 18th overall pick in 2023 NFL mock draft.       ","content":"One of the NFL's preeminent draft analysts has released his first 2023 mock draft. And with two first-round picks for the Detroit Lions , we'd be doing a disservice to ignore the information, even if we're still three months out from names being called and daps being delivered by commissioner Roger Goodell live in Kansas City. So let's break it down: Mel Kiper Jr. of ESPN has the Lions going defense with pick Nos. 6 and 18 on April 27. First, note Kiper did not project any trades — \"It's still a little bit early to assess which teams could move up and what it would take to get there,\" he noted — and has three quarterbacks going in the first five picks: Ohio State's C.J. Stroud to Houston at No. 2, Alabama's Bryce Young to Indianapolis at No. 4 and Kentucky's Will Levis to Seattle at No. 5. Despite Kiper picking Stroud to Houston, he actually has him third on his QB board , \"barely\" behind the other two, and admits \"it's going to be a close race through April.\" He sees Stroud as the best fit for Houston due to his accuracy and \"excellent touch at every level of the field.\" BIG DECISION LOOMING: Jonah Jackson, up for contract extension, 'would love to be a Lion forever' Seattle is the big question near the top of the draft, awaiting a decision on pending free agent Geno Smith. Kiper suggests the Seahawks could franchise tag him and coach up Levis — an admittedly polarizing prospect. \"There will be a general manager in the top 10 who sees Levis' positives over the negatives,\" Kiper wrote, adding Levis is ahead of fellow rookie QBs in learning a pro-style offense, because he played in one at Kentucky. That sets the table for the Lions at No. 6 via the Matthew Stafford-Jared Goff trade with the Los Angeles Rams two years ago. Detroit's defense, Kiper points out, ranked 32nd in the NFL in yards per play allowed (6.2) and opponent QBR (55.9), so you know where he's going with this pick. The question is, which prospect? How about a rare Big 12 defender in Texas Tech's Tyree Wilson , whom Kiper calls the top true defensive end in the class. DAVE BIRKETT: Ranking the Lions' 15 unrestricted free agents: WR DJ Chark tops the list \"He can use his burst at the snap to beat offensive tackles on passing downs or use his 6-foot-6 frame to hold up against the run,\" Kiper writes . \"An edge-rushing duo of Wilson and Aidan Hutchinson would be formidable, with surprise rookie James Houston working in on obvious passing downs.\" Wilson, 275 pounds and from Henderson, Texas, had 61 tackles (36 solo), including 14 for a loss and seven sacks in 10 games before a foot injury which required surgery ended his season. His Red Raiders bio says he \"benefited greatly from the switch to an edge rusher position in defensive coordinator Tim DeRuyter’s scheme.\" Wilson, in 538 defensive snaps, was given a 74.5 grade from Pro Football Focus in 2022, and his 50 QB pressures was among the national leaders. Kiper doesn't rule out the Lions going with a QB if they fall in love with a prospect that remains available with this first pick, though in this scenario, the top three are already taken. \"General manager Brad Holmes likely will take a close look at this (QB) class and weigh each passer against veteran Jared Goff,\" Kiper writes. At No. 18, Kiper has the Lions select Oregon cornerback Christian Gonzalez , who seems to be a popular pick for the Lions' needy secondary. READ MORE: Lions fans must not only accept losing key contributors. They must embrace it \"Gonzalez was a lockdown defender at Colorado before transferring to Oregon last year, where he picked off four passes and improved every week,\" Kiper writes. \"He's going to test really well at the combine in March, too. This pick makes too much sense for a Detroit defense that badly needs an infusion of young talent in the secondary.\" Gonzalez, a redshirt sophomore from The Colony, Texas, is big at 6-2 and 201 pounds. He was named this season to the All-Pac-12 first team by league coaches, and All-Pac-12 second team by the Associated Press and PFF. He finished with 50 total tackles and 118 return yards on his four interceptions. He tied for sixth in the conference with 11 passes defended, and earned an 81.2 overall grade from PFF, fourth among Pac-12 cornerbacks, and 81.4 coverage grade, also fourth. Back to the top: Kiper has the Chicago Bears taking Georgia defensive lineman Jalen Carter with the No. 1 overall pick, should they end up sticking. However, a trade with one of the QB-desperate teams would not surprise. In fact, Young is the favorite to go first overall, according to sportsbooks, with Stroud also favored well ahead of any non-QB. Will Anderson Jr., the fierce Alabama edge disruptor who had 54 tackles for loss the past two seasons combined, went third overall to the Arizona Cardinals. A fourth QB, Florida's Anthony Richardson, goes in the top 10, ninth overall to the Carolina Panthers. See all 31 first-round picks from Kiper .","pubDate":"2023-01-25 20:22:11","image_url":"https://www.gannett-cdn.com/presto/2023/01/25/PDTF/90ddb3bf-2e63-4cf8-8b9f-f237c18508f6-USATSI_19067883.jpg","source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Nottingham Forest v Manchester United: Carabao Cup semi-final, first leg – live","link":"https://www.theguardian.com/football/live/2023/jan/25/nottingham-forest-v-manchester-united-carabao-cup-semi-final-first-leg-live-score-updates","keywords":["Carabao Cup","Football","Nottingham Forest","Manchester United","Sport"],"creator":["Scott Murray"],"video_url":null,"description":"League Cup semi-final updates from the 8pm GMT kick-offSign up for the Football Daily email | Get in touch with ScottUnited get the ball rolling as the fans serenade the mist rolling in from the Trent. The City Ground really is in fine voice tonight.A moment of silence for Holocaust Memorial Day. Perfectly observed. Continue reading...","content":null,"pubDate":"2023-01-25 20:18:57","image_url":"https://i.guim.co.uk/img/media/a99590a8d8389d2147a58acf30eeb8ed143bebf3/262_792_6229_3739/master/6229.jpg?width=460&quality=85&auto=format&fit=max&s=aa454596dd416cae4fc19bd221a9e3cb","source_id":"theguardian","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Sassuolo, doppia seduta di allenamento in vista del Milan: il report","link":"https://www.milannews24.com/sassuolo-doppia-seduta-di-allenamento-in-vista-del-milan-il-report/","keywords":["News","ZOnefootball"],"creator":["Davide Lusinga"],"video_url":null,"description":"Il Sassuolo ha svolto una doppia seduta di allenamento in preparazione della sfida di domenica contro il Milan: il report completo Doppia seduta d’allenamento quest’oggi per i neroverdi al Mapei Football Center. Al mattino riscaldamento, lavoro di forza in palestra e trasformazione in campo; nel pomeriggio messa in azione, torello, esercitazioni tecniche, possesso palla e […] The post Sassuolo, doppia seduta di allenamento in vista del Milan: il report appeared first on Milan News 24.","content":"Il Sassuolo ha svolto una doppia seduta di allenamento in preparazione della sfida di domenica contro il Milan: il report completo Doppia seduta d’allenamento quest’oggi per i neroverdi al Mapei Football Center. Al mattino riscaldamento, lavoro di forza in palestra e trasformazione in campo; nel pomeriggio messa in azione, torello, esercitazioni tecniche, possesso palla e partita a metà campo. Domani, giovedì 26 gennaio, c’è in programma un allenamento pomeridiano. The post Sassuolo, doppia seduta di allenamento in vista del Milan: il report appeared first on Milan News 24.","pubDate":"2023-01-25 20:10:00","image_url":null,"source_id":"milannews24","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Michigan State football hires Diron Reynolds as new defensive line coach","link":"http://rssfeeds.freep.com/~/725493311/0/freep/sports~Michigan-State-football-hires-Diron-Reynolds-as-new-defensive-line-coach/","keywords":null,"creator":["Chris Solari"," Detroit Free Press"],"video_url":null,"description":"Michigan State football coach Mel Tucker announced the hiring of defensive line coach Diron Reynolds, who spent the past seven seasons at Stanford.      ","content":"Michigan State football has a new defensive line coach for the second straight year. Mel Tucker on Wednesday announced the hire of Diron Reynolds, who spent the past seven seasons coaching the defensive line at Stanford. The 51-year-old Reynolds replaces Marco Coleman, who returned to his alma mater, Georgia Tech , after one season with the Spartans. “I've known Diron Reynolds for more than 15 years — he's one of the best coaches in the business,” Tucker said in a statement. “He has an impressive pedigree having worked for some of the top coaches in all of football, including Tony Dungy, Leslie Frazier, David Shaw and Jim Caldwell, and has coached in both the Super Bowl and College Football Playoff. He also has developed players at the highest level, from mentoring future NFL Draft picks to working daily with Pro Bowlers in the NFL. Diron is a family man with great character who will be relentless in leading and motivating our players on and off the field. I'm thrilled about this hire and can't wait to start working with him.” INTO THE PORTAL: DL Pietrowski headed to Wisconsin HEADED TO OSU: Ex-Michigan State football RB Elijah Collins lands at Oklahoma State Stanford's defense ranked 127th out of 131 Football Bowl Subdivision teams in rush defense last season, with the 224.4 yards given up per game the seventh-highest average allowed in program history, and 90th at 1.92 sacks per game. The Cardinal also had the 114th-rated overall defense, allowing 434.1 yards per game. Their 2021 run defense allowed 235.7 yards per game, third-most in school history. Shaw resigned as head coach after the season — the Cardinal went 42-40 the past seven seasons, including 3-9 in both 2021 and 2022 — and new Stanford coach Troy Taylor did not retain Reynolds. Coleman left earlier this month for Georgia Tech, where he coached from 2019-21 after a 14-year NFL playing career. In his one season in East Lansing, the Spartans battled injuries and attrition across the defensive line —particularly at defensive end — and allowed opposing running backs to eclipse 100 yards in each of the final nine games. MSU’s run defense ranked 102nd in the FBS at 178.6 yards per game, the most allowed by the Spartans since 2002 (213.8 yards). They ranked 44th in both team sacks (2.42 per game) and tackles for loss (6.3 per game). Enter Reynolds, who coached defensive line at Stanford from 2016-22 and also spent 2014 there as a defensive assistant. He coached four NFL draft picks with the Cardinal: 2017 first-rounder Solomon Thomas (the No. 3 overall pick), 2018 third-rounder Harrison Phillips, 2020 seventh-rounder Casey Toohill and 2022 fifth-rounder Thomas Booker. Reynolds, a 1994 Wake Forest alum and native of Aiken, South Carolina, also spent 2015 as Oklahoma’s defensive line coach. Prior to that, he was in the NFL for 11 seasons. That included working in quality control for the Colts from 2002-06, including their Super Bowl 41 victory under Dungy. Reynolds spent one year with the Dolphins in 2007 as defensive line coach, then moved on to the Vikings from 2009-13 as assistant defensive line coach. Reynolds’ previous college stops included Indiana (2001, defensive tackles) and Wake Forest (1999-2000, outside linebackers; 1997-98, graduate assistant). Contact Chris Solari: csolari@freepress.com . Follow him on Twitter @chrissolari . Read more on the Michigan State Spartans and sign up for our Spartans newsletter.","pubDate":"2023-01-25 20:08:44","image_url":null,"source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Jamie Carragher angrily hits back at football agent over ‘uneducated’ jibes","link":"https://www.independent.ie/sport/soccer/jamie-carragher-angrily-hits-back-at-football-agent-over-uneducated-jibes-42313107.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"Jamie Carragher has hit back at football agent Kia Joorabchian, after he labelled him as ‘uneducated’ during an outspoken appearance on UK radio network talkSPORT.","content":null,"pubDate":"2023-01-25 19:36:15","image_url":"https://www.independent.ie/sport/soccer/96a49/42313104.ece/AUTOCROP/w1240h700/carra1.jpg","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Bellingham ‘irreplaceable’, says Dortmund boss","link":"https://www.capitalfm.co.ke/sports/2023/01/26/bellingham-irreplaceable-says-dortmund-boss/","keywords":["Football","Kenya","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"BERLIN, Germany, Jan 25 – Borussia Dortmund sporting director Sebastian Kehl on Wednesday said the club wants to hold onto English teen star Jude Bellingham “for a long time”. Bellingham, 19, has already captained Dortmund, and an impressive World Cup in Qatar has several of Europe’s biggest clubs queueing up to secure his services. Speaking […] The post Bellingham ‘irreplaceable’, says Dortmund boss appeared first on Capital Sports.","content":"Bellingham, 19, has already captained Dortmund, and an impressive World Cup in Qatar has several of Europe’s biggest clubs queueing up to secure his services. Speaking with Sky Germany, Kehl said “there have been no inquiries at the moment” for the “irreplaceable” midfielder. “If you saw him last weekend, with the focus and the passion that he has on the pitch (you’d see) that he is irreplaceable for us at the moment.” Kehl said that Dortmund hope to keep Bellingham, but could not promise he will stay. “From a sporting perspective, I would be thrilled if the boy would stay and would stay a long time at Borussia Dortmund. “But I can’t predict how the situation will develop over the next few months.” Kehl refused to speculate on reports in the German press that Dortmund had offered to make Bellingham the club’s best-paid player in order to keep him at the club. “The lad is totally focused on football, on Dortmund,” he insisted. Bellingham, who sat out Dortmund’s last-minute 2-1 win at Mainz on Wednesday night, after picking up a yellow card in Sunday’s win over Augsburg, will be free to return in Sunday’s clash with Leverkusen.","pubDate":"2023-01-26 01:30:52","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Football: Rashford stars as Man Utd beat Forest to close in on League Cup final","link":"https://www.straitstimes.com/sport/football/football-rashford-stars-as-man-utd-beat-forest-to-close-in-on-league-cup-final","keywords":null,"creator":null,"video_url":null,"description":"January 26, 2023 6:19 AMMarcus Rashford netted his 18th goal of the season in the sixth minute to silence an expectant crowd.","content":"NOTTINGHAM - Marcus Rashford scored a dazzling solo goal as Manchester United beat Nottingham Forest 3-0 in the first leg of their League Cup semi-final on Wednesday to virtually book a place at Wembley next month. The England man, enjoying a purple patch following the World Cup, netted his 18th goal of the season in the sixth minute to silence an expectant crowd at the City Ground. New United loan signing Wout Weghorst scored his first goal for the club just before half-time to put the visitors in total control and Bruno Fernandes made it 3-0 late on. “I’m happy with the performance, over 90 minutes we controlled the game,” United coach Erik ten Hag said. “There was one moment which could have changed the game and we have to be aware of that and improve. “In this mood and with this spirit, he (Rashford) is unstoppable. He can be creative in the final third, to do something in the final third, some crazy stuff, fantasy and adventure.” His men are hot favourites to reach Wembley as they seek to end their six-year trophy drought, with either Newcastle or Southampton lying in wait. The second leg will take place at Old Trafford on Feb 1. Ten Hag, in his first season at the club, has revitalised United, but will be desperate to win silverware to appease the hungry fans. Brazil midfielder Casemiro was back in the United starting line-up after being suspended for Sunday’s 3-2 Premier League defeat at leaders Arsenal, which left United fourth in the table. Forest, with new boy Danilo in the starting line-up, came into the match full of confidence after just one defeat in their past seven Premier League matches had lifted them to 13th in the table. But the visitors took control immediately and opened the scoring in style. Rashford picked up the ball in his own half and raced down the left, cutting into the box between Joe Worrall and Remo Freuler before beating Wayne Hennessey at his near post with a powerful left-footed shot. Brazil winger Antony went close to making it 2-0 minutes later as United threatened to overwhelm the home team. Forest, who have won the League Cup four times, thought they had equalised midway through the first half when Sam Surridge produced a fine finish after a rampaging run through the middle by Morgan Gibbs-White. But the goal was ruled out by VAR for a tight offside against Surridge. Gustavo Scarpa stung David de Gea’s hands with an audacious volley as Forest increasingly came into the game, with Gibbs-White and Brennan Johnson a threat. But five-time winners United doubled their lead just before half-time, with Dutch forward Weghorst reacting smartly to fire home with the outside of his right foot after Hennessey had denied Antony. United supporters in the away end were singing “Wembley” at the interval and their dreams of returning to the famous old stadium for February’s final continued after the break. United were largely untroubled in the second half, coming agonisingly close to extending their lead when Christian Eriksen rattled the crossbar from the edge of the box in the 54th minute. The visitors continued to threaten sporadically and rounded off a comfortable night when Fernandes slotted home after a clever pass from substitute Anthony Elanga. “Obviously, it was a disappointing scoreline,” Forest coach Steve Cooper said. “The last thing you want to do is go to Old Trafford with this result. “Obviously, Rashford is one of the in-form players in the country, but for us to allow him to do what he did is not good enough.” Newcastle, chasing their first domestic trophy since 1955, beat Southampton 1-0 on Tuesday in their first-leg match. AFP, REUTERS","pubDate":"2023-01-25 22:19:32","image_url":null,"source_id":"straitstimes","category":["sports"],"country":["singapore"],"language":"english"},{"title":"Al Hammadi: Al Dhafra’s return to the “safe zone” is a matter of time","link":"https://thenewsglory.com/al-hammadi-al-dhafras-return-to-the-safe-zone-is-a-matter-of-time/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"The supervisor of the first team at Al Dhafra Club, Hassan Al Hammadi, said that the team began to regain its balance in the ADNOC Professional League, and that it came out with many gains, after the important victory it achieved with two goals for a goal in the last 13 round at the expense […]","content":"The supervisor of the first team at Al Dhafra Club, Hassan Al Hammadi, said that the team began to regain its balance in the ADNOC Professional League, and that it came out with many gains, after the important victory it achieved with two goals for a goal in the last 13 round at the expense of the Dibba Al Fujairah team, with whom it shares the suffering in the “bottom”. league this season. This victory allowed Al Dhafra to advance slightly on the points level, as it raised its tally to seven points in the penultimate position, leaving the last place for Dibba with only four points. Al-Hammadi told Emirates Today, “It is only a matter of time before Al Dhafra returns to the safe area in our league.” He continued, “The victory over Dibba and leaving the last place gave a great and important incentive to all the Al Dhafra Club family, as the team set its foot on the right path to move forward towards the safe area.” He added, “The match revealed the presence of important elements that were optimally invested, from distinguished players, as well as the desire of the players and the technical staff to prove their presence and take responsibility for providing the best performance and scoring goals so that the winning streak continues.” He also said: “We will not measure the result of the match with Dibba, but rather we will invest in the data and gains it yielded, including the outstanding performance of the players, and their desire to win by citizens and foreigners. It also showed the importance of the changes that were made in the winter transfer period.” And he continued: «We are pleased that all members of the system are looking forward to success and a return to the front, and this is the most important thing that the club and the football company’s managements bet on, and our confidence is high in the team, and we also realize that the misfortune that was inherent to him will leave him, and the team will return to shine in the coming period». Al Dhafra separates a point from the 12th-placed Al-Nasr team, and six points from the 11th Al-Bataeh team. Al-Nassr sporting director speaks o... Please enable JavaScript Al-Nassr sporting director speaks on Cristiano Ronaldo case Al Dhafra awaits difficult matches in the coming period, as it faces Al Nasr during the 14th round, and it will be a difficult match for both sides, in light of the improvement that occurred in their levels, as Al Nasr succeeded in a draw with Sharjah, and was ahead in the score, while Al Dhafra won against Dibba. Al Dhafra avoided relegation at the end of last season, and does not want to repeat the same scenario, and seeks to improve its position and reach the middle of the standings during the coming period. • Al Dhafra faces Al Nasr in a difficult match for both sides during the 14th round, especially since Al-Ameed is ahead of Al Dhafra by only one point. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2023-01-25 22:05:00","image_url":null,"source_id":"thenewsglory","category":["sports"],"country":["india"],"language":"english"},{"title":"CAN U17 : La date et lieu du tirage au sort devoilés !","link":"https://wiwsport.com/2023/01/25/can-u17-la-date-et-lieu-du-tirage-au-sort-devoiles/","keywords":["Equipe nationale Football","U-17"],"creator":null,"video_url":null,"description":"(wiwsport) - La Confédération Africaine de Football (CAF) a annoncé la date du tirage au sort de l’édition 2023 de la Coupe d’Afrique des Nations réservée aux joueurs de moins de 17 ans qui aura lieu du 29 avril au 19 mai 2023, en Algérie. La cérémonie se tiendra le mercredi 01 février au Cercle National de […] Cet article a été initialement publié sur wiwsport : site n°1 de l'actualité sportive du Sénégal (wiwsport.com). Article source : CAN U17 : La date et lieu du tirage au sort devoilés !","content":"La Confédération Africaine de Football (CAF) a annoncé la date du tirage au sort de l’édition 2023 de la Coupe d’Afrique des Nations réservée aux joueurs de moins de 17 ans qui aura lieu du 29 avril au 19 mai 2023, en Algérie. La cérémonie se tiendra le mercredi 01 février au Cercle National de l’Armée à Alger, en Algérie à partir de 12h00 heure locale (11h00 GMT, 13h00 heure du Caire) et sera retransmise en direct sur les plateformes numériques de la CAF et les chaînes de télévision partenaires. Le tirage au sort fait suite aux qualifications qui se sont déroulées sur tout le continent. Onze équipes dont le Sénégal, ont rejoint l’Algérie, pays hôte, pour le tournoi final des moins de 17 ans : le Maroc, le Nigeria, le Burkina Faso, le Mali, la Somalie, l’Afrique du Sud, le Soudan du Sud, le Congo et la Zambie. Les douze équipes seront réparties dans trois groupes de quatre. Les quatre demi-finalistes seront directement qualifiées pour la Coupe du monde de la catégorie prévue la même année au Pérou La Coupe d’Afrique des Nations U-17 se déroulera en Algérie du 29 avril au 19 mai dans les villes d’Alger, Constantine et Annaba qui accueillent actuellement le Championnat d’Afrique des Nations. Après 2011 et 2019, le Sénégal emmené par Serigne Saliou Dia, disputera pour la troisième fois de son histoire cette compétition, il n’a jusqu’ici jamais dépassé les phases de groupes. wiwsport.com","pubDate":"2023-01-25 21:48:37","image_url":null,"source_id":"wiwsport","category":["sports"],"country":["senegal"],"language":"french"},{"title":"Rob Vanstone: Could the Roughriders cash in by avoiding a big-money quarterback?","link":"https://leaderpost.com/sports/football/cfl/saskatchewan-roughriders/rob-vanstone-could-the-roughriders-cash-in-by-avoiding-a-big-money-quarterback","keywords":["CFL","Football","Saskatchewan Roughriders","Sports"],"creator":["Rob Vanstone"],"video_url":null,"description":"The Roughriders' offensive productivity decreased as Cody Fajardo's salary increased. Is there a lesson to be learned moving forward?","content":"Article content The pool of prospective Saskatchewan Roughriders starting quarterbacks is shallower than an episode of Cash Cab. Article content We apologize, but this video has failed to load. Try refreshing your browser, or tap here to see other videos from our team . Rob Vanstone: Could the Roughriders cash in by avoiding a big-money quarterback? Back to video Dane Evans , who will soon be unloaded by the Hamilton Tiger-Cats following their high-profile signing of Bo Levi Mitchell, looms as the leading candidate to replace Cody Fajardo behind centre with the Green and White. Article content The Roughriders’ brass has clearly stated its intention to enter training camp with a veteran quarterback. Unless Trevor Harris surprisingly opts against remaining with the Montreal Alouettes, Evans would be the best established option. The only option, quite conceivably. This could put the Roughriders in a leverage-deprived position whereby Evans is unavoidably overpaid, simply because he is available and the team is desperate. After a 6-12 season, head coach Craig Dickenson and general manager/vice-president of football operations Jeremy O’Day — both of whom are on expiring contracts — are under the gun. Article content Unless there is a significant improvement, both men will almost certainly be replaced following (or perhaps during) the 2023 season. Ergo the seeming imperative of landing a seasoned passer who, save for one glorious day when he threw five touchdown passes, did not enhance his resume in 2022. This would, under different circumstances, be the ideal time to nurture a younger quarterback and take a longer-term approach to a multi-pronged rebuilding process. But such a mindset would be incongruent with the realities that face O’Day and Dickenson, both of whom are in win-now mode. One does wonder, however, whether adherence to the conventional model might ultimately seal the fates of O’Day and Dickenson. Suppose that O’Day acquires Evans from Hamilton and simply assumes the terms of an extant deal — one that included provisions for $417,000 in hard money in 2022, according to figures published by 3DownNation.com. Article content One option would be to re-work the contract, but how low could they reasonably go? A quarterback of Evans’ experience could still be in line for, say, $350,000-plus under a restructured deal. Is that money well-spent? In a salary-capped world, maybe there is a case for spending substantially less than the conventional wage for a quarterback. We remind you of 2019, when Fajardo took home a reported $150,000 while helping Saskatchewan post a 13-5 record and finish first in the West Division. The results diminished as Fajardo’s compensation increased. During the COVID-shortened season of 2021, he made somewhere in the vicinity of $400,000 (pro-rated over a full 18 games) for an offensively challenged Saskatchewan side that went 9-5. Article content Fajardo’s hard-money total swelled to $467,000 in 2022, when the Roughriders imploded after a 4-1 start. (All the dollar data is, we remind you, courtesy of 3DownNation.) By season’s end, Fajardo had been benched, even though his struggles were symptomatic of considerably larger problems. The offensive line, for example, was a season-long sieve. The receiving corps lacked explosiveness. So what was Fajardo to do? Ultimately, did he pay the price for his price tag? Suppose that O’Day had been blessed with an additional six figures at his disposal while assembling a roster in advance of the 2022 season. Would the additional money have helped the Roughriders’ GM solidify the offensive line and/or add a playmaker or two? Article content If O’Day and his cohorts on the player-personnel side had been able to find a defensive back who was actually familiar with the concept of an interception, would the field position have provided some short fields for Fajardo and associates? When the pass rush cratered after a robust start to the season, would a few more available dollars have enabled O’Day to make a trade or entice a difference-making NFL cut to venture northward? Although we are immersed in a speculating frenzy, this much is irrefutable: Over three seasons under O’Day and Dickenson, the Roughriders’ offence was at its best when the quarterback was paid the least. Remember, too, that Saskatchewan had previously finished first in 2009, when quarterback Darian Durant was at the lower end of his earning power. (Durant made roughly $250,000 in 2009. Even in 2013, when he quarterbacked Saskatchewan to a championship, the wage was a below-market $325,000.) Article content Then there is the case of Nathan Rourke, whose hard money for 2022 was quoted at (get this) $71,500 by 3DownNation’s ubiquitous Justin Dunk. As a Canadian draftee, Rourke was available for a pittance, taking the CFL’s economics into account. It is unrealistic to think that a serviceable five-figure option is available for the Roughriders. However, what if they were to spend somewhere between $200,000 to $250,000 (including playing-time bonuses) for an as-yet-unproven quarterback of considerable promise? Would that have a liberating effect on O’Day? Could he address a multitude of deficiencies by resisting any temptation to pay big money for someone else’s discard? Could the organization, as a whole, sell something called hope? Article content So much needs to be done, after all, and the field general — despite his prominence — is only one element of the equation. If the Roughriders cannot significantly upgrade the offensive line and the receiving corps, the inevitable result will be a sitting-duck quarterback and a lame-duck regime. rvanstone@postmedia.com twitter.com/robvanstone The sports world is ever-changing, as are the times. Supplement your steady diet of sports coverage by subscribing to the Regina Leader-Post’s 306 Sports Fix newsletter. Each week, sports editor Rob Vanstone will provide additional commentary on the Roughriders, Pats and other teams/sports of interest, along with a peek behind the curtain. Click here to subscribe. Recommended from Editorial Rob Vanstone: Roughriders painted themselves into a corner at quarterback Rob Vanstone: Dane Evans is Roughriders' likeliest option at quarterback","pubDate":"2023-01-25 20:33:26","image_url":null,"source_id":"leaderpost","category":["sports"],"country":["canada"],"language":"english"},{"title":"Detroit Lions NFL mock draft 2023: Mel Kiper beefs up defense with both first-round picks","link":"http://rssfeeds.freep.com/~/725480732/0/freep/sports~Detroit-Lions-NFL-mock-draft-Mel-Kiper-beefs-up-defense-with-both-firstround-picks/","keywords":null,"creator":["Marlowe Alter"," Detroit Free Press"],"video_url":null,"description":"Mel Kiper Jr. of ESPN has Detroit Lions getting defensive with both the sixth overall pick and the 18th overall pick in 2023 NFL mock draft.       ","content":"One of the NFL's preeminent draft analysts has released his first 2023 mock draft. And with two first-round picks for the Detroit Lions , we'd be doing a disservice to ignore the information, even if we're still three months out from names being called and daps being delivered by commissioner Roger Goodell live in Kansas City. So let's break it down: Mel Kiper Jr. of ESPN has the Lions going defense with pick Nos. 6 and 18 on April 27. First, note Kiper did not project any trades — \"It's still a little bit early to assess which teams could move up and what it would take to get there,\" he noted — and has three quarterbacks going in the first five picks: Ohio State's C.J. Stroud to Houston at No. 2, Alabama's Bryce Young to Indianapolis at No. 4 and Kentucky's Will Levis to Seattle at No. 5. Despite Kiper picking Stroud to Houston, he actually has him third on his QB board , \"barely\" behind the other two, and admits \"it's going to be a close race through April.\" He sees Stroud as the best fit for Houston due to his accuracy and \"excellent touch at every level of the field.\" BIG DECISION LOOMING: Jonah Jackson, up for contract extension, 'would love to be a Lion forever' Seattle is the big question near the top of the draft, awaiting a decision on pending free agent Geno Smith. Kiper suggests the Seahawks could franchise tag him and coach up Levis — an admittedly polarizing prospect. \"There will be a general manager in the top 10 who sees Levis' positives over the negatives,\" Kiper wrote, adding Levis is ahead of fellow rookie QBs in learning a pro-style offense, because he played in one at Kentucky. That sets the table for the Lions at No. 6 via the Matthew Stafford-Jared Goff trade with the Los Angeles Rams two years ago. Detroit's defense, Kiper points out, ranked 32nd in the NFL in yards per play allowed (6.2) and opponent QBR (55.9), so you know where he's going with this pick. The question is, which prospect? How about a rare Big 12 defender in Texas Tech's Tyree Wilson , whom Kiper calls the top true defensive end in the class. DAVE BIRKETT: Ranking the Lions' 15 unrestricted free agents: WR DJ Chark tops the list \"He can use his burst at the snap to beat offensive tackles on passing downs or use his 6-foot-6 frame to hold up against the run,\" Kiper writes . \"An edge-rushing duo of Wilson and Aidan Hutchinson would be formidable, with surprise rookie James Houston working in on obvious passing downs.\" Wilson, 275 pounds and from Henderson, Texas, had 61 tackles (36 solo), including 14 for a loss and seven sacks in 10 games before a foot injury which required surgery ended his season. His Red Raiders bio says he \"benefited greatly from the switch to an edge rusher position in defensive coordinator Tim DeRuyter’s scheme.\" Wilson, in 538 defensive snaps, was given a 74.5 grade from Pro Football Focus in 2022, and his 50 QB pressures was among the national leaders. Kiper doesn't rule out the Lions going with a QB if they fall in love with a prospect that remains available with this first pick, though in this scenario, the top three are already taken. \"General manager Brad Holmes likely will take a close look at this (QB) class and weigh each passer against veteran Jared Goff,\" Kiper writes. At No. 18, Kiper has the Lions select Oregon cornerback Christian Gonzalez , who seems to be a popular pick for the Lions' needy secondary. READ MORE: Lions fans must not only accept losing key contributors. They must embrace it \"Gonzalez was a lockdown defender at Colorado before transferring to Oregon last year, where he picked off four passes and improved every week,\" Kiper writes. \"He's going to test really well at the combine in March, too. This pick makes too much sense for a Detroit defense that badly needs an infusion of young talent in the secondary.\" Gonzalez, a redshirt sophomore from The Colony, Texas, is big at 6-2 and 201 pounds. He was named this season to the All-Pac-12 first team by league coaches, and All-Pac-12 second team by the Associated Press and PFF. He finished with 50 total tackles and 118 return yards on his four interceptions. He tied for sixth in the conference with 11 passes defended, and earned an 81.2 overall grade from PFF, fourth among Pac-12 cornerbacks, and 81.4 coverage grade, also fourth. Back to the top: Kiper has the Chicago Bears taking Georgia defensive lineman Jalen Carter with the No. 1 overall pick, should they end up sticking. However, a trade with one of the QB-desperate teams would not surprise. In fact, Young is the favorite to go first overall, according to sportsbooks, with Stroud also favored well ahead of any non-QB. Will Anderson Jr., the fierce Alabama edge disruptor who had 54 tackles for loss the past two seasons combined, went third overall to the Arizona Cardinals. A fourth QB, Florida's Anthony Richardson, goes in the top 10, ninth overall to the Carolina Panthers. See all 31 first-round picks from Kiper .","pubDate":"2023-01-25 20:22:11","image_url":"https://www.gannett-cdn.com/presto/2023/01/25/PDTF/90ddb3bf-2e63-4cf8-8b9f-f237c18508f6-USATSI_19067883.jpg","source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Nottingham Forest v Manchester United: Carabao Cup semi-final, first leg – live","link":"https://www.theguardian.com/football/live/2023/jan/25/nottingham-forest-v-manchester-united-carabao-cup-semi-final-first-leg-live-score-updates","keywords":["Carabao Cup","Football","Nottingham Forest","Manchester United","Sport"],"creator":["Scott Murray"],"video_url":null,"description":"League Cup semi-final updates from the 8pm GMT kick-offSign up for the Football Daily email | Get in touch with ScottUnited get the ball rolling as the fans serenade the mist rolling in from the Trent. The City Ground really is in fine voice tonight.A moment of silence for Holocaust Memorial Day. Perfectly observed. Continue reading...","content":null,"pubDate":"2023-01-25 20:18:57","image_url":"https://i.guim.co.uk/img/media/a99590a8d8389d2147a58acf30eeb8ed143bebf3/262_792_6229_3739/master/6229.jpg?width=460&quality=85&auto=format&fit=max&s=aa454596dd416cae4fc19bd221a9e3cb","source_id":"theguardian","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Sassuolo, doppia seduta di allenamento in vista del Milan: il report","link":"https://www.milannews24.com/sassuolo-doppia-seduta-di-allenamento-in-vista-del-milan-il-report/","keywords":["News","ZOnefootball"],"creator":["Davide Lusinga"],"video_url":null,"description":"Il Sassuolo ha svolto una doppia seduta di allenamento in preparazione della sfida di domenica contro il Milan: il report completo Doppia seduta d’allenamento quest’oggi per i neroverdi al Mapei Football Center. Al mattino riscaldamento, lavoro di forza in palestra e trasformazione in campo; nel pomeriggio messa in azione, torello, esercitazioni tecniche, possesso palla e […] The post Sassuolo, doppia seduta di allenamento in vista del Milan: il report appeared first on Milan News 24.","content":"Il Sassuolo ha svolto una doppia seduta di allenamento in preparazione della sfida di domenica contro il Milan: il report completo Doppia seduta d’allenamento quest’oggi per i neroverdi al Mapei Football Center. Al mattino riscaldamento, lavoro di forza in palestra e trasformazione in campo; nel pomeriggio messa in azione, torello, esercitazioni tecniche, possesso palla e partita a metà campo. Domani, giovedì 26 gennaio, c’è in programma un allenamento pomeridiano. The post Sassuolo, doppia seduta di allenamento in vista del Milan: il report appeared first on Milan News 24.","pubDate":"2023-01-25 20:10:00","image_url":null,"source_id":"milannews24","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Michigan State football hires Diron Reynolds as new defensive line coach","link":"http://rssfeeds.freep.com/~/725493311/0/freep/sports~Michigan-State-football-hires-Diron-Reynolds-as-new-defensive-line-coach/","keywords":null,"creator":["Chris Solari"," Detroit Free Press"],"video_url":null,"description":"Michigan State football coach Mel Tucker announced the hiring of defensive line coach Diron Reynolds, who spent the past seven seasons at Stanford.      ","content":"Michigan State football has a new defensive line coach for the second straight year. Mel Tucker on Wednesday announced the hire of Diron Reynolds, who spent the past seven seasons coaching the defensive line at Stanford. The 51-year-old Reynolds replaces Marco Coleman, who returned to his alma mater, Georgia Tech , after one season with the Spartans. “I've known Diron Reynolds for more than 15 years — he's one of the best coaches in the business,” Tucker said in a statement. “He has an impressive pedigree having worked for some of the top coaches in all of football, including Tony Dungy, Leslie Frazier, David Shaw and Jim Caldwell, and has coached in both the Super Bowl and College Football Playoff. He also has developed players at the highest level, from mentoring future NFL Draft picks to working daily with Pro Bowlers in the NFL. Diron is a family man with great character who will be relentless in leading and motivating our players on and off the field. I'm thrilled about this hire and can't wait to start working with him.” INTO THE PORTAL: DL Pietrowski headed to Wisconsin HEADED TO OSU: Ex-Michigan State football RB Elijah Collins lands at Oklahoma State Stanford's defense ranked 127th out of 131 Football Bowl Subdivision teams in rush defense last season, with the 224.4 yards given up per game the seventh-highest average allowed in program history, and 90th at 1.92 sacks per game. The Cardinal also had the 114th-rated overall defense, allowing 434.1 yards per game. Their 2021 run defense allowed 235.7 yards per game, third-most in school history. Shaw resigned as head coach after the season — the Cardinal went 42-40 the past seven seasons, including 3-9 in both 2021 and 2022 — and new Stanford coach Troy Taylor did not retain Reynolds. Coleman left earlier this month for Georgia Tech, where he coached from 2019-21 after a 14-year NFL playing career. In his one season in East Lansing, the Spartans battled injuries and attrition across the defensive line —particularly at defensive end — and allowed opposing running backs to eclipse 100 yards in each of the final nine games. MSU’s run defense ranked 102nd in the FBS at 178.6 yards per game, the most allowed by the Spartans since 2002 (213.8 yards). They ranked 44th in both team sacks (2.42 per game) and tackles for loss (6.3 per game). Enter Reynolds, who coached defensive line at Stanford from 2016-22 and also spent 2014 there as a defensive assistant. He coached four NFL draft picks with the Cardinal: 2017 first-rounder Solomon Thomas (the No. 3 overall pick), 2018 third-rounder Harrison Phillips, 2020 seventh-rounder Casey Toohill and 2022 fifth-rounder Thomas Booker. Reynolds, a 1994 Wake Forest alum and native of Aiken, South Carolina, also spent 2015 as Oklahoma’s defensive line coach. Prior to that, he was in the NFL for 11 seasons. That included working in quality control for the Colts from 2002-06, including their Super Bowl 41 victory under Dungy. Reynolds spent one year with the Dolphins in 2007 as defensive line coach, then moved on to the Vikings from 2009-13 as assistant defensive line coach. Reynolds’ previous college stops included Indiana (2001, defensive tackles) and Wake Forest (1999-2000, outside linebackers; 1997-98, graduate assistant). Contact Chris Solari: csolari@freepress.com . Follow him on Twitter @chrissolari . Read more on the Michigan State Spartans and sign up for our Spartans newsletter.","pubDate":"2023-01-25 20:08:44","image_url":null,"source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Jamie Carragher angrily hits back at football agent over ‘uneducated’ jibes","link":"https://www.independent.ie/sport/soccer/jamie-carragher-angrily-hits-back-at-football-agent-over-uneducated-jibes-42313107.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"Jamie Carragher has hit back at football agent Kia Joorabchian, after he labelled him as ‘uneducated’ during an outspoken appearance on UK radio network talkSPORT.","content":null,"pubDate":"2023-01-25 19:36:15","image_url":"https://www.independent.ie/sport/soccer/96a49/42313104.ece/AUTOCROP/w1240h700/carra1.jpg","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Bellingham ‘irreplaceable’, says Dortmund boss","link":"https://www.capitalfm.co.ke/sports/2023/01/26/bellingham-irreplaceable-says-dortmund-boss/","keywords":["Football","Kenya","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"BERLIN, Germany, Jan 25 – Borussia Dortmund sporting director Sebastian Kehl on Wednesday said the club wants to hold onto English teen star Jude Bellingham “for a long time”. Bellingham, 19, has already captained Dortmund, and an impressive World Cup in Qatar has several of Europe’s biggest clubs queueing up to secure his services. Speaking […] The post Bellingham ‘irreplaceable’, says Dortmund boss appeared first on Capital Sports.","content":"Bellingham, 19, has already captained Dortmund, and an impressive World Cup in Qatar has several of Europe’s biggest clubs queueing up to secure his services. Speaking with Sky Germany, Kehl said “there have been no inquiries at the moment” for the “irreplaceable” midfielder. “If you saw him last weekend, with the focus and the passion that he has on the pitch (you’d see) that he is irreplaceable for us at the moment.” Kehl said that Dortmund hope to keep Bellingham, but could not promise he will stay. “From a sporting perspective, I would be thrilled if the boy would stay and would stay a long time at Borussia Dortmund. “But I can’t predict how the situation will develop over the next few months.” Kehl refused to speculate on reports in the German press that Dortmund had offered to make Bellingham the club’s best-paid player in order to keep him at the club. “The lad is totally focused on football, on Dortmund,” he insisted. Bellingham, who sat out Dortmund’s last-minute 2-1 win at Mainz on Wednesday night, after picking up a yellow card in Sunday’s win over Augsburg, will be free to return in Sunday’s clash with Leverkusen.","pubDate":"2023-01-26 01:30:52","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Football: Rashford stars as Man Utd beat Forest to close in on League Cup final","link":"https://www.straitstimes.com/sport/football/football-rashford-stars-as-man-utd-beat-forest-to-close-in-on-league-cup-final","keywords":null,"creator":null,"video_url":null,"description":"January 26, 2023 6:19 AMMarcus Rashford netted his 18th goal of the season in the sixth minute to silence an expectant crowd.","content":"NOTTINGHAM - Marcus Rashford scored a dazzling solo goal as Manchester United beat Nottingham Forest 3-0 in the first leg of their League Cup semi-final on Wednesday to virtually book a place at Wembley next month. The England man, enjoying a purple patch following the World Cup, netted his 18th goal of the season in the sixth minute to silence an expectant crowd at the City Ground. New United loan signing Wout Weghorst scored his first goal for the club just before half-time to put the visitors in total control and Bruno Fernandes made it 3-0 late on. “I’m happy with the performance, over 90 minutes we controlled the game,” United coach Erik ten Hag said. “There was one moment which could have changed the game and we have to be aware of that and improve. “In this mood and with this spirit, he (Rashford) is unstoppable. He can be creative in the final third, to do something in the final third, some crazy stuff, fantasy and adventure.” His men are hot favourites to reach Wembley as they seek to end their six-year trophy drought, with either Newcastle or Southampton lying in wait. The second leg will take place at Old Trafford on Feb 1. Ten Hag, in his first season at the club, has revitalised United, but will be desperate to win silverware to appease the hungry fans. Brazil midfielder Casemiro was back in the United starting line-up after being suspended for Sunday’s 3-2 Premier League defeat at leaders Arsenal, which left United fourth in the table. Forest, with new boy Danilo in the starting line-up, came into the match full of confidence after just one defeat in their past seven Premier League matches had lifted them to 13th in the table. But the visitors took control immediately and opened the scoring in style. Rashford picked up the ball in his own half and raced down the left, cutting into the box between Joe Worrall and Remo Freuler before beating Wayne Hennessey at his near post with a powerful left-footed shot. Brazil winger Antony went close to making it 2-0 minutes later as United threatened to overwhelm the home team. Forest, who have won the League Cup four times, thought they had equalised midway through the first half when Sam Surridge produced a fine finish after a rampaging run through the middle by Morgan Gibbs-White. But the goal was ruled out by VAR for a tight offside against Surridge. Gustavo Scarpa stung David de Gea’s hands with an audacious volley as Forest increasingly came into the game, with Gibbs-White and Brennan Johnson a threat. But five-time winners United doubled their lead just before half-time, with Dutch forward Weghorst reacting smartly to fire home with the outside of his right foot after Hennessey had denied Antony. United supporters in the away end were singing “Wembley” at the interval and their dreams of returning to the famous old stadium for February’s final continued after the break. United were largely untroubled in the second half, coming agonisingly close to extending their lead when Christian Eriksen rattled the crossbar from the edge of the box in the 54th minute. The visitors continued to threaten sporadically and rounded off a comfortable night when Fernandes slotted home after a clever pass from substitute Anthony Elanga. “Obviously, it was a disappointing scoreline,” Forest coach Steve Cooper said. “The last thing you want to do is go to Old Trafford with this result. “Obviously, Rashford is one of the in-form players in the country, but for us to allow him to do what he did is not good enough.” Newcastle, chasing their first domestic trophy since 1955, beat Southampton 1-0 on Tuesday in their first-leg match. AFP, REUTERS","pubDate":"2023-01-25 22:19:32","image_url":null,"source_id":"straitstimes","category":["sports"],"country":["singapore"],"language":"english"},{"title":"Al Hammadi: Al Dhafra’s return to the “safe zone” is a matter of time","link":"https://thenewsglory.com/al-hammadi-al-dhafras-return-to-the-safe-zone-is-a-matter-of-time/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"The supervisor of the first team at Al Dhafra Club, Hassan Al Hammadi, said that the team began to regain its balance in the ADNOC Professional League, and that it came out with many gains, after the important victory it achieved with two goals for a goal in the last 13 round at the expense […]","content":"The supervisor of the first team at Al Dhafra Club, Hassan Al Hammadi, said that the team began to regain its balance in the ADNOC Professional League, and that it came out with many gains, after the important victory it achieved with two goals for a goal in the last 13 round at the expense of the Dibba Al Fujairah team, with whom it shares the suffering in the “bottom”. league this season. This victory allowed Al Dhafra to advance slightly on the points level, as it raised its tally to seven points in the penultimate position, leaving the last place for Dibba with only four points. Al-Hammadi told Emirates Today, “It is only a matter of time before Al Dhafra returns to the safe area in our league.” He continued, “The victory over Dibba and leaving the last place gave a great and important incentive to all the Al Dhafra Club family, as the team set its foot on the right path to move forward towards the safe area.” He added, “The match revealed the presence of important elements that were optimally invested, from distinguished players, as well as the desire of the players and the technical staff to prove their presence and take responsibility for providing the best performance and scoring goals so that the winning streak continues.” He also said: “We will not measure the result of the match with Dibba, but rather we will invest in the data and gains it yielded, including the outstanding performance of the players, and their desire to win by citizens and foreigners. It also showed the importance of the changes that were made in the winter transfer period.” And he continued: «We are pleased that all members of the system are looking forward to success and a return to the front, and this is the most important thing that the club and the football company’s managements bet on, and our confidence is high in the team, and we also realize that the misfortune that was inherent to him will leave him, and the team will return to shine in the coming period». Al Dhafra separates a point from the 12th-placed Al-Nasr team, and six points from the 11th Al-Bataeh team. Al-Nassr sporting director speaks o... Please enable JavaScript Al-Nassr sporting director speaks on Cristiano Ronaldo case Al Dhafra awaits difficult matches in the coming period, as it faces Al Nasr during the 14th round, and it will be a difficult match for both sides, in light of the improvement that occurred in their levels, as Al Nasr succeeded in a draw with Sharjah, and was ahead in the score, while Al Dhafra won against Dibba. Al Dhafra avoided relegation at the end of last season, and does not want to repeat the same scenario, and seeks to improve its position and reach the middle of the standings during the coming period. • Al Dhafra faces Al Nasr in a difficult match for both sides during the 14th round, especially since Al-Ameed is ahead of Al Dhafra by only one point. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2023-01-25 22:05:00","image_url":null,"source_id":"thenewsglory","category":["sports"],"country":["india"],"language":"english"},{"title":"CAN U17 : La date et lieu du tirage au sort devoilés !","link":"https://wiwsport.com/2023/01/25/can-u17-la-date-et-lieu-du-tirage-au-sort-devoiles/","keywords":["Equipe nationale Football","U-17"],"creator":null,"video_url":null,"description":"(wiwsport) - La Confédération Africaine de Football (CAF) a annoncé la date du tirage au sort de l’édition 2023 de la Coupe d’Afrique des Nations réservée aux joueurs de moins de 17 ans qui aura lieu du 29 avril au 19 mai 2023, en Algérie. La cérémonie se tiendra le mercredi 01 février au Cercle National de […] Cet article a été initialement publié sur wiwsport : site n°1 de l'actualité sportive du Sénégal (wiwsport.com). Article source : CAN U17 : La date et lieu du tirage au sort devoilés !","content":"La Confédération Africaine de Football (CAF) a annoncé la date du tirage au sort de l’édition 2023 de la Coupe d’Afrique des Nations réservée aux joueurs de moins de 17 ans qui aura lieu du 29 avril au 19 mai 2023, en Algérie. La cérémonie se tiendra le mercredi 01 février au Cercle National de l’Armée à Alger, en Algérie à partir de 12h00 heure locale (11h00 GMT, 13h00 heure du Caire) et sera retransmise en direct sur les plateformes numériques de la CAF et les chaînes de télévision partenaires. Le tirage au sort fait suite aux qualifications qui se sont déroulées sur tout le continent. Onze équipes dont le Sénégal, ont rejoint l’Algérie, pays hôte, pour le tournoi final des moins de 17 ans : le Maroc, le Nigeria, le Burkina Faso, le Mali, la Somalie, l’Afrique du Sud, le Soudan du Sud, le Congo et la Zambie. Les douze équipes seront réparties dans trois groupes de quatre. Les quatre demi-finalistes seront directement qualifiées pour la Coupe du monde de la catégorie prévue la même année au Pérou La Coupe d’Afrique des Nations U-17 se déroulera en Algérie du 29 avril au 19 mai dans les villes d’Alger, Constantine et Annaba qui accueillent actuellement le Championnat d’Afrique des Nations. Après 2011 et 2019, le Sénégal emmené par Serigne Saliou Dia, disputera pour la troisième fois de son histoire cette compétition, il n’a jusqu’ici jamais dépassé les phases de groupes. wiwsport.com","pubDate":"2023-01-25 21:48:37","image_url":null,"source_id":"wiwsport","category":["sports"],"country":["senegal"],"language":"french"},{"title":"Rob Vanstone: Could the Roughriders cash in by avoiding a big-money quarterback?","link":"https://leaderpost.com/sports/football/cfl/saskatchewan-roughriders/rob-vanstone-could-the-roughriders-cash-in-by-avoiding-a-big-money-quarterback","keywords":["CFL","Football","Saskatchewan Roughriders","Sports"],"creator":["Rob Vanstone"],"video_url":null,"description":"The Roughriders' offensive productivity decreased as Cody Fajardo's salary increased. Is there a lesson to be learned moving forward?","content":"Article content The pool of prospective Saskatchewan Roughriders starting quarterbacks is shallower than an episode of Cash Cab. Article content We apologize, but this video has failed to load. Try refreshing your browser, or tap here to see other videos from our team . Rob Vanstone: Could the Roughriders cash in by avoiding a big-money quarterback? Back to video Dane Evans , who will soon be unloaded by the Hamilton Tiger-Cats following their high-profile signing of Bo Levi Mitchell, looms as the leading candidate to replace Cody Fajardo behind centre with the Green and White. Article content The Roughriders’ brass has clearly stated its intention to enter training camp with a veteran quarterback. Unless Trevor Harris surprisingly opts against remaining with the Montreal Alouettes, Evans would be the best established option. The only option, quite conceivably. This could put the Roughriders in a leverage-deprived position whereby Evans is unavoidably overpaid, simply because he is available and the team is desperate. After a 6-12 season, head coach Craig Dickenson and general manager/vice-president of football operations Jeremy O’Day — both of whom are on expiring contracts — are under the gun. Article content Unless there is a significant improvement, both men will almost certainly be replaced following (or perhaps during) the 2023 season. Ergo the seeming imperative of landing a seasoned passer who, save for one glorious day when he threw five touchdown passes, did not enhance his resume in 2022. This would, under different circumstances, be the ideal time to nurture a younger quarterback and take a longer-term approach to a multi-pronged rebuilding process. But such a mindset would be incongruent with the realities that face O’Day and Dickenson, both of whom are in win-now mode. One does wonder, however, whether adherence to the conventional model might ultimately seal the fates of O’Day and Dickenson. Suppose that O’Day acquires Evans from Hamilton and simply assumes the terms of an extant deal — one that included provisions for $417,000 in hard money in 2022, according to figures published by 3DownNation.com. Article content One option would be to re-work the contract, but how low could they reasonably go? A quarterback of Evans’ experience could still be in line for, say, $350,000-plus under a restructured deal. Is that money well-spent? In a salary-capped world, maybe there is a case for spending substantially less than the conventional wage for a quarterback. We remind you of 2019, when Fajardo took home a reported $150,000 while helping Saskatchewan post a 13-5 record and finish first in the West Division. The results diminished as Fajardo’s compensation increased. During the COVID-shortened season of 2021, he made somewhere in the vicinity of $400,000 (pro-rated over a full 18 games) for an offensively challenged Saskatchewan side that went 9-5. Article content Fajardo’s hard-money total swelled to $467,000 in 2022, when the Roughriders imploded after a 4-1 start. (All the dollar data is, we remind you, courtesy of 3DownNation.) By season’s end, Fajardo had been benched, even though his struggles were symptomatic of considerably larger problems. The offensive line, for example, was a season-long sieve. The receiving corps lacked explosiveness. So what was Fajardo to do? Ultimately, did he pay the price for his price tag? Suppose that O’Day had been blessed with an additional six figures at his disposal while assembling a roster in advance of the 2022 season. Would the additional money have helped the Roughriders’ GM solidify the offensive line and/or add a playmaker or two? Article content If O’Day and his cohorts on the player-personnel side had been able to find a defensive back who was actually familiar with the concept of an interception, would the field position have provided some short fields for Fajardo and associates? When the pass rush cratered after a robust start to the season, would a few more available dollars have enabled O’Day to make a trade or entice a difference-making NFL cut to venture northward? Although we are immersed in a speculating frenzy, this much is irrefutable: Over three seasons under O’Day and Dickenson, the Roughriders’ offence was at its best when the quarterback was paid the least. Remember, too, that Saskatchewan had previously finished first in 2009, when quarterback Darian Durant was at the lower end of his earning power. (Durant made roughly $250,000 in 2009. Even in 2013, when he quarterbacked Saskatchewan to a championship, the wage was a below-market $325,000.) Article content Then there is the case of Nathan Rourke, whose hard money for 2022 was quoted at (get this) $71,500 by 3DownNation’s ubiquitous Justin Dunk. As a Canadian draftee, Rourke was available for a pittance, taking the CFL’s economics into account. It is unrealistic to think that a serviceable five-figure option is available for the Roughriders. However, what if they were to spend somewhere between $200,000 to $250,000 (including playing-time bonuses) for an as-yet-unproven quarterback of considerable promise? Would that have a liberating effect on O’Day? Could he address a multitude of deficiencies by resisting any temptation to pay big money for someone else’s discard? Could the organization, as a whole, sell something called hope? Article content So much needs to be done, after all, and the field general — despite his prominence — is only one element of the equation. If the Roughriders cannot significantly upgrade the offensive line and the receiving corps, the inevitable result will be a sitting-duck quarterback and a lame-duck regime. rvanstone@postmedia.com twitter.com/robvanstone The sports world is ever-changing, as are the times. Supplement your steady diet of sports coverage by subscribing to the Regina Leader-Post’s 306 Sports Fix newsletter. Each week, sports editor Rob Vanstone will provide additional commentary on the Roughriders, Pats and other teams/sports of interest, along with a peek behind the curtain. Click here to subscribe. Recommended from Editorial Rob Vanstone: Roughriders painted themselves into a corner at quarterback Rob Vanstone: Dane Evans is Roughriders' likeliest option at quarterback","pubDate":"2023-01-25 20:33:26","image_url":null,"source_id":"leaderpost","category":["sports"],"country":["canada"],"language":"english"},{"title":"Detroit Lions NFL mock draft 2023: Mel Kiper beefs up defense with both first-round picks","link":"http://rssfeeds.freep.com/~/725480732/0/freep/sports~Detroit-Lions-NFL-mock-draft-Mel-Kiper-beefs-up-defense-with-both-firstround-picks/","keywords":null,"creator":["Marlowe Alter"," Detroit Free Press"],"video_url":null,"description":"Mel Kiper Jr. of ESPN has Detroit Lions getting defensive with both the sixth overall pick and the 18th overall pick in 2023 NFL mock draft.       ","content":"One of the NFL's preeminent draft analysts has released his first 2023 mock draft. And with two first-round picks for the Detroit Lions , we'd be doing a disservice to ignore the information, even if we're still three months out from names being called and daps being delivered by commissioner Roger Goodell live in Kansas City. So let's break it down: Mel Kiper Jr. of ESPN has the Lions going defense with pick Nos. 6 and 18 on April 27. First, note Kiper did not project any trades — \"It's still a little bit early to assess which teams could move up and what it would take to get there,\" he noted — and has three quarterbacks going in the first five picks: Ohio State's C.J. Stroud to Houston at No. 2, Alabama's Bryce Young to Indianapolis at No. 4 and Kentucky's Will Levis to Seattle at No. 5. Despite Kiper picking Stroud to Houston, he actually has him third on his QB board , \"barely\" behind the other two, and admits \"it's going to be a close race through April.\" He sees Stroud as the best fit for Houston due to his accuracy and \"excellent touch at every level of the field.\" BIG DECISION LOOMING: Jonah Jackson, up for contract extension, 'would love to be a Lion forever' Seattle is the big question near the top of the draft, awaiting a decision on pending free agent Geno Smith. Kiper suggests the Seahawks could franchise tag him and coach up Levis — an admittedly polarizing prospect. \"There will be a general manager in the top 10 who sees Levis' positives over the negatives,\" Kiper wrote, adding Levis is ahead of fellow rookie QBs in learning a pro-style offense, because he played in one at Kentucky. That sets the table for the Lions at No. 6 via the Matthew Stafford-Jared Goff trade with the Los Angeles Rams two years ago. Detroit's defense, Kiper points out, ranked 32nd in the NFL in yards per play allowed (6.2) and opponent QBR (55.9), so you know where he's going with this pick. The question is, which prospect? How about a rare Big 12 defender in Texas Tech's Tyree Wilson , whom Kiper calls the top true defensive end in the class. DAVE BIRKETT: Ranking the Lions' 15 unrestricted free agents: WR DJ Chark tops the list \"He can use his burst at the snap to beat offensive tackles on passing downs or use his 6-foot-6 frame to hold up against the run,\" Kiper writes . \"An edge-rushing duo of Wilson and Aidan Hutchinson would be formidable, with surprise rookie James Houston working in on obvious passing downs.\" Wilson, 275 pounds and from Henderson, Texas, had 61 tackles (36 solo), including 14 for a loss and seven sacks in 10 games before a foot injury which required surgery ended his season. His Red Raiders bio says he \"benefited greatly from the switch to an edge rusher position in defensive coordinator Tim DeRuyter’s scheme.\" Wilson, in 538 defensive snaps, was given a 74.5 grade from Pro Football Focus in 2022, and his 50 QB pressures was among the national leaders. Kiper doesn't rule out the Lions going with a QB if they fall in love with a prospect that remains available with this first pick, though in this scenario, the top three are already taken. \"General manager Brad Holmes likely will take a close look at this (QB) class and weigh each passer against veteran Jared Goff,\" Kiper writes. At No. 18, Kiper has the Lions select Oregon cornerback Christian Gonzalez , who seems to be a popular pick for the Lions' needy secondary. READ MORE: Lions fans must not only accept losing key contributors. They must embrace it \"Gonzalez was a lockdown defender at Colorado before transferring to Oregon last year, where he picked off four passes and improved every week,\" Kiper writes. \"He's going to test really well at the combine in March, too. This pick makes too much sense for a Detroit defense that badly needs an infusion of young talent in the secondary.\" Gonzalez, a redshirt sophomore from The Colony, Texas, is big at 6-2 and 201 pounds. He was named this season to the All-Pac-12 first team by league coaches, and All-Pac-12 second team by the Associated Press and PFF. He finished with 50 total tackles and 118 return yards on his four interceptions. He tied for sixth in the conference with 11 passes defended, and earned an 81.2 overall grade from PFF, fourth among Pac-12 cornerbacks, and 81.4 coverage grade, also fourth. Back to the top: Kiper has the Chicago Bears taking Georgia defensive lineman Jalen Carter with the No. 1 overall pick, should they end up sticking. However, a trade with one of the QB-desperate teams would not surprise. In fact, Young is the favorite to go first overall, according to sportsbooks, with Stroud also favored well ahead of any non-QB. Will Anderson Jr., the fierce Alabama edge disruptor who had 54 tackles for loss the past two seasons combined, went third overall to the Arizona Cardinals. A fourth QB, Florida's Anthony Richardson, goes in the top 10, ninth overall to the Carolina Panthers. See all 31 first-round picks from Kiper .","pubDate":"2023-01-25 20:22:11","image_url":"https://www.gannett-cdn.com/presto/2023/01/25/PDTF/90ddb3bf-2e63-4cf8-8b9f-f237c18508f6-USATSI_19067883.jpg","source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Nottingham Forest v Manchester United: Carabao Cup semi-final, first leg – live","link":"https://www.theguardian.com/football/live/2023/jan/25/nottingham-forest-v-manchester-united-carabao-cup-semi-final-first-leg-live-score-updates","keywords":["Carabao Cup","Football","Nottingham Forest","Manchester United","Sport"],"creator":["Scott Murray"],"video_url":null,"description":"League Cup semi-final updates from the 8pm GMT kick-offSign up for the Football Daily email | Get in touch with ScottUnited get the ball rolling as the fans serenade the mist rolling in from the Trent. The City Ground really is in fine voice tonight.A moment of silence for Holocaust Memorial Day. Perfectly observed. Continue reading...","content":null,"pubDate":"2023-01-25 20:18:57","image_url":"https://i.guim.co.uk/img/media/a99590a8d8389d2147a58acf30eeb8ed143bebf3/262_792_6229_3739/master/6229.jpg?width=460&quality=85&auto=format&fit=max&s=aa454596dd416cae4fc19bd221a9e3cb","source_id":"theguardian","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Sassuolo, doppia seduta di allenamento in vista del Milan: il report","link":"https://www.milannews24.com/sassuolo-doppia-seduta-di-allenamento-in-vista-del-milan-il-report/","keywords":["News","ZOnefootball"],"creator":["Davide Lusinga"],"video_url":null,"description":"Il Sassuolo ha svolto una doppia seduta di allenamento in preparazione della sfida di domenica contro il Milan: il report completo Doppia seduta d’allenamento quest’oggi per i neroverdi al Mapei Football Center. Al mattino riscaldamento, lavoro di forza in palestra e trasformazione in campo; nel pomeriggio messa in azione, torello, esercitazioni tecniche, possesso palla e […] The post Sassuolo, doppia seduta di allenamento in vista del Milan: il report appeared first on Milan News 24.","content":"Il Sassuolo ha svolto una doppia seduta di allenamento in preparazione della sfida di domenica contro il Milan: il report completo Doppia seduta d’allenamento quest’oggi per i neroverdi al Mapei Football Center. Al mattino riscaldamento, lavoro di forza in palestra e trasformazione in campo; nel pomeriggio messa in azione, torello, esercitazioni tecniche, possesso palla e partita a metà campo. Domani, giovedì 26 gennaio, c’è in programma un allenamento pomeridiano. The post Sassuolo, doppia seduta di allenamento in vista del Milan: il report appeared first on Milan News 24.","pubDate":"2023-01-25 20:10:00","image_url":null,"source_id":"milannews24","category":["sports"],"country":["italy"],"language":"italian"},{"title":"Michigan State football hires Diron Reynolds as new defensive line coach","link":"http://rssfeeds.freep.com/~/725493311/0/freep/sports~Michigan-State-football-hires-Diron-Reynolds-as-new-defensive-line-coach/","keywords":null,"creator":["Chris Solari"," Detroit Free Press"],"video_url":null,"description":"Michigan State football coach Mel Tucker announced the hiring of defensive line coach Diron Reynolds, who spent the past seven seasons at Stanford.      ","content":"Michigan State football has a new defensive line coach for the second straight year. Mel Tucker on Wednesday announced the hire of Diron Reynolds, who spent the past seven seasons coaching the defensive line at Stanford. The 51-year-old Reynolds replaces Marco Coleman, who returned to his alma mater, Georgia Tech , after one season with the Spartans. “I've known Diron Reynolds for more than 15 years — he's one of the best coaches in the business,” Tucker said in a statement. “He has an impressive pedigree having worked for some of the top coaches in all of football, including Tony Dungy, Leslie Frazier, David Shaw and Jim Caldwell, and has coached in both the Super Bowl and College Football Playoff. He also has developed players at the highest level, from mentoring future NFL Draft picks to working daily with Pro Bowlers in the NFL. Diron is a family man with great character who will be relentless in leading and motivating our players on and off the field. I'm thrilled about this hire and can't wait to start working with him.” INTO THE PORTAL: DL Pietrowski headed to Wisconsin HEADED TO OSU: Ex-Michigan State football RB Elijah Collins lands at Oklahoma State Stanford's defense ranked 127th out of 131 Football Bowl Subdivision teams in rush defense last season, with the 224.4 yards given up per game the seventh-highest average allowed in program history, and 90th at 1.92 sacks per game. The Cardinal also had the 114th-rated overall defense, allowing 434.1 yards per game. Their 2021 run defense allowed 235.7 yards per game, third-most in school history. Shaw resigned as head coach after the season — the Cardinal went 42-40 the past seven seasons, including 3-9 in both 2021 and 2022 — and new Stanford coach Troy Taylor did not retain Reynolds. Coleman left earlier this month for Georgia Tech, where he coached from 2019-21 after a 14-year NFL playing career. In his one season in East Lansing, the Spartans battled injuries and attrition across the defensive line —particularly at defensive end — and allowed opposing running backs to eclipse 100 yards in each of the final nine games. MSU’s run defense ranked 102nd in the FBS at 178.6 yards per game, the most allowed by the Spartans since 2002 (213.8 yards). They ranked 44th in both team sacks (2.42 per game) and tackles for loss (6.3 per game). Enter Reynolds, who coached defensive line at Stanford from 2016-22 and also spent 2014 there as a defensive assistant. He coached four NFL draft picks with the Cardinal: 2017 first-rounder Solomon Thomas (the No. 3 overall pick), 2018 third-rounder Harrison Phillips, 2020 seventh-rounder Casey Toohill and 2022 fifth-rounder Thomas Booker. Reynolds, a 1994 Wake Forest alum and native of Aiken, South Carolina, also spent 2015 as Oklahoma’s defensive line coach. Prior to that, he was in the NFL for 11 seasons. That included working in quality control for the Colts from 2002-06, including their Super Bowl 41 victory under Dungy. Reynolds spent one year with the Dolphins in 2007 as defensive line coach, then moved on to the Vikings from 2009-13 as assistant defensive line coach. Reynolds’ previous college stops included Indiana (2001, defensive tackles) and Wake Forest (1999-2000, outside linebackers; 1997-98, graduate assistant). Contact Chris Solari: csolari@freepress.com . Follow him on Twitter @chrissolari . Read more on the Michigan State Spartans and sign up for our Spartans newsletter.","pubDate":"2023-01-25 20:08:44","image_url":null,"source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Jamie Carragher angrily hits back at football agent over ‘uneducated’ jibes","link":"https://www.independent.ie/sport/soccer/jamie-carragher-angrily-hits-back-at-football-agent-over-uneducated-jibes-42313107.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"Jamie Carragher has hit back at football agent Kia Joorabchian, after he labelled him as ‘uneducated’ during an outspoken appearance on UK radio network talkSPORT.","content":null,"pubDate":"2023-01-25 19:36:15","image_url":"https://www.independent.ie/sport/soccer/96a49/42313104.ece/AUTOCROP/w1240h700/carra1.jpg","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"}]}