{"newsArray":[{"article_id":"aa823666f94f112243b1f4ed70cec088","title":"Police reviewing Roy Keane and Micah Richards confrontation","link":"https://www.oxfordmail.co.uk/sport/23765033.police-reviewing-roy-keane-micah-richards-confrontation/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Sky Sports pundits Micah Richards and Roy Keane were involved in a confrontation with a fan at Arsenal's clash with Manchester United on Sunday.","content":"Ex-England and Manchester City defender Richards was working as a Sky Sports studio pundit at the Emirates, alongside Keane, Gary Neville and Theo Walcott. The video shows Richards trying to calm things down and appearing to restrain an unidentified man, who had allegedly aimed a headbutt at Keane and attempted to strike him on the chest and chin, police have now launched an investigation over. A man wearing a suit is then seen trying to separate the pair moves across and also appears to grab the male's shirt. Micah Richards go change am for the fan wey headbutt Roy Keane. It is unclear when the incident took place although are seen in the same clothing they wore for Sky's Super Sunday programme. Richards is seen wearing a black backpack , has a jacket in his hand during the incident. The duo had been on air until 7.30pm in North London on Sunday evening when Sky's coverage ended. Met Police statement confirmed it had launched an investigation but there had been no arrests, with enquiries ongoing. A statement read: \"Police are investigating following an assault that is alleged to have occurred at the Emirates Stadium during an Arsenal v Manchester United match on Sunday, 3 September.\" Roy Keane, is a spurs man! A spokesperson for Sky Sports told Mirror Football: \"We understand the police are investigating an alleged assault by a member of the public immediately preceding the footage circulating on social media. In the footage seen, Micah Richards was acting to diffuse a situation.\" Richards, 35, retired from football in 2019 after spells with Manchester City, Fiorentina and Aston Villa before embarking on a successful punditry career. The incident happened towards the end of the game after Alejandro Garnacho looked to have won the match for United in the 88th minute before VAR ruled the goal out.","pubDate":"2023-09-04 08:10:20","image_url":"https://www.oxfordmail.co.uk/resources/images/17186800/?type=app&htype=0","source_id":"oxfordmail","source_priority":41844596,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d41cc15c98be7b4f910b2680eac345de","title":"Бодигардът на Меси отново в действие (видео)","link":"https://gong.bg/football-sviat/drugi/multimedia/video/bodigardyt-na-mesi-otnovo-v-dejstvie-video-752034","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Аржентинската суперзвезда Лионел Меси продължава да прави фурор в САЩ. Преди часове неговият Интер Маями успя да надвие новия тим на Филип Кръстев Лос Анджелис ФК с 3:1 в мач от МЛС. Меси се отличи с две асистенции в двубоя. Около аржентиенца нашумя и бодигардът му, който пази световния шампион не само извън терените, но и повреме на мачовете. В една от срещите той бе уловен как тича край страничната линия и следи за безопасността на Меси. В мача срещу Лос Анджелис ФК пък бодигардът се намеси по-бързо от стюардите, когато фен нахлу на стадиона, за да стигне до Лионел Меси. Мъжът се справи лично със запалянкото, след което го \"предаде\" на стюардите. A fan has tried to touch Messi. Look at the bodyguard 😭😭 pic.twitter.com/u9gnhrKqqz — Tulip (@tulipfcb) September 4, 2023","pubDate":"2023-09-04 06:39:01","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"3be115cf37a2864ea86bfae4ea4757e7","title":"Левски се размина с нигерийски нападател","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/levski-se-razmina-s-nigerijski-napadatel-752033","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Левски се размина с привличането на Сънди Адетунджи. Нигерийският нападател бе един от вариантите на \"сините\" за подсилване на атаката. 25-годишният таран бе свободен агент, а представители на столичани проведоха разговори с него. В крайна сметка обаче Адетунджи е предпочел предложението на завършилия на трето място в Сърбия през миналия сезон - Чукарички. След като \"сините\" достигнаха до плейофите за влизане в групите на Лигата на конференциите, треньорът Николай Костов получи уверение от ръководството, че ще бъде направено всичко възможно отборът да бъде подсилен. Освен за нападението, на \"Герена\" се оглеждат и за десен бек. Причината е, че Жереми Петрис има договор до края на кампанията и към момента отказва да го удължи.","pubDate":"2023-09-04 06:37:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"0317d18ab1a7a707d5cd5a837869e905","title":"Kickoff | 'If it wasn't for soccer, I don't know where I'd be'","link":"https://www.snl24.com/kickoff/lifestyle/ct-city-attacker-reveals-mark-byrnes-big-influence-20230904","keywords":null,"creator":null,"video_url":null,"description":"Cape Town City star Jaedin Rhodes has shared how the late Mark Byrne helped him reach his dream of becoming a professional footballer, the biggest lesson he has learnt and so much more.","content":"Sunglass Hut and Kickoff approached four rising stars who participated in a photoshoot where the quartet of youngsters got to show off a side to them that fans may have not seen before. As part of the campaign, this week sees the Citizens' prolific forward sit down with KickOff and share some of how it felt to make his debut along with Rhodes' views on his \"sexy\" style and how he deals with disappointment. I knew from my time at Hellenic because me and Mark Byrne were very close and he made it clear to me that I had the potential to make it to the top. He made me make sacrifices like moving me out of Atlantis away from my family, put me in a school so I knew that at some point I had to make it. I can't go through all this stuff and not reach the finish line. Just two years ago, I was sitting in the stand watching Cape Town City and Ajax Cape Town play against each other and here I am the field. It was a big achievement. Neymar, he is creative and stylish. I am that kind of player. In this world, it is you versus you. If you don't go out there and get it, no one is going to do it for you. I prefer a bit of both. It depends on the occasion, I like to mix it up sometimes a nice oversized t-shirt with jeans. Keagan Buchanan. Keagan Buchanan, if you go to his Instagram. The tattoos, the jewellery he has on, everything is stylish. The stuff that goes on social media can affect your mind and thinking, So it is not good for you but its not all bad. I am a person that loves to ignore negative comments, i don't still bother by replying or reading that stuff. It depends on my mood so maybe i will go the mall but I love going to the beach where I kick the ball around. The sport I love besides soccer is tennis. I grew up watching tennis and my favourite player is Rafael Nadal. I'm not bad at playing tennis, I can play but I won't say I am good at it. If it wasn't for soccer I don't know where I would be. Growing up, it was something else. I went on wrong route. Soccer saved my life. Another career i would consider is being a model. Giveon, Meek Mill and Nipsey Hussle. Before I go onto the pitch, I listen to Stay from Rihanna and after that I will listen to Meek Mill to get me hyped up. Sometimes it is tough to deal with it but you can't be too hard on yourself. You may feel disappointment but there is always a next game to improve and a next training session to improve. If you want to go get something, never stop never settle keep going. That football can change very quickly. it can take you up but it can take you down as well. Someone who is experienced told me this. Sexy Piano, this is the instrument I always wanted to play. I just love the way it sounds.","pubDate":"2023-09-04 06:36:50","image_url":"https://cdn.24.co.za/files/Cms/General/d/8931/2c01d7b2e6b6489c885e371bd6f8b01e.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"863a6c16186ab00a2b6713da74fec8cb","title":"OL : la nouvelle annonce polémique de Blanc sur son avenir, Cucci y va aussi de sa sortie !","link":"https://www.butfootballclub.fr/ol/actualite/ol-psg-laurent-blanc-a-vecu-un-cauchemar-son-president-entretient-le-flou-sur-la-suite-832009","keywords":null,"creator":null,"video_url":null,"description":"Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin est proche...","content":"Déjà menacé avant la rencontre, Laurent Blanc a de fortes chances de ne pas survivre à la trêve internationale sur le banc de l’OL. Lourdement battu par le PSG (1-4), le Cévénol a reconnu avoir vécu « un cauchemar » durant « tout le match » : « Dans l'analyse, tout le monde a sa part de responsabilité. Si l'objectif est de se qualifier en Ligue des champions, comme vous le dites, on a vraiment beaucoup de travail. On a des problèmes, il va falloir les régler ». « Je ne suis pas dans une meilleure situation qu’avant » Alpagué par les Bad Gones qui ont déployé un cinglant message à son endroit (« Blanc, si tu n'as plus les couilles de te battre, démissionne »), Laurent Blanc - qui avait échangé avec son président délégué Santiago Cucci juste avant dans le vestiaire - n’a pas voulu répondre en conférence de presse d’après-match : « Je ne vais pas parler de ça parce que je vais être un peu cru. Les supporters ont raison d'être déçus. Est-ce que je suis menacé ? Quand un entraîneur n'a pas de résultat, il est en danger. Donc ce soir après ce match, je ne suis pas dans une meilleure situation qu'avant. » Au micro d’Amazon Prime Vidéo, l’ancien coach du PSG a également été interrogé sur son avenir. « La question ne s’est pas pas posée. J’essaierais d’être là dans 15 jours », a-t-il répondu avec le sourire aux lèvres. Une sortie et une attitude qui ne manquent pas de faire polémique. Cucci veut un « entraîneur qui entraîne » Ce n’est d’ailleurs pas les propos de Santiago Cucci face à la presse en parallèle de son passage en conférence de presse qui sont de nature à rassurer sur son cas : « Laurent Blanc ? Ce n'est pas le sujet. Je ne vais pas vous répondre tout de suite. Il faut un entraîneur qui entraîne. » Relancé sur le fait que cette phrase ressemblait à une pique à Laurent Blanc, l’ancien PDG de Levi’s Europe a démenti : « Je ne suis pas en train de vous dire ça. Il n'y a pas que lui qui est responsable, ce n'est pas lui qui joue au foot ». La quinzaine risque d’être animée à Lyon… Et si Botafogo a refusé la démission de Bruno Lage (et donc son arrivée anticipée dans la Capitale des Gaules !), rien ne dit que l’OL ne cherchera pas quelqu’un d’autre pour relancer les Gones, désormais derniers de Ligue 1. Cucci : \"Laurent Blanc ? Je ne vais pas vous répondre ce soir. Il n'y a pas que l'entraîneur qui est responsable.\" #OLPSG pic.twitter.com/c5lbLsN2BJ — Alexandre Corboz (@AlexCorboz) September 3, 2023 function getDimensionGA() { var dimension1 = \"142\"; return dimension1; } var logora_config = { shortname: \"horyzon-f09581\", debate: { identifier: \"16-832009\" }, source: { source_url: \"https://www.butfootballclub.fr/ol/actualite/ol-psg-laurent-blanc-a-vecu-un-cauchemar-son-president-entretient-le-flou-sur-la-suite-832009\", uid: \"16-832009\", title: \"OL : la nouvelle annonce polémique de Blanc sur son avenir, Cucci y va aussi de sa sortie ! \", description: \"Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin est proche...\", origin_image_url: \"https://static.butfootballclub.fr/16/2023/09/photo_article/832009/332977/1200-L-ol-psg-laurent-blanc-a-vcu-un-cauchemar-son-prsident-entretient-le-flou-sur-la-suite.jpg\", published_date: \"2023-09-04T08:20:00+01:00\", publisher: \"But! Football Club\", tag_objects: [ { name: \"But! Football Club ol\", uid: \"but-ol\" }, { name: \"But! Football Club Général\", uid: \"but-general\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, { name: \"But! Football Club Ligue 1\", uid: \"but-Ligue1\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, ] } }; (function() { var d = document, s = d.createElement('script'); s.src = 'https://api.logora.fr/synthese.js'; (d.head || d.body).appendChild(s); })(); Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin de l'aventure se précise durant la trêve internationale. Rédacteur Alexandre Corboz","pubDate":"2023-09-04 06:20:00","image_url":"https://static.butfootballclub.fr/16/2023/09/photo_article/832009/332977/1200-L-ol-psg-laurent-blanc-a-vcu-un-cauchemar-son-prsident-entretient-le-flou-sur-la-suite.jpg","source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"51edaf54806dd7fc0c3319813b8c1793","title":"Помощниците на героите - топ 5 асистенции на 8-ия кръг в efbet Лига","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/pomoshtnicite-na-geroite-top-5-asistencii-na-8-iia-kryg-v-efbet-liga-752030","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Изиграха се седем срещи от 8-ия кръг на efbet Лига. Паднаха 19 гола, като някои от тях бяха благодарение на отлични асистенции. Затова традиционно сме отличили най-добрите такива в \"Помощниците на героите\". Асистенцията на Тобиас Хайнц е една от тях. Той намери Джонатан Линдсет с подаване в наказателното поле, а съотборникът му оформи крайният резултат 3:0 за ЦСКА срещу Берое. Следва извеждащият пас на Галин Иванов, който разсече защитата на Ботев и донесе единственото и почетно попадение за Славия при загубата с 1:3. В класацията ни намира място и асистенцията на Джовани за гола на Евандро срещу Крумовград, при която имаше и доза късмет, но и невероятна комбинация и атака, изградена от Локомотив Пловдив. А Евандро направи най-лесното - вкара в опразнената врата. В специалното видео може да видите още подаването на Янис Карабельов, който намери свободния Ивелин Попов, а това доведе до откриващия гол на Ботев срещу Славия, както и страхотният пас на далечна греда от Николай Янков, който доведе до гол от воле на Крум Стоянов и съответно изравнително попадение за Етър срещу Локомотив София. Вижте всички изпълнения във видеото.","pubDate":"2023-09-04 06:17:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"5ba396290c60369006f7f404d075cb98","title":"Piers Morgan offers Sancho a Cristiano Ronaldo-style interview after attacking Ten Hag","link":"https://www.express.co.uk/sport/football/1809000/man-utd-news-piers-morgan-cristiano-ronaldo-jadon-sancho-erik-ten-hag","keywords":null,"creator":null,"video_url":null,"description":"Jadon Sancho has hit back at Erik ten Hag after claiming he was dropped for Manchester United's defeat to Arsenal due to a lack of form in training.","content":"Piers Morgan has offered Jadon Sancho the chance to air the truth behind his showdown with Erik ten Hag on his TV show, Piers Morgan Uncensored. It comes after the Manchester United winger hit out at the Dutchman following claims he dropped Sancho due to the manner of his performances in training. Sancho failed to make the bench as his United team-mates slumped to a 3-1 defeat against Arsenal at the Emirates Stadium. Ten Hag said following the clash: \"Jadon, on his performances in training we did not select him. \"You have to reach a level every day at Manchester United and we can make choices in the front line. So for this game he was not selected.\" It prompted the England international to respond on social media as he issued a statement defending his performances at Carrington - declaring there were exterior motives behind his omission. Now Arsenal fan Morgan has stirred the pot, tweeting : \"Hi Jadon, come on @PiersUncensored and I’ll get you out of this Ten Hag nightmare.\" It's safe to say it's unlikely Sancho will be taking Morgan up on his offer, like Cristiano Ronaldo did last year, as he awaits his potential fate at Carrington on Monday. The 23-year-old said on his social media channels: \"Please don't believe everything you read. \"I will not allow people saying things that is completely untrue, I have conducted myself very well in training this week. \"I believe there are other reasons for this matter that I won't go into, I've been a scapegoat for a long time which isn't fair!\" Sancho, who has featured in all three of United's other Premier League matches, added: \"All I want to do is play football with a smile on my face and contribute to my team. \"I respect all decisions that are made by the coaching staff, I play with fantastic players and am grateful to do so, which I know every week is a challenge. \"I will continue to fight for this badge no matter what.\" Last year, Sancho was exiled from the United first-team picture and was sent to Holland during the World Cup to work on his performance and fitness levels with a private coach. He was later reintegrated into the United setup and was back with a bang as he inspired a fightback against Leeds from the bench at Old Trafford in February. However, he has since struggled to nail down a starting berth despite United's struggles in attack and now Sancho is facing yet another obstacle as he bids to turn his Old Trafford career around. Sancho has not been part of an England squad since way back in October 2021 when he provided two assists in a 5-0 win over Andorra.","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"express","source_priority":1139,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0025080afcbe7d976e84918591f0d2fe","title":"Arsenal recreate the Battle of Old Trafford with pizzas all round in Man Utd victory","link":"https://www.express.co.uk/sport/football/1808963/Arsenal-Battle-of-Old-Trafford-Man-Utd","keywords":null,"creator":null,"video_url":null,"description":"COMMENT: Arsenal celebrated their victory over Man Utd in style","content":"It was as if Martin Keown was bouncing in the face of Ruud van Nistelrooy all over again. The late drama of 2003’s Battle of Old Trafford was being repeated here at the Emirates as Arsenal snatched victory from what looked like a last-gasp defeat. And boy did the Gunners celebrate it. Pizzas all round, no doubt! As the emotions ebbed away with the fans into the unseasonably warm London evening, cold reason could only conclude it was a win that Arsenal had deserved. They had dominated most of the match and some better, more incisive finishing in front of goal might have given them the win before all the late drama. Any sort of drama would have been welcome in a fairly drab first half save for a couple of minutes which served up goals at either end. Kai Havertz had already fluffed an appalling left-foot shot with the goal at his mercy in the 13th minute, then gave the ball away cheaply in the 27th. Christian Eriksen’s pass was as immaculate as ever and Marcus Rashford was on it straight away, his shot was too strong to be pushed away by the fingertips of Aaron Ramsdale. Arsenal responded to going behind against the run of play instantly, though when Martin Odegaard hammered in a drive from the edge of the area. That was pretty much it until an incident on the hour-mark that would be a prelude to all the drama. When Havertz went to the floor under challenge from Aaron Wan-Bissake, referee Anthony Taylor pointed to the spot. It looked clumsy, but every replay seemed to show less and less contact, until eventually Australian VAR Jarred Gillett, still establishing himself in this country, made the brave call to suggest arguably the country’s leading official had possibly made a mistake. (It’s supposed to take out the human element, right?) The important thing was that Taylor agreed after looking at the monitor and it looked as though United were going to hold on for a point they ill-deserved. Rasmus Winther Hojlund finally came on for his debut and looked abrasive and bristling, but was fighting a lone battle with no real understanding with the players around him. At the other end, United were to end the game with Harry Maguire and Jonny Evans. The first game after the window had shut, nothing about it was saying title challengers. Yet Erik Ten Hag and his player thought they had nicked all three of the points. Substitute Alejandro Garnacho ran clear on a counter-attack in the 87th minute and coolly slid the ball past Ramsdale as the away fans went wild. VAR had not finished for the evening, though - and after an agonising couple of minutes decided the Argentina international had started marginally offside. That was just the start of it. Eight minutes of additional time were indicated and in the sixth of these Declan Rice bundled the ball home and a slight deflection off Evans was no more than he deserved for another commanding midfield performance. The Emirates went mad. Assistant manager Albert Stuivenberg was booked for going a bit too wild, but as with Keown all those years ago when Ruud Van Nistelrooy missed a last-minute penalty to leave the game goalless, there was a lot of emotion sitting behind that dam. These days, though, we have added time to the added time and United sense there was still time for one last twist. Instead, it was Gabriel Jesus who sprinted from the half-way line, left Diago Dalot on his backside and swept the ball into the empty corner of the net. The scoreline certainly could have been very different, but ultimately the worry for Ten Hag is it was probably a fair reflection of the relative balance between these two auld enemies at the moment.","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"express","source_priority":1139,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"65cfdc8d62c2d085bb0da49a52e94a8c","title":"ASSE : Batlles prend une première décision radicale à la trêve","link":"https://www.butfootballclub.fr/asse/actualite/asse-batlles-prend-une-premiere-decision-radicale-a-la-treve-832024","keywords":null,"creator":null,"video_url":null,"description":"Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve.","content":"L’ASSE n’avance pas. Après cinq journées de championnat, les hommes de Laurent Batlles n’ont grappillé que 5 point et pointent à une piteuse 15e place du classement de Ligue 2. Ce n’est pas le contenu du match nul contre le VAFC samedi à Geoffroy-Guichard qui incite à l’optimisme (1-1). « Je ne sais pas pourquoi on n'y arrive pas. À un moment, il faut qu'on prenne conscience qu'on est capable de faire beaucoup mieux a-t-il pesté après la rencontre. On parle beaucoup d'équilibre, on parle beaucoup de notre propension à trop aller vers l'avant, mais pour autant là maintenant, il y a de l'équilibre, mais on ne met pas en danger l'équipe adverse. Il faut qu'on trouve un juste milieu par rapport à ça. J'aimerais que les joueurs dépassent leurs fonctions. On se rend compte que si on veut gagner des matchs, il faut marquer. Peut-être que maintenant, il faut prendre des risques. » Retrouvez toute l'actualité de l'ASSE Un match contre le FC Sion au programme Pour remettre tout son petit monde dans le droit chemin, le coach de l’ASSE a décidé de muscler son jeu pendant la trêve internationale. Vendredi, Le Progrès fait savoir que les Verts ont ainsi prévu de disputer un match amical face au FC Sion. L’horaire de ce match amical reste à déterminer. L’ #ASSE va disputer un match amical durant la trêve internationale, ce sera face au FC Sion (🇨🇭), ce vendredi ! Via @leprogres_asse . pic.twitter.com/7e5v5jZF2s — News Sainte (@news_sainte_) September 3, 2023 function getDimensionGA() { var dimension1 = \"145\"; return dimension1; } var logora_config = { shortname: \"horyzon-f09581\", debate: { identifier: \"16-832024\" }, source: { source_url: \"https://www.butfootballclub.fr/asse/actualite/asse-batlles-prend-une-premiere-decision-radicale-a-la-treve-832024\", uid: \"16-832024\", title: \"ASSE : Batlles prend une première décision radicale à la trêve\", description: \"Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve.\", origin_image_url: \"\", published_date: \"2023-09-04T08:00:00+01:00\", publisher: \"But! Football Club\", tag_objects: [ { name: \"But! Football Club asse\", uid: \"but-asse\" }, { name: \"But! Football Club Général\", uid: \"but-general\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, { name: \"But! Football Club Ligue 2\", uid: \"but-Ligue2\" }, ] } }; (function() { var d = document, s = d.createElement('script'); s.src = 'https://api.logora.fr/synthese.js'; (d.head || d.body).appendChild(s); })(); Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve : disputer un match amical. Rédacteur Bastien Aubert","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"69ba62c0916a5fffbe1490a9c9a86cf7","title":"Trent Alexander-Arnold, Ibrahima Konate, Thiago Alcantara - Liverpool injury news and return dates ahead of Wolves","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-injury-news-konate-alexander-27559709","keywords":["Sport"],"creator":null,"video_url":null,"description":"Latest Liverpool injury news as Jurgen Klopp's side prepare to take on Wolves after the international break in the Premier League","content":"Liverpool will look to continue their impressive start to the season when they return to action after the international break. The Reds beat Aston Villa to make it three wins and a draw in their opening four games of the new campaign, easing to a 3-0 victory at Anfield. The season opened with a 1-1 draw at Stamford Bridge against Chelsea before a victory over Bournemouth at Anfield. Liverpool then travelled to St James' Park, seeing Virgil van Dijk sent off and falling behind to a Anthony Gordon goal. Darwin Nunez came off the bench to score twice late on to win the game for Liverpool. However, injury problems are starting to add up for Jurgen Klopp, with Trent Alexander-Arnold substituted with a hamstring concern against Villa. Even just a few weeks into the new season the Reds have a number of injuries to contend with. But Klopp will hope to have some players back fit after the international break, below is the latest Liverpool injury news: Trent Alexander-Arnold took a knock in the 3-0 win over Aston Villa, limping off and straight down the tunnel with just under 20 minutes to play. Jurgen Klopp admitted afterwards that it was a hamstring problem and that the Scouse full-back would need a scan to discover the extent of any damage. Speaking on the injury, Klopp said: \"I asked him and he said it’s (his) hamstring. Not too serious is his opinion, but we obviously have to wait for the scans. Then we will know more.\" French defender Ibrahima Konate missed the wins over Newcastle and Aston Villa with Jurgen Klopp hopeful he'd be fit for Wolves after the international break. But with France initially selecting the centre-back for their squad to face Ireland and Germany, before swapping for Jean-Clair Tobido, it has raised fears that the injury is worse than first thought. The hamstring problem wasn't believed to be too serious, but Liverpool will be hoping he's back fit for Wolves. T was close to a long awaited return to action before suffering a setback in training and remaining sidelined. Jurgen Klopp confirmed that, like Curtis Jones, the Spaniard would be back in training after Newcastle, but the Spaniard would return too quickly and will now try to get back to fill fitness during the international break. \"Thiago had a little setback. He started training with the team and had a little setback so we have to slow down there a little bit,\" Klopp said. “It’s not cool for him, it’s not cool for us but it’s how it is. Thiago will use the (September) international break for that, to be up to speed I’m pretty sure. It should hopefully be enough. All the rest are available.” The young full-back showed potential with pre-season performances in Germany, playing 90 minutes over the course of two fixtures. He was then left out of the group that travelled to Singapore following a minor, unspecified injury and has not featured in any matchday squads since the start of the season, though has been involved in training since his team-mates returned to England. Once fit the Northern Irishman is expected to slot into Klopp's plans as understudy to Alexander-Arnold, having proven himself in League One with Bolton Wanderers last year. Unknown.","pubDate":"2023-09-04 06:00:00","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27645923.ece/ALTERNATES/s98/0_GettyImages-1657422730.jpg","source_id":"liverpoolecho","source_priority":3400,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"aa823666f94f112243b1f4ed70cec088","title":"Police reviewing Roy Keane and Micah Richards confrontation","link":"https://www.oxfordmail.co.uk/sport/23765033.police-reviewing-roy-keane-micah-richards-confrontation/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Sky Sports pundits Micah Richards and Roy Keane were involved in a confrontation with a fan at Arsenal's clash with Manchester United on Sunday.","content":"Ex-England and Manchester City defender Richards was working as a Sky Sports studio pundit at the Emirates, alongside Keane, Gary Neville and Theo Walcott. The video shows Richards trying to calm things down and appearing to restrain an unidentified man, who had allegedly aimed a headbutt at Keane and attempted to strike him on the chest and chin, police have now launched an investigation over. A man wearing a suit is then seen trying to separate the pair moves across and also appears to grab the male's shirt. Micah Richards go change am for the fan wey headbutt Roy Keane. It is unclear when the incident took place although are seen in the same clothing they wore for Sky's Super Sunday programme. Richards is seen wearing a black backpack , has a jacket in his hand during the incident. The duo had been on air until 7.30pm in North London on Sunday evening when Sky's coverage ended. Met Police statement confirmed it had launched an investigation but there had been no arrests, with enquiries ongoing. A statement read: \"Police are investigating following an assault that is alleged to have occurred at the Emirates Stadium during an Arsenal v Manchester United match on Sunday, 3 September.\" Roy Keane, is a spurs man! A spokesperson for Sky Sports told Mirror Football: \"We understand the police are investigating an alleged assault by a member of the public immediately preceding the footage circulating on social media. In the footage seen, Micah Richards was acting to diffuse a situation.\" Richards, 35, retired from football in 2019 after spells with Manchester City, Fiorentina and Aston Villa before embarking on a successful punditry career. The incident happened towards the end of the game after Alejandro Garnacho looked to have won the match for United in the 88th minute before VAR ruled the goal out.","pubDate":"2023-09-04 08:10:20","image_url":"https://www.oxfordmail.co.uk/resources/images/17186800/?type=app&htype=0","source_id":"oxfordmail","source_priority":41844596,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d41cc15c98be7b4f910b2680eac345de","title":"Бодигардът на Меси отново в действие (видео)","link":"https://gong.bg/football-sviat/drugi/multimedia/video/bodigardyt-na-mesi-otnovo-v-dejstvie-video-752034","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Аржентинската суперзвезда Лионел Меси продължава да прави фурор в САЩ. Преди часове неговият Интер Маями успя да надвие новия тим на Филип Кръстев Лос Анджелис ФК с 3:1 в мач от МЛС. Меси се отличи с две асистенции в двубоя. Около аржентиенца нашумя и бодигардът му, който пази световния шампион не само извън терените, но и повреме на мачовете. В една от срещите той бе уловен как тича край страничната линия и следи за безопасността на Меси. В мача срещу Лос Анджелис ФК пък бодигардът се намеси по-бързо от стюардите, когато фен нахлу на стадиона, за да стигне до Лионел Меси. Мъжът се справи лично със запалянкото, след което го \"предаде\" на стюардите. A fan has tried to touch Messi. Look at the bodyguard 😭😭 pic.twitter.com/u9gnhrKqqz — Tulip (@tulipfcb) September 4, 2023","pubDate":"2023-09-04 06:39:01","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"3be115cf37a2864ea86bfae4ea4757e7","title":"Левски се размина с нигерийски нападател","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/levski-se-razmina-s-nigerijski-napadatel-752033","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Левски се размина с привличането на Сънди Адетунджи. Нигерийският нападател бе един от вариантите на \"сините\" за подсилване на атаката. 25-годишният таран бе свободен агент, а представители на столичани проведоха разговори с него. В крайна сметка обаче Адетунджи е предпочел предложението на завършилия на трето място в Сърбия през миналия сезон - Чукарички. След като \"сините\" достигнаха до плейофите за влизане в групите на Лигата на конференциите, треньорът Николай Костов получи уверение от ръководството, че ще бъде направено всичко възможно отборът да бъде подсилен. Освен за нападението, на \"Герена\" се оглеждат и за десен бек. Причината е, че Жереми Петрис има договор до края на кампанията и към момента отказва да го удължи.","pubDate":"2023-09-04 06:37:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"0317d18ab1a7a707d5cd5a837869e905","title":"Kickoff | 'If it wasn't for soccer, I don't know where I'd be'","link":"https://www.snl24.com/kickoff/lifestyle/ct-city-attacker-reveals-mark-byrnes-big-influence-20230904","keywords":null,"creator":null,"video_url":null,"description":"Cape Town City star Jaedin Rhodes has shared how the late Mark Byrne helped him reach his dream of becoming a professional footballer, the biggest lesson he has learnt and so much more.","content":"Sunglass Hut and Kickoff approached four rising stars who participated in a photoshoot where the quartet of youngsters got to show off a side to them that fans may have not seen before. As part of the campaign, this week sees the Citizens' prolific forward sit down with KickOff and share some of how it felt to make his debut along with Rhodes' views on his \"sexy\" style and how he deals with disappointment. I knew from my time at Hellenic because me and Mark Byrne were very close and he made it clear to me that I had the potential to make it to the top. He made me make sacrifices like moving me out of Atlantis away from my family, put me in a school so I knew that at some point I had to make it. I can't go through all this stuff and not reach the finish line. Just two years ago, I was sitting in the stand watching Cape Town City and Ajax Cape Town play against each other and here I am the field. It was a big achievement. Neymar, he is creative and stylish. I am that kind of player. In this world, it is you versus you. If you don't go out there and get it, no one is going to do it for you. I prefer a bit of both. It depends on the occasion, I like to mix it up sometimes a nice oversized t-shirt with jeans. Keagan Buchanan. Keagan Buchanan, if you go to his Instagram. The tattoos, the jewellery he has on, everything is stylish. The stuff that goes on social media can affect your mind and thinking, So it is not good for you but its not all bad. I am a person that loves to ignore negative comments, i don't still bother by replying or reading that stuff. It depends on my mood so maybe i will go the mall but I love going to the beach where I kick the ball around. The sport I love besides soccer is tennis. I grew up watching tennis and my favourite player is Rafael Nadal. I'm not bad at playing tennis, I can play but I won't say I am good at it. If it wasn't for soccer I don't know where I would be. Growing up, it was something else. I went on wrong route. Soccer saved my life. Another career i would consider is being a model. Giveon, Meek Mill and Nipsey Hussle. Before I go onto the pitch, I listen to Stay from Rihanna and after that I will listen to Meek Mill to get me hyped up. Sometimes it is tough to deal with it but you can't be too hard on yourself. You may feel disappointment but there is always a next game to improve and a next training session to improve. If you want to go get something, never stop never settle keep going. That football can change very quickly. it can take you up but it can take you down as well. Someone who is experienced told me this. Sexy Piano, this is the instrument I always wanted to play. I just love the way it sounds.","pubDate":"2023-09-04 06:36:50","image_url":"https://cdn.24.co.za/files/Cms/General/d/8931/2c01d7b2e6b6489c885e371bd6f8b01e.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"863a6c16186ab00a2b6713da74fec8cb","title":"OL : la nouvelle annonce polémique de Blanc sur son avenir, Cucci y va aussi de sa sortie !","link":"https://www.butfootballclub.fr/ol/actualite/ol-psg-laurent-blanc-a-vecu-un-cauchemar-son-president-entretient-le-flou-sur-la-suite-832009","keywords":null,"creator":null,"video_url":null,"description":"Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin est proche...","content":"Déjà menacé avant la rencontre, Laurent Blanc a de fortes chances de ne pas survivre à la trêve internationale sur le banc de l’OL. Lourdement battu par le PSG (1-4), le Cévénol a reconnu avoir vécu « un cauchemar » durant « tout le match » : « Dans l'analyse, tout le monde a sa part de responsabilité. Si l'objectif est de se qualifier en Ligue des champions, comme vous le dites, on a vraiment beaucoup de travail. On a des problèmes, il va falloir les régler ». « Je ne suis pas dans une meilleure situation qu’avant » Alpagué par les Bad Gones qui ont déployé un cinglant message à son endroit (« Blanc, si tu n'as plus les couilles de te battre, démissionne »), Laurent Blanc - qui avait échangé avec son président délégué Santiago Cucci juste avant dans le vestiaire - n’a pas voulu répondre en conférence de presse d’après-match : « Je ne vais pas parler de ça parce que je vais être un peu cru. Les supporters ont raison d'être déçus. Est-ce que je suis menacé ? Quand un entraîneur n'a pas de résultat, il est en danger. Donc ce soir après ce match, je ne suis pas dans une meilleure situation qu'avant. » Au micro d’Amazon Prime Vidéo, l’ancien coach du PSG a également été interrogé sur son avenir. « La question ne s’est pas pas posée. J’essaierais d’être là dans 15 jours », a-t-il répondu avec le sourire aux lèvres. Une sortie et une attitude qui ne manquent pas de faire polémique. Cucci veut un « entraîneur qui entraîne » Ce n’est d’ailleurs pas les propos de Santiago Cucci face à la presse en parallèle de son passage en conférence de presse qui sont de nature à rassurer sur son cas : « Laurent Blanc ? Ce n'est pas le sujet. Je ne vais pas vous répondre tout de suite. Il faut un entraîneur qui entraîne. » Relancé sur le fait que cette phrase ressemblait à une pique à Laurent Blanc, l’ancien PDG de Levi’s Europe a démenti : « Je ne suis pas en train de vous dire ça. Il n'y a pas que lui qui est responsable, ce n'est pas lui qui joue au foot ». La quinzaine risque d’être animée à Lyon… Et si Botafogo a refusé la démission de Bruno Lage (et donc son arrivée anticipée dans la Capitale des Gaules !), rien ne dit que l’OL ne cherchera pas quelqu’un d’autre pour relancer les Gones, désormais derniers de Ligue 1. Cucci : \"Laurent Blanc ? Je ne vais pas vous répondre ce soir. Il n'y a pas que l'entraîneur qui est responsable.\" #OLPSG pic.twitter.com/c5lbLsN2BJ — Alexandre Corboz (@AlexCorboz) September 3, 2023 function getDimensionGA() { var dimension1 = \"142\"; return dimension1; } var logora_config = { shortname: \"horyzon-f09581\", debate: { identifier: \"16-832009\" }, source: { source_url: \"https://www.butfootballclub.fr/ol/actualite/ol-psg-laurent-blanc-a-vecu-un-cauchemar-son-president-entretient-le-flou-sur-la-suite-832009\", uid: \"16-832009\", title: \"OL : la nouvelle annonce polémique de Blanc sur son avenir, Cucci y va aussi de sa sortie ! \", description: \"Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin est proche...\", origin_image_url: \"https://static.butfootballclub.fr/16/2023/09/photo_article/832009/332977/1200-L-ol-psg-laurent-blanc-a-vcu-un-cauchemar-son-prsident-entretient-le-flou-sur-la-suite.jpg\", published_date: \"2023-09-04T08:20:00+01:00\", publisher: \"But! Football Club\", tag_objects: [ { name: \"But! Football Club ol\", uid: \"but-ol\" }, { name: \"But! Football Club Général\", uid: \"but-general\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, { name: \"But! Football Club Ligue 1\", uid: \"but-Ligue1\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, ] } }; (function() { var d = document, s = d.createElement('script'); s.src = 'https://api.logora.fr/synthese.js'; (d.head || d.body).appendChild(s); })(); Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin de l'aventure se précise durant la trêve internationale. Rédacteur Alexandre Corboz","pubDate":"2023-09-04 06:20:00","image_url":"https://static.butfootballclub.fr/16/2023/09/photo_article/832009/332977/1200-L-ol-psg-laurent-blanc-a-vcu-un-cauchemar-son-prsident-entretient-le-flou-sur-la-suite.jpg","source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"51edaf54806dd7fc0c3319813b8c1793","title":"Помощниците на героите - топ 5 асистенции на 8-ия кръг в efbet Лига","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/pomoshtnicite-na-geroite-top-5-asistencii-na-8-iia-kryg-v-efbet-liga-752030","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Изиграха се седем срещи от 8-ия кръг на efbet Лига. Паднаха 19 гола, като някои от тях бяха благодарение на отлични асистенции. Затова традиционно сме отличили най-добрите такива в \"Помощниците на героите\". Асистенцията на Тобиас Хайнц е една от тях. Той намери Джонатан Линдсет с подаване в наказателното поле, а съотборникът му оформи крайният резултат 3:0 за ЦСКА срещу Берое. Следва извеждащият пас на Галин Иванов, който разсече защитата на Ботев и донесе единственото и почетно попадение за Славия при загубата с 1:3. В класацията ни намира място и асистенцията на Джовани за гола на Евандро срещу Крумовград, при която имаше и доза късмет, но и невероятна комбинация и атака, изградена от Локомотив Пловдив. А Евандро направи най-лесното - вкара в опразнената врата. В специалното видео може да видите още подаването на Янис Карабельов, който намери свободния Ивелин Попов, а това доведе до откриващия гол на Ботев срещу Славия, както и страхотният пас на далечна греда от Николай Янков, който доведе до гол от воле на Крум Стоянов и съответно изравнително попадение за Етър срещу Локомотив София. Вижте всички изпълнения във видеото.","pubDate":"2023-09-04 06:17:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"5ba396290c60369006f7f404d075cb98","title":"Piers Morgan offers Sancho a Cristiano Ronaldo-style interview after attacking Ten Hag","link":"https://www.express.co.uk/sport/football/1809000/man-utd-news-piers-morgan-cristiano-ronaldo-jadon-sancho-erik-ten-hag","keywords":null,"creator":null,"video_url":null,"description":"Jadon Sancho has hit back at Erik ten Hag after claiming he was dropped for Manchester United's defeat to Arsenal due to a lack of form in training.","content":"Piers Morgan has offered Jadon Sancho the chance to air the truth behind his showdown with Erik ten Hag on his TV show, Piers Morgan Uncensored. It comes after the Manchester United winger hit out at the Dutchman following claims he dropped Sancho due to the manner of his performances in training. Sancho failed to make the bench as his United team-mates slumped to a 3-1 defeat against Arsenal at the Emirates Stadium. Ten Hag said following the clash: \"Jadon, on his performances in training we did not select him. \"You have to reach a level every day at Manchester United and we can make choices in the front line. So for this game he was not selected.\" It prompted the England international to respond on social media as he issued a statement defending his performances at Carrington - declaring there were exterior motives behind his omission. Now Arsenal fan Morgan has stirred the pot, tweeting : \"Hi Jadon, come on @PiersUncensored and I’ll get you out of this Ten Hag nightmare.\" It's safe to say it's unlikely Sancho will be taking Morgan up on his offer, like Cristiano Ronaldo did last year, as he awaits his potential fate at Carrington on Monday. The 23-year-old said on his social media channels: \"Please don't believe everything you read. \"I will not allow people saying things that is completely untrue, I have conducted myself very well in training this week. \"I believe there are other reasons for this matter that I won't go into, I've been a scapegoat for a long time which isn't fair!\" Sancho, who has featured in all three of United's other Premier League matches, added: \"All I want to do is play football with a smile on my face and contribute to my team. \"I respect all decisions that are made by the coaching staff, I play with fantastic players and am grateful to do so, which I know every week is a challenge. \"I will continue to fight for this badge no matter what.\" Last year, Sancho was exiled from the United first-team picture and was sent to Holland during the World Cup to work on his performance and fitness levels with a private coach. He was later reintegrated into the United setup and was back with a bang as he inspired a fightback against Leeds from the bench at Old Trafford in February. However, he has since struggled to nail down a starting berth despite United's struggles in attack and now Sancho is facing yet another obstacle as he bids to turn his Old Trafford career around. Sancho has not been part of an England squad since way back in October 2021 when he provided two assists in a 5-0 win over Andorra.","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"express","source_priority":1139,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0025080afcbe7d976e84918591f0d2fe","title":"Arsenal recreate the Battle of Old Trafford with pizzas all round in Man Utd victory","link":"https://www.express.co.uk/sport/football/1808963/Arsenal-Battle-of-Old-Trafford-Man-Utd","keywords":null,"creator":null,"video_url":null,"description":"COMMENT: Arsenal celebrated their victory over Man Utd in style","content":"It was as if Martin Keown was bouncing in the face of Ruud van Nistelrooy all over again. The late drama of 2003’s Battle of Old Trafford was being repeated here at the Emirates as Arsenal snatched victory from what looked like a last-gasp defeat. And boy did the Gunners celebrate it. Pizzas all round, no doubt! As the emotions ebbed away with the fans into the unseasonably warm London evening, cold reason could only conclude it was a win that Arsenal had deserved. They had dominated most of the match and some better, more incisive finishing in front of goal might have given them the win before all the late drama. Any sort of drama would have been welcome in a fairly drab first half save for a couple of minutes which served up goals at either end. Kai Havertz had already fluffed an appalling left-foot shot with the goal at his mercy in the 13th minute, then gave the ball away cheaply in the 27th. Christian Eriksen’s pass was as immaculate as ever and Marcus Rashford was on it straight away, his shot was too strong to be pushed away by the fingertips of Aaron Ramsdale. Arsenal responded to going behind against the run of play instantly, though when Martin Odegaard hammered in a drive from the edge of the area. That was pretty much it until an incident on the hour-mark that would be a prelude to all the drama. When Havertz went to the floor under challenge from Aaron Wan-Bissake, referee Anthony Taylor pointed to the spot. It looked clumsy, but every replay seemed to show less and less contact, until eventually Australian VAR Jarred Gillett, still establishing himself in this country, made the brave call to suggest arguably the country’s leading official had possibly made a mistake. (It’s supposed to take out the human element, right?) The important thing was that Taylor agreed after looking at the monitor and it looked as though United were going to hold on for a point they ill-deserved. Rasmus Winther Hojlund finally came on for his debut and looked abrasive and bristling, but was fighting a lone battle with no real understanding with the players around him. At the other end, United were to end the game with Harry Maguire and Jonny Evans. The first game after the window had shut, nothing about it was saying title challengers. Yet Erik Ten Hag and his player thought they had nicked all three of the points. Substitute Alejandro Garnacho ran clear on a counter-attack in the 87th minute and coolly slid the ball past Ramsdale as the away fans went wild. VAR had not finished for the evening, though - and after an agonising couple of minutes decided the Argentina international had started marginally offside. That was just the start of it. Eight minutes of additional time were indicated and in the sixth of these Declan Rice bundled the ball home and a slight deflection off Evans was no more than he deserved for another commanding midfield performance. The Emirates went mad. Assistant manager Albert Stuivenberg was booked for going a bit too wild, but as with Keown all those years ago when Ruud Van Nistelrooy missed a last-minute penalty to leave the game goalless, there was a lot of emotion sitting behind that dam. These days, though, we have added time to the added time and United sense there was still time for one last twist. Instead, it was Gabriel Jesus who sprinted from the half-way line, left Diago Dalot on his backside and swept the ball into the empty corner of the net. The scoreline certainly could have been very different, but ultimately the worry for Ten Hag is it was probably a fair reflection of the relative balance between these two auld enemies at the moment.","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"express","source_priority":1139,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"65cfdc8d62c2d085bb0da49a52e94a8c","title":"ASSE : Batlles prend une première décision radicale à la trêve","link":"https://www.butfootballclub.fr/asse/actualite/asse-batlles-prend-une-premiere-decision-radicale-a-la-treve-832024","keywords":null,"creator":null,"video_url":null,"description":"Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve.","content":"L’ASSE n’avance pas. Après cinq journées de championnat, les hommes de Laurent Batlles n’ont grappillé que 5 point et pointent à une piteuse 15e place du classement de Ligue 2. Ce n’est pas le contenu du match nul contre le VAFC samedi à Geoffroy-Guichard qui incite à l’optimisme (1-1). « Je ne sais pas pourquoi on n'y arrive pas. À un moment, il faut qu'on prenne conscience qu'on est capable de faire beaucoup mieux a-t-il pesté après la rencontre. On parle beaucoup d'équilibre, on parle beaucoup de notre propension à trop aller vers l'avant, mais pour autant là maintenant, il y a de l'équilibre, mais on ne met pas en danger l'équipe adverse. Il faut qu'on trouve un juste milieu par rapport à ça. J'aimerais que les joueurs dépassent leurs fonctions. On se rend compte que si on veut gagner des matchs, il faut marquer. Peut-être que maintenant, il faut prendre des risques. » Retrouvez toute l'actualité de l'ASSE Un match contre le FC Sion au programme Pour remettre tout son petit monde dans le droit chemin, le coach de l’ASSE a décidé de muscler son jeu pendant la trêve internationale. Vendredi, Le Progrès fait savoir que les Verts ont ainsi prévu de disputer un match amical face au FC Sion. L’horaire de ce match amical reste à déterminer. L’ #ASSE va disputer un match amical durant la trêve internationale, ce sera face au FC Sion (🇨🇭), ce vendredi ! Via @leprogres_asse . pic.twitter.com/7e5v5jZF2s — News Sainte (@news_sainte_) September 3, 2023 function getDimensionGA() { var dimension1 = \"145\"; return dimension1; } var logora_config = { shortname: \"horyzon-f09581\", debate: { identifier: \"16-832024\" }, source: { source_url: \"https://www.butfootballclub.fr/asse/actualite/asse-batlles-prend-une-premiere-decision-radicale-a-la-treve-832024\", uid: \"16-832024\", title: \"ASSE : Batlles prend une première décision radicale à la trêve\", description: \"Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve.\", origin_image_url: \"\", published_date: \"2023-09-04T08:00:00+01:00\", publisher: \"But! Football Club\", tag_objects: [ { name: \"But! Football Club asse\", uid: \"but-asse\" }, { name: \"But! Football Club Général\", uid: \"but-general\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, { name: \"But! Football Club Ligue 2\", uid: \"but-Ligue2\" }, ] } }; (function() { var d = document, s = d.createElement('script'); s.src = 'https://api.logora.fr/synthese.js'; (d.head || d.body).appendChild(s); })(); Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve : disputer un match amical. Rédacteur Bastien Aubert","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"69ba62c0916a5fffbe1490a9c9a86cf7","title":"Trent Alexander-Arnold, Ibrahima Konate, Thiago Alcantara - Liverpool injury news and return dates ahead of Wolves","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-injury-news-konate-alexander-27559709","keywords":["Sport"],"creator":null,"video_url":null,"description":"Latest Liverpool injury news as Jurgen Klopp's side prepare to take on Wolves after the international break in the Premier League","content":"Liverpool will look to continue their impressive start to the season when they return to action after the international break. The Reds beat Aston Villa to make it three wins and a draw in their opening four games of the new campaign, easing to a 3-0 victory at Anfield. The season opened with a 1-1 draw at Stamford Bridge against Chelsea before a victory over Bournemouth at Anfield. Liverpool then travelled to St James' Park, seeing Virgil van Dijk sent off and falling behind to a Anthony Gordon goal. Darwin Nunez came off the bench to score twice late on to win the game for Liverpool. However, injury problems are starting to add up for Jurgen Klopp, with Trent Alexander-Arnold substituted with a hamstring concern against Villa. Even just a few weeks into the new season the Reds have a number of injuries to contend with. But Klopp will hope to have some players back fit after the international break, below is the latest Liverpool injury news: Trent Alexander-Arnold took a knock in the 3-0 win over Aston Villa, limping off and straight down the tunnel with just under 20 minutes to play. Jurgen Klopp admitted afterwards that it was a hamstring problem and that the Scouse full-back would need a scan to discover the extent of any damage. Speaking on the injury, Klopp said: \"I asked him and he said it’s (his) hamstring. Not too serious is his opinion, but we obviously have to wait for the scans. Then we will know more.\" French defender Ibrahima Konate missed the wins over Newcastle and Aston Villa with Jurgen Klopp hopeful he'd be fit for Wolves after the international break. But with France initially selecting the centre-back for their squad to face Ireland and Germany, before swapping for Jean-Clair Tobido, it has raised fears that the injury is worse than first thought. The hamstring problem wasn't believed to be too serious, but Liverpool will be hoping he's back fit for Wolves. T was close to a long awaited return to action before suffering a setback in training and remaining sidelined. Jurgen Klopp confirmed that, like Curtis Jones, the Spaniard would be back in training after Newcastle, but the Spaniard would return too quickly and will now try to get back to fill fitness during the international break. \"Thiago had a little setback. He started training with the team and had a little setback so we have to slow down there a little bit,\" Klopp said. “It’s not cool for him, it’s not cool for us but it’s how it is. Thiago will use the (September) international break for that, to be up to speed I’m pretty sure. It should hopefully be enough. All the rest are available.” The young full-back showed potential with pre-season performances in Germany, playing 90 minutes over the course of two fixtures. He was then left out of the group that travelled to Singapore following a minor, unspecified injury and has not featured in any matchday squads since the start of the season, though has been involved in training since his team-mates returned to England. Once fit the Northern Irishman is expected to slot into Klopp's plans as understudy to Alexander-Arnold, having proven himself in League One with Bolton Wanderers last year. Unknown.","pubDate":"2023-09-04 06:00:00","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27645923.ece/ALTERNATES/s98/0_GettyImages-1657422730.jpg","source_id":"liverpoolecho","source_priority":3400,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"aa823666f94f112243b1f4ed70cec088","title":"Police reviewing Roy Keane and Micah Richards confrontation","link":"https://www.oxfordmail.co.uk/sport/23765033.police-reviewing-roy-keane-micah-richards-confrontation/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Sky Sports pundits Micah Richards and Roy Keane were involved in a confrontation with a fan at Arsenal's clash with Manchester United on Sunday.","content":"Ex-England and Manchester City defender Richards was working as a Sky Sports studio pundit at the Emirates, alongside Keane, Gary Neville and Theo Walcott. The video shows Richards trying to calm things down and appearing to restrain an unidentified man, who had allegedly aimed a headbutt at Keane and attempted to strike him on the chest and chin, police have now launched an investigation over. A man wearing a suit is then seen trying to separate the pair moves across and also appears to grab the male's shirt. Micah Richards go change am for the fan wey headbutt Roy Keane. It is unclear when the incident took place although are seen in the same clothing they wore for Sky's Super Sunday programme. Richards is seen wearing a black backpack , has a jacket in his hand during the incident. The duo had been on air until 7.30pm in North London on Sunday evening when Sky's coverage ended. Met Police statement confirmed it had launched an investigation but there had been no arrests, with enquiries ongoing. A statement read: \"Police are investigating following an assault that is alleged to have occurred at the Emirates Stadium during an Arsenal v Manchester United match on Sunday, 3 September.\" Roy Keane, is a spurs man! A spokesperson for Sky Sports told Mirror Football: \"We understand the police are investigating an alleged assault by a member of the public immediately preceding the footage circulating on social media. In the footage seen, Micah Richards was acting to diffuse a situation.\" Richards, 35, retired from football in 2019 after spells with Manchester City, Fiorentina and Aston Villa before embarking on a successful punditry career. The incident happened towards the end of the game after Alejandro Garnacho looked to have won the match for United in the 88th minute before VAR ruled the goal out.","pubDate":"2023-09-04 08:10:20","image_url":"https://www.oxfordmail.co.uk/resources/images/17186800/?type=app&htype=0","source_id":"oxfordmail","source_priority":41844596,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d41cc15c98be7b4f910b2680eac345de","title":"Бодигардът на Меси отново в действие (видео)","link":"https://gong.bg/football-sviat/drugi/multimedia/video/bodigardyt-na-mesi-otnovo-v-dejstvie-video-752034","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Аржентинската суперзвезда Лионел Меси продължава да прави фурор в САЩ. Преди часове неговият Интер Маями успя да надвие новия тим на Филип Кръстев Лос Анджелис ФК с 3:1 в мач от МЛС. Меси се отличи с две асистенции в двубоя. Около аржентиенца нашумя и бодигардът му, който пази световния шампион не само извън терените, но и повреме на мачовете. В една от срещите той бе уловен как тича край страничната линия и следи за безопасността на Меси. В мача срещу Лос Анджелис ФК пък бодигардът се намеси по-бързо от стюардите, когато фен нахлу на стадиона, за да стигне до Лионел Меси. Мъжът се справи лично със запалянкото, след което го \"предаде\" на стюардите. A fan has tried to touch Messi. Look at the bodyguard 😭😭 pic.twitter.com/u9gnhrKqqz — Tulip (@tulipfcb) September 4, 2023","pubDate":"2023-09-04 06:39:01","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"3be115cf37a2864ea86bfae4ea4757e7","title":"Левски се размина с нигерийски нападател","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/levski-se-razmina-s-nigerijski-napadatel-752033","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Левски се размина с привличането на Сънди Адетунджи. Нигерийският нападател бе един от вариантите на \"сините\" за подсилване на атаката. 25-годишният таран бе свободен агент, а представители на столичани проведоха разговори с него. В крайна сметка обаче Адетунджи е предпочел предложението на завършилия на трето място в Сърбия през миналия сезон - Чукарички. След като \"сините\" достигнаха до плейофите за влизане в групите на Лигата на конференциите, треньорът Николай Костов получи уверение от ръководството, че ще бъде направено всичко възможно отборът да бъде подсилен. Освен за нападението, на \"Герена\" се оглеждат и за десен бек. Причината е, че Жереми Петрис има договор до края на кампанията и към момента отказва да го удължи.","pubDate":"2023-09-04 06:37:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"0317d18ab1a7a707d5cd5a837869e905","title":"Kickoff | 'If it wasn't for soccer, I don't know where I'd be'","link":"https://www.snl24.com/kickoff/lifestyle/ct-city-attacker-reveals-mark-byrnes-big-influence-20230904","keywords":null,"creator":null,"video_url":null,"description":"Cape Town City star Jaedin Rhodes has shared how the late Mark Byrne helped him reach his dream of becoming a professional footballer, the biggest lesson he has learnt and so much more.","content":"Sunglass Hut and Kickoff approached four rising stars who participated in a photoshoot where the quartet of youngsters got to show off a side to them that fans may have not seen before. As part of the campaign, this week sees the Citizens' prolific forward sit down with KickOff and share some of how it felt to make his debut along with Rhodes' views on his \"sexy\" style and how he deals with disappointment. I knew from my time at Hellenic because me and Mark Byrne were very close and he made it clear to me that I had the potential to make it to the top. He made me make sacrifices like moving me out of Atlantis away from my family, put me in a school so I knew that at some point I had to make it. I can't go through all this stuff and not reach the finish line. Just two years ago, I was sitting in the stand watching Cape Town City and Ajax Cape Town play against each other and here I am the field. It was a big achievement. Neymar, he is creative and stylish. I am that kind of player. In this world, it is you versus you. If you don't go out there and get it, no one is going to do it for you. I prefer a bit of both. It depends on the occasion, I like to mix it up sometimes a nice oversized t-shirt with jeans. Keagan Buchanan. Keagan Buchanan, if you go to his Instagram. The tattoos, the jewellery he has on, everything is stylish. The stuff that goes on social media can affect your mind and thinking, So it is not good for you but its not all bad. I am a person that loves to ignore negative comments, i don't still bother by replying or reading that stuff. It depends on my mood so maybe i will go the mall but I love going to the beach where I kick the ball around. The sport I love besides soccer is tennis. I grew up watching tennis and my favourite player is Rafael Nadal. I'm not bad at playing tennis, I can play but I won't say I am good at it. If it wasn't for soccer I don't know where I would be. Growing up, it was something else. I went on wrong route. Soccer saved my life. Another career i would consider is being a model. Giveon, Meek Mill and Nipsey Hussle. Before I go onto the pitch, I listen to Stay from Rihanna and after that I will listen to Meek Mill to get me hyped up. Sometimes it is tough to deal with it but you can't be too hard on yourself. You may feel disappointment but there is always a next game to improve and a next training session to improve. If you want to go get something, never stop never settle keep going. That football can change very quickly. it can take you up but it can take you down as well. Someone who is experienced told me this. Sexy Piano, this is the instrument I always wanted to play. I just love the way it sounds.","pubDate":"2023-09-04 06:36:50","image_url":"https://cdn.24.co.za/files/Cms/General/d/8931/2c01d7b2e6b6489c885e371bd6f8b01e.jpg","source_id":"snl24","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"863a6c16186ab00a2b6713da74fec8cb","title":"OL : la nouvelle annonce polémique de Blanc sur son avenir, Cucci y va aussi de sa sortie !","link":"https://www.butfootballclub.fr/ol/actualite/ol-psg-laurent-blanc-a-vecu-un-cauchemar-son-president-entretient-le-flou-sur-la-suite-832009","keywords":null,"creator":null,"video_url":null,"description":"Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin est proche...","content":"Déjà menacé avant la rencontre, Laurent Blanc a de fortes chances de ne pas survivre à la trêve internationale sur le banc de l’OL. Lourdement battu par le PSG (1-4), le Cévénol a reconnu avoir vécu « un cauchemar » durant « tout le match » : « Dans l'analyse, tout le monde a sa part de responsabilité. Si l'objectif est de se qualifier en Ligue des champions, comme vous le dites, on a vraiment beaucoup de travail. On a des problèmes, il va falloir les régler ». « Je ne suis pas dans une meilleure situation qu’avant » Alpagué par les Bad Gones qui ont déployé un cinglant message à son endroit (« Blanc, si tu n'as plus les couilles de te battre, démissionne »), Laurent Blanc - qui avait échangé avec son président délégué Santiago Cucci juste avant dans le vestiaire - n’a pas voulu répondre en conférence de presse d’après-match : « Je ne vais pas parler de ça parce que je vais être un peu cru. Les supporters ont raison d'être déçus. Est-ce que je suis menacé ? Quand un entraîneur n'a pas de résultat, il est en danger. Donc ce soir après ce match, je ne suis pas dans une meilleure situation qu'avant. » Au micro d’Amazon Prime Vidéo, l’ancien coach du PSG a également été interrogé sur son avenir. « La question ne s’est pas pas posée. J’essaierais d’être là dans 15 jours », a-t-il répondu avec le sourire aux lèvres. Une sortie et une attitude qui ne manquent pas de faire polémique. Cucci veut un « entraîneur qui entraîne » Ce n’est d’ailleurs pas les propos de Santiago Cucci face à la presse en parallèle de son passage en conférence de presse qui sont de nature à rassurer sur son cas : « Laurent Blanc ? Ce n'est pas le sujet. Je ne vais pas vous répondre tout de suite. Il faut un entraîneur qui entraîne. » Relancé sur le fait que cette phrase ressemblait à une pique à Laurent Blanc, l’ancien PDG de Levi’s Europe a démenti : « Je ne suis pas en train de vous dire ça. Il n'y a pas que lui qui est responsable, ce n'est pas lui qui joue au foot ». La quinzaine risque d’être animée à Lyon… Et si Botafogo a refusé la démission de Bruno Lage (et donc son arrivée anticipée dans la Capitale des Gaules !), rien ne dit que l’OL ne cherchera pas quelqu’un d’autre pour relancer les Gones, désormais derniers de Ligue 1. Cucci : \"Laurent Blanc ? Je ne vais pas vous répondre ce soir. Il n'y a pas que l'entraîneur qui est responsable.\" #OLPSG pic.twitter.com/c5lbLsN2BJ — Alexandre Corboz (@AlexCorboz) September 3, 2023 function getDimensionGA() { var dimension1 = \"142\"; return dimension1; } var logora_config = { shortname: \"horyzon-f09581\", debate: { identifier: \"16-832009\" }, source: { source_url: \"https://www.butfootballclub.fr/ol/actualite/ol-psg-laurent-blanc-a-vecu-un-cauchemar-son-president-entretient-le-flou-sur-la-suite-832009\", uid: \"16-832009\", title: \"OL : la nouvelle annonce polémique de Blanc sur son avenir, Cucci y va aussi de sa sortie ! \", description: \"Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin est proche...\", origin_image_url: \"https://static.butfootballclub.fr/16/2023/09/photo_article/832009/332977/1200-L-ol-psg-laurent-blanc-a-vcu-un-cauchemar-son-prsident-entretient-le-flou-sur-la-suite.jpg\", published_date: \"2023-09-04T08:20:00+01:00\", publisher: \"But! Football Club\", tag_objects: [ { name: \"But! Football Club ol\", uid: \"but-ol\" }, { name: \"But! Football Club Général\", uid: \"but-general\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, { name: \"But! Football Club Ligue 1\", uid: \"but-Ligue1\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, ] } }; (function() { var d = document, s = d.createElement('script'); s.src = 'https://api.logora.fr/synthese.js'; (d.head || d.body).appendChild(s); })(); Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Alors que son avenir à l'OL semble très compromis, Laurent Blanc n'a pas eu droit à un soutien très franc de son président à l'issue de la déroute face au PSG (1-4). La fin de l'aventure se précise durant la trêve internationale. Rédacteur Alexandre Corboz","pubDate":"2023-09-04 06:20:00","image_url":"https://static.butfootballclub.fr/16/2023/09/photo_article/832009/332977/1200-L-ol-psg-laurent-blanc-a-vcu-un-cauchemar-son-prsident-entretient-le-flou-sur-la-suite.jpg","source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"51edaf54806dd7fc0c3319813b8c1793","title":"Помощниците на героите - топ 5 асистенции на 8-ия кръг в efbet Лига","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/pomoshtnicite-na-geroite-top-5-asistencii-na-8-iia-kryg-v-efbet-liga-752030","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Изиграха се седем срещи от 8-ия кръг на efbet Лига. Паднаха 19 гола, като някои от тях бяха благодарение на отлични асистенции. Затова традиционно сме отличили най-добрите такива в \"Помощниците на героите\". Асистенцията на Тобиас Хайнц е една от тях. Той намери Джонатан Линдсет с подаване в наказателното поле, а съотборникът му оформи крайният резултат 3:0 за ЦСКА срещу Берое. Следва извеждащият пас на Галин Иванов, който разсече защитата на Ботев и донесе единственото и почетно попадение за Славия при загубата с 1:3. В класацията ни намира място и асистенцията на Джовани за гола на Евандро срещу Крумовград, при която имаше и доза късмет, но и невероятна комбинация и атака, изградена от Локомотив Пловдив. А Евандро направи най-лесното - вкара в опразнената врата. В специалното видео може да видите още подаването на Янис Карабельов, който намери свободния Ивелин Попов, а това доведе до откриващия гол на Ботев срещу Славия, както и страхотният пас на далечна греда от Николай Янков, който доведе до гол от воле на Крум Стоянов и съответно изравнително попадение за Етър срещу Локомотив София. Вижте всички изпълнения във видеото.","pubDate":"2023-09-04 06:17:00","image_url":null,"source_id":"gong","source_priority":703051,"country":["bulgaria"],"category":["sports"],"language":"bulgarian"},{"article_id":"5ba396290c60369006f7f404d075cb98","title":"Piers Morgan offers Sancho a Cristiano Ronaldo-style interview after attacking Ten Hag","link":"https://www.express.co.uk/sport/football/1809000/man-utd-news-piers-morgan-cristiano-ronaldo-jadon-sancho-erik-ten-hag","keywords":null,"creator":null,"video_url":null,"description":"Jadon Sancho has hit back at Erik ten Hag after claiming he was dropped for Manchester United's defeat to Arsenal due to a lack of form in training.","content":"Piers Morgan has offered Jadon Sancho the chance to air the truth behind his showdown with Erik ten Hag on his TV show, Piers Morgan Uncensored. It comes after the Manchester United winger hit out at the Dutchman following claims he dropped Sancho due to the manner of his performances in training. Sancho failed to make the bench as his United team-mates slumped to a 3-1 defeat against Arsenal at the Emirates Stadium. Ten Hag said following the clash: \"Jadon, on his performances in training we did not select him. \"You have to reach a level every day at Manchester United and we can make choices in the front line. So for this game he was not selected.\" It prompted the England international to respond on social media as he issued a statement defending his performances at Carrington - declaring there were exterior motives behind his omission. Now Arsenal fan Morgan has stirred the pot, tweeting : \"Hi Jadon, come on @PiersUncensored and I’ll get you out of this Ten Hag nightmare.\" It's safe to say it's unlikely Sancho will be taking Morgan up on his offer, like Cristiano Ronaldo did last year, as he awaits his potential fate at Carrington on Monday. The 23-year-old said on his social media channels: \"Please don't believe everything you read. \"I will not allow people saying things that is completely untrue, I have conducted myself very well in training this week. \"I believe there are other reasons for this matter that I won't go into, I've been a scapegoat for a long time which isn't fair!\" Sancho, who has featured in all three of United's other Premier League matches, added: \"All I want to do is play football with a smile on my face and contribute to my team. \"I respect all decisions that are made by the coaching staff, I play with fantastic players and am grateful to do so, which I know every week is a challenge. \"I will continue to fight for this badge no matter what.\" Last year, Sancho was exiled from the United first-team picture and was sent to Holland during the World Cup to work on his performance and fitness levels with a private coach. He was later reintegrated into the United setup and was back with a bang as he inspired a fightback against Leeds from the bench at Old Trafford in February. However, he has since struggled to nail down a starting berth despite United's struggles in attack and now Sancho is facing yet another obstacle as he bids to turn his Old Trafford career around. Sancho has not been part of an England squad since way back in October 2021 when he provided two assists in a 5-0 win over Andorra.","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"express","source_priority":1139,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0025080afcbe7d976e84918591f0d2fe","title":"Arsenal recreate the Battle of Old Trafford with pizzas all round in Man Utd victory","link":"https://www.express.co.uk/sport/football/1808963/Arsenal-Battle-of-Old-Trafford-Man-Utd","keywords":null,"creator":null,"video_url":null,"description":"COMMENT: Arsenal celebrated their victory over Man Utd in style","content":"It was as if Martin Keown was bouncing in the face of Ruud van Nistelrooy all over again. The late drama of 2003’s Battle of Old Trafford was being repeated here at the Emirates as Arsenal snatched victory from what looked like a last-gasp defeat. And boy did the Gunners celebrate it. Pizzas all round, no doubt! As the emotions ebbed away with the fans into the unseasonably warm London evening, cold reason could only conclude it was a win that Arsenal had deserved. They had dominated most of the match and some better, more incisive finishing in front of goal might have given them the win before all the late drama. Any sort of drama would have been welcome in a fairly drab first half save for a couple of minutes which served up goals at either end. Kai Havertz had already fluffed an appalling left-foot shot with the goal at his mercy in the 13th minute, then gave the ball away cheaply in the 27th. Christian Eriksen’s pass was as immaculate as ever and Marcus Rashford was on it straight away, his shot was too strong to be pushed away by the fingertips of Aaron Ramsdale. Arsenal responded to going behind against the run of play instantly, though when Martin Odegaard hammered in a drive from the edge of the area. That was pretty much it until an incident on the hour-mark that would be a prelude to all the drama. When Havertz went to the floor under challenge from Aaron Wan-Bissake, referee Anthony Taylor pointed to the spot. It looked clumsy, but every replay seemed to show less and less contact, until eventually Australian VAR Jarred Gillett, still establishing himself in this country, made the brave call to suggest arguably the country’s leading official had possibly made a mistake. (It’s supposed to take out the human element, right?) The important thing was that Taylor agreed after looking at the monitor and it looked as though United were going to hold on for a point they ill-deserved. Rasmus Winther Hojlund finally came on for his debut and looked abrasive and bristling, but was fighting a lone battle with no real understanding with the players around him. At the other end, United were to end the game with Harry Maguire and Jonny Evans. The first game after the window had shut, nothing about it was saying title challengers. Yet Erik Ten Hag and his player thought they had nicked all three of the points. Substitute Alejandro Garnacho ran clear on a counter-attack in the 87th minute and coolly slid the ball past Ramsdale as the away fans went wild. VAR had not finished for the evening, though - and after an agonising couple of minutes decided the Argentina international had started marginally offside. That was just the start of it. Eight minutes of additional time were indicated and in the sixth of these Declan Rice bundled the ball home and a slight deflection off Evans was no more than he deserved for another commanding midfield performance. The Emirates went mad. Assistant manager Albert Stuivenberg was booked for going a bit too wild, but as with Keown all those years ago when Ruud Van Nistelrooy missed a last-minute penalty to leave the game goalless, there was a lot of emotion sitting behind that dam. These days, though, we have added time to the added time and United sense there was still time for one last twist. Instead, it was Gabriel Jesus who sprinted from the half-way line, left Diago Dalot on his backside and swept the ball into the empty corner of the net. The scoreline certainly could have been very different, but ultimately the worry for Ten Hag is it was probably a fair reflection of the relative balance between these two auld enemies at the moment.","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"express","source_priority":1139,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"65cfdc8d62c2d085bb0da49a52e94a8c","title":"ASSE : Batlles prend une première décision radicale à la trêve","link":"https://www.butfootballclub.fr/asse/actualite/asse-batlles-prend-une-premiere-decision-radicale-a-la-treve-832024","keywords":null,"creator":null,"video_url":null,"description":"Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve.","content":"L’ASSE n’avance pas. Après cinq journées de championnat, les hommes de Laurent Batlles n’ont grappillé que 5 point et pointent à une piteuse 15e place du classement de Ligue 2. Ce n’est pas le contenu du match nul contre le VAFC samedi à Geoffroy-Guichard qui incite à l’optimisme (1-1). « Je ne sais pas pourquoi on n'y arrive pas. À un moment, il faut qu'on prenne conscience qu'on est capable de faire beaucoup mieux a-t-il pesté après la rencontre. On parle beaucoup d'équilibre, on parle beaucoup de notre propension à trop aller vers l'avant, mais pour autant là maintenant, il y a de l'équilibre, mais on ne met pas en danger l'équipe adverse. Il faut qu'on trouve un juste milieu par rapport à ça. J'aimerais que les joueurs dépassent leurs fonctions. On se rend compte que si on veut gagner des matchs, il faut marquer. Peut-être que maintenant, il faut prendre des risques. » Retrouvez toute l'actualité de l'ASSE Un match contre le FC Sion au programme Pour remettre tout son petit monde dans le droit chemin, le coach de l’ASSE a décidé de muscler son jeu pendant la trêve internationale. Vendredi, Le Progrès fait savoir que les Verts ont ainsi prévu de disputer un match amical face au FC Sion. L’horaire de ce match amical reste à déterminer. L’ #ASSE va disputer un match amical durant la trêve internationale, ce sera face au FC Sion (🇨🇭), ce vendredi ! Via @leprogres_asse . pic.twitter.com/7e5v5jZF2s — News Sainte (@news_sainte_) September 3, 2023 function getDimensionGA() { var dimension1 = \"145\"; return dimension1; } var logora_config = { shortname: \"horyzon-f09581\", debate: { identifier: \"16-832024\" }, source: { source_url: \"https://www.butfootballclub.fr/asse/actualite/asse-batlles-prend-une-premiere-decision-radicale-a-la-treve-832024\", uid: \"16-832024\", title: \"ASSE : Batlles prend une première décision radicale à la trêve\", description: \"Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve.\", origin_image_url: \"\", published_date: \"2023-09-04T08:00:00+01:00\", publisher: \"But! Football Club\", tag_objects: [ { name: \"But! Football Club asse\", uid: \"but-asse\" }, { name: \"But! Football Club Général\", uid: \"but-general\" }, { name: \"But! Football Club Actualité\", uid: \"but-Actualité\" }, { name: \"But! Football Club Ligue 2\", uid: \"but-Ligue2\" }, ] } }; (function() { var d = document, s = d.createElement('script'); s.src = 'https://api.logora.fr/synthese.js'; (d.head || d.body).appendChild(s); })(); Podcast Men's Up Life function runBeOp(){ window.beOpAsyncInit = function() { BeOpSDK.init({ account: \"58d5018fa78ec734e9050ab9\", }); BeOpSDK.watch(); } } Pour résumer Très déçu et frustré par le nouveau match nul de l’AS Saint-Étienne contre le Valenciennes FC samedi lors de la 5e journée de Ligue 2 (1-1), Laurent Batlles a pris une décision radicale à la trêve : disputer un match amical. Rédacteur Bastien Aubert","pubDate":"2023-09-04 06:00:00","image_url":null,"source_id":"butfootballclub","source_priority":4582246,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"69ba62c0916a5fffbe1490a9c9a86cf7","title":"Trent Alexander-Arnold, Ibrahima Konate, Thiago Alcantara - Liverpool injury news and return dates ahead of Wolves","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-injury-news-konate-alexander-27559709","keywords":["Sport"],"creator":null,"video_url":null,"description":"Latest Liverpool injury news as Jurgen Klopp's side prepare to take on Wolves after the international break in the Premier League","content":"Liverpool will look to continue their impressive start to the season when they return to action after the international break. The Reds beat Aston Villa to make it three wins and a draw in their opening four games of the new campaign, easing to a 3-0 victory at Anfield. The season opened with a 1-1 draw at Stamford Bridge against Chelsea before a victory over Bournemouth at Anfield. Liverpool then travelled to St James' Park, seeing Virgil van Dijk sent off and falling behind to a Anthony Gordon goal. Darwin Nunez came off the bench to score twice late on to win the game for Liverpool. However, injury problems are starting to add up for Jurgen Klopp, with Trent Alexander-Arnold substituted with a hamstring concern against Villa. Even just a few weeks into the new season the Reds have a number of injuries to contend with. But Klopp will hope to have some players back fit after the international break, below is the latest Liverpool injury news: Trent Alexander-Arnold took a knock in the 3-0 win over Aston Villa, limping off and straight down the tunnel with just under 20 minutes to play. Jurgen Klopp admitted afterwards that it was a hamstring problem and that the Scouse full-back would need a scan to discover the extent of any damage. Speaking on the injury, Klopp said: \"I asked him and he said it’s (his) hamstring. Not too serious is his opinion, but we obviously have to wait for the scans. Then we will know more.\" French defender Ibrahima Konate missed the wins over Newcastle and Aston Villa with Jurgen Klopp hopeful he'd be fit for Wolves after the international break. But with France initially selecting the centre-back for their squad to face Ireland and Germany, before swapping for Jean-Clair Tobido, it has raised fears that the injury is worse than first thought. The hamstring problem wasn't believed to be too serious, but Liverpool will be hoping he's back fit for Wolves. T was close to a long awaited return to action before suffering a setback in training and remaining sidelined. Jurgen Klopp confirmed that, like Curtis Jones, the Spaniard would be back in training after Newcastle, but the Spaniard would return too quickly and will now try to get back to fill fitness during the international break. \"Thiago had a little setback. He started training with the team and had a little setback so we have to slow down there a little bit,\" Klopp said. “It’s not cool for him, it’s not cool for us but it’s how it is. Thiago will use the (September) international break for that, to be up to speed I’m pretty sure. It should hopefully be enough. All the rest are available.” The young full-back showed potential with pre-season performances in Germany, playing 90 minutes over the course of two fixtures. He was then left out of the group that travelled to Singapore following a minor, unspecified injury and has not featured in any matchday squads since the start of the season, though has been involved in training since his team-mates returned to England. Once fit the Northern Irishman is expected to slot into Klopp's plans as understudy to Alexander-Arnold, having proven himself in League One with Bolton Wanderers last year. Unknown.","pubDate":"2023-09-04 06:00:00","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27645923.ece/ALTERNATES/s98/0_GettyImages-1657422730.jpg","source_id":"liverpoolecho","source_priority":3400,"country":["united kingdom"],"category":["sports"],"language":"english"}]}