{"newsArray":[{"title":"Παναθηναϊκός μεταγραφές: «Θέλει Γκάνεα στη Φαρούλ ο Χάτζι», γράφουν στη Ρουμανία","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2250092/panathinaikos-metagrafes-thelei-gkanea-sti-faroyl-o-hatzi","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Κωνσταντίνος Κωλαΐτης","Παναθηναϊκός","Κριστιάν Γκάνεα","Φαρούλ Κονστάντσα"],"creator":null,"video_url":null,"description":"Σύμφωνα με ρουμανικό Μέσο η Φαρούλ Κονστάντσα του Γκεόργκε Χάτζι επιθυμεί να επαναπατρίσει τον Κρίστιαν Γκάνεα στο φινάλε της μεταγραφικής περιόδου.","content":"Ζεστό ενδιαφέρον από τη Ρουμανία προκύπτει για τον Κρίστιαν Γκάνεα μέσω των ΜΜΕ της πατρίδας του. Λίγες μέρες πριν το φινάλε της θερινής περιόδου, η ιστοσελίδα «Sport.ro» αναφέρει σε ρεπορτάζ της πως ο 31χρονος μπακ του Παναθηναϊκού βρίσκεται στις άμεσες προτεραιότητες της Φαρούλ Κονστάντσα και του ιδιοκτήτη-προπονητή της, Γκεόργκε Χάτζι , για την ενίσχυση της αμυντικής γραμμής ενόψει ευρωπαϊκής σεζόν, καθώς ο σύλλογος απέχει ένα 90λεπτο από την είσοδο στους ομίλους του Conference League (νίκη 2-1 στο πρώτο ματς κόντρα στην Ελσίνκι). Το δημοσίευμα αναφέρει πως ο πρώην παίκτης του Άρη μπορεί να αποκτηθεί ως ελεύθερος (το συμβόλαιό του στους Πράσινους λήγει στο τέλος της σεζόν) και είναι θετικός στο να μειώσει τις αποδοχές του, βλέποντας με θετικό μάτι τον επαναπατρισμό καθώς έτσι θα βρει το έδαφος για να επιστρέψει και στην εθνική Ρουμανίας μετά τον Ιούνιο του 2021. Ο Γκάνεα στάθηκε άτυχος την περασμένη σεζόν μένοντας εκτός δράσης στα μισά της περιόδου λόγω επιπλοκών που του προκάλεσε η Covid-19 και φέτος βρίσκεται τρίτος στην ιεραρχία των αριστερών μπακ πίσω από Χουάνκαρ και Φιλίπ Μλαντένοβιτς . Με ό,τι αυτό συνεπάγεται για τον προσδοκώμενο χρόνο συμμετοχής που θα λάβει τη φετινή σεζόν στο Τριφύλλι.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Πεντάδα για… εκτόξευση στη 2η αγωνιστική του πρωταθλήματος!","link":"https://www.gazzetta.gr/football/2250081/pentada-gia-ektoxeysi-sti-2i-agonistiki-toy-protathlimatos","keywords":["Ποδόσφαιρο","Newsroom"],"creator":null,"video_url":null,"description":"Στη 2η αγωνιστική της Super League οι θεωρητικά «μεγάλοι» του πρωταθλήματος έχουν πονηρές αποστολές και κουβαλάνε τον τίτλο του φαβορί. Ωστόσο για τον επιβεβαιώσουν θα πρέπει αυτό να το αποτυπώσουν πάνω στο χορτάρι.","content":"Το Σάββατο (20:00) ο Παναθηναϊκός ξεκινάει τις εγχώριες υποχρεώσεις του απέναντι στο Βόλο. Οι «πράσινοι» θα κληθούν να ξεπεράσουν την κούραση από το παιχνίδι με την Μπράγκα και παράλληλα να βγάλουν από το μυαλό τους τη ρεβάνς της Τρίτης με τους Πορτογάλους. Ο Γιοβάνοβιτς διαθέτει λύσεις στο ρόστερ του, αλλά ο Βόλος μέσα στη Λεωφόρο θα στήσει «παγίδες» και με στόχο την έκπληξη. To VAR θα έχει αρκετή δουλειά και τον καταλογισμό πέναλτι τον βρίσκουμε σε απόδοση 2.80 , ενώ η νίκη του Παναθηναϊκού με ένα γκολ διαφορά κοστολογείται στο 3.50. Στις 21.30 τα βλέμματα όλων θα στραφούν στη Νέα Φιλαδέλφεια. Η ΑΕΚ υποδέχεται τον νεοφώτιστο Πανσερραϊκό και φιλοδοξεί να ξεκινήσει με την δεξί την πορεία της προς την υπεράσπιση του τίτλου. Στην «Ένωση» θα έχουν το μυαλό τους και στη ρεβάνς με την Αντβέρπ, ενώ ο Πανσερραϊκός στην πρεμιέρα του με τον Ολυμπιακό – παρά την ήττα με 2-0 - άφησε υποσχέσεις παρότι έπαιξε από το 4ο λεπτό με δέκα παίκτες. Η ΑΕΚ έχει αποδείξει ότι αμυντικά δεν έχει βρει ακόμα ρυθμό και το Goal/Goal το βρίσκουμε στο 2.80. Στο μενού της Κυριακής η εκκίνηση (19:15) θα γίνει με την αναμέτρηση ανάμεσα σε Λαμία και Άρη. Οι Θεσσαλονικείς αναζητούν τον καλό τους εαυτό και η ήττα στην πρεμιέρα (3-2) από τον ΟΦΗ έφερε προβληματισμό σχετικά με την αμυντική λειτουργία. Η Λαμία του Λεωνίδα Βόκολου με τον Βόλο (2-2) έχασε τη νίκη μέσα από τα χέρια της δεχόμενη γκολ στο φινάλε. Ωστόσο, η ομάδα της Φθιώτιδας με Καρλίτος και Σλίβκα στην επίθεση δείχνει ικανή να δημιουργήσει προβλήματα στην άμυνα του Άρη. Το Over 2.5 κοστολογείται σε απόδοση 2.15! Λίγο αργότερα στην Τούμπα (21:00) ο ΠΑΟΚ φιλοξενεί τη νεοφώτιστη Κηφισιά. Ο Δικέφαλος του Βορρά θα έχει πιο βαριά πόδια, αφού την Πέμπτη το βράδυ έπαιξε ευρωπαϊκό ματς με την Χάρτς στην Σκωτία στο Conference League και πανηγύρισε σπουδαία νίκη (2-1). Η Κηφισιά είναι αουτσάιντερ και ο Γιάννης Αναστασίου, μετά την ήττα (0-3) από τον ΠΑΣ θα κάνει διορθωτικές κινήσεις με στόχο να «σφίξει» την άμυνα και να χτυπήσει πιο οργανωμένα στις αντεπιθέσεις. Σκορ οποιαδήποτε στιγμή του αγώνα 1-1 σε απόδοση 4.50. Το πρόγραμμα της αγωνιστικής θα ολοκληρωθεί με το παιχνίδι Ολυμπιακός – Ατρόμητος στο Φάληρο (21:30). Οι «ερυθρόλευκοι» την Πέμπτη είχαν ευρωπαϊκό ματς με την Τσουκαρίτσκι στα play offs του Europa League και εντυπωσίασαν (3-1) με κορυφαίο τον Κώστα Φορτούνη. Η ομάδα από το Περιστέρι δεν έπαιξε στην πρεμιέρα με τον Παναθηναϊκό και πέφτει στα βαθιά σε μια δύσκολη έδρα. Οι φιλοξενούμενοι παραδοσιακά περνάνε δύσκολες στιγμές μέσα στο «Γ. Καραϊσκάκης», όμως είναι ικανοί για ένα ημίχρονο να βάλουν δύσκολα στους Πειραιώτες. Ο Ολυμπιακός θα κάνει μίνι ροτέισον, λόγω κούρασης δεν θα έχει την ίδια ενέργεια όπως με τους Σέρβους, ενώ ο Ατρόμητος θα μπει με φορτισμένες μπαταρίες στο τερέν. Την ισοπαλία στο ημίχρονο την συναντάμε σε απόδοση 2.40! Τέλος, ανάμεσα στις 1000+ προσφερόμενες αγορές σε κάθε αγώνα, μπορεί κάποιος να βρει combo bets, στοιχήματα για τον τρόπο επίτευξης των τερμάτων, super ενισχυμένες αποδόσεις, στατιστικές επιλογές (κάρτες, κόρνερ, πέναλτι κ.ά) και μία πλούσια γκάμα ειδικών στοιχημάτων (ομάδων και παικτών). ΟΙ ΑΠΟΔΟΣΕΙΣ ΕΝΔΕΧΕΤΑΙ ΝΑ ΤΡΟΠΟΠΟΙΗΘΟΥΝ ΑΝΑ ΠΑΣΑ ΣΤΙΓΜΗ 21+| ΑΡΜΟΔΙΟΣ ΡΥΘΜΙΣΤΗΣ:ΕΕΕΠ | ΚΙΝΔΥΝΟΣ ΕΘΙΣΜΟΥ & ΑΠΩΛΕΙΑΣ ΠΕΡΙΟΥΣΙΑΣ | ΓΡΑΜΜΗ ΒΟΗΘΕΙΑΣ ΚΕΘΕΑ: 2109237777 | ΠΑΙΞΕ ΥΠΕΥΘΥΝΑ.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Μπέλινγκχαμ: Σε δύο εβδομάδες σκόραρε στη La Liga όσο ο Αζάρ σε... τέσσερα χρόνια","link":"https://www.gazzetta.gr/football/la-liga/2250086/mpelingkham-se-dyo-ebdomades-skorare-sti-la-liga-oso-o-azar-se-tessera","keywords":["Ποδόσφαιρο","La Liga","Κωνσταντίνος Κωλαΐτης","Ρεάλ Μαδρίτης","Εντέν Αζάρ","Τζουντ Μπέλινγκχαμ"],"creator":null,"video_url":null,"description":"Ο Τζουντ Μπέλινγκχαμ πραγματοποιεί μαγικό ξεκίνημα στη La Liga με τη Ρεάλ Μαδρίτης μετρώντας τέσσερα γκολ στις τρεις πρώτες αγωνιστικές, αριθμός με τον οποίο έκλεισε την καριέρα του στη Βασίλισσα ο Εντέν Αζάρ έπειτα από τέσσερις σεζόν!","content":"Η Ρεάλ Μαδρίτης και το ισπανικό πρωτάθλημα βλέπουν έναν νέο σταρ να λάμπει μπροστά τους και να ηγείται στην εκκίνηση φετινή σεζόν. Ο Τζουντ Μπέλινγκχαμ αποδεικνύει από το πρώτο λεπτό γιατί δαπανήθηκαν 103 εκατομμύρια ευρώ για την απόκτησή του από τη Βασίλισσα και μεταφράζει την τρομερή του προσαρμογή στο σύνολο του Κάρλο Αντσελότι με γκολ σε κάθε παιχνίδι. Ο Βρετανός χαφ έδωσε και πάλι τη λύση στη Ρεάλ για το 3X3 στο ξεκίνημα της φετινής La Liga πετυχαίνοντας με κεφαλιά στο 81' το γκολ που χάρισε το διπλό κόντρα στη Θέλτα (0-1), φτάνοντας ήδη τα τέσσερα γκολ στο ισπανικό πρωτάθλημα. Με άλλα λόγια, η δεύτερη ακριβότερη μεταγραφή της Ρεάλ ισοφάρισε τον απολογισμό της ακριβότερης, του Εντέν Αζάρ που έμεινε στο κλαμπ για τέσσερις σεζόν, μέσα σε δύο εβδομάδες! Ο Βέλγος εξτρέμ που μετατράπηκε σε σκιά του καλού του εαυτού από την ημέρα που πάτησε στο «Σαντιάγο Μπερναμπέου», αποχαιρέτησε τους Μερένγκες φέτος το καλοκαίρι μετά από σύνολο 54 εμφανίσεων στο πρωτάθλημα (σχεδόν το 1/3 των διαθέσιμων αγώνων), με το κοντέρ να σταματά στα τέσσερα γκολ και τις εννέα ασίστ. Ήδη, λοιπόν, ο Μπέλινγκχαμ έχει πιάσει τον πήχη που έθεσε το πιο δαπανηρό απόκτημα στην ιστορία των Μαδριλένων και δείχνει με το... καλησπέρα πως αυτή τη φορά το εννιαψήφιο ποσό θα μπει σε διαδικασία απόσβεσης.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Ολυμπιακός: Ομάρ Ρίτσαρντς ή αλλιώς «Απλά δεν τα παράτησα» (vids)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2249648/omar-ritsarnts-ena-paidi-poy-den-toy-haristike-tipota-vids","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ολυμπιακός","Γιώργος Ντυμένος","Ομάρ Ρίτσαρντς"],"creator":null,"video_url":null,"description":"Ο Ομάρ Ρίτσαρντς που ανακοινώθηκε ήδη από τον Ολυμπιακό μεγάλωσε με τη μητέρα του και τα δύο του αδέρφια, πριν γίνει μπακ έπαιζε μεσοεπιθετικός, είχε ίνδαλμα τον Μπερνάντο Σίλβα και του αρέσουν το μπόουλινγκ, το play station και η ιστορία.","content":"Αν ανατρέξουμε στα παιδικά μας χρόνια τότε όλοι μας, κακά τα ψέμματα, σε κάθε απόπειρα να παίξουμε ποδόσφαιρο, στα «τσικό» όπως λέγονταν ή έστω στη γειτονιά, είχαμε, ως επί το πλείστον για «σύμμαχο», τον πατέρα μας. Εκεί στρεφόμασταν με σκοπό να πάρουμε τη σχετική άδεια, όμως για τον Ομάρ Ρίτσαρντς που ανακοινώθηκε ήδη από την ομάδα του Ολυμπιακού εκείνα τα ανέμελα έτη κύλησαν διαφορετικά. Ο νέος αριστερός μπακ των «ερυθρολεύκων» δεν τα βρήκε «έτοιμα» στη ζωή του και όπως είπε ο ίδιος σε ανύποπτη στιγμή και λίγο μετά την μετακίνησή του στην Μπάγερν Μονάχου «τίποτα δεν μου δόθηκε στο πιάτο, Πάλεψα και δούλεψα σκληρά για όλα. Στο γήπεδο όταν ήμουν μικρός αισθανόμουν ντροπή όταν έχανα την μπάλα και προσπαθούσα να την πάρω αμέσως πίσω. Πάντα θέλω να κερδίζω και θα κάνω τα πάντα για αυτό». Γεννήθηκε λοιπόν τον Φεβρουάριο του 1998 στο Λέβινσαμ - ένα προάστιο του Λονδίνου - και μεγάλωσε μαζί με τη μητέρα του και τους δύο αδερφούς του (σ.σ. εκείνος είναι ο μεσαίος). «Τον πατέρα μου δεν τον έβλεπα συχνά. Είμαι τυχερός που είχα τη μητέρα μου, έκανε τόσα πολλά για εμένα», σχολίασε χαρακτηριστικά μεταγενέστερα. Παρά τις δυσκολίες που υπήρχαν έλαβε από εκείνη όλα τα απαραίτητα «εφόδια» και το ποδόσφαιρο αποτέλεσε το μεγάλο του «πάθος». Ή τουλάχιστον έτσι εξελίχθηκε χάρις στην προτροπή της, αφού η υπομονή και επιμονή της ήταν που τον οδήγησαν σε top επίπεδο. «Της οφείλω πάρα πολλά. Αν δεν με πήγαινε προπόνηση από τόσο μικρή ηλικία, δεν ξέρω τι θα μου είχε συμβεί», λέει με έμφαση και κάπως έτσι άρχισε να ξετυλίγεται το κουβάρι της ιστορίας μας. Πρώτος του σταθμός ήταν μία τοπική ομάδα, ύστερα κάποια άλλη και στο νησί σε κάθε αγώνα των πιτσιρικάδων, όπου και αν διεξάγονται, στοιβάζονται στις εξέδρες σκάουτερ όλων των επαγγελματικών συλλόγων της Αγγλίας , με σκοπό φυσικά να εντοπίσουν «λαβράκια». «Επαιζα για πλάκα. Ειλικρινά δεν ήξερα αν ήμουν καλός», λέει για τα νηπιακά του βήματα στον χώρο, ωστόσο το έμπειρο μάτι ανθρώπων που δραστηριοποιούνται επαγγελματικά στην μπάλα αντιλήφθηκαν το ταλέντο του. Για την ιστορία Τσέλσι , Τσάρλτον και Φούλαμ ενδιαφέρθηκαν περισσότερο, η τελευταία πιο ουσιαστικά και ύστερα από ολιγοήμερη δοκιμή εντάχθηκε, σε ηλικία 10 ετών, στα τμήματα υποδομής της. Λίγο αργότερα μαζί στους «μικρούς» του club βρέθηκε και ο νεαρότερος αδερφός του και αυτόματα άρχισε μεταξύ τους να αναπτύσσεται ένας υγιής ανταγωνισμός, ως είθισται να συμβαίνει σε αυτή την ηλικία. Το έπαθλο; Ποιος θα γίνονταν καλύτερος. Επαιζαν στο γήπεδο, στη γειτονιά, παντού και το «μικρόβιο» της μπάλας... φώλιασε μέσα του για τα καλά. Στα 16 του όμως ήρθε το πρώτο «σοκ», αφού δεν συνέχισε στους «Κότατζερς» και προς στιγμήν το όνειρο της επαγγελματικής ενασχόλησης με το ποδόσφαιρο άρχισε να «σβήνει». Στην εφηβεία πια βρέθηκε κοντά ώστε να τα παρατήσει, αλλά κανείς καλός δεν χάνεται. Νόμος της ζωής. Ο Εϊμόν Ντόλαν που το 2016 έφυγε από τη ζωή αν και μόλις 48 ετών, ήταν το 2013 υπεύθυνος ακαδημιών της Ρέντινγκ και τον είχε τσεκάρει εν δράση. Αμέσως μόλις έφυγε από το «Craven Cottage» ήρθε σε επικοινωνία με την πλευρά του και ο έφηβος Ρίτσαρντς μετακόμισε στη γειτονική πόλη. Το Ρέντινγκ όμως απέχει περίπου 70 χιλιόμετρα από την αγγλική πρωτεύουσα και ήταν αδύνατον να μην εγκατασταθεί μόνιμα εκεί. Ετσι έμεινε σε οικογένεια που συνεργάζονταν με τον σύλλογο η οποία τον φιλοξενούσε, ως συμβαίνει συνήθως σε ανάλογες περιπτώσεις εφήβων σε όλα τα ομαδικά αθλήματα. Με τη μητέρα του και τα αδέρφια του διατηρούσε συχνότατη επικοινωνία, πήγαιναν και τον έβλεπαν σε κάθε αγώνα, ωστόσο η καθημερινότητά του διαφοροποιήθηκε και εύλογα εντελώς. Από τη βουή της μεγαλούπολης βρέθηκε στην κωμόπολη Γούντλεϊ των 35.000 κατοίκων που βρίσκεται δίπλα στο τότε ποδοσφαιρικό του «σπίτι» και είναι χαρακτηριστική η πρώτη του επαφή με τα καινούργια δεδομένα που προέκυψαν. «Φτάσαμε με τον μάνατζέρ μου και είχαν (σ.σ. στη νέα του οικεία) ένα σκυλί που άρχισε να κατευθύνεται κατά πάνω μου. Πέταξα τα πράγματά μου και άρχισα να τρέχω προς το αμάξι. Δεν είχα συνηθίσει τα σκυλιά. Ηταν όλα νέα για μένα. Διαφορετική κουλτούρα, φαγητό, ενδιαφέροντα. Ολα. Αλλαξα πέντε σπίτια, έμαθα νέους ανθρώπους, έζησα διαφορετικά πράγματα και ήταν μία ωραία εμπειρία», ανέφερε πολύ μετά για εκείνα τα χρόνια της παρουσίας του στο club. Εν μέσω όλων αυτών «μεγάλωνε» ποδοσφαιρικά και σταδιακά αναγορεύτηκε σε ηγέτη των U21 και U23 της Ρέντινγκ . Ξεχώριζε στα αντίστοιχα πρωταθλήματα και αν δικαίως ο Εϊμον Ντόλαν θεωρείται ως ο άνθρωπος που διέκρινε πρώτος το ταλέντο του, εξίσου σημαντικό μερίδιο στην εξέλιξή του πιστώνεται και ο Ντέιβιντ Ντοντ . Βλέπετε ο Ρίτσαρντς πήγε στον σύλλογο με την... ιδιότητα του αριστερού μεσοεπιθετικού, αφού εκεί έπαιζε μέχρι και πριν την ενηλικίωσή του και δεν είναι τυχαίο πως ο Νταβίντ Σίλβα αποτελούσε το ποδοσφαιρικό του ίνδαλμα, ενώ πολλάκις φορούσε τη φανέλα με το νούμερο «10». Ο τελευταίος όμως, ο Ντοντ , που ήταν προπονητής στα τμήματα υποδομής του σωματείου αποφάσισε να τον γυρίσει ακραίο οπισθοφύλακα, ο πιτσιρικάς προσαρμόστηκε άμεσα και αυτόματα περίπου 17 ετών ήταν που μετατράπηκε σε έναν full-back ολκής! Υπό αυτές τις συνθήκες φτάσαμε στο καλοκαίρι του 2017, οπότε και συμπεριλήφθηκε στην αποστολή της ομάδας των ανδρών για την καλοκαιρινή της προετοιμασία που έγινε στην Ολλανδία . Στα 19 του λογίζονταν πια ως μέλος των «μεγάλων» και στις 5 Αυγούστου εκείνου του έτους ντεμπουτάρισε σε επαγγελματικό επίπεδο, ως αλλαγή σε ένα ματς κόντρα στην ΚΠΡ . «Η μητέρα μου και τα αδέρφια μου βρίσκονταν στις εξέδρες. Δεν νομίζω πως θα κοιμήθηκε εκείνο το βράδυ. Μικρός ονειρευόμουν να παίζω σε μία ομάδα και σε γεμάτο γήπεδο και κάθε φορά που το κάνω υπάρχουν φορές που δεν πιστεύω πως τα έχω καταφέρει. Ευχαριστώ τον Θεό για κάθε στιγμή και που Εκείνος μου έδωσε τη σχετική δυνατότητα και την ευκαιρία», τόνισε μερικούς μήνες μετά την αναμέτρηση του «Loftus Road» , οπότε και... συστήθηκε στο βρετανικό φίλαθλο κοινό. Η ιστορία λοιπόν άρχισε να «γράφει», εκείνη και την επόμενη σεζόν μέτρησε αθροιστικά 32 εμφανίσεις σε Championship , FA Cup , Λιγκ Καπ και παράλληλα τον Οκτώβριο του 2019 έπαιξε για πρώτη φορά με την U21 της χώρας του. Μέχρι που φτάσαμε στο 2019/20 που ήταν η χρονιά της καθιέρωσης καθώς αναγορεύτηκε σε «κολόνα» της αριστερής πτέρυγας του συλλόγου, όπου αρκετές φορές... θυμόταν τα νιάτα του και από αμυντικός αγωνίζονταν εξτρέμ. Το 2020/21 όμως και λόγω της αποχώρησης του Τάιλερ Μπλάκετ έβγαλε όλη τη χρονιά ως μπακ (42 παιχνίδια σε όλες τις διοργανώσεις), ήταν εκ των κορυφαίων της Ρέντινγκ και ένας από τους λόγους που στο «Madejski» φλέρταραν με την είσοδό τους στα play-offs της ανόδου στην Premier League (στη regular season τερμάτισαν 7οι), Πια είχε «χτίσει» το όνομά του και δεν είναι τυχαίο πως υπέγραψε ως ελεύθερος στην Μπάγερν Μονάχου , που του έδωσε τη φανέλα με το «3». Ο Χασάν Σαλιχάμιτζιτς μάλιστα... έσταξε μέλι για εκείνον. «Είμαστε χαρούμενοι που ο Ομάρ ήρθε σε εμάς. Είναι ένας προικισμένος παίκτης και τον εμπιστευόμαστε», σχολίασε σχετικά, ενώ το συμβόλαιό του με τους Βαυαρούς είχε ισχύ ως το καλοκαίρι του 2025. Ετσι λοιπόν από την Championship βρέθηκε εν μία νυκτί στη Μπουντεσλίγκα και το Champions League , το 2021/22 έπαιξε σε 17 αγώνες εντός και εκτός συνόρων, κατέκτησε τον τίτλο του πρωταθλητή (όπως και το Super Cup ) και παράλληλα η ομοσπονδία της Τζαμάικα από όπου κατάγεται άρχισε να τον «ψήνει» με σκοπό να συμπεριληφθεί στην Εθνική της. Με γνώμονα τα παραπάνω φτάσαμε στον Ιούλιο του 2022, οπότε και έφτασε η στιγμή του επαναπατρισμού. Η Νότιγχαμ έκανε κίνηση για την απόκτησή του και έναντι ενός ποσού που τα δημοσιεύματα της εποχής υπολογίζουν στα 8,5 εκατομμύρια ευρώ τον πήρε από το «Allianz Arena» και τον έφερε στο «City Ground» . Ωστόσο στάθηκε σούπερ άτυχος, καθώς ορισμένα προβλήματα τραυματισμών τον άφησαν για μεγάλο χρονικό διάστημα εκτός δράσης και ναι μεν στο φινάλε της περασμένης περιόδου συμπεριλήφθηκε κάποιες φορές στην αποστολή της Φόρεστ , δεν ντεμπουτάρισε με τη φανέλα της. Πάντως στην αρχή της φετινής της προετοιμασίας έδειξε καλά, συμμετείχε κανονικά στην αποστολή των «Reds» που πήγαν στην Ισπανία , μπήκε σε φουλ ρυθμούς και πλέον έπιασε λιμάνι με σκοπό να κάνει το δυναμικό come-back. Ξέχωρα από το ποδόσφαιρο ο Ρίτσαρντς έχει ακόμη μία «τρέλα», με την καλή βέβαια έννοια, το μπόουλινγκ. Στο Μόναχο ήταν... ιστορικές οι σχετικές του «κόντρες» με τους Τζόσουα Κίμιχ και Αλφόνσο Ντέιβις , με τον... θρύλο να λέει πως συνήθως κέρδιζε εκείνος. O πρώτος μάλιστα ήταν το alter ego του στην Μπάγερν και ο άνθρωπος που πάντα βρίσκονταν στο πλευρό του, καθώς τον βοήθησε τα μέγιστα ώστε να εγκλιματιστεί. Στον ελεύθερο χρόνο του παίζει συχνά παιχνίδια στο play station και ευρύτερα προτιμά να χαλαρώνει με φίλους και την οικογένειά του. Ακόμη ένα χαρακτηριστικό του είναι πως του αρέσει πολύ η ιστορία και θέλει να μαθαίνει τα πάντα για τον τόπο που διαμένει. Στη Γερμανία για παράδειγμα επισκέφθηκε το στρατόπεδο συγκέντρωσης Νταχάου που βρίσκεται κοντά στο Μόναχο και οι Ναζί δολοφόνησαν εκεί εκατοντάδες χιλιάδες ανθρώπους, ως μέρος του φρικτού σχεδίου τους να κατακτήσουν τον κόσμο. «Θέλω να ξέρω που βρίσκομαι», σχολίασε σχετικά και ευρύτερα παρουσιάζεται ένας ιδιαίτερα ευαισθητοποιημένος άνθρωπος, που «διψά» ώστε να εμπλουτίζει τις γνώσεις του. Προβληματίζεται για τα πάντα και πλέον ως κάτοικος Ελλάδας θα έχει την ευκαιρία να επισκεφθεί πολλά μέρη και να μάθει και για τη δική μας ιστορία. Την ίδια στιγμή θα προσέξει κάποιος τα δεκάδες τατουάζ που κοσμούν το σώμα του. Μεταξύ άλλων υπάρχει η λέξη «ευλογημένος», κάποιες ημερομηνίες, το σύμβολο του «Γιν Γιανγκ» και αρκετά άλλα. Αυτά που ίσως να τον χαρακτηρίζουν περισσότερο είναι εκείνα που κοσμούν το στήθος του αλλά και τον αριστερό του δικέφαλο, στο καλό του πόδι δηλαδή. Στην πρώτη περίπτωση βλέπουμε έναν αετό και στην πλευρά της καρδιάς το σήμα της ειρήνης, ενώ στην άλλη τη φράση «Απλά δεν τα παράτησα»!","pubDate":"2023-08-26 07:10:10","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Σωτήρη Γκορίτσα, τι σκεφτόσουν όταν έγραφες το Μπραζιλέρο;","link":"https://www.gazzetta.gr/football/2248582/sotiri-gkoritsa-ti-skeftosoyn-otan-egrafes-mprazilero","keywords":["Ποδόσφαιρο","Άκης Κατσούδας"],"creator":null,"video_url":null,"description":"Συναντήσαμε έναν από τους σημαντικότερους Έλληνες σκηνοθέτες της γενιάς του και μιλήσαμε για την ποδοσφαιρική ταινία που δημιούργησε πριν από 22 χρόνια και παραμένει επίκαιρη μέχρι σήμερα.","content":"Η Ελλάδα δεν είναι μία χώρα που φημίζεται για τις ποδοσφαιρικές της ταινίες. Γνωρίζουμε τη Φανέλα με το Νούμερο 9 , του Παντελή Βούλγαρη, που παρουσιάζει την ιστορία ενός ταλαντούχου παίκτη ο οποίος δεν κατάφερε ποτέ να γίνει αυτό που ονειρευόταν, τους Άσσους του Γηπέδου , μια ταινία του μακρινού 1956 που αφηγείται διάφορες ιστορίες Ελλήνων ποδοσφαιριστών της εποχής, την Κληρονόμο . Μέσα σε αυτή την πολύ περιορισμένη λίστα, λοιπόν, υπάρχει μια ακόμη ταινία. Πρόκειται για το Μπραζιλέρο , του Σωτήρη Γκορίτσα . Το φιλμ κυκλοφόρησε το 2001, τέσσερα χρόνια μετά την μεγάλη επιτυχία του Βαλκανιζάτερ , και, σύμφωνα, με τα δημοσιεύματα της εποχής, πήγε εξαιρετικά καλά, κόβοντας κάτι περισσότερα από 50 χιλιάδες εισιτήρια. Η πλοκή του είναι η εξής: ο ευκατάστατος παράγοντας μιας ελληνικής επαρχιακής πόλης δέχεται ξαφνικά την αιφνιδιαστική επίσκεψη δυο Ευρωπαίων οικονομικών ελεγκτών, μιας τρόικας της εποχής, που έρχονται κατεπειγόντως να ελέγξουν την κατάληξη των ευρωπαϊκών δανείων σε Έλληνες επιχειρηματίες. Μόνο που διαπιστώνουν γρήγορα πως τα χρήματα δεν τα έκανε επενδύσεις αλλά τα έριξε όλα για την απόκτηση ενός βραζιλιάνου ποδοσφαιριστή που τελικά αποδείχτηκε παλτό. Όλη η ταινία, λοιπόν, περιστρέφεται γύρω από τη σύγκρουση της ελληνικής με την ευρωπαϊκή πραγματικότητα. Καυτηριάζοντας, παράλληλα, τα κακώς κείμενα του ποδοσφαίρου της χώρας μας: την οπαδική βία , τα καραβάνια ξένων ποδοσφαιριστών αμφιβόλου αξίας που έφταναν στην Ελλάδα, τα στημένα παιχνίδια. Την ίδια ώρα, όμως, αποτελεί μια από τις ελάχιστες αποτυπώσεις του ελληνικού ποδοσφαίρου στη μεγάλη οθόνη. 22 χρόνια, λοιπόν, ύστερα από την πρώτη προβολή του φιλμ, απευθυνθήκαμε στον σκηνοθέτη - σεναριογράφο - παραγωγό - μεγάλο ποδοσφαιρόφιλο, Σωτήρη Γκορίτσα, για να μας λύσει όλες τις απορίες. Και πρώτη απ’ όλες: Πώς προέκυψε η ιδέα για το Μπραζιλέρο; Έγραψα το σενάριο στα τέλη της 10ετίας του ’90 τότε που «σοσιαλισμός, μετοχές, ποδόσφαιρο, αστακοί, μακαρόνια και μεζονέτες» είχαν γίνει «μαλλιά κουβάρια». Ενθουσιασμένοι με το χρηματιστήριο, νομίζαμε– ο περιούσιος λαός της γης – ότι βρήκαμε τον τρόπο να βγάζουμε πέντε έξι μισθούς κάθε μέρα αγοράζοντας χαρτιά και πουλώντας τα, λίγη ώρα αργότερα. Όπως πάντα τα έξυπνα πουλιά από την μύτη πιάνονται και με δεκαετία αργότερα χρεοκοπήσαμε. Αυτός ο τύπος του νέο-Έλληνα είναι που με απασχολεί σε όλες μου τις ταινίες. Άλλοτε τον αγαπώ και άλλοτε μου ‘ρχεται να τον σακατέψω. Προσπαθώ να τον καταλάβω. Αλλά εκεί που νομίζω ότι τον «τσάκωσα» μου ξεγλιστράει. Και πρέπει να κάνω κι άλλη ταινία μήπως και τον στριμώξω. Παρακολουθείτε από μικρός ποδόσφαιρο; Ποιες είναι οι πρώτες εικόνες και αναμνήσεις που έχετε από αυτό; 1970, Τετάρτη μεσημέρι μετά το σχολείο πίσω από τα κάγκελα της θύρας 10 στη Λεωφόρο Αλεξάνδρας παρακολουθώ στο τέλος της προπόνησης τον Φέρεντς Πούσκας να λέει στον τερματοφύλακα Βασίλη Κωνσταντίνου «Που το θες, Βασιλάκη;». Εκείνος να απαντάει, «Ρίξε, ρε χοντρέ, όπου θες», τον Πούσκας έξω από την μεγάλη περιοχή χωρίς φόρα να σουτάρει το φάουλ, τον Κωνσταντίνου να παρακολουθεί άνετος την μπάλα που κατευθύνεται άουτ και τελευταία στιγμή να στρίβει απότομα και να καρφώνεται στο γάμα της εστίας του. Η κοιλιά του Πούσκας να ανεβοκατεβαίνει από τα γέλια, ο τσαντίλας Κωνσταντίνου να ζητάει επανάληψη και να τρώει και το επόμενο γκολ. Προσπάθησα την άλλη ημέρα να κάνω το ίδιο στο σχολείο, η μπάλα δεν έστριβε με τίποτα και την κυνηγάγαμε στα πευκάκια. Παραιτήθηκα μουρμουρίζοντας «άμα δεν σε θέλει η μπάλα, δεν μπαίνει με τίποτα». Πείτε δύο λόγια για τα γυρίσματα της ταινίας. Σε ποια περιοχή έγιναν και πόσο εύκολες ήταν οι γηπεδικές - ποδοσφαιρικές σκηνές; Είχε προηγηθεί πριν λίγα χρόνια η εμπορική επιτυχία του «Βαλκανιζατέρ» και είχα αυτή την φορά άνεση στον προϋπολογισμό της ταινίας οπότε τα γυρίσματα έγιναν σε όλη την Ελλάδα, από την Ραφήνα έως τα Χανιά, κι από το Πόρτο Ράφτη έως τον ποταμό Νέστο. Τα ποδοσφαιρικά γυρίσματα έγιναν στον Ταύρο στο γήπεδο του Φωστήρα. Είχατε ασχοληθεί ποτέ ξανά στο παρελθόν με κάτι παρόμοιο; Όχι, αλλά δεν μου ήταν δύσκολο καθώς από μικρός έπαιζα μπάλα, ήμουν μάλιστα το αριστερό εξτρέμ «αστέρι» του σχολείου. Ώσπου στο πρωτάθλημα στο ξερό του Αγίου Κοσμά με ένα σχολείο κάπου από το Κερατσίνι, έφαγα τις κλωτσιές και τα μπινελίκια της ζωής μου και το γύρισα στο μπάσκετ. Όπου λόγω ύψους έπαιξα play maker χωρίς τεράστια επιτυχία. Θα ήθελα να κάνουμε μια αναφορά στο ματς της ταινίας, το τοπικό ντέρμπι. Υπήρξαν κανονικοί ποδοσφαιριστές που αγωνίστηκαν; Οι οπαδοί ήταν κομπάρσοι ή τραβήχτηκαν και πλάνα από κανονικό παιχνίδι; Υπήρξαν κανονικοί ποδοσφαιριστές– από τα εφηβικά του Φωστήρα - που κινούνταν στο φόντο ενώ σε πρώτο πλάνο κοντά στην κάμερα βρίσκονταν οι ηθοποιοί μας. Τραβήχτηκαν επίσης μερικά μακρινά πλάνα του αγώνα από την οπτική γωνία που παρακολουθούσε τον αγώνα ο πρωταγωνιστής Μάινας με τους δυο Ευρωπαίους ελεγκτές. Τα γυρίσματα κράτησαν μια μέρα. Άλλη ημέρα, σε κανονικό ματς του Φωστήρα, τραβήχτηκαν τα πλάνα των φιλάθλων. Στο μοντάζ τα δυο γυρίσματα ενοποιήθηκαν σε ενιαία σκηνή. Το ενδιαφέρον ήταν ότι στην πραγματικότητα συνέβη αυτό που ήταν κοντά στο θέμα που διαπραγματευόταν η ίδια η ταινία: Είχαμε δηλαδή συμφωνήσει μια αμοιβή με τον Φωστήρα για το γύρισμα αλλά μόλις ο υπεύθυνος του γηπέδου είδε κάμερες, φώτα, ηθοποιούς, συνεργείο, βανάκια κλπ. για να μας αφήσει να γυρίσουμε μας ζήτησε τα διπλάσια αλλιώς δεν μπαίναμε στο γήπεδο. Φυσικά τα δώσαμε. Το ίδιο επαναλήφθηκε πέρυσι – δηλαδή τριάντα χρόνια αργότερα από το Μπραζιλέρο - στην τελευταία μου ταινία το Εκεί Που Ζούμε . Είναι αυτό που σας έλεγα πριν για το νέο-Έλληνα που μάταια προσπαθώ να καταλάβω. Είχατε δώσει συγκεκριμένες οδηγίες στον Φώτη Σπύρο (Κυριάκο) και στον Θανάση Βισκαδουράκη (Οδυσσέα) για το πώς θα χειρίζονται τη μπάλα και τι πρέπει να κάνουν κατά τη διάρκεια των ποδοσφαιρικών γυρισμάτων; Αν και καλλιτέχνες κάτι σκάμπαζαν από ποδόσφαιρο και δεν χρειάστηκε πολύ δουλειά για να μπουν στο νόημα. Μπορούσα επίσης στην πρόβα να δείξω εγώ ο ίδιος τι έπρεπε να κάνουν. Παρ’ όλα αυτά νομίζω ότι οι κομπάρσοι κανονικοί ποδοσφαιριστές του Φωστήρα ψιλοχαμογελούσαν βλέποντάς μας. Σε κάθε σας ταινία δίνετε πολύ μεγάλη έμφαση στο μουσική. Πώς νιώθετε που το «Θάλασσά μου Σκοτεινή» του Νίκου Πορτοκάλογλου αλλά και το «Τι Λείπει;» που ερμήνευσε η Ελευθερία Αρβανιτάκη έχουν γίνει δύο από τις μεγαλύτερες επιτυχίες της σύγχρονης ελληνικής μουσικής; Ξεκινάω πάντα με το ότι «ο καλός κινηματογράφος δεν χρειάζεται μουσική». Και καταλήγω να μην μου χωράνε στο μοντάζ όλες οι μουσικές που θέλω να βάλω. Υποψιάζομαι ότι αυτό οφείλεται στο φίλο μου Νίκο Πορτοκάλογλου ο οποίος από εκεί που του ζητάω ένα μικρό θεματάκι δέκα δευτερολέπτων για τους τίτλους, μου έρχεται με καμιά δεκαριά κομμάτια που δεν ξέρω ποιο να αφήσω απ’ έξω. Μόνο στη τελευταία ταινία μου συνεργαστήκαμε όπως κάνουν σε όλο τον κόσμο, δηλαδή μόνταρα την ταινία και έγραψε μετά την μουσική βλέποντας την εικόνα. Στο θέμα των ερμηνευτών των λίγων τραγουδιών που χρησιμοποιώ στο soundtrack το συζητάμε και καταλήγουμε μαζί. Είναι, πιστεύετε, το ελληνικό ποδόσφαιρο και οι στρεβλώσεις του, ένα καλό δείγμα για το πώς λειτουργούσε και λειτουργεί γενικότερα η ελληνική κοινωνία; Είναι ο κατ' εξοχήν χώρος όπου διαγράφονται ανάγλυφα όλες οι παθογένειες της κοινωνίας μας. Χωρίς μάλιστα να κάνουν καν προσπάθεια να κρυφτούν πίσω από «ιδέες, πολιτικές, οράματα» και τα λοιπά. Ενώπιον σαράντα χιλιάδων θεατών μπουκάρει ο πρόεδρος με το πιστόλι στη ζώνη ή κάνει ο άλλος μια βουτιά δυο μέτρα έξω από την περιοχή, ο διαιτητής δείχνει απτόητος τη βούλα του πέναλτι και οι χιλιάδες «φίλαθλοι» στην κερκίδα πανηγυρίζουν. Τι να λέμε λοιπόν. Όταν μάλιστα κάποτε ανέφερα το περιστατικό με το περιβόητο πέναλτι σε φίλο Πειραιώτη μου απάντησε ότι «Ακριβώς αυτό είναι η ηδονή (είπε μια άλλη λέξη), να σας γαμ… με πέτσινο πέναλτι στο 90!». Τα τελευταία χρόνια παρακολουθώ ξένα πρωταθλήματα, ειδικά το Αγγλικό, όπου ανακαλύπτω ξανά τον λόγο που αγάπησα το ποδόσφαιρο. Θεωρείτε πως το Μπραζιλέρο είναι, κατά κάποιο τρόπο, το σίκουελ του Βαλκανιζατέρ; Και τα δυο έχουν να κάνουν με την προσπάθεια να καταλάβω τα ωραία και τα στραβά που ταλαιπωρούν την ζωή μας. Από την πρώτη ως την τελευταία ταινία μου νομίζω ότι στην πραγματικότητα κάνω ένα σπονδυλωτό ντοκιμαντέρ για τον νεοέλληνα. Έχει αλλάξει καθόλου, πιστεύετε, το ελληνικό ποδόσφαιρο από τη χρονιά που προβλήθηκε για πρώτη φορά η ταινία; Θεωρείτε πως παραμένει επίκαιρη μέχρι σήμερα; Βεβαίως. Έχει χειροτερέψει. Δείτε την εθνική μας ομάδα. Αντί το πυροτέχνημα του Ευρωπαϊκού πρωταθλήματος στη Πορτογαλία να είναι η αρχή της εξυγίανσης εκφυλίστηκε στην, με κάθε μέσο, κατάκτηση του πρωταθλήματος ώστε η ομάδα να εισπράξει τα λεφτά των ομίλων του Champions League . Το ίδιο δηλαδή που έκανε πριν τριάντα χρόνια ο ήρωας του Μπραζιλέρο. Με την Ευρωπαϊκή επιδότηση αντί για «Πολιτιστικό Κέντρο» έχτισε βίλλα και αγόρασε ένα Βραζιλιάνο επιθετικό για την τοπική ομάδα. Και όταν ήλθαν από την Ευρώπη οι ελεγκτές να τσεκάρουν τι έγιναν τα χρήματα των Ευρωπαίων φορολογουμένων με τα οποία τον είχαν επιδοτήσει ο Στέλιος Μάινας τους είπε «Go back!» και τα υπόλοιπα γραφικά που πριν λίγα χρόνια ακούσαμε από πρωθυπουργό. Να όμως που άγιο είχαμε πάλι και γλιτώσαμε στο τσακ τον υποβιβασμό. Θα σκεφτόσασταν ποτέ να κάνετε το Μπραζιλέρο 2 ή μια άλλη ποδοσφαιρική ταινία; Υπάρχει χώρος για ποδοσφαιρικό σινεμά στην Ελλάδα; Τα νούμερο 2 συνήθως είναι χειρότερα του 1 και δεν θα το σκεφτόμουν. Επίσης δεν είναι καν Έλληνες πια οι παίκτες των ομάδων μας. Εδώ ακόμα δεν κατάφερα να περιγράψω στο βάθος που θα ήθελα τον Έλληνα, θα ασχοληθώ με τον κάθε Περουβιανό που βγάζει εδώ το ψωμάκι του; Και μια τελευταία. Μιας και ο τίτλος είναι Μπραζιλέρο, ποιος είναι ο αγαπημένος σας Βραζιλιάνος ποδοσφαιριστής; Ο Ζαϊρζίνιο της εθνικής Βραζιλίας του ’70. Αν και έπαιζε δεξί εξτρέμ ενώ εγώ αριστερό, τα δικά του κόλπα ξεσήκωνα, βάζοντας κι ολίγη από τον Αργεντινό Χουάν Ραμόν Βερόν - που ήταν ως γνωστόν «πράγμα φοβερόν» - και για κερασάκι τις ντρίμπλες του Χάρη του Γραμμού «από την Μυτιλήνη». Σημείωση: Η χρήση των παραπάνω εικόνων έγιναν ύστερα από άδεια του Σωτήρη Γκορίτσα.","pubDate":"2023-08-26 07:00:00","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Kudus Mohammed (Ajax Amsterdam) vers West Ham","link":"https://www.lequipe.fr/Football/Actualites/Kudus-mohammed-ajax-amsterdam-vers-west-ham/1415796#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"L'Ajax et West Ham ont trouvé un accord de principe pour le transfert de Kudus Mohammed. Le milieu ghanéen devrait signer cinq ans (plus une année en option) et le club d'Amsterdam toucher 42 M€ et 3 M€ de bonus.","content":"Kudus Mohammed n'a pas manqué ses adieux pour son dernier match avec l'Ajax. Déjà auteur d'un but et d'une passe décisive en deux matches d'Eredivisie cette saison, le milieu offensif ghanéen s'est offert un triplé retentissant, jeudi, sur la pelouse de Ludogorets . Le point final d'une aventure de trois ans avec le club néerlandais qu'il s'apprête à quitter pour la Premier League. West Ham et l'Ajax ont en effet trouvé un accord de principe pour un transfert à hauteur de 42 millions d'euros (plus 3 M€ de bonus). Il pourrait être entériné ce samedi. Kudus Mohammed, 23 ans, passera ensuite sa visite médicale avant de s'engager sur un contrat de cinq ans, plus une année en option avec les Hammers. 11 buts en 30 matches d'Eredivisie la saison dernière Ce transfert s'inscrit dans la continuité d'une saison où le polyvalent international ghanéen (24 sélections, 7 buts), parfois aligné au poste d'avant-centre, a marqué 11 buts en 30 matches de Championnat néerlandais (19 titularisations) et 4 en 6 rencontres de Ligue des champions. Ses performances à la Coupe du monde avaient aussi été très appréciées par les scouts européens. West Ham est donc en passe de devancer la concurrence.","pubDate":"2023-08-26 06:53:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/kudus-mohammed-au-premier-plan-avec-l-ajax-amsterdam-lors-d-un-match-amical-face-au-borussia-dortmund-le-6-aout-g-van-keulen-anp-presse-sports/1500000001825258/0:0,1998:999-665-335-70/9af10.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Georges Mikautadze, un dernier match contre Clermont avant le départ ?","link":"https://www.lequipe.fr/Football/Actualites/Georges-mikautadze-un-dernier-match-avant-le-depart/1415729#xtor=RSS-1","keywords":["Foot, L1, Metz"],"creator":["Cyril Olives-Berthet"],"video_url":null,"description":"Courtisé par de nombreux clubs, Georges Mikautadze est sur le départ mais, faute d'offre satisfaisant le FC Metz, il sera aligné face à Clermont dimanche.","content":"Laszlo Bölöni est malicieux. Le 10 juillet dernier, lors de la reprise de l'entraînement à Metz, l'entraîneur des Grenats avait blagué sur la situation de Georges Mikautadze. « » Presque : un mois plus tard, en Bretagne (1-5, le 13 août), le Géorgien était titulaire et adressait une passe décisive à Youssef Maziz. « », expliquait aussi l'entraîneur roumain de 70 ans. Une forte cote en Italie Il a bien fait. À une semaine de la clôture du marché des transferts, celui qui vient d'être élu meilleur joueur de L2 est encore là. Buteur contre l'OM (2-2, le 18 août), il a encore été le plus en vue de son équipe. « , a expliqué Bölöni, vendredi. » Sous contrat jusqu'en 2026, le joueur de 22 ans a vu ses dirigeants fixer son prix de départ à 20 M€, bonus inclus. Quelques offres ont été refusées dont une à 15 M€ fixes dès la mi-juillet. Cela devrait bouger dans les prochains jours. L'Eintracht Francfort a coché son nom en cas de départ de Randal Kolo Muani. Orphelin de Marko Arnautovic (34 ans), vendu à l'Inter Milan, Bologne est également intéressé. La cote de « Mikau » est d'ailleurs forte en Italie, où la Lazio l'apprécie. Les Grenats, eux, ont budgété sa vente auprès de la DNCG mais Pierre Dréossi, leur directeur sportif, « », comme il l'a dit jeudi après un entraînement à huis clos auquel le joueur a normalement participé. Tout le monde au club attend fébrilement la conclusion de ce dossier au long cours. « », prévenait pourtant le capitaine Matthieu Udol il y a quelques semaines. La vidéo d'adieux est prête depuis longtemps dans les ordinateurs du service communication. Pourrait-elle devenir carrément inutile ? Ce serait une immense surprise.","pubDate":"2023-08-26 06:45:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/georges-mikautadze-est-toujours-a-metz-s-mantey-l-equipe/1500000001825137/0:0,917:611-665-335-70/987dd.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"De La Salle fades in second half, loses its season opener to Orange Lutheran","link":"https://www.eastbaytimes.com/2023/08/25/de-la-salle-fades-in-second-half-loses-its-season-opener-to-orange-lutheran/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","Inside Sports"],"creator":["Darren Sabedra"],"video_url":null,"description":"Southern California heavyweight Orange Lutheran scores three second-half touchdowns, including Steve Chavez's version of Beast Mode, to beat De La Salle.","content":"CONCORD — De La Salle was going to have to play a clean game to win its season opener on Friday night against Southern California heavyweight Orange Lutheran. The Spartans did not play a clean game. Tied at halftime, De La Salle gave up three unanswered second-half touchdowns and lost at home 35-14 against an opponent that won impressively a week earlier and comes from the same league that features Mater Dei and St. John Bosco. Steve Chavez was the star of stars for Orange Lutheran, rushing for three touchdowns, including one the junior running back justifiably called “Beast Mode 3.0.” The 58-yard run late in the third quarter included multiple stiff arms in an electrifying sequence that made it 28-14. For De La Salle, it was one of several plays it would like to have back. “With a good team like Orange Lutheran, the mistakes you can make are very little, virtually none,” quarterback Toa Faavae said. “Too many mistakes. Too many mental mistakes.” De La Salle made a defensive stop in the end zone on the final play of the first half to keep the score 14-14 and got the ball to start the second half. But the Spartans went three-and-out and a short punt gave the visitors possession at the De La Salle 46. Orange Lutheran cashed in with a drive that Chavez finished with a 2-yard run for a 21-14 lead. Later in the quarter, De La Salle got what looked like a big pass play over the middle that would have moved the Spartans inside Orange Lutheran’s 30. But the ball was stripped and Orange Lutheran recovered. “Against a really good team like this, you have to make big plays,” De La Salle coach Justin Alumbaugh said. “They made more than us. We didn’t give up. We were fighting and scrapping. We had opportunities and they capitalized on more opportunities than we did.” After the turnover, De La Salle held Orange Lutheran to nine yards in three plays. But on fourth-and-1 from its own 36, Orange Lutheran handed the ball to Chavez for a 6-yard gain. On the next snap, he made the play that will go directly to the top of his recruiting highlights. “I had some great blocks up front, bounced out and from there, God paved the way,” Chavez said, adding that he made at least four stiff arms on defenders and broke about six tackles. Given how the game started, it looked as if the last one to score would win. The teams combined for 28 points in the first four possessions. Orange Lutheran, coming off a 49-17 rout of Serra-Gardena last week, needed 10 plays to cover 66 yards for a touchdown on the game’s opening possession. TJ Lateef connected with Tyler Hennessy for 14 yards on third-and-11 from Orange Lutheran’s 33 to keep the series alive. Chavez’s slashing 16-yard run, followed by Lateef’s 14-yard scramble moved the visitors inside the 10. Two plays later, Joseph De La Torre caught a 5-yard pass from Lateef to for a 7-0 lead. De La Salle immediately responded. Jaden Jefferson’s 39-yard kickoff return put the Spartans at their own 41. It took De La Salle eight plays to cross the goal line. Faavae’s 16-yard quarterback keeper accounted for the touchdown that evened the score 7-7 with 4:04 left in the opening quarter. Orange Lutheran went in front 14-7 when AJ La caught a 3-yard pass from Lateef in the back of the end zone on third-and-goal to end the opening quarter. Related Articles De La Salle responded again, driving 62 yards to pull even. Dominic Kelley’s 3-yard run made it 21-21 with 7:37 left in the half. The Spartans didn’t score another point the rest of the game. “We get the ball at half, tied 14-14, I liked our chances, to be honest,” Alumbaugh said. “We just couldn’t put it together. Every time we needed a stop, it seemed like they made a big play. Every time we needed a big play, we just couldn’t quite get it done.” The schedule doesn’t soften for De La Salle. Up next: A visit to Serra next Saturday.","pubDate":"2023-08-26 06:35:49","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-DLSFB-0825-03_133237168-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"El Cerrito uses proven formula in season-opening win over Division I school","link":"https://www.eastbaytimes.com/2023/08/25/el-cerrito-uses-proven-formula-in-season-opening-win-over-division-i-school/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","High School Soccer","Inside Sports","PM report","Preps Alert"],"creator":["Curtis Pashelka"],"video_url":null,"description":"El Cerrito's defense held Amador Valley to less than 150 yards of offense on Friday.","content":"PLEASANTON – A hard-fought nonleague win over Division I Amador Valley last year helped propel the El Cerrito High School football team to an undefeated regular season. Gauchos coach Jacob Rincon would gladly take the same end result in 2023, and he might have the defense to do it. El Cerrito’s defense made a two-touchdown lead in the first-half stand as the Gauchos held on to a 14-7 win over Amador Valley on Friday in the season-opening game for both teams. Running back Micah Avery, a transfer from Clayton Valley Charter, scored on a 69-yard touchdown run with 3:46 left in the first quarter and fellow senior Michael Vanhook scored on a quarterback keeper just before halftime, providing just enough offense to help No. 14 El Cerrito extend its regular season win streak to 16 games. Avery had 95 yards on 13 carries and Vanhook completed 8 of 15 passes for 72 yards. El Cerrito’s second touchdown drive was aided by an 85-yard run from another newcomer in Zaire Eastman, who attended De Anza last year. El Cerrito went 12-1 last year, beginning the season with a 7-3 home victory over the Dons. That win proved to be the Gauchos’ closest game of 2022, as they went 10-0 in the regular season and earned blowout playoff wins over Montgomery-Santa Rosa and Northgate to capture the North Coast Section Division III championship. “Coming in, we already knew Amador was going to be a physical, aggressive team,” Rincon said. “We love the brand and style of football they play. It prepares us for the rest of the season. So we expected this to be a dogfight. “Shout out to (Dons coach) Dan (Jones). He does a great job. But overall. I think we got a few good big plays and the touchdown obviously at the half was huge for us.” In the second half, the Gauchos relied on their defense to hold off the resilient Dons. Amador Valley senior Nate Jetter caught a 6-yard touchdown pass from quarterback Aiden Foley with 5:10 left in the fourth quarter to cut El Cerrito’s lead to 14-7. The Dons were then able to get the ball back with just over two minutes to play, but El Cerrito’s defense halted the drive as Amador’s 41. El Cerrito’s defense held opponents to nine points or less nine times last season, and that doesn’t include a 2-0 forfeit win over Hercules last October. “I put it to them in practice: defense wins games, and we saw that here,” Vanhook said. “Defense won this game today. I love them. That’s the key to this team. I’m really proud of them.” El Cerrito’s defense held Amador Valley to less than 150 yards of offense on Friday. “Defensively, we did a great job,” Rincon said. “Defensive coordinator Tim Johnson does a great job preparing those guys, and then for us to come out here and execute the way we did was just a beautiful thing to see.” Amador Valley’s options on offense were limited after senior running back Jake Goldsworthy suffered what Jones said were ankle and toe injuries midway through the first half. At that point, Goldsworthy, a two-way starter, had 36 yards on 12 carries, although he also had a pair of long rushes called back because of penalties. Anthony Harrington and Sean Cervantes took over the bulk of the running game, rushing for a combined 63 yards. Foley completed 4 of 8 passes for 35 yards and is holding things down while junior QB Tristan Tia sits out the first five games as a transfer from Granada. Jones said he thought Goldsworthy would be OK and that he hoped the 6-foot-1, 210-pounder would be available to play next week when Amador Valley travels to play No. 16 Campolindo, last year’s NCS Division II runner-up. “He’s our guy, right? Especially with how we are on offense right now, with no Tristan, we’re running the rock,” Jones said. “And Goldie’s kind of the heart and soul of our team, so when he goes down, it takes the wind out of us a little bit. “We knew (El Cerrito) was a really good team, and I’m really proud for our backs being against the wall, 14-0, and we continued to fight. We didn’t care about what the score was. We were just worried about the next play, and I think that’s the right formula.” Related Articles El Cerrito, which had its season ended with a 36-7 loss to Grant-Sacramento in the CIF NorCal Division 3-AA regional title game, is now a Division II team thanks to the section’s competitive realignment regulations. The Gauchos play Freedom, another Division I team, next week, with their nonleague schedule continuing with games against Fremont-Oakland, Foothill-Pleasanton, and Vacaville. “A win like this could do (a lot for us), but we’ve got to get back to work,” Rincon said. “We had a lot of penalties and we want to clean things up and play a little bit more of a disciplined brand of football.”","pubDate":"2023-08-26 06:33:17","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-ELCERRITO-1202-9-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Μαρσέιγ μεταγραφές: Ανακοίνωσε Κορέα, αντικαταστάτης του στην Ίντερ ο Σάντσες","link":"https://www.gazzetta.gr/football/ligue-1/2250078/marseig-metagrafes-anakoinose-korea-antikatastatis-toy-stin-inter-o","keywords":["Ποδόσφαιρο","Serie A","Ligue 1","Κωνσταντίνος Κωλαΐτης","Μαρσέιγ","Ίντερ","Αλέξις Σάντσες"],"creator":null,"video_url":null,"description":"Η Μαρσέιγ επισημοποίησε την απόκτηση του Χοακίν Κορέα από την Ίντερ με τη μορφή δανεισμού και οψιόν αγοράς, δίνοντας το ελεύθερο στους Νερατζούρι να ολοκληρώσουν την επιστροφή του Αλέξις Σάντσες που υπέγραψε ως ελεύθερος για έναν χρόνο.","content":"Το «ντόμινο» ενισχύσεων μεταξύ Μαρσέιγ και Ίντερ ολοκληρώθηκε κι επίσημα, με τους Μαρσεγιέζους να ανακοινώνουν τον Χοακίν Κορέα και τους Νερατζούρι να επαναφέρουν μετά από έναν χρόνο τον Αλέξις Σάντσες στο «Μεάτσα». Ο γαλλικός σύλλογος, παρά το οικονομικό «πλήγμα» του αποκλεισμού από το Champions League, συνεχίζει δυναμικά στο θερινό παζάρι και απέκτησε τον 29χρονο Αργεντινό επιθετικό, αρχικά ως δανεικό για έναν χρόνο αντί 2 εκατ. ευρώ και με οψιόν αγοράς στα 10 εκατομμύρια ευρώ που θα ενεργοποιηθεί αυτόματα αν η ομάδα του Μαρθελίνο τερματίσει στις δύο πρώτες θέσεις της Ligue 1 που οδηγούν απευθείας στους ομίλους της κορυφαίας διασυλλογικής διοργάνωσης. Από την άλλη, η Ίντερ περίμενε αυτή την αποχώρηση ώστε να μπορέσει να προχωρήσει την επιστροφή του Χιλιανού εξτρέμ στο Μιλάνο. Έναν χρόνο αφότου μετακόμισε στη Μασσαλία, ο Σάντσες αποτελεί και πάλι παίκτη της Ίντερ υπογράφοντας ως ελεύθερος για έναν χρόνο και θα πλαισιώσει με την εμπειρία του τον βασικό κορμό επιθετικών της ομάδας του Σιμόνε Ιντζάγκι.","pubDate":"2023-08-26 06:32:38","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Παναθηναϊκός μεταγραφές: «Θέλει Γκάνεα στη Φαρούλ ο Χάτζι», γράφουν στη Ρουμανία","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2250092/panathinaikos-metagrafes-thelei-gkanea-sti-faroyl-o-hatzi","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Κωνσταντίνος Κωλαΐτης","Παναθηναϊκός","Κριστιάν Γκάνεα","Φαρούλ Κονστάντσα"],"creator":null,"video_url":null,"description":"Σύμφωνα με ρουμανικό Μέσο η Φαρούλ Κονστάντσα του Γκεόργκε Χάτζι επιθυμεί να επαναπατρίσει τον Κρίστιαν Γκάνεα στο φινάλε της μεταγραφικής περιόδου.","content":"Ζεστό ενδιαφέρον από τη Ρουμανία προκύπτει για τον Κρίστιαν Γκάνεα μέσω των ΜΜΕ της πατρίδας του. Λίγες μέρες πριν το φινάλε της θερινής περιόδου, η ιστοσελίδα «Sport.ro» αναφέρει σε ρεπορτάζ της πως ο 31χρονος μπακ του Παναθηναϊκού βρίσκεται στις άμεσες προτεραιότητες της Φαρούλ Κονστάντσα και του ιδιοκτήτη-προπονητή της, Γκεόργκε Χάτζι , για την ενίσχυση της αμυντικής γραμμής ενόψει ευρωπαϊκής σεζόν, καθώς ο σύλλογος απέχει ένα 90λεπτο από την είσοδο στους ομίλους του Conference League (νίκη 2-1 στο πρώτο ματς κόντρα στην Ελσίνκι). Το δημοσίευμα αναφέρει πως ο πρώην παίκτης του Άρη μπορεί να αποκτηθεί ως ελεύθερος (το συμβόλαιό του στους Πράσινους λήγει στο τέλος της σεζόν) και είναι θετικός στο να μειώσει τις αποδοχές του, βλέποντας με θετικό μάτι τον επαναπατρισμό καθώς έτσι θα βρει το έδαφος για να επιστρέψει και στην εθνική Ρουμανίας μετά τον Ιούνιο του 2021. Ο Γκάνεα στάθηκε άτυχος την περασμένη σεζόν μένοντας εκτός δράσης στα μισά της περιόδου λόγω επιπλοκών που του προκάλεσε η Covid-19 και φέτος βρίσκεται τρίτος στην ιεραρχία των αριστερών μπακ πίσω από Χουάνκαρ και Φιλίπ Μλαντένοβιτς . Με ό,τι αυτό συνεπάγεται για τον προσδοκώμενο χρόνο συμμετοχής που θα λάβει τη φετινή σεζόν στο Τριφύλλι.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Πεντάδα για… εκτόξευση στη 2η αγωνιστική του πρωταθλήματος!","link":"https://www.gazzetta.gr/football/2250081/pentada-gia-ektoxeysi-sti-2i-agonistiki-toy-protathlimatos","keywords":["Ποδόσφαιρο","Newsroom"],"creator":null,"video_url":null,"description":"Στη 2η αγωνιστική της Super League οι θεωρητικά «μεγάλοι» του πρωταθλήματος έχουν πονηρές αποστολές και κουβαλάνε τον τίτλο του φαβορί. Ωστόσο για τον επιβεβαιώσουν θα πρέπει αυτό να το αποτυπώσουν πάνω στο χορτάρι.","content":"Το Σάββατο (20:00) ο Παναθηναϊκός ξεκινάει τις εγχώριες υποχρεώσεις του απέναντι στο Βόλο. Οι «πράσινοι» θα κληθούν να ξεπεράσουν την κούραση από το παιχνίδι με την Μπράγκα και παράλληλα να βγάλουν από το μυαλό τους τη ρεβάνς της Τρίτης με τους Πορτογάλους. Ο Γιοβάνοβιτς διαθέτει λύσεις στο ρόστερ του, αλλά ο Βόλος μέσα στη Λεωφόρο θα στήσει «παγίδες» και με στόχο την έκπληξη. To VAR θα έχει αρκετή δουλειά και τον καταλογισμό πέναλτι τον βρίσκουμε σε απόδοση 2.80 , ενώ η νίκη του Παναθηναϊκού με ένα γκολ διαφορά κοστολογείται στο 3.50. Στις 21.30 τα βλέμματα όλων θα στραφούν στη Νέα Φιλαδέλφεια. Η ΑΕΚ υποδέχεται τον νεοφώτιστο Πανσερραϊκό και φιλοδοξεί να ξεκινήσει με την δεξί την πορεία της προς την υπεράσπιση του τίτλου. Στην «Ένωση» θα έχουν το μυαλό τους και στη ρεβάνς με την Αντβέρπ, ενώ ο Πανσερραϊκός στην πρεμιέρα του με τον Ολυμπιακό – παρά την ήττα με 2-0 - άφησε υποσχέσεις παρότι έπαιξε από το 4ο λεπτό με δέκα παίκτες. Η ΑΕΚ έχει αποδείξει ότι αμυντικά δεν έχει βρει ακόμα ρυθμό και το Goal/Goal το βρίσκουμε στο 2.80. Στο μενού της Κυριακής η εκκίνηση (19:15) θα γίνει με την αναμέτρηση ανάμεσα σε Λαμία και Άρη. Οι Θεσσαλονικείς αναζητούν τον καλό τους εαυτό και η ήττα στην πρεμιέρα (3-2) από τον ΟΦΗ έφερε προβληματισμό σχετικά με την αμυντική λειτουργία. Η Λαμία του Λεωνίδα Βόκολου με τον Βόλο (2-2) έχασε τη νίκη μέσα από τα χέρια της δεχόμενη γκολ στο φινάλε. Ωστόσο, η ομάδα της Φθιώτιδας με Καρλίτος και Σλίβκα στην επίθεση δείχνει ικανή να δημιουργήσει προβλήματα στην άμυνα του Άρη. Το Over 2.5 κοστολογείται σε απόδοση 2.15! Λίγο αργότερα στην Τούμπα (21:00) ο ΠΑΟΚ φιλοξενεί τη νεοφώτιστη Κηφισιά. Ο Δικέφαλος του Βορρά θα έχει πιο βαριά πόδια, αφού την Πέμπτη το βράδυ έπαιξε ευρωπαϊκό ματς με την Χάρτς στην Σκωτία στο Conference League και πανηγύρισε σπουδαία νίκη (2-1). Η Κηφισιά είναι αουτσάιντερ και ο Γιάννης Αναστασίου, μετά την ήττα (0-3) από τον ΠΑΣ θα κάνει διορθωτικές κινήσεις με στόχο να «σφίξει» την άμυνα και να χτυπήσει πιο οργανωμένα στις αντεπιθέσεις. Σκορ οποιαδήποτε στιγμή του αγώνα 1-1 σε απόδοση 4.50. Το πρόγραμμα της αγωνιστικής θα ολοκληρωθεί με το παιχνίδι Ολυμπιακός – Ατρόμητος στο Φάληρο (21:30). Οι «ερυθρόλευκοι» την Πέμπτη είχαν ευρωπαϊκό ματς με την Τσουκαρίτσκι στα play offs του Europa League και εντυπωσίασαν (3-1) με κορυφαίο τον Κώστα Φορτούνη. Η ομάδα από το Περιστέρι δεν έπαιξε στην πρεμιέρα με τον Παναθηναϊκό και πέφτει στα βαθιά σε μια δύσκολη έδρα. Οι φιλοξενούμενοι παραδοσιακά περνάνε δύσκολες στιγμές μέσα στο «Γ. Καραϊσκάκης», όμως είναι ικανοί για ένα ημίχρονο να βάλουν δύσκολα στους Πειραιώτες. Ο Ολυμπιακός θα κάνει μίνι ροτέισον, λόγω κούρασης δεν θα έχει την ίδια ενέργεια όπως με τους Σέρβους, ενώ ο Ατρόμητος θα μπει με φορτισμένες μπαταρίες στο τερέν. Την ισοπαλία στο ημίχρονο την συναντάμε σε απόδοση 2.40! Τέλος, ανάμεσα στις 1000+ προσφερόμενες αγορές σε κάθε αγώνα, μπορεί κάποιος να βρει combo bets, στοιχήματα για τον τρόπο επίτευξης των τερμάτων, super ενισχυμένες αποδόσεις, στατιστικές επιλογές (κάρτες, κόρνερ, πέναλτι κ.ά) και μία πλούσια γκάμα ειδικών στοιχημάτων (ομάδων και παικτών). ΟΙ ΑΠΟΔΟΣΕΙΣ ΕΝΔΕΧΕΤΑΙ ΝΑ ΤΡΟΠΟΠΟΙΗΘΟΥΝ ΑΝΑ ΠΑΣΑ ΣΤΙΓΜΗ 21+| ΑΡΜΟΔΙΟΣ ΡΥΘΜΙΣΤΗΣ:ΕΕΕΠ | ΚΙΝΔΥΝΟΣ ΕΘΙΣΜΟΥ & ΑΠΩΛΕΙΑΣ ΠΕΡΙΟΥΣΙΑΣ | ΓΡΑΜΜΗ ΒΟΗΘΕΙΑΣ ΚΕΘΕΑ: 2109237777 | ΠΑΙΞΕ ΥΠΕΥΘΥΝΑ.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Μπέλινγκχαμ: Σε δύο εβδομάδες σκόραρε στη La Liga όσο ο Αζάρ σε... τέσσερα χρόνια","link":"https://www.gazzetta.gr/football/la-liga/2250086/mpelingkham-se-dyo-ebdomades-skorare-sti-la-liga-oso-o-azar-se-tessera","keywords":["Ποδόσφαιρο","La Liga","Κωνσταντίνος Κωλαΐτης","Ρεάλ Μαδρίτης","Εντέν Αζάρ","Τζουντ Μπέλινγκχαμ"],"creator":null,"video_url":null,"description":"Ο Τζουντ Μπέλινγκχαμ πραγματοποιεί μαγικό ξεκίνημα στη La Liga με τη Ρεάλ Μαδρίτης μετρώντας τέσσερα γκολ στις τρεις πρώτες αγωνιστικές, αριθμός με τον οποίο έκλεισε την καριέρα του στη Βασίλισσα ο Εντέν Αζάρ έπειτα από τέσσερις σεζόν!","content":"Η Ρεάλ Μαδρίτης και το ισπανικό πρωτάθλημα βλέπουν έναν νέο σταρ να λάμπει μπροστά τους και να ηγείται στην εκκίνηση φετινή σεζόν. Ο Τζουντ Μπέλινγκχαμ αποδεικνύει από το πρώτο λεπτό γιατί δαπανήθηκαν 103 εκατομμύρια ευρώ για την απόκτησή του από τη Βασίλισσα και μεταφράζει την τρομερή του προσαρμογή στο σύνολο του Κάρλο Αντσελότι με γκολ σε κάθε παιχνίδι. Ο Βρετανός χαφ έδωσε και πάλι τη λύση στη Ρεάλ για το 3X3 στο ξεκίνημα της φετινής La Liga πετυχαίνοντας με κεφαλιά στο 81' το γκολ που χάρισε το διπλό κόντρα στη Θέλτα (0-1), φτάνοντας ήδη τα τέσσερα γκολ στο ισπανικό πρωτάθλημα. Με άλλα λόγια, η δεύτερη ακριβότερη μεταγραφή της Ρεάλ ισοφάρισε τον απολογισμό της ακριβότερης, του Εντέν Αζάρ που έμεινε στο κλαμπ για τέσσερις σεζόν, μέσα σε δύο εβδομάδες! Ο Βέλγος εξτρέμ που μετατράπηκε σε σκιά του καλού του εαυτού από την ημέρα που πάτησε στο «Σαντιάγο Μπερναμπέου», αποχαιρέτησε τους Μερένγκες φέτος το καλοκαίρι μετά από σύνολο 54 εμφανίσεων στο πρωτάθλημα (σχεδόν το 1/3 των διαθέσιμων αγώνων), με το κοντέρ να σταματά στα τέσσερα γκολ και τις εννέα ασίστ. Ήδη, λοιπόν, ο Μπέλινγκχαμ έχει πιάσει τον πήχη που έθεσε το πιο δαπανηρό απόκτημα στην ιστορία των Μαδριλένων και δείχνει με το... καλησπέρα πως αυτή τη φορά το εννιαψήφιο ποσό θα μπει σε διαδικασία απόσβεσης.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Ολυμπιακός: Ομάρ Ρίτσαρντς ή αλλιώς «Απλά δεν τα παράτησα» (vids)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2249648/omar-ritsarnts-ena-paidi-poy-den-toy-haristike-tipota-vids","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ολυμπιακός","Γιώργος Ντυμένος","Ομάρ Ρίτσαρντς"],"creator":null,"video_url":null,"description":"Ο Ομάρ Ρίτσαρντς που ανακοινώθηκε ήδη από τον Ολυμπιακό μεγάλωσε με τη μητέρα του και τα δύο του αδέρφια, πριν γίνει μπακ έπαιζε μεσοεπιθετικός, είχε ίνδαλμα τον Μπερνάντο Σίλβα και του αρέσουν το μπόουλινγκ, το play station και η ιστορία.","content":"Αν ανατρέξουμε στα παιδικά μας χρόνια τότε όλοι μας, κακά τα ψέμματα, σε κάθε απόπειρα να παίξουμε ποδόσφαιρο, στα «τσικό» όπως λέγονταν ή έστω στη γειτονιά, είχαμε, ως επί το πλείστον για «σύμμαχο», τον πατέρα μας. Εκεί στρεφόμασταν με σκοπό να πάρουμε τη σχετική άδεια, όμως για τον Ομάρ Ρίτσαρντς που ανακοινώθηκε ήδη από την ομάδα του Ολυμπιακού εκείνα τα ανέμελα έτη κύλησαν διαφορετικά. Ο νέος αριστερός μπακ των «ερυθρολεύκων» δεν τα βρήκε «έτοιμα» στη ζωή του και όπως είπε ο ίδιος σε ανύποπτη στιγμή και λίγο μετά την μετακίνησή του στην Μπάγερν Μονάχου «τίποτα δεν μου δόθηκε στο πιάτο, Πάλεψα και δούλεψα σκληρά για όλα. Στο γήπεδο όταν ήμουν μικρός αισθανόμουν ντροπή όταν έχανα την μπάλα και προσπαθούσα να την πάρω αμέσως πίσω. Πάντα θέλω να κερδίζω και θα κάνω τα πάντα για αυτό». Γεννήθηκε λοιπόν τον Φεβρουάριο του 1998 στο Λέβινσαμ - ένα προάστιο του Λονδίνου - και μεγάλωσε μαζί με τη μητέρα του και τους δύο αδερφούς του (σ.σ. εκείνος είναι ο μεσαίος). «Τον πατέρα μου δεν τον έβλεπα συχνά. Είμαι τυχερός που είχα τη μητέρα μου, έκανε τόσα πολλά για εμένα», σχολίασε χαρακτηριστικά μεταγενέστερα. Παρά τις δυσκολίες που υπήρχαν έλαβε από εκείνη όλα τα απαραίτητα «εφόδια» και το ποδόσφαιρο αποτέλεσε το μεγάλο του «πάθος». Ή τουλάχιστον έτσι εξελίχθηκε χάρις στην προτροπή της, αφού η υπομονή και επιμονή της ήταν που τον οδήγησαν σε top επίπεδο. «Της οφείλω πάρα πολλά. Αν δεν με πήγαινε προπόνηση από τόσο μικρή ηλικία, δεν ξέρω τι θα μου είχε συμβεί», λέει με έμφαση και κάπως έτσι άρχισε να ξετυλίγεται το κουβάρι της ιστορίας μας. Πρώτος του σταθμός ήταν μία τοπική ομάδα, ύστερα κάποια άλλη και στο νησί σε κάθε αγώνα των πιτσιρικάδων, όπου και αν διεξάγονται, στοιβάζονται στις εξέδρες σκάουτερ όλων των επαγγελματικών συλλόγων της Αγγλίας , με σκοπό φυσικά να εντοπίσουν «λαβράκια». «Επαιζα για πλάκα. Ειλικρινά δεν ήξερα αν ήμουν καλός», λέει για τα νηπιακά του βήματα στον χώρο, ωστόσο το έμπειρο μάτι ανθρώπων που δραστηριοποιούνται επαγγελματικά στην μπάλα αντιλήφθηκαν το ταλέντο του. Για την ιστορία Τσέλσι , Τσάρλτον και Φούλαμ ενδιαφέρθηκαν περισσότερο, η τελευταία πιο ουσιαστικά και ύστερα από ολιγοήμερη δοκιμή εντάχθηκε, σε ηλικία 10 ετών, στα τμήματα υποδομής της. Λίγο αργότερα μαζί στους «μικρούς» του club βρέθηκε και ο νεαρότερος αδερφός του και αυτόματα άρχισε μεταξύ τους να αναπτύσσεται ένας υγιής ανταγωνισμός, ως είθισται να συμβαίνει σε αυτή την ηλικία. Το έπαθλο; Ποιος θα γίνονταν καλύτερος. Επαιζαν στο γήπεδο, στη γειτονιά, παντού και το «μικρόβιο» της μπάλας... φώλιασε μέσα του για τα καλά. Στα 16 του όμως ήρθε το πρώτο «σοκ», αφού δεν συνέχισε στους «Κότατζερς» και προς στιγμήν το όνειρο της επαγγελματικής ενασχόλησης με το ποδόσφαιρο άρχισε να «σβήνει». Στην εφηβεία πια βρέθηκε κοντά ώστε να τα παρατήσει, αλλά κανείς καλός δεν χάνεται. Νόμος της ζωής. Ο Εϊμόν Ντόλαν που το 2016 έφυγε από τη ζωή αν και μόλις 48 ετών, ήταν το 2013 υπεύθυνος ακαδημιών της Ρέντινγκ και τον είχε τσεκάρει εν δράση. Αμέσως μόλις έφυγε από το «Craven Cottage» ήρθε σε επικοινωνία με την πλευρά του και ο έφηβος Ρίτσαρντς μετακόμισε στη γειτονική πόλη. Το Ρέντινγκ όμως απέχει περίπου 70 χιλιόμετρα από την αγγλική πρωτεύουσα και ήταν αδύνατον να μην εγκατασταθεί μόνιμα εκεί. Ετσι έμεινε σε οικογένεια που συνεργάζονταν με τον σύλλογο η οποία τον φιλοξενούσε, ως συμβαίνει συνήθως σε ανάλογες περιπτώσεις εφήβων σε όλα τα ομαδικά αθλήματα. Με τη μητέρα του και τα αδέρφια του διατηρούσε συχνότατη επικοινωνία, πήγαιναν και τον έβλεπαν σε κάθε αγώνα, ωστόσο η καθημερινότητά του διαφοροποιήθηκε και εύλογα εντελώς. Από τη βουή της μεγαλούπολης βρέθηκε στην κωμόπολη Γούντλεϊ των 35.000 κατοίκων που βρίσκεται δίπλα στο τότε ποδοσφαιρικό του «σπίτι» και είναι χαρακτηριστική η πρώτη του επαφή με τα καινούργια δεδομένα που προέκυψαν. «Φτάσαμε με τον μάνατζέρ μου και είχαν (σ.σ. στη νέα του οικεία) ένα σκυλί που άρχισε να κατευθύνεται κατά πάνω μου. Πέταξα τα πράγματά μου και άρχισα να τρέχω προς το αμάξι. Δεν είχα συνηθίσει τα σκυλιά. Ηταν όλα νέα για μένα. Διαφορετική κουλτούρα, φαγητό, ενδιαφέροντα. Ολα. Αλλαξα πέντε σπίτια, έμαθα νέους ανθρώπους, έζησα διαφορετικά πράγματα και ήταν μία ωραία εμπειρία», ανέφερε πολύ μετά για εκείνα τα χρόνια της παρουσίας του στο club. Εν μέσω όλων αυτών «μεγάλωνε» ποδοσφαιρικά και σταδιακά αναγορεύτηκε σε ηγέτη των U21 και U23 της Ρέντινγκ . Ξεχώριζε στα αντίστοιχα πρωταθλήματα και αν δικαίως ο Εϊμον Ντόλαν θεωρείται ως ο άνθρωπος που διέκρινε πρώτος το ταλέντο του, εξίσου σημαντικό μερίδιο στην εξέλιξή του πιστώνεται και ο Ντέιβιντ Ντοντ . Βλέπετε ο Ρίτσαρντς πήγε στον σύλλογο με την... ιδιότητα του αριστερού μεσοεπιθετικού, αφού εκεί έπαιζε μέχρι και πριν την ενηλικίωσή του και δεν είναι τυχαίο πως ο Νταβίντ Σίλβα αποτελούσε το ποδοσφαιρικό του ίνδαλμα, ενώ πολλάκις φορούσε τη φανέλα με το νούμερο «10». Ο τελευταίος όμως, ο Ντοντ , που ήταν προπονητής στα τμήματα υποδομής του σωματείου αποφάσισε να τον γυρίσει ακραίο οπισθοφύλακα, ο πιτσιρικάς προσαρμόστηκε άμεσα και αυτόματα περίπου 17 ετών ήταν που μετατράπηκε σε έναν full-back ολκής! Υπό αυτές τις συνθήκες φτάσαμε στο καλοκαίρι του 2017, οπότε και συμπεριλήφθηκε στην αποστολή της ομάδας των ανδρών για την καλοκαιρινή της προετοιμασία που έγινε στην Ολλανδία . Στα 19 του λογίζονταν πια ως μέλος των «μεγάλων» και στις 5 Αυγούστου εκείνου του έτους ντεμπουτάρισε σε επαγγελματικό επίπεδο, ως αλλαγή σε ένα ματς κόντρα στην ΚΠΡ . «Η μητέρα μου και τα αδέρφια μου βρίσκονταν στις εξέδρες. Δεν νομίζω πως θα κοιμήθηκε εκείνο το βράδυ. Μικρός ονειρευόμουν να παίζω σε μία ομάδα και σε γεμάτο γήπεδο και κάθε φορά που το κάνω υπάρχουν φορές που δεν πιστεύω πως τα έχω καταφέρει. Ευχαριστώ τον Θεό για κάθε στιγμή και που Εκείνος μου έδωσε τη σχετική δυνατότητα και την ευκαιρία», τόνισε μερικούς μήνες μετά την αναμέτρηση του «Loftus Road» , οπότε και... συστήθηκε στο βρετανικό φίλαθλο κοινό. Η ιστορία λοιπόν άρχισε να «γράφει», εκείνη και την επόμενη σεζόν μέτρησε αθροιστικά 32 εμφανίσεις σε Championship , FA Cup , Λιγκ Καπ και παράλληλα τον Οκτώβριο του 2019 έπαιξε για πρώτη φορά με την U21 της χώρας του. Μέχρι που φτάσαμε στο 2019/20 που ήταν η χρονιά της καθιέρωσης καθώς αναγορεύτηκε σε «κολόνα» της αριστερής πτέρυγας του συλλόγου, όπου αρκετές φορές... θυμόταν τα νιάτα του και από αμυντικός αγωνίζονταν εξτρέμ. Το 2020/21 όμως και λόγω της αποχώρησης του Τάιλερ Μπλάκετ έβγαλε όλη τη χρονιά ως μπακ (42 παιχνίδια σε όλες τις διοργανώσεις), ήταν εκ των κορυφαίων της Ρέντινγκ και ένας από τους λόγους που στο «Madejski» φλέρταραν με την είσοδό τους στα play-offs της ανόδου στην Premier League (στη regular season τερμάτισαν 7οι), Πια είχε «χτίσει» το όνομά του και δεν είναι τυχαίο πως υπέγραψε ως ελεύθερος στην Μπάγερν Μονάχου , που του έδωσε τη φανέλα με το «3». Ο Χασάν Σαλιχάμιτζιτς μάλιστα... έσταξε μέλι για εκείνον. «Είμαστε χαρούμενοι που ο Ομάρ ήρθε σε εμάς. Είναι ένας προικισμένος παίκτης και τον εμπιστευόμαστε», σχολίασε σχετικά, ενώ το συμβόλαιό του με τους Βαυαρούς είχε ισχύ ως το καλοκαίρι του 2025. Ετσι λοιπόν από την Championship βρέθηκε εν μία νυκτί στη Μπουντεσλίγκα και το Champions League , το 2021/22 έπαιξε σε 17 αγώνες εντός και εκτός συνόρων, κατέκτησε τον τίτλο του πρωταθλητή (όπως και το Super Cup ) και παράλληλα η ομοσπονδία της Τζαμάικα από όπου κατάγεται άρχισε να τον «ψήνει» με σκοπό να συμπεριληφθεί στην Εθνική της. Με γνώμονα τα παραπάνω φτάσαμε στον Ιούλιο του 2022, οπότε και έφτασε η στιγμή του επαναπατρισμού. Η Νότιγχαμ έκανε κίνηση για την απόκτησή του και έναντι ενός ποσού που τα δημοσιεύματα της εποχής υπολογίζουν στα 8,5 εκατομμύρια ευρώ τον πήρε από το «Allianz Arena» και τον έφερε στο «City Ground» . Ωστόσο στάθηκε σούπερ άτυχος, καθώς ορισμένα προβλήματα τραυματισμών τον άφησαν για μεγάλο χρονικό διάστημα εκτός δράσης και ναι μεν στο φινάλε της περασμένης περιόδου συμπεριλήφθηκε κάποιες φορές στην αποστολή της Φόρεστ , δεν ντεμπουτάρισε με τη φανέλα της. Πάντως στην αρχή της φετινής της προετοιμασίας έδειξε καλά, συμμετείχε κανονικά στην αποστολή των «Reds» που πήγαν στην Ισπανία , μπήκε σε φουλ ρυθμούς και πλέον έπιασε λιμάνι με σκοπό να κάνει το δυναμικό come-back. Ξέχωρα από το ποδόσφαιρο ο Ρίτσαρντς έχει ακόμη μία «τρέλα», με την καλή βέβαια έννοια, το μπόουλινγκ. Στο Μόναχο ήταν... ιστορικές οι σχετικές του «κόντρες» με τους Τζόσουα Κίμιχ και Αλφόνσο Ντέιβις , με τον... θρύλο να λέει πως συνήθως κέρδιζε εκείνος. O πρώτος μάλιστα ήταν το alter ego του στην Μπάγερν και ο άνθρωπος που πάντα βρίσκονταν στο πλευρό του, καθώς τον βοήθησε τα μέγιστα ώστε να εγκλιματιστεί. Στον ελεύθερο χρόνο του παίζει συχνά παιχνίδια στο play station και ευρύτερα προτιμά να χαλαρώνει με φίλους και την οικογένειά του. Ακόμη ένα χαρακτηριστικό του είναι πως του αρέσει πολύ η ιστορία και θέλει να μαθαίνει τα πάντα για τον τόπο που διαμένει. Στη Γερμανία για παράδειγμα επισκέφθηκε το στρατόπεδο συγκέντρωσης Νταχάου που βρίσκεται κοντά στο Μόναχο και οι Ναζί δολοφόνησαν εκεί εκατοντάδες χιλιάδες ανθρώπους, ως μέρος του φρικτού σχεδίου τους να κατακτήσουν τον κόσμο. «Θέλω να ξέρω που βρίσκομαι», σχολίασε σχετικά και ευρύτερα παρουσιάζεται ένας ιδιαίτερα ευαισθητοποιημένος άνθρωπος, που «διψά» ώστε να εμπλουτίζει τις γνώσεις του. Προβληματίζεται για τα πάντα και πλέον ως κάτοικος Ελλάδας θα έχει την ευκαιρία να επισκεφθεί πολλά μέρη και να μάθει και για τη δική μας ιστορία. Την ίδια στιγμή θα προσέξει κάποιος τα δεκάδες τατουάζ που κοσμούν το σώμα του. Μεταξύ άλλων υπάρχει η λέξη «ευλογημένος», κάποιες ημερομηνίες, το σύμβολο του «Γιν Γιανγκ» και αρκετά άλλα. Αυτά που ίσως να τον χαρακτηρίζουν περισσότερο είναι εκείνα που κοσμούν το στήθος του αλλά και τον αριστερό του δικέφαλο, στο καλό του πόδι δηλαδή. Στην πρώτη περίπτωση βλέπουμε έναν αετό και στην πλευρά της καρδιάς το σήμα της ειρήνης, ενώ στην άλλη τη φράση «Απλά δεν τα παράτησα»!","pubDate":"2023-08-26 07:10:10","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Σωτήρη Γκορίτσα, τι σκεφτόσουν όταν έγραφες το Μπραζιλέρο;","link":"https://www.gazzetta.gr/football/2248582/sotiri-gkoritsa-ti-skeftosoyn-otan-egrafes-mprazilero","keywords":["Ποδόσφαιρο","Άκης Κατσούδας"],"creator":null,"video_url":null,"description":"Συναντήσαμε έναν από τους σημαντικότερους Έλληνες σκηνοθέτες της γενιάς του και μιλήσαμε για την ποδοσφαιρική ταινία που δημιούργησε πριν από 22 χρόνια και παραμένει επίκαιρη μέχρι σήμερα.","content":"Η Ελλάδα δεν είναι μία χώρα που φημίζεται για τις ποδοσφαιρικές της ταινίες. Γνωρίζουμε τη Φανέλα με το Νούμερο 9 , του Παντελή Βούλγαρη, που παρουσιάζει την ιστορία ενός ταλαντούχου παίκτη ο οποίος δεν κατάφερε ποτέ να γίνει αυτό που ονειρευόταν, τους Άσσους του Γηπέδου , μια ταινία του μακρινού 1956 που αφηγείται διάφορες ιστορίες Ελλήνων ποδοσφαιριστών της εποχής, την Κληρονόμο . Μέσα σε αυτή την πολύ περιορισμένη λίστα, λοιπόν, υπάρχει μια ακόμη ταινία. Πρόκειται για το Μπραζιλέρο , του Σωτήρη Γκορίτσα . Το φιλμ κυκλοφόρησε το 2001, τέσσερα χρόνια μετά την μεγάλη επιτυχία του Βαλκανιζάτερ , και, σύμφωνα, με τα δημοσιεύματα της εποχής, πήγε εξαιρετικά καλά, κόβοντας κάτι περισσότερα από 50 χιλιάδες εισιτήρια. Η πλοκή του είναι η εξής: ο ευκατάστατος παράγοντας μιας ελληνικής επαρχιακής πόλης δέχεται ξαφνικά την αιφνιδιαστική επίσκεψη δυο Ευρωπαίων οικονομικών ελεγκτών, μιας τρόικας της εποχής, που έρχονται κατεπειγόντως να ελέγξουν την κατάληξη των ευρωπαϊκών δανείων σε Έλληνες επιχειρηματίες. Μόνο που διαπιστώνουν γρήγορα πως τα χρήματα δεν τα έκανε επενδύσεις αλλά τα έριξε όλα για την απόκτηση ενός βραζιλιάνου ποδοσφαιριστή που τελικά αποδείχτηκε παλτό. Όλη η ταινία, λοιπόν, περιστρέφεται γύρω από τη σύγκρουση της ελληνικής με την ευρωπαϊκή πραγματικότητα. Καυτηριάζοντας, παράλληλα, τα κακώς κείμενα του ποδοσφαίρου της χώρας μας: την οπαδική βία , τα καραβάνια ξένων ποδοσφαιριστών αμφιβόλου αξίας που έφταναν στην Ελλάδα, τα στημένα παιχνίδια. Την ίδια ώρα, όμως, αποτελεί μια από τις ελάχιστες αποτυπώσεις του ελληνικού ποδοσφαίρου στη μεγάλη οθόνη. 22 χρόνια, λοιπόν, ύστερα από την πρώτη προβολή του φιλμ, απευθυνθήκαμε στον σκηνοθέτη - σεναριογράφο - παραγωγό - μεγάλο ποδοσφαιρόφιλο, Σωτήρη Γκορίτσα, για να μας λύσει όλες τις απορίες. Και πρώτη απ’ όλες: Πώς προέκυψε η ιδέα για το Μπραζιλέρο; Έγραψα το σενάριο στα τέλη της 10ετίας του ’90 τότε που «σοσιαλισμός, μετοχές, ποδόσφαιρο, αστακοί, μακαρόνια και μεζονέτες» είχαν γίνει «μαλλιά κουβάρια». Ενθουσιασμένοι με το χρηματιστήριο, νομίζαμε– ο περιούσιος λαός της γης – ότι βρήκαμε τον τρόπο να βγάζουμε πέντε έξι μισθούς κάθε μέρα αγοράζοντας χαρτιά και πουλώντας τα, λίγη ώρα αργότερα. Όπως πάντα τα έξυπνα πουλιά από την μύτη πιάνονται και με δεκαετία αργότερα χρεοκοπήσαμε. Αυτός ο τύπος του νέο-Έλληνα είναι που με απασχολεί σε όλες μου τις ταινίες. Άλλοτε τον αγαπώ και άλλοτε μου ‘ρχεται να τον σακατέψω. Προσπαθώ να τον καταλάβω. Αλλά εκεί που νομίζω ότι τον «τσάκωσα» μου ξεγλιστράει. Και πρέπει να κάνω κι άλλη ταινία μήπως και τον στριμώξω. Παρακολουθείτε από μικρός ποδόσφαιρο; Ποιες είναι οι πρώτες εικόνες και αναμνήσεις που έχετε από αυτό; 1970, Τετάρτη μεσημέρι μετά το σχολείο πίσω από τα κάγκελα της θύρας 10 στη Λεωφόρο Αλεξάνδρας παρακολουθώ στο τέλος της προπόνησης τον Φέρεντς Πούσκας να λέει στον τερματοφύλακα Βασίλη Κωνσταντίνου «Που το θες, Βασιλάκη;». Εκείνος να απαντάει, «Ρίξε, ρε χοντρέ, όπου θες», τον Πούσκας έξω από την μεγάλη περιοχή χωρίς φόρα να σουτάρει το φάουλ, τον Κωνσταντίνου να παρακολουθεί άνετος την μπάλα που κατευθύνεται άουτ και τελευταία στιγμή να στρίβει απότομα και να καρφώνεται στο γάμα της εστίας του. Η κοιλιά του Πούσκας να ανεβοκατεβαίνει από τα γέλια, ο τσαντίλας Κωνσταντίνου να ζητάει επανάληψη και να τρώει και το επόμενο γκολ. Προσπάθησα την άλλη ημέρα να κάνω το ίδιο στο σχολείο, η μπάλα δεν έστριβε με τίποτα και την κυνηγάγαμε στα πευκάκια. Παραιτήθηκα μουρμουρίζοντας «άμα δεν σε θέλει η μπάλα, δεν μπαίνει με τίποτα». Πείτε δύο λόγια για τα γυρίσματα της ταινίας. Σε ποια περιοχή έγιναν και πόσο εύκολες ήταν οι γηπεδικές - ποδοσφαιρικές σκηνές; Είχε προηγηθεί πριν λίγα χρόνια η εμπορική επιτυχία του «Βαλκανιζατέρ» και είχα αυτή την φορά άνεση στον προϋπολογισμό της ταινίας οπότε τα γυρίσματα έγιναν σε όλη την Ελλάδα, από την Ραφήνα έως τα Χανιά, κι από το Πόρτο Ράφτη έως τον ποταμό Νέστο. Τα ποδοσφαιρικά γυρίσματα έγιναν στον Ταύρο στο γήπεδο του Φωστήρα. Είχατε ασχοληθεί ποτέ ξανά στο παρελθόν με κάτι παρόμοιο; Όχι, αλλά δεν μου ήταν δύσκολο καθώς από μικρός έπαιζα μπάλα, ήμουν μάλιστα το αριστερό εξτρέμ «αστέρι» του σχολείου. Ώσπου στο πρωτάθλημα στο ξερό του Αγίου Κοσμά με ένα σχολείο κάπου από το Κερατσίνι, έφαγα τις κλωτσιές και τα μπινελίκια της ζωής μου και το γύρισα στο μπάσκετ. Όπου λόγω ύψους έπαιξα play maker χωρίς τεράστια επιτυχία. Θα ήθελα να κάνουμε μια αναφορά στο ματς της ταινίας, το τοπικό ντέρμπι. Υπήρξαν κανονικοί ποδοσφαιριστές που αγωνίστηκαν; Οι οπαδοί ήταν κομπάρσοι ή τραβήχτηκαν και πλάνα από κανονικό παιχνίδι; Υπήρξαν κανονικοί ποδοσφαιριστές– από τα εφηβικά του Φωστήρα - που κινούνταν στο φόντο ενώ σε πρώτο πλάνο κοντά στην κάμερα βρίσκονταν οι ηθοποιοί μας. Τραβήχτηκαν επίσης μερικά μακρινά πλάνα του αγώνα από την οπτική γωνία που παρακολουθούσε τον αγώνα ο πρωταγωνιστής Μάινας με τους δυο Ευρωπαίους ελεγκτές. Τα γυρίσματα κράτησαν μια μέρα. Άλλη ημέρα, σε κανονικό ματς του Φωστήρα, τραβήχτηκαν τα πλάνα των φιλάθλων. Στο μοντάζ τα δυο γυρίσματα ενοποιήθηκαν σε ενιαία σκηνή. Το ενδιαφέρον ήταν ότι στην πραγματικότητα συνέβη αυτό που ήταν κοντά στο θέμα που διαπραγματευόταν η ίδια η ταινία: Είχαμε δηλαδή συμφωνήσει μια αμοιβή με τον Φωστήρα για το γύρισμα αλλά μόλις ο υπεύθυνος του γηπέδου είδε κάμερες, φώτα, ηθοποιούς, συνεργείο, βανάκια κλπ. για να μας αφήσει να γυρίσουμε μας ζήτησε τα διπλάσια αλλιώς δεν μπαίναμε στο γήπεδο. Φυσικά τα δώσαμε. Το ίδιο επαναλήφθηκε πέρυσι – δηλαδή τριάντα χρόνια αργότερα από το Μπραζιλέρο - στην τελευταία μου ταινία το Εκεί Που Ζούμε . Είναι αυτό που σας έλεγα πριν για το νέο-Έλληνα που μάταια προσπαθώ να καταλάβω. Είχατε δώσει συγκεκριμένες οδηγίες στον Φώτη Σπύρο (Κυριάκο) και στον Θανάση Βισκαδουράκη (Οδυσσέα) για το πώς θα χειρίζονται τη μπάλα και τι πρέπει να κάνουν κατά τη διάρκεια των ποδοσφαιρικών γυρισμάτων; Αν και καλλιτέχνες κάτι σκάμπαζαν από ποδόσφαιρο και δεν χρειάστηκε πολύ δουλειά για να μπουν στο νόημα. Μπορούσα επίσης στην πρόβα να δείξω εγώ ο ίδιος τι έπρεπε να κάνουν. Παρ’ όλα αυτά νομίζω ότι οι κομπάρσοι κανονικοί ποδοσφαιριστές του Φωστήρα ψιλοχαμογελούσαν βλέποντάς μας. Σε κάθε σας ταινία δίνετε πολύ μεγάλη έμφαση στο μουσική. Πώς νιώθετε που το «Θάλασσά μου Σκοτεινή» του Νίκου Πορτοκάλογλου αλλά και το «Τι Λείπει;» που ερμήνευσε η Ελευθερία Αρβανιτάκη έχουν γίνει δύο από τις μεγαλύτερες επιτυχίες της σύγχρονης ελληνικής μουσικής; Ξεκινάω πάντα με το ότι «ο καλός κινηματογράφος δεν χρειάζεται μουσική». Και καταλήγω να μην μου χωράνε στο μοντάζ όλες οι μουσικές που θέλω να βάλω. Υποψιάζομαι ότι αυτό οφείλεται στο φίλο μου Νίκο Πορτοκάλογλου ο οποίος από εκεί που του ζητάω ένα μικρό θεματάκι δέκα δευτερολέπτων για τους τίτλους, μου έρχεται με καμιά δεκαριά κομμάτια που δεν ξέρω ποιο να αφήσω απ’ έξω. Μόνο στη τελευταία ταινία μου συνεργαστήκαμε όπως κάνουν σε όλο τον κόσμο, δηλαδή μόνταρα την ταινία και έγραψε μετά την μουσική βλέποντας την εικόνα. Στο θέμα των ερμηνευτών των λίγων τραγουδιών που χρησιμοποιώ στο soundtrack το συζητάμε και καταλήγουμε μαζί. Είναι, πιστεύετε, το ελληνικό ποδόσφαιρο και οι στρεβλώσεις του, ένα καλό δείγμα για το πώς λειτουργούσε και λειτουργεί γενικότερα η ελληνική κοινωνία; Είναι ο κατ' εξοχήν χώρος όπου διαγράφονται ανάγλυφα όλες οι παθογένειες της κοινωνίας μας. Χωρίς μάλιστα να κάνουν καν προσπάθεια να κρυφτούν πίσω από «ιδέες, πολιτικές, οράματα» και τα λοιπά. Ενώπιον σαράντα χιλιάδων θεατών μπουκάρει ο πρόεδρος με το πιστόλι στη ζώνη ή κάνει ο άλλος μια βουτιά δυο μέτρα έξω από την περιοχή, ο διαιτητής δείχνει απτόητος τη βούλα του πέναλτι και οι χιλιάδες «φίλαθλοι» στην κερκίδα πανηγυρίζουν. Τι να λέμε λοιπόν. Όταν μάλιστα κάποτε ανέφερα το περιστατικό με το περιβόητο πέναλτι σε φίλο Πειραιώτη μου απάντησε ότι «Ακριβώς αυτό είναι η ηδονή (είπε μια άλλη λέξη), να σας γαμ… με πέτσινο πέναλτι στο 90!». Τα τελευταία χρόνια παρακολουθώ ξένα πρωταθλήματα, ειδικά το Αγγλικό, όπου ανακαλύπτω ξανά τον λόγο που αγάπησα το ποδόσφαιρο. Θεωρείτε πως το Μπραζιλέρο είναι, κατά κάποιο τρόπο, το σίκουελ του Βαλκανιζατέρ; Και τα δυο έχουν να κάνουν με την προσπάθεια να καταλάβω τα ωραία και τα στραβά που ταλαιπωρούν την ζωή μας. Από την πρώτη ως την τελευταία ταινία μου νομίζω ότι στην πραγματικότητα κάνω ένα σπονδυλωτό ντοκιμαντέρ για τον νεοέλληνα. Έχει αλλάξει καθόλου, πιστεύετε, το ελληνικό ποδόσφαιρο από τη χρονιά που προβλήθηκε για πρώτη φορά η ταινία; Θεωρείτε πως παραμένει επίκαιρη μέχρι σήμερα; Βεβαίως. Έχει χειροτερέψει. Δείτε την εθνική μας ομάδα. Αντί το πυροτέχνημα του Ευρωπαϊκού πρωταθλήματος στη Πορτογαλία να είναι η αρχή της εξυγίανσης εκφυλίστηκε στην, με κάθε μέσο, κατάκτηση του πρωταθλήματος ώστε η ομάδα να εισπράξει τα λεφτά των ομίλων του Champions League . Το ίδιο δηλαδή που έκανε πριν τριάντα χρόνια ο ήρωας του Μπραζιλέρο. Με την Ευρωπαϊκή επιδότηση αντί για «Πολιτιστικό Κέντρο» έχτισε βίλλα και αγόρασε ένα Βραζιλιάνο επιθετικό για την τοπική ομάδα. Και όταν ήλθαν από την Ευρώπη οι ελεγκτές να τσεκάρουν τι έγιναν τα χρήματα των Ευρωπαίων φορολογουμένων με τα οποία τον είχαν επιδοτήσει ο Στέλιος Μάινας τους είπε «Go back!» και τα υπόλοιπα γραφικά που πριν λίγα χρόνια ακούσαμε από πρωθυπουργό. Να όμως που άγιο είχαμε πάλι και γλιτώσαμε στο τσακ τον υποβιβασμό. Θα σκεφτόσασταν ποτέ να κάνετε το Μπραζιλέρο 2 ή μια άλλη ποδοσφαιρική ταινία; Υπάρχει χώρος για ποδοσφαιρικό σινεμά στην Ελλάδα; Τα νούμερο 2 συνήθως είναι χειρότερα του 1 και δεν θα το σκεφτόμουν. Επίσης δεν είναι καν Έλληνες πια οι παίκτες των ομάδων μας. Εδώ ακόμα δεν κατάφερα να περιγράψω στο βάθος που θα ήθελα τον Έλληνα, θα ασχοληθώ με τον κάθε Περουβιανό που βγάζει εδώ το ψωμάκι του; Και μια τελευταία. Μιας και ο τίτλος είναι Μπραζιλέρο, ποιος είναι ο αγαπημένος σας Βραζιλιάνος ποδοσφαιριστής; Ο Ζαϊρζίνιο της εθνικής Βραζιλίας του ’70. Αν και έπαιζε δεξί εξτρέμ ενώ εγώ αριστερό, τα δικά του κόλπα ξεσήκωνα, βάζοντας κι ολίγη από τον Αργεντινό Χουάν Ραμόν Βερόν - που ήταν ως γνωστόν «πράγμα φοβερόν» - και για κερασάκι τις ντρίμπλες του Χάρη του Γραμμού «από την Μυτιλήνη». Σημείωση: Η χρήση των παραπάνω εικόνων έγιναν ύστερα από άδεια του Σωτήρη Γκορίτσα.","pubDate":"2023-08-26 07:00:00","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Kudus Mohammed (Ajax Amsterdam) vers West Ham","link":"https://www.lequipe.fr/Football/Actualites/Kudus-mohammed-ajax-amsterdam-vers-west-ham/1415796#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"L'Ajax et West Ham ont trouvé un accord de principe pour le transfert de Kudus Mohammed. Le milieu ghanéen devrait signer cinq ans (plus une année en option) et le club d'Amsterdam toucher 42 M€ et 3 M€ de bonus.","content":"Kudus Mohammed n'a pas manqué ses adieux pour son dernier match avec l'Ajax. Déjà auteur d'un but et d'une passe décisive en deux matches d'Eredivisie cette saison, le milieu offensif ghanéen s'est offert un triplé retentissant, jeudi, sur la pelouse de Ludogorets . Le point final d'une aventure de trois ans avec le club néerlandais qu'il s'apprête à quitter pour la Premier League. West Ham et l'Ajax ont en effet trouvé un accord de principe pour un transfert à hauteur de 42 millions d'euros (plus 3 M€ de bonus). Il pourrait être entériné ce samedi. Kudus Mohammed, 23 ans, passera ensuite sa visite médicale avant de s'engager sur un contrat de cinq ans, plus une année en option avec les Hammers. 11 buts en 30 matches d'Eredivisie la saison dernière Ce transfert s'inscrit dans la continuité d'une saison où le polyvalent international ghanéen (24 sélections, 7 buts), parfois aligné au poste d'avant-centre, a marqué 11 buts en 30 matches de Championnat néerlandais (19 titularisations) et 4 en 6 rencontres de Ligue des champions. Ses performances à la Coupe du monde avaient aussi été très appréciées par les scouts européens. West Ham est donc en passe de devancer la concurrence.","pubDate":"2023-08-26 06:53:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/kudus-mohammed-au-premier-plan-avec-l-ajax-amsterdam-lors-d-un-match-amical-face-au-borussia-dortmund-le-6-aout-g-van-keulen-anp-presse-sports/1500000001825258/0:0,1998:999-665-335-70/9af10.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Georges Mikautadze, un dernier match contre Clermont avant le départ ?","link":"https://www.lequipe.fr/Football/Actualites/Georges-mikautadze-un-dernier-match-avant-le-depart/1415729#xtor=RSS-1","keywords":["Foot, L1, Metz"],"creator":["Cyril Olives-Berthet"],"video_url":null,"description":"Courtisé par de nombreux clubs, Georges Mikautadze est sur le départ mais, faute d'offre satisfaisant le FC Metz, il sera aligné face à Clermont dimanche.","content":"Laszlo Bölöni est malicieux. Le 10 juillet dernier, lors de la reprise de l'entraînement à Metz, l'entraîneur des Grenats avait blagué sur la situation de Georges Mikautadze. « » Presque : un mois plus tard, en Bretagne (1-5, le 13 août), le Géorgien était titulaire et adressait une passe décisive à Youssef Maziz. « », expliquait aussi l'entraîneur roumain de 70 ans. Une forte cote en Italie Il a bien fait. À une semaine de la clôture du marché des transferts, celui qui vient d'être élu meilleur joueur de L2 est encore là. Buteur contre l'OM (2-2, le 18 août), il a encore été le plus en vue de son équipe. « , a expliqué Bölöni, vendredi. » Sous contrat jusqu'en 2026, le joueur de 22 ans a vu ses dirigeants fixer son prix de départ à 20 M€, bonus inclus. Quelques offres ont été refusées dont une à 15 M€ fixes dès la mi-juillet. Cela devrait bouger dans les prochains jours. L'Eintracht Francfort a coché son nom en cas de départ de Randal Kolo Muani. Orphelin de Marko Arnautovic (34 ans), vendu à l'Inter Milan, Bologne est également intéressé. La cote de « Mikau » est d'ailleurs forte en Italie, où la Lazio l'apprécie. Les Grenats, eux, ont budgété sa vente auprès de la DNCG mais Pierre Dréossi, leur directeur sportif, « », comme il l'a dit jeudi après un entraînement à huis clos auquel le joueur a normalement participé. Tout le monde au club attend fébrilement la conclusion de ce dossier au long cours. « », prévenait pourtant le capitaine Matthieu Udol il y a quelques semaines. La vidéo d'adieux est prête depuis longtemps dans les ordinateurs du service communication. Pourrait-elle devenir carrément inutile ? Ce serait une immense surprise.","pubDate":"2023-08-26 06:45:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/georges-mikautadze-est-toujours-a-metz-s-mantey-l-equipe/1500000001825137/0:0,917:611-665-335-70/987dd.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"De La Salle fades in second half, loses its season opener to Orange Lutheran","link":"https://www.eastbaytimes.com/2023/08/25/de-la-salle-fades-in-second-half-loses-its-season-opener-to-orange-lutheran/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","Inside Sports"],"creator":["Darren Sabedra"],"video_url":null,"description":"Southern California heavyweight Orange Lutheran scores three second-half touchdowns, including Steve Chavez's version of Beast Mode, to beat De La Salle.","content":"CONCORD — De La Salle was going to have to play a clean game to win its season opener on Friday night against Southern California heavyweight Orange Lutheran. The Spartans did not play a clean game. Tied at halftime, De La Salle gave up three unanswered second-half touchdowns and lost at home 35-14 against an opponent that won impressively a week earlier and comes from the same league that features Mater Dei and St. John Bosco. Steve Chavez was the star of stars for Orange Lutheran, rushing for three touchdowns, including one the junior running back justifiably called “Beast Mode 3.0.” The 58-yard run late in the third quarter included multiple stiff arms in an electrifying sequence that made it 28-14. For De La Salle, it was one of several plays it would like to have back. “With a good team like Orange Lutheran, the mistakes you can make are very little, virtually none,” quarterback Toa Faavae said. “Too many mistakes. Too many mental mistakes.” De La Salle made a defensive stop in the end zone on the final play of the first half to keep the score 14-14 and got the ball to start the second half. But the Spartans went three-and-out and a short punt gave the visitors possession at the De La Salle 46. Orange Lutheran cashed in with a drive that Chavez finished with a 2-yard run for a 21-14 lead. Later in the quarter, De La Salle got what looked like a big pass play over the middle that would have moved the Spartans inside Orange Lutheran’s 30. But the ball was stripped and Orange Lutheran recovered. “Against a really good team like this, you have to make big plays,” De La Salle coach Justin Alumbaugh said. “They made more than us. We didn’t give up. We were fighting and scrapping. We had opportunities and they capitalized on more opportunities than we did.” After the turnover, De La Salle held Orange Lutheran to nine yards in three plays. But on fourth-and-1 from its own 36, Orange Lutheran handed the ball to Chavez for a 6-yard gain. On the next snap, he made the play that will go directly to the top of his recruiting highlights. “I had some great blocks up front, bounced out and from there, God paved the way,” Chavez said, adding that he made at least four stiff arms on defenders and broke about six tackles. Given how the game started, it looked as if the last one to score would win. The teams combined for 28 points in the first four possessions. Orange Lutheran, coming off a 49-17 rout of Serra-Gardena last week, needed 10 plays to cover 66 yards for a touchdown on the game’s opening possession. TJ Lateef connected with Tyler Hennessy for 14 yards on third-and-11 from Orange Lutheran’s 33 to keep the series alive. Chavez’s slashing 16-yard run, followed by Lateef’s 14-yard scramble moved the visitors inside the 10. Two plays later, Joseph De La Torre caught a 5-yard pass from Lateef to for a 7-0 lead. De La Salle immediately responded. Jaden Jefferson’s 39-yard kickoff return put the Spartans at their own 41. It took De La Salle eight plays to cross the goal line. Faavae’s 16-yard quarterback keeper accounted for the touchdown that evened the score 7-7 with 4:04 left in the opening quarter. Orange Lutheran went in front 14-7 when AJ La caught a 3-yard pass from Lateef in the back of the end zone on third-and-goal to end the opening quarter. Related Articles De La Salle responded again, driving 62 yards to pull even. Dominic Kelley’s 3-yard run made it 21-21 with 7:37 left in the half. The Spartans didn’t score another point the rest of the game. “We get the ball at half, tied 14-14, I liked our chances, to be honest,” Alumbaugh said. “We just couldn’t put it together. Every time we needed a stop, it seemed like they made a big play. Every time we needed a big play, we just couldn’t quite get it done.” The schedule doesn’t soften for De La Salle. Up next: A visit to Serra next Saturday.","pubDate":"2023-08-26 06:35:49","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-DLSFB-0825-03_133237168-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"El Cerrito uses proven formula in season-opening win over Division I school","link":"https://www.eastbaytimes.com/2023/08/25/el-cerrito-uses-proven-formula-in-season-opening-win-over-division-i-school/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","High School Soccer","Inside Sports","PM report","Preps Alert"],"creator":["Curtis Pashelka"],"video_url":null,"description":"El Cerrito's defense held Amador Valley to less than 150 yards of offense on Friday.","content":"PLEASANTON – A hard-fought nonleague win over Division I Amador Valley last year helped propel the El Cerrito High School football team to an undefeated regular season. Gauchos coach Jacob Rincon would gladly take the same end result in 2023, and he might have the defense to do it. El Cerrito’s defense made a two-touchdown lead in the first-half stand as the Gauchos held on to a 14-7 win over Amador Valley on Friday in the season-opening game for both teams. Running back Micah Avery, a transfer from Clayton Valley Charter, scored on a 69-yard touchdown run with 3:46 left in the first quarter and fellow senior Michael Vanhook scored on a quarterback keeper just before halftime, providing just enough offense to help No. 14 El Cerrito extend its regular season win streak to 16 games. Avery had 95 yards on 13 carries and Vanhook completed 8 of 15 passes for 72 yards. El Cerrito’s second touchdown drive was aided by an 85-yard run from another newcomer in Zaire Eastman, who attended De Anza last year. El Cerrito went 12-1 last year, beginning the season with a 7-3 home victory over the Dons. That win proved to be the Gauchos’ closest game of 2022, as they went 10-0 in the regular season and earned blowout playoff wins over Montgomery-Santa Rosa and Northgate to capture the North Coast Section Division III championship. “Coming in, we already knew Amador was going to be a physical, aggressive team,” Rincon said. “We love the brand and style of football they play. It prepares us for the rest of the season. So we expected this to be a dogfight. “Shout out to (Dons coach) Dan (Jones). He does a great job. But overall. I think we got a few good big plays and the touchdown obviously at the half was huge for us.” In the second half, the Gauchos relied on their defense to hold off the resilient Dons. Amador Valley senior Nate Jetter caught a 6-yard touchdown pass from quarterback Aiden Foley with 5:10 left in the fourth quarter to cut El Cerrito’s lead to 14-7. The Dons were then able to get the ball back with just over two minutes to play, but El Cerrito’s defense halted the drive as Amador’s 41. El Cerrito’s defense held opponents to nine points or less nine times last season, and that doesn’t include a 2-0 forfeit win over Hercules last October. “I put it to them in practice: defense wins games, and we saw that here,” Vanhook said. “Defense won this game today. I love them. That’s the key to this team. I’m really proud of them.” El Cerrito’s defense held Amador Valley to less than 150 yards of offense on Friday. “Defensively, we did a great job,” Rincon said. “Defensive coordinator Tim Johnson does a great job preparing those guys, and then for us to come out here and execute the way we did was just a beautiful thing to see.” Amador Valley’s options on offense were limited after senior running back Jake Goldsworthy suffered what Jones said were ankle and toe injuries midway through the first half. At that point, Goldsworthy, a two-way starter, had 36 yards on 12 carries, although he also had a pair of long rushes called back because of penalties. Anthony Harrington and Sean Cervantes took over the bulk of the running game, rushing for a combined 63 yards. Foley completed 4 of 8 passes for 35 yards and is holding things down while junior QB Tristan Tia sits out the first five games as a transfer from Granada. Jones said he thought Goldsworthy would be OK and that he hoped the 6-foot-1, 210-pounder would be available to play next week when Amador Valley travels to play No. 16 Campolindo, last year’s NCS Division II runner-up. “He’s our guy, right? Especially with how we are on offense right now, with no Tristan, we’re running the rock,” Jones said. “And Goldie’s kind of the heart and soul of our team, so when he goes down, it takes the wind out of us a little bit. “We knew (El Cerrito) was a really good team, and I’m really proud for our backs being against the wall, 14-0, and we continued to fight. We didn’t care about what the score was. We were just worried about the next play, and I think that’s the right formula.” Related Articles El Cerrito, which had its season ended with a 36-7 loss to Grant-Sacramento in the CIF NorCal Division 3-AA regional title game, is now a Division II team thanks to the section’s competitive realignment regulations. The Gauchos play Freedom, another Division I team, next week, with their nonleague schedule continuing with games against Fremont-Oakland, Foothill-Pleasanton, and Vacaville. “A win like this could do (a lot for us), but we’ve got to get back to work,” Rincon said. “We had a lot of penalties and we want to clean things up and play a little bit more of a disciplined brand of football.”","pubDate":"2023-08-26 06:33:17","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-ELCERRITO-1202-9-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Μαρσέιγ μεταγραφές: Ανακοίνωσε Κορέα, αντικαταστάτης του στην Ίντερ ο Σάντσες","link":"https://www.gazzetta.gr/football/ligue-1/2250078/marseig-metagrafes-anakoinose-korea-antikatastatis-toy-stin-inter-o","keywords":["Ποδόσφαιρο","Serie A","Ligue 1","Κωνσταντίνος Κωλαΐτης","Μαρσέιγ","Ίντερ","Αλέξις Σάντσες"],"creator":null,"video_url":null,"description":"Η Μαρσέιγ επισημοποίησε την απόκτηση του Χοακίν Κορέα από την Ίντερ με τη μορφή δανεισμού και οψιόν αγοράς, δίνοντας το ελεύθερο στους Νερατζούρι να ολοκληρώσουν την επιστροφή του Αλέξις Σάντσες που υπέγραψε ως ελεύθερος για έναν χρόνο.","content":"Το «ντόμινο» ενισχύσεων μεταξύ Μαρσέιγ και Ίντερ ολοκληρώθηκε κι επίσημα, με τους Μαρσεγιέζους να ανακοινώνουν τον Χοακίν Κορέα και τους Νερατζούρι να επαναφέρουν μετά από έναν χρόνο τον Αλέξις Σάντσες στο «Μεάτσα». Ο γαλλικός σύλλογος, παρά το οικονομικό «πλήγμα» του αποκλεισμού από το Champions League, συνεχίζει δυναμικά στο θερινό παζάρι και απέκτησε τον 29χρονο Αργεντινό επιθετικό, αρχικά ως δανεικό για έναν χρόνο αντί 2 εκατ. ευρώ και με οψιόν αγοράς στα 10 εκατομμύρια ευρώ που θα ενεργοποιηθεί αυτόματα αν η ομάδα του Μαρθελίνο τερματίσει στις δύο πρώτες θέσεις της Ligue 1 που οδηγούν απευθείας στους ομίλους της κορυφαίας διασυλλογικής διοργάνωσης. Από την άλλη, η Ίντερ περίμενε αυτή την αποχώρηση ώστε να μπορέσει να προχωρήσει την επιστροφή του Χιλιανού εξτρέμ στο Μιλάνο. Έναν χρόνο αφότου μετακόμισε στη Μασσαλία, ο Σάντσες αποτελεί και πάλι παίκτη της Ίντερ υπογράφοντας ως ελεύθερος για έναν χρόνο και θα πλαισιώσει με την εμπειρία του τον βασικό κορμό επιθετικών της ομάδας του Σιμόνε Ιντζάγκι.","pubDate":"2023-08-26 06:32:38","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Παναθηναϊκός μεταγραφές: «Θέλει Γκάνεα στη Φαρούλ ο Χάτζι», γράφουν στη Ρουμανία","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2250092/panathinaikos-metagrafes-thelei-gkanea-sti-faroyl-o-hatzi","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Κωνσταντίνος Κωλαΐτης","Παναθηναϊκός","Κριστιάν Γκάνεα","Φαρούλ Κονστάντσα"],"creator":null,"video_url":null,"description":"Σύμφωνα με ρουμανικό Μέσο η Φαρούλ Κονστάντσα του Γκεόργκε Χάτζι επιθυμεί να επαναπατρίσει τον Κρίστιαν Γκάνεα στο φινάλε της μεταγραφικής περιόδου.","content":"Ζεστό ενδιαφέρον από τη Ρουμανία προκύπτει για τον Κρίστιαν Γκάνεα μέσω των ΜΜΕ της πατρίδας του. Λίγες μέρες πριν το φινάλε της θερινής περιόδου, η ιστοσελίδα «Sport.ro» αναφέρει σε ρεπορτάζ της πως ο 31χρονος μπακ του Παναθηναϊκού βρίσκεται στις άμεσες προτεραιότητες της Φαρούλ Κονστάντσα και του ιδιοκτήτη-προπονητή της, Γκεόργκε Χάτζι , για την ενίσχυση της αμυντικής γραμμής ενόψει ευρωπαϊκής σεζόν, καθώς ο σύλλογος απέχει ένα 90λεπτο από την είσοδο στους ομίλους του Conference League (νίκη 2-1 στο πρώτο ματς κόντρα στην Ελσίνκι). Το δημοσίευμα αναφέρει πως ο πρώην παίκτης του Άρη μπορεί να αποκτηθεί ως ελεύθερος (το συμβόλαιό του στους Πράσινους λήγει στο τέλος της σεζόν) και είναι θετικός στο να μειώσει τις αποδοχές του, βλέποντας με θετικό μάτι τον επαναπατρισμό καθώς έτσι θα βρει το έδαφος για να επιστρέψει και στην εθνική Ρουμανίας μετά τον Ιούνιο του 2021. Ο Γκάνεα στάθηκε άτυχος την περασμένη σεζόν μένοντας εκτός δράσης στα μισά της περιόδου λόγω επιπλοκών που του προκάλεσε η Covid-19 και φέτος βρίσκεται τρίτος στην ιεραρχία των αριστερών μπακ πίσω από Χουάνκαρ και Φιλίπ Μλαντένοβιτς . Με ό,τι αυτό συνεπάγεται για τον προσδοκώμενο χρόνο συμμετοχής που θα λάβει τη φετινή σεζόν στο Τριφύλλι.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Πεντάδα για… εκτόξευση στη 2η αγωνιστική του πρωταθλήματος!","link":"https://www.gazzetta.gr/football/2250081/pentada-gia-ektoxeysi-sti-2i-agonistiki-toy-protathlimatos","keywords":["Ποδόσφαιρο","Newsroom"],"creator":null,"video_url":null,"description":"Στη 2η αγωνιστική της Super League οι θεωρητικά «μεγάλοι» του πρωταθλήματος έχουν πονηρές αποστολές και κουβαλάνε τον τίτλο του φαβορί. Ωστόσο για τον επιβεβαιώσουν θα πρέπει αυτό να το αποτυπώσουν πάνω στο χορτάρι.","content":"Το Σάββατο (20:00) ο Παναθηναϊκός ξεκινάει τις εγχώριες υποχρεώσεις του απέναντι στο Βόλο. Οι «πράσινοι» θα κληθούν να ξεπεράσουν την κούραση από το παιχνίδι με την Μπράγκα και παράλληλα να βγάλουν από το μυαλό τους τη ρεβάνς της Τρίτης με τους Πορτογάλους. Ο Γιοβάνοβιτς διαθέτει λύσεις στο ρόστερ του, αλλά ο Βόλος μέσα στη Λεωφόρο θα στήσει «παγίδες» και με στόχο την έκπληξη. To VAR θα έχει αρκετή δουλειά και τον καταλογισμό πέναλτι τον βρίσκουμε σε απόδοση 2.80 , ενώ η νίκη του Παναθηναϊκού με ένα γκολ διαφορά κοστολογείται στο 3.50. Στις 21.30 τα βλέμματα όλων θα στραφούν στη Νέα Φιλαδέλφεια. Η ΑΕΚ υποδέχεται τον νεοφώτιστο Πανσερραϊκό και φιλοδοξεί να ξεκινήσει με την δεξί την πορεία της προς την υπεράσπιση του τίτλου. Στην «Ένωση» θα έχουν το μυαλό τους και στη ρεβάνς με την Αντβέρπ, ενώ ο Πανσερραϊκός στην πρεμιέρα του με τον Ολυμπιακό – παρά την ήττα με 2-0 - άφησε υποσχέσεις παρότι έπαιξε από το 4ο λεπτό με δέκα παίκτες. Η ΑΕΚ έχει αποδείξει ότι αμυντικά δεν έχει βρει ακόμα ρυθμό και το Goal/Goal το βρίσκουμε στο 2.80. Στο μενού της Κυριακής η εκκίνηση (19:15) θα γίνει με την αναμέτρηση ανάμεσα σε Λαμία και Άρη. Οι Θεσσαλονικείς αναζητούν τον καλό τους εαυτό και η ήττα στην πρεμιέρα (3-2) από τον ΟΦΗ έφερε προβληματισμό σχετικά με την αμυντική λειτουργία. Η Λαμία του Λεωνίδα Βόκολου με τον Βόλο (2-2) έχασε τη νίκη μέσα από τα χέρια της δεχόμενη γκολ στο φινάλε. Ωστόσο, η ομάδα της Φθιώτιδας με Καρλίτος και Σλίβκα στην επίθεση δείχνει ικανή να δημιουργήσει προβλήματα στην άμυνα του Άρη. Το Over 2.5 κοστολογείται σε απόδοση 2.15! Λίγο αργότερα στην Τούμπα (21:00) ο ΠΑΟΚ φιλοξενεί τη νεοφώτιστη Κηφισιά. Ο Δικέφαλος του Βορρά θα έχει πιο βαριά πόδια, αφού την Πέμπτη το βράδυ έπαιξε ευρωπαϊκό ματς με την Χάρτς στην Σκωτία στο Conference League και πανηγύρισε σπουδαία νίκη (2-1). Η Κηφισιά είναι αουτσάιντερ και ο Γιάννης Αναστασίου, μετά την ήττα (0-3) από τον ΠΑΣ θα κάνει διορθωτικές κινήσεις με στόχο να «σφίξει» την άμυνα και να χτυπήσει πιο οργανωμένα στις αντεπιθέσεις. Σκορ οποιαδήποτε στιγμή του αγώνα 1-1 σε απόδοση 4.50. Το πρόγραμμα της αγωνιστικής θα ολοκληρωθεί με το παιχνίδι Ολυμπιακός – Ατρόμητος στο Φάληρο (21:30). Οι «ερυθρόλευκοι» την Πέμπτη είχαν ευρωπαϊκό ματς με την Τσουκαρίτσκι στα play offs του Europa League και εντυπωσίασαν (3-1) με κορυφαίο τον Κώστα Φορτούνη. Η ομάδα από το Περιστέρι δεν έπαιξε στην πρεμιέρα με τον Παναθηναϊκό και πέφτει στα βαθιά σε μια δύσκολη έδρα. Οι φιλοξενούμενοι παραδοσιακά περνάνε δύσκολες στιγμές μέσα στο «Γ. Καραϊσκάκης», όμως είναι ικανοί για ένα ημίχρονο να βάλουν δύσκολα στους Πειραιώτες. Ο Ολυμπιακός θα κάνει μίνι ροτέισον, λόγω κούρασης δεν θα έχει την ίδια ενέργεια όπως με τους Σέρβους, ενώ ο Ατρόμητος θα μπει με φορτισμένες μπαταρίες στο τερέν. Την ισοπαλία στο ημίχρονο την συναντάμε σε απόδοση 2.40! Τέλος, ανάμεσα στις 1000+ προσφερόμενες αγορές σε κάθε αγώνα, μπορεί κάποιος να βρει combo bets, στοιχήματα για τον τρόπο επίτευξης των τερμάτων, super ενισχυμένες αποδόσεις, στατιστικές επιλογές (κάρτες, κόρνερ, πέναλτι κ.ά) και μία πλούσια γκάμα ειδικών στοιχημάτων (ομάδων και παικτών). ΟΙ ΑΠΟΔΟΣΕΙΣ ΕΝΔΕΧΕΤΑΙ ΝΑ ΤΡΟΠΟΠΟΙΗΘΟΥΝ ΑΝΑ ΠΑΣΑ ΣΤΙΓΜΗ 21+| ΑΡΜΟΔΙΟΣ ΡΥΘΜΙΣΤΗΣ:ΕΕΕΠ | ΚΙΝΔΥΝΟΣ ΕΘΙΣΜΟΥ & ΑΠΩΛΕΙΑΣ ΠΕΡΙΟΥΣΙΑΣ | ΓΡΑΜΜΗ ΒΟΗΘΕΙΑΣ ΚΕΘΕΑ: 2109237777 | ΠΑΙΞΕ ΥΠΕΥΘΥΝΑ.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Μπέλινγκχαμ: Σε δύο εβδομάδες σκόραρε στη La Liga όσο ο Αζάρ σε... τέσσερα χρόνια","link":"https://www.gazzetta.gr/football/la-liga/2250086/mpelingkham-se-dyo-ebdomades-skorare-sti-la-liga-oso-o-azar-se-tessera","keywords":["Ποδόσφαιρο","La Liga","Κωνσταντίνος Κωλαΐτης","Ρεάλ Μαδρίτης","Εντέν Αζάρ","Τζουντ Μπέλινγκχαμ"],"creator":null,"video_url":null,"description":"Ο Τζουντ Μπέλινγκχαμ πραγματοποιεί μαγικό ξεκίνημα στη La Liga με τη Ρεάλ Μαδρίτης μετρώντας τέσσερα γκολ στις τρεις πρώτες αγωνιστικές, αριθμός με τον οποίο έκλεισε την καριέρα του στη Βασίλισσα ο Εντέν Αζάρ έπειτα από τέσσερις σεζόν!","content":"Η Ρεάλ Μαδρίτης και το ισπανικό πρωτάθλημα βλέπουν έναν νέο σταρ να λάμπει μπροστά τους και να ηγείται στην εκκίνηση φετινή σεζόν. Ο Τζουντ Μπέλινγκχαμ αποδεικνύει από το πρώτο λεπτό γιατί δαπανήθηκαν 103 εκατομμύρια ευρώ για την απόκτησή του από τη Βασίλισσα και μεταφράζει την τρομερή του προσαρμογή στο σύνολο του Κάρλο Αντσελότι με γκολ σε κάθε παιχνίδι. Ο Βρετανός χαφ έδωσε και πάλι τη λύση στη Ρεάλ για το 3X3 στο ξεκίνημα της φετινής La Liga πετυχαίνοντας με κεφαλιά στο 81' το γκολ που χάρισε το διπλό κόντρα στη Θέλτα (0-1), φτάνοντας ήδη τα τέσσερα γκολ στο ισπανικό πρωτάθλημα. Με άλλα λόγια, η δεύτερη ακριβότερη μεταγραφή της Ρεάλ ισοφάρισε τον απολογισμό της ακριβότερης, του Εντέν Αζάρ που έμεινε στο κλαμπ για τέσσερις σεζόν, μέσα σε δύο εβδομάδες! Ο Βέλγος εξτρέμ που μετατράπηκε σε σκιά του καλού του εαυτού από την ημέρα που πάτησε στο «Σαντιάγο Μπερναμπέου», αποχαιρέτησε τους Μερένγκες φέτος το καλοκαίρι μετά από σύνολο 54 εμφανίσεων στο πρωτάθλημα (σχεδόν το 1/3 των διαθέσιμων αγώνων), με το κοντέρ να σταματά στα τέσσερα γκολ και τις εννέα ασίστ. Ήδη, λοιπόν, ο Μπέλινγκχαμ έχει πιάσει τον πήχη που έθεσε το πιο δαπανηρό απόκτημα στην ιστορία των Μαδριλένων και δείχνει με το... καλησπέρα πως αυτή τη φορά το εννιαψήφιο ποσό θα μπει σε διαδικασία απόσβεσης.","pubDate":"2023-08-26 07:12:41","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Ολυμπιακός: Ομάρ Ρίτσαρντς ή αλλιώς «Απλά δεν τα παράτησα» (vids)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2249648/omar-ritsarnts-ena-paidi-poy-den-toy-haristike-tipota-vids","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ολυμπιακός","Γιώργος Ντυμένος","Ομάρ Ρίτσαρντς"],"creator":null,"video_url":null,"description":"Ο Ομάρ Ρίτσαρντς που ανακοινώθηκε ήδη από τον Ολυμπιακό μεγάλωσε με τη μητέρα του και τα δύο του αδέρφια, πριν γίνει μπακ έπαιζε μεσοεπιθετικός, είχε ίνδαλμα τον Μπερνάντο Σίλβα και του αρέσουν το μπόουλινγκ, το play station και η ιστορία.","content":"Αν ανατρέξουμε στα παιδικά μας χρόνια τότε όλοι μας, κακά τα ψέμματα, σε κάθε απόπειρα να παίξουμε ποδόσφαιρο, στα «τσικό» όπως λέγονταν ή έστω στη γειτονιά, είχαμε, ως επί το πλείστον για «σύμμαχο», τον πατέρα μας. Εκεί στρεφόμασταν με σκοπό να πάρουμε τη σχετική άδεια, όμως για τον Ομάρ Ρίτσαρντς που ανακοινώθηκε ήδη από την ομάδα του Ολυμπιακού εκείνα τα ανέμελα έτη κύλησαν διαφορετικά. Ο νέος αριστερός μπακ των «ερυθρολεύκων» δεν τα βρήκε «έτοιμα» στη ζωή του και όπως είπε ο ίδιος σε ανύποπτη στιγμή και λίγο μετά την μετακίνησή του στην Μπάγερν Μονάχου «τίποτα δεν μου δόθηκε στο πιάτο, Πάλεψα και δούλεψα σκληρά για όλα. Στο γήπεδο όταν ήμουν μικρός αισθανόμουν ντροπή όταν έχανα την μπάλα και προσπαθούσα να την πάρω αμέσως πίσω. Πάντα θέλω να κερδίζω και θα κάνω τα πάντα για αυτό». Γεννήθηκε λοιπόν τον Φεβρουάριο του 1998 στο Λέβινσαμ - ένα προάστιο του Λονδίνου - και μεγάλωσε μαζί με τη μητέρα του και τους δύο αδερφούς του (σ.σ. εκείνος είναι ο μεσαίος). «Τον πατέρα μου δεν τον έβλεπα συχνά. Είμαι τυχερός που είχα τη μητέρα μου, έκανε τόσα πολλά για εμένα», σχολίασε χαρακτηριστικά μεταγενέστερα. Παρά τις δυσκολίες που υπήρχαν έλαβε από εκείνη όλα τα απαραίτητα «εφόδια» και το ποδόσφαιρο αποτέλεσε το μεγάλο του «πάθος». Ή τουλάχιστον έτσι εξελίχθηκε χάρις στην προτροπή της, αφού η υπομονή και επιμονή της ήταν που τον οδήγησαν σε top επίπεδο. «Της οφείλω πάρα πολλά. Αν δεν με πήγαινε προπόνηση από τόσο μικρή ηλικία, δεν ξέρω τι θα μου είχε συμβεί», λέει με έμφαση και κάπως έτσι άρχισε να ξετυλίγεται το κουβάρι της ιστορίας μας. Πρώτος του σταθμός ήταν μία τοπική ομάδα, ύστερα κάποια άλλη και στο νησί σε κάθε αγώνα των πιτσιρικάδων, όπου και αν διεξάγονται, στοιβάζονται στις εξέδρες σκάουτερ όλων των επαγγελματικών συλλόγων της Αγγλίας , με σκοπό φυσικά να εντοπίσουν «λαβράκια». «Επαιζα για πλάκα. Ειλικρινά δεν ήξερα αν ήμουν καλός», λέει για τα νηπιακά του βήματα στον χώρο, ωστόσο το έμπειρο μάτι ανθρώπων που δραστηριοποιούνται επαγγελματικά στην μπάλα αντιλήφθηκαν το ταλέντο του. Για την ιστορία Τσέλσι , Τσάρλτον και Φούλαμ ενδιαφέρθηκαν περισσότερο, η τελευταία πιο ουσιαστικά και ύστερα από ολιγοήμερη δοκιμή εντάχθηκε, σε ηλικία 10 ετών, στα τμήματα υποδομής της. Λίγο αργότερα μαζί στους «μικρούς» του club βρέθηκε και ο νεαρότερος αδερφός του και αυτόματα άρχισε μεταξύ τους να αναπτύσσεται ένας υγιής ανταγωνισμός, ως είθισται να συμβαίνει σε αυτή την ηλικία. Το έπαθλο; Ποιος θα γίνονταν καλύτερος. Επαιζαν στο γήπεδο, στη γειτονιά, παντού και το «μικρόβιο» της μπάλας... φώλιασε μέσα του για τα καλά. Στα 16 του όμως ήρθε το πρώτο «σοκ», αφού δεν συνέχισε στους «Κότατζερς» και προς στιγμήν το όνειρο της επαγγελματικής ενασχόλησης με το ποδόσφαιρο άρχισε να «σβήνει». Στην εφηβεία πια βρέθηκε κοντά ώστε να τα παρατήσει, αλλά κανείς καλός δεν χάνεται. Νόμος της ζωής. Ο Εϊμόν Ντόλαν που το 2016 έφυγε από τη ζωή αν και μόλις 48 ετών, ήταν το 2013 υπεύθυνος ακαδημιών της Ρέντινγκ και τον είχε τσεκάρει εν δράση. Αμέσως μόλις έφυγε από το «Craven Cottage» ήρθε σε επικοινωνία με την πλευρά του και ο έφηβος Ρίτσαρντς μετακόμισε στη γειτονική πόλη. Το Ρέντινγκ όμως απέχει περίπου 70 χιλιόμετρα από την αγγλική πρωτεύουσα και ήταν αδύνατον να μην εγκατασταθεί μόνιμα εκεί. Ετσι έμεινε σε οικογένεια που συνεργάζονταν με τον σύλλογο η οποία τον φιλοξενούσε, ως συμβαίνει συνήθως σε ανάλογες περιπτώσεις εφήβων σε όλα τα ομαδικά αθλήματα. Με τη μητέρα του και τα αδέρφια του διατηρούσε συχνότατη επικοινωνία, πήγαιναν και τον έβλεπαν σε κάθε αγώνα, ωστόσο η καθημερινότητά του διαφοροποιήθηκε και εύλογα εντελώς. Από τη βουή της μεγαλούπολης βρέθηκε στην κωμόπολη Γούντλεϊ των 35.000 κατοίκων που βρίσκεται δίπλα στο τότε ποδοσφαιρικό του «σπίτι» και είναι χαρακτηριστική η πρώτη του επαφή με τα καινούργια δεδομένα που προέκυψαν. «Φτάσαμε με τον μάνατζέρ μου και είχαν (σ.σ. στη νέα του οικεία) ένα σκυλί που άρχισε να κατευθύνεται κατά πάνω μου. Πέταξα τα πράγματά μου και άρχισα να τρέχω προς το αμάξι. Δεν είχα συνηθίσει τα σκυλιά. Ηταν όλα νέα για μένα. Διαφορετική κουλτούρα, φαγητό, ενδιαφέροντα. Ολα. Αλλαξα πέντε σπίτια, έμαθα νέους ανθρώπους, έζησα διαφορετικά πράγματα και ήταν μία ωραία εμπειρία», ανέφερε πολύ μετά για εκείνα τα χρόνια της παρουσίας του στο club. Εν μέσω όλων αυτών «μεγάλωνε» ποδοσφαιρικά και σταδιακά αναγορεύτηκε σε ηγέτη των U21 και U23 της Ρέντινγκ . Ξεχώριζε στα αντίστοιχα πρωταθλήματα και αν δικαίως ο Εϊμον Ντόλαν θεωρείται ως ο άνθρωπος που διέκρινε πρώτος το ταλέντο του, εξίσου σημαντικό μερίδιο στην εξέλιξή του πιστώνεται και ο Ντέιβιντ Ντοντ . Βλέπετε ο Ρίτσαρντς πήγε στον σύλλογο με την... ιδιότητα του αριστερού μεσοεπιθετικού, αφού εκεί έπαιζε μέχρι και πριν την ενηλικίωσή του και δεν είναι τυχαίο πως ο Νταβίντ Σίλβα αποτελούσε το ποδοσφαιρικό του ίνδαλμα, ενώ πολλάκις φορούσε τη φανέλα με το νούμερο «10». Ο τελευταίος όμως, ο Ντοντ , που ήταν προπονητής στα τμήματα υποδομής του σωματείου αποφάσισε να τον γυρίσει ακραίο οπισθοφύλακα, ο πιτσιρικάς προσαρμόστηκε άμεσα και αυτόματα περίπου 17 ετών ήταν που μετατράπηκε σε έναν full-back ολκής! Υπό αυτές τις συνθήκες φτάσαμε στο καλοκαίρι του 2017, οπότε και συμπεριλήφθηκε στην αποστολή της ομάδας των ανδρών για την καλοκαιρινή της προετοιμασία που έγινε στην Ολλανδία . Στα 19 του λογίζονταν πια ως μέλος των «μεγάλων» και στις 5 Αυγούστου εκείνου του έτους ντεμπουτάρισε σε επαγγελματικό επίπεδο, ως αλλαγή σε ένα ματς κόντρα στην ΚΠΡ . «Η μητέρα μου και τα αδέρφια μου βρίσκονταν στις εξέδρες. Δεν νομίζω πως θα κοιμήθηκε εκείνο το βράδυ. Μικρός ονειρευόμουν να παίζω σε μία ομάδα και σε γεμάτο γήπεδο και κάθε φορά που το κάνω υπάρχουν φορές που δεν πιστεύω πως τα έχω καταφέρει. Ευχαριστώ τον Θεό για κάθε στιγμή και που Εκείνος μου έδωσε τη σχετική δυνατότητα και την ευκαιρία», τόνισε μερικούς μήνες μετά την αναμέτρηση του «Loftus Road» , οπότε και... συστήθηκε στο βρετανικό φίλαθλο κοινό. Η ιστορία λοιπόν άρχισε να «γράφει», εκείνη και την επόμενη σεζόν μέτρησε αθροιστικά 32 εμφανίσεις σε Championship , FA Cup , Λιγκ Καπ και παράλληλα τον Οκτώβριο του 2019 έπαιξε για πρώτη φορά με την U21 της χώρας του. Μέχρι που φτάσαμε στο 2019/20 που ήταν η χρονιά της καθιέρωσης καθώς αναγορεύτηκε σε «κολόνα» της αριστερής πτέρυγας του συλλόγου, όπου αρκετές φορές... θυμόταν τα νιάτα του και από αμυντικός αγωνίζονταν εξτρέμ. Το 2020/21 όμως και λόγω της αποχώρησης του Τάιλερ Μπλάκετ έβγαλε όλη τη χρονιά ως μπακ (42 παιχνίδια σε όλες τις διοργανώσεις), ήταν εκ των κορυφαίων της Ρέντινγκ και ένας από τους λόγους που στο «Madejski» φλέρταραν με την είσοδό τους στα play-offs της ανόδου στην Premier League (στη regular season τερμάτισαν 7οι), Πια είχε «χτίσει» το όνομά του και δεν είναι τυχαίο πως υπέγραψε ως ελεύθερος στην Μπάγερν Μονάχου , που του έδωσε τη φανέλα με το «3». Ο Χασάν Σαλιχάμιτζιτς μάλιστα... έσταξε μέλι για εκείνον. «Είμαστε χαρούμενοι που ο Ομάρ ήρθε σε εμάς. Είναι ένας προικισμένος παίκτης και τον εμπιστευόμαστε», σχολίασε σχετικά, ενώ το συμβόλαιό του με τους Βαυαρούς είχε ισχύ ως το καλοκαίρι του 2025. Ετσι λοιπόν από την Championship βρέθηκε εν μία νυκτί στη Μπουντεσλίγκα και το Champions League , το 2021/22 έπαιξε σε 17 αγώνες εντός και εκτός συνόρων, κατέκτησε τον τίτλο του πρωταθλητή (όπως και το Super Cup ) και παράλληλα η ομοσπονδία της Τζαμάικα από όπου κατάγεται άρχισε να τον «ψήνει» με σκοπό να συμπεριληφθεί στην Εθνική της. Με γνώμονα τα παραπάνω φτάσαμε στον Ιούλιο του 2022, οπότε και έφτασε η στιγμή του επαναπατρισμού. Η Νότιγχαμ έκανε κίνηση για την απόκτησή του και έναντι ενός ποσού που τα δημοσιεύματα της εποχής υπολογίζουν στα 8,5 εκατομμύρια ευρώ τον πήρε από το «Allianz Arena» και τον έφερε στο «City Ground» . Ωστόσο στάθηκε σούπερ άτυχος, καθώς ορισμένα προβλήματα τραυματισμών τον άφησαν για μεγάλο χρονικό διάστημα εκτός δράσης και ναι μεν στο φινάλε της περασμένης περιόδου συμπεριλήφθηκε κάποιες φορές στην αποστολή της Φόρεστ , δεν ντεμπουτάρισε με τη φανέλα της. Πάντως στην αρχή της φετινής της προετοιμασίας έδειξε καλά, συμμετείχε κανονικά στην αποστολή των «Reds» που πήγαν στην Ισπανία , μπήκε σε φουλ ρυθμούς και πλέον έπιασε λιμάνι με σκοπό να κάνει το δυναμικό come-back. Ξέχωρα από το ποδόσφαιρο ο Ρίτσαρντς έχει ακόμη μία «τρέλα», με την καλή βέβαια έννοια, το μπόουλινγκ. Στο Μόναχο ήταν... ιστορικές οι σχετικές του «κόντρες» με τους Τζόσουα Κίμιχ και Αλφόνσο Ντέιβις , με τον... θρύλο να λέει πως συνήθως κέρδιζε εκείνος. O πρώτος μάλιστα ήταν το alter ego του στην Μπάγερν και ο άνθρωπος που πάντα βρίσκονταν στο πλευρό του, καθώς τον βοήθησε τα μέγιστα ώστε να εγκλιματιστεί. Στον ελεύθερο χρόνο του παίζει συχνά παιχνίδια στο play station και ευρύτερα προτιμά να χαλαρώνει με φίλους και την οικογένειά του. Ακόμη ένα χαρακτηριστικό του είναι πως του αρέσει πολύ η ιστορία και θέλει να μαθαίνει τα πάντα για τον τόπο που διαμένει. Στη Γερμανία για παράδειγμα επισκέφθηκε το στρατόπεδο συγκέντρωσης Νταχάου που βρίσκεται κοντά στο Μόναχο και οι Ναζί δολοφόνησαν εκεί εκατοντάδες χιλιάδες ανθρώπους, ως μέρος του φρικτού σχεδίου τους να κατακτήσουν τον κόσμο. «Θέλω να ξέρω που βρίσκομαι», σχολίασε σχετικά και ευρύτερα παρουσιάζεται ένας ιδιαίτερα ευαισθητοποιημένος άνθρωπος, που «διψά» ώστε να εμπλουτίζει τις γνώσεις του. Προβληματίζεται για τα πάντα και πλέον ως κάτοικος Ελλάδας θα έχει την ευκαιρία να επισκεφθεί πολλά μέρη και να μάθει και για τη δική μας ιστορία. Την ίδια στιγμή θα προσέξει κάποιος τα δεκάδες τατουάζ που κοσμούν το σώμα του. Μεταξύ άλλων υπάρχει η λέξη «ευλογημένος», κάποιες ημερομηνίες, το σύμβολο του «Γιν Γιανγκ» και αρκετά άλλα. Αυτά που ίσως να τον χαρακτηρίζουν περισσότερο είναι εκείνα που κοσμούν το στήθος του αλλά και τον αριστερό του δικέφαλο, στο καλό του πόδι δηλαδή. Στην πρώτη περίπτωση βλέπουμε έναν αετό και στην πλευρά της καρδιάς το σήμα της ειρήνης, ενώ στην άλλη τη φράση «Απλά δεν τα παράτησα»!","pubDate":"2023-08-26 07:10:10","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Σωτήρη Γκορίτσα, τι σκεφτόσουν όταν έγραφες το Μπραζιλέρο;","link":"https://www.gazzetta.gr/football/2248582/sotiri-gkoritsa-ti-skeftosoyn-otan-egrafes-mprazilero","keywords":["Ποδόσφαιρο","Άκης Κατσούδας"],"creator":null,"video_url":null,"description":"Συναντήσαμε έναν από τους σημαντικότερους Έλληνες σκηνοθέτες της γενιάς του και μιλήσαμε για την ποδοσφαιρική ταινία που δημιούργησε πριν από 22 χρόνια και παραμένει επίκαιρη μέχρι σήμερα.","content":"Η Ελλάδα δεν είναι μία χώρα που φημίζεται για τις ποδοσφαιρικές της ταινίες. Γνωρίζουμε τη Φανέλα με το Νούμερο 9 , του Παντελή Βούλγαρη, που παρουσιάζει την ιστορία ενός ταλαντούχου παίκτη ο οποίος δεν κατάφερε ποτέ να γίνει αυτό που ονειρευόταν, τους Άσσους του Γηπέδου , μια ταινία του μακρινού 1956 που αφηγείται διάφορες ιστορίες Ελλήνων ποδοσφαιριστών της εποχής, την Κληρονόμο . Μέσα σε αυτή την πολύ περιορισμένη λίστα, λοιπόν, υπάρχει μια ακόμη ταινία. Πρόκειται για το Μπραζιλέρο , του Σωτήρη Γκορίτσα . Το φιλμ κυκλοφόρησε το 2001, τέσσερα χρόνια μετά την μεγάλη επιτυχία του Βαλκανιζάτερ , και, σύμφωνα, με τα δημοσιεύματα της εποχής, πήγε εξαιρετικά καλά, κόβοντας κάτι περισσότερα από 50 χιλιάδες εισιτήρια. Η πλοκή του είναι η εξής: ο ευκατάστατος παράγοντας μιας ελληνικής επαρχιακής πόλης δέχεται ξαφνικά την αιφνιδιαστική επίσκεψη δυο Ευρωπαίων οικονομικών ελεγκτών, μιας τρόικας της εποχής, που έρχονται κατεπειγόντως να ελέγξουν την κατάληξη των ευρωπαϊκών δανείων σε Έλληνες επιχειρηματίες. Μόνο που διαπιστώνουν γρήγορα πως τα χρήματα δεν τα έκανε επενδύσεις αλλά τα έριξε όλα για την απόκτηση ενός βραζιλιάνου ποδοσφαιριστή που τελικά αποδείχτηκε παλτό. Όλη η ταινία, λοιπόν, περιστρέφεται γύρω από τη σύγκρουση της ελληνικής με την ευρωπαϊκή πραγματικότητα. Καυτηριάζοντας, παράλληλα, τα κακώς κείμενα του ποδοσφαίρου της χώρας μας: την οπαδική βία , τα καραβάνια ξένων ποδοσφαιριστών αμφιβόλου αξίας που έφταναν στην Ελλάδα, τα στημένα παιχνίδια. Την ίδια ώρα, όμως, αποτελεί μια από τις ελάχιστες αποτυπώσεις του ελληνικού ποδοσφαίρου στη μεγάλη οθόνη. 22 χρόνια, λοιπόν, ύστερα από την πρώτη προβολή του φιλμ, απευθυνθήκαμε στον σκηνοθέτη - σεναριογράφο - παραγωγό - μεγάλο ποδοσφαιρόφιλο, Σωτήρη Γκορίτσα, για να μας λύσει όλες τις απορίες. Και πρώτη απ’ όλες: Πώς προέκυψε η ιδέα για το Μπραζιλέρο; Έγραψα το σενάριο στα τέλη της 10ετίας του ’90 τότε που «σοσιαλισμός, μετοχές, ποδόσφαιρο, αστακοί, μακαρόνια και μεζονέτες» είχαν γίνει «μαλλιά κουβάρια». Ενθουσιασμένοι με το χρηματιστήριο, νομίζαμε– ο περιούσιος λαός της γης – ότι βρήκαμε τον τρόπο να βγάζουμε πέντε έξι μισθούς κάθε μέρα αγοράζοντας χαρτιά και πουλώντας τα, λίγη ώρα αργότερα. Όπως πάντα τα έξυπνα πουλιά από την μύτη πιάνονται και με δεκαετία αργότερα χρεοκοπήσαμε. Αυτός ο τύπος του νέο-Έλληνα είναι που με απασχολεί σε όλες μου τις ταινίες. Άλλοτε τον αγαπώ και άλλοτε μου ‘ρχεται να τον σακατέψω. Προσπαθώ να τον καταλάβω. Αλλά εκεί που νομίζω ότι τον «τσάκωσα» μου ξεγλιστράει. Και πρέπει να κάνω κι άλλη ταινία μήπως και τον στριμώξω. Παρακολουθείτε από μικρός ποδόσφαιρο; Ποιες είναι οι πρώτες εικόνες και αναμνήσεις που έχετε από αυτό; 1970, Τετάρτη μεσημέρι μετά το σχολείο πίσω από τα κάγκελα της θύρας 10 στη Λεωφόρο Αλεξάνδρας παρακολουθώ στο τέλος της προπόνησης τον Φέρεντς Πούσκας να λέει στον τερματοφύλακα Βασίλη Κωνσταντίνου «Που το θες, Βασιλάκη;». Εκείνος να απαντάει, «Ρίξε, ρε χοντρέ, όπου θες», τον Πούσκας έξω από την μεγάλη περιοχή χωρίς φόρα να σουτάρει το φάουλ, τον Κωνσταντίνου να παρακολουθεί άνετος την μπάλα που κατευθύνεται άουτ και τελευταία στιγμή να στρίβει απότομα και να καρφώνεται στο γάμα της εστίας του. Η κοιλιά του Πούσκας να ανεβοκατεβαίνει από τα γέλια, ο τσαντίλας Κωνσταντίνου να ζητάει επανάληψη και να τρώει και το επόμενο γκολ. Προσπάθησα την άλλη ημέρα να κάνω το ίδιο στο σχολείο, η μπάλα δεν έστριβε με τίποτα και την κυνηγάγαμε στα πευκάκια. Παραιτήθηκα μουρμουρίζοντας «άμα δεν σε θέλει η μπάλα, δεν μπαίνει με τίποτα». Πείτε δύο λόγια για τα γυρίσματα της ταινίας. Σε ποια περιοχή έγιναν και πόσο εύκολες ήταν οι γηπεδικές - ποδοσφαιρικές σκηνές; Είχε προηγηθεί πριν λίγα χρόνια η εμπορική επιτυχία του «Βαλκανιζατέρ» και είχα αυτή την φορά άνεση στον προϋπολογισμό της ταινίας οπότε τα γυρίσματα έγιναν σε όλη την Ελλάδα, από την Ραφήνα έως τα Χανιά, κι από το Πόρτο Ράφτη έως τον ποταμό Νέστο. Τα ποδοσφαιρικά γυρίσματα έγιναν στον Ταύρο στο γήπεδο του Φωστήρα. Είχατε ασχοληθεί ποτέ ξανά στο παρελθόν με κάτι παρόμοιο; Όχι, αλλά δεν μου ήταν δύσκολο καθώς από μικρός έπαιζα μπάλα, ήμουν μάλιστα το αριστερό εξτρέμ «αστέρι» του σχολείου. Ώσπου στο πρωτάθλημα στο ξερό του Αγίου Κοσμά με ένα σχολείο κάπου από το Κερατσίνι, έφαγα τις κλωτσιές και τα μπινελίκια της ζωής μου και το γύρισα στο μπάσκετ. Όπου λόγω ύψους έπαιξα play maker χωρίς τεράστια επιτυχία. Θα ήθελα να κάνουμε μια αναφορά στο ματς της ταινίας, το τοπικό ντέρμπι. Υπήρξαν κανονικοί ποδοσφαιριστές που αγωνίστηκαν; Οι οπαδοί ήταν κομπάρσοι ή τραβήχτηκαν και πλάνα από κανονικό παιχνίδι; Υπήρξαν κανονικοί ποδοσφαιριστές– από τα εφηβικά του Φωστήρα - που κινούνταν στο φόντο ενώ σε πρώτο πλάνο κοντά στην κάμερα βρίσκονταν οι ηθοποιοί μας. Τραβήχτηκαν επίσης μερικά μακρινά πλάνα του αγώνα από την οπτική γωνία που παρακολουθούσε τον αγώνα ο πρωταγωνιστής Μάινας με τους δυο Ευρωπαίους ελεγκτές. Τα γυρίσματα κράτησαν μια μέρα. Άλλη ημέρα, σε κανονικό ματς του Φωστήρα, τραβήχτηκαν τα πλάνα των φιλάθλων. Στο μοντάζ τα δυο γυρίσματα ενοποιήθηκαν σε ενιαία σκηνή. Το ενδιαφέρον ήταν ότι στην πραγματικότητα συνέβη αυτό που ήταν κοντά στο θέμα που διαπραγματευόταν η ίδια η ταινία: Είχαμε δηλαδή συμφωνήσει μια αμοιβή με τον Φωστήρα για το γύρισμα αλλά μόλις ο υπεύθυνος του γηπέδου είδε κάμερες, φώτα, ηθοποιούς, συνεργείο, βανάκια κλπ. για να μας αφήσει να γυρίσουμε μας ζήτησε τα διπλάσια αλλιώς δεν μπαίναμε στο γήπεδο. Φυσικά τα δώσαμε. Το ίδιο επαναλήφθηκε πέρυσι – δηλαδή τριάντα χρόνια αργότερα από το Μπραζιλέρο - στην τελευταία μου ταινία το Εκεί Που Ζούμε . Είναι αυτό που σας έλεγα πριν για το νέο-Έλληνα που μάταια προσπαθώ να καταλάβω. Είχατε δώσει συγκεκριμένες οδηγίες στον Φώτη Σπύρο (Κυριάκο) και στον Θανάση Βισκαδουράκη (Οδυσσέα) για το πώς θα χειρίζονται τη μπάλα και τι πρέπει να κάνουν κατά τη διάρκεια των ποδοσφαιρικών γυρισμάτων; Αν και καλλιτέχνες κάτι σκάμπαζαν από ποδόσφαιρο και δεν χρειάστηκε πολύ δουλειά για να μπουν στο νόημα. Μπορούσα επίσης στην πρόβα να δείξω εγώ ο ίδιος τι έπρεπε να κάνουν. Παρ’ όλα αυτά νομίζω ότι οι κομπάρσοι κανονικοί ποδοσφαιριστές του Φωστήρα ψιλοχαμογελούσαν βλέποντάς μας. Σε κάθε σας ταινία δίνετε πολύ μεγάλη έμφαση στο μουσική. Πώς νιώθετε που το «Θάλασσά μου Σκοτεινή» του Νίκου Πορτοκάλογλου αλλά και το «Τι Λείπει;» που ερμήνευσε η Ελευθερία Αρβανιτάκη έχουν γίνει δύο από τις μεγαλύτερες επιτυχίες της σύγχρονης ελληνικής μουσικής; Ξεκινάω πάντα με το ότι «ο καλός κινηματογράφος δεν χρειάζεται μουσική». Και καταλήγω να μην μου χωράνε στο μοντάζ όλες οι μουσικές που θέλω να βάλω. Υποψιάζομαι ότι αυτό οφείλεται στο φίλο μου Νίκο Πορτοκάλογλου ο οποίος από εκεί που του ζητάω ένα μικρό θεματάκι δέκα δευτερολέπτων για τους τίτλους, μου έρχεται με καμιά δεκαριά κομμάτια που δεν ξέρω ποιο να αφήσω απ’ έξω. Μόνο στη τελευταία ταινία μου συνεργαστήκαμε όπως κάνουν σε όλο τον κόσμο, δηλαδή μόνταρα την ταινία και έγραψε μετά την μουσική βλέποντας την εικόνα. Στο θέμα των ερμηνευτών των λίγων τραγουδιών που χρησιμοποιώ στο soundtrack το συζητάμε και καταλήγουμε μαζί. Είναι, πιστεύετε, το ελληνικό ποδόσφαιρο και οι στρεβλώσεις του, ένα καλό δείγμα για το πώς λειτουργούσε και λειτουργεί γενικότερα η ελληνική κοινωνία; Είναι ο κατ' εξοχήν χώρος όπου διαγράφονται ανάγλυφα όλες οι παθογένειες της κοινωνίας μας. Χωρίς μάλιστα να κάνουν καν προσπάθεια να κρυφτούν πίσω από «ιδέες, πολιτικές, οράματα» και τα λοιπά. Ενώπιον σαράντα χιλιάδων θεατών μπουκάρει ο πρόεδρος με το πιστόλι στη ζώνη ή κάνει ο άλλος μια βουτιά δυο μέτρα έξω από την περιοχή, ο διαιτητής δείχνει απτόητος τη βούλα του πέναλτι και οι χιλιάδες «φίλαθλοι» στην κερκίδα πανηγυρίζουν. Τι να λέμε λοιπόν. Όταν μάλιστα κάποτε ανέφερα το περιστατικό με το περιβόητο πέναλτι σε φίλο Πειραιώτη μου απάντησε ότι «Ακριβώς αυτό είναι η ηδονή (είπε μια άλλη λέξη), να σας γαμ… με πέτσινο πέναλτι στο 90!». Τα τελευταία χρόνια παρακολουθώ ξένα πρωταθλήματα, ειδικά το Αγγλικό, όπου ανακαλύπτω ξανά τον λόγο που αγάπησα το ποδόσφαιρο. Θεωρείτε πως το Μπραζιλέρο είναι, κατά κάποιο τρόπο, το σίκουελ του Βαλκανιζατέρ; Και τα δυο έχουν να κάνουν με την προσπάθεια να καταλάβω τα ωραία και τα στραβά που ταλαιπωρούν την ζωή μας. Από την πρώτη ως την τελευταία ταινία μου νομίζω ότι στην πραγματικότητα κάνω ένα σπονδυλωτό ντοκιμαντέρ για τον νεοέλληνα. Έχει αλλάξει καθόλου, πιστεύετε, το ελληνικό ποδόσφαιρο από τη χρονιά που προβλήθηκε για πρώτη φορά η ταινία; Θεωρείτε πως παραμένει επίκαιρη μέχρι σήμερα; Βεβαίως. Έχει χειροτερέψει. Δείτε την εθνική μας ομάδα. Αντί το πυροτέχνημα του Ευρωπαϊκού πρωταθλήματος στη Πορτογαλία να είναι η αρχή της εξυγίανσης εκφυλίστηκε στην, με κάθε μέσο, κατάκτηση του πρωταθλήματος ώστε η ομάδα να εισπράξει τα λεφτά των ομίλων του Champions League . Το ίδιο δηλαδή που έκανε πριν τριάντα χρόνια ο ήρωας του Μπραζιλέρο. Με την Ευρωπαϊκή επιδότηση αντί για «Πολιτιστικό Κέντρο» έχτισε βίλλα και αγόρασε ένα Βραζιλιάνο επιθετικό για την τοπική ομάδα. Και όταν ήλθαν από την Ευρώπη οι ελεγκτές να τσεκάρουν τι έγιναν τα χρήματα των Ευρωπαίων φορολογουμένων με τα οποία τον είχαν επιδοτήσει ο Στέλιος Μάινας τους είπε «Go back!» και τα υπόλοιπα γραφικά που πριν λίγα χρόνια ακούσαμε από πρωθυπουργό. Να όμως που άγιο είχαμε πάλι και γλιτώσαμε στο τσακ τον υποβιβασμό. Θα σκεφτόσασταν ποτέ να κάνετε το Μπραζιλέρο 2 ή μια άλλη ποδοσφαιρική ταινία; Υπάρχει χώρος για ποδοσφαιρικό σινεμά στην Ελλάδα; Τα νούμερο 2 συνήθως είναι χειρότερα του 1 και δεν θα το σκεφτόμουν. Επίσης δεν είναι καν Έλληνες πια οι παίκτες των ομάδων μας. Εδώ ακόμα δεν κατάφερα να περιγράψω στο βάθος που θα ήθελα τον Έλληνα, θα ασχοληθώ με τον κάθε Περουβιανό που βγάζει εδώ το ψωμάκι του; Και μια τελευταία. Μιας και ο τίτλος είναι Μπραζιλέρο, ποιος είναι ο αγαπημένος σας Βραζιλιάνος ποδοσφαιριστής; Ο Ζαϊρζίνιο της εθνικής Βραζιλίας του ’70. Αν και έπαιζε δεξί εξτρέμ ενώ εγώ αριστερό, τα δικά του κόλπα ξεσήκωνα, βάζοντας κι ολίγη από τον Αργεντινό Χουάν Ραμόν Βερόν - που ήταν ως γνωστόν «πράγμα φοβερόν» - και για κερασάκι τις ντρίμπλες του Χάρη του Γραμμού «από την Μυτιλήνη». Σημείωση: Η χρήση των παραπάνω εικόνων έγιναν ύστερα από άδεια του Σωτήρη Γκορίτσα.","pubDate":"2023-08-26 07:00:00","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"title":"Kudus Mohammed (Ajax Amsterdam) vers West Ham","link":"https://www.lequipe.fr/Football/Actualites/Kudus-mohammed-ajax-amsterdam-vers-west-ham/1415796#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"L'Ajax et West Ham ont trouvé un accord de principe pour le transfert de Kudus Mohammed. Le milieu ghanéen devrait signer cinq ans (plus une année en option) et le club d'Amsterdam toucher 42 M€ et 3 M€ de bonus.","content":"Kudus Mohammed n'a pas manqué ses adieux pour son dernier match avec l'Ajax. Déjà auteur d'un but et d'une passe décisive en deux matches d'Eredivisie cette saison, le milieu offensif ghanéen s'est offert un triplé retentissant, jeudi, sur la pelouse de Ludogorets . Le point final d'une aventure de trois ans avec le club néerlandais qu'il s'apprête à quitter pour la Premier League. West Ham et l'Ajax ont en effet trouvé un accord de principe pour un transfert à hauteur de 42 millions d'euros (plus 3 M€ de bonus). Il pourrait être entériné ce samedi. Kudus Mohammed, 23 ans, passera ensuite sa visite médicale avant de s'engager sur un contrat de cinq ans, plus une année en option avec les Hammers. 11 buts en 30 matches d'Eredivisie la saison dernière Ce transfert s'inscrit dans la continuité d'une saison où le polyvalent international ghanéen (24 sélections, 7 buts), parfois aligné au poste d'avant-centre, a marqué 11 buts en 30 matches de Championnat néerlandais (19 titularisations) et 4 en 6 rencontres de Ligue des champions. Ses performances à la Coupe du monde avaient aussi été très appréciées par les scouts européens. West Ham est donc en passe de devancer la concurrence.","pubDate":"2023-08-26 06:53:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/kudus-mohammed-au-premier-plan-avec-l-ajax-amsterdam-lors-d-un-match-amical-face-au-borussia-dortmund-le-6-aout-g-van-keulen-anp-presse-sports/1500000001825258/0:0,1998:999-665-335-70/9af10.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Georges Mikautadze, un dernier match contre Clermont avant le départ ?","link":"https://www.lequipe.fr/Football/Actualites/Georges-mikautadze-un-dernier-match-avant-le-depart/1415729#xtor=RSS-1","keywords":["Foot, L1, Metz"],"creator":["Cyril Olives-Berthet"],"video_url":null,"description":"Courtisé par de nombreux clubs, Georges Mikautadze est sur le départ mais, faute d'offre satisfaisant le FC Metz, il sera aligné face à Clermont dimanche.","content":"Laszlo Bölöni est malicieux. Le 10 juillet dernier, lors de la reprise de l'entraînement à Metz, l'entraîneur des Grenats avait blagué sur la situation de Georges Mikautadze. « » Presque : un mois plus tard, en Bretagne (1-5, le 13 août), le Géorgien était titulaire et adressait une passe décisive à Youssef Maziz. « », expliquait aussi l'entraîneur roumain de 70 ans. Une forte cote en Italie Il a bien fait. À une semaine de la clôture du marché des transferts, celui qui vient d'être élu meilleur joueur de L2 est encore là. Buteur contre l'OM (2-2, le 18 août), il a encore été le plus en vue de son équipe. « , a expliqué Bölöni, vendredi. » Sous contrat jusqu'en 2026, le joueur de 22 ans a vu ses dirigeants fixer son prix de départ à 20 M€, bonus inclus. Quelques offres ont été refusées dont une à 15 M€ fixes dès la mi-juillet. Cela devrait bouger dans les prochains jours. L'Eintracht Francfort a coché son nom en cas de départ de Randal Kolo Muani. Orphelin de Marko Arnautovic (34 ans), vendu à l'Inter Milan, Bologne est également intéressé. La cote de « Mikau » est d'ailleurs forte en Italie, où la Lazio l'apprécie. Les Grenats, eux, ont budgété sa vente auprès de la DNCG mais Pierre Dréossi, leur directeur sportif, « », comme il l'a dit jeudi après un entraînement à huis clos auquel le joueur a normalement participé. Tout le monde au club attend fébrilement la conclusion de ce dossier au long cours. « », prévenait pourtant le capitaine Matthieu Udol il y a quelques semaines. La vidéo d'adieux est prête depuis longtemps dans les ordinateurs du service communication. Pourrait-elle devenir carrément inutile ? Ce serait une immense surprise.","pubDate":"2023-08-26 06:45:00","image_url":"https://medias.lequipe.fr/img-photo-jpg/georges-mikautadze-est-toujours-a-metz-s-mantey-l-equipe/1500000001825137/0:0,917:611-665-335-70/987dd.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"De La Salle fades in second half, loses its season opener to Orange Lutheran","link":"https://www.eastbaytimes.com/2023/08/25/de-la-salle-fades-in-second-half-loses-its-season-opener-to-orange-lutheran/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","Inside Sports"],"creator":["Darren Sabedra"],"video_url":null,"description":"Southern California heavyweight Orange Lutheran scores three second-half touchdowns, including Steve Chavez's version of Beast Mode, to beat De La Salle.","content":"CONCORD — De La Salle was going to have to play a clean game to win its season opener on Friday night against Southern California heavyweight Orange Lutheran. The Spartans did not play a clean game. Tied at halftime, De La Salle gave up three unanswered second-half touchdowns and lost at home 35-14 against an opponent that won impressively a week earlier and comes from the same league that features Mater Dei and St. John Bosco. Steve Chavez was the star of stars for Orange Lutheran, rushing for three touchdowns, including one the junior running back justifiably called “Beast Mode 3.0.” The 58-yard run late in the third quarter included multiple stiff arms in an electrifying sequence that made it 28-14. For De La Salle, it was one of several plays it would like to have back. “With a good team like Orange Lutheran, the mistakes you can make are very little, virtually none,” quarterback Toa Faavae said. “Too many mistakes. Too many mental mistakes.” De La Salle made a defensive stop in the end zone on the final play of the first half to keep the score 14-14 and got the ball to start the second half. But the Spartans went three-and-out and a short punt gave the visitors possession at the De La Salle 46. Orange Lutheran cashed in with a drive that Chavez finished with a 2-yard run for a 21-14 lead. Later in the quarter, De La Salle got what looked like a big pass play over the middle that would have moved the Spartans inside Orange Lutheran’s 30. But the ball was stripped and Orange Lutheran recovered. “Against a really good team like this, you have to make big plays,” De La Salle coach Justin Alumbaugh said. “They made more than us. We didn’t give up. We were fighting and scrapping. We had opportunities and they capitalized on more opportunities than we did.” After the turnover, De La Salle held Orange Lutheran to nine yards in three plays. But on fourth-and-1 from its own 36, Orange Lutheran handed the ball to Chavez for a 6-yard gain. On the next snap, he made the play that will go directly to the top of his recruiting highlights. “I had some great blocks up front, bounced out and from there, God paved the way,” Chavez said, adding that he made at least four stiff arms on defenders and broke about six tackles. Given how the game started, it looked as if the last one to score would win. The teams combined for 28 points in the first four possessions. Orange Lutheran, coming off a 49-17 rout of Serra-Gardena last week, needed 10 plays to cover 66 yards for a touchdown on the game’s opening possession. TJ Lateef connected with Tyler Hennessy for 14 yards on third-and-11 from Orange Lutheran’s 33 to keep the series alive. Chavez’s slashing 16-yard run, followed by Lateef’s 14-yard scramble moved the visitors inside the 10. Two plays later, Joseph De La Torre caught a 5-yard pass from Lateef to for a 7-0 lead. De La Salle immediately responded. Jaden Jefferson’s 39-yard kickoff return put the Spartans at their own 41. It took De La Salle eight plays to cross the goal line. Faavae’s 16-yard quarterback keeper accounted for the touchdown that evened the score 7-7 with 4:04 left in the opening quarter. Orange Lutheran went in front 14-7 when AJ La caught a 3-yard pass from Lateef in the back of the end zone on third-and-goal to end the opening quarter. Related Articles De La Salle responded again, driving 62 yards to pull even. Dominic Kelley’s 3-yard run made it 21-21 with 7:37 left in the half. The Spartans didn’t score another point the rest of the game. “We get the ball at half, tied 14-14, I liked our chances, to be honest,” Alumbaugh said. “We just couldn’t put it together. Every time we needed a stop, it seemed like they made a big play. Every time we needed a big play, we just couldn’t quite get it done.” The schedule doesn’t soften for De La Salle. Up next: A visit to Serra next Saturday.","pubDate":"2023-08-26 06:35:49","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-DLSFB-0825-03_133237168-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"El Cerrito uses proven formula in season-opening win over Division I school","link":"https://www.eastbaytimes.com/2023/08/25/el-cerrito-uses-proven-formula-in-season-opening-win-over-division-i-school/","keywords":["High School Sports","Latest Headlines","Sports","High School Football","High School Soccer","Inside Sports","PM report","Preps Alert"],"creator":["Curtis Pashelka"],"video_url":null,"description":"El Cerrito's defense held Amador Valley to less than 150 yards of offense on Friday.","content":"PLEASANTON – A hard-fought nonleague win over Division I Amador Valley last year helped propel the El Cerrito High School football team to an undefeated regular season. Gauchos coach Jacob Rincon would gladly take the same end result in 2023, and he might have the defense to do it. El Cerrito’s defense made a two-touchdown lead in the first-half stand as the Gauchos held on to a 14-7 win over Amador Valley on Friday in the season-opening game for both teams. Running back Micah Avery, a transfer from Clayton Valley Charter, scored on a 69-yard touchdown run with 3:46 left in the first quarter and fellow senior Michael Vanhook scored on a quarterback keeper just before halftime, providing just enough offense to help No. 14 El Cerrito extend its regular season win streak to 16 games. Avery had 95 yards on 13 carries and Vanhook completed 8 of 15 passes for 72 yards. El Cerrito’s second touchdown drive was aided by an 85-yard run from another newcomer in Zaire Eastman, who attended De Anza last year. El Cerrito went 12-1 last year, beginning the season with a 7-3 home victory over the Dons. That win proved to be the Gauchos’ closest game of 2022, as they went 10-0 in the regular season and earned blowout playoff wins over Montgomery-Santa Rosa and Northgate to capture the North Coast Section Division III championship. “Coming in, we already knew Amador was going to be a physical, aggressive team,” Rincon said. “We love the brand and style of football they play. It prepares us for the rest of the season. So we expected this to be a dogfight. “Shout out to (Dons coach) Dan (Jones). He does a great job. But overall. I think we got a few good big plays and the touchdown obviously at the half was huge for us.” In the second half, the Gauchos relied on their defense to hold off the resilient Dons. Amador Valley senior Nate Jetter caught a 6-yard touchdown pass from quarterback Aiden Foley with 5:10 left in the fourth quarter to cut El Cerrito’s lead to 14-7. The Dons were then able to get the ball back with just over two minutes to play, but El Cerrito’s defense halted the drive as Amador’s 41. El Cerrito’s defense held opponents to nine points or less nine times last season, and that doesn’t include a 2-0 forfeit win over Hercules last October. “I put it to them in practice: defense wins games, and we saw that here,” Vanhook said. “Defense won this game today. I love them. That’s the key to this team. I’m really proud of them.” El Cerrito’s defense held Amador Valley to less than 150 yards of offense on Friday. “Defensively, we did a great job,” Rincon said. “Defensive coordinator Tim Johnson does a great job preparing those guys, and then for us to come out here and execute the way we did was just a beautiful thing to see.” Amador Valley’s options on offense were limited after senior running back Jake Goldsworthy suffered what Jones said were ankle and toe injuries midway through the first half. At that point, Goldsworthy, a two-way starter, had 36 yards on 12 carries, although he also had a pair of long rushes called back because of penalties. Anthony Harrington and Sean Cervantes took over the bulk of the running game, rushing for a combined 63 yards. Foley completed 4 of 8 passes for 35 yards and is holding things down while junior QB Tristan Tia sits out the first five games as a transfer from Granada. Jones said he thought Goldsworthy would be OK and that he hoped the 6-foot-1, 210-pounder would be available to play next week when Amador Valley travels to play No. 16 Campolindo, last year’s NCS Division II runner-up. “He’s our guy, right? Especially with how we are on offense right now, with no Tristan, we’re running the rock,” Jones said. “And Goldie’s kind of the heart and soul of our team, so when he goes down, it takes the wind out of us a little bit. “We knew (El Cerrito) was a really good team, and I’m really proud for our backs being against the wall, 14-0, and we continued to fight. We didn’t care about what the score was. We were just worried about the next play, and I think that’s the right formula.” Related Articles El Cerrito, which had its season ended with a 36-7 loss to Grant-Sacramento in the CIF NorCal Division 3-AA regional title game, is now a Division II team thanks to the section’s competitive realignment regulations. The Gauchos play Freedom, another Division I team, next week, with their nonleague schedule continuing with games against Fremont-Oakland, Foothill-Pleasanton, and Vacaville. “A win like this could do (a lot for us), but we’ve got to get back to work,” Rincon said. “We had a lot of penalties and we want to clean things up and play a little bit more of a disciplined brand of football.”","pubDate":"2023-08-26 06:33:17","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-ELCERRITO-1202-9-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Μαρσέιγ μεταγραφές: Ανακοίνωσε Κορέα, αντικαταστάτης του στην Ίντερ ο Σάντσες","link":"https://www.gazzetta.gr/football/ligue-1/2250078/marseig-metagrafes-anakoinose-korea-antikatastatis-toy-stin-inter-o","keywords":["Ποδόσφαιρο","Serie A","Ligue 1","Κωνσταντίνος Κωλαΐτης","Μαρσέιγ","Ίντερ","Αλέξις Σάντσες"],"creator":null,"video_url":null,"description":"Η Μαρσέιγ επισημοποίησε την απόκτηση του Χοακίν Κορέα από την Ίντερ με τη μορφή δανεισμού και οψιόν αγοράς, δίνοντας το ελεύθερο στους Νερατζούρι να ολοκληρώσουν την επιστροφή του Αλέξις Σάντσες που υπέγραψε ως ελεύθερος για έναν χρόνο.","content":"Το «ντόμινο» ενισχύσεων μεταξύ Μαρσέιγ και Ίντερ ολοκληρώθηκε κι επίσημα, με τους Μαρσεγιέζους να ανακοινώνουν τον Χοακίν Κορέα και τους Νερατζούρι να επαναφέρουν μετά από έναν χρόνο τον Αλέξις Σάντσες στο «Μεάτσα». Ο γαλλικός σύλλογος, παρά το οικονομικό «πλήγμα» του αποκλεισμού από το Champions League, συνεχίζει δυναμικά στο θερινό παζάρι και απέκτησε τον 29χρονο Αργεντινό επιθετικό, αρχικά ως δανεικό για έναν χρόνο αντί 2 εκατ. ευρώ και με οψιόν αγοράς στα 10 εκατομμύρια ευρώ που θα ενεργοποιηθεί αυτόματα αν η ομάδα του Μαρθελίνο τερματίσει στις δύο πρώτες θέσεις της Ligue 1 που οδηγούν απευθείας στους ομίλους της κορυφαίας διασυλλογικής διοργάνωσης. Από την άλλη, η Ίντερ περίμενε αυτή την αποχώρηση ώστε να μπορέσει να προχωρήσει την επιστροφή του Χιλιανού εξτρέμ στο Μιλάνο. Έναν χρόνο αφότου μετακόμισε στη Μασσαλία, ο Σάντσες αποτελεί και πάλι παίκτη της Ίντερ υπογράφοντας ως ελεύθερος για έναν χρόνο και θα πλαισιώσει με την εμπειρία του τον βασικό κορμό επιθετικών της ομάδας του Σιμόνε Ιντζάγκι.","pubDate":"2023-08-26 06:32:38","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"}]}