{"newsArray":[{"title":"Ronaldo’s frosty moment caught on camera","link":"https://www.themercury.com.au/sport/football/cristiano-ronaldos-frosty-moment-with-teammate-caught-on-camera-ahead-of-fifa-world-cup/news-story/206f03887b7c0f02349696dbeefeb799","keywords":["Football","Kayo","Sport news and galleries","World Cup"],"creator":null,"video_url":null,"description":"Cristiano Ronaldo received a frosty reception from Manchester United teammate Bruno Fernandes as the pair arrived at the World Cup.","content":"A video of the Portugal superstars showed Fernandes touching Ronaldo’s arm as he walked past, prompting an offer of a handshake which was eventually accepted – but only briefly.Fernandes said something and then walked away with Ronaldo looking disappointed.Watch the world’s best footballers every week with beIN SPORTS on Kayo. LIVE coverage from Bundesliga, Ligue 1, Serie A, Carabao Cup, EFL & SPFL. New to Kayo? Start your free trial now >The incident came after Ronaldo declared Manchester United’s owners the Glazer family “don’t care” about how successful the Premier League giants are on the pitch in another salvo against the club.The five-time Ballon d’Or winner has been a peripheral figure this season under new manager Erik ten Hag and was disciplined for refusing to come on as a substitute.But he had returned to the side in recent weeks and even captained the Red Devils in a 3-1 loss at Aston Villa.However, the 37-year-old was absent from the squad in the 2-1 victory over Fulham in United’s final match before a six-week break for the World Cup.In an explosive interview with TalkTV Ronaldo, who made his name at Old Trafford, said he felt “betrayed” by United and that he believed senior club figures were trying to oust him.In another part of the interview he continued to wage war on the club where he made his name during his first stint at Old Trafford from 2003 to 2009.Premier League: Cristiano Ronaldo has given a scathing interview to Piers Morgan where he said he felt 'betrayed' and like the club was trying to force him out.The forward, who returned to the club last year, said he does not speak to the Glazers, the Americans who have owned United since 2005, and they do not have the club’s best interests at heart.“The Glazers, they don’t care about the club … professional sport. As you know, Manchester is a marketing club,” he said.“They will get money from the marketing — the sport, it’s, they don’t really care, in my opinion.“The fans, they’re always right. I think the fans should know the truth, should know that the players want the best for the club. I want the best for the club. This is why I came to Manchester United.”Ronaldo won three Premier League titles and the Champions League during his first stint at United but the club have not won any silverware since 2017.Ronaldo said there were “some things inside the club” that were preventing United from competing with rivals Manchester City and Liverpool and it would be hard for them to return to the top in the next few years.He has also rounded on former teammates Wayne Rooney and Gary Neville after criticism from the pair.“People can have (their) own opinion but they don’t really know what’s going on. For example, inside the training ground and Carrington or even my life,” he said.“They have to listen to my point of view as well. Because it’s easy to criticise but if you don’t know the whole story, it’s easy.“They are not my friends.”Ronaldo explained in his interview why he did not go on United’s pre-season tour to Australia in July.He revealed partner Georgina Rodriguez and baby daughter Bella Esmeralda were hospitalised with a “big problem”, only a matter of months after the death of their newborn son, but said he was not fully believed by the United hierarchy.“I am never, ever going to change the health of my family for a football,” he said. “Never. Now or 10 years behind or forward and it is something that really hurt me because they doubt my words.”A statement from United, released on Monday, said the club would “consider its response after the full facts have been established”.The World Cup starts on Sunday, although Euro 2016 winners Portugal, who are in Group H, do not begin their campaign until November 24.In a message posted on social media, along with a photo of himself and some of his international teammates, Ronaldo said: “Total and absolute focus on the work of the national team.”","pubDate":"2022-11-15 12:50:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Steven Gerrard lands new job fresh from Aston Villa sack","link":"https://www.birminghammail.co.uk/sport/football/football-news/steven-gerrard-job-aston-villa-25520011","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Patrick Rowe)"],"video_url":null,"description":"All the latest Aston Villa news as BirminghamLive brings you details on Steven Gerrard's new role within football","content":"Steven Gerrard has secured his first job since being sacked by Aston Villa after being confirmed as a \"brand ambassador\" for the 2022 Qatar World Cup. Gerrard, 42, was relieved of his duties as Villa boss following the 3-0 loss to Fulham at Craven Cottage, which came just under a year after he was appointed as Dean Smith's successor in November 2021. Villa have moved on to a new era under former Paris Saint-Germain and Arsenal boss Unai Emery, with Gerrard now securing his next role following his disappointing tenure in the West Midlands. READ MORE: Aston Villa must double Newcastle transfer offer to land PSG target READ MORE: The 'big thing' behind Unai Emery revolution after Aston Villa team meeting Despite being linked to a number of managerial jobs such as Wigan Athletic and Besiktas, Gerrard's new job is with online gambling site M88 Mansion. The Liverpool legend will work as a \"brand ambassador\" for the bookmaker, while he waits on any future roles within football management. Speaking on the decision to take on the role ahead of the tournament, Gerrard revealed how \"delighted\" he was regarding the opportunity after becoming the company's first official ambassador for the tournament. “I am delighted to join M88 Mansion as their brand ambassador for the World Cup,\" said Gerrard. \"I couldn’t be more excited to share my experiences from my time on the field, especially my views and opinion to the Asian sports fans regarding the upcoming World Cup.” The company states the ambassador's role is to \"focus on bolstering the company’s positions in the Southeast Asian market and engage with local sports and soccer fans through digital channels and various promotional activities tailored to regional preferences.\" Will Gerrard return management? If so, who with? Have your say in the comments section... READ NEXT Barcelona plotting Aston Villa transfer raid amid shock swap claims Jamie Carragher called out for Steven Gerrard 'protection' after Cristiano Ronaldo interview Aston Villa notebook: Boubacar Kamara verdict and truth behind loan deal Steven Gerrard sanctioned 'Long meetings' - Matty Cash reveals what Unai Emery has drilled into Aston Villa squad Aston Villa face Tottenham transfer battle as Antonio Conte 'lines up' £105m spending spree","pubDate":"2022-11-15 12:30:00","image_url":"https://i2-prod.birminghammail.co.uk/sport/football/football-news/article25328534.ece/ALTERNATES/s615/2_JS281127340.jpg","source_id":"birminghammail","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Highest-graded players at every position through Week 11 of the 2022 college football season","link":"https://www.pff.com/news/college-football-highest-graded-power-five-group-of-5-every-position-week-11-2022/","keywords":null,"creator":["Max Chadwick"],"video_url":null,"description":"Breaking down the highest-graded Power Five and Group of Five players at every position through Week 11 of the 2022 college football season, including Michigan's Blake Corum and Wake Forest's Kobie Turner.","content":null,"pubDate":"2022-11-15 12:15:22","image_url":null,"source_id":"pff","country":["canada"],"category":["sports"],"language":"english"},{"title":"USA football launch 'Be the Change' initiative to focus on social issues in Qatar","link":"https://www.indiatoday.in/sports/football/story/fifa-world-cup-usa-football-launch-be-the-change-initiative-to-focus-on-social-issues-in-qatar-2297583-2022-11-15?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"USA football launch 'Be the Change' initiative to focus on social issues in Qatar","content":null,"pubDate":"2022-11-15 11:54:33","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Ian Hartitz’s Week 10 fantasy football fallouts: Nullified touchdowns, missed big plays and more","link":"https://www.pff.com/news/fantasy-football-week-10-fallouts-nullified-touchdowns-missed-big-plays/","keywords":null,"creator":["Ian Hartitz"],"video_url":null,"description":"PFF's Ian Hartitz details the biggest fantasy football \"sheeshes\" of NFL Week 10, including nullified touchdowns, missed big plays and much more.","content":null,"pubDate":"2022-11-15 11:30:57","image_url":null,"source_id":"pff","country":["canada"],"category":["sports"],"language":"english"},{"title":"Cristiano Ronaldo revela mágoa no United e diz que ‘não acreditaram’ em problema de saúde da filha","link":"https://www.alagoas24horas.com.br/1477989/cristiano-ronaldo-revela-magoa-no-united-e-diz-que-nao-acreditaram-em-problema-de-saude-da-filha/","keywords":["Futebol","Cristiano Ronaldo"],"creator":["Cláudia Galvão"],"video_url":null,"description":"Cristiano Ronaldo jogou bomba no mundo do futebol ao ter divulgada entrevista ao jornalista Piers Morgan, do tabloide The Sun, em que detonou o Manchester United, a estrutura do clube e até mesmo ídolos da equipe. Dentro da entrevista, o craque português falou sobre sua ausência na preparação do clube para a temporada, afirmando que...","content":"Manchester United Football ClubManchester United Football Club Cristiano Ronaldo jogou bomba no mundo do futebol ao ter divulgada entrevista ao jornalista Piers Morgan, do tabloide The Sun, em que detonou o Manchester United, a estrutura do clube e até mesmo ídolos da equipe. Dentro da entrevista, o craque português falou sobre sua ausência na preparação do clube para a temporada, afirmando que avisou à diretoria sobre um problema familiar, mas que não acreditaram em sua palavra. “Falei com o diretor esportivo e com o presidente do Manchester United e eles, de certa forma, não acreditaram que algo de ruim tinha acontecido, o que fez me sentir mal. Eles acreditaram, mas ao mesmo tempo eles… nunca irei trocar a saúde da minha família pelo futebol. Agora, ou mesmo há 10 anos ou daqui a 10 anos. E isso magoou-me mesmo porque duvidaram da minha palavra”, disse. “Tive dificuldades, mas especialmente a Bella (filha) e a Gio (Georgina Rodríguez, esposa), porque passaram uma semana no hospital. A Bella teve um grande problema de saúde. E eu não fui à pré-temporada por causa disso, porque não poderia deixar a minha família para fazer a pré-temporada. Penso que não era justo, por isso que não fui”, completou. Falta estrutura… “Desde que Sir Alex Ferguson saiu, eu não vi evolução no clube, não houve progresso. Por exemplo, como um clube como o Manchester United, depois de demitir Solskjaer, traz o diretor esportivo Ralf Rangnick? Ninguém entende. Esse cara não é nem um técnico. Surpreendeu não só a mim, mas ao mundo. Nada mudou. A piscina, a jacuzzi, até a academia, a cozinha, os chefs. Eles pararam no tempo. Me surpreendeu muito, eu achei que ia ver coisas diferentes, mais modernidade em tecnologia, infraestrutura. Vemos as mesmas coisas que eu via quando tinha 20, 21, 23 anos de idade”. “Mas você tem algumas coisas dentro que não nos ajudam a alcançar o nível mais alto como Manchester City, Liverpool e até agora Arsenal… um clube com esta dimensão deveria estar no topo da árvore na minha opinião e infelizmente não está. Como Picasso disse, é preciso destruir para reconstruir (a citação exata do artista foi: ‘Todo ato de criação é primeiro um ato de destruição’) e se eles começam comigo, para mim, não é um problema. Eu amo o Manchester United, eu amo os torcedores, eles estão sempre do meu lado. Mas se eles querem fazer diferente… eles têm que mudar muitas, muitas coisas”. A relação com Ten Hag Ronaldo verbalizou que seu relacionamento com o técnico Erik Ten Hag não é nada bom. “Eu não tenho respeito por ele porque ele não mostra respeito por mim. Se você não tem respeito por mim, eu nunca vou ter respeito por você”. Sobrou até para Rooney Ex-parceiro de ataque de Ronaldo no United, Wayne Rooney declarou recentemente que o português era uma “distração” e que fez coisas “inaceitáveis” no clube. “Não sei por que ele me critica tanto. . . provavelmente porque ele terminou sua carreira e eu ainda estou jogando em alto nível. Eu não vou dizer que estou melhor do que ele. Mas é verdade…”.","pubDate":"2022-11-15 11:27:01","image_url":null,"source_id":"alagoas24horas","country":["brazil"],"category":["sports"],"language":"portuguese"},{"title":"Coupe du monde : Luis Enrique débarque sur Twitch pour établir un lien direct avec les fans","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde/coupe-du-monde-luis-enrique-debarque-sur-twitch-pour-etablir-un-lien-direct-avec-les-fans-20221115","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"Une première dans l'histoire du football, le sélectionneur a affirmé vouloir «établir une relation directe» avec les supporters en communiquant sur la plateforme de diffusion Twitch.","content":null,"pubDate":"2022-11-15 11:18:11","image_url":null,"source_id":"lefigaro","country":["france"],"category":["sports"],"language":"french"},{"title":"VIDEO. Le magnifique but du SC Abbeville en football amateur parmi les plus beaux en France","link":"https://actu.fr/hauts-de-france/abbeville_80001/video-le-magnifique-but-du-sc-abbeville-en-football-amateur-parmi-les-plus-beaux-en-france_55195029.html","keywords":null,"creator":null,"video_url":null,"description":"Le but marqué par Anthony Wyka du SC Abbeville face à Gamaches dimanche 13 novembre 2022 a été diffusé par l'émission Tout le sport sur France 3.","content":null,"pubDate":"2022-11-15 11:16:25","image_url":null,"source_id":"actu","country":["france"],"category":["sports"],"language":"french"},{"title":"Limerick woman makes senior debut in Rep of Ireland's win over Morocco","link":"https://www.limerickleader.ie/news/sport/965029/limerick-woman-makes-senior-debut-in-rep-of-ireland-s-win-over-morocco.html","keywords":["Aoibheann Clancy,Claire O'Riordan,Rep of Ireland,Rep of Ireland v Morocco,#COYGIG"],"creator":["Colm Kinsella"],"video_url":null,"description":"A LIMERICK teenager made her senior international debut as the Republic of Ireland women's national team rounded off a memorable year with a 4-0 victory over Morocco in an international friendly in the Marbella Football Center on Monday night. Kilbehenny's Aoibheann Clancy came off the substitutes'","content":"A LIMERICK teenager made her senior international debut as the Republic of Ireland women's national team rounded off a memorable year with a 4-0 victory over Morocco in an international friendly in the Marbella Football Center on Monday night. Kilbehenny's Aoibheann Clancy came off the substitutes' bench in the second half to make her debut for Vera Pauw's World Cup-bound Republic of Ireland side. In the side's 10th game of 2022, Pauw's squad sealed victory courtesy of goals from Megan Campbell, Katie McCabe, Louise Quinn and Kyra Carusa. Nineteen-year-old midfielder Clancy, who played the last half an hour of the fixture with Morocco, has represented Ireland at varying underage levels, is currently playing with Wexford Youths in the Women's National League (WNL). Clancy was a stand-out player for Ireland at Under-17 and Under-19 level before moving up to the senior squad in 2022. She won the SSE Airtricity Women's National League Young Player of the Year award in 2021 following superb performances for Wexford Youths. The teenager, who has previously played with Limerick FC, is a sporting all-rounder and has played with her native Galtee Gaels Ladies Football side. Another Limerick native Claire O'Riordan was also a member of Vera Pauw's Republic of Ireland squad for the eight-day training camp and fixture with Morocco in Spain. The 28-year-old Newcastle West woman has won 18 international caps since her senior debut in March 2016. O'Riordan joined Scottish side Celtic FC Women from Germany's Duisburg in the Summer. Another multi talented sports star O'Riordan has played camogie and Ladies Gaelic football for Limerick - she played camogie with Newcastle West and Ladies Football with Monagea before joining up with Wexford Youths soccer club while in college in IT Carlow. The Republic of Ireland women's team are continuing with their build up towards next summer's FIFA Women's World Cup in Australia and New Zealand. REP OF IRELAND: Courtney Brosnan; Niamh Fahey, Louise Quinn, Diane Caldwell (Hayley Nolan 80); Jamie Finn (Abbie Larkin 46), Lily Agg, Denise O’Sullivan (Aoibheann Clancy 62), Megan Campbell (Chloe Mustaki 62); Áine O’Gorman, Katie McCabe; Amber Barrett (Kyra Carusa 62). MOROCCO: Zouhair Assia; Mazrouai Rkia, Atiq Maryem, Yasmin Mrabet, Seghir Sabbah (Bouharat Ibtissam 76); Ouzraoui Diki Sakina (Jbilou Hajar 76), Nakkach Elodie Nahla, Daoudi Sana, Bouftini Sofia (Saoud Imane 61); Amani Salma; Belkasmi Anissa. REFEREE: Jason Lee Barcelo (Gibraltar).","pubDate":"2022-11-15 11:15:00","image_url":"https://www.limerickleader.ie/resizer/300/200/true/ILIL_19-11-22_Aoibheann_Clancy_Rep_of_Ireland_New-1668509533827_1668509596.jpg--limerick_woman_makes_senior_debut_in_rep_of_ireland_s_win_over_morocco.jpg?1668509596000","source_id":"limerickleader","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Saudi coach: Salman Al-Faraj is ready.. and Fahd Al-Mawlid will not affect","link":"https://thenewsglory.com/saudi-coach-salman-al-faraj-is-ready-and-fahd-al-mawlid-will-not-affect/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"French coach Herve Renard, coach of the Saudi national football team, today, Tuesday, held a press conference to talk about the upcoming friendly match against Croatia tomorrow, Wednesday, at the end of the national team’s preparations for the 2022 World Cup, which will start in Qatar next Sunday. Renard confirmed the player’s readiness for the […]","content":"French coach Herve Renard, coach of the Saudi national football team, today, Tuesday, held a press conference to talk about the upcoming friendly match against Croatia tomorrow, Wednesday, at the end of the national team’s preparations for the 2022 World Cup, which will start in Qatar next Sunday. Renard confirmed the player’s readiness for the match against Croatia, noting that the player is fully prepared to play 90 minutes in the upcoming matches. Renard called on the Saudi fans to trust the players they know well, pointing out that the motives in the experimental matches differ from the official ones. Regarding the exclusion of the player Fahd Al-Muwallad from the national team list, the French coach confirmed that Al-Muwallad is an important player, but his exclusion will not affect the national team, adding that the player Nawaf Al-Abed is a suitable replacement for him. Renard stressed the importance of the friendly match against Croatia, the summer of the 2018 World Cup, and represented a strong preparation for the team before entering the World Cup. The Saudi team is competing in the World Cup in Group C, and begins its campaign against Argentina next Tuesday, before facing Poland on November 26, and then facing Mexico on the 30th of the same month. The delegation of the Croatian team arrived this morning at King Khalid International Airport in Riyadh, in preparation for the confrontation with the Saudi team, and was received by a number of officials of the Saudi Federation. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter LinkedIn Pin interest Whats App","pubDate":"2022-11-15 11:07:24","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Messi vs Cristiano Ronaldo, qu'a donné le dernier Mondial des autres dieux du football ?","link":"https://www.butfootballclub.fr/foot-etranger/espagne/messi-vs-cristiano-ronaldo-qu-a-donne-le-dernier-mondial-des-autres-dieux-du-football-796225","keywords":null,"creator":null,"video_url":null,"description":"La Coupe du monde 2022 sera sans doute la dernière pour Lionel Messi et Cristiano Ronaldo, qui ont écrasé les débats lors des quinze dernières années. Mais si on regarde les précédents, on se rend compte que les superstars réussissent rarement leurs adieux avec la plus belle des compétitions.","content":null,"pubDate":"2022-11-15 11:00:00","image_url":"https://static.butfootballclub.fr/16/2022/11/photo_article/796225/315506/1200-L-messi-vs-cristiano-ronaldo-qu-a-donn-le-dernier-mondial-des-autres-dieux-du-football.jpg","source_id":"butfootballclub","country":["france"],"category":["sports"],"language":"french"},{"title":"Teenage Football Player Passes Away Due to Medical Negligence After Ligament Surgery","link":"https://www.news18.com/news/football/teenage-football-player-passes-away-due-to-medical-negligence-after-ligament-surgery-6390085.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Priya, a 17-year-old footballer who underwent ligament surgery in Chennai on the seventh of November, passed away from complications developed after the compression bandage that was applied to prevent bleeding resulted in a lack of blood flow to the leg and her right leg had to be amputated. She developed multiple organ failure and passed away on Tuesday morning","content":null,"pubDate":"2022-11-15 10:51:43","image_url":"https://images.news18.com/ibnlive/uploads/2022/10/football-general-afp-16662760313x2.jpg","source_id":"news18","country":["india"],"category":["sports"],"language":"english"},{"title":"Fantasy Football: 5 moves to make to propel your team into the playoffs","link":"https://www.pff.com/news/fantasy-football-5-moves-to-make-to-propel-your-team-into-the-playoffs/","keywords":null,"creator":["Kevin Cole"],"video_url":null,"description":"PFF's Kevin Cole reveals the moves that fantasy managers need to make to get their teams into the playoffs.","content":null,"pubDate":"2022-11-15 10:45:40","image_url":null,"source_id":"pff","country":["canada"],"category":["sports"],"language":"english"},{"title":"O’Donnell Park to host Donegal’s first league game.","link":"https://highlandradio.com/2022/11/15/odonnell-park-to-host-donegals-first-league-game/","keywords":["Sport"],"creator":["oisinkelly"],"video_url":null,"description":"Donegal are set to open their Allianz National Football league campaign against Kerry in Letterkenny in late January. Donegal will have three home games in Division One and four away from home in 2023. The draft fixtures plan with dates for games were sent out to the various county boards two weeks ago with Donegal … O’Donnell Park to host Donegal’s first league game. Read More » The post O’Donnell Park to host Donegal’s first league game. appeared first on Highland Radio - Latest Donegal News and Sport.","content":"Photo: Donegal GAA Donegal are set to open their Allianz National Football league campaign against Kerry in Letterkenny in late January. Donegal will have three home games in Division One and four away from home in 2023. The draft fixtures plan with dates for games were sent out to the various county boards two weeks ago with Donegal set for home ties in Letterkenny, Ballyshannon and Ballybfoey. Donegal will host Kerry at O’Donnell Park in their opening game on the final weekend in January with Galway set to the visitors on the new surface at Fr Tierney Park in late February and the Mayo match is penciled in for St Patrick’s Weekend. They four away games are with Tyrone, Monaghan, Roscommon and Armagh. The league fixtures will be finalised with Croke Park in the coming days. The post O’Donnell Park to host Donegal’s first league game. appeared first on Highland Radio - Latest Donegal News and Sport.","pubDate":"2022-11-15 10:36:01","image_url":null,"source_id":"highlandradio","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Hibs legend Jimmy O’Rourke dies aged 76 as tributes pour in for Easter Road icon","link":"https://www.thescottishsun.co.uk/sport/football/9766871/hibs-jimmy-orourke-dies-76-easter-road-icon/","keywords":["Football","Scottish Premiership","Sport"],"creator":["Jonathon Moar"],"video_url":null,"description":null,"content":"HIBS have announced the passing of club legend Jimmy O'Rourke at the age of 76. A former striker, O'Rourke was an integral part of the Hibees ' legendary side of the 1970s under Eddie Turnbull. 2 Hibs legend O'Rourke has passed away Credit: SNS 2 O'Rourke (left) pictured with ex-Hibs star Keith Wright Credit: Andrew Barr - The Sun Glasgow Announcing his passing , the club said they were \"devastated\" by the news. A boyhood Hibs supporter, O'Rourke burst into the club's first team aged just 16 and 85 days in December 1962. He held the record of being the Easter Road side's youngest-ever player until 2004. O'Rourke would score his first Hibs goal three days later against Dunfermline , becoming their youngest-ever goalscorer. READ MORE FOOTBALL STORIES IN THE MONEY Every Premiership star going to World Cup and how much they'll earn for clubs MEGA OFFERS Rangers & Celtic best free bets, bonuses and sign-up offers That's one record that he does still maintain. The goals continued to flow for O'Rourke and he went on to find the net 121 times in 325 appearances for the club, meaning he sits ninth in their all-time top scorers' list. A player who gave Hibs fans plenty of memorable moments, one of the major highlights was his winner in the 1972 League Cup Final. His 66th minute effort turned out to be the goal that secured the trophy in a 2-1 win over Celtic in front of over 70,000 fans at Hampden. Most read in Football WHY I BLANKED NEV Gary Neville isn't my friend, he uses me for TV fame, says Ronaldo JINKY ANTIQUE Jimmy Johnstone's famous regi plate goes up for sale as fan makes HUGE offer FERGIE TIME Barry Ferguson opens shock Gers return door with Van Bronckhorst on the brink MVP Rangers star rated most valuable in Scotland as Celtic hero Jota left in 2nd place At the time, it was Hibs' first trophy success in two decades. That was far from his only major moment of glory during his 12-year stint with the Leith club. He's also remembered for striking a stunning hat-trick against Sporting Lisbon in 1972. And he was a man for the Edinburgh Derby occasion too, netting twice in a 7-0 thrashing of Hearts in January 1973. He left Hibs in 1974 and went on to enjoy two-year spells at both St Johnstone and Motherwell, where he considered his excellent form as a goalscorer. After his playing days came to an end, O'Rourke returned to Hibs in a coaching capacity, assisting the legendary Turnbull. He service to the club certainly didn't go unnoticed and he was inducted into the Hibernian Hall of Fame 2012. Several Hibs fans paid tribute after the news broke. One said: \"RIP Jimmy, with the angels high above.\" Another said: \"He was a lovely guy. Spoke to him a few times. RIP.\" A third said: \"He would be worth millions in today's game. RIP Jimmy.\" Read More on The Sun OH BABY I gave birth five months ago and I absolutely hate motherhood, it's a scam LIST DISS I worked in Primark - we have secret 'blacklist' board in staff room, here's why Invoking memories of the fans' chant for their hero, Hibs closed their emotional statement by saying: \"In his passing, Hibernian has lost one of its best-loved sons. Jimmy, Jimmy O'Rourke, everyone knows his name. \"To the angels high above.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-11-15 10:26:24","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Stéphan a failli être viré de Strasbourg, Nice ne lâche pas ce crack de L1, Still est fixé à Reims","link":"https://www.butfootballclub.fr/stephan-a-failli-etre-vire-de-strasbourg-nice-ne-lache-pas-ce-crack-de-l1-still-est-fixe-a-reims","keywords":null,"creator":null,"video_url":null,"description":"Si « But ! Football Club » traite en premier lieu l'actualité de certaines équipes de l'élite, nous avons décidé de vous faire un résumé de ce qu'il s'est passé aujourd'hui dans l'autre partie – moins médiatique – du championnat de France.","content":null,"pubDate":"2022-11-15 10:20:00","image_url":"https://static.butfootballclub.fr/16/2022/11/photo_article/796146/315469/1200-L-ogc-nice-mercato-ghisolfi-fonce-sur-un-crack-des-merlus.jpg","source_id":"butfootballclub","country":["france"],"category":["sports"],"language":"french"},{"title":"Fantasy Waiver Wire Week 11: 5 to add, drop, buy low, sell high","link":"https://www.pff.com/news/fantasy-football-waiver-wire-week-11-5-to-add-drop-buy-low-sell-high-2022/","keywords":null,"creator":["Nathan Jahnke"],"video_url":null,"description":"The 2022 fantasy football season is in full swing. Here are players to add and drop, as well as some players to buy and sell in dynasty fantasy football leagues after Week 10.","content":null,"pubDate":"2022-11-15 10:15:09","image_url":null,"source_id":"pff","country":["canada"],"category":["sports"],"language":"english"},{"title":"A night to remember: Watch as Derry City players meet their fans","link":"https://www.derryjournal.com/news/people/a-night-to-remember-watch-as-derry-city-players-meet-their-fans-3918611","keywords":["People","News"],"creator":["Daire Ní Chanáin"],"video_url":null,"description":"Thousands of people went out to support the Derry City football players on Monday night as they brought the FAI Cup home to Derry.","content":"1. Derry City players' huge welcome home to the Guildhall Square after their FAI Cup Final win. Derry City players' huge welcome home to the Guildhall Square after their FAI Cup Final win. 2. Derry City players' huge welcome home to the Guildhall Square after their FAI Cup Final win. Derry City players' huge welcome home to the Guildhall Square after their FAI Cup Final win. 3. Derry City players' huge welcome home to the Guildhall Square after their FAI Cup Final win. Derry City players' huge welcome home to the Guildhall Square after their FAI Cup Final win. 4. Derry City players' huge welcome home to the Guildhall Square after their FAI Cup Final win. Derry City players' huge welcome home to the Guildhall Square after their FAI Cup Final win.","pubDate":"2022-11-15 10:11:30","image_url":"https://www.derryjournal.com/webimg/b25lY21zOmVmMzQ2M2MyLTc1OWEtNDdhNi04ZjNlLTEzYmFhODk4YjhmOTo2MDk3OTMyOC01MmJmLTQ1MTItOTFkYi01YTNlYmFmYWMyNGI=.jpg?width=1200&auto=webp","source_id":"derryjournal","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Mondial 2022: Première séance d’entraînement pour les Lions de l’Atlas avec la présence d’Abderrazak Hamdallah","link":"https://fr.le7tv.ma/2022/11/15/mondial-2022-premiere-seance-dentrainement-pour-les-lions-de-latlas-avec-la-presence-dabderrazak-hamdallah/","keywords":["Buzz","Football Marocain","Sport","Sport et formation","Sport et Management","Sport et motivations","Sport et sensibilisation","Sport et valeurs","Sport international"],"creator":["le7tv"],"video_url":null,"description":"L’équipe nationale est arrivée dans la soirée du dimanche à Doha pour prendre part à la Coupe du Monde 2022. La majorité des 26 joueurs convoqués sont présents, en attendant l’arrivée des retardataires engagés le week-end dernier avec leurs clubs. Abderrazak Hamdallah en plein effort et Walid Regragui tout sourire en arrière plan. C’est l’image …","content":"L’équipe nationale est arrivée dans la soirée du dimanche à Doha pour prendre part à la Coupe du Monde 2022. La majorité des 26 joueurs convoqués sont présents, en attendant l’arrivée des retardataires engagés le week-end dernier avec leurs clubs. Abderrazak Hamdallah en plein effort et Walid Regragui tout sourire en arrière plan. C’est l’image que la Fédération Royale Marocaine de Football (FRMF) a choisi pour annoncer que l’équipe nationale a pris part à la première séance d’entraînement après son arrivée à Doha dimanche soir, en vue de la Coupe du Monde (20 novembre – 18 décembre). Dans une ambiance détendue, les Lions de l’Atlas ont pris part à une séance de décrassage pour réduire la fatigue due au voyage depuis le Royaume. La FRMF annonce que la majorité des joueurs convoqués ont pris part à la séance, à l’exception des joueurs qui étaient engagés avec leurs clubs le week-end dernier. Ces Lions de l’Atlas, rejoindront le groupe via des vols direct vers le Qatar depuis leurs pays de résidence, affirment nos sources au sein de la fédération. Leurs arrivées sont prévues dans les prochaines heures. A noter que l’équipe nationale s’entraînement quotidiennement avant de s’envoler jeudi vers les Emirats Arabes Unis, où les Lions de l’Atlas affronteront la Géorgie (17h) pour le compte d’un match amical qui fera office d’un dernier test avant leur entrée en lice en Coupe du Monde face à la Croatie le 23 novembre prochain à 11 heures (heure marocaine). La rédaction /Le7tv","pubDate":"2022-11-15 09:57:19","image_url":null,"source_id":"le7tv","country":["morocco"],"category":["sports"],"language":"french"},{"title":"Wales star Aaron Ramsey shows off shock new look for World Cup – but Rangers fans call out something else","link":"https://www.thescottishsun.co.uk/sport/football/9766352/wales-aaron-ramsey-look-world-cup-rangers-fans-hair/","keywords":["Football","Sport","World Cup","World Cup 2022"],"creator":["Jonathon Moar"],"video_url":null,"description":null,"content":"AARON RAMSEY has invoked the spirit of Wales' incredible Euro 2016 run with a shock new look for the World Cup. But it's the spirit of something else that a number of cheeky Rangers fans couldn't resist focusing on as the midfielder's new hairdo was revealed. 3 Ramsey has dyed his hair blond ahead of Qatar 2022 Credit: Getty 3 He sported a similar look during Wales' remarkable run to the Euro 2016 semi-finals Credit: EPA Ramsey is expected to play a key role for Rob Page's men as they return to the World Cup stage for the first time since 1958. It's only the second time in their history that they've qualified for the finals. Having spent so long in the international wilderness, in tournament terms at least, Wales have enjoyed renewed success in the Euros in recent years. Not least in 2016 when they made it all the way to the semi-finals, with Ramsey playing a key role. READ MORE RANGERS STORIES WAR OF WORDS Gers icon Laudrup responds after Gio van Bronckhorst's 'stupid' comments blast MEGA OFFERS Rangers & Celtic best free bets, bonuses and sign-up offers The 31-year old, now playing his trade in France with Nice, famously sported a different look during that tournament. He caught the eye after dyeing his hair bleach blond. It seemed to do the trick too, with Ramsey finishing as the tournament's joint-highest assist provider, also scoring in a 3-0 win over Russia. And it seems he's hoping to tap into the spirit of 2016 again, after dyeing his hair once again ahead of Qatar 2022 . Most read in Football WHY I BLANKED NEV Gary Neville isn't my friend, he uses me for TV fame, says Ronaldo JINKY ANTIQUE Jimmy Johnstone's famous regi plate goes up for sale as fan makes HUGE offer 'He reminds me of Tommy' Ferry lifts lid on career-altering 15-minute chat with Postecoglou FERGIE TIME Barry Ferguson opens shock Gers return door with Van Bronckhorst on the brink After unveiling his new look, Ramsey joked: \"I just fancied a change again - it's falling out so I thought I'd do it now before I can't do it anymore.\" He was asked if he was looking to invoke the spirit of 2016 and he replied: \"Yeah, I think as a team we've carried that on. We're delighted to be here and we're looking forward to that now.\" Wales fans were thrilled to see Ramsey's throwback look. One said: \"Prime Ramsey incoming, time to bring the 2016 performances back.\" However - several Rangers fans commenting on pictures of Ramsey's new look decided to focus on something else entirely. View this post on Instagram A post shared by Cymru 🏴󠁧󠁢󠁷󠁬󠁳󠁿 (@fawales) 3 Ramsey missed a crucial penalty in Rangers' Europa League Final defeat Credit: Willie Vass And it seems many of them aren't yet ready to forget last season's Europa League Final . Ramsey spent the second half of last season on loan at Ibrox. Having arrived to incredible fanfare on transfer deadline day from Juventus, Ramsey's spell in Glasgow didn't really go to plan. Injury woe continually hampered his brief period in Scotland and while he left with a Scottish Cup winners' medal , it's the events of Seville for which he's most widely associated. Ramsey was the only man to miss his spot-kick in the penalty shoot-out defeat against Eintracht Frankfurt, with the Gers losing the Europa League Final in the most cruel of ways. Alongside snaps of Ramsey sporting his new do, Wales said: \"we know what this means.\" And several cheeky Rangers fans couldn't resist responding with their own interpretations! One quipped back: \"Hopefully that you're not on penalty duties?\" Another said: \"Imagine you just scored that penalty...\" A third said: \"Hope you've been practising your penalties.\" Another added: \"Make sure it doesn't go to penalties.\" However, not all Gers fans responding were having a dig. Others wished Ramsey well at the finals with one saying: \"Good luck Rambo, loved your time at Rangers. Hopefully you'll qualify.\" Wales qualified for the finals after negotiating their way through the play-off pathway that had previously included Scotland. Read More on The Sun OH BABY I gave birth five months ago and I absolutely hate motherhood, it's a scam LIST DISS I worked in Primark - we have secret 'blacklist' board in staff room, here's why They're in Group B at Qatar 2022 and will face England, Iran and the United States. It's the Americans up first for Ramsey and company on November 21st in the Ahmad bin Ali Stadium in Al Rayyan. Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-11-15 09:40:17","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Two-time World Cup winner Ashlyn Harris announces retirement from professional football","link":"https://www.irishmirror.ie/sport/soccer/ashlyn-harris-us-football-retirement-28492736","keywords":["Sport"],"creator":["news@irishmirror.ie (Beth Lindop)"],"video_url":null,"description":"Goalkeeper Ashlyn Harris was part of two World Cup winning squads for the U.S. Women's national team and spent 10 seasons in the National Women’s Soccer League","content":"Legendary goalkeeper Ashlyn Harris, who helped the U.S. Women’s national team to two World Cup titles, has announced her retirement from professional football. Harris, 37, has been a prominent figure in the National Women’s Soccer League since its inception in 2012, and has earned 25 senior caps for her country. She first made her mark on the international stage in 2002, at the age of 16, when she registered a host of clean sheets to ensure the U.S. won the U-19 Women's World Championship She also captained her side at the 2004 FIFA U-19 Women’s World Cup in Thailand, playing every minute in goal as the U.S. team finished in third place. Her standout performances in second U.S. women’s pro league, the WPS, helped the Western New York Flash to win the league title in 2011 and prompted the arrival of her first senior international call-up. She consolidated her place in the annals of football history as a member of both the 2015 and 2019 FIFA Women’s World Cup winning squads. Her final match for the USWNT was on January 31, 2020, in an 8-0 win over Panama in Olympic qualifying in Texas. Reflecting on her impressive football career, Harris told ussoccer.com : “It has been my greatest honour to represent this country both on and off the field. I started this journey with U.S. Soccer at the age of 13 and it has shaped me in every part of my life. \"I’m proud of the woman I’ve become, and I can only thank the people who have supported me and lifted me throughout it all. Thank you to all my youth National Team coaches, full National Team coaches, goalkeeper coaches, support staff, and everyone in between.\" “To all my teammates, you have been the driving force to my longevity,\" Harris added. \"This journey has always been about the people for me, so thank you for all the incredible memories and life-long friendships. \"To the fans, thank you from the bottom of my heart. I hope in some small way I’ve impacted your lives the way you all have impacted mine.” During her illustrious club career, Harris played for a host of clubs including Washington Spirit,Orlando Pride and NY/NJ Gotham FC in the NWSL. The 37-year-old also made a huge impact off the pitch, working alongside her wife and fellow World Cup winner, Ali Krieger, to champion equality and advocate for LGBTQ+ rights. NEW! Our Year: European Champions 2022 - The Official England Winners Book With a foreword by England manager Sarina Wiegman, this is the only official book of the historic triumph, reliving every kick of a thrilling tournament and telling the stories of the players who made it all happen. Order from https://reachsportshop.com/book/our-year-european-champion-2022/","pubDate":"2022-11-15 09:39:57","image_url":"https://i2-prod.mirror.co.uk/incoming/article28492284.ece/ALTERNATES/s98/1_GettyImages-1170981596.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Kerry GAA spend almost €850,000 on senior football team on way to All-Ireland win","link":"https://www.irishmirror.ie/sport/gaa/gaelic-football/gaelic-football-news/kerry-gaa-spend-almost-850000-28492579","keywords":["Sport"],"creator":["news@irishmirror.ie (Staff Reporter)"],"video_url":null,"description":"The total spend on Kerry inter-county teams was in the region of €1.45 million with overall profits doubling to an impressive €1 million","content":"Kerry GAA spent almost €850,000 on their senior football team on the way to this year’s All-Ireland triumph. The total spend on Kerry inter-county teams was in the region of €1.45 million with overall profits doubling to an impressive €1 million. Counties don’t often give a breakdown for the spend on individual teams, but back in 2018 Cork spent €1.75 million on their inter-county teams with Dublin and Mayo also crashing through the €1.5 million barrier. Kerry’s big spend was offset by a huge increase in income post Covid with sponsorship rising by over €400,000 to just under €775,000. Royalties from Kerry gear sales rocketed from €133,000 to €547,000 with the release of a new jersey early last year accounting for much of this additional income. Kerry sold 9300 tickets for a ‘Win a House in Killarney’ draw, netting over €285,000. READ NEXT: Get the latest sports headlines straight to your inbox by signing up for free email alerts","pubDate":"2022-11-15 09:39:36","image_url":"https://i2-prod.irishmirror.ie/incoming/article28492708.ece/ALTERNATES/s98/0_kerryPNG.png","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Chelsea star Edouard Mendy ‘considering his future and could leave in transfer exit’ after losing No1 spot","link":"https://www.thescottishsun.co.uk/sport/football/9766656/chelsea-edouard-mendy-considering-future-transfer-exit/","keywords":["Football","Sport","Chelsea transfer news","Premier League"],"creator":["Joshua Mbu"],"video_url":null,"description":null,"content":"CHELSEA star Edouard Mendy is considering his future at Stamford Bridge after losing his No1 spot to Kepa Arrizabalaga, a report claims. The 30-year-old joined the Blues from Rennes in a deal worth £22million in 2020. 1 Mendy is considering his future at Chelsea Credit: Getty Senegal shot-stopper Mendy helped the club win their second-ever Champions League. Chelsea also won the Super Cup, Club World Cup and reached the finals of both domestic cups. However, following Thomas Tuchel's September sacking , Mendy has lost his No1 spot under new boss Graham Potter. And according to the Daily Mail , Mendy is now considering his future at Stamford Bridge. READ MORE IN FOOTBALL QATAR LATEST England squad numbers ANNOUNCED, USA's new logo, Kimpembe out for France Kepa has been performing well in between the sticks and Potter is said to be keen on raiding former club Brighton for Robert Sanchez. Mendy has started Chelsea's most recent three matches, all of which they lost, due to Kepa sustaining a foot injury. Despite this, the keeper does remain hopeful that he can prove he is worthy of reclaiming the top spot. Chelsea are unlikely to sanction a sale in the January transfer window so Mendy may have to wait until the summer to get a move. Most read in Football WHY I BLANKED NEV Gary Neville isn't my friend, he uses me for TV fame, says Ronaldo JINKY ANTIQUE Jimmy Johnstone's famous regi plate goes up for sale as fan makes HUGE offer FERGIE TIME Barry Ferguson opens shock Gers return door with Van Bronckhorst on the brink MVP Rangers star rated most valuable in Scotland as Celtic hero Jota left in 2nd place FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS Talks had been held over an extension of Mendy's contract, but there has been very little movement and his contract expires in 2025. Mendy's focus, for now, is on the World Cup, where he is a guaranteed starter for Senegal. The Africa Cup of Nations champions are contesting Group A, where they will need to edge out two of Holland, Qatar and Ecuador for a place in the knockouts.","pubDate":"2022-11-15 09:34:10","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Rangers won’t catch Celtic in Premiership title race but Gers will keep Giovanni van Bronckhorst predicts Hoops icon","link":"https://www.thescottishsun.co.uk/sport/football/9766242/rangers-celtic-premiership-title-giovanni-van-bronckhorst/","keywords":["Football","Scottish Premiership","Sport","Champions League"],"creator":["Stewart Fisher"],"video_url":null,"description":null,"content":"GIOVANNI van Bronckhorst's Rangers WON'T be able to claw back their nine-point gap on Celtic at the top of the Premiership. But that doesn't mean that the Dutchman will - or even should be - sacked by the Ibrox side. 2 Giovanni van Bronckhorst has had a rough start to the campaign Credit: Willie Vass 2 Van Bronckhorst with first team coaches Dave Makaay, Ceri Bowley and Dave Vos Credit: Willie Vass That's according to former Celtic star Charlie Nicholas , who says the Dutchman has shown \"weakness\" but expects Ibrox bosses to \"show a bit more patience\". That's because he thinks the club's horrendous injury list has to be taken into account - and the boss should be judged when they're back. The Ibrox men are without huge chunks of their first team squad - including summer signings John Souttar and Tom Lawrence. Whether Gers fans would be happy with such a scenario remains to be seen but the Ibrox men still have the chance to return to Champions League football even if they can't overhaul Celtic. Read More In Football WAR OF WORDS Gers icon Laudrup responds after Gio van Bronckhorst's 'stupid' comments blast BLUE BOSS Steven Gerrard backed for shock Rangers return as GVB odds-on to leave in 2023 Nicholas wrote in his Daily Express column: \"Rangers won't catch Celtic in the title race but that shouldn't spell the end for Giovanni van Bronckhorst. \"I think Ibrox chiefs will show a bit more patience. \"Rangers can still get back into the Champions League next season with there being two slots available again. \"I can't see them qualifying automatically by winning the league because at nine points the gap is already too big. Most read in Football WHY I BLANKED NEV Gary Neville isn't my friend, he uses me for TV fame, says Ronaldo JINKY ANTIQUE Jimmy Johnstone's famous regi plate goes up for sale as fan makes HUGE offer FERGIE TIME Barry Ferguson opens shock Gers return door with Van Bronckhorst on the brink MVP Rangers star rated most valuable in Scotland as Celtic hero Jota left in 2nd place \"Van Bronckhorst might get some of his injured players back after the break but I just can't see them catching Celtic. \"I am just not sure he has been forceful with his players as he maybe should have been. \"He also should have been more ruthless with regards to some of the longer serving players. \"Steven Davis isn't the player he was, Scott Arfield looks like he has done a season too far and people know my views on Allan McGregor getting his new deal. \"Rangers had the chance to shake things up, including getting rid of Ryan Kent and Alfredo Morelos because they are the two who have dropped off in terms of form. \"The blame can't be on only the two players but Van Bronckhorst should have sensed the situation and got them out the door. \"The fact he hasn't may be a sign of weakness. \"I have heard people say he is too nice a guy. I don't believe that is an issue because you can be a good guy and a good manager. \"But you would have thought in Van Bronckhorst's time his team would have an identity but it doesn't. It is running on empty and needs rebuilt. \"I accept there have been injuries to a number of key players and that has left the team short and struggling. Read More on The Sun OH BABY I gave birth five months ago and I absolutely hate motherhood, it's a scam LIST DISS I worked in Primark - we have secret 'blacklist' board in staff room, here's why \"Ianis Hagi, Connor Goldson, Ryan Jack, Filip Helander and Kemar Roofe will all be fit. That is just about half a team that starts. \"I think once the manager has a near full-strength squad that is when he really should be judged.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-11-15 09:33:37","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ronaldo: Manchester United owners don’t care about the club","link":"https://thenewsglory.com/ronaldo-manchester-united-owners-dont-care-about-the-club/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"Portuguese star Cristiano Ronaldo said that the owners of Manchester United football club, the Glazers, do not care about the club. Ronaldo, 37, continued his sharp attack on Manchester United, through his statements in an interview with the British channel “Tok TV”. Ronaldo confirmed that he does not speak with the family, which has acquired […]","content":"Portuguese star Cristiano Ronaldo said that the owners of Manchester United football club, the Glazers, do not care about the club. Ronaldo, 37, continued his sharp attack on Manchester United, through his statements in an interview with the British channel “Tok TV”. Ronaldo confirmed that he does not speak with the family, which has acquired the ownership of the club since 2005, noting that the club’s interest is not of great importance to it. “The Glazers, they don’t care about the club,” Ronaldo said. I mean, never mind professional sport, you know, Manchester is a marketing club.” He added, “They will get money from marketing, and as for sports, they don’t really care about it, in my opinion.” Ronaldo continued: «I think the fans should know the truth, they should know that the players want what is best for the club. I want the best for the club. This is why I came to Manchester United.” He added: “That is why I love this club. But there are some things within the club that don’t help Manchester (United) to reach the highest level like (Manchester) City, Liverpool and now Arsenal for example. He added in the statements published by the British news agency “BA Media”: “It is complicated and difficult. I think it will be difficult for Manchester United to be at the top in the next two or three years.” The Portuguese international also spoke about his former colleague, Wayne Rooney, as well as Gary Neville, after they criticized him recently. Ronaldo said: “I don’t understand. You should ask him (Rooney), but I don’t know why he’s criticizing me so badly.” He added, “He ended his professional career in his thirties. I am still playing at a high level. I wouldn’t say I looked better than him, which is a fact. But…”. He continued, “It is difficult to hear this kind of criticism and negative words from people I played with, including for example Gary Neville as well.” Ronaldo added: “People can have their opinions, but they don’t really know what’s going on. They don’t know what is happening for example on the training ground, at Carrington (Manchester United’s training centre) or in my life. They should listen to my point as well. Because it’s easy to criticize, especially when you don’t know the whole story.” Ronaldo added, “They are not my friends.” Ronaldo grabbed the headlines on Sunday night after excerpts from the 90-minute interview were published on Piers Morgan Uncensored. Ronaldo also claimed during the interview that Manchester United is trying to force him to leave the club, and criticized coach Eric Ten Hag, but the Portuguese star has now turned his focus to his international participation as he prepares to compete in the 2022 World Cup in Qatar. The World Cup competitions will open next Sunday, and the Portuguese national team, the European Nations Cup champion (Euro 2016), will compete in Group H with Ghana, Uruguay and South Korea. In a message he sent on social media, accompanied by a photo with his teammates, Ronaldo said: “All the focus is now on working with the national team. A group united towards one goal: to realize the dream of the Portuguese people! Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter LinkedIn Pin interest Whats app","pubDate":"2022-11-15 09:22:28","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Navajyoti Club - FC Green Valley share points in GSA RG Baruah Super Division Football League","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/navajyoti-club-fc-green-valley-share-points-in-gsa-rg-baruah-super-division-football-league-623491","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"FC Green Valley and Navajyoti Club shared points in the GSA RG Baruah Super Division Football League at the Nehru Stadium here today.","content":"Our Sports ReporterGUWAHATI: FC Green Valley and Navajyoti Club shared points in the GSA RG Baruah Super Division Football League at the Nehru Stadium here today. The match between the two sides ended 2-2 draw. Sakirul Ali and Samson Nongrum scored for Green Valley while Mintu Mech and Jhantu Prasad were the scorers for Navajyoti. Tomorrow's match: NFRSC vs Navajyoti Club. Also Read:  Sunrise earn 3 pnts against AP Blues in GSA RG Baruah Super Division Football LeagueAlso watch:","pubDate":"2022-11-15 09:19:53","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/15/412622-footba.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Aussie underdogs to meet France first","link":"https://www.themercury.com.au/sport/football/aussie-underdogs-to-meet-france-first/video/35a4526aca850787802e357a04efa276","keywords":["Football"],"creator":null,"video_url":null,"description":"Football: Australia will go into the World Cup as underdogs but are still confident they can get out of the group stages at Qatar.","content":"Football: Australia will go into the World Cup as underdogs but are still confident they can get out of the group stages at Qatar.","pubDate":"2022-11-15 09:18:19","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Dua Lipa rubbishes World Cup rumours","link":"https://www.couriermail.com.au/sport/football/pop-sensation-dua-lipa-denies-claims-she-is-performing-at-fifa-world-cup/news-story/6e13e9276b5fe58342c119982d17a44a","keywords":["Football","Kayo","Sport news and galleries","World Cup"],"creator":null,"video_url":null,"description":"American pop star Dua Lipa has confirmed she will not be performing at the FIFA World Cup.","content":"The 27-year-old took to Instagram to address speculation that she would be singing at the opening ceremony, The Sun reports.Lipa, who is currently in Australia, told her 87 million followers that she will not be heading to the tournament, and has never been involved in any negotiations to perform there.Watch the world’s best footballers every week with beIN SPORTS on Kayo. LIVE coverage from Bundesliga, Ligue 1, Serie A, Carabao Cup, EFL & SPFL. New to Kayo? Start your free trial now >The singer also slammed Qatar for its human rights record.The World Cup hosts have been scrutinised for their treatment of foreign workers and restrictive social laws.Dua added she will only visit Qatar “when it has fulfilled all the human rights pledges it made” after being awarded the tournament in 2010.She wrote: “There is currently a lot of speculation that I will be performing at the opening ceremony of the World Cup in Qatar.“I will not be performing and nor have I ever been involved in any negotiation to perform.“I will be cheering England on from afar and I look forward to visiting Qatar when it has fulfilled all the human rights pledges it made when it won the right to host the World Cup.“One love, Dua x.”Qatar has denied claims that workers have been exploited.South Korean star Jung Kook, part of the band BTS, is currently the only act confirmed for the opening ceremony.The likes of Calvin Harris, Sean Paul and Diplo are all set to perform at the Fifa Fan festival, which will take place throughout the course of the tournament.Elsewhere, comedian Joe Lycett has said he will shred £10,000 (AU$17,529) cash if David Beckham does not pull out of a deal to be an ambassador for the World Cup.It’s claimed Beckham will earn up £10 million (AU$17,500,000) for doing so.Lycett also vowed to donate $17,529 to charities supporting gay people in football if Beckham cancelled his deal.Dua Lipa postThis article originally appeared on The Sun and was reproduced with permission","pubDate":"2022-11-15 08:53:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ange Postecoglou linked with Japan job - but it's another national team Celtic fans should be more worried about","link":"https://www.scotsman.com/sport/football/celtic/ange-postecoglou-linked-with-japan-job-but-its-another-national-team-celtic-fans-should-be-more-worried-about-3918473","keywords":["Celtic","Football","Sport"],"creator":["Mark Atkinson"],"video_url":null,"description":"The Japanese Football Association is reportedly mulling over Celtic manager Ange Postecoglou as a potential new head coach for the national team.","content":null,"pubDate":"2022-11-15 08:50:41","image_url":"https://www.scotsman.com/webimg/b25lY21zOjkzY2Q0NWJlLTQzMzYtNDNmNi05NzdjLTVhMGM3OTRkNzBhNzo4MWM5ZjkzZi1jMjJkLTQzMjItYmVjZi05MGFlYWI5MWVlZjI=.jpg?width=1200&auto=webp","source_id":"scotsman","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Arsenal and Liverpool interested in Marcus Thuram transfer with Borussia Monchengladbach star’s contract running out","link":"https://www.thescottishsun.co.uk/sport/football/9766338/arsenal-liverpool-marcus-thuram-transfer/","keywords":["Football","Sport","Arsenal transfer news","Borussia Monchengladbach","Liverpool transfer news","Premier League"],"creator":["Joshua Jones"],"video_url":null,"description":null,"content":"ARSENAL and Liverpool are both interested in signing Marcus Thuram in January, according to reports. The Borussia Monchengladbach star's current contract expires at the end of the season. 1 Marcus Thuram is a January transfer target for Arsenal and Liverpool Credit: Getty And according to 90min , the Premier League rivals are hoping to pounce in the New Year to land striker Thuram on a cut-price deal. However, they face competition from Bayern Munich and Inter Milan who have been heavily linked with the 25-year-old Frenchman. Elsewhere, Tottenham are said to have sent scouts to watch Thuram in action - as well as Borussia Dortmund ace Youssoufa Moukoko - as they search for an extra attacker. Both Arsenal and Liverpool spent big money to bring in new forwards in the summer, landing Gabriel Jesus and Darwin Nunez respectively. READ MORE ON FOOTBALL QATAR LATEST England squad numbers ANNOUNCED, USA's new logo, Kimpembe out for France However, Mikel Arteta and Jurgen Klopp are keen to bolster their squads when the transfer window reopens. Arsenal sit top of the tree at Christmas thanks to their stunning start to the campaign, winning 12 of their 14 matches to move five points clear . Now in a genuine title race, the Gunners board are prepared to back their manager to give their side the best chance of going all the way. Arteta knows an injury to Jesus could derail their season - so an extra centre forward could be a smart move. Most read in Football WHY I BLANKED NEV Gary Neville isn't my friend, he uses me for TV fame, says Ronaldo JINKY ANTIQUE Jimmy Johnstone's famous regi plate goes up for sale as fan makes HUGE offer FERGIE TIME Barry Ferguson opens shock Gers return door with Van Bronckhorst on the brink 'READ THE ROOM' Fans all say the same thing as Rangers sell memorabilia from 7-1 thrashing FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS Liverpool , meanwhile, have severely underperformed so far this term, already losing four matches and a whopping 15 points adrift of leaders Arsenal and seven off the top four. Thuram , son of French World Cup winner Lilian, primarily plays up front for Gladbach but the 6ft 4ins star can also play out wide. His current market value stands at around £26million - helped by a whopping 13 goals in 17 appearances this term. That return saw him named as the 26th player in France's squad heading to Qatar 2022.","pubDate":"2022-11-15 08:48:49","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"}]}