{"newsArray":[{"title":"Ουγγαρία-Ελλάδα 1-0: Φιλική ήττα για την Εθνική Γυναικών","link":"https://www.gazzetta.gr/football/podosfairo-gynaikon/2238286/oyggaria-ellada-1-0-filiki-itta-gia-tin-ethniki-gynaikon","keywords":["Ποδόσφαιρο","Ελλάδα","Newsroom","Ποδόσφαιρο Γυναικών","Women Sports"],"creator":null,"video_url":null,"description":"Η Εθνική γυναικών ηττήθηκε με 1-0 από την Ουγγαρία στο πρώτο της φιλικό επί Ουγγρικού εδάφους.","content":"Φιλική ήττα με 1-0 υπέστη η Εθνική Γυναικών από την Ουγγαρία σε παιχνίδι που διεξήχθη στη Boszik Arena της Βουδαπέστης. Η Εθνική τα πήγε αρκετά καλά σε αυτό το τεστ, αλλά της έλειψε το γκολ, το οποίο οι Μαγυάρες βρήκαν από μια στημένη φάση με την Τουράνι (70΄) και πήραν τη νίκη. Η ενδεκάδα της Εθνικής: Γιαννακούλη, Κακαμπούκη, Σιδηρά, Μάρκου, Σαρρή, Σπυριδωνίδου, Καραπέτσα, Χαμαλίδου, Μωραϊτου, Χαλατσογιάννη, Κόγγουλη Επόμενο φιλικό με τη Βοσνία-Ερζεγοβίνη (15/07, 12:00) και πάλι στη Βουδαπέστη.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Μέσι: Υπογράφει σήμερα και προπονείται για πρώτη φορά με την Ίντερ Μαϊάμι","link":"https://www.gazzetta.gr/football/mls/2238296/mesi-ypografei-simera-kai-proponeitai-gia-proti-fora-me-tin-inter-maiami","keywords":["Ποδόσφαιρο","Λιονέλ Μέσι","Μεταγραφές","Newsroom","MLS","Ίντερ Μαϊάμι"],"creator":null,"video_url":null,"description":"Ο Λιονέλ Μέσι αναμένεται να υπογράψει σήμερα το συμβόλαιό του και ύστερα να κάνει την πρώτη του προπόνηση με την Ίντερ Μαϊάμι.","content":"Η ώρα του ντεμπούτο του Λιονέλ Μέσι με την φανέλα της Ίντερ Μαϊάμι πλησιάζει έτι περισσότερο, με την προσμονή των αμερικανών φιλάθλων της ομάδας να είναι τεράστια . Την Πέμπτη αναμένεται ο Αργεντινός σούπερ σταρ να υπογράψει το συμβόλαιό του με την Ίντερ Μαϊάμι και στην συνέχεια να κάνει την πρώτη του προπόνηση με την αμερικανική ομάδα σύμφωνα με τον συμπατριώτη του ρεπόρτερ, Γκαστόν Εντούλ . Ο ίδιος μάλιστα αποκάλυψε πως η παρουσίασή του είναι προγραμματισμένη για την Κυριακή (16/07) στις 19.00 στην Αργεντινή. Μάλιστα ανέφερε πως ο Σέρχιο Μπουσκέτς θα φτάσει εκεί το Σάββατο (15/07) ενώ η μεταγραφή του Ζόρντι Άλμπα δεν έχει τελειώσει, αφού γίνονται ακόμα διαπραγματεύσεις.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Το βίντεο από την πρώτη προπόνηση του Τόνι Βιλένα με το «τριφύλλι»","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238281/panathinaikos-binteo-apo-tin-proti-proponisi-toy-toni-bilena","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναθηναϊκός","Σωτήρης Μυκονίου","Τόνι Βιλένα"],"creator":null,"video_url":null,"description":"Ο Τόνι Βιλένα έκανε την πρώτη του προπόνηση στα πράσινα αφότου έλαβε το συνηθισμένο καλωσόρισμα από τους συμπαίκτες του.","content":"Ο Τόνι Βιλένα έκανε την πρώτη του προπόνηση με τον Παναθηναϊκό το απόγευμα της Τετάρτης (12/07) και ο φακός του PAO TV κατέγραψε τις καλύτερες στιγμές του. Ο 28χρονος Ολλανδός μέσος δέχθηκε το «θεσμοθετημένο» πλέον.. φατούρο με το οποίο ο Ιβάν Γιοβάνοβιτς και οι παίκτες του καλωσορίζουν όλα τα νέα μέλη της ομάδας και στην συνέχεια πάτησε για πρώτη φορά το χορτάρι του «Γ.Καλαφάτης», ώστε να κάνει την πρώτη του προπόνηση με την ομάδα. Δείτε το βίντεο με τις καλύτερες στιγμές του Τόνι Βιλένα:","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"ΠΑΟΚ-Μεταγραφές: Το Σάββατο στη Θεσσαλονίκη ο Μπουανά Σαμάτα","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238282/paok-metagrafes-sabbato-sti-thessaloniki-o-mpoyana-samata","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Σταύρος Σουντουλίδης","ΠΑΟΚ","Αλί Σαμάτα"],"creator":null,"video_url":null,"description":"Το μεσημέρι του Σαββάτου (15/7) στις 14.45 αναμένεται να φτάσει στη Θεσσαλονίκη το τελευταίο μεταγραφικό απόκτημα του ΠΑΟΚ, ο Τανζανός επιθετικός Μπουανά Σαμάτα.","content":"Παρά την έντονη φημολογία που αναπτύχθηκε, κυρίως από την Τουρκία , αναφορικά με την παρουσία του Μπουανά Σαμάτα σήμερα στη Θεσσαλονίκη, ο Τανζανός επιθετικός αναμένεται να ταξιδέψει το Σάββατο (15/7) στην Ελλάδα για λογαριασμό του ΠΑΟΚ . Η άφιξη του στη Θεσσαλονίκη έχει προγραμματιστεί να γίνει στις 14.45 το μεσημέρι του Σαββάτου, κάτι που σημαίνει ότι δεν πρόκειται να βρεθεί στην Ολλανδία και το βασικό στάδιο της προετοιμασίας. Ο 30χρονος επιθετικός θα περάσει από τις απαραίτητες ιατρικές εξετάσεις και στη συνέχεια θα υπογράψει το συμβόλαιο συνεργασίας με τον «Δικέφαλο» για τα επόμενα δύο συν ένα χρόνια.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Κυκλοφορούν την Παρασκευή τα εισιτήρια με την Χάποελ Μπερ Σεβά","link":"https://www.gazzetta.gr/football/diethni-filika/2238287/panathinaikos-kykloforoyn-tin-paraskeyi-ta-eisitiria-me-tin-hapoel","keywords":["Ποδόσφαιρο","Παναθηναϊκός","Διεθνή Φιλικά","φιλικό","Σωτήρης Μυκονίου"],"creator":null,"video_url":null,"description":"Την Παρασκευή θα τεθούν στην διάθεση του κοινού προς πώληση τα εισιτήρια για το φιλικό αγώνα του Παναθηναϊκού με την Χάποελ Μπερ Σεβά στην Λεωφόρο.","content":"Την ημέρα του αγώνα, δηλαδή την Παρασκευή (13/07), θα μπορέσουν οι φίλοι του Παναθηναϊκού να προμηθευτούν τα εισιτήριά τους για το φιλικό παιχνίδι με την Χάποελ Μπερ Σεβά, που θα γίνει στην Λεωφόρο. Η διάθεσή τους θα γίνει ηλεκτρονικά. Υπενθυμίζουμε πως το παιχνίδι διεξάγεται στις 22:00, αφού υπήρξε αλλαγή στην ώρα έναρξής τους εξαιτίας του καύσωνα που θα υπάρχει εκείνες τις μέρες λόγω του φαινομένου «Κλέων».","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Man United: Harry Maguire's property firm made £1.5m profit between 2021 and 2022","link":"https://www.dailymail.co.uk/sport/football/article-12294851/Man-United-Harry-Maguires-property-firm-1-5m-profit-2021-2022.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"While Maguire has had difficulties in his playing career, the business side of his life has been been flourishing after the latest figures from his firm's balance sheet were revealed this week.","content":"Harry Maguire's property business made £1.5m in year-on-year profit between 2021 and 2022 with the out of favour Manchester United captain flourishing off the pitch Harry Maguire's property firm made £1.5m in profit across 2021-2022 The Manchester United star has struggled on the pitch at Old Trafford of late But he has been a success off of it with his HM 5 Limited group flourishing By Oli Gamp For Mailonline Updated: 13:24, 13 July 2023 e-mail View comments Manchester United star Harry Maguire may be struggling on the pitch - but off it his property firm made £1.5million in profit in 2021-2022, figures show. The England defender is facing an uncertain future at Old Trafford after falling out of favour under manager Erik ten Hag - and he is now being linked with a move away from the club four years on from his £80m move from Leicester City . But while he has had difficulties in his playing career, the business side of his life has been been flourishing after the latest figures from his firm's balance sheet were revealed on Companies House. HM 5 Limited - of which Maguire is a director alongside his mother Zoe - boasted earnings of £3,835,787 in 2021, which then increased to £5,330,464 the following year in 2022. Maguire's company has enjoyed a significant increase in profits and success - having earned £450,000 in its first financial statement in 2019, just after he had completed his fairytale move to United. Harry Maguire faces an uncertain future at Old Trafford after falling out of favour last season Maguire is set to have the captaincy taken away from him by Erik ten Hag with Bruno Fernandes the likely replacement The 30-year-old - who earns £190,0000-a-week at Old Trafford remains United's club captain but could soon lose the armband with Ten Hag set to decide on the permanent skipper for the 2023-24 campaign. After Maguire found himself behind Lisandro Martinez, Raphael Varane, Victor Lindelof and even Luke Shaw in the pecking order last season, Bruno Fernandes took the leadership for the rest of the campaign. Ten Hag has quashed speculation that the decision on the next skipper could be decided by a dressing room vote, similar to the approach adopted by other clubs. Maguire is widely expected to end his four-year stay at Old Trafford this summer 'No, I don't let the dressing room vote,' the Dutch manager said. 'It is up to me.' Having started only 16 games last term, as revealed by Mail Sport last month, Maguire s now one of several players up for sale this summer . Manchester Evening News report that United have slapped a £50m price tag on Maguire - a figure which is expected to make interested parties baulk. The England international has two years left on his current contract, but it is thought the club are ready to let him go this summer. The leading candidates for the role of United captain are Fernandes and Varane, who led the side out in the first pre-season game against Leeds on Wednesday . Maguire still has two years left to run on their deal - but is due a £10m payout if he does secure an exit, as exclusively revealed by Mail Sport. England manager Gareth Southgate warned in May that Maguire's lack of first-team football at United cannot 'continue forever' if he wants to hold down an international place. Share or comment on this article: Man United: Harry Maguire's property firm made £1.5m profit between 2021 and 2022 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 12:24:24","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/13/73172105-0-image-a-47_1689250813174.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AIFF Technical Committee Recommends Head Coaches for Senior Women’s and U-16 Men’s Teams","link":"https://www.latestly.com/sports/football/aiff-technical-committee-recommends-head-coaches-for-senior-womens-and-u-16-mens-teams-5263219.html","keywords":null,"creator":null,"video_url":null,"description":"The Technical Committee of the All India Football Federation (AIFF) has recommended the names of Anthony Andrews and Ishfaq Ahmed as head coaches of the senior women's and U-16 men's teams respectively. The committee met virtually on Thursday to discuss the appointment of the coaching staff of the India senior women's and U-16 Men's national teams.","content":"The Technical Committee of the All India Football Federation (AIFF) has recommended the names of Anthony Andrews and Ishfaq Ahmed as head coaches of the senior women's and U-16 men's teams respectively. The committee met virtually on Thursday to discuss the appointment of the coaching staff of the India senior women's and U-16 Men's national teams. The meeting was held under the chairmanship of I.M. Vijayan. Present at the meeting were the technical director of the AIFF, Shabir Pasha along with committee members Pinky Bompal Magar, Climax Lawrence, Arun Malhotra, Harjinder Singh, and Eugeneson Lyngdoh. Ten International Goals Sunil Chhetri Remembers Most, Indian Football Team Captain Takes A Trip Down Memory Lane The Committee, after having a long discussion on appointing the head coach of the senior women's national team, decided to recommend Anthony Andrews for the coveted post, the AIFF release said. After meticulously deliberating on the applications from the various candidates, the Committee also recommended the three core coaching staff that will take the U-16 Men's team forward. Ishfaq Ahmed was unanimously recommended for the appointment of the head coach of the U-16 Men's national team. Rajan Mani and Feroz Sharif have been appointed assistant coach and goalkeeper coach, respectively, at the U-16 national team. Sunil Chhetri Opens Up on His Conversations With Virat Kohli, Says ‘He Understands That Not Everyone Can Understand What We Are Going Through’ \"This is a new beginning for the India Senior Women's and U-16 national teams, and I am sure they will be in able hands, and the coaches we have recommended will do a fine job in taking their respective teams forward. \"The senior women will be playing the all-important AFC Olympic Qualifiers Round 2 from October 26 to November 1, while the U-16s have an assignment in hand in the SAFF U-16 Championship to be played in Bhutan from September 1 to 11. I am sure the teams will perform to the level which will make us feel proud,\" Committee Chairman Vijayan said after the meeting. (The above story first appeared on LatestLY on Jul 13, 2023 05:52 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-13 12:22:03","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Άρης μεταγραφές: Οριστική συμφωνία του Άρη με τον Λορέν Μορόν για δύο χρόνια","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238277/aris-metagrafes-oristiki-symfonia-toy-ari-me-ton-loren-moron","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Βασίλης Βλαχόπουλος","Άρης","Μεταγραφές"],"creator":null,"video_url":null,"description":"Ο Άρης ολοκλήρωσε μια σημαντική μεταγραφή καθώς είναι οριστική η συμφωνία του με τον Λορέν Μορόν για συμβόλαιο διάρκειας δύο χρόνων.","content":"Ο Άρης είχε ξεχωρίσει την περίπτωση του Λορέν Μορόν από τη λίστα των επιθετικών που είχε στη διάθεσή του με την εκτίμηση ότι ο 29χρονος Ισπανός επιθετικός ταιριάζει περισσότερο στη φιλοσοφία της ομάδας και κυρίως στο στιλ παιχνιδιού που θέλουν να παίξουν οι «κίτρινοι» την περασμένη αγωνιστική περίοδο. Οι Θεσσαλονικείς επένδυσαν στην πρόταση που του κατέθεσαν, στην προοπτική που του πρόσφεραν για να κάνει rebranding της καριέρας του αλλά και στη δεδομένη αποχώρησή του από την Μπέτις καθώς γνώριζαν ότι δεν συμπεριλαμβάνεται στο σχέδιο του Μανουέλ Πελεγκρίνι . Αυτό επιβεβαιώθηκε και την περασμένη αγωνιστική περίοδο όπου ο περιορισμένος αριθμός εμφανίσεών του με την Μπέτις τον οδήγησε στον δανεισμό του στη Λας Πάλμας στα μέσα της χρονιάς. Ωστόσο, έχοντας προχωρήσει τις επαφές μαζί του και νιώθοντας ότι ο παίκτης είχε επιλέξει τον Άρη για τον επόμενο σταθμό της καριέρας του, ουσιαστικά δοκιμάστηκαν και οι αντοχές τους καθώς στο τελευταίο διάστημα ο παίκτης βρέθηκε σε διαπραγματεύσεις με την Μπέτις για τη λύση του συμβολαίου του. Αυτή η υπόθεση δεν ήταν καθόλου εύκολη καθώς το συνολικό ύψος αυτού ήταν περί των 2 εκατ. ευρώ . Ο Άρης κάλυπτε περίπου τα 750.000 ευρώ . Τελικώς, η λύση βρέθηκε και η συμφωνία του Άρη με τον ποδοσφαιριστή είναι δεδομένη . Προβλέπει διετές συμβόλαιο και απομένει να οριστεί η ημέρα άφιξής του στη Θεσσαλονίκη. Αναμφίβολα πρόκειται για μια σπουδαία μεταγραφική κίνηση, το Gazzetta σκιαγράφησε εξάλλου το προφίλ του Λορέν Μορόν , καθώς πρόκειται για επιθετικό επιπέδου La Liga ο οποίος χρειάστηκε πρόπερσι να αγωνιστεί στην Εσπανιόλ (μέτρησε 25 συμμετοχές και τέσσερα γκολ σε Πρωτάθλημα και Κύπελλο) καθώς έχασε τη θέση του από την Μπέτις από την ημέρα που ανέλαβε την τεχνική ηγεσία ο Μανουέλ Πελεγκρίνι. Ωστόσο, η Μπέτις είναι ο σταθμός της ζωής του με αφετηρία εκείνον τον Γενάρη του 2015 όταν απέκτησε τα δικαιώματά του κι έπειτα σειρά ετών στη Μαρμπέγια. Στην πρώτη ομάδα της Μπέτις έχει αγωνιστεί σε 133 παιχνίδια με 29 γκολ και επτά ασίστ και κορυφαία σεζόν του αυτή του 2019-20 όπου μέτρησε 39 αγώνες με 12 γκολ και τρεις ασίστ. Μάλιστα, στο μεγαλύτερο μέρος εκείνης της χρονιάς ήταν στους κορυφαίους σκόρερ της LaLiga μαζί με τους Καρίμ Μπενζεμά, Τζεράρντ Μορένο . Οι επιδόσεις του προκάλεσαν… θύελλα μεταγραφικών σεναρίων. Κατά τη Daily Mail , Λοκομοτίβ Μόσχας και Μπορντό ενδιαφέρθηκαν γι’ αυτόν ενώ Κάρντιφ και Γουέστ Μπρομ κατέθεσαν προσφορές 9 εκατ. ευρώ. Το στοιχείο που τον έκανε να ξεχωρίσει ήταν η αποτελεσματικότητά του καθώς – κατά τους Ισπανούς – ο Μορόν σημείωσε τα πρώτα έξι γκολ σε σύνολο 10 τελικών προσπαθειών και ο Καρίμ Μπενζεμά σε 23! Μάλιστα, στα μέσα αυτής της σεζόν τα ισπανικά media τον κατέταξαν στους μεταγραφικούς στόχους της Μπαρτσελόνα και για την ακρίβεια επικράτησε σιγουριά για τη μετακόμισή του στη Βαρκελώνη. Στην πραγματικότητα όμως, αυτή η μεταγραφή ήταν αδύνατο να πραγματοποιηθεί καθώς η ρήτρα του συμβολαίου του προέβλεπε το ποσό των 60 εκατ. ευρώ και η Μπαρτσελόνα ήδη βρισκόταν σε καθεστώς επιτήρησης από τις ισπανικές αρχές λόγω των αλόγιστων δαπανών της και των χρεών της.","pubDate":"2023-07-13 12:21:27","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Ο Λουκ Στιλ φόρεσε τη νέα φανέλα του «τριφυλλιού»","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238274/panathinaikos-o-loyk-stil-forese-ti-nea-fanela-toy","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναθηναϊκός","Σωτήρης Μυκονίου"],"creator":null,"video_url":null,"description":"Ο Παναθηναϊκος έκανε δώρο τη νέα του φανέλα στον Λουκ Στιλ κι εκείνος τον ευχαρίστησε αναρτώντας στα Instagram του ένα βίντεο που την δοκιμάζει και ποζάρει μ' αυτή.","content":"Ο Λουκ Στιλ δέχθηκε ένα αναπάντεχο δώρο, αφού η ΠΑΕ Παναθηναϊκός του έστειλε την καινούργια φανέλα της ομάδας. Εκείνος δεν έχασε ευκαιρία κι ανέβασε βίντεο που κάνει unboxing, φοράει την φανέλα και στην συνέχεια ποζάρει μ' αυτή όλο χαμόγελο ακουμπώντας με το χέρι του το τριφύλλι. Στην ανάρτησή του ο 38χρονος Άγγλος τερματοφύλακας, που αγωνίστηκε στους «πράσινους» την τριετία 2014-2017, έγραψε: «Ένα υπέροχο δώρο από την ΠΑΕ Παναθηναϊκός, ευχαριστώ τόσο πολύ και καλή τύχη στη νέα σεζόν... Οι νέες εμφανίσεις είναι υπέροχες και σίγουρα θα έρθω σε ένα παιχνίδι σύντομα». Υπενθυμίζουμε πως έχει σταματήσει το ποδόσφαιρο και από τον Φλεβάρη που πέρασε ξεκίνησε να εργάζεται ως προπονητής στην Πέτερμπ Σπορτς , ομάδα της έκτης κατηγορίας στην Αγγλία. Δείτε το βίντεο του Λουκ Στιλ με τη νέα πράσινη φανέλα:","pubDate":"2023-07-13 12:14:02","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m","link":"https://www.dailymail.co.uk/sport/football/article-12295135/Aston-Villa-offered-chance-sign-AC-Milan-flop-Charles-Ketelaere-25m.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere less than a year after the Belgian joined the Serie A club.","content":"Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m less than a year after the 22-year-old joined the Serie A club Aston Villa have been offered the chance to sign AC Milan's Charles De Ketelaere De Ketelaere is among a number of players who will be allowed to leave the club The 22-year-old is thought to be available for about £25million this summer By Tom Collomosse For Mailonline Updated: 08:09 EDT, 13 July 2023 e-mail View comments Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere less than a year after the Belgian joined the Serie A club. De Ketelaere is among a number of players who will be allowed to leave Italian football this summer as clubs look to balance their books and the 22-year-old is thought to be available for about £25million. But Milan may have to reduce their demands in order to attract serious interest. De Ketelaere was their marquee signing last summer, costing close to £35m from Club Brugge, but had a dire debut season. He started only 13 games and failed to score. After completing the signings of midfielder Youri Tielemans and defender Pau Torres, Villa boss Unai Emery and transfer chief Monchi are now focusing on improving their attack, with a wide man and a forward high on their list. The club are pondering an opening bid for Bayer Leverkusen star Moussa Diaby, who is valued at about £50m by the Bundesliga club, and may follow up initial interest in Barcelona’s Ferran Torres or unwanted Atletico Madrid attacker Joao Felix, who spent the second half of last season on loan at Chelsea. Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere (above) The 22-year-old Belgium international is thought to be available for about £25m this summer Yet all three players would prefer ideally to be competing in the Champions League next season. While that is Villa’s long-term ambition, next term they will be in the Conference League – a fine achievement as they were in relegation trouble when Emery arrived, but not a competition to set top players’ pulses racing. Villa will also look to move on some of their fringe players with Leander Dendoncker and Leon Bailey among those understood to be available. There may also be question marks over the long-term future of Lucas Digne, signed by former boss Steven Gerrard in January 2022 but now second choice behind Alex Moreno at left-back. Share or comment on this article: Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 11:59:11","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/12/73172117-0-image-a-59_1689249482855.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ουγγαρία-Ελλάδα 1-0: Φιλική ήττα για την Εθνική Γυναικών","link":"https://www.gazzetta.gr/football/podosfairo-gynaikon/2238286/oyggaria-ellada-1-0-filiki-itta-gia-tin-ethniki-gynaikon","keywords":["Ποδόσφαιρο","Ελλάδα","Newsroom","Ποδόσφαιρο Γυναικών","Women Sports"],"creator":null,"video_url":null,"description":"Η Εθνική γυναικών ηττήθηκε με 1-0 από την Ουγγαρία στο πρώτο της φιλικό επί Ουγγρικού εδάφους.","content":"Φιλική ήττα με 1-0 υπέστη η Εθνική Γυναικών από την Ουγγαρία σε παιχνίδι που διεξήχθη στη Boszik Arena της Βουδαπέστης. Η Εθνική τα πήγε αρκετά καλά σε αυτό το τεστ, αλλά της έλειψε το γκολ, το οποίο οι Μαγυάρες βρήκαν από μια στημένη φάση με την Τουράνι (70΄) και πήραν τη νίκη. Η ενδεκάδα της Εθνικής: Γιαννακούλη, Κακαμπούκη, Σιδηρά, Μάρκου, Σαρρή, Σπυριδωνίδου, Καραπέτσα, Χαμαλίδου, Μωραϊτου, Χαλατσογιάννη, Κόγγουλη Επόμενο φιλικό με τη Βοσνία-Ερζεγοβίνη (15/07, 12:00) και πάλι στη Βουδαπέστη.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Μέσι: Υπογράφει σήμερα και προπονείται για πρώτη φορά με την Ίντερ Μαϊάμι","link":"https://www.gazzetta.gr/football/mls/2238296/mesi-ypografei-simera-kai-proponeitai-gia-proti-fora-me-tin-inter-maiami","keywords":["Ποδόσφαιρο","Λιονέλ Μέσι","Μεταγραφές","Newsroom","MLS","Ίντερ Μαϊάμι"],"creator":null,"video_url":null,"description":"Ο Λιονέλ Μέσι αναμένεται να υπογράψει σήμερα το συμβόλαιό του και ύστερα να κάνει την πρώτη του προπόνηση με την Ίντερ Μαϊάμι.","content":"Η ώρα του ντεμπούτο του Λιονέλ Μέσι με την φανέλα της Ίντερ Μαϊάμι πλησιάζει έτι περισσότερο, με την προσμονή των αμερικανών φιλάθλων της ομάδας να είναι τεράστια . Την Πέμπτη αναμένεται ο Αργεντινός σούπερ σταρ να υπογράψει το συμβόλαιό του με την Ίντερ Μαϊάμι και στην συνέχεια να κάνει την πρώτη του προπόνηση με την αμερικανική ομάδα σύμφωνα με τον συμπατριώτη του ρεπόρτερ, Γκαστόν Εντούλ . Ο ίδιος μάλιστα αποκάλυψε πως η παρουσίασή του είναι προγραμματισμένη για την Κυριακή (16/07) στις 19.00 στην Αργεντινή. Μάλιστα ανέφερε πως ο Σέρχιο Μπουσκέτς θα φτάσει εκεί το Σάββατο (15/07) ενώ η μεταγραφή του Ζόρντι Άλμπα δεν έχει τελειώσει, αφού γίνονται ακόμα διαπραγματεύσεις.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Το βίντεο από την πρώτη προπόνηση του Τόνι Βιλένα με το «τριφύλλι»","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238281/panathinaikos-binteo-apo-tin-proti-proponisi-toy-toni-bilena","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναθηναϊκός","Σωτήρης Μυκονίου","Τόνι Βιλένα"],"creator":null,"video_url":null,"description":"Ο Τόνι Βιλένα έκανε την πρώτη του προπόνηση στα πράσινα αφότου έλαβε το συνηθισμένο καλωσόρισμα από τους συμπαίκτες του.","content":"Ο Τόνι Βιλένα έκανε την πρώτη του προπόνηση με τον Παναθηναϊκό το απόγευμα της Τετάρτης (12/07) και ο φακός του PAO TV κατέγραψε τις καλύτερες στιγμές του. Ο 28χρονος Ολλανδός μέσος δέχθηκε το «θεσμοθετημένο» πλέον.. φατούρο με το οποίο ο Ιβάν Γιοβάνοβιτς και οι παίκτες του καλωσορίζουν όλα τα νέα μέλη της ομάδας και στην συνέχεια πάτησε για πρώτη φορά το χορτάρι του «Γ.Καλαφάτης», ώστε να κάνει την πρώτη του προπόνηση με την ομάδα. Δείτε το βίντεο με τις καλύτερες στιγμές του Τόνι Βιλένα:","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"ΠΑΟΚ-Μεταγραφές: Το Σάββατο στη Θεσσαλονίκη ο Μπουανά Σαμάτα","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238282/paok-metagrafes-sabbato-sti-thessaloniki-o-mpoyana-samata","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Σταύρος Σουντουλίδης","ΠΑΟΚ","Αλί Σαμάτα"],"creator":null,"video_url":null,"description":"Το μεσημέρι του Σαββάτου (15/7) στις 14.45 αναμένεται να φτάσει στη Θεσσαλονίκη το τελευταίο μεταγραφικό απόκτημα του ΠΑΟΚ, ο Τανζανός επιθετικός Μπουανά Σαμάτα.","content":"Παρά την έντονη φημολογία που αναπτύχθηκε, κυρίως από την Τουρκία , αναφορικά με την παρουσία του Μπουανά Σαμάτα σήμερα στη Θεσσαλονίκη, ο Τανζανός επιθετικός αναμένεται να ταξιδέψει το Σάββατο (15/7) στην Ελλάδα για λογαριασμό του ΠΑΟΚ . Η άφιξη του στη Θεσσαλονίκη έχει προγραμματιστεί να γίνει στις 14.45 το μεσημέρι του Σαββάτου, κάτι που σημαίνει ότι δεν πρόκειται να βρεθεί στην Ολλανδία και το βασικό στάδιο της προετοιμασίας. Ο 30χρονος επιθετικός θα περάσει από τις απαραίτητες ιατρικές εξετάσεις και στη συνέχεια θα υπογράψει το συμβόλαιο συνεργασίας με τον «Δικέφαλο» για τα επόμενα δύο συν ένα χρόνια.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Κυκλοφορούν την Παρασκευή τα εισιτήρια με την Χάποελ Μπερ Σεβά","link":"https://www.gazzetta.gr/football/diethni-filika/2238287/panathinaikos-kykloforoyn-tin-paraskeyi-ta-eisitiria-me-tin-hapoel","keywords":["Ποδόσφαιρο","Παναθηναϊκός","Διεθνή Φιλικά","φιλικό","Σωτήρης Μυκονίου"],"creator":null,"video_url":null,"description":"Την Παρασκευή θα τεθούν στην διάθεση του κοινού προς πώληση τα εισιτήρια για το φιλικό αγώνα του Παναθηναϊκού με την Χάποελ Μπερ Σεβά στην Λεωφόρο.","content":"Την ημέρα του αγώνα, δηλαδή την Παρασκευή (13/07), θα μπορέσουν οι φίλοι του Παναθηναϊκού να προμηθευτούν τα εισιτήριά τους για το φιλικό παιχνίδι με την Χάποελ Μπερ Σεβά, που θα γίνει στην Λεωφόρο. Η διάθεσή τους θα γίνει ηλεκτρονικά. Υπενθυμίζουμε πως το παιχνίδι διεξάγεται στις 22:00, αφού υπήρξε αλλαγή στην ώρα έναρξής τους εξαιτίας του καύσωνα που θα υπάρχει εκείνες τις μέρες λόγω του φαινομένου «Κλέων».","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Man United: Harry Maguire's property firm made £1.5m profit between 2021 and 2022","link":"https://www.dailymail.co.uk/sport/football/article-12294851/Man-United-Harry-Maguires-property-firm-1-5m-profit-2021-2022.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"While Maguire has had difficulties in his playing career, the business side of his life has been been flourishing after the latest figures from his firm's balance sheet were revealed this week.","content":"Harry Maguire's property business made £1.5m in year-on-year profit between 2021 and 2022 with the out of favour Manchester United captain flourishing off the pitch Harry Maguire's property firm made £1.5m in profit across 2021-2022 The Manchester United star has struggled on the pitch at Old Trafford of late But he has been a success off of it with his HM 5 Limited group flourishing By Oli Gamp For Mailonline Updated: 13:24, 13 July 2023 e-mail View comments Manchester United star Harry Maguire may be struggling on the pitch - but off it his property firm made £1.5million in profit in 2021-2022, figures show. The England defender is facing an uncertain future at Old Trafford after falling out of favour under manager Erik ten Hag - and he is now being linked with a move away from the club four years on from his £80m move from Leicester City . But while he has had difficulties in his playing career, the business side of his life has been been flourishing after the latest figures from his firm's balance sheet were revealed on Companies House. HM 5 Limited - of which Maguire is a director alongside his mother Zoe - boasted earnings of £3,835,787 in 2021, which then increased to £5,330,464 the following year in 2022. Maguire's company has enjoyed a significant increase in profits and success - having earned £450,000 in its first financial statement in 2019, just after he had completed his fairytale move to United. Harry Maguire faces an uncertain future at Old Trafford after falling out of favour last season Maguire is set to have the captaincy taken away from him by Erik ten Hag with Bruno Fernandes the likely replacement The 30-year-old - who earns £190,0000-a-week at Old Trafford remains United's club captain but could soon lose the armband with Ten Hag set to decide on the permanent skipper for the 2023-24 campaign. After Maguire found himself behind Lisandro Martinez, Raphael Varane, Victor Lindelof and even Luke Shaw in the pecking order last season, Bruno Fernandes took the leadership for the rest of the campaign. Ten Hag has quashed speculation that the decision on the next skipper could be decided by a dressing room vote, similar to the approach adopted by other clubs. Maguire is widely expected to end his four-year stay at Old Trafford this summer 'No, I don't let the dressing room vote,' the Dutch manager said. 'It is up to me.' Having started only 16 games last term, as revealed by Mail Sport last month, Maguire s now one of several players up for sale this summer . Manchester Evening News report that United have slapped a £50m price tag on Maguire - a figure which is expected to make interested parties baulk. The England international has two years left on his current contract, but it is thought the club are ready to let him go this summer. The leading candidates for the role of United captain are Fernandes and Varane, who led the side out in the first pre-season game against Leeds on Wednesday . Maguire still has two years left to run on their deal - but is due a £10m payout if he does secure an exit, as exclusively revealed by Mail Sport. England manager Gareth Southgate warned in May that Maguire's lack of first-team football at United cannot 'continue forever' if he wants to hold down an international place. Share or comment on this article: Man United: Harry Maguire's property firm made £1.5m profit between 2021 and 2022 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 12:24:24","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/13/73172105-0-image-a-47_1689250813174.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AIFF Technical Committee Recommends Head Coaches for Senior Women’s and U-16 Men’s Teams","link":"https://www.latestly.com/sports/football/aiff-technical-committee-recommends-head-coaches-for-senior-womens-and-u-16-mens-teams-5263219.html","keywords":null,"creator":null,"video_url":null,"description":"The Technical Committee of the All India Football Federation (AIFF) has recommended the names of Anthony Andrews and Ishfaq Ahmed as head coaches of the senior women's and U-16 men's teams respectively. The committee met virtually on Thursday to discuss the appointment of the coaching staff of the India senior women's and U-16 Men's national teams.","content":"The Technical Committee of the All India Football Federation (AIFF) has recommended the names of Anthony Andrews and Ishfaq Ahmed as head coaches of the senior women's and U-16 men's teams respectively. The committee met virtually on Thursday to discuss the appointment of the coaching staff of the India senior women's and U-16 Men's national teams. The meeting was held under the chairmanship of I.M. Vijayan. Present at the meeting were the technical director of the AIFF, Shabir Pasha along with committee members Pinky Bompal Magar, Climax Lawrence, Arun Malhotra, Harjinder Singh, and Eugeneson Lyngdoh. Ten International Goals Sunil Chhetri Remembers Most, Indian Football Team Captain Takes A Trip Down Memory Lane The Committee, after having a long discussion on appointing the head coach of the senior women's national team, decided to recommend Anthony Andrews for the coveted post, the AIFF release said. After meticulously deliberating on the applications from the various candidates, the Committee also recommended the three core coaching staff that will take the U-16 Men's team forward. Ishfaq Ahmed was unanimously recommended for the appointment of the head coach of the U-16 Men's national team. Rajan Mani and Feroz Sharif have been appointed assistant coach and goalkeeper coach, respectively, at the U-16 national team. Sunil Chhetri Opens Up on His Conversations With Virat Kohli, Says ‘He Understands That Not Everyone Can Understand What We Are Going Through’ \"This is a new beginning for the India Senior Women's and U-16 national teams, and I am sure they will be in able hands, and the coaches we have recommended will do a fine job in taking their respective teams forward. \"The senior women will be playing the all-important AFC Olympic Qualifiers Round 2 from October 26 to November 1, while the U-16s have an assignment in hand in the SAFF U-16 Championship to be played in Bhutan from September 1 to 11. I am sure the teams will perform to the level which will make us feel proud,\" Committee Chairman Vijayan said after the meeting. (The above story first appeared on LatestLY on Jul 13, 2023 05:52 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-13 12:22:03","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Άρης μεταγραφές: Οριστική συμφωνία του Άρη με τον Λορέν Μορόν για δύο χρόνια","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238277/aris-metagrafes-oristiki-symfonia-toy-ari-me-ton-loren-moron","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Βασίλης Βλαχόπουλος","Άρης","Μεταγραφές"],"creator":null,"video_url":null,"description":"Ο Άρης ολοκλήρωσε μια σημαντική μεταγραφή καθώς είναι οριστική η συμφωνία του με τον Λορέν Μορόν για συμβόλαιο διάρκειας δύο χρόνων.","content":"Ο Άρης είχε ξεχωρίσει την περίπτωση του Λορέν Μορόν από τη λίστα των επιθετικών που είχε στη διάθεσή του με την εκτίμηση ότι ο 29χρονος Ισπανός επιθετικός ταιριάζει περισσότερο στη φιλοσοφία της ομάδας και κυρίως στο στιλ παιχνιδιού που θέλουν να παίξουν οι «κίτρινοι» την περασμένη αγωνιστική περίοδο. Οι Θεσσαλονικείς επένδυσαν στην πρόταση που του κατέθεσαν, στην προοπτική που του πρόσφεραν για να κάνει rebranding της καριέρας του αλλά και στη δεδομένη αποχώρησή του από την Μπέτις καθώς γνώριζαν ότι δεν συμπεριλαμβάνεται στο σχέδιο του Μανουέλ Πελεγκρίνι . Αυτό επιβεβαιώθηκε και την περασμένη αγωνιστική περίοδο όπου ο περιορισμένος αριθμός εμφανίσεών του με την Μπέτις τον οδήγησε στον δανεισμό του στη Λας Πάλμας στα μέσα της χρονιάς. Ωστόσο, έχοντας προχωρήσει τις επαφές μαζί του και νιώθοντας ότι ο παίκτης είχε επιλέξει τον Άρη για τον επόμενο σταθμό της καριέρας του, ουσιαστικά δοκιμάστηκαν και οι αντοχές τους καθώς στο τελευταίο διάστημα ο παίκτης βρέθηκε σε διαπραγματεύσεις με την Μπέτις για τη λύση του συμβολαίου του. Αυτή η υπόθεση δεν ήταν καθόλου εύκολη καθώς το συνολικό ύψος αυτού ήταν περί των 2 εκατ. ευρώ . Ο Άρης κάλυπτε περίπου τα 750.000 ευρώ . Τελικώς, η λύση βρέθηκε και η συμφωνία του Άρη με τον ποδοσφαιριστή είναι δεδομένη . Προβλέπει διετές συμβόλαιο και απομένει να οριστεί η ημέρα άφιξής του στη Θεσσαλονίκη. Αναμφίβολα πρόκειται για μια σπουδαία μεταγραφική κίνηση, το Gazzetta σκιαγράφησε εξάλλου το προφίλ του Λορέν Μορόν , καθώς πρόκειται για επιθετικό επιπέδου La Liga ο οποίος χρειάστηκε πρόπερσι να αγωνιστεί στην Εσπανιόλ (μέτρησε 25 συμμετοχές και τέσσερα γκολ σε Πρωτάθλημα και Κύπελλο) καθώς έχασε τη θέση του από την Μπέτις από την ημέρα που ανέλαβε την τεχνική ηγεσία ο Μανουέλ Πελεγκρίνι. Ωστόσο, η Μπέτις είναι ο σταθμός της ζωής του με αφετηρία εκείνον τον Γενάρη του 2015 όταν απέκτησε τα δικαιώματά του κι έπειτα σειρά ετών στη Μαρμπέγια. Στην πρώτη ομάδα της Μπέτις έχει αγωνιστεί σε 133 παιχνίδια με 29 γκολ και επτά ασίστ και κορυφαία σεζόν του αυτή του 2019-20 όπου μέτρησε 39 αγώνες με 12 γκολ και τρεις ασίστ. Μάλιστα, στο μεγαλύτερο μέρος εκείνης της χρονιάς ήταν στους κορυφαίους σκόρερ της LaLiga μαζί με τους Καρίμ Μπενζεμά, Τζεράρντ Μορένο . Οι επιδόσεις του προκάλεσαν… θύελλα μεταγραφικών σεναρίων. Κατά τη Daily Mail , Λοκομοτίβ Μόσχας και Μπορντό ενδιαφέρθηκαν γι’ αυτόν ενώ Κάρντιφ και Γουέστ Μπρομ κατέθεσαν προσφορές 9 εκατ. ευρώ. Το στοιχείο που τον έκανε να ξεχωρίσει ήταν η αποτελεσματικότητά του καθώς – κατά τους Ισπανούς – ο Μορόν σημείωσε τα πρώτα έξι γκολ σε σύνολο 10 τελικών προσπαθειών και ο Καρίμ Μπενζεμά σε 23! Μάλιστα, στα μέσα αυτής της σεζόν τα ισπανικά media τον κατέταξαν στους μεταγραφικούς στόχους της Μπαρτσελόνα και για την ακρίβεια επικράτησε σιγουριά για τη μετακόμισή του στη Βαρκελώνη. Στην πραγματικότητα όμως, αυτή η μεταγραφή ήταν αδύνατο να πραγματοποιηθεί καθώς η ρήτρα του συμβολαίου του προέβλεπε το ποσό των 60 εκατ. ευρώ και η Μπαρτσελόνα ήδη βρισκόταν σε καθεστώς επιτήρησης από τις ισπανικές αρχές λόγω των αλόγιστων δαπανών της και των χρεών της.","pubDate":"2023-07-13 12:21:27","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Ο Λουκ Στιλ φόρεσε τη νέα φανέλα του «τριφυλλιού»","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238274/panathinaikos-o-loyk-stil-forese-ti-nea-fanela-toy","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναθηναϊκός","Σωτήρης Μυκονίου"],"creator":null,"video_url":null,"description":"Ο Παναθηναϊκος έκανε δώρο τη νέα του φανέλα στον Λουκ Στιλ κι εκείνος τον ευχαρίστησε αναρτώντας στα Instagram του ένα βίντεο που την δοκιμάζει και ποζάρει μ' αυτή.","content":"Ο Λουκ Στιλ δέχθηκε ένα αναπάντεχο δώρο, αφού η ΠΑΕ Παναθηναϊκός του έστειλε την καινούργια φανέλα της ομάδας. Εκείνος δεν έχασε ευκαιρία κι ανέβασε βίντεο που κάνει unboxing, φοράει την φανέλα και στην συνέχεια ποζάρει μ' αυτή όλο χαμόγελο ακουμπώντας με το χέρι του το τριφύλλι. Στην ανάρτησή του ο 38χρονος Άγγλος τερματοφύλακας, που αγωνίστηκε στους «πράσινους» την τριετία 2014-2017, έγραψε: «Ένα υπέροχο δώρο από την ΠΑΕ Παναθηναϊκός, ευχαριστώ τόσο πολύ και καλή τύχη στη νέα σεζόν... Οι νέες εμφανίσεις είναι υπέροχες και σίγουρα θα έρθω σε ένα παιχνίδι σύντομα». Υπενθυμίζουμε πως έχει σταματήσει το ποδόσφαιρο και από τον Φλεβάρη που πέρασε ξεκίνησε να εργάζεται ως προπονητής στην Πέτερμπ Σπορτς , ομάδα της έκτης κατηγορίας στην Αγγλία. Δείτε το βίντεο του Λουκ Στιλ με τη νέα πράσινη φανέλα:","pubDate":"2023-07-13 12:14:02","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m","link":"https://www.dailymail.co.uk/sport/football/article-12295135/Aston-Villa-offered-chance-sign-AC-Milan-flop-Charles-Ketelaere-25m.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere less than a year after the Belgian joined the Serie A club.","content":"Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m less than a year after the 22-year-old joined the Serie A club Aston Villa have been offered the chance to sign AC Milan's Charles De Ketelaere De Ketelaere is among a number of players who will be allowed to leave the club The 22-year-old is thought to be available for about £25million this summer By Tom Collomosse For Mailonline Updated: 08:09 EDT, 13 July 2023 e-mail View comments Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere less than a year after the Belgian joined the Serie A club. De Ketelaere is among a number of players who will be allowed to leave Italian football this summer as clubs look to balance their books and the 22-year-old is thought to be available for about £25million. But Milan may have to reduce their demands in order to attract serious interest. De Ketelaere was their marquee signing last summer, costing close to £35m from Club Brugge, but had a dire debut season. He started only 13 games and failed to score. After completing the signings of midfielder Youri Tielemans and defender Pau Torres, Villa boss Unai Emery and transfer chief Monchi are now focusing on improving their attack, with a wide man and a forward high on their list. The club are pondering an opening bid for Bayer Leverkusen star Moussa Diaby, who is valued at about £50m by the Bundesliga club, and may follow up initial interest in Barcelona’s Ferran Torres or unwanted Atletico Madrid attacker Joao Felix, who spent the second half of last season on loan at Chelsea. Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere (above) The 22-year-old Belgium international is thought to be available for about £25m this summer Yet all three players would prefer ideally to be competing in the Champions League next season. While that is Villa’s long-term ambition, next term they will be in the Conference League – a fine achievement as they were in relegation trouble when Emery arrived, but not a competition to set top players’ pulses racing. Villa will also look to move on some of their fringe players with Leander Dendoncker and Leon Bailey among those understood to be available. There may also be question marks over the long-term future of Lucas Digne, signed by former boss Steven Gerrard in January 2022 but now second choice behind Alex Moreno at left-back. Share or comment on this article: Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 11:59:11","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/12/73172117-0-image-a-59_1689249482855.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ουγγαρία-Ελλάδα 1-0: Φιλική ήττα για την Εθνική Γυναικών","link":"https://www.gazzetta.gr/football/podosfairo-gynaikon/2238286/oyggaria-ellada-1-0-filiki-itta-gia-tin-ethniki-gynaikon","keywords":["Ποδόσφαιρο","Ελλάδα","Newsroom","Ποδόσφαιρο Γυναικών","Women Sports"],"creator":null,"video_url":null,"description":"Η Εθνική γυναικών ηττήθηκε με 1-0 από την Ουγγαρία στο πρώτο της φιλικό επί Ουγγρικού εδάφους.","content":"Φιλική ήττα με 1-0 υπέστη η Εθνική Γυναικών από την Ουγγαρία σε παιχνίδι που διεξήχθη στη Boszik Arena της Βουδαπέστης. Η Εθνική τα πήγε αρκετά καλά σε αυτό το τεστ, αλλά της έλειψε το γκολ, το οποίο οι Μαγυάρες βρήκαν από μια στημένη φάση με την Τουράνι (70΄) και πήραν τη νίκη. Η ενδεκάδα της Εθνικής: Γιαννακούλη, Κακαμπούκη, Σιδηρά, Μάρκου, Σαρρή, Σπυριδωνίδου, Καραπέτσα, Χαμαλίδου, Μωραϊτου, Χαλατσογιάννη, Κόγγουλη Επόμενο φιλικό με τη Βοσνία-Ερζεγοβίνη (15/07, 12:00) και πάλι στη Βουδαπέστη.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Μέσι: Υπογράφει σήμερα και προπονείται για πρώτη φορά με την Ίντερ Μαϊάμι","link":"https://www.gazzetta.gr/football/mls/2238296/mesi-ypografei-simera-kai-proponeitai-gia-proti-fora-me-tin-inter-maiami","keywords":["Ποδόσφαιρο","Λιονέλ Μέσι","Μεταγραφές","Newsroom","MLS","Ίντερ Μαϊάμι"],"creator":null,"video_url":null,"description":"Ο Λιονέλ Μέσι αναμένεται να υπογράψει σήμερα το συμβόλαιό του και ύστερα να κάνει την πρώτη του προπόνηση με την Ίντερ Μαϊάμι.","content":"Η ώρα του ντεμπούτο του Λιονέλ Μέσι με την φανέλα της Ίντερ Μαϊάμι πλησιάζει έτι περισσότερο, με την προσμονή των αμερικανών φιλάθλων της ομάδας να είναι τεράστια . Την Πέμπτη αναμένεται ο Αργεντινός σούπερ σταρ να υπογράψει το συμβόλαιό του με την Ίντερ Μαϊάμι και στην συνέχεια να κάνει την πρώτη του προπόνηση με την αμερικανική ομάδα σύμφωνα με τον συμπατριώτη του ρεπόρτερ, Γκαστόν Εντούλ . Ο ίδιος μάλιστα αποκάλυψε πως η παρουσίασή του είναι προγραμματισμένη για την Κυριακή (16/07) στις 19.00 στην Αργεντινή. Μάλιστα ανέφερε πως ο Σέρχιο Μπουσκέτς θα φτάσει εκεί το Σάββατο (15/07) ενώ η μεταγραφή του Ζόρντι Άλμπα δεν έχει τελειώσει, αφού γίνονται ακόμα διαπραγματεύσεις.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Το βίντεο από την πρώτη προπόνηση του Τόνι Βιλένα με το «τριφύλλι»","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238281/panathinaikos-binteo-apo-tin-proti-proponisi-toy-toni-bilena","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναθηναϊκός","Σωτήρης Μυκονίου","Τόνι Βιλένα"],"creator":null,"video_url":null,"description":"Ο Τόνι Βιλένα έκανε την πρώτη του προπόνηση στα πράσινα αφότου έλαβε το συνηθισμένο καλωσόρισμα από τους συμπαίκτες του.","content":"Ο Τόνι Βιλένα έκανε την πρώτη του προπόνηση με τον Παναθηναϊκό το απόγευμα της Τετάρτης (12/07) και ο φακός του PAO TV κατέγραψε τις καλύτερες στιγμές του. Ο 28χρονος Ολλανδός μέσος δέχθηκε το «θεσμοθετημένο» πλέον.. φατούρο με το οποίο ο Ιβάν Γιοβάνοβιτς και οι παίκτες του καλωσορίζουν όλα τα νέα μέλη της ομάδας και στην συνέχεια πάτησε για πρώτη φορά το χορτάρι του «Γ.Καλαφάτης», ώστε να κάνει την πρώτη του προπόνηση με την ομάδα. Δείτε το βίντεο με τις καλύτερες στιγμές του Τόνι Βιλένα:","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"ΠΑΟΚ-Μεταγραφές: Το Σάββατο στη Θεσσαλονίκη ο Μπουανά Σαμάτα","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238282/paok-metagrafes-sabbato-sti-thessaloniki-o-mpoyana-samata","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Σταύρος Σουντουλίδης","ΠΑΟΚ","Αλί Σαμάτα"],"creator":null,"video_url":null,"description":"Το μεσημέρι του Σαββάτου (15/7) στις 14.45 αναμένεται να φτάσει στη Θεσσαλονίκη το τελευταίο μεταγραφικό απόκτημα του ΠΑΟΚ, ο Τανζανός επιθετικός Μπουανά Σαμάτα.","content":"Παρά την έντονη φημολογία που αναπτύχθηκε, κυρίως από την Τουρκία , αναφορικά με την παρουσία του Μπουανά Σαμάτα σήμερα στη Θεσσαλονίκη, ο Τανζανός επιθετικός αναμένεται να ταξιδέψει το Σάββατο (15/7) στην Ελλάδα για λογαριασμό του ΠΑΟΚ . Η άφιξη του στη Θεσσαλονίκη έχει προγραμματιστεί να γίνει στις 14.45 το μεσημέρι του Σαββάτου, κάτι που σημαίνει ότι δεν πρόκειται να βρεθεί στην Ολλανδία και το βασικό στάδιο της προετοιμασίας. Ο 30χρονος επιθετικός θα περάσει από τις απαραίτητες ιατρικές εξετάσεις και στη συνέχεια θα υπογράψει το συμβόλαιο συνεργασίας με τον «Δικέφαλο» για τα επόμενα δύο συν ένα χρόνια.","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Κυκλοφορούν την Παρασκευή τα εισιτήρια με την Χάποελ Μπερ Σεβά","link":"https://www.gazzetta.gr/football/diethni-filika/2238287/panathinaikos-kykloforoyn-tin-paraskeyi-ta-eisitiria-me-tin-hapoel","keywords":["Ποδόσφαιρο","Παναθηναϊκός","Διεθνή Φιλικά","φιλικό","Σωτήρης Μυκονίου"],"creator":null,"video_url":null,"description":"Την Παρασκευή θα τεθούν στην διάθεση του κοινού προς πώληση τα εισιτήρια για το φιλικό αγώνα του Παναθηναϊκού με την Χάποελ Μπερ Σεβά στην Λεωφόρο.","content":"Την ημέρα του αγώνα, δηλαδή την Παρασκευή (13/07), θα μπορέσουν οι φίλοι του Παναθηναϊκού να προμηθευτούν τα εισιτήριά τους για το φιλικό παιχνίδι με την Χάποελ Μπερ Σεβά, που θα γίνει στην Λεωφόρο. Η διάθεσή τους θα γίνει ηλεκτρονικά. Υπενθυμίζουμε πως το παιχνίδι διεξάγεται στις 22:00, αφού υπήρξε αλλαγή στην ώρα έναρξής τους εξαιτίας του καύσωνα που θα υπάρχει εκείνες τις μέρες λόγω του φαινομένου «Κλέων».","pubDate":"2023-07-13 12:32:07","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Man United: Harry Maguire's property firm made £1.5m profit between 2021 and 2022","link":"https://www.dailymail.co.uk/sport/football/article-12294851/Man-United-Harry-Maguires-property-firm-1-5m-profit-2021-2022.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"While Maguire has had difficulties in his playing career, the business side of his life has been been flourishing after the latest figures from his firm's balance sheet were revealed this week.","content":"Harry Maguire's property business made £1.5m in year-on-year profit between 2021 and 2022 with the out of favour Manchester United captain flourishing off the pitch Harry Maguire's property firm made £1.5m in profit across 2021-2022 The Manchester United star has struggled on the pitch at Old Trafford of late But he has been a success off of it with his HM 5 Limited group flourishing By Oli Gamp For Mailonline Updated: 13:24, 13 July 2023 e-mail View comments Manchester United star Harry Maguire may be struggling on the pitch - but off it his property firm made £1.5million in profit in 2021-2022, figures show. The England defender is facing an uncertain future at Old Trafford after falling out of favour under manager Erik ten Hag - and he is now being linked with a move away from the club four years on from his £80m move from Leicester City . But while he has had difficulties in his playing career, the business side of his life has been been flourishing after the latest figures from his firm's balance sheet were revealed on Companies House. HM 5 Limited - of which Maguire is a director alongside his mother Zoe - boasted earnings of £3,835,787 in 2021, which then increased to £5,330,464 the following year in 2022. Maguire's company has enjoyed a significant increase in profits and success - having earned £450,000 in its first financial statement in 2019, just after he had completed his fairytale move to United. Harry Maguire faces an uncertain future at Old Trafford after falling out of favour last season Maguire is set to have the captaincy taken away from him by Erik ten Hag with Bruno Fernandes the likely replacement The 30-year-old - who earns £190,0000-a-week at Old Trafford remains United's club captain but could soon lose the armband with Ten Hag set to decide on the permanent skipper for the 2023-24 campaign. After Maguire found himself behind Lisandro Martinez, Raphael Varane, Victor Lindelof and even Luke Shaw in the pecking order last season, Bruno Fernandes took the leadership for the rest of the campaign. Ten Hag has quashed speculation that the decision on the next skipper could be decided by a dressing room vote, similar to the approach adopted by other clubs. Maguire is widely expected to end his four-year stay at Old Trafford this summer 'No, I don't let the dressing room vote,' the Dutch manager said. 'It is up to me.' Having started only 16 games last term, as revealed by Mail Sport last month, Maguire s now one of several players up for sale this summer . Manchester Evening News report that United have slapped a £50m price tag on Maguire - a figure which is expected to make interested parties baulk. The England international has two years left on his current contract, but it is thought the club are ready to let him go this summer. The leading candidates for the role of United captain are Fernandes and Varane, who led the side out in the first pre-season game against Leeds on Wednesday . Maguire still has two years left to run on their deal - but is due a £10m payout if he does secure an exit, as exclusively revealed by Mail Sport. England manager Gareth Southgate warned in May that Maguire's lack of first-team football at United cannot 'continue forever' if he wants to hold down an international place. Share or comment on this article: Man United: Harry Maguire's property firm made £1.5m profit between 2021 and 2022 e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 12:24:24","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/13/73172105-0-image-a-47_1689250813174.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"AIFF Technical Committee Recommends Head Coaches for Senior Women’s and U-16 Men’s Teams","link":"https://www.latestly.com/sports/football/aiff-technical-committee-recommends-head-coaches-for-senior-womens-and-u-16-mens-teams-5263219.html","keywords":null,"creator":null,"video_url":null,"description":"The Technical Committee of the All India Football Federation (AIFF) has recommended the names of Anthony Andrews and Ishfaq Ahmed as head coaches of the senior women's and U-16 men's teams respectively. The committee met virtually on Thursday to discuss the appointment of the coaching staff of the India senior women's and U-16 Men's national teams.","content":"The Technical Committee of the All India Football Federation (AIFF) has recommended the names of Anthony Andrews and Ishfaq Ahmed as head coaches of the senior women's and U-16 men's teams respectively. The committee met virtually on Thursday to discuss the appointment of the coaching staff of the India senior women's and U-16 Men's national teams. The meeting was held under the chairmanship of I.M. Vijayan. Present at the meeting were the technical director of the AIFF, Shabir Pasha along with committee members Pinky Bompal Magar, Climax Lawrence, Arun Malhotra, Harjinder Singh, and Eugeneson Lyngdoh. Ten International Goals Sunil Chhetri Remembers Most, Indian Football Team Captain Takes A Trip Down Memory Lane The Committee, after having a long discussion on appointing the head coach of the senior women's national team, decided to recommend Anthony Andrews for the coveted post, the AIFF release said. After meticulously deliberating on the applications from the various candidates, the Committee also recommended the three core coaching staff that will take the U-16 Men's team forward. Ishfaq Ahmed was unanimously recommended for the appointment of the head coach of the U-16 Men's national team. Rajan Mani and Feroz Sharif have been appointed assistant coach and goalkeeper coach, respectively, at the U-16 national team. Sunil Chhetri Opens Up on His Conversations With Virat Kohli, Says ‘He Understands That Not Everyone Can Understand What We Are Going Through’ \"This is a new beginning for the India Senior Women's and U-16 national teams, and I am sure they will be in able hands, and the coaches we have recommended will do a fine job in taking their respective teams forward. \"The senior women will be playing the all-important AFC Olympic Qualifiers Round 2 from October 26 to November 1, while the U-16s have an assignment in hand in the SAFF U-16 Championship to be played in Bhutan from September 1 to 11. I am sure the teams will perform to the level which will make us feel proud,\" Committee Chairman Vijayan said after the meeting. (The above story first appeared on LatestLY on Jul 13, 2023 05:52 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-07-13 12:22:03","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"Άρης μεταγραφές: Οριστική συμφωνία του Άρη με τον Λορέν Μορόν για δύο χρόνια","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238277/aris-metagrafes-oristiki-symfonia-toy-ari-me-ton-loren-moron","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Βασίλης Βλαχόπουλος","Άρης","Μεταγραφές"],"creator":null,"video_url":null,"description":"Ο Άρης ολοκλήρωσε μια σημαντική μεταγραφή καθώς είναι οριστική η συμφωνία του με τον Λορέν Μορόν για συμβόλαιο διάρκειας δύο χρόνων.","content":"Ο Άρης είχε ξεχωρίσει την περίπτωση του Λορέν Μορόν από τη λίστα των επιθετικών που είχε στη διάθεσή του με την εκτίμηση ότι ο 29χρονος Ισπανός επιθετικός ταιριάζει περισσότερο στη φιλοσοφία της ομάδας και κυρίως στο στιλ παιχνιδιού που θέλουν να παίξουν οι «κίτρινοι» την περασμένη αγωνιστική περίοδο. Οι Θεσσαλονικείς επένδυσαν στην πρόταση που του κατέθεσαν, στην προοπτική που του πρόσφεραν για να κάνει rebranding της καριέρας του αλλά και στη δεδομένη αποχώρησή του από την Μπέτις καθώς γνώριζαν ότι δεν συμπεριλαμβάνεται στο σχέδιο του Μανουέλ Πελεγκρίνι . Αυτό επιβεβαιώθηκε και την περασμένη αγωνιστική περίοδο όπου ο περιορισμένος αριθμός εμφανίσεών του με την Μπέτις τον οδήγησε στον δανεισμό του στη Λας Πάλμας στα μέσα της χρονιάς. Ωστόσο, έχοντας προχωρήσει τις επαφές μαζί του και νιώθοντας ότι ο παίκτης είχε επιλέξει τον Άρη για τον επόμενο σταθμό της καριέρας του, ουσιαστικά δοκιμάστηκαν και οι αντοχές τους καθώς στο τελευταίο διάστημα ο παίκτης βρέθηκε σε διαπραγματεύσεις με την Μπέτις για τη λύση του συμβολαίου του. Αυτή η υπόθεση δεν ήταν καθόλου εύκολη καθώς το συνολικό ύψος αυτού ήταν περί των 2 εκατ. ευρώ . Ο Άρης κάλυπτε περίπου τα 750.000 ευρώ . Τελικώς, η λύση βρέθηκε και η συμφωνία του Άρη με τον ποδοσφαιριστή είναι δεδομένη . Προβλέπει διετές συμβόλαιο και απομένει να οριστεί η ημέρα άφιξής του στη Θεσσαλονίκη. Αναμφίβολα πρόκειται για μια σπουδαία μεταγραφική κίνηση, το Gazzetta σκιαγράφησε εξάλλου το προφίλ του Λορέν Μορόν , καθώς πρόκειται για επιθετικό επιπέδου La Liga ο οποίος χρειάστηκε πρόπερσι να αγωνιστεί στην Εσπανιόλ (μέτρησε 25 συμμετοχές και τέσσερα γκολ σε Πρωτάθλημα και Κύπελλο) καθώς έχασε τη θέση του από την Μπέτις από την ημέρα που ανέλαβε την τεχνική ηγεσία ο Μανουέλ Πελεγκρίνι. Ωστόσο, η Μπέτις είναι ο σταθμός της ζωής του με αφετηρία εκείνον τον Γενάρη του 2015 όταν απέκτησε τα δικαιώματά του κι έπειτα σειρά ετών στη Μαρμπέγια. Στην πρώτη ομάδα της Μπέτις έχει αγωνιστεί σε 133 παιχνίδια με 29 γκολ και επτά ασίστ και κορυφαία σεζόν του αυτή του 2019-20 όπου μέτρησε 39 αγώνες με 12 γκολ και τρεις ασίστ. Μάλιστα, στο μεγαλύτερο μέρος εκείνης της χρονιάς ήταν στους κορυφαίους σκόρερ της LaLiga μαζί με τους Καρίμ Μπενζεμά, Τζεράρντ Μορένο . Οι επιδόσεις του προκάλεσαν… θύελλα μεταγραφικών σεναρίων. Κατά τη Daily Mail , Λοκομοτίβ Μόσχας και Μπορντό ενδιαφέρθηκαν γι’ αυτόν ενώ Κάρντιφ και Γουέστ Μπρομ κατέθεσαν προσφορές 9 εκατ. ευρώ. Το στοιχείο που τον έκανε να ξεχωρίσει ήταν η αποτελεσματικότητά του καθώς – κατά τους Ισπανούς – ο Μορόν σημείωσε τα πρώτα έξι γκολ σε σύνολο 10 τελικών προσπαθειών και ο Καρίμ Μπενζεμά σε 23! Μάλιστα, στα μέσα αυτής της σεζόν τα ισπανικά media τον κατέταξαν στους μεταγραφικούς στόχους της Μπαρτσελόνα και για την ακρίβεια επικράτησε σιγουριά για τη μετακόμισή του στη Βαρκελώνη. Στην πραγματικότητα όμως, αυτή η μεταγραφή ήταν αδύνατο να πραγματοποιηθεί καθώς η ρήτρα του συμβολαίου του προέβλεπε το ποσό των 60 εκατ. ευρώ και η Μπαρτσελόνα ήδη βρισκόταν σε καθεστώς επιτήρησης από τις ισπανικές αρχές λόγω των αλόγιστων δαπανών της και των χρεών της.","pubDate":"2023-07-13 12:21:27","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Παναθηναϊκός: Ο Λουκ Στιλ φόρεσε τη νέα φανέλα του «τριφυλλιού»","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2238274/panathinaikos-o-loyk-stil-forese-ti-nea-fanela-toy","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναθηναϊκός","Σωτήρης Μυκονίου"],"creator":null,"video_url":null,"description":"Ο Παναθηναϊκος έκανε δώρο τη νέα του φανέλα στον Λουκ Στιλ κι εκείνος τον ευχαρίστησε αναρτώντας στα Instagram του ένα βίντεο που την δοκιμάζει και ποζάρει μ' αυτή.","content":"Ο Λουκ Στιλ δέχθηκε ένα αναπάντεχο δώρο, αφού η ΠΑΕ Παναθηναϊκός του έστειλε την καινούργια φανέλα της ομάδας. Εκείνος δεν έχασε ευκαιρία κι ανέβασε βίντεο που κάνει unboxing, φοράει την φανέλα και στην συνέχεια ποζάρει μ' αυτή όλο χαμόγελο ακουμπώντας με το χέρι του το τριφύλλι. Στην ανάρτησή του ο 38χρονος Άγγλος τερματοφύλακας, που αγωνίστηκε στους «πράσινους» την τριετία 2014-2017, έγραψε: «Ένα υπέροχο δώρο από την ΠΑΕ Παναθηναϊκός, ευχαριστώ τόσο πολύ και καλή τύχη στη νέα σεζόν... Οι νέες εμφανίσεις είναι υπέροχες και σίγουρα θα έρθω σε ένα παιχνίδι σύντομα». Υπενθυμίζουμε πως έχει σταματήσει το ποδόσφαιρο και από τον Φλεβάρη που πέρασε ξεκίνησε να εργάζεται ως προπονητής στην Πέτερμπ Σπορτς , ομάδα της έκτης κατηγορίας στην Αγγλία. Δείτε το βίντεο του Λουκ Στιλ με τη νέα πράσινη φανέλα:","pubDate":"2023-07-13 12:14:02","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m","link":"https://www.dailymail.co.uk/sport/football/article-12295135/Aston-Villa-offered-chance-sign-AC-Milan-flop-Charles-Ketelaere-25m.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere less than a year after the Belgian joined the Serie A club.","content":"Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m less than a year after the 22-year-old joined the Serie A club Aston Villa have been offered the chance to sign AC Milan's Charles De Ketelaere De Ketelaere is among a number of players who will be allowed to leave the club The 22-year-old is thought to be available for about £25million this summer By Tom Collomosse For Mailonline Updated: 08:09 EDT, 13 July 2023 e-mail View comments Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere less than a year after the Belgian joined the Serie A club. De Ketelaere is among a number of players who will be allowed to leave Italian football this summer as clubs look to balance their books and the 22-year-old is thought to be available for about £25million. But Milan may have to reduce their demands in order to attract serious interest. De Ketelaere was their marquee signing last summer, costing close to £35m from Club Brugge, but had a dire debut season. He started only 13 games and failed to score. After completing the signings of midfielder Youri Tielemans and defender Pau Torres, Villa boss Unai Emery and transfer chief Monchi are now focusing on improving their attack, with a wide man and a forward high on their list. The club are pondering an opening bid for Bayer Leverkusen star Moussa Diaby, who is valued at about £50m by the Bundesliga club, and may follow up initial interest in Barcelona’s Ferran Torres or unwanted Atletico Madrid attacker Joao Felix, who spent the second half of last season on loan at Chelsea. Aston Villa have been offered the chance to sign AC Milan flop Charles De Ketelaere (above) The 22-year-old Belgium international is thought to be available for about £25m this summer Yet all three players would prefer ideally to be competing in the Champions League next season. While that is Villa’s long-term ambition, next term they will be in the Conference League – a fine achievement as they were in relegation trouble when Emery arrived, but not a competition to set top players’ pulses racing. Villa will also look to move on some of their fringe players with Leander Dendoncker and Leon Bailey among those understood to be available. There may also be question marks over the long-term future of Lucas Digne, signed by former boss Steven Gerrard in January 2022 but now second choice behind Alex Moreno at left-back. Share or comment on this article: Aston Villa offered the chance to sign AC Milan flop Charles De Ketelaere for £25m e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-13 11:59:11","image_url":"https://i.dailymail.co.uk/1s/2023/07/13/12/73172117-0-image-a-59_1689249482855.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"}]}