{"newsArray":[{"title":"14 fifties in last 51 innings: Pujara continues his quest for a century!","link":"https://thenewsglory.com/14-fifties-in-last-51-innings-pujara-continues-his-quest-for-a-century/","keywords":["Sports","BANvIND","Cheteshwar Pujara","Cricket","game","IND vs Bangladesh","India","Indian cricket team","online special","Pujara","Team India"],"creator":["The News Glory"],"video_url":null,"description":"Chatogram: In the first Test match against the Bangladesh team, Indian player Pujara faced 203 balls and got out by scoring 90 runs. He has scored 14 fifties in his last 51 Test innings. However, his quest for a century continues. Pujara is one of the senior players in the Indian team. He is playing […]","content":"Chatogram: In the first Test match against the Bangladesh team, Indian player Pujara faced 203 balls and got out by scoring 90 runs. He has scored 14 fifties in his last 51 Test innings. However, his quest for a century continues. Pujara is one of the senior players in the Indian team. He is playing as a regular batsman in the Test team. He played 97 Test matches and scored 6882 runs in 165 innings. This includes 18 centuries and 35 fifties. In the ongoing Test match against Bangladesh, Pujara along with youngsters Pant and Shreyas Iyer has rescued the struggling team. He was amazing by forming a partnership of 64 runs with Pant and 149 runs with Shreyas. However, he could not register a century. At the end of the first day’s play, the Indian team has scored 278 runs after losing 6 wickets in 90 overs. Shreyas Iyer will continue tomorrow’s match with 82 runs. He had last scored 193 runs against Australia in Sydney in 2019. Since then he has not registered a century in the 51 innings he has played so far. However, he has recorded 14 half-centuries in this intervening period. He has been dismissed twice in these last 51 innings of over 90+ runs. He has lost his wicket once in 80+ runs and twice in 70+ runs. Pujara is the 8th highest run-scorer in Test cricket for the Indian team. Kohli is at the 6th position with 8075 runs. Sachin (15,921 runs) is on the first position, Dravid (13,265 runs) is on the second position and Gavaskar (10,122 runs) is on the third position.","pubDate":"2022-12-14 13:35:43","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"'Messi'ah of Millions: Indian fans wait for Messi's '2011 Tendulkar moment'","link":"https://economictimes.indiatimes.com/news/sports/messiah-of-millions-indian-fans-wait-for-messis-2011-tendulkar-moment/articleshow/96229534.cms","keywords":null,"creator":null,"video_url":null,"description":"When you see Messi running circles around the best in the world and then make them chase shadows -- like he did with defender Josko Gvardiol on Tuesday night in Doha -- the world appears to be magical. Maybe that's why you want him so badly to win the elusive Holy Grail of football, just as you yearned for Sachin Tendulkar to win the cricket World Cup, which eluded him five times until 2011 in Mumbai.","content":null,"pubDate":"2022-12-14 13:19:21","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-113356,resizemode-4,msid-96229534/messiah-of-millions-indian-fans-wait-for-messis-2011-tendulkar-moment.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh 1st Test: Kohli's dismissal, Pujara-Iyer stand, top moments from Day 1","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-1st-test-day-1-top-moments-pujara-shreyas-kohli-11808861.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh 1st Test: Kohli's dismissal, Pujara-Iyer stand, top moments from Day 1","content":"India endured a tough start on Day 1 of the first Test against hosts Bangladesh in Chattogram on Wednesday, but knocks from Cheteshwar Pujara (90) and Shreyas Iyer (82 not out) helped the visitors fight back.At the end of the opening day of the Test series, India posted 278/6 on the board, having just lost Axar Patel for 14 on the final delivery of the day.Virat Kohli failed to make an impact, while KL Rahul, who is captaining India in this Test due to injured Rohit Sharma’s absence, managed just 22 off 54 balls, going at a strike-rate of just above 40.Both teams had their moments on the opening day, but the century-stand between Shreyas Iyer and Cheteshwar Pujara leaves the match evenly poised with four days remaining.Let’s now check out four top moments from Day 1:India’s poor start“The game is played over five days so it is important to break it down to smaller targets. In every session, the demands would be different but one thing is sure that you are going to see a lot of aggressive cricket from our side,” India stand-in skipper KL Rahul had said recently, ahead of the match.However, there was no aggressive approach seen among the visiting openers on Wednesday.While the opening duo of Rahul and Shubman Gill did manage to hit boundaries at regular intervals during the first seven overs, with Rahul even cutting through point against Shakib Al Hasan at one stage, the boundaries were hard to come by for India following that phase.Shubman Gill too scored three fours including a pull shot off Ebadot Hossain, but fell for the paddle sweep off Taijul Islam, as Gill was caught by Yasir Ali at slip after getting a top edge off his bat.KL Rahul and Virat Kohli soon followed after, with the duo being dismissed within an over’s gap between the 19th and 20th to leave India at 48-3 at one stage.Virat Kohli’s cheap dismissalVirat Kohli, whose last Test hundred had come against Bangladesh in November 2019, was dismissed cheaply this time, falling for just one run.Facing Taijul Islam in the 20th over, Kohli was trapped LBW plumb in front of middle stump. Kohli had a chat with Pujara at the other end and went for the review with three seconds remaining, but UltraEdge confirmed there was no bat involved and ball-tracking showed it was clearly hitting the stumps.Kohli was stuck on the back foot while trying to playing it to leg side, but the ball ended up spinning sharply and eventually struck Kohli on the backpad.Cheteshwar Pujara misses tonCheteshwar Pujara has been in the nervous nineties phase before, and on Wednesday, he was victim of yet another dismissal in the 90s.Pujara had got to his half-century in 125 deliveries, but failed to convert it into a century, being dismissed for 90 by Taijul Islam.Taijul came up with a flatter ball pitching on middle, and turned enough to beat the outside edge, eventually hitting the off-stump and knocking the bails off.Notably, Pujara last scored a Test century for India in January 2019, when he amassed 193 against Australia in Sydney. The wait for another Test century goes on for Pujara.Pujara-Iyer standCheteshwar Pujara and Shreyas Iyer played pivotal roles in India’s recovering on Day one of the first Test against Bangladesh. While Pujara was involved in a 64-run stand with Rishabh Pant (46), Pujara went onto forge 149-run stand with Shreyas Iyer for the fifth wicket.That partnership stabilised India’s innings, and that helped India win some momentum going into day two, and while India have lost Pujara, Shreyas Iyer remains unbeaten on 82.They may have just four wickets in hand, but India will look to get past the 300-run mark in the first session on Day 2 to make it tough for Bangladesh in their first-innings reply, while Shreyas Iyer searches for what will be just his second Test century.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-14 12:54:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Kohli-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India Women vs Australia Women LIVE: Harmanpreet Kaur and Co eye series lead in 3rd T20I","link":"https://www.firstpost.com/firstcricket/sports-news/india-women-vs-australia-women-live-score-ind-w-vs-aus-w-3rd-t20i-2022-women-cricket-latest-updates-11808631.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India Women vs Australia Women LIVE: Harmanpreet Kaur and Co eye series lead in 3rd T20I","content":"India Women vs Australia Women LIVE: Indians opt to bowl, Aussies make three changes to XI IND W vs AUS W 3rd T20I LIVE cricket score and updates: India bring Rajeshwari Gayakwad in place of Meghana Singh while Australia make three changes to their XI Live Updates Highlights 18:53 (IST) Australia XI : Alyssa Healy (c/wk), Beth Mooney, Tahlia McGrath, Ashleigh Gardner, Ellyse Perry, Grace Harris, Annabel Sutherland, Heather Graham, Alana King, Darcie Brown, Megan Schutt Three changes for the Aussies: IN: Harris, Carey, Brown; OUT: Litchfield, Graham, Garth 18:52 (IST) India XI : Harmanpreet Kaur (c), Shafali Verma, Smriti Mandhana, Jemimah Rodrigues, Devika Vaidya, Richa Ghosh (wk), Deepti Sharma, Radha Yadav, Anjali Sarvani, Rajeshwari Gayakwad, Renuka Thakur Just one change for the hosts: Rajeshwari Gayakwad replaces Meghana Singh 18:33 (IST) TOSS: Team India win the toss, and skipper Harmanpreet Kaur opts to field 18:30 (IST) The action shifts to Mumbai's iconic Brabourne, which will host the remainder of the series 📍 Brabourne Stadium, Mumbai An hour ‘til the third T20I gets underway! #INDvAUS pic.twitter.com/CPuPk8av6K — Australian Women's Cricket Team 🏏 (@AusWomenCricket) December 14, 2022 18:26 (IST) Was quite a memorable occasion the last time these two teams met, with over 47,000 spectators turning up at the DY Patil Stadium on Sunday A victory lap to honour the crowd who were in attendance to support the women in blue Over 47,000 in attendance for the second T20I who witnessed a thriller here at the DY Patil Stadium 👏 👏 Keep cheering for Women in Blue 👍 👍 #TeamIndia | #INDvAUS | @mastercardindia pic.twitter.com/CtzdsyhxZu — BCCI Women (@BCCIWomen) December 11, 2022 18:15 (IST) In front of an unprecedented 47,000+ fans at the DY Patil Stadium, Harmanpreet Kaur and Co produced a performance that should surely inspire a few more to take up the sport. But as they move from Navi Mumbai to Mumbai for the third T20I of the match, they also need to move on quickly from the win. Preview: Plenty of work still to do for hosts despite famous Super Over win 17:58 (IST) Hello and welcome to our live coverage of the third T20I between India and Australia at the Brabourne Stadium, with the Women in Blue hoping to carry the momentum from their thrilling Super Over win over this game and go 2-1 up in the five-match series. Highlights 18:53 (IST) Australia XI : Alyssa Healy (c/wk), Beth Mooney, Tahlia McGrath, Ashleigh Gardner, Ellyse Perry, Grace Harris, Annabel Sutherland, Heather Graham, Alana King, Darcie Brown, Megan Schutt Three changes for the Aussies: IN: Harris, Carey, Brown; OUT: Litchfield, Graham, Garth 18:52 (IST) India XI : Harmanpreet Kaur (c), Shafali Verma, Smriti Mandhana, Jemimah Rodrigues, Devika Vaidya, Richa Ghosh (wk), Deepti Sharma, Radha Yadav, Anjali Sarvani, Rajeshwari Gayakwad, Renuka Thakur Just one change for the hosts: Rajeshwari Gayakwad replaces Meghana Singh 18:33 (IST) TOSS: Team India win the toss, and skipper Harmanpreet Kaur opts to field India women vs Australia women, LIVE Cricket Score: Australia captain Alyssa Healy and India counterpart Harmanpreet Kaur pose with the series trophy. AFP 3rd T20I Preview : Buoyed by their thrilling series-leveling victory after taking the game into the Super Over, the India women’s cricket team will hope to surge ahead in the five-match series against Australia in the third T20I at Mumbai’s Brabourne Stadium. The action shifts to Brabourne Stadium in the southern end of Mumbai, just a few kilometres away from the Wankhede Stadium where the BCCI is headquartered. The Women in Blue made a fine comeback in the second T20I in front of a sold-out DY Patil Stadium in Navi Mumbai after suffering a nine-wicket thrashing in the opening game. While the Indians could collect just one wicket in the second game as well, it was their batting department that primarily helped stage the turnaround, with Smriti Mandhana (79) and Richa Ghosh (26 not out) helping the side finish level on scores after being set 188 to win. India would then score 20 runs in the Super Over, 13 of which came of Mandhana’s bat. Seamer Renuka Singh would then bowl out a tidy over to ensure the hosts were abreast with the world champions heading into the third game. Squads : India : Smriti Mandhana, Shafali Verma, Jemimah Rodrigues, Harmanpreet Kaur(c), Richa Ghosh(w), Deepti Sharma, Devika Vaidya, Radha Yadav, Anjali Sarvani, Meghna Singh, Renuka Thakur Singh, Rajeshwari Gayakwad, Sabbhineni Meghana, Harleen Deol, Yastika Bhatia. Australia : Alyssa Healy(w/c), Beth Mooney, Tahlia McGrath, Ashleigh Gardner, Ellyse Perry, Phoebe Litchfield, Annabel Sutherland, Heather Graham, Alana King, Kim Garth, Megan Schutt, Grace Harris, Nicola Carey, Darcie Brown. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 14, 2022 18:51:48 IST Tags: Cricket India Vs Australia India Vs Australia 2022 India Women Vs Australia Women Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-14 12:34:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/India-vs-Australia1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy | Sachin then, Arjun today – stunning century on debut","link":"https://thenewsglory.com/ranji-trophy-sachin-then-arjun-today-stunning-century-on-debut/","keywords":["Sports","arjun tendulkar","Cricket","game","India","Ranji Trophy","ranji trophy 2022","Sachin","sachin tendulkar","Sachin Tendulkar Son"],"creator":["The News Glory"],"video_url":null,"description":"Goa: Arjun Tendulkar, who made his debut for Goa in the ongoing Ranji Trophy series, hit a century in his first match. He scored this century against Rajasthan. This is his first-class cricket match. Sachin Tendulkar is one of the legends of cricket world. A batsman who has scored thousands of runs in the international […]","content":"Goa: Arjun Tendulkar, who made his debut for Goa in the ongoing Ranji Trophy series, hit a century in his first match. He scored this century against Rajasthan. This is his first-class cricket match. Sachin Tendulkar is one of the legends of cricket world. A batsman who has scored thousands of runs in the international cricket field for the Indian team. His son Arjun Tendulkar, who grew up watching him, also got interested in the game of cricket. A left-handed batsman and bowler, he played for Mumbai in local cricket.","pubDate":"2022-12-14 12:34:37","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN First Test | Rishabh Pant has crossed 4,000 runs in international cricket","link":"https://thenewsglory.com/ind-vs-ban-first-test-rishabh-pant-has-crossed-4000-runs-in-international-cricket/","keywords":["Sports","game","ind vs ban","India","india vs bangladesh l","Indian cricketer","Rishabh Pant","Test cricket"],"creator":["The News Glory"],"video_url":null,"description":"Chennai: Rishabh Pant, the wicket-keeper batsman of the Indian cricket team, has crossed 4,000 runs in the international cricket arena. In the same match, he also holds the record of being the fastest Indian batsman to hit 50 sixes in Test cricket. He has achieved this in a total of 54 Test innings. After Dhoni, […]","content":"Chennai: Rishabh Pant, the wicket-keeper batsman of the Indian cricket team, has crossed 4,000 runs in the international cricket arena. In the same match, he also holds the record of being the fastest Indian batsman to hit 50 sixes in Test cricket. He has achieved this in a total of 54 Test innings. After Dhoni, Pant has also created the record of being the Indian wicketkeeper batsman who has crossed 4000 runs in international cricket. The 25-year-old Pant has been playing international cricket for the Indian team since 2017. He has played 31 Tests, 30 ODIs and 66 T20Is so far. Through this he has accumulated a total of 4021 runs. He has scored 6 centuries and 18 fifties in these runs. 5 of these centuries were recorded in Test cricket. He has accumulated 159 runs in Test cricket, 125 runs in ODI cricket and 65 runs in T20 cricket. He has returned as a not-out batsman in all these three innings. He has taken a total of 158 catches as a wicket keeper. He has stumped 21 times. In Test cricket, he took 6 catches in a single innings. He scored 46 runs in the ongoing first Test against Bangladesh. It was in this innings that he set the milestone of 4000+ runs and the record for fastest 50 sixes. He came in to bat when the Indian team stumbled with the loss of 3 wickets for 48 runs. After a brilliant performance, Pant lost his wicket by scoring 46 runs off 45 balls due to poor shot selection in the same match. At the end of the first day of the Test match, the Indian team scored 278 runs, losing 6 wickets in 90 overs. Pujara was out on 90 runs. Shreyas Iyer is batting with 82 runs.","pubDate":"2022-12-14 11:33:37","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"IND-W vs AUS-W 3rd T20I Dream11 prediction: Fantasy cricket tips for India Women vs Australia Women T20I in Mumbai","link":"https://www.dnaindia.com/cricket/report-indw-vs-ausw-3rd-t20i-dream11-prediction-fantasy-cricket-tips-for-india-women-vs-australia-women-t20i-hotstar-3010658","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"IND-W vs AUS-W 3rd T20I Dream 11 Team - Check My Dream11 Team, Best Player's list for India Women vs Australia Women 3rd T20I in Mumbai.","content":null,"pubDate":"2022-12-14 09:52:32","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN: पहले टेस्ट मैच में चमके ऋषभ पंत, खेली शानदार पारी, ट्विटर पर फैंस ने की तारीफ","link":"https://www.abplive.com/sports/cricket/ind-vs-ban-rishabh-pant-played-good-innings-against-bangladesh-in-1st-test-people-praise-him-see-reaction-2281848","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"India vs Bangladesh: भारत और बांग्लादेश के बीच खेले जा रहे पहले टेस्ट मैच में ऋषभ पंत (Rishabh Pant) शानदार पारी खेलकर वापस लौटे. पंत ने इस मैच में पांचवें नंबर पर आकर 45 गेंदों में 46 रनों की पारी खेली. उनकी इस पारी में 6 चौके और 2 छक्के शामिल रहे. टेस्ट क्रिकेट में एक बार फिर पंत ने शानदार पारी खेली. अपने करियर की शुरुआत से ही पंत टेस्ट में चमकते हुए दिखाई दिए हैं. उन्होंने इस पारी के साथ इंटरनेशनल क्रिकेट में 4000 रन भी पूरे कर लिया. भारतीय टीम ने 48 रनों पर तीन विकेट गंवा दिए थे. इसके बाद पंत क्रीज़ पर आए थे और उन्होंने अच्छी पारी खेल टीम को संभाला.  फैंस ने की तारीफ इस मैच की पहली पारी देख फैंस पंत से काफी खुश दिखाई दिए. फैंस ने उनकी इस पारी की जमकर तारीफ की. लोगों ने ट्विटर पर पंत की तारीफ करते हुए शानदार रिएक्शन दिए. पंत ने एक बार फिर दिखा दिया कि वह इस फॉर्मेट में शानदार खिलाड़ी हैं. पंत इस साल टेस्ट में 2 शतक और तीन अर्धशतक जड़ चुके हैं.  उन्होंने टेस्ट की पिछली सात पारियों में 89 के ऐवरेज से 534 रन बनाए हैं. इस मैच में पंत ने टेस्ट क्रिकेट में 50 छक्के भी पूरे कर लिए हैं. वो टेस्ट में सर्वाधिक छक्के लगाने के मामले में 8वें भारती बल्लेबाज बन गए हैं. बांग्लादेश के खिलाफ पहली पारी के बाद फैंस ने इस तरह के रिएक्शन देते हुए उनकी तरीफ की.    Rishabh Pant in Test cricket in the last innings:- 100*.- 96.- 39.- 50.- 146.- 57.- 46.- 534 runs at an average of 89, he's a superstar of this format! pic.twitter.com/LC6JzXwP4j — Mufaddal Vohra (@mufaddal_vohra) December 14, 2022 Rishabh Pant walking in with India's top order down in no time pic.twitter.com/7k6PyUIqDm — retired ICT fan (@anubhav__tweets) December 14, 2022 Rishabh pant is only player for India who can play bazz-ball cricket in test for India. pic.twitter.com/ttnb8GNkvQ — Chetan Choudhary 🇮🇳🇮🇳🇮🇳 (@ChetanC75495924) December 14, 2022 Well played Rishabh Pant.And congratulations for hitting fastest 50 sixes in Test Cricket. pic.twitter.com/WeyVJY7Xhz — Aru💫 (@Aru_Ro45) December 14, 2022 Rishabh Pant is a superstar in this format - in the first session he managed to smash 29 in 26 balls, when the team was down at 48/3. — Mufaddal Vohra (@mufaddal_vohra) December 14, 2022 Rishabh pant in last 7 innings in test had 534 runs at an average of 89 ❤️The saviour of Test cricket pic.twitter.com/NCKdQGWkij — Rishabh pant fans club (@rishabpantclub) December 14, 2022 Well played, Rishabh Pant. He scored 46 runs from 45 balls including 6 fours and 2 sixes against Bangladesh. pic.twitter.com/bsktV5GXzg — CricketMAN2 (@ImTanujSingh) December 14, 2022 अब तक ऐसा टेस्ट करियर पंत ने टेस्ट क्रिकेट में 2018 में इंग्लैंड के खिलाफ डेब्यू किया था, जब से लेकर अब तक वो भारत के लिए अब तक कुल 31 टेस्ट मैच खेल चुके हैं. इन मैचों की 53 पारियों में उन्होंने 43.32 की औसत से 2123 रन बनाए हैं. उन्होंने अब तक 5 शतक और 10 अर्धशतक जड़े हैं. इस दौरान उनका हाई स्कोर 159* रनों का रहा है.        ये भी पढ़ें... IND vs BAN: MS Dhoni की राह पर चले Rishabh Pant, बांग्लादेश के खिलाफ टेस्ट में किया यह कारनामा","content":null,"pubDate":"2022-12-14 09:45:21","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/14/6287a10fef48b7e3daa6ad3291d4b6b71671008227154582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Mark Wood चोट से परेशान होकर छोड़ना चाहते थे टेस्ट क्रिकेट, फिर क्यों बदला इरादा?, जानिए वजह","link":"https://www.abplive.com/sports/cricket/pak-vs-eng-england-mark-wood-wanted-to-quit-test-cricket-due-to-injury-but-changed-idea-2281867","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Mark Wood On Test Cricket: इंग्लैंड के धुआंधार पेसर मार्क वुड ने कहा है कि उन्होंने इस साल चोट से परेशान होकर टेस्ट क्रिकेट छोड़ने का विचार किया था. लेकिन बाद में उन्होंने अपना इरादा बदल दिया. क्योंकि वह नए कप्तान बेन स्टोक्स और कोच ब्रेंडन मैकुलम के नेतृत्व वाली रणनीति में शामिल होना चाहते थे. वुड मौजूदा समय में पाकिस्तान दौरे पर इंग्लैंड की टेस्ट टीम का हिस्सा हैं और वह शानदार गेंदबाजी कर रहें. इंग्लिश टीम टेस्ट सीरीज 2-0 की निर्णयायक बढ़त ले चुकी है.  वुड ने पूरा सीजन मिस किया मार्क वुड ने दाहिने हाथ की एल्बो में चोट के चलते करीब पूरा ग्रीष्मकालीन सत्र मिस किया. उन्हें इसी साल मार्च में चोट लगी थी. इसके बाद उन्होंने मुल्तान टेस्ट में पाकिस्तान के खिलाफ वापसी की. इस मुकाबले में वह इंग्लैंड को 26 रन से जिताने में सफल रहे. मुल्तान टेस्ट में वुड ने 6 विकेट झटके. वापसी से पहले वह बेन स्टोक्स और ब्रेंडन मैकुलम के नेतृत्व में नहीं खेले थे. उन्होंने आक्रामक और ज्यादा जोखिम लेनी वाली शैली का समर्थन किया. जब उनसे यह पूछा गया क्या उन्होंने लंबे प्रारूप को छोड़ने का विचार किया था. उन्होंने संवाददाताओं से बात करते हुए कहा क्या मैं सफेद गेंद ही खेलूंगा?  मुझे खुशी है स्टोक्स-मैकुलम के साथ हूं इस दौरान उन्होंने कहा, एक समय मेरा शरीर कहेगा यह जाने का समय है. लेकिन मैंने व्हाइट बॉल के लिए तैयारी नहीं की थी. मैंने सब तरह के क्रिकेट के लिए तैयारी की. मैं बेन स्टोक्स और ब्रेंडन मैकुलम के साथ यह सब अऩुभव करने के लिए बेताब था. इसलिए मैं बहुत खुश हूं कि उनके साथ हूं. वहीं अगर सीरीज की बात की जाए इंग्लैंड ने रावलपिंडी टेस्ट में पाकिस्तान को 74 रन से हराया था जबकि मुल्तान टेस्ट में उसने मेजबानों को 26 रन से शिकस्त दी.  यह भी पढ़ें:  IND vs BAN: MS Dhoni की राह पर चले Rishabh Pant, बांग्लादेश के खिलाफ टेस्ट में किया यह कारनामा IPL 2023: कोहली-रोहित की तरह नहीं है अब की युवा पीढ़ी, ब्रेड हॉग ने आईपीएल को जिम्मेदार ठहराते हुए दी प्रतिक्रिया    ","content":null,"pubDate":"2022-12-14 09:39:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2021/08/23/da340928a13a4355890d651830292174_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Arjun Tendulkar scores century on Ranji Trophy debut, replicates father Sachin's feat","link":"https://www.firstpost.com/firstcricket/sports-news/arjun-tendulkar-century-ranji-trophy-debut-sachin-tendulkar-11806671.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Arjun Tendulkar scores century on Ranji Trophy debut, replicates father Sachin's feat","content":"Cricket Arjun Tendulkar scores century on Ranji Trophy debut, replicates father Sachin's feat Arjun Tendulkar is playing for Goa, and not Mumbai, in order for more game time. He had represented Mumbai in last year's domestic season. FirstCricket Staff December 14th, 2022 14:57:10 IST File image of Arjun Tendulkar. Reuters Goa: Arjun Tendulkar repeated father Sachin Tendulkar’s feat of scoring a century on first class debut while representing Goa against Rajasthan in the Ranji Trophy on Wednesday. Sachin Tendulkar had also scored a century on his Ranji Trophy debut, almost exactly 34 years back. Tendulkar, then 15, had scored a century against Gujarat at the Wankhede Stadium. Arjun, 23, brought up the ton in 178 balls while coming in to bat at No 7. His inning witnessed 15 boundaries and two sixes at the Goa Cricket Association Academy. Arjun and Suyash S Prabhudesai stitched an unbeaten 209 run stand for the sixth wicket going into the Tea break. Prabhudesai, who came in at No 3, scored a century of his own. He was unbeaten on 172 runs at the break. Arjun Tendulkar is playing for Goa, and not Mumbai, in order for more game time. He had represented Mumbai in last year’s domestic season. The left arm seamer has 8 wickets in List A cricket and 12 wickets in T20s. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 14, 2022 14:57:10 IST Tags: Arjun Tendulkar Cricket Ranji Trophy Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-14 09:27:10","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2021/01/Arjun-Tendulkar-bowling-640-Reuters-social.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Young players more focused on playing T20 cricket': Brad Hogg on how IPL is affecting Indian cricket","link":"https://www.firstpost.com/firstcricket/sports-news/young-players-more-focused-on-playing-t20-cricket-brad-hogg-on-how-ipl-is-affecting-indian-cricket-11806681.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'Young players more focused on playing T20 cricket': Brad Hogg on how IPL is affecting Indian cricket","content":"Cricket 'Young players more focused on playing T20 cricket': Brad Hogg on how IPL is affecting Indian cricket Comparing the younger generation of players to greats like Rohit Sharma and Virat Kohli, Hogg said that it was the newer players who were most affected by the shift to T20 cricket. FP Trending December 14th, 2022 14:56:19 IST File image of former Australia and KKR spinner Brad Hogg. Sportzpics The upcoming edition of the Indian Premier League is already being awaited by fans. The mini-auction ahead of the marquee tournament, which will be held on 23 December, will see the 10 teams bidding for players like Joe Root, Kane Williamson, Cameroon Green Holder and Ajinkya Rahane. While both cricketers and franchises are gearing up for the IPL 2023 mini-auction, former Australia cricketer Brad Hogg is of a different opinion about the tournament’s role in cricket. The spinner has claimed that the cash-rich league is having an adverse effect on the sport as younger cricketers are more interested in playing T20s than the longer formats of the game. In an Instagram post, Brad Hogg said that IPL is affecting Indian cricket “because the young players that are coming through the system are more focused on playing T20 IPL cricket because there is probably a little more cash in it, it’s a short form, it’s quick and you get the game done and dusted. It seems a bit like easier money.” He also said that due to the focus on T20 games, Tests and ODIs take a backseat. Watch: View this post on Instagram A post shared by Brad Hogg (@brad_hogg) Comparing the younger generation of players to greats like Rohit Sharma and Virat Kohli, Hogg said that it was the newer players who were most affected by the shift to T20 cricket. “They don’t know how bowlers set up batters to take wickets and how batters build their innings to bat for long periods of time,” the Aussie all-rounder added. The video has garnered several responses with several people disagreeing with Brad Hogg’s comments. Many people credited the IPL with bringing forward new talent. Others said it all came down to the viewers. “Well it’s not impacting anything in the end sports is business. If more people watch test cricket, then ipl players will make more money by playing tests and they will focus more there. So just enjoy cricket,” commented one person. “Tournaments like Ranji, Syed Mustaq Ali are equally helping players to develop in other formats. It’s just that obviously there is more focus and money in t20 cricket”, wrote another. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 14, 2022 14:56:19 IST Tags: Cricket Ipl 2023 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-14 09:26:19","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/05/Hogg-featured-.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Problems arise when you seek advice from outsiders': Shahid Afridi on Babar Azam's captaincy","link":"https://www.firstpost.com/firstcricket/sports-news/shahid-afridi-babar-azam-captaincy-pakistan-vs-england-11806651.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'Problems arise when you seek advice from outsiders': Shahid Afridi on Babar Azam's captaincy","content":"Cricket 'Problems arise when you seek advice from outsiders': Shahid Afridi on Babar Azam's captaincy Shahid Afridi also criticised the fans for putting all the blame on Pakistan captain Babar Azam after the Test series loss to England. FP Trending December 14th, 2022 14:40:32 IST Pakistan captain Babar Azam. AP Pakistan’s performance in Test cricket has come under the scanner since the side suffered their third consecutive Test defeat on home soil, for the first time in 63 years. They have already lost the three-match series against England with the second loss in a row In the second Test, the Babar Azam-led side fell 26 runs short of the 355-run target in the fourth innings following a batting disaster. Among several controversies, skipper Azam’s leadership ability , especially in Tests has become the talk of the town. Referring to the topic, former Pakistan captain Shahid Afridi slammed the opener for not taking suggestions from senior members of the squad. Prior to Pakistan’s defeat in the second Test, Afridi revealed his thoughts about the unit’s disappointing results in recent times while featuring in a discussion on Samaa TV . According to him, Azam is relying more on advice from outsiders rather than listening to the veteran cricketers. Thus, he went on to make some blunders in the planning procedure and also in taking crucial in-match calls. Reminiscing his tenure as the Pakistan skipper, Afridi explained, “As a captain, I always believed that being a good leader requires bringing all the players together. It implies that you should talk to seniors about your ideas. Problems arise when you start seeking advice from outsiders while excluding senior folks.” However, Afridi showed his trust in Azam’s batting capability. Though the right-handed batter could not live up to the expectations during the fourth-innings chase, the former cricketer refused to doubt him. Fans at the Multan Cricket Stadium went outrageous after Azam departed early scoring just 1 run at an important moment. After his dismissal, the crowd was heard chanting “ZimBabar” in the stands. The gesture from the home supporters did not go down well with Afridi. He noted, “If we don’t respect our players, the rest of the world won’t either.” The 45-year-old strongly criticised the fans for putting all the blame on the captain as each of the players should equally bear the responsibility for the loss. “Babar Azam is the backbone of the team. In the series, he has not performed too badly. He doesn’t play squash or table tennis to win a match for his team alone. If the team doesn’t perform, we can’t expect enough from any one person. He is the captain and is responsible for many things. He is our hero and will always be,” Afridi added further. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 14, 2022 14:40:32 IST Tags: Cricket Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-14 09:10:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Babar-Azam-Pakistan-cricket-team.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN 1st Test: Rishabh Pant crosses 4000-run mark in International cricket","link":"https://www.dnaindia.com/cricket/report-ind-vs-ban-1st-test-rishabh-pant-crosses-4000-run-mark-in-international-cricket-3010641","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Pant has scored 4021 runs at an average of 33.78 in 128 matches, with a best performance of an unbeaten 159.","content":null,"pubDate":"2022-12-14 08:16:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Freddie Flintoff airlifted to hospital following car crash while filming Top Gear show, England cricket... - talkSPORT","link":"https://news.google.com/__i/rss/rd/articles/CBMiY2h0dHBzOi8vdGFsa3Nwb3J0LmNvbS9zcG9ydC9jcmlja2V0LzEyNzY3MDUvZnJlZGRpZS1mbGludG9mZi1haXJsaWZ0ZWQtaG9zcGl0YWwtY2FyLWNyYXNoLXRvcC1nZWFyL9IBZ2h0dHBzOi8vdGFsa3Nwb3J0LmNvbS9zcG9ydC9jcmlja2V0LzEyNzY3MDUvZnJlZGRpZS1mbGludG9mZi1haXJsaWZ0ZWQtaG9zcGl0YWwtY2FyLWNyYXNoLXRvcC1nZWFyL2FtcC8?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Freddie Flintoff airlifted to hospital following car crash while filming Top Gear show, England cricket...  talkSPORTView Full coverage on Google News","content":null,"pubDate":"2022-12-14 07:50:17","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"BAN vs IND: Rishabh Pant breaches 4000-run mark in international cricket","link":"https://thenewsmill.com/2022/12/ban-vs-ind-rishabh-pant-breaches-4000-run-mark-in-international-cricket/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Rishabh Pant on Wednesday breached the 4000-run mark in international cricket. Pant accomplished this feat during the first innings of the opening Test against Bangladesh. After three quick wickets, Bangladesh were right on top with India having lost the star likes of Virat Kohli, KL Rahul, and Shubman Gill. However, vice-captain Cheteshwar Pujara and Rishabh Pant showed some resurgence with a 37-run partnership stand while the Men in Blue were in serious trouble. Pant’s aggression has helped India, which has lost three games in a row after a strong start. Taijul struck twice, including Kohli’s head, and Khaled dispatched the India captain. Pant, on the other hand, has already struck four boundaries and a six in his 26-ball 29* to lead the recovery after being promoted. After India opted to bat, Taijul Islam was the one who eventually broke through in the Indian batting order. Shubman Gill attempted to lap-sweep a full delivery at the start of the drinks break, but the ball simply plummeted at him, inducing a top edge. Yasir Ali came around from the first slip and grabbed it, expecting the shot. KL Rahul soon collapsed, falling prey to Khaled’s delivery on his stumps. In the next over, Virat Kohli was trapped lbw by a length ball from Taijul that spun past his outside edge. That meant India, who appeared to be in out of control at 41 for no loss, were suddenly in trouble. Pujara and Pant batted in their respective ways for the remainder of the session. Pant even skipped down the pitch to hit Taijul for a six-over wide long-on. At lunch, he was on 29 off 26, while Pujara was on 12 off 32. (ANI) ALSO READ: Iranian govt executed over 500 people in 2022, highest in 5 years: Report This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2022-12-14 07:31:17","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"Así celebraron en Asia el triunfo, los seguidores de Messi","link":"https://www.diariolibre.com/deportes/futbol/2022/12/14/asi-celebraron-en-asia-el-triunfo-los-seguidores-de-messi/2169191","keywords":["Deportes","AP","Nueva Delhi","Lionel Messi","Campeonato Mundial de Fútbol","Qatar 2022","Copa de Fútbol Qatar 2022","Celebraron"],"creator":null,"video_url":null,"description":"Gazi Jahidul Haque tenía problemas por disimular su nerviosismo antes de la semifinal del Mundial entre Argentina y Croacia en el estadio Lusail de Qatar.Haque seguía el juego desde Daca, la capital de Bangladesh.} RELACIONADAS Fútbol Scaloni, el novato DT que busca su diploma de honor en Qatar Fútbol Messi irá por su revancha con Argentina, finalista en Qatar Fútbol Resultados y calendario de la Copa Mundial de Fútbol de Qatar 2022 \"Este Mundial no sólo es importante para Argentina, sino también para Messi\", dijo Haque, abogado de 35 años, antes del encuentro. Su voz apenas se oía entre las miles de personas reunidas a su espalda para ver el juego ante una pantalla gigante en la Universidad de Daca, en el centro de la capital.Era medianoche en Daca, y para cuando sonó el silbato final y Argentina había ganado a Croacia 3-0, hacía tiempo que las preocupaciones de Haque estaban olvidadas. Argentina estaba en la final del Mundial, a una victoria de hacerse con el trofeo más importante del fútbol.La victoria suponía que Haque podría ver a Messi, un jugador ampliamente considerado como uno de los mejores del mundo- una vez más en el Mundial. Comenzaron las celebraciones.Los hinchas salieron a las calles en Daca con banderas argentinas y los colores de la albiceleste. Entre el sonido de las trompetas corearon el nombre de Messi y se abrazaban entre ellos. Algunos bailaban y cantaban. Un joven pasó en un bicitaxi con el cuerpo pintado de azul y blanco. RELACIONADAS Fútbol Álvarez revoluciona a Argentina rumbo a otra final Fútbol Modric se va del Mundial pero comparte escenario con Messi La victoria argentina también se celebró en la vecina India, donde normalmente es el cricket el deporte que despierta un fervor casi religioso.En la ciudad de Calcuta, donde también hay niños que llevan el nombre de futbolistas de otras generaciones, los hinchas argentinos marcharon por las calles cantando canciones en apoyo del equipo de Messi. Es una ciudad donde hay murales del astro argentino en los muros y banderas de Argentina asoman de los balcones.Argentina tiene una legión de superhinchas en Bangladesh e India desde los tiempos de Maradona, uno de los futbolistas más grandes de todos los tiempos y símbolo para aficionados de todo el mundo. Miles de personas han viajado desde esos dos países para ver jugar a Messi y su equipo en Qatar. Te puede interesar Messi va a igualar el récord de Matthäus con 25 partidos en Mundiales Marroquíes hacen cola por boletos gratis para semifinal Ante el enorme apoyo en el país del sur de Asia, la Federación Argentina dirigió un mensaje a los bangladeshíes en medios sociales este mes.\"¡¡Gracias por el apoyo a nuestro equipo!! ¡Están re locos como nosotros!\", indicó la federación en un tuit con imágenes de hinchas bangladeshíes con los colores de argentina.Los que no están en Qatar muestran su afición y siguen los juegos con devoción desde casa.En poblados y ciudades costeras de Kerala, en el sur, donde se ven banderas de Argentina y Brasil en comercios, edificios y postes, la gente colocó enormes figuras de sus jugadores favoritos, en especial Messi y el brasileño Neymar. En los poblados se han aprovechado los espacios abiertos utilizados para mostrar los partidos y miles de personas han acudido a verlos en pantallas gigantes.Argentina se enfrentará a Francia o Marruecos en la final del domingo. El fervor alcanzará su máxima expresión en India, y Aditya Shriram sueña con un final de cuento de hadas para Messi. Un apoyo por años Shriram, un publicista digital de 33 años en Nueva Delhi, apoya a Argentina desde el Mundial de 1998. El domingo seguirá la final con un grupo de casi dos docenas de amigos con los que jugaba al fútbol de niño en la capital india.Shriram dijo que el juego del domingo permitirá a Messi consolidar su legado, ya que los considerados como mejores futbolistas de la historia -Pelé y Maradona- ganaron el Mundial, un trofeo que el astro argentino no ha logrado aún.\"Lo completará\", dijo Shriram. \"Si uno no gana el Mundial, no se le puede contar entre los absolutamente mejores de todos los tiempos\".","content":"Gazi Jahidul Haque tenía problemas por disimular su nerviosismo antes de la semifinal del Mundial entre Argentina y Croacia en el estadio Lusail de Qatar. Haque seguía el juego desde Daca, la capital de Bangladesh.} \"Este Mundial no sólo es importante para Argentina, sino también para Messi\", dijo Haque, abogado de 35 años, antes del encuentro. Su voz apenas se oía entre las miles de personas reunidas a su espalda para ver el juego ante una pantalla gigante en la Universidad de Daca, en el centro de la capital. Era medianoche en Daca, y para cuando sonó el silbato final y Argentina había ganado a Croacia 3-0, hacía tiempo que las preocupaciones de Haque estaban olvidadas. Argentina estaba en la final del Mundial, a una victoria de hacerse con el trofeo más importante del fútbol. La victoria suponía que Haque podría ver a Messi, un jugador ampliamente considerado como uno de los mejores del mundo- una vez más en el Mundial. Comenzaron las celebraciones. Los hinchas salieron a las calles en Daca con banderas argentinas y los colores de la albiceleste . Entre el sonido de las trompetas corearon el nombre de Messi y se abrazaban entre ellos. Algunos bailaban y cantaban. Un joven pasó en un bicitaxi con el cuerpo pintado de azul y blanco. La victoria argentina también se celebró en la vecina India, donde normalmente es el cricket el deporte que despierta un fervor casi religioso. En la ciudad de Calcuta, donde también hay niños que llevan el nombre de futbolistas de otras generaciones, los hinchas argentinos marcharon por las calles cantando canciones en apoyo del equipo de Messi. Es una ciudad donde hay murales del astro argentino en los muros y banderas de Argentina asoman de los balcones. Argentina tiene una legión de superhinchas en Bangladesh e India desde los tiempos de Maradona, uno de los futbolistas más grandes de todos los tiempos y símbolo para aficionados de todo el mundo. Miles de personas han viajado desde esos dos países para ver jugar a Messi y su equipo en Qatar. Ante el enorme apoyo en el país del sur de Asia, la Federación Argentina dirigió un mensaje a los bangladeshíes en medios sociales este mes. \"¡¡Gracias por el apoyo a nuestro equipo!! ¡Están re locos como nosotros!\", indicó la federación en un tuit con imágenes de hinchas bangladeshíes con los colores de argentina. Los que no están en Qatar muestran su afición y siguen los juegos con devoción desde casa. En poblados y ciudades costeras de Kerala, en el sur, donde se ven banderas de Argentina y Brasil en comercios, edificios y postes, la gente colocó enormes figuras de sus jugadores favoritos, en especial Messi y el brasileño Neymar. En los poblados se han aprovechado los espacios abiertos utilizados para mostrar los partidos y miles de personas han acudido a verlos en pantallas gigantes. Argentina se enfrentará a Francia o Marruecos en la final del domingo. El fervor alcanzará su máxima expresión en India, y Aditya Shriram sueña con un final de cuento de hadas para Messi. Shriram, un publicista digital de 33 años en Nueva Delhi, apoya a Argentina desde el Mundial de 1998. El domingo seguirá la final con un grupo de casi dos docenas de amigos con los que jugaba al fútbol de niño en la capital india. Shriram dijo que el juego del domingo permitirá a Messi consolidar su legado, ya que los considerados como mejores futbolistas de la historia -Pelé y Maradona- ganaron el Mundial, un trofeo que el astro argentino no ha logrado aún. \"Lo completará\", dijo Shriram. \"Si uno no gana el Mundial, no se le puede contar entre los absolutamente mejores de todos los tiempos\". Noticias y servicios que extienden el alcance global de la cobertura basada en hechos","pubDate":"2022-12-14 07:25:00","image_url":null,"source_id":"diariolibre_dr","country":["Dominican Republic"],"category":["sports"],"language":"spanish"},{"title":"IND vs BAN: Rishabh Pant ने बांग्लादेश के खिलाफ पहले टेस्ट दौरान हासिल की खास उपलब्धि, पूरे किए 4000 इंटरनेशनल रन","link":"https://www.abplive.com/sports/cricket/ind-vs-ban-rishabh-pant-breaches-the-4000-run-mark-in-international-cricket-1st-test-2281742","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Rishabh Pant Bangladesh vs India, 1st Test: भारत और बांग्लादेश के बीच टेस्ट सीरीज का पहला मैच चट्टोग्राम में खेला जा रहा है. इसमें टीम इंडिया टॉस जीतकर पहले बैटिंग कर रही है. भारत की शुरुआत खराब रही. टीम इंडिया ने 48 रनों के स्कोर पर 3 विकेट गंवा दिए थे. इसके बाद ऋषभ पंत ने चेतेश्वर पुजारा के साथ मिलकर अर्धशतकीय साझेदारी निभाई. पंत ने इस दौरान एक उपलब्धि हासिल कर ली. उन्होंने करियर के 4000 इंटरनेशनल रन पूरे कर लिए. पंत इस मुकाबले में 46 रन बनाकर आउट हुए. उन्होंने 2 छक्के भी लगाए.  बांग्लादेश के खिलाफ टेस्ट सीरीज के पहले मैच में पत नंबर 5 पर बैटिंग करने आए. इस दौरान उन्होंने 45 गेंदों का सामना करते हुए 46 रन बनाए. उन्होंने इस पारी में 6 चौके और 2 छक्के लगाए. पंत ने इस पारी की बदौलत करियर के 4000 इंटरनेशनल रन पूरे किए. बीसीसीआई ने उन्हें ट्वीट करके बधाई भी दी है.  अगर पंत के अब तक के करियर पर नजर डालें तो वह ठीक रहा है. उन्होंने 54 टेस्ट पारियों में 2169 रन बनाए हैं. इस दौरान 5 शतक और 10 अर्धशतक लगाए. वे 26 वनडे पारियों में 865 रन बना चुके हैं. पंत ने वनडे फॉर्मेट में एक शतक और 5 अर्धशतक लगाए हैं. वे 66 टी20 इंटरनेशनल मैचों में 987 रन बना चुके हैं. ऋषभ ने इस फॉर्मेट में 3 अर्धशतक लगाए हैं. गौरतलब है  कि ऋषभ ने बांग्लादेश के खिलाफ टेस्ट मैच में एक और रिकॉर्ड अपने नाम कर लिया. उन्होंने भारत के लिए टेस्ट फॉर्मेट में 50 छक्के पूरे किए. वे ऐसा करने वाले भारत के 8वें खिलाड़ी बन गए हैं. भारत के लिए टेस्ट फॉर्मेट में सबसे ज्यादा छक्के जड़ने का रिकॉर्ड वीरेंद्र सहवाग के नाम दर्ज है. उन्होंने 91 छक्के लगाए हैं.  .@RishabhPant17 breaches the 4000-run mark in international cricket 👏👏#TeamIndia #BANvIND pic.twitter.com/zRxRG96UrH — BCCI (@BCCI) December 14, 2022 यह भी पढ़ें : VIDEO: Virat Kohli को तैजुल इस्लाम ने आसानी से बनाया शिकार, देखें कैसे सिर्फ 1 रन बनाकर हुए आउट","content":null,"pubDate":"2022-12-14 07:12:48","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/14/d2455d3e3ecb3c2632f0bfab80bb280e1671001029016344_original.png","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Alyssa Healy: We’ll bounce back from loss","link":"https://www.couriermail.com.au/sport/cricket/alyssa-healy-well-bounce-back-from-loss/video/e5d2ede029abf24d80f34842ee7b87e3","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia are looking to quickly bounce back after their first defeat of the year to India, according to Alyssa Healy.","content":"Cricket: Australia are looking to quickly bounce back after their first defeat of the year to India, according to Alyssa Healy.","pubDate":"2022-12-14 07:09:20","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Curve-balls’: Marnus expects South African barrage","link":"https://www.couriermail.com.au/sport/cricket/marnus-labuschagne-expects-to-cop-plenty-from-his-south-african-opponents/news-story/36bd37c9146b3d121d797d0592c590b8","keywords":["Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries"],"creator":null,"video_url":null,"description":"There’s no mixed allegiances for South African-born Aussie Test star Marnus Labuschagne ahead of a first-ever Test clash against his birth country even though he expects the tourists could throw some “curve-balls” his way in the sledging department.","content":"Labuschagne has become the world‘s No.1 Test batsman in the three years since his debut at Lord’s in 2019, as a concussion sub, and hits the showdown with the Proteas off the back of a man-of-the series performance against the West Indies in which he belted 502 runs. He’s never played a Test against South Africa, but has played three ODI’s against them and scored a fairytale century against then in Potchefstroom in 2020. The 28-year-old, who moved to Australia when he was 10 and could only speak Afrikaans, conceded this series was “a little bit closer to my heart” but he wouldn’t be taking his foot off the pedal have pounded out three hundreds including a double, in four innings against the Windies. “My family have adopted Australia as their home and they support me, they support the Australian cricket team,” Labuschagne said ahead of the first Test in Brisbane starting on Saturday. “But I certainly think it‘s it’s always exciting what this Test holds because it is a little bit closer to my heart because it’s the country where I grew up and where I spent 10 years of my life.”Labuschagne is also playing as a father for the first time after he and his wife, Rebekah welcomed their first child in September.Their daughter Hallie travelled to Perth and was introduced to his teammates in change rooms during the first Test against the Windies.Labuschagne said being a dad had helped him “switch off” from his cricket obsession, but wouldn’t end it. “When my family‘s with me, certainly the two differences between when they were with me in Perth to when they weren’t with me in Adelaide,” he said. “I got to bed a lot later in Adelaide and I was watching a lot more cricket videos at night.In Perth that wasn‘t the case, I was getting to bed earlier, putting her (Hallie) to bed.“I am who I am is because I am obsessed and I am obsessive, I love to try and get better each time and each day.“I think that part, hopefully it never stops for me because I think that‘s what makes me who I am.” His South African background is also an inescapable part of who is and that wasn’t lost on South African captain Dean Elgar. “He is one of the form batters in the world and I am sure there is going to be a little bit of extra spice knowing he is ex-South African as well,’’ Elgar said.The Proteas skipper also recalled Labuschagne trying to unsettle him in a county game in England by speaking Afrikaans, and suggested they could be a ploy they use during the series. But Labuschagne is ready for whatever they send his way “I‘ve got no doubt that they’re going to throw some curve-balls,” he said. “Hopefully the responses can be either funny or none at all.“","pubDate":"2022-12-14 07:08:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"South Africa star’s explosive Smith ‘milking’ claim","link":"https://www.couriermail.com.au/sport/cricket/smith-milked-it-like-a-soccer-player-south-africa-reopen-sandpapergate-wounds/news-story/14ec0e4f539d8258b675e049e5c7b240","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Faf du Plessis has re-opened the wounds of cricket’s ugliest ever tour by accusing Steve Smith of “milking like a football player” in a showdown with explosive fast bowler Kagiso Rabada.","content":"In all the hypothesising about what events led to the Sandpapergate scandal, perhaps the most underplayed factor was the fury that erupted in the Australian camp two days before the Cape Town Test when Rabada was sensationally cleared at a six-hour appeal hearing of intentionally barging into Smith.On day one of the preceding second Test in Port Elizabeth, a fired-up Rabada made physical contact with Smith’s shoulder after dismissing the batsman, having already given David Warner an aggressive send-off. Rabada was charged over both incidents.“This episode has almost been forgotten against the backdrop of what the series still had up its sleeve, or more accurately, down its trousers,” wrote du Plessis in his recently released book.SCBBL PROMOIn his retelling of the events leading into the Sandpapergate Test, the former Proteas captain accused Smith of deliberately staging for Rabada to be cited by umpires.“They brushed shoulders during one of KG’s overs but Smith milked it like a football player,” wrote du Plessis.“We knew that KG was one demerit point away from a suspension.”A tight-lipped Rabada only added to the anticipation over what might happen when he charges into Smith and Warner at the Gabba this weekend when he told News Corp he will refuse to discuss the heated clash with the world’s best batsman until after he’s retired.“What’s happened has happened,’’ Rabada told News Corp.“I am not going to say anything now. After my career I might talk a bit more about it and look back at what happened. But at the moment we will move on.“It was definitely a Test series I will never forget and things did not end too well off the field.”After originally copping a two match suspension which would have ruled him out of the remainder of the 2018 series, Rabada became one of the first players to ever have an ICC ban successfully overturned.The South Africans lawyered up for a marathon hearing where a bemused Smith was not even invited to give his version of events.Proteas quick Vernon Philander was another to accuse Smith of “milking”; claims the Australian captain rubbished at the time.“The contact was harder than it actually looked on the TV. Whether it was intentional or not that’s not for me to decide,” Smith said following the contentious hearing.“I was going down the other end of the wicket to speak to Shaun (Marsh) who was in with me at the time.“I think when you’ve got someone out you’ve already won the battle. There’s no need to go over the top. I was walking down the other end of the wicket, I certainly didn’t change my line or anything.“… The ICC have set the standard, haven’t they? There was clearly contact out in the middle. I certainly won’t be telling my bowlers to go out there and after you take a wicket go and get in their space. I don’t think that is on and part of the game.”Rabada said in the wake of the incident that he would not change his emotional reactions after taking wickets.Sandpaper timeline“No I won’t change the way I express myself. I will just get far away from the batter.”Smith told News Corp earlier this summer that he would not be intimidated should Rabada try and get in his face again.“Nah, I guess it’s all part of it. Chill out and go about your business and try and play,” said Smith.“That’s pretty much it. Just play the game.“He’s (Rabada) a competitor. He’s a terrific bowler. You just have to look at his record and he’s always at you.“It’s going to be a good summer with both their attack and our attack going at it. It should make for some entertaining cricket.”Smith admitted this week he has been troubled more by South Africa’s hostile bowlers than any other attack he’s faced.“South Africa’s probably the one team that have bowled pretty well to me in the past, my record’s probably not quite as good against them as some of the others,” Smith said.Only one of Smith’s 29 career Test hundreds has come against South Africa.","pubDate":"2022-12-14 07:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"England's Wood considered quitting test cricket during injury layoff","link":"https://www.channelnewsasia.com/sport/englands-wood-considered-quitting-test-cricket-during-injury-layoff-3143836","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-12-14 06:49:48","image_url":"https://onecms-res.cloudinary.com/image/upload/s--L49zK2CU--/c_fill,h_900,w_1600/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/v1/one-cms/core/2022-12-14t064948z_1_lynxmpeibd07w_rtroptp_3_cricket-test-pak-eng.jpg?itok=0HlboxJU","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Shaun Udal exclusive: 'I have dark days but cricket has been fantastic to me'","link":"https://uk.sports.yahoo.com/news/shaun-udal-exclusive-dark-days-061748494.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-12-14 06:17:48","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"England’s Andrew Flintoff rushed to hospital after Top Gear accident","link":"https://www.iol.co.za/sport/cricket/international/englands-andrew-flintoff-rushed-to-hospital-after-top-gear-accident-1483dbd6-c063-41f3-9e7f-c41254143c2e","keywords":null,"creator":["AFP"],"video_url":null,"description":"English cricket legend Andrew Flintoff has been taken to hospital after an accident.","content":null,"pubDate":"2022-12-14 05:39:45","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/cef16bad-ba24-5027-badd-474e5845041f&operation=CROP&offset=0x0&resize=1011x569","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"‘Times have changed,’ but AFL, NRL unlikely to follow cricket’s COVID lead","link":"https://www.watoday.com.au/sport/cricket/times-have-changed-but-afl-nrl-unlikely-to-follow-cricket-s-covid-lead-20221214-p5c66r.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Roy Ward"],"video_url":null,"description":"The sight of cricketers Marcus Stoinis and Joe Burns playing after testing positive to COVID-19 on Tuesday was a shock to some, but the AFL is expecting its club doctors will keep infectious players away from teams.","content":"The vision of Melbourne Stars duo Marcus Stoinis and Joe Burns shivering by themselves as they played a Big Bash game after testing positive for COVID-19 on Tuesday night made for unusual viewing for Australians. However, while experts say the dramatic shift from the way Australian sports and leagues dealt with positive COVID-19 cases in previous seasons reflects the change in Australian attitudes, it’s unlikely the winter codes will be allowing players to run out while sick in 2023. Joe Burns and Marcus Stoinis had a miserable night after testing positive to COVID Credit: Getty Images Competitions such as the AFL and NRL are preparing to deal with COVID-19 in 2023 without state-based health orders making it compulsory for positive cases to isolate. The AFL said on Wednesday that club doctors would be tasked with treating players who test positive but the expectation is any positive players would be immediately sent home just as players with colds or gastro cases are treated. “The health and safety of players, officials, fans, and the wider community is paramount,” the AFL said in a statement. “Therefore, the AFL will continue to closely monitor the situation with respect to COVID-19 and act in accordance with advice from government and medical experts. As a baseline principle, all players and club staff must comply with the requirements, rules, and instructions of the relevant authority (being the applicable government authority or body) in their state, and in any state to which they travel during their 2023 season. Gurinder Sandhu (20 not out and 2-23) steered the Thunder to victory in a low-scoring thriller Credit: Getty Images “If an individual tests positive to COVID-19, and in the absence of mandatory isolation directed by relevant authorities, the club doctor is responsible for monitoring the individual’s symptoms and subsequent recovery from COVID-19. “The club doctor is also responsible for managing the individual’s return to the AFL or AFLW program in an appropriate manner on a case-by-case basis (as is the process for other illnesses).","pubDate":"2022-12-14 05:37:42","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Leadership has changed England captain Ben Stokes from ‘alpha male’ to master psychologist","link":"https://www.nzherald.co.nz/sport/cricket-leadership-has-changed-england-captain-ben-stokes-from-alpha-male-to-master-psychologist/NC5B3R5MNFHJZKXDOR6VHEZ4NY/","keywords":null,"creator":null,"video_url":null,"description":"Stokes' approach has not just transformed England, but also surprised teammates.","content":null,"pubDate":"2022-12-14 05:00:25","image_url":"https://www.nzherald.co.nz/resizer/v2RgINOZeZYXykHo7OdaFYIV54o=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/4SRORJBJD5BM5IJXZXVAQ2Q63Y.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"IND v BAN, 1st Test: India wins toss, elects to bat first","link":"https://telanganatoday.com/ind-v-ban-1st-test-india-win-toss-elect-to-bat-first-include-three-spinners-with-two-pacers","keywords":["Cricket","News","Sport","'false' Covid tests","Bangladesh","India","K L Rahul"],"creator":["IANS"],"video_url":null,"description":"After winning the toss for the first time on this tour, Rahul said India are playing three spinners -- Ravichandran Ashwin, Axar Patel and Kuldeep Yadav -- along with two fast bowlers in Umesh Yadav and Mohammed Siraj.","content":"Home | Cricket | Ind V Ban 1st Test India Win Toss Elect To Bat First Include Three Spinners With Two Pacers IND v BAN, 1st Test: India wins toss, elects to bat first After winning the toss for the first time on this tour, Rahul said India are playing three spinners -- Ravichandran Ashwin, Axar Patel and Kuldeep Yadav -- along with two fast bowlers in Umesh Yadav and Mohammed Siraj. By IANS Updated On - 10:09 AM, Wed - 14 December 22 Photo: Twitter Chattogram: India’ s stand-in captain K.L. Rahul has won the toss and elected to bat first in the Test series opener against Bangladesh at the Zahur Ahmed Chowdhury Stadium here on Wednesday. After winning the toss for the first time on this tour, Rahul said India are playing three spinners — Ravichandran Ashwin, Axar Patel and Kuldeep Yadav — along with two fast bowlers in Umesh Yadav and Mohammed Siraj. Also Read Facing open revolt in Hyderabad Cricket Association, Azharuddin remains defiant You are the greatest of all time for me: Kohli pens emotional note for Ronaldo Anushka Sharma wishes Virat Kohli on 5th wedding anniversary in quirkiest way possible “Looks like a good wicket and we’ll put the runs on the board and use the footmarks later on to get wickets. They’ve been a few injuries but that gives an opportunity to the other guys,” he said. Bangladesh skipper Shakib Al Hasan stated if he had won the toss, he would also have opted to bat first. “But we’ll try to get some early wickets. If you got into the history (of this ground), more wickets have fallen on the opening day (than on the final). We will try to get early wickets and put them under pressure,” he said. “It’s a little difficult (to adapt from white-ball cricket), we’re playing a Test after a big gap of five months but we’ve prepared well. This is an important series hopefully we can put some WTC points,” he added. For Bangladesh , top-order batter Zakir Hasan, who made a heroic 173 to force a draw against India A in a four-day match at Cox’s Bazar, is making his Test debut, making him the 101st cricketer in this format from his country. While India will be opening with Rahul and Shubman Gill, Bangladesh have dropped Mahmudul Hasan Joy to have their opening pair in Zakir and Najmul Hossain Shanto. India are playing Tests after five months, while Bangladesh are featuring in the format after nearly six months. India need to win their remaining six Tests (or even five victories with a draw) – two in Bangladesh and four against Australia at home in February-March next year – to be in contention for the World Test Championship final to be played at The Oval in June 2023. Playing XIs: India: Shubman Gill, K.L. Rahul (c), Cheteshwar Pujara, Virat Kohli, Shreyas Iyer, Rishabh Pant (wk), Axar Patel, Ravichandran Ashwin, Kuldeep Yadav, Umesh Yadav, Mohammed Siraj Bangladesh: Zakir Hasan, Najmul Hossain Shanto, Litton Das, Shakib Al Hasan (c), Mushfiqur Rahim (wk), Yasir Ali, Nurul Hasan, Mehidy Hasan Miraz, Taijul Islam, Khaled Ahmed, Ebadot Hossain Follow Us : Tags 'false' Covid tests Bangladesh India K L Rahul Related News Editorial: Covid not yet over India-China troops clash in Tawang sector, soldiers from both sides injured Editorial: Reining in the tech giants Gmail goes down for users globally, India too IND v BAN, 3rd ODI: India crush Bangladesh by 227 runs, hosts take series 2-1 IND v BAN, 3rd ODI: Ishan Kishan double hundred, Virat Kohli century propel India to 409/8","pubDate":"2022-12-14 04:00:53","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Australia 3rd T20I: Plenty of work still to do for hosts despite famous Super Over win","link":"http://www.firstpost.com/firstcricket/sports-news/india-vs-australia-3rd-t20i-plenty-of-work-still-to-do-for-hosts-despite-famous-super-over-win-11801151.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Australia 3rd T20I: Plenty of work still to do for hosts despite famous Super Over win","content":"Cricket India vs Australia 3rd T20I: Plenty of work still to do for hosts despite famous Super Over win India won the second T20I against Australia in a Super Over to level the five-match series 1-1. FirstCricket Staff December 14th, 2022 9:20:23 IST The India-Australia T20 series is currently tied 1-1. Image: BCCI It was in a spectacular fashion that India levelled the five-match T20I series, 1-1 against Australia. Asked to chase a target of 188, India didn’t let past failures dictate terms as they held onto the nerves to first tie the match and then clinch the Super Over to secure one of the best wins in their history. Quite often India had been guilty of succumbing to pressure and losing matches from winning positions against Australia, but not on Sunday. In front of an unprecedented 47,000+ fans at the DY Patil Stadium , Harmanpreet Kaur and Co produced a performance that should surely inspire a few more to take up the sport. But as they move from Navi Mumbai to Mumbai for the third T20I of the match, they also need to move on quickly from the win. Consistency needed with bat Scoring big, batting first or second, had been an issue for India. With scores of 172 and 187 in the first two matches of the series respectively and by consistently scoring 150+ totals this year, India have shown that they can are close to decoding the winning total puzzle in the T20I format. Still, they can only be fully confident of their abilities if they can do this consistently against Australia, the T20 and ODI world champions. In fact, Australia chased down a target of 173 in the first ODI and scored 187 in the second with ease, by losing just one wicket in both matches. For India, the big scores have been a result of some inspired late-order batting by Richa Ghosh and Deepti Sharma coupled with openers Smriti Mandhana and Shafali Verma giving the team good starts. To score big consistently, India will need Jemimah Rodrigues to quickly find her scoring touch while Devika Vaidya who has been picked ahead of Yastike Bhatia would be looking to make an impact with the bat. All-round effort needed Australia are the gold standard in women’s cricket and for India to be like them, it will take a well-rounded team. While batters have put up the runs, the bowling has been quite underwhelming. Feilding has been horrendous. Deepti and Vedika are the only Indian bowlers to take a wicket each in two matches so far. Pacers Renuka Singh, Anjali Sarvani and Meghna Singh have all gone for runs and are yet to take a wicket. Despite Australia’s formidable batting lineup, the stats of Indian bowlers leave much to be desired. It’s possible that may include left-arm spinner Rajeshwari Gayakwad in the squad for Meghna Singh as the Brabourne Stadium may not offer a belter of the pitch like DY Patil ground. Whatever the mix, it’s important for Indian bowlers to pull up their socks. Similarly, fielding has not been up to the mark in the first two games. India’s fielding has improved drastically in recent years but there are occasional dips in the performance and that is not something that you can afford against Australia. Squads Australia: Alyssa Healy (c), Tahlia McGrath (vc), Darcie Brown, Nicola Carey, Ashleigh Gardner, Kim Garth, Heather Graham, Grace Harris, Jess Jonassen, Alana King, Phoebe Litchfield, Beth Mooney, Ellyse Perry, Megan Schutt, Annabel Sutherland India: Harmanpreet Kaur (c), Smriti Mandhana (vc), Shafali Verma, Yastika Bhatia, Jemimah Rodrigues, Deepti Sharma, Radha Yadav, Rajeshwari Gayakwad, Renuka Singh Thakur, Meghna Singh, Anjali Sarvani, Devika Vaidya, S Meghana, Richa Ghosh, Harleen Deol The 3rd T20I will start at 7 PM and will be shown live on Star Sports and Disney+ Hotstar. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 14, 2022 09:20:23 IST Tags: India Vs Australia India Women Vs Australia Women Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-14 03:50:23","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/India-women-vs-Aus-640_Twitter-@BCCIWomen.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Former England cricketer Andrew Flintoff hurt in Top Gear accident","link":"https://www.tribuneindia.com/news/sports/former-england-cricketer-andrew-flintoff-hurt-in-top-gear-accident-460891","keywords":null,"creator":null,"video_url":null,"description":"London, December 14 Former England cricketer Andrew \"Freddie\" Flintoff has been hospitalised after an accident that occurred during filming for the BBC show 'Top Gear'. The 45-year-old TV presenter was involved in the accident on Tuesday at the show's test track at Dunsfold Aerodrome in Surrey. \"Freddie was injured in an accident at the Top Gear test track this morning — with crew medics attending the scene immediately,\" the BBC said in a statement. \"He has been taken to hospital for further treatment and we will confirm more details in due course.\" The BBC reported that Flintoff's injuries are not life-threatening. Flintoff, who played 79 Tests and 141 limited-overs internationals, retired from international cricket in 2009. He was the 2005 Ashes player of the series.","content":null,"pubDate":"2022-12-14 03:42:29","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1019166047.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh LIVE score 1st Test Day 1: IND look for a positive start vs BAN","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-live-score-1st-test-match-day-1-ind-vs-ban-test-cricket-series-2022-latest-updates-11803721.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh LIVE score 1st Test Day 1: IND look for a positive start vs BAN","content":"Bangladesh Vs India LIVE SCORE (test) Quick Scorecard Full scorecard Ball by ball commentary FP commentary Bangladesh Vs India At Zahur Ahmed Chowdhury Stadium, Chattogram, 14 December, 2022 14 December, 2022 Starts 09:00 (IST) Play In Progress India 11/0 (3.3 ov) 1st Test Bangladesh Yet To Bat Live Blog India Bangladesh 11/0 (3.3 ov) - R/R 3.14 Play In Progress KL Rahul (C) - 8 Shubman Gill - 3 This Over Batting Status R B 4s 6s KL Rahul (C) Batting 8 9 2 0 Shubman Gill Batting 3 12 0 0 Bowling 0 M R W Ebadot Hossain 2 0 6 0 Khaled Ahmed 1.3 0 5 0 Current Partnership Last Wicket 0/0 (0) 11 (11) R/R: 3.14 KL Rahul (C) 8(9) Shubman Gill 3(12) 0 0(0) S.R (0) India vs Bangladesh LIVE score 1st Test Day 1: KL Rahul, Shubman Gill begin proceedings for IND vs BAN India vs Bangladesh, 1st Test, Day 1, Live cricket score and updates, ball by ball commentary: Hello and welcome to the LIVE COVERAGE of the first Test between India and Bangladesh Live Updates Highlights 09:05 (IST) India vs Bangladesh LIVE KL Rahul is off the mark with a boundary. Ebadot misses his line and length completely as it goes down the leg. KL just helps it on its way to the boundary behind Full Scorecard 09:00 (IST) India vs Bangladesh We are moments away from LIVE ACTION. Shubman Gill and KL Rahul will open the innings for India. Ebadot will bowl the first over Full Scorecard 08:49 (IST) India vs Bangladesh LIVE Playing XI Bangladesh: Zakir Hasan, Najmul Hossain Shanto, Litton Das, Shakib Al Hasan(c), Mushfiqur Rahim, Yasir Ali, Nurul Hasan(w), Mehidy Hasan Miraz, Taijul Islam, Khaled Ahmed, Ebadot Hossain Full Scorecard 08:36 (IST) India vs Bangladesh LIVE Playing XI India: Shubman Gill, KL Rahul(c), Cheteshwar Pujara, Virat Kohli, Shreyas Iyer, Rishabh Pant(w), Axar Patel, Ravichandran Ashwin, Kuldeep Yadav, Umesh Yadav, Mohammed Siraj Full Scorecard 08:32 (IST) IND vs BAN So, the news from the Centre is that India have won the toss and they will bat first. \"We'll bat first. Looks a good wicket, put runs on the board,\" says KL Rahul at the toss Full Scorecard 08:29 (IST) India vs Bangladesh The home side has a debutant. Zakir Hasan has been handed his Test debut and receives the cap from Shakib Al Hasan Full Scorecard 08:27 (IST) Test-mode 🔛 Preps done, all set for the #BANvIND Test 👌 #TeamIndia pic.twitter.com/yqX2iDXYrm — BCCI (@BCCI) December 13, 2022 Full Scorecard 08:15 (IST) Hello and welcome to the LIVE COVERAGE of the first Test between India and Bangladesh Full Scorecard Highlights India vs Bangladesh, 1st Test, Day 1, LIVE Score: IND take on BAN in Chattogram. (Photo Source: BCCI/Twitter) PREVIEW : India and Bangladesh are all set to lock horns with each other in the first Test of the two-match series in Chattogram. The hosts clinched the ODI series after beating India 2-1 and will look to replicate the same in the Tests as well. On the other side, India will look for a positive start. The visitors have faced some injury issues with the likes of Jasprit Bumrah and Mohammed Shami being ruled out while captain Rohit Sharma unavailable for selection for the first Test due to a thumb injury. KL Rahul will lead the side in Rohit’s absence while Cheteshwar Pujara has been named his deputy. SQUADS: India: Shubman Gill, KL Rahul(c), Cheteshwar Pujara, Virat Kohli, Shreyas Iyer, Rishabh Pant(w), Axar Patel, Ravichandran Ashwin, Shardul Thakur, Umesh Yadav, Mohammed Siraj, Kuldeep Yadav, Srikar Bharat, Navdeep Saini, Abhimanyu Easwaran, Saurabh Kumar Bangladesh: Najmul Hossain Shanto, Mahmudul Hasan Joy, Mominul Haque, Anamul Haque, Shakib Al Hasan(c), Litton Das, Mushfiqur Rahim(w), Mehidy Hasan Miraz, Taijul Islam, Ebadot Hossain, Khaled Ahmed, Shoriful Islam, Nurul Hasan, Yasir Ali, Zakir Hasan, Rejaur Rahman Raja Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 14, 2022 09:06:16 IST Tags: Cricket India Vs Bangladesh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-14 02:50:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/India-vs-Bangladesh-1st-Test-Day1-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India-Bangladesh Test clash today","link":"https://thenewsglory.com/india-bangladesh-test-clash-today/","keywords":["Sports","Bangladesh","India","Test match"],"creator":["The News Glory"],"video_url":null,"description":"Chatogram: The first match of the 2-Test series between India and Bangladesh will start at 9 am today in Chattogram. Indian cricket team is touring Bangladesh. The two teams will face each other in a 2-Test series. The first match will start today at 9 am at Jaghur Ahmed Stadium in Chattogram. The Bangladesh series […]","content":"Chatogram : The first match of the 2-Test series between India and Bangladesh will start at 9 am today in Chattogram. Indian cricket team is touring Bangladesh. The two teams will face each other in a 2-Test series. The first match will start today at 9 am at Jaghur Ahmed Stadium in Chattogram. The Bangladesh series is crucial for the Indian team to qualify for the World Test Championship final. India are currently 4th in the World Test Championship points table. Australia, South Africa and Sri Lanka are the top 3 teams. To qualify for the final in June 2023, India will need to win the 2nd Test against Bangladesh and the next 4th Test against Australia. Only if they win all these 6 matches can they directly qualify for the final without waiting for the results of the other teams. Team India’s journey to qualify for the World Test Championship final begins today at the Jharkhand Stadium. This ground is good for batting. However, it will give way to the whirlwind in the last days. Bangladesh have yet to win a Test match against India. However, the absence of Rohit Sharma, Jasprit Bumrah, Mohammad Shami and Ravindra Jadeja due to injury may give the Indian team some setback. Jadeja’s absence on such a pitch could put the opposition’s 3rd and 4th innings batting at a disadvantage. However, Axar Patel may try to fill Jadeja’s place. Apart from this, in the absence of Rohit Sharma, the Indian team is led by KL Rahul. Kuldeep Yadav or Saurabh Kumar could be in place if India decide to go with a 3rd spinner. Left-arm spinner Saurabh Kumar recently took 15 wickets in the 2-Test series against Bangladesh ‘A’. Perhaps Jaydev Unathkat or Navdeep Saini could be in place along with Umesh Yadav and Mohammad Siraj if India decide to go with 3 fast bowlers. Shubman Gill, Cheteshwar Pujara, Virat Kohli, Shreyas Iyer, Rishabh Pant can add strength in the batting.","pubDate":"2022-12-14 02:24:37","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"}]}