{"newsArray":[{"article_id":"2d5faabd0646bda11dc853142e7bfb5a","title":"Mauricio Pochettino wants managers ‘involved in decisions’ around referee reform","link":"https://www.northwaleschronicle.co.uk/sport/national/23947443.mauricio-pochettino-wants-managers-involved-decisions-around-referee-reform/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have been involved in a number of controversial fixtures this season.","content":"Mauricio Pochettino believes Premier League managers should be invited to play a more active role in helping shape refereeing guidelines. Chelsea have been involved in a number of controversial fixtures this season, most notably the frenetic 4-1 win away at Tottenham earlier in November in which Spurs had two players sent off, five goals were disallowed and VAR made nine interventions across a match that lasted over 110 minutes. Pochettino has previously complained that the league’s request to meet with coaches in the week before the beginning of the season to discuss changes allowed little room for constructive input from managers and their clubs. The current campaign has seen a barrage of complaints directed at on-field and VAR officials, with referees coming under almost unprecedented scrutiny following a string of errors, particularly relating to the influence of the video referee on the decision-making process. “We all have full respect for the referees, we understand perfectly that their job is really tough,” said Pochettino, whose team face Newcastle at St James’s Park on Saturday. “But the problem is you get frustrated sometimes during the game because of the VAR. The referee is not responsible sometimes. You cannot complain to the VAR. That is a problem. “I’m going to try and control more my emotions. I think all the coaches respect the referees because they’re in a really difficult situation. Training for Tyneside. ✊ — Chelsea FC (@ChelseaFC) “I think sometimes we are frustrated. I think coaches need to be more involved in the decisions, and to work together during the season. “It is not (ideal) to arrive the week before the start of the Premier League season and say, ‘OK, the new rules are this. What do you think?’. Nothing, because you have already made the decision. Like the rule that there can only be one coach (in the technical area). Why? “England was always different about the relationship with the referee. You can talk, you can (previously) have four people in the dugout. Which way do we want to evolve in the Premier League? “England is different. Not only because you drive on the right (of the car), but because of the relationship in football. It is the gentleman’s game.” Despite those frustrations, and the ongoing confusion surrounding the proper implementation of VAR and its interpretation of the game’s rules, Pochettino acknowledged that the emotional side of football is ultimately what props up the business side of the sport. “I think people look at football and understand that it is a big business,” he said. “The sport is very honest, with rules. But around that it is a business that we cannot stop. “If the sport doesn’t produce that emotion it is producing, it is difficult to talk about it in this way, to have the chance to have good salaries, to give also to society. “Football provides people with happiness and that is the most important thing. We are all part of this business.”","pubDate":"2023-11-24 23:39:58","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17482675/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"58450b1bc83cef7ccc2fcce694724eed","title":"Mauricio Pochettino wants managers ‘involved in decisions’ around referee reform","link":"https://www.southwalesguardian.co.uk/sport/national/23947443.mauricio-pochettino-wants-managers-involved-decisions-around-referee-reform/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have been involved in a number of controversial fixtures this season.","content":"Mauricio Pochettino believes Premier League managers should be invited to play a more active role in helping shape refereeing guidelines. Chelsea have been involved in a number of controversial fixtures this season, most notably the frenetic 4-1 win away at Tottenham earlier in November in which Spurs had two players sent off, five goals were disallowed and VAR made nine interventions across a match that lasted over 110 minutes. Pochettino has previously complained that the league’s request to meet with coaches in the week before the beginning of the season to discuss changes allowed little room for constructive input from managers and their clubs. The current campaign has seen a barrage of complaints directed at on-field and VAR officials, with referees coming under almost unprecedented scrutiny following a string of errors, particularly relating to the influence of the video referee on the decision-making process. “We all have full respect for the referees, we understand perfectly that their job is really tough,” said Pochettino, whose team face Newcastle at St James’s Park on Saturday. “But the problem is you get frustrated sometimes during the game because of the VAR. The referee is not responsible sometimes. You cannot complain to the VAR. That is a problem. “I’m going to try and control more my emotions. I think all the coaches respect the referees because they’re in a really difficult situation. Training for Tyneside. ✊ — Chelsea FC (@ChelseaFC) “I think sometimes we are frustrated. I think coaches need to be more involved in the decisions, and to work together during the season. “It is not (ideal) to arrive the week before the start of the Premier League season and say, ‘OK, the new rules are this. What do you think?’. Nothing, because you have already made the decision. Like the rule that there can only be one coach (in the technical area). Why? “England was always different about the relationship with the referee. You can talk, you can (previously) have four people in the dugout. Which way do we want to evolve in the Premier League? “England is different. Not only because you drive on the right (of the car), but because of the relationship in football. It is the gentleman’s game.” Despite those frustrations, and the ongoing confusion surrounding the proper implementation of VAR and its interpretation of the game’s rules, Pochettino acknowledged that the emotional side of football is ultimately what props up the business side of the sport. “I think people look at football and understand that it is a big business,” he said. “The sport is very honest, with rules. But around that it is a business that we cannot stop. “If the sport doesn’t produce that emotion it is producing, it is difficult to talk about it in this way, to have the chance to have good salaries, to give also to society. “Football provides people with happiness and that is the most important thing. We are all part of this business.”","pubDate":"2023-11-24 23:39:58","image_url":"https://www.southwalesguardian.co.uk/resources/images/17482675/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a3dd723830ac3d7c7cc137b742a2419b","title":"Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game","link":"https://www.dailymail.co.uk/sport/live/article-12788321/Miami-Dolphins-New-York-Jets-live-result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Relive all the action from the Dolphins 34-13 rout of the New York Jets as the hosts' offensive woes continue under Tim Boyle in the NFL's first ever Black Friday game with DailyMail.com's live blog.","content":"Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game By Isabel Baldwin For Dailymail.Com Published: 19:03, 24 November 2023 | Updated: 23:25, 24 November 2023 e-mail 2 View comments Relive all the action from the Miami Dolphins 34-13 rout of the New York Jets as the hosts' offensive woes continue under quarterback Tim Boyle in the NFL's first ever Black Friday game with DailyMail.com's live blog. 23:21 Goodnight! That's all from us! Aaron Rodgers may be desperately working to return from injury but after today's game he may not want to. Hopes of seeing the quarterback playoffs took a huge blow as it looks like the Jets won't even be seeing the postseason themselves. Meanwhile, Micke McDaniel will be heading back to SoFlo on Cloud Nine as his Dolphins helped their chances of taking a home field advantage into the postseason. 23:05 FINAL: Dolphins 34-13 Jets It's the same old story in New York. The Jets's switch of Tim Boyle for zach Wilson has reaped no rewards. It's a new quarterback but same old offensive issues in East Rutherford. Meanwhile, the dangerous Dolphins improved to 8-3. 22:55 TOUCHDOWN! Dolphins 34-13 Jets Most of the crowd has filed out into the parking lot by this point. Miami piles on the misery for New York by following up the Jets' first offensive touchdown of the game by scoring just one minute later. Mosert puts the icing on the cake of an impressive performance for the Dolphins by running it in for a 34-yard touchdown and his second of the game. He even has time to taunt New York's Tony Adams by slowing his pace and sending the defensive back zig zagging right on the line. 22:52 Holland heads to the medical tent Meanwhile, Jevon Holland - the hero of the game's Hell Mary - has entered the medical tent and has been listed as questionable to return with a knee injury. 22:47 TOUCHDOWN! Dolphins 27-13 Jets The Jets forced another Tua Tagovailoa turnover in the fourth quarter when he fumbled and Ashytn Davis recovered. It's Jets possession and Garrett Wilson tries to haul in a pass in the end zone but is well covered by Elliott and it's ruled incomplete. But the Jets manage to set up first-and-goal on the next play. This time Boyle does manage to find Wilson in the end zone for the Jets' first offensive touchdown of the game. It's only taken them 55 minutes... 22:43 Umpire left bloodied at skirmish Umpire Carl Paganelli appears to have been caught on the mouth and left with a cut during that scuffle between Mosley and Clemons. The referee was seen spitting blood following the skirmish. Clemons was ejected for making contact with an official but it's unclear if Paganelli's injury resulted from Clemons' contact. 22:36 Dolphins interception Well, that was at least some sign of life from the Jets. Boyle manages to string together a 17-play, seven-minute play before makes the interception. Well, it was good while it lasted. For those of you still keepig count, that brings the Jets' tally to six punts and two interceptions through eight offensive possesions. 22:31 Phillips carted off in tears On the replay, Phillips appears to have torn something after a pass rush step and could be looking at a season-ending injury. The 24-year-old is in tears as he taken off the field on the back of the golf cart. 22:26 Jaelan Phillips is down The Dolphins lineback has gone down on the field and remains down. It does not look good for Phillips with the entire sideline on the field to check on hgim and th cart has come out. He's now carted off with what appears to be a lower leg injury. The MetLife turf claims yet another victim. 22:11 TOUCHDOWN! Dolphins 27-6 Jets Tagovailoa hands off to Mostert, who weaves his wy through the Jets defense and into the end zone to open the Dolphins' final quarter with a rushing touchdown. It rounds off a 15-play, 92-yard drive that lasted nine minutes and sees them go up three scores. And tensions are clearly runmning high for New York now as the extra point sparks a scuffle. C.J. Mosley and Micheal Clemons are flagged for personal fouls, with Clemons' penalty also enforced because it occurrs against an official. 22:10 End of the third quarter Not too much to report from the third quarter. Well, nothing Jets fans will want to hear anyway. The Dolphins dominated possession, having the ball for 13 minutes of the quarter and they'll have a first-and-10 from the Jets' 14-yard line when the fourth quarter begins. The Jets... well do I really need to say? 22:06 Tua is playing through the pain Miami Dolphins QB Tua Tagovailoa suffers GRUESOME cut on his arm WARNING - GRAPHIC CONTENT: Miami Dolphins quarterback Tua Tagovailoa was left bloodied in the NFL's first ever Black Friday game, after suffering a gruesome cut on his right arm. Mail Online 21:58 Jets start their second half in the same woeful fashion as the first Boos are echoing around MetLife Stadium now as Jets fans are forced to suffer through yet another woeful drive that ends in, you guessed it, another punt. That's the sixth of the game. The Jets’ first drive after halftime lasted just three plays, including Wilkins' brutal sack on Boyle before New York punts once again. New York's seven offensive possessions have ended with punts and the interception for a six pick return. Where's Zach Wilson? At least he could get them within goal range... sometimes. 21:48 FIELD GOAL! Dolphins 20-6 Jets It's a Dolphins drive to start the third quarter but Bryce Huff records a sack on Tagolvailoa to force a Jason Sanders field goal. Sanders' 54-yard attempt is straight down the middle and the Dolphins extend their lead to 20-6. Miami traveled seven plays and 39 yards in just under four minutes, including a Jaylen Waddle 32-yard connection on third down. 21:42 Safe to say Jevon Holland enjoyed that one... 21:40 HALFTIME: Dolphins 17-6 Jets Crushing end to the first half for the hosts. Just as the Jets looked to have clawed their way back into the game with Echols' pick six handing them a lifeline, Tom Boyle's intercepted Hail Mary knocks them back once again. New quarterback, same old problems for New York. 21:27 TOUCHDOWN! Dolphins 17-6 Jets Unbelievable scenes at MetLife Stadium as the Dolphins swiftly follow up the Jets' pick-six with one of their own. The Jets attempt a Hail Mary with two seconds left on the clock in the second quarter... which turns into a 99-yard pick-six for the Dolphins. Boyle launches it down the field in a desperate attempt to find someone - anyone - in the end zone, and he finds exactly the wrong person as Holland intercepts the ball before charging the entire length of the field. New York flails around the field as they fail to stop Holland and he cruises into the end zone. Crushing blow for the Jets defense, who have their pick six rewarded by their offense throwing one. 21:19 TOUCHDOWN! Dolphins 10-6 Jets The Jets are finally on the board. I repeat, the Jets are FINALLY on the board. Echols picks off Tua, who tries to find Berrios, and walks it into the end zone to score the first touchdown for the Jets. They fail to close the gap further however, as Zuerlein misses the kick. In his defense, he's not had much practice kicking extra points this season. MetLife Stadium finally has something to cheer about... it's been a while. 21:07 And the calls from Jets fans for Zach Wilson's return have already begun 21:06 Jets punt... AGAIN Jaelan Phillips catches Boyle by surprise, breaking through the Jets' o-line and gets a hand to the quarterback's pass to tip it at the line pof scrimmage He can't quite reel in the ball for the interception... but the drive ends with a fourth consecutive punt. 20:59 Take a look at the first TD of the game 20:54 TOUCHDOWN! Dolphins 10-0 Jets Tagovailoa finds Hill for the receving touchdown to extend the Dolphins' lead to 10-0. Hill hauls in the ball and evades the tackle from Jordan Whitehead, sending the safety sprawling and jogs into the end zone. It marks the wide receiver's 10th receiving touchdown of the season and he celebrates by handing the scoring ball to his new wife, Keeta, in the stands. 20:51 Aaron Rodgers all smiles on the sidelines 20:49 End of the first quarter The Jets' third drive starts with a five yard loss after Breece Hall dropped a handoff from Tim Boyle, they fumbled on first down and recovered. On third-and-ten, Brownlee was flagged for a false start and at the end of the first quarter the Dolphins still lead 3-0 - and have barely been threatened by the Jets. 20:47 Tua hits the 3,000-yard mark Tua Tagovailoa hits the 3,000-yard mark for the seocnd consecutive season. The quarterback becomes the first Dolphins player not called Dan Marino to throw for 3,000-plus yards in the first 11 games of a season. 20:40 FIELD GOAL! Dolphins 3-0 Jets There's finally some points on the board! After the previous decision to go for it on fourth down failed, McDaniel opts for a different approach. On a fourth-and-1 from the Jets’ 20-yard line, the Dolphins go for a 38-yard field goal which is safely through the posts. 20:38 New York punts The Dolphins offense may not be soring any points - yet - but the defense nearly does. aelan Phillips and Bradley Chubb nearly sack Tim Boyle in the end zone for a safety. The Jets QB manages to heave the ball away to keep the Jets drive alive - just - but a couple of plays later New York punts AGAIN. 20:33 Jets force the turnover Tagovailoa can't lead the Dolphins into the endzone and on fourth-and-goal, Mike McDaniel opts to go for it. But Hill can't make the catch with the ball slipping through his hands. The Jets force the turnover, taking over from their own five-yard line. 20:30 Tua playing through a slash to his arm Tua is proving just how tough he is as the Miami quarterback is spotted playing on despite bearing a deep gash on his right arm. It's not clear how the signal caller sustained the cut but he has been sporting since the first drive. It looks like the lefty is missing a chunk out of his arm - right in the middle of his tattoo sleeve. 20:27 Sauce saves the TD Sauce Gardner bails out the Jets with great on-on-one coverage with Hill in the end zone to prevent th Dolphins touchdown on fourth down. 20:21 Hill comes hopping off Reed is fortunate just to catch up with him before managing to bring him down with a tackle from behind. Hill comes hobbling off and looks to be in some pain on the sideline. But Dolphins fans can rest easy as Hill sits out just the on play before he comes running back on. He had a quick exam on his left foot before being given the all clear to return. Medicare express. 20:20 Robert Saleh throws a challenge flag The Jets head coach has gone early with his challenge. Saleh has challenged a five-yard catch from Raheem Mostert, which was originally ruled a catch, with Mostert havign recoevered his own fumble. But the gamble pays off as the clall is overruled, saving Saleh from looking like a fool with such an early challenge in the first quarter. The catch was overturned and ruled an incomplete pass. Dolphins now have second-and-ten from their own 26-yard line. 20:14 Dolphins take over Tim Boyle's first start since 2021 featured one first down and the Jets first drive is over. On a third-and-long the Jets fail to convert in a critical spot - story of the season - and the hosts are forced to punt, which doesn't even cross the 50 yard line. Now it's Tua Tagovailoa's turn to come out with the Dolphins taking over from their own 15-yard line. 20:08 Jets' First Down Boyle, who is chanelling his inner Aaron Rodgers with a hard count, finds Brownlee, who is getting a chance today due to Lazard's healthy scratch, on 3&2. There's a flag on the play, offisde for the Dolphins' defense. And that is a Jets' first down! 20:05 We're underway! And it's the Jets who receive as Tim Boyle begins his first drive as New York's starting QB... but the hosts' first play only makes it one yard. 19:53 Where it all went wrong for Wilson... How it all went wrong for Zach Wilson with the New York Jets For Zach Wilson, the 2023 season was supposed to be a kind of football rehab. Instead the New York Jets quarterback has been tossed back into the fire, where his struggles only worsened. Mail Online 19:49 Miami's MetLife takeover The Dolphins fans have hit the Big Apple in their droves today as they look to have overtaken MetLife Stadium. 19:42 Zach Wilson doesn't believe he's 'scapegoated' for New York Jets' offensive woes Tim Boyle will be suiting up as QB1 for New York this afternoon after Zach Wilson was demoted. But Wilson doesn't think he's being 'scapegoated' by his demotion to the teams' third-string. 'I don't think I was scapegoated. Absolutely not,' Wilson said Tuesday. 'You've got to look at the situation. We're not scoring touchdowns.' 'Regardless of what I'm doing, my job as a quarterback is to help us score points,' Wilson continued. 'I can sit here and say I've had a bunch of growth and tremendous whatever this year, but if you're not scoring touchdowns, it doesn't matter.' 19:30 Aaron Rodgers is in the house The quarterback is once again at MetLife Stadium to cheer on his teammates from the sideline. The veteran has been sidelined since Week 1 when he tore his Achilles just four plays into his Jets debut. Rodgers, dressed in all black, was seen striding into the stadium a couple of hours before the game starts as he makes a desperate attempt to return to the field for the postseason - or even before! 19:27 $44m man Allen Lazard listed as INACTIVE Allen Lazard is a shock inactive for the Jets to face the Dolphins. The $44million man, who is a favorite of Aaron Rodgers, was not listed on the team's injury report heading into the game. The move raises some eyebrows with the Jets benching the wideout after splashing out in the summer to bring him to the Big Apple and reunite him with Rodgers. The inactive opens the door to opportunities for Irvin Charles and Jason Brownlee To no one's surprise, Zach Wilson is also inactive for today's game after his demotion to third-string quarterback earlier this week. OL Mekhi Becton, DL Carl Lawson, OL Austin Deculus, and Sam Eguavoen are also listed as the Jets' other inactives. 19:19 Bomb threat hours before game The shopping mall located next to MetLife Stadium in New Jersey was evacuated due to a bomb threat just hours before the Jets play the Miami Dolphins in the NFL's first-ever Black Friday game. At around 8:15am on Friday morning, New Jersey State Police issued a public safety alert that told visitors in the American Dream Mall, including employees, to evacuate. Then, in a post on X - formerly known as Twitter - New Jersey Governor Phil Murphy wrote that police were investigating a threat and shoppers should evacuate 'out of an abundance of caution.' However, around an hour later, he updated citizens and told them law enforcement said there was 'no imminent threat' and the mall was allowed to reopen. Shopping mall next to MetLife Stadium evacuated due to a bomb threat At around 8:15am on Friday morning, New Jersey State Police issued a public safety alert that told visitors in the American Dream Mall, including employees, to evacuate. Mail Online 19:17 Tis the season... In honor of Black Friday, the Jets have switched out their usual green home uniforms for all black ones, including a mean matching helmet 19:13 Welcome! Good afternoon and welcome to DailyMail.com's coverage of the AFC East showdown between the Miami Dolphins and the New York Jets. This afternoon's game is making history as it marks the NFL's first Black Friday game. The hosts head into the Week 12 matchup in desparate need of a win after losing its last three. Tim Boyle steps in at quarterback for the Jets after struggling Zach Wilson was benched during their previous game against the Buffalo Bills and demoted to third-string by head coach Robert Saleh. Meanwhile, the Dolphins are the clear favorites to win, sitting top of the AFC East with a 7-3 record. Stick around as we bring you all the buildup, updates and live score from MetLife Stadium. TOP STORIES Heartbreak for Miami Dolphins' Jaelan Phillips as he is carted off in tears at MetLife with Achilles tear... after battling to reach the NFL despite being medically retired due to concussions in his college career Miami Dolphins QB Tua Tagovailoa suffers GRUESOME cut on his arm in NFL's first ever Black Friday game... leaving fans squirming as they watch on TV: 'There's a CHUNK missing' Tyreek Hill catches a touchdown pass and immediately throws the ball to his new wife in the stands before blowing her a kiss... as he continues his record-breaking season for the Dolphins Black Friday 2023 LIVE deals: Best discounts and offers you don't want to miss on mattresses, vacuum cleaners and air fryers selected by our shopping experts LIVE Black Friday Deals 2023: The best sales and discounts handpicked by our shopping experts Aaron Rodgers arrives in all black for the NFL's first-ever Black Friday game... but will have to watch third-string Jets QB Tim Boyle against the Dolphins after Zach Wilson' benching Emily Ratajkowski poses in a skimpy blue bikini to announce the Inamorata Black Friday sale... after she was seen kissing Stephane Bak Aaron Rodgers 'changed his mind this week and WILL still return to the field if the New York Jets are out of playoff contention', Jay Glazer reveals - days after QB told Pat McAfee he wants to be back practicing NEXT WEEK Jets bench $44MILLION receiver Allen Lazard after just 10 games with Aaron Rodgers' former Green Bay teammate left inactive against the Dolphins Dolphins star Tyreek Hill's influencer wife has fan's nachos spilled over her during game but NFL fans claim it's her own fault Khloe Kardashian flaunts her rock-hard abs as she models a white bra top for Good American's Black Friday sale: 'My favorite style!' The under $50 deals our editors are ACTUALLY buying this Black Friday - prices start at $10 for Ninja, Apple, SKIMS, Olaplex and more The 35 BEST Black Friday deals that are actually worth buying - including Amazon devices, Lakeland heated airers, and Shark vacuums Cologne 0-1 Bayern Munich and PSG 5-2 Monaco RECAP: Live scores, team news and updates as Harry Kane nets again to break more records Flying to Utah on his bye week, tripping over the 10-yard line, and taking 105 sacks over three dreadful seasons... how it all went wrong for Zach Wilson with the New York Jets Move aside Travis and Taylor... is this the NFL's new power couple? Braxton Berrios and his stunning TikTok star girlfriend Alix Earle have been dubbed the 'most attractive couple on the planet' after confirming their romance Jodie Foster's son Kit, 22, TOWERS over her as he helps the actress carry a basket full of household goods in New York City Anti-Israel protesters target Macy's AGAIN and target Black Friday shoppers after disrupting store's NYC Thanksgiving parade - on same day hostages are released amid temporary ceasefire The 10 best air fryer deals we've found at Amazon for Black Friday! Unmissable savings of up to 50% off Ninja, Tefal, Tower and more Met Police brace for another weekend of protests: Tens of thousands to join pro-Palestine rally and antisemitism march with more than 1,500 officers on the streets of London to protect memorials and stop violent clashes Karaoke boss tells National Trust to 'lighten up' after his firm was slammed for shooting a TikTok video on 'fragile' Cerne Abbas Giant Black Friday 2023 LIVE deals: The wait is over! The sale of the year is here with the BIGGEST discounts we've seen on big-name brands like Apple, Ninja and Shark Here are the BEST beauty deals Amazon is offering during its epic Black Friday sale, including stunning savings on ELEMIS, Sunday Riley, ghd and Olaplex Target under fire for 'sexualizing Christmas for children' with 'pride Santa' decorations New Jersey shopping mall next to MetLife Stadium is evacuated due to a bomb threat just hours before Jets play the Dolphins in the NFL's first-ever Black Friday game Gobble up these INCREDIBLE Apple deals quick! MacBooks, AirPods, Apple Watches, iPads, and more are at their lowest prices ever! Get tech for LESS! Apple, Beats, and Samsung have SLASHED Black Friday prices already, score deals starting at $20 here NOW The death of Black Friday mayhem: British high streets are eerily quiet as shoppers shun queuing from 4am and brawling over TVs for snapping up Xmas bargains online - with £3billion set to be splurged Get a head start on the Black Friday sale with these editor-favorite finds under $50 from Shark, Keurig, and KitchenAid Get up to 55% off bestselling bed-in-a-box mattresses in Simba's Black Friday sale - including the Hybrid Original mattress for £598 less Alix Earle introduces her family to Miami Dolphins boyfriend Braxton Berrios in New Jersey as the NFL's hottest couple spend their first Thanksgiving together Black Friday's HOTTEST fashion deals revealed! Levi's, Calvin Klein, UGGs and more are on sale at Amazon - and prices start from under $16 Dublin riots LIVE updates: Taoiseach Leo Varadkar slams 'cowardly champions of Ireland' who rioted after knife attack on children - as clean-up operation gets underway Jets legend Joe Namath is accused of allowing child sex abuse by well-known prep school coach to take place at his football camp A quarter of Americans still have holiday debt from 2022 - as experts warn shoppers that soaring interest rates mean it could take 40 MONTHS to pay off a $1,000 credit card bill Emily Ratajkowski takes her dog Colombo for a post-Thanksgiving walk in New York City... after posing several bikini snaps Black Friday vacuum steal: The bestselling Shark upright vacuum shoppers call 'BETTER than Dyson' is now on offer with 40% OFF The Princess of Wales, Kylie Jenner, Michelle Obama, and Meghan Markle ALL swear by this luxe fashion brand - and you can get 25% off EVERYTHING in the Black Friday sale Kylie Jenner looks busty in a tight white tank top to announce Kylie Cosmetics Black Friday sale as friend Paris Hilton hits the like button I'm A Celebrity 2023 LIVE RECAP: Most notable contestant moments from the series launch Kristin Cavallari shows off her toned frame in scintillating bra and shorts in new Black Friday videos for her clothing company Uncommon James Bruce Lehrmann denies sex on the sofa with Brittany Higgins, 'pashing' her in a nightclub or touching her leg - as he's grilled over allegedly 'demanding she skol drinks' Score HUGE savings on Apple devices this Black Friday! Shop AirPods for just £99 - plus offers on iPads, Apple Watches, accessories and more Man United news LIVE: Sir Jim Ratcliffe is facing huge call on Casemiro and Raphael Varane futures as Erik ten Hag prepares for trip to crisis-hit Everton Aspinal of London's AMAZING Black Friday sale just got even better - score a DOUBLE discount on Kate Middleton's favourite bag brand for a limited time only Black Friday 2023: Etiquette expert reveals the worst shopping behaviors - and shares her top tips for making the experience more peaceful Don't get stung on Black Friday! Experts reveal how to spot if an online sale is REALLY a good deal - as many products were LESS expensive earlier in the year Leaked document shows Manchester United's 2004 transfer targets including a Premier League legend who led their rivals to glory… but Sir Alex Ferguson's side were able to land three names on their shortlist Former Wimbledon finalist David Nalbandian 'is accused of filming his model ex-girlfriend when hidden camera was found in her bedroom' Man City-Liverpool pundit predictions: Jamie Carragher, Roy Keane, Chris Sutton and Ian Wright are split over this weekend's big Premier League showdown... so which side has more backing them? Inside Everton's new £550m stadium as Mail Sport's IAN HERBERT takes a tour of the steepest legally-permitted stands and incredible views, as fans vow to fight 'corrupt' Premier League points docking Erik ten Hag fell out with Cristiano Ronaldo, swapped David De Gea for Andre Onana and has ostracised Jadon Sancho, but amid Man United's ongoing struggles, is the Dutchman RECKLESS or RUTHLESS? Steven Gerrard changes his mind on the GOAT debate... picking Cristiano Ronaldo as the world's greatest player - a year after he named Lionel Messi as his No 1 Oscar Pistorius WINS his bid for freedom: Paralympian who shot dead Reeva Steenkamp ten years ago is set to be released from jail after Christmas and will undergo therapy for 'anger and gender-based violence' REVEALED: Germany's players have FOUR issues with Julian Nagelsmann, as problems mount for the under-fire boss - who has lost more than he's won - with Kai Havertz key to one irritant Darwin Nunez looked a misfiring hothead but doubling his English lessons, help from Jurgen Klopp's 'son' and Marcelo Bielsa's tips have helped close gap on Erling Haaland for 'Liverpool Reloaded' Last-minute Movember? Mason Mount sports a new-look moustache as he arrives at Man United's training ground ahead of Sunday's crunch clash with Everton EXCLUSIVE: ANGE POSTECOGLOU INTERVIEW on his Tottenham love affair, Rod Stewart asking for his wine back - and why he hates chit-chat: 'The scrutiny may be coming now... but perversely I love it' 'I want to encourage people in the township to have wild dreams': South Africa captain SIYA KOLISI opens up on suffering childhood hunger and violence in moving first interview since clinching World Cup glory No wonder Lewis Hamilton wanted out! Christian Horner sticks the boot into Mercedes with dig at Brit's two-year race win drought as row over his Red Bull talks continue in Abu Dhabi Bunker mentality will SAVE Everton! Sean Dyche returns from golf break ready to lead Toffees' fight against relegation after 10-point deduction... with 'driven' group ready to tackle it head on - starting against Man United Liverpool star Dominik Szoboszlai is left laughing at Pep Guardiola's attempts to pronounce his name as Reds fans slam the City boss on social media ahead of Saturday's box office clash Country icon Dolly Parton, 77, sends the crowd wild in Dallas as she wears Cowboys CHEERLEADING outfit to perform NFL Thanksgiving halftime show at Washington-Dallas game Is this how Taylor Swift and Travis Kelce's relationship ends? Fans reveal bizarre conspiracy theory involving his brother Jason after spotting sign of the couple's fate during Eagles' win over the Chiefs Fans brand Jack Harlow's 'low-budget' performance during Lions-Packers as worst halftime show EVER: 'That's ruined Thanksgiving' Sadio Mane is congratulated by Cristiano Ronaldo and his Al-Nassr team-mates after reaching 100 caps for Senegal NBA is investigating allegations that Oklahoma City Thunder's Josh Giddey had an inappropriate relationship with a minor after pictures of them - including one where she boasted about having sex with him - were posted on social media KFC responds to Travis Kelce after he revealed he is spending Thanksgiving ALONE - eating fried chicken - because girlfriend Taylor Swift is on tour No invite for Travis today! Patrick and Brittany Mahomes celebrate Thanksgiving at home as they eat dinner with his brother Jackson and their children after having Kelce over earlier this week Casemiro and Raphael Varane are facing Manchester United exit, with incoming owner Sir Jim Ratcliffe ready to make big calls over the struggling stars' futures Legendary Argentina World Cup winner, 35, confirms he will RETIRE from international football after the Copa America next summer Mario Balotelli escapes unharmed after 'major crash' in his £100,000 Audi Q8 in Brescia as former Man City star 'refuses breathalyser' Tony Romo is trolled on social media for his VERY enthusiastic on-air reaction to 77-year-old Dolly Parton's halftime Thanksgiving performance: 'She went with the cheerleading outfit... wow, pretty good' Has Dave Portnoy SPLIT with stunning girlfriend Silvana Mojica? Model hints at shock breakup with Barstool Sports founder in tearful TikTok post Innocent Aussie sporting great Ricky Ponting is caught up in social media storm over 'cricket mafia' slur against India after their ODI World Cup loss IAN LADYMAN: He was a fantastic footballer... but is Wayne Rooney a dud in the dugout? Swedish trail runner Emilia Brangefalt, 21, dies by suicide, days after posting 'maybe I won't be back' on Instagram after being diagnosed with 'extremely high heart rate' which stopped training Novak Djokovic yells 'shut up' at British fans and accuses them of disrespect in furious bust-up after world No 1 beats Cam Norrie to seal Serbia victory in Davis Cup tie Travis Kelce is spotted SINGING in his Rolls Royce as he drives around Kansas City alone on Thanksgiving... after joking he'd spend the day eating KFC as lover Taylor Swift tours in Brazil Joe Smith reveals his $61million NBA fortune was reduced to just $3,000 amid his battle with depression - as he opens up on 'hard times' weeks after going viral for his wife's OnlyFans reveal Why footy superstar Nathan Cleary's party-packed offseason holiday photo album has got his fans offside Hilarious footage of a fresh-faced Travis Kelce asking a Chiefs staffer to call mom Donna MID-GAME to order 'gnocchi noodles' with his mac and cheese resurfaces Pat Cummins has a heartwarming reunion with wife Becky and son Albie - and jokes about an embarrassing problem - as he returns home after World Cup triumph Harald Hasselbach dead at 56: Family announce sad passing of two-time Super Bowl champion on Thanksgiving after battle with rare type of cancer Lionel Messi: David Beckham reveals he arrived at Inter Miami training every day at 7am after signing the Argentina legend to watch him 'go about everything he does' 'Traumatised' team-mate of Adam Johnson quits Nottingham Panthers after sharing that he 'tried to suppress everything' after witnessing the player's fatal on-ice collision Controversial ex-WWE star goes for drastic new look after getting haircut - as former UFC fighter looks to reinvent himself before pro wrestling return Matildas star reveals why she wanted Nathan Cleary BARRED from meeting his girlfriend Mary Fowler Jason Kelce posts adorable clip of himself watching the premiere of his 'Philly Special' Christmas video with his daughters on Thanksgiving... and it features a brilliant cameo from Travis! Taylor Swift and Travis Kelce: Pop star's parents 'CANCEL plans to meet the tight end's family for first time at Eagles-Chiefs showdown' with the singer unable to attend due to rescheduled Eras Tour in Brazil Jason Kelce's wife Kylie shuts down suggestions she has bad blood with Taylor Swift as she sets the record straight on headline that claimed she is 'trying to avoid' pop star's spotlight Footy star who became the hero of one of the AFL's greatest grand final dies after helping revolutionise the game in retirement Adam Johnson's fiancee shares emotional tribute to the late hockey star on Thanksgiving after his on-ice death: 'Missing you so much every single day, love you' England's 2003 Rugby World Cup heroes reunite for the first time in two decades to celebrate the 20-year anniversary of their historic Jonny Wilkinson-inspired victory in Australia Jamie Carragher reveals his England star to play alongside Declan Rice and Jude Bellingham in 'exciting' midfield and take Gareth Southgate's side to Euro 2024 glory Jason Kelce admits his 'whirlwind' rise to stardom has made it 'harder to go out' but the Philadelphia Eagles center insists he's trying to 'stay grounded with it and be realistic' EXCLUSIVE: Tottenham legend Jermain Defoe takes part in coaching session at Arsenal's academy HQ and gives advice to young Gunners... as the former striker continues bid to become a coach What Gabriel Agbonlahor said about Man United legend Nemanja Vidic... as former Aston Villa forward names four other centre-backs who he believes were much better Ben Stokes sends message to Australia as England captain breaks his silence for the first time since Ashes rival Pat Cummins led his side to incredible Cricket World Cup victory REVEALED: How the Chiefs are trying to prolong Travis Kelce's NFL career after their star tight end dropped several hints he may end his career soon Black Friday New York Jets Miami Dolphins Share or comment on this article: Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game e-mail What a wonderful sport. Love watching all those B... by Philly_Hotspur 1 Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-24 23:25:57","image_url":"https://i.dailymail.co.uk/1s/2023/11/24/23/78215907-0-image-m-59_1700868262286.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5fd5f49d87bef0c8df8920609e99a23c","title":"Gina Rinehart offers radical plan to ‘save’ 2026 Commonwealth Games","link":"https://7news.com.au/sport/commonwealth-games/gina-rinehart-offers-radical-plan-to-save-2026-commonwealth-games-c-12676845","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"The mining magnate wants the Games staged in two different cities, 4000km apart.","content":"Gina Rinehart is spearheading a radical bid to save the 2026 The 2026 event, and the future of the Games more broadly, has been hanging by a thread since the The Labor government initially devised a plan to stage the Games across several towns in regional Victoria before ultimately admitting it was ill-advised to do so, citing the reported $4 billion price tag that came with it. No city - in Australia or elsewhere - has since put its hand up to take Victoria’s place, compounding the separate issue that Canadian city Alberta has already pulled its support for the 2030 event. The clock is now ticking as 2026 fast approaches, with a concrete solution yet to be found. But in a letter submitted to Prime Minister Anthony Albanese, which was signed by Gold Coast mayor Tom Tate and Perth Lord Mayor Basil Zempilas, Australia’s richest person, Gina Rinehart, has offered a left-field, multi-city idea that could resole the issue. Rinehart, with the support of Mayors Tate and Zempilas, wants to stage the Games at opposite ends of the country. “We believe that a coast-to-coast Games presents a special opportunity to showcase Australia and provides an excellent background for you to invite those heads of the Commonwealth you may wish to have further discussions with, and/or entertain,” the letter reads. “A background where Australia pulls well above its weight, and shines!” The two cities would make use of existing facilities to host the games, with Gold Coast having only recently had them in 2018, and Perth boasting its brand new, state-of-the-art Perth Stadium, which could be used as an athletics track. In theory, Gold Coast could host the first week before handing the keys over to Perth for the second. The three figures also took a swipe at the Victorian government, which pulled the Games while Daniel Andrews was still premier. “The Victorian government’s decision to cancel the 2026 Commonwealth Games was disappointing and a huge blow to Australia’s reputation and to our athletes,” it went on. “Australia is meant to be viewed as a successful G20 nation, and the fact that we can’t organise and fund a Commonwealth Games undermines that reputation. “We believe that saving the Commonwealth Games via a dual-city approach would be popular and in the national interest, and would not only bring huge benefits to our athletes and cities, but also excitement and lasting advantages to our nation. “As you know, the history of the Commonwealth Games — which is made up of over 70 nations and territories — is a source of immense pride for many around the world. And an important opportunity to invite Commonwealth heads to Australia.” Rinehart is a noted supporter of sports, having offered to before throwing her support behind the Australian Dolphins swimming team. She is also understood to be a keen fan of rowing, artistic swimming and volleyball. But Melbourne radio host Tom Elliott slammed the idea, saying it would be a practical impossibility. “You could not pick two cities in Australia that are further apart from each other — over 4000km,” Elliott said on his show on 3AW. “The Victorian Commonwealth Games, which were going to be in four or five regional parts of Victoria — that was never going to work because the events were too far away from each other. It was just never going to work and that’s why the government abandoned them, even though it was the government’s idea. “To have a Commonwealth Games split between the Gold Coast and Perth, I just think is utter madness. “The idea is that they do the first week of events on the Gold Coast and the second week in Perth. But think about it — unless every official and volunteer moves between the Gold Coast and Perth — and where would you put them all, they effectively have to recruit all the people again just to make the Games run. “You’ve got to build two athletes villages. It’s just such a dumb idea. “I think we need to accept, as sad as this is, that the era of the Commonwealth Games is over. Not that many people watch it, not that many countries compete in it, it doesn’t make any money — that’s the reason cities don’t want to host it.” Rinehart’s letter rejects the notion that it would be too hard. “We believe that saving the Commonwealth Games via a dual city approach would be popular and in the national interest, and would not only bring huge benefits to our athletes and cities, but also lasting advantages to our nation,” the letter goes on. “We believe it would be a far more popular decision than the recently announced $600 million for Papua New Guinea football, and not as expensive. “Perhaps some of that expenditure could be redirected to improve Australian facilities for the Commonwealth Games and later Olympic Games in Queensland?”","pubDate":"2023-11-24 23:05:24","image_url":"https://images.7news.com.au/publication/C-12676845/37fc09f492f45e4c2ac3fec52647fdf02cf61a1f-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2becf2097e42c0cbd489cf6e5d6911ae","title":"Harry Kane smashes two records in one night as Bayern Munich scoring spree continues","link":"https://www.dailystar.co.uk/sport/football/harry-kane-bayern-munich-record-31524508","keywords":["Sport"],"creator":null,"video_url":null,"description":"Harry Kane continues to obliterate records in Germany, taking his Bundesliga tally for the season to 18 in Bayern Munich's victory away to Cologne","content":"shattered two more records as his incredible scoring spree with continued. The England captain hit the only goal as the Bundesliga champions won at Cologne to go top of the table. Kane netted from close range in the 20th minute after Eric Maxim Choupo-Moting's shot was cleared off the line. His 18th goal of the season saw him break two records. First, he became the first player in Bundesliga history to score 18 goals in the first 12 matchdays of a season. Secondly, he is the first English player to score 18 goals in a Bundesliga campaign, a season which is just a third old. Jadon Sancho, for Borussia Dortmund in 2019/20, and Kevin Keegan, for Hamburg in 1978/79, both scored 17. Kane’s arrival has filled the void created by Robert Lewandowski’s departure in 2022. He has surpassed what the Polish goal machine did in his first season with Bayern, the 2014/15 campaign, which saw him hit 17 in 31 games. Kane has 22 in all competitions, making him the leading scorer in the top five leagues across Europe. Posting on X (formerly Twitter) after his latest goal, Kane said: “Great win away from home. Had good control throughout the whole game! Let’s keep it going.” The 30-year-old's goalscoring exploits are being lauded around Europe. One fan said: “Incredible achievement by Harry Kane! The record-breaking history he's making in the Bundesliga is truly remarkable.” The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Another declared: “At this point, I think we can all agree that is undoubtedly the best candidate for the next . What a player has got there.” Despite Kane’s goals, Bayern aren’t running away at the top of the table and Xabi Alonso’s Bayer Leverkusen will go back to the summit if they win at Werder Bremen on Saturday.","pubDate":"2023-11-24 23:03:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31524431.ece/ALTERNATES/s98/0_1-FC-Kln-v-FC-Bayern-Mnchen-Bundesliga.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f2532aa506d37d645e2a374b7a8a38c8","title":"Papers: Man Utd and Chelsea lead chase for Brazilian wonderkid Messinho","link":"https://www.skysports.com/football/news/20876/13015480/manchester-united-and-chelsea-lead-premier-league-chase-for-16-year-old-palmeiras-wonderkid-messinho-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"The top stories and transfer rumours from Saturday's newspapers...","content":"The top stories and transfer rumours from Saturday's newspapers... THE SUN Manchester United and Chelsea have joined what is turning into a Premier League bidding war for 16-year-old Brazil talent Messinho, who currently plays for Palmeiras. Mauricio Pochettino will fork out thousands of pounds by taking players and staff out for dinner following his three yellow cards for unruly behaviour this season. Former Liverpool star Jose Enrique feels only Manchester United deciding they are a long-term project will keep Erik ten Hag in his role by the time the 2023-24 season ends. Please use Chrome browser for a more accessible video player DAILY MAIL Barcelona will be looking to sign a midfielder in the January transfer window after confirmation that teenage star Gavi suffered a torn ACL while on international duty with Spain. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Pep Guardiola promised he will stay in charge of Manchester City even if they are relegated to League One if found guilty of breaching Premier League financial rules. Mason Mount is unlikely to be available for Manchester United first-team action until Christmas after suffering a calf injury. Tottenham boss Ange Postecoglou admits he has been \"frustrated\" at being dismissed in managerial circles just for his Australian background and wonders if the door might have been shut on managers from the country if he had struggled at Celtic. Jude Bellingham's rise to the top of football's megastars could next see him sign a multi-million pound endorsement with French fashion house Louis Vuitton. Eyebrows were raised within the Football Association when Barnsley did not even request a personal hearing over their ineligible player charge which saw them expelled from the FA Cup. DAILY TELEGRAPH Chelsea striker Nicolas Jackson has revealed his incredible journey to stardom at Stamford Bridge and says he was still playing football in bare feet in Senegal as recently as six years ago. Erik ten Hag's agent Kees Vos will be back in court in the Netherlands next month, facing one of his former clients Stefan de Vrij in an appeal against a £4m-plus payout he was ordered to make in damages over the SEG agency's handling of his free transfer move to Inter Milan in 2018. Surrey chairman Oli Slipper is keen to embrace The Hundred further but wants a rebrand of the Oval Invincibles, potentially just using their county name instead. DAILY STAR Tickets for England's high-profile friendly with Brazil were sold out before even reaching the stage where they would be made available to the general public. Real Madrid have already \"made contact\" with Roberto de Zerbi - according to a report in Spain - as they seek to get a replacement for Carlo Ancelotti in place by the time his current deal expires next summer. DAILY MIRROR Premier League stars have been complaining to the PFA that a sharp rise in injuries, in particular muscular strains and pulls, are being caused by the time it takes to make VAR decisions. THE TIMES Newcastle United want Manchester City midfielder Kalvin Phillips and PSG striker Hugo Ekitike in January but any deals will have to be done in the loan market because of FFP rules. Novak Djokovic has slammed anti-doping officials for the \"shameful\" decision to notify him he had been selected for testing 90 minutes before his Davis Cup clash with Cameron Norrie. David Gower would be open to becoming the next chairman of the MCC after emerging as a possible contender. DAILY RECORD Celtic are set to make a renewed effort to sign Brondby striker Mathias Kvistgaarden in January. Barry Ferguson believes his nephew Lewis could be on the move to a \"massive\" club as early as January amid reported interest from Juventus in the Bologna captain. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-24 23:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"81306f8647f40bad73f9b24fd264dcd7","title":"Cristiano Ronaldo scores 'goal of the season' sending football to the moon and back","link":"https://www.dailystar.co.uk/sport/football/cristiano-ronaldo-al-nassr-goal-31524184","keywords":["Sport"],"creator":null,"video_url":null,"description":"Cristiano Ronaldo continues to make headlines in Saudi Arabia after his second goal in Al-Nassr's 3-0 victory was a beautiful lobbed effort from almost 30 yards out","content":"scored a dazzling lobbed shot for Al-Nassr with fans already hailing it as the 'goal of the season'. The five-time Ballon d'Or winner was amongst the goals once again for the club as he scored a brace as they cruised to a 3-0 win at home against Al-Akhdoud. Ronaldo's return to the side following international duty with Portugal was a fruitful one as he now has 15 league goals this season. Fans had to wait until the 77th minute to see the 38-year-old get on the scoresheet and he did so in supreme fashion after controlling the ball before taking a touch and finishing home from a tight angle to make it 2-0 after Sami Al Naji's opener in the first half. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . In true Ronaldo fashion, he outdid himself with his second goal of the game after Al-Akhdoud goalkeeper Paulo Vitor found himself in no-man's land by making a save in his own half. The ball bounced to Ronaldo who controlled the ball with his chest and lobbed the keeper from almost 30 yards out, with the ball going outrageously high in the air in the process. Delighted with his effort after the ball practically went to the moon and back, the legend ran off celebrating the strike with his team-mates as it capped off an impressive night for Ronaldo who's now scored 24 goals in all competitions for Al-Nassr. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Fans on social media took their time to praise the stunning strike as one X user wrote: \"Goal of the season for sure\", while another was impressed with Ronaldo's performances despite his advancing age as they commented: \"This guy is getting better and better each day bro\". A third even went as far to say: \"Give this man a Ballon d'Or\", as Ronaldo's side are now just one point behind leaders Al-Hilal who have a game in hand. His 15 league goals are five more than the second highest scorer in the Saudi Pro League which is former Fulham striker Aleksander Mitrovic who plays for the league leaders. Ronaldo is also one of eight Saudi League players to score a hat-trick this season, alongside ex- team-mate Karim Benzema and legend Roberto Firmino.","pubDate":"2023-11-24 22:49:56","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31524291.ece/ALTERNATES/s98/2_RONALDO-GOAL.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2c5e92f6856df9e1a9e1b7fb645245d2","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.northwalespioneer.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.northwalespioneer.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"db786f4b19c57a1a9483de11ba60f810","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.southwalesguardian.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.southwalesguardian.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"9dc02e5f538c62baf84b5f3962bf13de","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.northwaleschronicle.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2d5faabd0646bda11dc853142e7bfb5a","title":"Mauricio Pochettino wants managers ‘involved in decisions’ around referee reform","link":"https://www.northwaleschronicle.co.uk/sport/national/23947443.mauricio-pochettino-wants-managers-involved-decisions-around-referee-reform/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have been involved in a number of controversial fixtures this season.","content":"Mauricio Pochettino believes Premier League managers should be invited to play a more active role in helping shape refereeing guidelines. Chelsea have been involved in a number of controversial fixtures this season, most notably the frenetic 4-1 win away at Tottenham earlier in November in which Spurs had two players sent off, five goals were disallowed and VAR made nine interventions across a match that lasted over 110 minutes. Pochettino has previously complained that the league’s request to meet with coaches in the week before the beginning of the season to discuss changes allowed little room for constructive input from managers and their clubs. The current campaign has seen a barrage of complaints directed at on-field and VAR officials, with referees coming under almost unprecedented scrutiny following a string of errors, particularly relating to the influence of the video referee on the decision-making process. “We all have full respect for the referees, we understand perfectly that their job is really tough,” said Pochettino, whose team face Newcastle at St James’s Park on Saturday. “But the problem is you get frustrated sometimes during the game because of the VAR. The referee is not responsible sometimes. You cannot complain to the VAR. That is a problem. “I’m going to try and control more my emotions. I think all the coaches respect the referees because they’re in a really difficult situation. Training for Tyneside. ✊ — Chelsea FC (@ChelseaFC) “I think sometimes we are frustrated. I think coaches need to be more involved in the decisions, and to work together during the season. “It is not (ideal) to arrive the week before the start of the Premier League season and say, ‘OK, the new rules are this. What do you think?’. Nothing, because you have already made the decision. Like the rule that there can only be one coach (in the technical area). Why? “England was always different about the relationship with the referee. You can talk, you can (previously) have four people in the dugout. Which way do we want to evolve in the Premier League? “England is different. Not only because you drive on the right (of the car), but because of the relationship in football. It is the gentleman’s game.” Despite those frustrations, and the ongoing confusion surrounding the proper implementation of VAR and its interpretation of the game’s rules, Pochettino acknowledged that the emotional side of football is ultimately what props up the business side of the sport. “I think people look at football and understand that it is a big business,” he said. “The sport is very honest, with rules. But around that it is a business that we cannot stop. “If the sport doesn’t produce that emotion it is producing, it is difficult to talk about it in this way, to have the chance to have good salaries, to give also to society. “Football provides people with happiness and that is the most important thing. We are all part of this business.”","pubDate":"2023-11-24 23:39:58","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17482675/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"58450b1bc83cef7ccc2fcce694724eed","title":"Mauricio Pochettino wants managers ‘involved in decisions’ around referee reform","link":"https://www.southwalesguardian.co.uk/sport/national/23947443.mauricio-pochettino-wants-managers-involved-decisions-around-referee-reform/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have been involved in a number of controversial fixtures this season.","content":"Mauricio Pochettino believes Premier League managers should be invited to play a more active role in helping shape refereeing guidelines. Chelsea have been involved in a number of controversial fixtures this season, most notably the frenetic 4-1 win away at Tottenham earlier in November in which Spurs had two players sent off, five goals were disallowed and VAR made nine interventions across a match that lasted over 110 minutes. Pochettino has previously complained that the league’s request to meet with coaches in the week before the beginning of the season to discuss changes allowed little room for constructive input from managers and their clubs. The current campaign has seen a barrage of complaints directed at on-field and VAR officials, with referees coming under almost unprecedented scrutiny following a string of errors, particularly relating to the influence of the video referee on the decision-making process. “We all have full respect for the referees, we understand perfectly that their job is really tough,” said Pochettino, whose team face Newcastle at St James’s Park on Saturday. “But the problem is you get frustrated sometimes during the game because of the VAR. The referee is not responsible sometimes. You cannot complain to the VAR. That is a problem. “I’m going to try and control more my emotions. I think all the coaches respect the referees because they’re in a really difficult situation. Training for Tyneside. ✊ — Chelsea FC (@ChelseaFC) “I think sometimes we are frustrated. I think coaches need to be more involved in the decisions, and to work together during the season. “It is not (ideal) to arrive the week before the start of the Premier League season and say, ‘OK, the new rules are this. What do you think?’. Nothing, because you have already made the decision. Like the rule that there can only be one coach (in the technical area). Why? “England was always different about the relationship with the referee. You can talk, you can (previously) have four people in the dugout. Which way do we want to evolve in the Premier League? “England is different. Not only because you drive on the right (of the car), but because of the relationship in football. It is the gentleman’s game.” Despite those frustrations, and the ongoing confusion surrounding the proper implementation of VAR and its interpretation of the game’s rules, Pochettino acknowledged that the emotional side of football is ultimately what props up the business side of the sport. “I think people look at football and understand that it is a big business,” he said. “The sport is very honest, with rules. But around that it is a business that we cannot stop. “If the sport doesn’t produce that emotion it is producing, it is difficult to talk about it in this way, to have the chance to have good salaries, to give also to society. “Football provides people with happiness and that is the most important thing. We are all part of this business.”","pubDate":"2023-11-24 23:39:58","image_url":"https://www.southwalesguardian.co.uk/resources/images/17482675/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a3dd723830ac3d7c7cc137b742a2419b","title":"Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game","link":"https://www.dailymail.co.uk/sport/live/article-12788321/Miami-Dolphins-New-York-Jets-live-result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Relive all the action from the Dolphins 34-13 rout of the New York Jets as the hosts' offensive woes continue under Tim Boyle in the NFL's first ever Black Friday game with DailyMail.com's live blog.","content":"Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game By Isabel Baldwin For Dailymail.Com Published: 19:03, 24 November 2023 | Updated: 23:25, 24 November 2023 e-mail 2 View comments Relive all the action from the Miami Dolphins 34-13 rout of the New York Jets as the hosts' offensive woes continue under quarterback Tim Boyle in the NFL's first ever Black Friday game with DailyMail.com's live blog. 23:21 Goodnight! That's all from us! Aaron Rodgers may be desperately working to return from injury but after today's game he may not want to. Hopes of seeing the quarterback playoffs took a huge blow as it looks like the Jets won't even be seeing the postseason themselves. Meanwhile, Micke McDaniel will be heading back to SoFlo on Cloud Nine as his Dolphins helped their chances of taking a home field advantage into the postseason. 23:05 FINAL: Dolphins 34-13 Jets It's the same old story in New York. The Jets's switch of Tim Boyle for zach Wilson has reaped no rewards. It's a new quarterback but same old offensive issues in East Rutherford. Meanwhile, the dangerous Dolphins improved to 8-3. 22:55 TOUCHDOWN! Dolphins 34-13 Jets Most of the crowd has filed out into the parking lot by this point. Miami piles on the misery for New York by following up the Jets' first offensive touchdown of the game by scoring just one minute later. Mosert puts the icing on the cake of an impressive performance for the Dolphins by running it in for a 34-yard touchdown and his second of the game. He even has time to taunt New York's Tony Adams by slowing his pace and sending the defensive back zig zagging right on the line. 22:52 Holland heads to the medical tent Meanwhile, Jevon Holland - the hero of the game's Hell Mary - has entered the medical tent and has been listed as questionable to return with a knee injury. 22:47 TOUCHDOWN! Dolphins 27-13 Jets The Jets forced another Tua Tagovailoa turnover in the fourth quarter when he fumbled and Ashytn Davis recovered. It's Jets possession and Garrett Wilson tries to haul in a pass in the end zone but is well covered by Elliott and it's ruled incomplete. But the Jets manage to set up first-and-goal on the next play. This time Boyle does manage to find Wilson in the end zone for the Jets' first offensive touchdown of the game. It's only taken them 55 minutes... 22:43 Umpire left bloodied at skirmish Umpire Carl Paganelli appears to have been caught on the mouth and left with a cut during that scuffle between Mosley and Clemons. The referee was seen spitting blood following the skirmish. Clemons was ejected for making contact with an official but it's unclear if Paganelli's injury resulted from Clemons' contact. 22:36 Dolphins interception Well, that was at least some sign of life from the Jets. Boyle manages to string together a 17-play, seven-minute play before makes the interception. Well, it was good while it lasted. For those of you still keepig count, that brings the Jets' tally to six punts and two interceptions through eight offensive possesions. 22:31 Phillips carted off in tears On the replay, Phillips appears to have torn something after a pass rush step and could be looking at a season-ending injury. The 24-year-old is in tears as he taken off the field on the back of the golf cart. 22:26 Jaelan Phillips is down The Dolphins lineback has gone down on the field and remains down. It does not look good for Phillips with the entire sideline on the field to check on hgim and th cart has come out. He's now carted off with what appears to be a lower leg injury. The MetLife turf claims yet another victim. 22:11 TOUCHDOWN! Dolphins 27-6 Jets Tagovailoa hands off to Mostert, who weaves his wy through the Jets defense and into the end zone to open the Dolphins' final quarter with a rushing touchdown. It rounds off a 15-play, 92-yard drive that lasted nine minutes and sees them go up three scores. And tensions are clearly runmning high for New York now as the extra point sparks a scuffle. C.J. Mosley and Micheal Clemons are flagged for personal fouls, with Clemons' penalty also enforced because it occurrs against an official. 22:10 End of the third quarter Not too much to report from the third quarter. Well, nothing Jets fans will want to hear anyway. The Dolphins dominated possession, having the ball for 13 minutes of the quarter and they'll have a first-and-10 from the Jets' 14-yard line when the fourth quarter begins. The Jets... well do I really need to say? 22:06 Tua is playing through the pain Miami Dolphins QB Tua Tagovailoa suffers GRUESOME cut on his arm WARNING - GRAPHIC CONTENT: Miami Dolphins quarterback Tua Tagovailoa was left bloodied in the NFL's first ever Black Friday game, after suffering a gruesome cut on his right arm. Mail Online 21:58 Jets start their second half in the same woeful fashion as the first Boos are echoing around MetLife Stadium now as Jets fans are forced to suffer through yet another woeful drive that ends in, you guessed it, another punt. That's the sixth of the game. The Jets’ first drive after halftime lasted just three plays, including Wilkins' brutal sack on Boyle before New York punts once again. New York's seven offensive possessions have ended with punts and the interception for a six pick return. Where's Zach Wilson? At least he could get them within goal range... sometimes. 21:48 FIELD GOAL! Dolphins 20-6 Jets It's a Dolphins drive to start the third quarter but Bryce Huff records a sack on Tagolvailoa to force a Jason Sanders field goal. Sanders' 54-yard attempt is straight down the middle and the Dolphins extend their lead to 20-6. Miami traveled seven plays and 39 yards in just under four minutes, including a Jaylen Waddle 32-yard connection on third down. 21:42 Safe to say Jevon Holland enjoyed that one... 21:40 HALFTIME: Dolphins 17-6 Jets Crushing end to the first half for the hosts. Just as the Jets looked to have clawed their way back into the game with Echols' pick six handing them a lifeline, Tom Boyle's intercepted Hail Mary knocks them back once again. New quarterback, same old problems for New York. 21:27 TOUCHDOWN! Dolphins 17-6 Jets Unbelievable scenes at MetLife Stadium as the Dolphins swiftly follow up the Jets' pick-six with one of their own. The Jets attempt a Hail Mary with two seconds left on the clock in the second quarter... which turns into a 99-yard pick-six for the Dolphins. Boyle launches it down the field in a desperate attempt to find someone - anyone - in the end zone, and he finds exactly the wrong person as Holland intercepts the ball before charging the entire length of the field. New York flails around the field as they fail to stop Holland and he cruises into the end zone. Crushing blow for the Jets defense, who have their pick six rewarded by their offense throwing one. 21:19 TOUCHDOWN! Dolphins 10-6 Jets The Jets are finally on the board. I repeat, the Jets are FINALLY on the board. Echols picks off Tua, who tries to find Berrios, and walks it into the end zone to score the first touchdown for the Jets. They fail to close the gap further however, as Zuerlein misses the kick. In his defense, he's not had much practice kicking extra points this season. MetLife Stadium finally has something to cheer about... it's been a while. 21:07 And the calls from Jets fans for Zach Wilson's return have already begun 21:06 Jets punt... AGAIN Jaelan Phillips catches Boyle by surprise, breaking through the Jets' o-line and gets a hand to the quarterback's pass to tip it at the line pof scrimmage He can't quite reel in the ball for the interception... but the drive ends with a fourth consecutive punt. 20:59 Take a look at the first TD of the game 20:54 TOUCHDOWN! Dolphins 10-0 Jets Tagovailoa finds Hill for the receving touchdown to extend the Dolphins' lead to 10-0. Hill hauls in the ball and evades the tackle from Jordan Whitehead, sending the safety sprawling and jogs into the end zone. It marks the wide receiver's 10th receiving touchdown of the season and he celebrates by handing the scoring ball to his new wife, Keeta, in the stands. 20:51 Aaron Rodgers all smiles on the sidelines 20:49 End of the first quarter The Jets' third drive starts with a five yard loss after Breece Hall dropped a handoff from Tim Boyle, they fumbled on first down and recovered. On third-and-ten, Brownlee was flagged for a false start and at the end of the first quarter the Dolphins still lead 3-0 - and have barely been threatened by the Jets. 20:47 Tua hits the 3,000-yard mark Tua Tagovailoa hits the 3,000-yard mark for the seocnd consecutive season. The quarterback becomes the first Dolphins player not called Dan Marino to throw for 3,000-plus yards in the first 11 games of a season. 20:40 FIELD GOAL! Dolphins 3-0 Jets There's finally some points on the board! After the previous decision to go for it on fourth down failed, McDaniel opts for a different approach. On a fourth-and-1 from the Jets’ 20-yard line, the Dolphins go for a 38-yard field goal which is safely through the posts. 20:38 New York punts The Dolphins offense may not be soring any points - yet - but the defense nearly does. aelan Phillips and Bradley Chubb nearly sack Tim Boyle in the end zone for a safety. The Jets QB manages to heave the ball away to keep the Jets drive alive - just - but a couple of plays later New York punts AGAIN. 20:33 Jets force the turnover Tagovailoa can't lead the Dolphins into the endzone and on fourth-and-goal, Mike McDaniel opts to go for it. But Hill can't make the catch with the ball slipping through his hands. The Jets force the turnover, taking over from their own five-yard line. 20:30 Tua playing through a slash to his arm Tua is proving just how tough he is as the Miami quarterback is spotted playing on despite bearing a deep gash on his right arm. It's not clear how the signal caller sustained the cut but he has been sporting since the first drive. It looks like the lefty is missing a chunk out of his arm - right in the middle of his tattoo sleeve. 20:27 Sauce saves the TD Sauce Gardner bails out the Jets with great on-on-one coverage with Hill in the end zone to prevent th Dolphins touchdown on fourth down. 20:21 Hill comes hopping off Reed is fortunate just to catch up with him before managing to bring him down with a tackle from behind. Hill comes hobbling off and looks to be in some pain on the sideline. But Dolphins fans can rest easy as Hill sits out just the on play before he comes running back on. He had a quick exam on his left foot before being given the all clear to return. Medicare express. 20:20 Robert Saleh throws a challenge flag The Jets head coach has gone early with his challenge. Saleh has challenged a five-yard catch from Raheem Mostert, which was originally ruled a catch, with Mostert havign recoevered his own fumble. But the gamble pays off as the clall is overruled, saving Saleh from looking like a fool with such an early challenge in the first quarter. The catch was overturned and ruled an incomplete pass. Dolphins now have second-and-ten from their own 26-yard line. 20:14 Dolphins take over Tim Boyle's first start since 2021 featured one first down and the Jets first drive is over. On a third-and-long the Jets fail to convert in a critical spot - story of the season - and the hosts are forced to punt, which doesn't even cross the 50 yard line. Now it's Tua Tagovailoa's turn to come out with the Dolphins taking over from their own 15-yard line. 20:08 Jets' First Down Boyle, who is chanelling his inner Aaron Rodgers with a hard count, finds Brownlee, who is getting a chance today due to Lazard's healthy scratch, on 3&2. There's a flag on the play, offisde for the Dolphins' defense. And that is a Jets' first down! 20:05 We're underway! And it's the Jets who receive as Tim Boyle begins his first drive as New York's starting QB... but the hosts' first play only makes it one yard. 19:53 Where it all went wrong for Wilson... How it all went wrong for Zach Wilson with the New York Jets For Zach Wilson, the 2023 season was supposed to be a kind of football rehab. Instead the New York Jets quarterback has been tossed back into the fire, where his struggles only worsened. Mail Online 19:49 Miami's MetLife takeover The Dolphins fans have hit the Big Apple in their droves today as they look to have overtaken MetLife Stadium. 19:42 Zach Wilson doesn't believe he's 'scapegoated' for New York Jets' offensive woes Tim Boyle will be suiting up as QB1 for New York this afternoon after Zach Wilson was demoted. But Wilson doesn't think he's being 'scapegoated' by his demotion to the teams' third-string. 'I don't think I was scapegoated. Absolutely not,' Wilson said Tuesday. 'You've got to look at the situation. We're not scoring touchdowns.' 'Regardless of what I'm doing, my job as a quarterback is to help us score points,' Wilson continued. 'I can sit here and say I've had a bunch of growth and tremendous whatever this year, but if you're not scoring touchdowns, it doesn't matter.' 19:30 Aaron Rodgers is in the house The quarterback is once again at MetLife Stadium to cheer on his teammates from the sideline. The veteran has been sidelined since Week 1 when he tore his Achilles just four plays into his Jets debut. Rodgers, dressed in all black, was seen striding into the stadium a couple of hours before the game starts as he makes a desperate attempt to return to the field for the postseason - or even before! 19:27 $44m man Allen Lazard listed as INACTIVE Allen Lazard is a shock inactive for the Jets to face the Dolphins. The $44million man, who is a favorite of Aaron Rodgers, was not listed on the team's injury report heading into the game. The move raises some eyebrows with the Jets benching the wideout after splashing out in the summer to bring him to the Big Apple and reunite him with Rodgers. The inactive opens the door to opportunities for Irvin Charles and Jason Brownlee To no one's surprise, Zach Wilson is also inactive for today's game after his demotion to third-string quarterback earlier this week. OL Mekhi Becton, DL Carl Lawson, OL Austin Deculus, and Sam Eguavoen are also listed as the Jets' other inactives. 19:19 Bomb threat hours before game The shopping mall located next to MetLife Stadium in New Jersey was evacuated due to a bomb threat just hours before the Jets play the Miami Dolphins in the NFL's first-ever Black Friday game. At around 8:15am on Friday morning, New Jersey State Police issued a public safety alert that told visitors in the American Dream Mall, including employees, to evacuate. Then, in a post on X - formerly known as Twitter - New Jersey Governor Phil Murphy wrote that police were investigating a threat and shoppers should evacuate 'out of an abundance of caution.' However, around an hour later, he updated citizens and told them law enforcement said there was 'no imminent threat' and the mall was allowed to reopen. Shopping mall next to MetLife Stadium evacuated due to a bomb threat At around 8:15am on Friday morning, New Jersey State Police issued a public safety alert that told visitors in the American Dream Mall, including employees, to evacuate. Mail Online 19:17 Tis the season... In honor of Black Friday, the Jets have switched out their usual green home uniforms for all black ones, including a mean matching helmet 19:13 Welcome! Good afternoon and welcome to DailyMail.com's coverage of the AFC East showdown between the Miami Dolphins and the New York Jets. This afternoon's game is making history as it marks the NFL's first Black Friday game. The hosts head into the Week 12 matchup in desparate need of a win after losing its last three. Tim Boyle steps in at quarterback for the Jets after struggling Zach Wilson was benched during their previous game against the Buffalo Bills and demoted to third-string by head coach Robert Saleh. Meanwhile, the Dolphins are the clear favorites to win, sitting top of the AFC East with a 7-3 record. Stick around as we bring you all the buildup, updates and live score from MetLife Stadium. TOP STORIES Heartbreak for Miami Dolphins' Jaelan Phillips as he is carted off in tears at MetLife with Achilles tear... after battling to reach the NFL despite being medically retired due to concussions in his college career Miami Dolphins QB Tua Tagovailoa suffers GRUESOME cut on his arm in NFL's first ever Black Friday game... leaving fans squirming as they watch on TV: 'There's a CHUNK missing' Tyreek Hill catches a touchdown pass and immediately throws the ball to his new wife in the stands before blowing her a kiss... as he continues his record-breaking season for the Dolphins Black Friday 2023 LIVE deals: Best discounts and offers you don't want to miss on mattresses, vacuum cleaners and air fryers selected by our shopping experts LIVE Black Friday Deals 2023: The best sales and discounts handpicked by our shopping experts Aaron Rodgers arrives in all black for the NFL's first-ever Black Friday game... but will have to watch third-string Jets QB Tim Boyle against the Dolphins after Zach Wilson' benching Emily Ratajkowski poses in a skimpy blue bikini to announce the Inamorata Black Friday sale... after she was seen kissing Stephane Bak Aaron Rodgers 'changed his mind this week and WILL still return to the field if the New York Jets are out of playoff contention', Jay Glazer reveals - days after QB told Pat McAfee he wants to be back practicing NEXT WEEK Jets bench $44MILLION receiver Allen Lazard after just 10 games with Aaron Rodgers' former Green Bay teammate left inactive against the Dolphins Dolphins star Tyreek Hill's influencer wife has fan's nachos spilled over her during game but NFL fans claim it's her own fault Khloe Kardashian flaunts her rock-hard abs as she models a white bra top for Good American's Black Friday sale: 'My favorite style!' The under $50 deals our editors are ACTUALLY buying this Black Friday - prices start at $10 for Ninja, Apple, SKIMS, Olaplex and more The 35 BEST Black Friday deals that are actually worth buying - including Amazon devices, Lakeland heated airers, and Shark vacuums Cologne 0-1 Bayern Munich and PSG 5-2 Monaco RECAP: Live scores, team news and updates as Harry Kane nets again to break more records Flying to Utah on his bye week, tripping over the 10-yard line, and taking 105 sacks over three dreadful seasons... how it all went wrong for Zach Wilson with the New York Jets Move aside Travis and Taylor... is this the NFL's new power couple? Braxton Berrios and his stunning TikTok star girlfriend Alix Earle have been dubbed the 'most attractive couple on the planet' after confirming their romance Jodie Foster's son Kit, 22, TOWERS over her as he helps the actress carry a basket full of household goods in New York City Anti-Israel protesters target Macy's AGAIN and target Black Friday shoppers after disrupting store's NYC Thanksgiving parade - on same day hostages are released amid temporary ceasefire The 10 best air fryer deals we've found at Amazon for Black Friday! Unmissable savings of up to 50% off Ninja, Tefal, Tower and more Met Police brace for another weekend of protests: Tens of thousands to join pro-Palestine rally and antisemitism march with more than 1,500 officers on the streets of London to protect memorials and stop violent clashes Karaoke boss tells National Trust to 'lighten up' after his firm was slammed for shooting a TikTok video on 'fragile' Cerne Abbas Giant Black Friday 2023 LIVE deals: The wait is over! The sale of the year is here with the BIGGEST discounts we've seen on big-name brands like Apple, Ninja and Shark Here are the BEST beauty deals Amazon is offering during its epic Black Friday sale, including stunning savings on ELEMIS, Sunday Riley, ghd and Olaplex Target under fire for 'sexualizing Christmas for children' with 'pride Santa' decorations New Jersey shopping mall next to MetLife Stadium is evacuated due to a bomb threat just hours before Jets play the Dolphins in the NFL's first-ever Black Friday game Gobble up these INCREDIBLE Apple deals quick! MacBooks, AirPods, Apple Watches, iPads, and more are at their lowest prices ever! Get tech for LESS! Apple, Beats, and Samsung have SLASHED Black Friday prices already, score deals starting at $20 here NOW The death of Black Friday mayhem: British high streets are eerily quiet as shoppers shun queuing from 4am and brawling over TVs for snapping up Xmas bargains online - with £3billion set to be splurged Get a head start on the Black Friday sale with these editor-favorite finds under $50 from Shark, Keurig, and KitchenAid Get up to 55% off bestselling bed-in-a-box mattresses in Simba's Black Friday sale - including the Hybrid Original mattress for £598 less Alix Earle introduces her family to Miami Dolphins boyfriend Braxton Berrios in New Jersey as the NFL's hottest couple spend their first Thanksgiving together Black Friday's HOTTEST fashion deals revealed! Levi's, Calvin Klein, UGGs and more are on sale at Amazon - and prices start from under $16 Dublin riots LIVE updates: Taoiseach Leo Varadkar slams 'cowardly champions of Ireland' who rioted after knife attack on children - as clean-up operation gets underway Jets legend Joe Namath is accused of allowing child sex abuse by well-known prep school coach to take place at his football camp A quarter of Americans still have holiday debt from 2022 - as experts warn shoppers that soaring interest rates mean it could take 40 MONTHS to pay off a $1,000 credit card bill Emily Ratajkowski takes her dog Colombo for a post-Thanksgiving walk in New York City... after posing several bikini snaps Black Friday vacuum steal: The bestselling Shark upright vacuum shoppers call 'BETTER than Dyson' is now on offer with 40% OFF The Princess of Wales, Kylie Jenner, Michelle Obama, and Meghan Markle ALL swear by this luxe fashion brand - and you can get 25% off EVERYTHING in the Black Friday sale Kylie Jenner looks busty in a tight white tank top to announce Kylie Cosmetics Black Friday sale as friend Paris Hilton hits the like button I'm A Celebrity 2023 LIVE RECAP: Most notable contestant moments from the series launch Kristin Cavallari shows off her toned frame in scintillating bra and shorts in new Black Friday videos for her clothing company Uncommon James Bruce Lehrmann denies sex on the sofa with Brittany Higgins, 'pashing' her in a nightclub or touching her leg - as he's grilled over allegedly 'demanding she skol drinks' Score HUGE savings on Apple devices this Black Friday! Shop AirPods for just £99 - plus offers on iPads, Apple Watches, accessories and more Man United news LIVE: Sir Jim Ratcliffe is facing huge call on Casemiro and Raphael Varane futures as Erik ten Hag prepares for trip to crisis-hit Everton Aspinal of London's AMAZING Black Friday sale just got even better - score a DOUBLE discount on Kate Middleton's favourite bag brand for a limited time only Black Friday 2023: Etiquette expert reveals the worst shopping behaviors - and shares her top tips for making the experience more peaceful Don't get stung on Black Friday! Experts reveal how to spot if an online sale is REALLY a good deal - as many products were LESS expensive earlier in the year Leaked document shows Manchester United's 2004 transfer targets including a Premier League legend who led their rivals to glory… but Sir Alex Ferguson's side were able to land three names on their shortlist Former Wimbledon finalist David Nalbandian 'is accused of filming his model ex-girlfriend when hidden camera was found in her bedroom' Man City-Liverpool pundit predictions: Jamie Carragher, Roy Keane, Chris Sutton and Ian Wright are split over this weekend's big Premier League showdown... so which side has more backing them? Inside Everton's new £550m stadium as Mail Sport's IAN HERBERT takes a tour of the steepest legally-permitted stands and incredible views, as fans vow to fight 'corrupt' Premier League points docking Erik ten Hag fell out with Cristiano Ronaldo, swapped David De Gea for Andre Onana and has ostracised Jadon Sancho, but amid Man United's ongoing struggles, is the Dutchman RECKLESS or RUTHLESS? Steven Gerrard changes his mind on the GOAT debate... picking Cristiano Ronaldo as the world's greatest player - a year after he named Lionel Messi as his No 1 Oscar Pistorius WINS his bid for freedom: Paralympian who shot dead Reeva Steenkamp ten years ago is set to be released from jail after Christmas and will undergo therapy for 'anger and gender-based violence' REVEALED: Germany's players have FOUR issues with Julian Nagelsmann, as problems mount for the under-fire boss - who has lost more than he's won - with Kai Havertz key to one irritant Darwin Nunez looked a misfiring hothead but doubling his English lessons, help from Jurgen Klopp's 'son' and Marcelo Bielsa's tips have helped close gap on Erling Haaland for 'Liverpool Reloaded' Last-minute Movember? Mason Mount sports a new-look moustache as he arrives at Man United's training ground ahead of Sunday's crunch clash with Everton EXCLUSIVE: ANGE POSTECOGLOU INTERVIEW on his Tottenham love affair, Rod Stewart asking for his wine back - and why he hates chit-chat: 'The scrutiny may be coming now... but perversely I love it' 'I want to encourage people in the township to have wild dreams': South Africa captain SIYA KOLISI opens up on suffering childhood hunger and violence in moving first interview since clinching World Cup glory No wonder Lewis Hamilton wanted out! Christian Horner sticks the boot into Mercedes with dig at Brit's two-year race win drought as row over his Red Bull talks continue in Abu Dhabi Bunker mentality will SAVE Everton! Sean Dyche returns from golf break ready to lead Toffees' fight against relegation after 10-point deduction... with 'driven' group ready to tackle it head on - starting against Man United Liverpool star Dominik Szoboszlai is left laughing at Pep Guardiola's attempts to pronounce his name as Reds fans slam the City boss on social media ahead of Saturday's box office clash Country icon Dolly Parton, 77, sends the crowd wild in Dallas as she wears Cowboys CHEERLEADING outfit to perform NFL Thanksgiving halftime show at Washington-Dallas game Is this how Taylor Swift and Travis Kelce's relationship ends? Fans reveal bizarre conspiracy theory involving his brother Jason after spotting sign of the couple's fate during Eagles' win over the Chiefs Fans brand Jack Harlow's 'low-budget' performance during Lions-Packers as worst halftime show EVER: 'That's ruined Thanksgiving' Sadio Mane is congratulated by Cristiano Ronaldo and his Al-Nassr team-mates after reaching 100 caps for Senegal NBA is investigating allegations that Oklahoma City Thunder's Josh Giddey had an inappropriate relationship with a minor after pictures of them - including one where she boasted about having sex with him - were posted on social media KFC responds to Travis Kelce after he revealed he is spending Thanksgiving ALONE - eating fried chicken - because girlfriend Taylor Swift is on tour No invite for Travis today! Patrick and Brittany Mahomes celebrate Thanksgiving at home as they eat dinner with his brother Jackson and their children after having Kelce over earlier this week Casemiro and Raphael Varane are facing Manchester United exit, with incoming owner Sir Jim Ratcliffe ready to make big calls over the struggling stars' futures Legendary Argentina World Cup winner, 35, confirms he will RETIRE from international football after the Copa America next summer Mario Balotelli escapes unharmed after 'major crash' in his £100,000 Audi Q8 in Brescia as former Man City star 'refuses breathalyser' Tony Romo is trolled on social media for his VERY enthusiastic on-air reaction to 77-year-old Dolly Parton's halftime Thanksgiving performance: 'She went with the cheerleading outfit... wow, pretty good' Has Dave Portnoy SPLIT with stunning girlfriend Silvana Mojica? Model hints at shock breakup with Barstool Sports founder in tearful TikTok post Innocent Aussie sporting great Ricky Ponting is caught up in social media storm over 'cricket mafia' slur against India after their ODI World Cup loss IAN LADYMAN: He was a fantastic footballer... but is Wayne Rooney a dud in the dugout? Swedish trail runner Emilia Brangefalt, 21, dies by suicide, days after posting 'maybe I won't be back' on Instagram after being diagnosed with 'extremely high heart rate' which stopped training Novak Djokovic yells 'shut up' at British fans and accuses them of disrespect in furious bust-up after world No 1 beats Cam Norrie to seal Serbia victory in Davis Cup tie Travis Kelce is spotted SINGING in his Rolls Royce as he drives around Kansas City alone on Thanksgiving... after joking he'd spend the day eating KFC as lover Taylor Swift tours in Brazil Joe Smith reveals his $61million NBA fortune was reduced to just $3,000 amid his battle with depression - as he opens up on 'hard times' weeks after going viral for his wife's OnlyFans reveal Why footy superstar Nathan Cleary's party-packed offseason holiday photo album has got his fans offside Hilarious footage of a fresh-faced Travis Kelce asking a Chiefs staffer to call mom Donna MID-GAME to order 'gnocchi noodles' with his mac and cheese resurfaces Pat Cummins has a heartwarming reunion with wife Becky and son Albie - and jokes about an embarrassing problem - as he returns home after World Cup triumph Harald Hasselbach dead at 56: Family announce sad passing of two-time Super Bowl champion on Thanksgiving after battle with rare type of cancer Lionel Messi: David Beckham reveals he arrived at Inter Miami training every day at 7am after signing the Argentina legend to watch him 'go about everything he does' 'Traumatised' team-mate of Adam Johnson quits Nottingham Panthers after sharing that he 'tried to suppress everything' after witnessing the player's fatal on-ice collision Controversial ex-WWE star goes for drastic new look after getting haircut - as former UFC fighter looks to reinvent himself before pro wrestling return Matildas star reveals why she wanted Nathan Cleary BARRED from meeting his girlfriend Mary Fowler Jason Kelce posts adorable clip of himself watching the premiere of his 'Philly Special' Christmas video with his daughters on Thanksgiving... and it features a brilliant cameo from Travis! Taylor Swift and Travis Kelce: Pop star's parents 'CANCEL plans to meet the tight end's family for first time at Eagles-Chiefs showdown' with the singer unable to attend due to rescheduled Eras Tour in Brazil Jason Kelce's wife Kylie shuts down suggestions she has bad blood with Taylor Swift as she sets the record straight on headline that claimed she is 'trying to avoid' pop star's spotlight Footy star who became the hero of one of the AFL's greatest grand final dies after helping revolutionise the game in retirement Adam Johnson's fiancee shares emotional tribute to the late hockey star on Thanksgiving after his on-ice death: 'Missing you so much every single day, love you' England's 2003 Rugby World Cup heroes reunite for the first time in two decades to celebrate the 20-year anniversary of their historic Jonny Wilkinson-inspired victory in Australia Jamie Carragher reveals his England star to play alongside Declan Rice and Jude Bellingham in 'exciting' midfield and take Gareth Southgate's side to Euro 2024 glory Jason Kelce admits his 'whirlwind' rise to stardom has made it 'harder to go out' but the Philadelphia Eagles center insists he's trying to 'stay grounded with it and be realistic' EXCLUSIVE: Tottenham legend Jermain Defoe takes part in coaching session at Arsenal's academy HQ and gives advice to young Gunners... as the former striker continues bid to become a coach What Gabriel Agbonlahor said about Man United legend Nemanja Vidic... as former Aston Villa forward names four other centre-backs who he believes were much better Ben Stokes sends message to Australia as England captain breaks his silence for the first time since Ashes rival Pat Cummins led his side to incredible Cricket World Cup victory REVEALED: How the Chiefs are trying to prolong Travis Kelce's NFL career after their star tight end dropped several hints he may end his career soon Black Friday New York Jets Miami Dolphins Share or comment on this article: Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game e-mail What a wonderful sport. Love watching all those B... by Philly_Hotspur 1 Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-24 23:25:57","image_url":"https://i.dailymail.co.uk/1s/2023/11/24/23/78215907-0-image-m-59_1700868262286.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5fd5f49d87bef0c8df8920609e99a23c","title":"Gina Rinehart offers radical plan to ‘save’ 2026 Commonwealth Games","link":"https://7news.com.au/sport/commonwealth-games/gina-rinehart-offers-radical-plan-to-save-2026-commonwealth-games-c-12676845","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"The mining magnate wants the Games staged in two different cities, 4000km apart.","content":"Gina Rinehart is spearheading a radical bid to save the 2026 The 2026 event, and the future of the Games more broadly, has been hanging by a thread since the The Labor government initially devised a plan to stage the Games across several towns in regional Victoria before ultimately admitting it was ill-advised to do so, citing the reported $4 billion price tag that came with it. No city - in Australia or elsewhere - has since put its hand up to take Victoria’s place, compounding the separate issue that Canadian city Alberta has already pulled its support for the 2030 event. The clock is now ticking as 2026 fast approaches, with a concrete solution yet to be found. But in a letter submitted to Prime Minister Anthony Albanese, which was signed by Gold Coast mayor Tom Tate and Perth Lord Mayor Basil Zempilas, Australia’s richest person, Gina Rinehart, has offered a left-field, multi-city idea that could resole the issue. Rinehart, with the support of Mayors Tate and Zempilas, wants to stage the Games at opposite ends of the country. “We believe that a coast-to-coast Games presents a special opportunity to showcase Australia and provides an excellent background for you to invite those heads of the Commonwealth you may wish to have further discussions with, and/or entertain,” the letter reads. “A background where Australia pulls well above its weight, and shines!” The two cities would make use of existing facilities to host the games, with Gold Coast having only recently had them in 2018, and Perth boasting its brand new, state-of-the-art Perth Stadium, which could be used as an athletics track. In theory, Gold Coast could host the first week before handing the keys over to Perth for the second. The three figures also took a swipe at the Victorian government, which pulled the Games while Daniel Andrews was still premier. “The Victorian government’s decision to cancel the 2026 Commonwealth Games was disappointing and a huge blow to Australia’s reputation and to our athletes,” it went on. “Australia is meant to be viewed as a successful G20 nation, and the fact that we can’t organise and fund a Commonwealth Games undermines that reputation. “We believe that saving the Commonwealth Games via a dual-city approach would be popular and in the national interest, and would not only bring huge benefits to our athletes and cities, but also excitement and lasting advantages to our nation. “As you know, the history of the Commonwealth Games — which is made up of over 70 nations and territories — is a source of immense pride for many around the world. And an important opportunity to invite Commonwealth heads to Australia.” Rinehart is a noted supporter of sports, having offered to before throwing her support behind the Australian Dolphins swimming team. She is also understood to be a keen fan of rowing, artistic swimming and volleyball. But Melbourne radio host Tom Elliott slammed the idea, saying it would be a practical impossibility. “You could not pick two cities in Australia that are further apart from each other — over 4000km,” Elliott said on his show on 3AW. “The Victorian Commonwealth Games, which were going to be in four or five regional parts of Victoria — that was never going to work because the events were too far away from each other. It was just never going to work and that’s why the government abandoned them, even though it was the government’s idea. “To have a Commonwealth Games split between the Gold Coast and Perth, I just think is utter madness. “The idea is that they do the first week of events on the Gold Coast and the second week in Perth. But think about it — unless every official and volunteer moves between the Gold Coast and Perth — and where would you put them all, they effectively have to recruit all the people again just to make the Games run. “You’ve got to build two athletes villages. It’s just such a dumb idea. “I think we need to accept, as sad as this is, that the era of the Commonwealth Games is over. Not that many people watch it, not that many countries compete in it, it doesn’t make any money — that’s the reason cities don’t want to host it.” Rinehart’s letter rejects the notion that it would be too hard. “We believe that saving the Commonwealth Games via a dual city approach would be popular and in the national interest, and would not only bring huge benefits to our athletes and cities, but also lasting advantages to our nation,” the letter goes on. “We believe it would be a far more popular decision than the recently announced $600 million for Papua New Guinea football, and not as expensive. “Perhaps some of that expenditure could be redirected to improve Australian facilities for the Commonwealth Games and later Olympic Games in Queensland?”","pubDate":"2023-11-24 23:05:24","image_url":"https://images.7news.com.au/publication/C-12676845/37fc09f492f45e4c2ac3fec52647fdf02cf61a1f-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2becf2097e42c0cbd489cf6e5d6911ae","title":"Harry Kane smashes two records in one night as Bayern Munich scoring spree continues","link":"https://www.dailystar.co.uk/sport/football/harry-kane-bayern-munich-record-31524508","keywords":["Sport"],"creator":null,"video_url":null,"description":"Harry Kane continues to obliterate records in Germany, taking his Bundesliga tally for the season to 18 in Bayern Munich's victory away to Cologne","content":"shattered two more records as his incredible scoring spree with continued. The England captain hit the only goal as the Bundesliga champions won at Cologne to go top of the table. Kane netted from close range in the 20th minute after Eric Maxim Choupo-Moting's shot was cleared off the line. His 18th goal of the season saw him break two records. First, he became the first player in Bundesliga history to score 18 goals in the first 12 matchdays of a season. Secondly, he is the first English player to score 18 goals in a Bundesliga campaign, a season which is just a third old. Jadon Sancho, for Borussia Dortmund in 2019/20, and Kevin Keegan, for Hamburg in 1978/79, both scored 17. Kane’s arrival has filled the void created by Robert Lewandowski’s departure in 2022. He has surpassed what the Polish goal machine did in his first season with Bayern, the 2014/15 campaign, which saw him hit 17 in 31 games. Kane has 22 in all competitions, making him the leading scorer in the top five leagues across Europe. Posting on X (formerly Twitter) after his latest goal, Kane said: “Great win away from home. Had good control throughout the whole game! Let’s keep it going.” The 30-year-old's goalscoring exploits are being lauded around Europe. One fan said: “Incredible achievement by Harry Kane! The record-breaking history he's making in the Bundesliga is truly remarkable.” The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Another declared: “At this point, I think we can all agree that is undoubtedly the best candidate for the next . What a player has got there.” Despite Kane’s goals, Bayern aren’t running away at the top of the table and Xabi Alonso’s Bayer Leverkusen will go back to the summit if they win at Werder Bremen on Saturday.","pubDate":"2023-11-24 23:03:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31524431.ece/ALTERNATES/s98/0_1-FC-Kln-v-FC-Bayern-Mnchen-Bundesliga.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f2532aa506d37d645e2a374b7a8a38c8","title":"Papers: Man Utd and Chelsea lead chase for Brazilian wonderkid Messinho","link":"https://www.skysports.com/football/news/20876/13015480/manchester-united-and-chelsea-lead-premier-league-chase-for-16-year-old-palmeiras-wonderkid-messinho-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"The top stories and transfer rumours from Saturday's newspapers...","content":"The top stories and transfer rumours from Saturday's newspapers... THE SUN Manchester United and Chelsea have joined what is turning into a Premier League bidding war for 16-year-old Brazil talent Messinho, who currently plays for Palmeiras. Mauricio Pochettino will fork out thousands of pounds by taking players and staff out for dinner following his three yellow cards for unruly behaviour this season. Former Liverpool star Jose Enrique feels only Manchester United deciding they are a long-term project will keep Erik ten Hag in his role by the time the 2023-24 season ends. Please use Chrome browser for a more accessible video player DAILY MAIL Barcelona will be looking to sign a midfielder in the January transfer window after confirmation that teenage star Gavi suffered a torn ACL while on international duty with Spain. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Pep Guardiola promised he will stay in charge of Manchester City even if they are relegated to League One if found guilty of breaching Premier League financial rules. Mason Mount is unlikely to be available for Manchester United first-team action until Christmas after suffering a calf injury. Tottenham boss Ange Postecoglou admits he has been \"frustrated\" at being dismissed in managerial circles just for his Australian background and wonders if the door might have been shut on managers from the country if he had struggled at Celtic. Jude Bellingham's rise to the top of football's megastars could next see him sign a multi-million pound endorsement with French fashion house Louis Vuitton. Eyebrows were raised within the Football Association when Barnsley did not even request a personal hearing over their ineligible player charge which saw them expelled from the FA Cup. DAILY TELEGRAPH Chelsea striker Nicolas Jackson has revealed his incredible journey to stardom at Stamford Bridge and says he was still playing football in bare feet in Senegal as recently as six years ago. Erik ten Hag's agent Kees Vos will be back in court in the Netherlands next month, facing one of his former clients Stefan de Vrij in an appeal against a £4m-plus payout he was ordered to make in damages over the SEG agency's handling of his free transfer move to Inter Milan in 2018. Surrey chairman Oli Slipper is keen to embrace The Hundred further but wants a rebrand of the Oval Invincibles, potentially just using their county name instead. DAILY STAR Tickets for England's high-profile friendly with Brazil were sold out before even reaching the stage where they would be made available to the general public. Real Madrid have already \"made contact\" with Roberto de Zerbi - according to a report in Spain - as they seek to get a replacement for Carlo Ancelotti in place by the time his current deal expires next summer. DAILY MIRROR Premier League stars have been complaining to the PFA that a sharp rise in injuries, in particular muscular strains and pulls, are being caused by the time it takes to make VAR decisions. THE TIMES Newcastle United want Manchester City midfielder Kalvin Phillips and PSG striker Hugo Ekitike in January but any deals will have to be done in the loan market because of FFP rules. Novak Djokovic has slammed anti-doping officials for the \"shameful\" decision to notify him he had been selected for testing 90 minutes before his Davis Cup clash with Cameron Norrie. David Gower would be open to becoming the next chairman of the MCC after emerging as a possible contender. DAILY RECORD Celtic are set to make a renewed effort to sign Brondby striker Mathias Kvistgaarden in January. Barry Ferguson believes his nephew Lewis could be on the move to a \"massive\" club as early as January amid reported interest from Juventus in the Bologna captain. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-24 23:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"81306f8647f40bad73f9b24fd264dcd7","title":"Cristiano Ronaldo scores 'goal of the season' sending football to the moon and back","link":"https://www.dailystar.co.uk/sport/football/cristiano-ronaldo-al-nassr-goal-31524184","keywords":["Sport"],"creator":null,"video_url":null,"description":"Cristiano Ronaldo continues to make headlines in Saudi Arabia after his second goal in Al-Nassr's 3-0 victory was a beautiful lobbed effort from almost 30 yards out","content":"scored a dazzling lobbed shot for Al-Nassr with fans already hailing it as the 'goal of the season'. The five-time Ballon d'Or winner was amongst the goals once again for the club as he scored a brace as they cruised to a 3-0 win at home against Al-Akhdoud. Ronaldo's return to the side following international duty with Portugal was a fruitful one as he now has 15 league goals this season. Fans had to wait until the 77th minute to see the 38-year-old get on the scoresheet and he did so in supreme fashion after controlling the ball before taking a touch and finishing home from a tight angle to make it 2-0 after Sami Al Naji's opener in the first half. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . In true Ronaldo fashion, he outdid himself with his second goal of the game after Al-Akhdoud goalkeeper Paulo Vitor found himself in no-man's land by making a save in his own half. The ball bounced to Ronaldo who controlled the ball with his chest and lobbed the keeper from almost 30 yards out, with the ball going outrageously high in the air in the process. Delighted with his effort after the ball practically went to the moon and back, the legend ran off celebrating the strike with his team-mates as it capped off an impressive night for Ronaldo who's now scored 24 goals in all competitions for Al-Nassr. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Fans on social media took their time to praise the stunning strike as one X user wrote: \"Goal of the season for sure\", while another was impressed with Ronaldo's performances despite his advancing age as they commented: \"This guy is getting better and better each day bro\". A third even went as far to say: \"Give this man a Ballon d'Or\", as Ronaldo's side are now just one point behind leaders Al-Hilal who have a game in hand. His 15 league goals are five more than the second highest scorer in the Saudi Pro League which is former Fulham striker Aleksander Mitrovic who plays for the league leaders. Ronaldo is also one of eight Saudi League players to score a hat-trick this season, alongside ex- team-mate Karim Benzema and legend Roberto Firmino.","pubDate":"2023-11-24 22:49:56","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31524291.ece/ALTERNATES/s98/2_RONALDO-GOAL.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2c5e92f6856df9e1a9e1b7fb645245d2","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.northwalespioneer.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.northwalespioneer.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"db786f4b19c57a1a9483de11ba60f810","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.southwalesguardian.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.southwalesguardian.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"9dc02e5f538c62baf84b5f3962bf13de","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.northwaleschronicle.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2d5faabd0646bda11dc853142e7bfb5a","title":"Mauricio Pochettino wants managers ‘involved in decisions’ around referee reform","link":"https://www.northwaleschronicle.co.uk/sport/national/23947443.mauricio-pochettino-wants-managers-involved-decisions-around-referee-reform/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have been involved in a number of controversial fixtures this season.","content":"Mauricio Pochettino believes Premier League managers should be invited to play a more active role in helping shape refereeing guidelines. Chelsea have been involved in a number of controversial fixtures this season, most notably the frenetic 4-1 win away at Tottenham earlier in November in which Spurs had two players sent off, five goals were disallowed and VAR made nine interventions across a match that lasted over 110 minutes. Pochettino has previously complained that the league’s request to meet with coaches in the week before the beginning of the season to discuss changes allowed little room for constructive input from managers and their clubs. The current campaign has seen a barrage of complaints directed at on-field and VAR officials, with referees coming under almost unprecedented scrutiny following a string of errors, particularly relating to the influence of the video referee on the decision-making process. “We all have full respect for the referees, we understand perfectly that their job is really tough,” said Pochettino, whose team face Newcastle at St James’s Park on Saturday. “But the problem is you get frustrated sometimes during the game because of the VAR. The referee is not responsible sometimes. You cannot complain to the VAR. That is a problem. “I’m going to try and control more my emotions. I think all the coaches respect the referees because they’re in a really difficult situation. Training for Tyneside. ✊ — Chelsea FC (@ChelseaFC) “I think sometimes we are frustrated. I think coaches need to be more involved in the decisions, and to work together during the season. “It is not (ideal) to arrive the week before the start of the Premier League season and say, ‘OK, the new rules are this. What do you think?’. Nothing, because you have already made the decision. Like the rule that there can only be one coach (in the technical area). Why? “England was always different about the relationship with the referee. You can talk, you can (previously) have four people in the dugout. Which way do we want to evolve in the Premier League? “England is different. Not only because you drive on the right (of the car), but because of the relationship in football. It is the gentleman’s game.” Despite those frustrations, and the ongoing confusion surrounding the proper implementation of VAR and its interpretation of the game’s rules, Pochettino acknowledged that the emotional side of football is ultimately what props up the business side of the sport. “I think people look at football and understand that it is a big business,” he said. “The sport is very honest, with rules. But around that it is a business that we cannot stop. “If the sport doesn’t produce that emotion it is producing, it is difficult to talk about it in this way, to have the chance to have good salaries, to give also to society. “Football provides people with happiness and that is the most important thing. We are all part of this business.”","pubDate":"2023-11-24 23:39:58","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17482675/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"58450b1bc83cef7ccc2fcce694724eed","title":"Mauricio Pochettino wants managers ‘involved in decisions’ around referee reform","link":"https://www.southwalesguardian.co.uk/sport/national/23947443.mauricio-pochettino-wants-managers-involved-decisions-around-referee-reform/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have been involved in a number of controversial fixtures this season.","content":"Mauricio Pochettino believes Premier League managers should be invited to play a more active role in helping shape refereeing guidelines. Chelsea have been involved in a number of controversial fixtures this season, most notably the frenetic 4-1 win away at Tottenham earlier in November in which Spurs had two players sent off, five goals were disallowed and VAR made nine interventions across a match that lasted over 110 minutes. Pochettino has previously complained that the league’s request to meet with coaches in the week before the beginning of the season to discuss changes allowed little room for constructive input from managers and their clubs. The current campaign has seen a barrage of complaints directed at on-field and VAR officials, with referees coming under almost unprecedented scrutiny following a string of errors, particularly relating to the influence of the video referee on the decision-making process. “We all have full respect for the referees, we understand perfectly that their job is really tough,” said Pochettino, whose team face Newcastle at St James’s Park on Saturday. “But the problem is you get frustrated sometimes during the game because of the VAR. The referee is not responsible sometimes. You cannot complain to the VAR. That is a problem. “I’m going to try and control more my emotions. I think all the coaches respect the referees because they’re in a really difficult situation. Training for Tyneside. ✊ — Chelsea FC (@ChelseaFC) “I think sometimes we are frustrated. I think coaches need to be more involved in the decisions, and to work together during the season. “It is not (ideal) to arrive the week before the start of the Premier League season and say, ‘OK, the new rules are this. What do you think?’. Nothing, because you have already made the decision. Like the rule that there can only be one coach (in the technical area). Why? “England was always different about the relationship with the referee. You can talk, you can (previously) have four people in the dugout. Which way do we want to evolve in the Premier League? “England is different. Not only because you drive on the right (of the car), but because of the relationship in football. It is the gentleman’s game.” Despite those frustrations, and the ongoing confusion surrounding the proper implementation of VAR and its interpretation of the game’s rules, Pochettino acknowledged that the emotional side of football is ultimately what props up the business side of the sport. “I think people look at football and understand that it is a big business,” he said. “The sport is very honest, with rules. But around that it is a business that we cannot stop. “If the sport doesn’t produce that emotion it is producing, it is difficult to talk about it in this way, to have the chance to have good salaries, to give also to society. “Football provides people with happiness and that is the most important thing. We are all part of this business.”","pubDate":"2023-11-24 23:39:58","image_url":"https://www.southwalesguardian.co.uk/resources/images/17482675/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a3dd723830ac3d7c7cc137b742a2419b","title":"Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game","link":"https://www.dailymail.co.uk/sport/live/article-12788321/Miami-Dolphins-New-York-Jets-live-result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Relive all the action from the Dolphins 34-13 rout of the New York Jets as the hosts' offensive woes continue under Tim Boyle in the NFL's first ever Black Friday game with DailyMail.com's live blog.","content":"Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game By Isabel Baldwin For Dailymail.Com Published: 19:03, 24 November 2023 | Updated: 23:25, 24 November 2023 e-mail 2 View comments Relive all the action from the Miami Dolphins 34-13 rout of the New York Jets as the hosts' offensive woes continue under quarterback Tim Boyle in the NFL's first ever Black Friday game with DailyMail.com's live blog. 23:21 Goodnight! That's all from us! Aaron Rodgers may be desperately working to return from injury but after today's game he may not want to. Hopes of seeing the quarterback playoffs took a huge blow as it looks like the Jets won't even be seeing the postseason themselves. Meanwhile, Micke McDaniel will be heading back to SoFlo on Cloud Nine as his Dolphins helped their chances of taking a home field advantage into the postseason. 23:05 FINAL: Dolphins 34-13 Jets It's the same old story in New York. The Jets's switch of Tim Boyle for zach Wilson has reaped no rewards. It's a new quarterback but same old offensive issues in East Rutherford. Meanwhile, the dangerous Dolphins improved to 8-3. 22:55 TOUCHDOWN! Dolphins 34-13 Jets Most of the crowd has filed out into the parking lot by this point. Miami piles on the misery for New York by following up the Jets' first offensive touchdown of the game by scoring just one minute later. Mosert puts the icing on the cake of an impressive performance for the Dolphins by running it in for a 34-yard touchdown and his second of the game. He even has time to taunt New York's Tony Adams by slowing his pace and sending the defensive back zig zagging right on the line. 22:52 Holland heads to the medical tent Meanwhile, Jevon Holland - the hero of the game's Hell Mary - has entered the medical tent and has been listed as questionable to return with a knee injury. 22:47 TOUCHDOWN! Dolphins 27-13 Jets The Jets forced another Tua Tagovailoa turnover in the fourth quarter when he fumbled and Ashytn Davis recovered. It's Jets possession and Garrett Wilson tries to haul in a pass in the end zone but is well covered by Elliott and it's ruled incomplete. But the Jets manage to set up first-and-goal on the next play. This time Boyle does manage to find Wilson in the end zone for the Jets' first offensive touchdown of the game. It's only taken them 55 minutes... 22:43 Umpire left bloodied at skirmish Umpire Carl Paganelli appears to have been caught on the mouth and left with a cut during that scuffle between Mosley and Clemons. The referee was seen spitting blood following the skirmish. Clemons was ejected for making contact with an official but it's unclear if Paganelli's injury resulted from Clemons' contact. 22:36 Dolphins interception Well, that was at least some sign of life from the Jets. Boyle manages to string together a 17-play, seven-minute play before makes the interception. Well, it was good while it lasted. For those of you still keepig count, that brings the Jets' tally to six punts and two interceptions through eight offensive possesions. 22:31 Phillips carted off in tears On the replay, Phillips appears to have torn something after a pass rush step and could be looking at a season-ending injury. The 24-year-old is in tears as he taken off the field on the back of the golf cart. 22:26 Jaelan Phillips is down The Dolphins lineback has gone down on the field and remains down. It does not look good for Phillips with the entire sideline on the field to check on hgim and th cart has come out. He's now carted off with what appears to be a lower leg injury. The MetLife turf claims yet another victim. 22:11 TOUCHDOWN! Dolphins 27-6 Jets Tagovailoa hands off to Mostert, who weaves his wy through the Jets defense and into the end zone to open the Dolphins' final quarter with a rushing touchdown. It rounds off a 15-play, 92-yard drive that lasted nine minutes and sees them go up three scores. And tensions are clearly runmning high for New York now as the extra point sparks a scuffle. C.J. Mosley and Micheal Clemons are flagged for personal fouls, with Clemons' penalty also enforced because it occurrs against an official. 22:10 End of the third quarter Not too much to report from the third quarter. Well, nothing Jets fans will want to hear anyway. The Dolphins dominated possession, having the ball for 13 minutes of the quarter and they'll have a first-and-10 from the Jets' 14-yard line when the fourth quarter begins. The Jets... well do I really need to say? 22:06 Tua is playing through the pain Miami Dolphins QB Tua Tagovailoa suffers GRUESOME cut on his arm WARNING - GRAPHIC CONTENT: Miami Dolphins quarterback Tua Tagovailoa was left bloodied in the NFL's first ever Black Friday game, after suffering a gruesome cut on his right arm. Mail Online 21:58 Jets start their second half in the same woeful fashion as the first Boos are echoing around MetLife Stadium now as Jets fans are forced to suffer through yet another woeful drive that ends in, you guessed it, another punt. That's the sixth of the game. The Jets’ first drive after halftime lasted just three plays, including Wilkins' brutal sack on Boyle before New York punts once again. New York's seven offensive possessions have ended with punts and the interception for a six pick return. Where's Zach Wilson? At least he could get them within goal range... sometimes. 21:48 FIELD GOAL! Dolphins 20-6 Jets It's a Dolphins drive to start the third quarter but Bryce Huff records a sack on Tagolvailoa to force a Jason Sanders field goal. Sanders' 54-yard attempt is straight down the middle and the Dolphins extend their lead to 20-6. Miami traveled seven plays and 39 yards in just under four minutes, including a Jaylen Waddle 32-yard connection on third down. 21:42 Safe to say Jevon Holland enjoyed that one... 21:40 HALFTIME: Dolphins 17-6 Jets Crushing end to the first half for the hosts. Just as the Jets looked to have clawed their way back into the game with Echols' pick six handing them a lifeline, Tom Boyle's intercepted Hail Mary knocks them back once again. New quarterback, same old problems for New York. 21:27 TOUCHDOWN! Dolphins 17-6 Jets Unbelievable scenes at MetLife Stadium as the Dolphins swiftly follow up the Jets' pick-six with one of their own. The Jets attempt a Hail Mary with two seconds left on the clock in the second quarter... which turns into a 99-yard pick-six for the Dolphins. Boyle launches it down the field in a desperate attempt to find someone - anyone - in the end zone, and he finds exactly the wrong person as Holland intercepts the ball before charging the entire length of the field. New York flails around the field as they fail to stop Holland and he cruises into the end zone. Crushing blow for the Jets defense, who have their pick six rewarded by their offense throwing one. 21:19 TOUCHDOWN! Dolphins 10-6 Jets The Jets are finally on the board. I repeat, the Jets are FINALLY on the board. Echols picks off Tua, who tries to find Berrios, and walks it into the end zone to score the first touchdown for the Jets. They fail to close the gap further however, as Zuerlein misses the kick. In his defense, he's not had much practice kicking extra points this season. MetLife Stadium finally has something to cheer about... it's been a while. 21:07 And the calls from Jets fans for Zach Wilson's return have already begun 21:06 Jets punt... AGAIN Jaelan Phillips catches Boyle by surprise, breaking through the Jets' o-line and gets a hand to the quarterback's pass to tip it at the line pof scrimmage He can't quite reel in the ball for the interception... but the drive ends with a fourth consecutive punt. 20:59 Take a look at the first TD of the game 20:54 TOUCHDOWN! Dolphins 10-0 Jets Tagovailoa finds Hill for the receving touchdown to extend the Dolphins' lead to 10-0. Hill hauls in the ball and evades the tackle from Jordan Whitehead, sending the safety sprawling and jogs into the end zone. It marks the wide receiver's 10th receiving touchdown of the season and he celebrates by handing the scoring ball to his new wife, Keeta, in the stands. 20:51 Aaron Rodgers all smiles on the sidelines 20:49 End of the first quarter The Jets' third drive starts with a five yard loss after Breece Hall dropped a handoff from Tim Boyle, they fumbled on first down and recovered. On third-and-ten, Brownlee was flagged for a false start and at the end of the first quarter the Dolphins still lead 3-0 - and have barely been threatened by the Jets. 20:47 Tua hits the 3,000-yard mark Tua Tagovailoa hits the 3,000-yard mark for the seocnd consecutive season. The quarterback becomes the first Dolphins player not called Dan Marino to throw for 3,000-plus yards in the first 11 games of a season. 20:40 FIELD GOAL! Dolphins 3-0 Jets There's finally some points on the board! After the previous decision to go for it on fourth down failed, McDaniel opts for a different approach. On a fourth-and-1 from the Jets’ 20-yard line, the Dolphins go for a 38-yard field goal which is safely through the posts. 20:38 New York punts The Dolphins offense may not be soring any points - yet - but the defense nearly does. aelan Phillips and Bradley Chubb nearly sack Tim Boyle in the end zone for a safety. The Jets QB manages to heave the ball away to keep the Jets drive alive - just - but a couple of plays later New York punts AGAIN. 20:33 Jets force the turnover Tagovailoa can't lead the Dolphins into the endzone and on fourth-and-goal, Mike McDaniel opts to go for it. But Hill can't make the catch with the ball slipping through his hands. The Jets force the turnover, taking over from their own five-yard line. 20:30 Tua playing through a slash to his arm Tua is proving just how tough he is as the Miami quarterback is spotted playing on despite bearing a deep gash on his right arm. It's not clear how the signal caller sustained the cut but he has been sporting since the first drive. It looks like the lefty is missing a chunk out of his arm - right in the middle of his tattoo sleeve. 20:27 Sauce saves the TD Sauce Gardner bails out the Jets with great on-on-one coverage with Hill in the end zone to prevent th Dolphins touchdown on fourth down. 20:21 Hill comes hopping off Reed is fortunate just to catch up with him before managing to bring him down with a tackle from behind. Hill comes hobbling off and looks to be in some pain on the sideline. But Dolphins fans can rest easy as Hill sits out just the on play before he comes running back on. He had a quick exam on his left foot before being given the all clear to return. Medicare express. 20:20 Robert Saleh throws a challenge flag The Jets head coach has gone early with his challenge. Saleh has challenged a five-yard catch from Raheem Mostert, which was originally ruled a catch, with Mostert havign recoevered his own fumble. But the gamble pays off as the clall is overruled, saving Saleh from looking like a fool with such an early challenge in the first quarter. The catch was overturned and ruled an incomplete pass. Dolphins now have second-and-ten from their own 26-yard line. 20:14 Dolphins take over Tim Boyle's first start since 2021 featured one first down and the Jets first drive is over. On a third-and-long the Jets fail to convert in a critical spot - story of the season - and the hosts are forced to punt, which doesn't even cross the 50 yard line. Now it's Tua Tagovailoa's turn to come out with the Dolphins taking over from their own 15-yard line. 20:08 Jets' First Down Boyle, who is chanelling his inner Aaron Rodgers with a hard count, finds Brownlee, who is getting a chance today due to Lazard's healthy scratch, on 3&2. There's a flag on the play, offisde for the Dolphins' defense. And that is a Jets' first down! 20:05 We're underway! And it's the Jets who receive as Tim Boyle begins his first drive as New York's starting QB... but the hosts' first play only makes it one yard. 19:53 Where it all went wrong for Wilson... How it all went wrong for Zach Wilson with the New York Jets For Zach Wilson, the 2023 season was supposed to be a kind of football rehab. Instead the New York Jets quarterback has been tossed back into the fire, where his struggles only worsened. Mail Online 19:49 Miami's MetLife takeover The Dolphins fans have hit the Big Apple in their droves today as they look to have overtaken MetLife Stadium. 19:42 Zach Wilson doesn't believe he's 'scapegoated' for New York Jets' offensive woes Tim Boyle will be suiting up as QB1 for New York this afternoon after Zach Wilson was demoted. But Wilson doesn't think he's being 'scapegoated' by his demotion to the teams' third-string. 'I don't think I was scapegoated. Absolutely not,' Wilson said Tuesday. 'You've got to look at the situation. We're not scoring touchdowns.' 'Regardless of what I'm doing, my job as a quarterback is to help us score points,' Wilson continued. 'I can sit here and say I've had a bunch of growth and tremendous whatever this year, but if you're not scoring touchdowns, it doesn't matter.' 19:30 Aaron Rodgers is in the house The quarterback is once again at MetLife Stadium to cheer on his teammates from the sideline. The veteran has been sidelined since Week 1 when he tore his Achilles just four plays into his Jets debut. Rodgers, dressed in all black, was seen striding into the stadium a couple of hours before the game starts as he makes a desperate attempt to return to the field for the postseason - or even before! 19:27 $44m man Allen Lazard listed as INACTIVE Allen Lazard is a shock inactive for the Jets to face the Dolphins. The $44million man, who is a favorite of Aaron Rodgers, was not listed on the team's injury report heading into the game. The move raises some eyebrows with the Jets benching the wideout after splashing out in the summer to bring him to the Big Apple and reunite him with Rodgers. The inactive opens the door to opportunities for Irvin Charles and Jason Brownlee To no one's surprise, Zach Wilson is also inactive for today's game after his demotion to third-string quarterback earlier this week. OL Mekhi Becton, DL Carl Lawson, OL Austin Deculus, and Sam Eguavoen are also listed as the Jets' other inactives. 19:19 Bomb threat hours before game The shopping mall located next to MetLife Stadium in New Jersey was evacuated due to a bomb threat just hours before the Jets play the Miami Dolphins in the NFL's first-ever Black Friday game. At around 8:15am on Friday morning, New Jersey State Police issued a public safety alert that told visitors in the American Dream Mall, including employees, to evacuate. Then, in a post on X - formerly known as Twitter - New Jersey Governor Phil Murphy wrote that police were investigating a threat and shoppers should evacuate 'out of an abundance of caution.' However, around an hour later, he updated citizens and told them law enforcement said there was 'no imminent threat' and the mall was allowed to reopen. Shopping mall next to MetLife Stadium evacuated due to a bomb threat At around 8:15am on Friday morning, New Jersey State Police issued a public safety alert that told visitors in the American Dream Mall, including employees, to evacuate. Mail Online 19:17 Tis the season... In honor of Black Friday, the Jets have switched out their usual green home uniforms for all black ones, including a mean matching helmet 19:13 Welcome! Good afternoon and welcome to DailyMail.com's coverage of the AFC East showdown between the Miami Dolphins and the New York Jets. This afternoon's game is making history as it marks the NFL's first Black Friday game. The hosts head into the Week 12 matchup in desparate need of a win after losing its last three. Tim Boyle steps in at quarterback for the Jets after struggling Zach Wilson was benched during their previous game against the Buffalo Bills and demoted to third-string by head coach Robert Saleh. Meanwhile, the Dolphins are the clear favorites to win, sitting top of the AFC East with a 7-3 record. Stick around as we bring you all the buildup, updates and live score from MetLife Stadium. TOP STORIES Heartbreak for Miami Dolphins' Jaelan Phillips as he is carted off in tears at MetLife with Achilles tear... after battling to reach the NFL despite being medically retired due to concussions in his college career Miami Dolphins QB Tua Tagovailoa suffers GRUESOME cut on his arm in NFL's first ever Black Friday game... leaving fans squirming as they watch on TV: 'There's a CHUNK missing' Tyreek Hill catches a touchdown pass and immediately throws the ball to his new wife in the stands before blowing her a kiss... as he continues his record-breaking season for the Dolphins Black Friday 2023 LIVE deals: Best discounts and offers you don't want to miss on mattresses, vacuum cleaners and air fryers selected by our shopping experts LIVE Black Friday Deals 2023: The best sales and discounts handpicked by our shopping experts Aaron Rodgers arrives in all black for the NFL's first-ever Black Friday game... but will have to watch third-string Jets QB Tim Boyle against the Dolphins after Zach Wilson' benching Emily Ratajkowski poses in a skimpy blue bikini to announce the Inamorata Black Friday sale... after she was seen kissing Stephane Bak Aaron Rodgers 'changed his mind this week and WILL still return to the field if the New York Jets are out of playoff contention', Jay Glazer reveals - days after QB told Pat McAfee he wants to be back practicing NEXT WEEK Jets bench $44MILLION receiver Allen Lazard after just 10 games with Aaron Rodgers' former Green Bay teammate left inactive against the Dolphins Dolphins star Tyreek Hill's influencer wife has fan's nachos spilled over her during game but NFL fans claim it's her own fault Khloe Kardashian flaunts her rock-hard abs as she models a white bra top for Good American's Black Friday sale: 'My favorite style!' The under $50 deals our editors are ACTUALLY buying this Black Friday - prices start at $10 for Ninja, Apple, SKIMS, Olaplex and more The 35 BEST Black Friday deals that are actually worth buying - including Amazon devices, Lakeland heated airers, and Shark vacuums Cologne 0-1 Bayern Munich and PSG 5-2 Monaco RECAP: Live scores, team news and updates as Harry Kane nets again to break more records Flying to Utah on his bye week, tripping over the 10-yard line, and taking 105 sacks over three dreadful seasons... how it all went wrong for Zach Wilson with the New York Jets Move aside Travis and Taylor... is this the NFL's new power couple? Braxton Berrios and his stunning TikTok star girlfriend Alix Earle have been dubbed the 'most attractive couple on the planet' after confirming their romance Jodie Foster's son Kit, 22, TOWERS over her as he helps the actress carry a basket full of household goods in New York City Anti-Israel protesters target Macy's AGAIN and target Black Friday shoppers after disrupting store's NYC Thanksgiving parade - on same day hostages are released amid temporary ceasefire The 10 best air fryer deals we've found at Amazon for Black Friday! Unmissable savings of up to 50% off Ninja, Tefal, Tower and more Met Police brace for another weekend of protests: Tens of thousands to join pro-Palestine rally and antisemitism march with more than 1,500 officers on the streets of London to protect memorials and stop violent clashes Karaoke boss tells National Trust to 'lighten up' after his firm was slammed for shooting a TikTok video on 'fragile' Cerne Abbas Giant Black Friday 2023 LIVE deals: The wait is over! The sale of the year is here with the BIGGEST discounts we've seen on big-name brands like Apple, Ninja and Shark Here are the BEST beauty deals Amazon is offering during its epic Black Friday sale, including stunning savings on ELEMIS, Sunday Riley, ghd and Olaplex Target under fire for 'sexualizing Christmas for children' with 'pride Santa' decorations New Jersey shopping mall next to MetLife Stadium is evacuated due to a bomb threat just hours before Jets play the Dolphins in the NFL's first-ever Black Friday game Gobble up these INCREDIBLE Apple deals quick! MacBooks, AirPods, Apple Watches, iPads, and more are at their lowest prices ever! Get tech for LESS! Apple, Beats, and Samsung have SLASHED Black Friday prices already, score deals starting at $20 here NOW The death of Black Friday mayhem: British high streets are eerily quiet as shoppers shun queuing from 4am and brawling over TVs for snapping up Xmas bargains online - with £3billion set to be splurged Get a head start on the Black Friday sale with these editor-favorite finds under $50 from Shark, Keurig, and KitchenAid Get up to 55% off bestselling bed-in-a-box mattresses in Simba's Black Friday sale - including the Hybrid Original mattress for £598 less Alix Earle introduces her family to Miami Dolphins boyfriend Braxton Berrios in New Jersey as the NFL's hottest couple spend their first Thanksgiving together Black Friday's HOTTEST fashion deals revealed! Levi's, Calvin Klein, UGGs and more are on sale at Amazon - and prices start from under $16 Dublin riots LIVE updates: Taoiseach Leo Varadkar slams 'cowardly champions of Ireland' who rioted after knife attack on children - as clean-up operation gets underway Jets legend Joe Namath is accused of allowing child sex abuse by well-known prep school coach to take place at his football camp A quarter of Americans still have holiday debt from 2022 - as experts warn shoppers that soaring interest rates mean it could take 40 MONTHS to pay off a $1,000 credit card bill Emily Ratajkowski takes her dog Colombo for a post-Thanksgiving walk in New York City... after posing several bikini snaps Black Friday vacuum steal: The bestselling Shark upright vacuum shoppers call 'BETTER than Dyson' is now on offer with 40% OFF The Princess of Wales, Kylie Jenner, Michelle Obama, and Meghan Markle ALL swear by this luxe fashion brand - and you can get 25% off EVERYTHING in the Black Friday sale Kylie Jenner looks busty in a tight white tank top to announce Kylie Cosmetics Black Friday sale as friend Paris Hilton hits the like button I'm A Celebrity 2023 LIVE RECAP: Most notable contestant moments from the series launch Kristin Cavallari shows off her toned frame in scintillating bra and shorts in new Black Friday videos for her clothing company Uncommon James Bruce Lehrmann denies sex on the sofa with Brittany Higgins, 'pashing' her in a nightclub or touching her leg - as he's grilled over allegedly 'demanding she skol drinks' Score HUGE savings on Apple devices this Black Friday! Shop AirPods for just £99 - plus offers on iPads, Apple Watches, accessories and more Man United news LIVE: Sir Jim Ratcliffe is facing huge call on Casemiro and Raphael Varane futures as Erik ten Hag prepares for trip to crisis-hit Everton Aspinal of London's AMAZING Black Friday sale just got even better - score a DOUBLE discount on Kate Middleton's favourite bag brand for a limited time only Black Friday 2023: Etiquette expert reveals the worst shopping behaviors - and shares her top tips for making the experience more peaceful Don't get stung on Black Friday! Experts reveal how to spot if an online sale is REALLY a good deal - as many products were LESS expensive earlier in the year Leaked document shows Manchester United's 2004 transfer targets including a Premier League legend who led their rivals to glory… but Sir Alex Ferguson's side were able to land three names on their shortlist Former Wimbledon finalist David Nalbandian 'is accused of filming his model ex-girlfriend when hidden camera was found in her bedroom' Man City-Liverpool pundit predictions: Jamie Carragher, Roy Keane, Chris Sutton and Ian Wright are split over this weekend's big Premier League showdown... so which side has more backing them? Inside Everton's new £550m stadium as Mail Sport's IAN HERBERT takes a tour of the steepest legally-permitted stands and incredible views, as fans vow to fight 'corrupt' Premier League points docking Erik ten Hag fell out with Cristiano Ronaldo, swapped David De Gea for Andre Onana and has ostracised Jadon Sancho, but amid Man United's ongoing struggles, is the Dutchman RECKLESS or RUTHLESS? Steven Gerrard changes his mind on the GOAT debate... picking Cristiano Ronaldo as the world's greatest player - a year after he named Lionel Messi as his No 1 Oscar Pistorius WINS his bid for freedom: Paralympian who shot dead Reeva Steenkamp ten years ago is set to be released from jail after Christmas and will undergo therapy for 'anger and gender-based violence' REVEALED: Germany's players have FOUR issues with Julian Nagelsmann, as problems mount for the under-fire boss - who has lost more than he's won - with Kai Havertz key to one irritant Darwin Nunez looked a misfiring hothead but doubling his English lessons, help from Jurgen Klopp's 'son' and Marcelo Bielsa's tips have helped close gap on Erling Haaland for 'Liverpool Reloaded' Last-minute Movember? Mason Mount sports a new-look moustache as he arrives at Man United's training ground ahead of Sunday's crunch clash with Everton EXCLUSIVE: ANGE POSTECOGLOU INTERVIEW on his Tottenham love affair, Rod Stewart asking for his wine back - and why he hates chit-chat: 'The scrutiny may be coming now... but perversely I love it' 'I want to encourage people in the township to have wild dreams': South Africa captain SIYA KOLISI opens up on suffering childhood hunger and violence in moving first interview since clinching World Cup glory No wonder Lewis Hamilton wanted out! Christian Horner sticks the boot into Mercedes with dig at Brit's two-year race win drought as row over his Red Bull talks continue in Abu Dhabi Bunker mentality will SAVE Everton! Sean Dyche returns from golf break ready to lead Toffees' fight against relegation after 10-point deduction... with 'driven' group ready to tackle it head on - starting against Man United Liverpool star Dominik Szoboszlai is left laughing at Pep Guardiola's attempts to pronounce his name as Reds fans slam the City boss on social media ahead of Saturday's box office clash Country icon Dolly Parton, 77, sends the crowd wild in Dallas as she wears Cowboys CHEERLEADING outfit to perform NFL Thanksgiving halftime show at Washington-Dallas game Is this how Taylor Swift and Travis Kelce's relationship ends? Fans reveal bizarre conspiracy theory involving his brother Jason after spotting sign of the couple's fate during Eagles' win over the Chiefs Fans brand Jack Harlow's 'low-budget' performance during Lions-Packers as worst halftime show EVER: 'That's ruined Thanksgiving' Sadio Mane is congratulated by Cristiano Ronaldo and his Al-Nassr team-mates after reaching 100 caps for Senegal NBA is investigating allegations that Oklahoma City Thunder's Josh Giddey had an inappropriate relationship with a minor after pictures of them - including one where she boasted about having sex with him - were posted on social media KFC responds to Travis Kelce after he revealed he is spending Thanksgiving ALONE - eating fried chicken - because girlfriend Taylor Swift is on tour No invite for Travis today! Patrick and Brittany Mahomes celebrate Thanksgiving at home as they eat dinner with his brother Jackson and their children after having Kelce over earlier this week Casemiro and Raphael Varane are facing Manchester United exit, with incoming owner Sir Jim Ratcliffe ready to make big calls over the struggling stars' futures Legendary Argentina World Cup winner, 35, confirms he will RETIRE from international football after the Copa America next summer Mario Balotelli escapes unharmed after 'major crash' in his £100,000 Audi Q8 in Brescia as former Man City star 'refuses breathalyser' Tony Romo is trolled on social media for his VERY enthusiastic on-air reaction to 77-year-old Dolly Parton's halftime Thanksgiving performance: 'She went with the cheerleading outfit... wow, pretty good' Has Dave Portnoy SPLIT with stunning girlfriend Silvana Mojica? Model hints at shock breakup with Barstool Sports founder in tearful TikTok post Innocent Aussie sporting great Ricky Ponting is caught up in social media storm over 'cricket mafia' slur against India after their ODI World Cup loss IAN LADYMAN: He was a fantastic footballer... but is Wayne Rooney a dud in the dugout? Swedish trail runner Emilia Brangefalt, 21, dies by suicide, days after posting 'maybe I won't be back' on Instagram after being diagnosed with 'extremely high heart rate' which stopped training Novak Djokovic yells 'shut up' at British fans and accuses them of disrespect in furious bust-up after world No 1 beats Cam Norrie to seal Serbia victory in Davis Cup tie Travis Kelce is spotted SINGING in his Rolls Royce as he drives around Kansas City alone on Thanksgiving... after joking he'd spend the day eating KFC as lover Taylor Swift tours in Brazil Joe Smith reveals his $61million NBA fortune was reduced to just $3,000 amid his battle with depression - as he opens up on 'hard times' weeks after going viral for his wife's OnlyFans reveal Why footy superstar Nathan Cleary's party-packed offseason holiday photo album has got his fans offside Hilarious footage of a fresh-faced Travis Kelce asking a Chiefs staffer to call mom Donna MID-GAME to order 'gnocchi noodles' with his mac and cheese resurfaces Pat Cummins has a heartwarming reunion with wife Becky and son Albie - and jokes about an embarrassing problem - as he returns home after World Cup triumph Harald Hasselbach dead at 56: Family announce sad passing of two-time Super Bowl champion on Thanksgiving after battle with rare type of cancer Lionel Messi: David Beckham reveals he arrived at Inter Miami training every day at 7am after signing the Argentina legend to watch him 'go about everything he does' 'Traumatised' team-mate of Adam Johnson quits Nottingham Panthers after sharing that he 'tried to suppress everything' after witnessing the player's fatal on-ice collision Controversial ex-WWE star goes for drastic new look after getting haircut - as former UFC fighter looks to reinvent himself before pro wrestling return Matildas star reveals why she wanted Nathan Cleary BARRED from meeting his girlfriend Mary Fowler Jason Kelce posts adorable clip of himself watching the premiere of his 'Philly Special' Christmas video with his daughters on Thanksgiving... and it features a brilliant cameo from Travis! Taylor Swift and Travis Kelce: Pop star's parents 'CANCEL plans to meet the tight end's family for first time at Eagles-Chiefs showdown' with the singer unable to attend due to rescheduled Eras Tour in Brazil Jason Kelce's wife Kylie shuts down suggestions she has bad blood with Taylor Swift as she sets the record straight on headline that claimed she is 'trying to avoid' pop star's spotlight Footy star who became the hero of one of the AFL's greatest grand final dies after helping revolutionise the game in retirement Adam Johnson's fiancee shares emotional tribute to the late hockey star on Thanksgiving after his on-ice death: 'Missing you so much every single day, love you' England's 2003 Rugby World Cup heroes reunite for the first time in two decades to celebrate the 20-year anniversary of their historic Jonny Wilkinson-inspired victory in Australia Jamie Carragher reveals his England star to play alongside Declan Rice and Jude Bellingham in 'exciting' midfield and take Gareth Southgate's side to Euro 2024 glory Jason Kelce admits his 'whirlwind' rise to stardom has made it 'harder to go out' but the Philadelphia Eagles center insists he's trying to 'stay grounded with it and be realistic' EXCLUSIVE: Tottenham legend Jermain Defoe takes part in coaching session at Arsenal's academy HQ and gives advice to young Gunners... as the former striker continues bid to become a coach What Gabriel Agbonlahor said about Man United legend Nemanja Vidic... as former Aston Villa forward names four other centre-backs who he believes were much better Ben Stokes sends message to Australia as England captain breaks his silence for the first time since Ashes rival Pat Cummins led his side to incredible Cricket World Cup victory REVEALED: How the Chiefs are trying to prolong Travis Kelce's NFL career after their star tight end dropped several hints he may end his career soon Black Friday New York Jets Miami Dolphins Share or comment on this article: Miami Dolphins 34-13 New York Jets - RECAP: Gang Green's struggles go from bad to worse under new quarterback Tim Boyle in NFL's first Black Friday game e-mail What a wonderful sport. Love watching all those B... by Philly_Hotspur 1 Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-24 23:25:57","image_url":"https://i.dailymail.co.uk/1s/2023/11/24/23/78215907-0-image-m-59_1700868262286.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5fd5f49d87bef0c8df8920609e99a23c","title":"Gina Rinehart offers radical plan to ‘save’ 2026 Commonwealth Games","link":"https://7news.com.au/sport/commonwealth-games/gina-rinehart-offers-radical-plan-to-save-2026-commonwealth-games-c-12676845","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"The mining magnate wants the Games staged in two different cities, 4000km apart.","content":"Gina Rinehart is spearheading a radical bid to save the 2026 The 2026 event, and the future of the Games more broadly, has been hanging by a thread since the The Labor government initially devised a plan to stage the Games across several towns in regional Victoria before ultimately admitting it was ill-advised to do so, citing the reported $4 billion price tag that came with it. No city - in Australia or elsewhere - has since put its hand up to take Victoria’s place, compounding the separate issue that Canadian city Alberta has already pulled its support for the 2030 event. The clock is now ticking as 2026 fast approaches, with a concrete solution yet to be found. But in a letter submitted to Prime Minister Anthony Albanese, which was signed by Gold Coast mayor Tom Tate and Perth Lord Mayor Basil Zempilas, Australia’s richest person, Gina Rinehart, has offered a left-field, multi-city idea that could resole the issue. Rinehart, with the support of Mayors Tate and Zempilas, wants to stage the Games at opposite ends of the country. “We believe that a coast-to-coast Games presents a special opportunity to showcase Australia and provides an excellent background for you to invite those heads of the Commonwealth you may wish to have further discussions with, and/or entertain,” the letter reads. “A background where Australia pulls well above its weight, and shines!” The two cities would make use of existing facilities to host the games, with Gold Coast having only recently had them in 2018, and Perth boasting its brand new, state-of-the-art Perth Stadium, which could be used as an athletics track. In theory, Gold Coast could host the first week before handing the keys over to Perth for the second. The three figures also took a swipe at the Victorian government, which pulled the Games while Daniel Andrews was still premier. “The Victorian government’s decision to cancel the 2026 Commonwealth Games was disappointing and a huge blow to Australia’s reputation and to our athletes,” it went on. “Australia is meant to be viewed as a successful G20 nation, and the fact that we can’t organise and fund a Commonwealth Games undermines that reputation. “We believe that saving the Commonwealth Games via a dual-city approach would be popular and in the national interest, and would not only bring huge benefits to our athletes and cities, but also excitement and lasting advantages to our nation. “As you know, the history of the Commonwealth Games — which is made up of over 70 nations and territories — is a source of immense pride for many around the world. And an important opportunity to invite Commonwealth heads to Australia.” Rinehart is a noted supporter of sports, having offered to before throwing her support behind the Australian Dolphins swimming team. She is also understood to be a keen fan of rowing, artistic swimming and volleyball. But Melbourne radio host Tom Elliott slammed the idea, saying it would be a practical impossibility. “You could not pick two cities in Australia that are further apart from each other — over 4000km,” Elliott said on his show on 3AW. “The Victorian Commonwealth Games, which were going to be in four or five regional parts of Victoria — that was never going to work because the events were too far away from each other. It was just never going to work and that’s why the government abandoned them, even though it was the government’s idea. “To have a Commonwealth Games split between the Gold Coast and Perth, I just think is utter madness. “The idea is that they do the first week of events on the Gold Coast and the second week in Perth. But think about it — unless every official and volunteer moves between the Gold Coast and Perth — and where would you put them all, they effectively have to recruit all the people again just to make the Games run. “You’ve got to build two athletes villages. It’s just such a dumb idea. “I think we need to accept, as sad as this is, that the era of the Commonwealth Games is over. Not that many people watch it, not that many countries compete in it, it doesn’t make any money — that’s the reason cities don’t want to host it.” Rinehart’s letter rejects the notion that it would be too hard. “We believe that saving the Commonwealth Games via a dual city approach would be popular and in the national interest, and would not only bring huge benefits to our athletes and cities, but also lasting advantages to our nation,” the letter goes on. “We believe it would be a far more popular decision than the recently announced $600 million for Papua New Guinea football, and not as expensive. “Perhaps some of that expenditure could be redirected to improve Australian facilities for the Commonwealth Games and later Olympic Games in Queensland?”","pubDate":"2023-11-24 23:05:24","image_url":"https://images.7news.com.au/publication/C-12676845/37fc09f492f45e4c2ac3fec52647fdf02cf61a1f-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2becf2097e42c0cbd489cf6e5d6911ae","title":"Harry Kane smashes two records in one night as Bayern Munich scoring spree continues","link":"https://www.dailystar.co.uk/sport/football/harry-kane-bayern-munich-record-31524508","keywords":["Sport"],"creator":null,"video_url":null,"description":"Harry Kane continues to obliterate records in Germany, taking his Bundesliga tally for the season to 18 in Bayern Munich's victory away to Cologne","content":"shattered two more records as his incredible scoring spree with continued. The England captain hit the only goal as the Bundesliga champions won at Cologne to go top of the table. Kane netted from close range in the 20th minute after Eric Maxim Choupo-Moting's shot was cleared off the line. His 18th goal of the season saw him break two records. First, he became the first player in Bundesliga history to score 18 goals in the first 12 matchdays of a season. Secondly, he is the first English player to score 18 goals in a Bundesliga campaign, a season which is just a third old. Jadon Sancho, for Borussia Dortmund in 2019/20, and Kevin Keegan, for Hamburg in 1978/79, both scored 17. Kane’s arrival has filled the void created by Robert Lewandowski’s departure in 2022. He has surpassed what the Polish goal machine did in his first season with Bayern, the 2014/15 campaign, which saw him hit 17 in 31 games. Kane has 22 in all competitions, making him the leading scorer in the top five leagues across Europe. Posting on X (formerly Twitter) after his latest goal, Kane said: “Great win away from home. Had good control throughout the whole game! Let’s keep it going.” The 30-year-old's goalscoring exploits are being lauded around Europe. One fan said: “Incredible achievement by Harry Kane! The record-breaking history he's making in the Bundesliga is truly remarkable.” The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Another declared: “At this point, I think we can all agree that is undoubtedly the best candidate for the next . What a player has got there.” Despite Kane’s goals, Bayern aren’t running away at the top of the table and Xabi Alonso’s Bayer Leverkusen will go back to the summit if they win at Werder Bremen on Saturday.","pubDate":"2023-11-24 23:03:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31524431.ece/ALTERNATES/s98/0_1-FC-Kln-v-FC-Bayern-Mnchen-Bundesliga.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f2532aa506d37d645e2a374b7a8a38c8","title":"Papers: Man Utd and Chelsea lead chase for Brazilian wonderkid Messinho","link":"https://www.skysports.com/football/news/20876/13015480/manchester-united-and-chelsea-lead-premier-league-chase-for-16-year-old-palmeiras-wonderkid-messinho-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"The top stories and transfer rumours from Saturday's newspapers...","content":"The top stories and transfer rumours from Saturday's newspapers... THE SUN Manchester United and Chelsea have joined what is turning into a Premier League bidding war for 16-year-old Brazil talent Messinho, who currently plays for Palmeiras. Mauricio Pochettino will fork out thousands of pounds by taking players and staff out for dinner following his three yellow cards for unruly behaviour this season. Former Liverpool star Jose Enrique feels only Manchester United deciding they are a long-term project will keep Erik ten Hag in his role by the time the 2023-24 season ends. Please use Chrome browser for a more accessible video player DAILY MAIL Barcelona will be looking to sign a midfielder in the January transfer window after confirmation that teenage star Gavi suffered a torn ACL while on international duty with Spain. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Pep Guardiola promised he will stay in charge of Manchester City even if they are relegated to League One if found guilty of breaching Premier League financial rules. Mason Mount is unlikely to be available for Manchester United first-team action until Christmas after suffering a calf injury. Tottenham boss Ange Postecoglou admits he has been \"frustrated\" at being dismissed in managerial circles just for his Australian background and wonders if the door might have been shut on managers from the country if he had struggled at Celtic. Jude Bellingham's rise to the top of football's megastars could next see him sign a multi-million pound endorsement with French fashion house Louis Vuitton. Eyebrows were raised within the Football Association when Barnsley did not even request a personal hearing over their ineligible player charge which saw them expelled from the FA Cup. DAILY TELEGRAPH Chelsea striker Nicolas Jackson has revealed his incredible journey to stardom at Stamford Bridge and says he was still playing football in bare feet in Senegal as recently as six years ago. Erik ten Hag's agent Kees Vos will be back in court in the Netherlands next month, facing one of his former clients Stefan de Vrij in an appeal against a £4m-plus payout he was ordered to make in damages over the SEG agency's handling of his free transfer move to Inter Milan in 2018. Surrey chairman Oli Slipper is keen to embrace The Hundred further but wants a rebrand of the Oval Invincibles, potentially just using their county name instead. DAILY STAR Tickets for England's high-profile friendly with Brazil were sold out before even reaching the stage where they would be made available to the general public. Real Madrid have already \"made contact\" with Roberto de Zerbi - according to a report in Spain - as they seek to get a replacement for Carlo Ancelotti in place by the time his current deal expires next summer. DAILY MIRROR Premier League stars have been complaining to the PFA that a sharp rise in injuries, in particular muscular strains and pulls, are being caused by the time it takes to make VAR decisions. THE TIMES Newcastle United want Manchester City midfielder Kalvin Phillips and PSG striker Hugo Ekitike in January but any deals will have to be done in the loan market because of FFP rules. Novak Djokovic has slammed anti-doping officials for the \"shameful\" decision to notify him he had been selected for testing 90 minutes before his Davis Cup clash with Cameron Norrie. David Gower would be open to becoming the next chairman of the MCC after emerging as a possible contender. DAILY RECORD Celtic are set to make a renewed effort to sign Brondby striker Mathias Kvistgaarden in January. Barry Ferguson believes his nephew Lewis could be on the move to a \"massive\" club as early as January amid reported interest from Juventus in the Bologna captain. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-24 23:00:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"81306f8647f40bad73f9b24fd264dcd7","title":"Cristiano Ronaldo scores 'goal of the season' sending football to the moon and back","link":"https://www.dailystar.co.uk/sport/football/cristiano-ronaldo-al-nassr-goal-31524184","keywords":["Sport"],"creator":null,"video_url":null,"description":"Cristiano Ronaldo continues to make headlines in Saudi Arabia after his second goal in Al-Nassr's 3-0 victory was a beautiful lobbed effort from almost 30 yards out","content":"scored a dazzling lobbed shot for Al-Nassr with fans already hailing it as the 'goal of the season'. The five-time Ballon d'Or winner was amongst the goals once again for the club as he scored a brace as they cruised to a 3-0 win at home against Al-Akhdoud. Ronaldo's return to the side following international duty with Portugal was a fruitful one as he now has 15 league goals this season. Fans had to wait until the 77th minute to see the 38-year-old get on the scoresheet and he did so in supreme fashion after controlling the ball before taking a touch and finishing home from a tight angle to make it 2-0 after Sami Al Naji's opener in the first half. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . In true Ronaldo fashion, he outdid himself with his second goal of the game after Al-Akhdoud goalkeeper Paulo Vitor found himself in no-man's land by making a save in his own half. The ball bounced to Ronaldo who controlled the ball with his chest and lobbed the keeper from almost 30 yards out, with the ball going outrageously high in the air in the process. Delighted with his effort after the ball practically went to the moon and back, the legend ran off celebrating the strike with his team-mates as it capped off an impressive night for Ronaldo who's now scored 24 goals in all competitions for Al-Nassr. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Fans on social media took their time to praise the stunning strike as one X user wrote: \"Goal of the season for sure\", while another was impressed with Ronaldo's performances despite his advancing age as they commented: \"This guy is getting better and better each day bro\". A third even went as far to say: \"Give this man a Ballon d'Or\", as Ronaldo's side are now just one point behind leaders Al-Hilal who have a game in hand. His 15 league goals are five more than the second highest scorer in the Saudi Pro League which is former Fulham striker Aleksander Mitrovic who plays for the league leaders. Ronaldo is also one of eight Saudi League players to score a hat-trick this season, alongside ex- team-mate Karim Benzema and legend Roberto Firmino.","pubDate":"2023-11-24 22:49:56","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31524291.ece/ALTERNATES/s98/2_RONALDO-GOAL.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2c5e92f6856df9e1a9e1b7fb645245d2","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.northwalespioneer.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.northwalespioneer.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"db786f4b19c57a1a9483de11ba60f810","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.southwalesguardian.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.southwalesguardian.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"9dc02e5f538c62baf84b5f3962bf13de","title":"Ange Postecoglou too busy with football matters to worry about agent-rules probe","link":"https://www.northwaleschronicle.co.uk/sport/national/23947442.ange-postecoglou-busy-football-matters-worry-agent-rules-probe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defoe’s transfer from Tottenham to Portsmouth in 2008 is being investigated by the Football Association.","content":"Ange Postecoglou insists he has too much on his plate to worry about an investigation by the Football Association into a potential breach of agent rules during a 2008 transfer which involves Tottenham. The Times reported this week that an unlicensed agent may have been used during the negotiations of Jermain Defoe’s transfer from Spurs to Portsmouth in the winter transfer window of 2008. The FA has confirmed to the PA news agency that they are looking at the case, which did go to an arbitration hearing at the time of Defoe’s move to Fratton Park in the 2007-08 campaign. PA has contacted Tottenham for comment. No action was taken against any party involved in the transfer, but with Spurs dealing with a growing injury list ahead of Sunday’s visit of Aston Villa in the Premier League, any potential punishment is far from Postecoglou’s mind. “In 2008? I think I was maybe coaching Brisbane Roar mate, so fair to say I wasn’t around then,” he said. “And really, if you think that’s coming across my desk? People are keeping a fair bit away from me at the moment because of what’s really important and that is we’ve got a big game on Sunday. “With the issues we’ve got around the team, that’s where my focus is. “It’s not across my desk, mate. For me to give you an answer would mean me sitting down with whoever is doing the investigation, whoever has all the information here, you know how many hours? “I don’t know if you’ve spent any hours doing that but I don’t have that time in my day to be assessing those kinds of issues. “With those kinds of things, any of those issues, there are those responsible, maybe I’m the spokesman, but I’m the spokesman for the football club in terms of the football. “I would hate it absolutely if you got a lawyer out here and he started talking about what sort of formation we should play at the weekend. “I’ll keep my mouth shut with those things, not for any other reason, but I respect the space that other people are in and that I’m in. “If you’ve got real questions about that, there are probably better people to ask than me.” Meanwhile, an FA spokesperson told PA: “We are looking at the case, and as part of that we will be reviewing the arbitration panel award.”","pubDate":"2023-11-24 22:42:08","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17482674/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"}]}