{"newsArray":[{"title":"Haalandova agentica otvorila karte: ‘Taj klub bi za njega bio zemlja snova. Ima posebnu magiju‘","link":"https://sportske.jutarnji.hr/sn/nogomet/nogomet-medjunarodni/haalandova-agentica-otvorila-karte-taj-klub-bi-za-njega-bio-zemlja-snova-ima-posebnu-magiju-15311633","keywords":["Međunarodni nogomet"],"creator":null,"video_url":null,"description":"Rafaela Pimenta, agentica Erlinga Haalanda, potvrdila je da već naveliko planiraju odlazak norveškog centarfora iz Manchester Cityja, otvorivši vrata transferu \"iz snova\" u Real Madrid. Norvežanin je prošlog ljeta prešao na Etihad u ugovoru vrijednom 60 milijuna eura i uživa u izvrsnoj prvoj sezoni...","content":"Rafaela Pimenta, agentica Erlinga Haalanda, potvrdila je da već naveliko planiraju odlazak norveškog centarfora iz Manchester Cityja, otvorivši vrata transferu \"iz snova\" u Real Madrid. Norvežanin je prošlog ljeta prešao na Etihad u ugovoru vrijednom 60 milijuna eura i uživa u izvrsnoj prvoj sezoni u aktualnom prvaku Premier lige. Haaland je zabio 33 gola u 33 utakmice, od kojih 27 u Premier ligi, što je najveći broj pogodaka igrača Cityja u jednoj sezoni Premier lige ikada. Međutim, dok 22-godišnjak nastavlja rušiti rekorde, njegov je sljedeći potez izgleda već isplaniran, a agentica Pimenta potvrdila je da bi za Haalanda bio san da potpiše za Real Madrid. Govoreći na FT Business of Football summitu u Londonu, rekla je: - Postoji Premier liga. A tu je i Real Madrid. Real Madrid ima nešto svoje što ga čini \"zemljom snova\" za igrače. Madrid održava tu magiju. Ne natječe se u ligi kao što je Premiership, ali zato ima Ligu prvaka. Brazilska odvjetnica koja je preuzela brigu o Haalandu nakon smrti Mina Raiole prošle godine, istaknula je da \"voli planirati karijere igrača\". Potvrdila je da je Haaland želio prijeći u City i raditi s Pepom Guardiolom , te da je Premier liga sada \"atrakcija sama za sebe\", neovisno o klubovima koji se u njoj natječu. - Pokušavamo napraviti plan. Moramo imati cilj. Možda to nećemo postići, ali ako ne znamo kamo idemo, sigurno tamo nećemo stići. Kad imamo igrača, radimo planove. Čak i ako igrač ima samo 15 godina. Kad sam se počela baviti ovim poslom, ako bih igraču rekla ‘dovest ću te u Englesku‘, prva stvar koju bi on rekao bila bi: ‘Što sam krivo napravio? Zašto ti se ne sviđam?‘ Ali sad, kad pitam igrača ‘koji je tvoj cilj?‘, reći će Premier liga. Ne kažu City, Chelsea ili Arsenal nego Premier liga. Ovo je prvi put u 25 godina da čujem da toliko igrača kaže da žele ići u ligu. Engleska je pravo mjesto za agenta. Agent mora biti tamo gdje igrač želi biti. To je fantastična liga. Tako je natjecateljska, svaka utakmica je izazov, svi je žele gledati. Iako je Haaland u Cityju tek od prošlog ljeta, Guardiola je već bio prisiljen demantirati da njegov napadač ima \"klauzulu Real Madrida\" u ugovoru, prema kojoj bi se mogao pridružiti španjolskom divu 2024. godine. Erlingov otac i bivši veznjak Man Cityja Alf-Inge Haaland ranije je također tvrdio da će njegov sin vjerojatno ostati u Engleskoj samo dvije ili tri godine, prije nego što se odluči igrati u drugoj europskoj ligi. Kako god, Haaland očito opasno razmišlja o Real Madridu.","pubDate":"2023-03-03 06:34:23","image_url":"https://static.jutarnji.hr/images/slike/2023/03/03/28103591.jpg","source_id":"jutarnji","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"All Whites: ‘Number of candidates’ in mix as New Zealand Football’s coaching search drags on","link":"https://www.nzherald.co.nz/sport/all-whites-number-of-candidates-in-mix-as-new-zealand-footballs-coaching-search-drags-on/22LHZUNKDBCDZBIXBRDHWBDNKM/","keywords":null,"creator":null,"video_url":null,"description":"NZF boss: It would be ideal if the new person was in place for June, but not imperative.","content":"New Zealand Football would prefer to have a permanent All Whites head coach in place for the June international window – but are keeping an open mind on the timeframe. On Friday NZF announced a glamour match against Sweden in Stockholm on June 16, a rare match against a high-profile Uefa team for the All Whites. But it is still uncertain who will be in charge for that phase, which will feature a second game in Europe. Darren Bazeley has the role on an interim basis for the two home games against China later this month, before NZF will reconvene to discuss their options. NZF chief executive Andrew Pragnell told the Herald they won’t be going back to market, or re-advertising the role, after the extensive pre-Christmas search process to find a successor to Danny Hay. He maintained there are “a number of candidates” in contention and added that CV’s are still coming in, which continues to “put options on the table”. Pragnell declined to go into detail on who could still be in the mix. John Herdman has publicly signalled his intention to remain with Canada, while Des Buckingham has signed a new club deal in India. Wellington Phoenix coach Ufuk Talay indicated he wasn’t interested, after being overlooked initially, in favour of NZF’s preferred candidate (Herdman), which never came to pass. Advertisement Advertise with NZME. ”We need to check [post-March] who is in front of us and weigh up our best options going forward,” said Pragnell. He agreed it would be ideal if the new man was in place for June but said it wasn’t imperative. ”I’d be disappointed if this was drifting into the end of 2023 but the decision on who is more important than the timeframe,” said Pragnell. “Having said that, sooner rather than later is preferable.” Pragnell confirmed that Bazeley is “totally in the mix” for the full-time position. ”It’s a great chance for Darren, who has been in our national team set-ups for a long time, to put his mark on the team,” said Pragnell. “We will be looking at the feedback that comes out of that window, what the environment has been like, how we have gone.” The interview panel, comprised of Pragnell, high performance boss Keir Hansen, board member Jacqui Barron, a PFA representative and two senior players, will have discussions in early April. The Swedish encounter is a coup for NZF. The All Whites haven’t faced European opposition since November 2019, when they played Ireland and Lithuania in the first matches under Hay. Advertisement Advertise with NZME. Before that, New Zealand had only experienced four games against Uefa nations in the previous nine years, when they faced Northern Ireland and Belarus in the lead-up to the 2017 Fifa Confederations Cup, then Russia and Portugal at the main event. World No 23 Sweden missed qualification for the 2022 World Cup, finishing second in their group to Spain, then losing a playoff semifinal to Poland. But they reached the second round of the last European Championships - beaten in extra time by Ukraine - and the quarter-finals of the 2018 World Cup. In that tournament they topped the ‘group of death’ - ahead of Mexico, South Korea and Germany - then beat Switzerland in the round of 16, before falling to England in the last eight. ”We have been chasing top-50 nations and looking to play in Europe more often,” said Pragnell. It has been speculated that Jordan could be the second June opponent – with their national association announcing a match on June 20 – but Pragnell said that was premature. ”We are weighing up a couple of options and they may be in the mix,” said Pragnell. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-03-03 05:30:00","image_url":"https://www.nzherald.co.nz/resizer/36L2RzUaiCFtO_9KOB2YO8dH13A=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/IXSN2E65W4RKF46NXJ25JWVAJU.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Man Utd face Liverpool test, Arsenal back in the groove","link":"https://www.capitalfm.co.ke/sports/2023/03/03/man-utd-face-liverpool-test-arsenal-back-in-the-groove/","keywords":["English Premiership","Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"MANCHESTER, United Kingdom, Mar 3 – Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side […] The post Man Utd face Liverpool test, Arsenal back in the groove appeared first on Capital Sports.","content":"The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment of their League Cup final defeat behind them. Tottenham must bounce back quickly from an FA Cup exit to maintain their advantage over Newcastle and Liverpool in the race for a top-four finish. AFP Sport looks at some of the key talking points ahead of the weekend’s action in the English top flight. Liverpool won both Premier League fixtures against fierce rivals United last season by an aggregate score of 9-0. However, the fortunes of both clubs have dramatically changed over the past 12 months. Fresh from lifting the League Cup to end a six-year wait for silverware, United’s run of one defeat in 22 games has kept them in the hunt for a quadruple of trophies. But with an 11-point gap to leaders Arsenal, anything less than a first win at Anfield since 2016 for Erik ten Hag’s men could signal the end of their title challenge. Liverpool, who lost against United at Old Trafford earlier this season, are in need of the points in their push to finish in the top four. Jurgen Klopp’s men have crept back into contention for a Champions League place thanks to a run of 10 points from their past four league games. But in the middle of that run, the Reds’ deficiencies were brutally exposed in a 5-2 home defeat to Real Madrid in the Champions League. “I think Man United is the team in form in the moment, maybe together with Arsenal and City,” said Klopp after a 2-0 win over Wolves on Wednesday. “If you face United at the weekend whichever result you’ve had before, either way you have to strike back or whatever, but now we have to use it for our general situation. “We have to build on the performance and on the result and we try everything to do exactly that.” Arsenal’s bid for a first league title in 19 years looked to be on shaky ground last month when they took just one point from three games, including a 3-1 home defeat to City. But Mikel Arteta’s side have responded in style with three straight wins to carve out a five-point lead at the top of the table. “When you look at them every single day, you just feel how much they want it, how much they really want to produce what we ask them to do and how much they want to please our people,” said Arteta after Everton were dispatched 4-0 on Wednesday. “I had no doubts that we were going to turn things around in performances and results.” More of the same will be expected from Arsenal against a relegation-threatened Bournemouth side. City face a tougher test on paper with the visit of Newcastle, but there is little for the champions to fear in the Magpies’ form of late. Newcastle have slipped outside the top four after winning just once in the Premier League in 2023 so far. A big week for Tottenham got off to the worst possible start with defeat in their FA fifth-round match against Championship side Sheffield United. Spurs, who have not won a trophy since 2008, have to overturn a 1-0 first-leg deficit when they host AC Milan in the Champions League last 16 next week. But first they have a tricky trip to Molineux to face a Wolves team also desperate for the points to pull away from the relegation zone. “Now, the FA Cup has gone. We have other chances, other competitions, other games,” said Spurs assistant boss Cristian Stellini, who has deputised for Antonio Conte while he recovers from gallbladder surgery. “This is football. You have to keep going and find again the same desire.” Manchester City v Newcastle (3:30pm), Arsenal v Bournemouth, Aston Villa v Crystal Palace, Brighton v West Ham, Chelsea v Leeds, Wolves v Tottenham (all 6pm), Southampton v Leicester (8:30pm) Nottingham Forest v Everton (1400), Liverpool v Manchester United (1630) Brentford v Fulham (2000)","pubDate":"2023-03-03 04:11:46","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Man Utd face Liverpool test, Arsenal back in the groove","link":"https://punchng.com/man-utd-face-liverpool-test-arsenal-back-in-the-groove/","keywords":["Sports"],"creator":["Agency Report"],"video_url":null,"description":"Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment Read More","content":"Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment of their League Cup final defeat behind them. Tottenham must bounce back quickly from an FA Cup exit to maintain their advantage over Newcastle and Liverpool in the race for a top-four finish. AFP Sport looks at some of the key talking points ahead of the weekend’s action in the English top flight. – United’s revenge mission – Liverpool won both Premier League fixtures against fierce rivals United last season by an aggregate score of 9-0. However, the fortunes of both clubs have dramatically changed over the past 12 months. Fresh from lifting the League Cup to end a six-year wait for silverware, United’s run of one defeat in 22 games has kept them in the hunt for a quadruple of trophies. But with an 11-point gap to leaders Arsenal, anything less than a first win at Anfield since 2016 for Erik ten Hag’s men could signal the end of their title challenge. Liverpool, who lost against United at Old Trafford earlier this season, are in need of the points in their push to finish in the top four. Jurgen Klopp’s men have crept back into contention for a Champions League place thanks to a run of 10 points from their past four league games. But in the middle of that run, the Reds’ deficiencies were brutally exposed in a 5-2 home defeat to Real Madrid in the Champions League. “I think Man United is the team in form in the moment, maybe together with Arsenal and City,” said Klopp after a 2-0 win over Wolves on Wednesday. “If you face United at the weekend whichever result you’ve had before, either way you have to strike back or whatever, but now we have to use it for our general situation. “We have to build on the performance and on the result and we try everything to do exactly that.” – In-form Arsenal – Arsenal’s bid for a first league title in 19 years looked to be on shaky ground last month when they took just one point from three games, including a 3-1 home defeat to City. But Mikel Arteta’s side have responded in style with three straight wins to carve out a five-point lead at the top of the table. “When you look at them every single day, you just feel how much they want it, how much they really want to produce what we ask them to do and how much they want to please our people,” said Arteta after Everton were dispatched 4-0 on Wednesday. “I had no doubts that we were going to turn things around in performances and results.” Related News Casemiro lists five high quality players in Man Utd Balogun won’t play second fiddle at Arsenal Martinelli stars as leaders Arsenal crush Everton More of the same will be expected from Arsenal against a relegation-threatened Bournemouth side. City face a tougher test on paper with the visit of Newcastle, but there is little for the champions to fear in the Magpies’ form of late. Newcastle have slipped outside the top four after winning just once in the Premier League in 2023 so far. – Sorry start to Spurs’ big week – A big week for Tottenham got off to the worst possible start with defeat in their FA fifth-round match against Championship side Sheffield United. Spurs, who have not won a trophy since 2008, have to overturn a 1-0 first-leg deficit when they host AC Milan in the Champions League last 16 next week. But first they have a tricky trip to Molineux to face a Wolves team also desperate for the points to pull away from the relegation zone. “Now, the FA Cup has gone. We have other chances, other competitions, other games,” said Spurs assistant boss Cristian Stellini, who has deputised for Antonio Conte while he recovers from gallbladder surgery. “This is football. You have to keep going and find again the same desire.” Fixtures (all times GMT) Saturday Manchester City v Newcastle (1230), Arsenal v Bournemouth, Aston Villa v Crystal Palace, Brighton v West Ham, Chelsea v Leeds, Wolves v Tottenham (all 1500), Southampton v Leicester (1730) Sunday Nottingham Forest v Everton (1400), Liverpool v Manchester United (1630) Monday Brentford v Fulham (2000) AFP","pubDate":"2023-03-03 03:38:33","image_url":"https://cdn.punchng.com/wp-content/uploads/2021/09/10210647/Manchester-United.jpg","source_id":"punchng","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Napoli ‘to keep hands on wheel’ as Pogba return boosts Juve","link":"https://www.capitalfm.co.ke/sports/2023/03/03/napoli-to-keep-hands-on-wheel-as-pogba-return-boosts-juve/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"MILAN, Italy, Mar 3 – Napoli coach Luciano Spalletti says his players are drowning out what he sees as premature title chatter despite knowing victory over Lazio on Friday would send them 21 points clear in Serie A. The league leaders have won eight games in a row and 19 of their past 20 in […] The post Napoli ‘to keep hands on wheel’ as Pogba return boosts Juve appeared first on Capital Sports.","content":"The league leaders have won eight games in a row and 19 of their past 20 in the top flight — a run that began with a 2-1 victory away to Lazio on September 3. “We’re not listening to those who want us to take our hands off the wheel and start celebrating, because there are still twists and turns to come,” said Spalletti. “Our fans must take to the field with us and not wait for us at the finish line.” Napoli are closing in on a first Serie A crown since the days of Diego Maradona, who inspired the club to their only two league titles in 1987 and 1990. They have dropped just seven points over 24 games this season and midfielder Eljif Elmas insisted Napoli have no intention of slowing down. “Eighteen points is a big margin but honestly we’re not looking at the table because we want to try to win every game we have left,” Elmas told Radio Kiss Kiss. “We’re playing good football and our aim is to maintain this pace and keep doing what we’re doing because we deserve to be where we are. “We’re not getting carried away and we’re not going to ease up at all.” Lazio are back in the Champions League places following wins over Salernitana and Sampdoria but city rivals Roma, in fifth, will be eager to atone for their shock midweek loss to Cremonese. Roma will be without Jose Mourinho for Saturday’s visit of Juventus after the Portuguese coach was hit with a two-match ban after receiving his third red card of the season against Cremonese. “I’m emotional but not crazy,” said Mourinho. The league said after the match he also “entered the referees’ dressing room without permission and made seriously offensive statements”. “For the first time in my career a referee has spoken to me in an unjustifiable way,” added Mourinho. “To react like that, something must have happened. We need to see if we can do anything from a disciplinary perspective.” AC Milan have recovered from a dreadful start to 2023 by winning their past four games in all competitions without conceding. Stefano Pioli’s side face Fiorentina on Saturday ahead of next week’s second leg against Tottenham in the last 16 of the Champions League, while Inter Milan host Lecce on Sunday. The France midfielder made his first competitive appearance since April as Juventus defeated Torino 4-2 in the Turin derby on Tuesday. Pogba injured his right knee injury during pre-season in July shortly after his return to Juve following six years at Manchester United. The 29-year-old won four Serie A titles in as many seasons during his first spell in Italy, and Juve hope his recovery can help the club make an improbable push for a top-four place following a 15-point deduction for illicit transfer activity. 8 – successive league games in which Victor Osimhen has scored for Napoli. The Nigerian is Serie A’s top scorer this season with 19 goals — six more than nearest rival Lautaro Martinez. 30 – Cremonese’s 2-1 victory over Roma snapped the joint-longest run without a win for a club in Italian top-flight history. Ancona also went 30 Serie A games without winning between 1993 and 2004. Napoli v Lazio (10:45pm) Monza v Empoli (5pm), Atalanta v Udinese (8pm), Fiorentina v AC Milan (10:45pm) Spezia v Hellas Verona (2:30pm), Sampdoria v Salernitana (5pm), Inter Milan v Lecce (8pm), Roma v Juventus (10:45pm) Sassuolo v Cremonese (8:30pm), Torino v Bologna (10:45pm)","pubDate":"2023-03-03 03:38:22","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Gunmen Attack Rosario Supermarket Owned by Lionel Messi's Wife's Family, Leave Threat Note","link":"https://www.news18.com/news/football/gunmen-attack-rosario-supermarket-owned-by-lionel-messis-wifes-family-leave-threat-note-7206793.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country's third-largest city of Rosario, owned by the family of his wife, Antonella Roccuzzo","content":"A supermarket in the Argentine city of Rosario, owned by Lionel Messi’s wife, Antonella Roccuzo’s family, was attacked in the early hours of Friday by two gunmen on a motorcycle. The attackers left a note on cardboard following the open fire that threatened the Argentine icon. It is reported that the dissidents shot at least a dozen rounds of ammunition. The city’s mayor, Pablo Javkin, went to the supermarket and lashed out at federal authorities over what he called their failure to curb a surge in drug-related violence in Rosario, located about 190 miles (300 kilometers) northwest of the capital of Buenos Aires. The message read “Messi, we’re waiting for you. Javkin is also a drug trafficker, so he won’t take care of you.” Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country’s third-largest city of Rosario, owned by the family of his wife. ALSO READ| Copa Del Rey: Barcelona Dig Out First Leg El Clasico Win Over Real Madrid Messi has not commented. Considered by many to be the greatest football player of all time, Messi is revered in Argentina, especially since he led the national team to the country’s first World Cup victory in 36 years in Qatar in December. Messi currently plays for Paris Saint-Germain and spends much of his time overseas, though he often visits Rosario where he has a home in the suburb of Funes. The French team posted a photo on social media of Messi training on Thursday morning. In Rosario, prosecutor Federico Rébola said authorities were reviewing security camera footage and that the investigation was “preliminary.” It was the first time Messi’s in-laws had received this kind of threat, he added. Celia Arena, justice minister for Santa Fe province, where Rosario is located, said the attack amounted to “terrorism” by a “mafia\" group meant to intimidate the broader population. “The aim is to deliberately cause terror in the population and discourage those of us who are fighting against criminal violence, knowing that it will be an event of global significance,” Arena wrote in a social media post. Javkin, a center-left politician in opposition to the ruling Peronist coalition, appeared to throw suspicion of complicity for the attack on both criminal gangs and federal security officials. “I doubt everyone, even those who are supposed to protect us,” Javkin said in an interview with a local radio station. He said that he had recently had “very strong discussions” with members of the federal security forces over the past couple of weeks demanding that they crack down on the city’s crime. “Where are the ones who need to take care of us?” Javkin said. “It’s clear that those who have the weapons and have the possibility of investigating the criminals aren’t doing it, and it’s very easy for any gang to carry out something like this.” The federal government’s Security Minister Aníbal Fernández said drug-related violence was not a recent phenomenon in the city, and that Thursday’s attack was typical of what has happened there “for the last 20 years.” He said the incident was an example of how drug traffickers “have won” in Rosario, but now “we have to reverse that.\" Opposition politicians blamed President Alberto Fernández’s administration for the continuing violence in Rosario. His predecessor, Mauricio Macri, characterized the events as a warning that the country cannot “co-exist” with drug traffickers. Messi, 35, is currently renegotiating a contract with Paris Saint-Germain that ends this year amid speculation that the soccer superstar could decide to end his career playing for one of the local Rosario clubs, Newell’s. Messi, who this week won FIFA’s best men’s player award, could travel to Argentina later this month to join the national squad in playing two friendly matches. One takes place March 23 against Panama in Buenos Aires, while the other one will be five days later against Curacao in the northern city of Santiago del Estero. With Inputs From AP Read all the Latest Sports News here","pubDate":"2023-03-03 02:55:03","image_url":"https://images.news18.com/ibnlive/uploads/2023/02/copy-of-sports-2023-02-19t202656.703-16768186543x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"Shots fired at Messi family store, threatening message left for star","link":"https://www.capitalfm.co.ke/sports/2023/03/03/shots-fired-at-messi-family-store-threatening-message-left-for-star/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"ROSARIO, Argentina, Mar 3 – In the dead of night, two men fired shots at a closed supermarket belonging to the family of Lionel Messi’s wife, before leaving a threatening message on the ground aimed at the seven-time Ballon d’Or winner. “Messi, we’re waiting for you. Javkin is a narco, he won’t take care of […] The post Shots fired at Messi family store, threatening message left for star appeared first on Capital Sports.","content":"“Messi, we’re waiting for you. Javkin is a narco, he won’t take care of you,” said the handwritten message left on the ground by the men who shot 14 bullets into the supermarket’s metallic facade in the early hours of Thursday. Pablo Javkin is the mayor of Messi’s hometown, Rosario, where the supermarket is located, some 320 kilometers northwest of Buenos Aires. Javkin confirmed the supermarket belonged to the family of Antonela Roccuzzo, who shares three children with the football superstar, and said the aim of the attack was to “to create chaos in the city.” “Here, what’s sought is the repercussion, it’s perfidious,” he said. “What story goes more quickly viral in the world than an attack on Messi?” A witness confirmed seeing the two men arrive on a motorbike just before 3:00. One of them got off, fired the shots, dropped the note and they both fled. “This has been going on for some time,” said Javkin. “We have five security forces operating in Rosario yet they can do this because no one is chasing them.” Provincial police assistant chief Ivan Gonzalez told Cadena 3 television station that the message was “not a threat” but rather an attempt to “attract attention.” He said no one was hurt since there was no one on the premises at that hour. The prosecutor in charge of the case, Federico Rebola, told reporters that there had been no previously known threats made against the Roccuzzo family. “We’re concerned, this has a huge repercussion, we have the video images and we’re looking for more cameras,” he said. Rosario is a port city on the Parana river that has gradually become a nerve center for drug trafficking and the most violent city in Argentina, with 287 murders in 2022. The centrist mayor, left-wing governor of Santa Fe state, Omar Perotti, and center-left national government regularly pass on responsibility for counter-narcotics measures and the use of the city’s security forces to each other. At a meeting this week between the municipal, provincial and national security forces, provincial minister Claudio Brilloni said he had “urged the federal forces to greater collaboration, engagement and participation” in the fight against violence and criminality in Rosario. Among the right-wing opposition, two declared candidates for October’s presidential election called for help from the military police to fight drug-trafficking in Rosario. “The situation is complicated in Rosario… the drug traffickers have won,” said Security Minister Anibal Fernandez.","pubDate":"2023-03-03 01:54:05","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Copa Del Rey: Barcelona Dig Out First Leg El Clasico Win Over Real Madrid","link":"https://www.news18.com/news/football/copa-del-rey-barcelona-dig-out-first-leg-el-clasico-win-over-real-madrid-7206547.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Madrid defender Eder Militao deflected a rebound into his own goal after 26 minutes to split the teams and hand Barcelona the edge ahead of the second leg on April 5 at Camp Nou","content":"Eder Militao’s own goal handed a depleted Barcelona a surprise 1-0 away victory over Real Madrid in a stormy Copa del Rey semi-final first leg on Thursday. The Catalans arrived on the back of two consecutive defeats and without an injured trio of key players — top scorer Robert Lewandowski, key midfielder Pedri and explosive winger Ousmane Dembele. ALSO READ| Watch: Martin Odegaard’s Creamy Interception Against Alex Iwobi During Everton Game After their Europa League elimination by Manchester United last week and a first ever loss against La Liga minnows Almeria, Madrid fans smelled blood, but left bitterly frustrated. Militao deflected a rebound into his own goal after 26 minutes to split the teams and hand Barcelona the edge ahead of the second leg on April 5 at Camp Nou. The hosts had more of the ball but failed to muster a shot on target, while Barcelona defended well. “This was the game we wanted to play — not with this result, but it gives us confidence for the second leg,\" Madrid coach Carlo Ancelotti told reporters. “We did not let Barcelona do what they wanted, that’s good for us, and we just have to repeat it (at Camp Nou).\" Asked if Barcelona deserved to win or not, Ancelotti said it was clear his team deserved more. “No, that is obvious, we had chances, but I think that it was one of Madrid’s best games in terms of pressing high,\" added Ancelotti. “It was a bit strange, their way of playing, but they have learned very well, it’s a very solid team defensively.\" Barcelona lined up with Marcos Alonso out of position at centre-back, after Andreas Christensen was only deemed fit enough to start on the bench. Sergio Busquets made his 46th Clasico appearance, overtaking former Real Madrid and Barcelona greats Sergio Ramos and Lionel Messi to set a new record. Despite Barcelona’s seven-point lead over champions Madrid in La Liga, many, including Barca coach Xavi Hernandez, had Madrid as favourites. Los Blancos have not won the trophy since 2014 and pushed Barca back early on, with Benzema scoring a goal ruled out for offside. A handful of Madrid fans had protested outside the Santiago Bernabeu about Barca’s involvement in the “Negreira case\" — the Catalan club paying a former refereeing chief for advice until 2018. The temperature rose considerably when Vinicius Junior was booked midway through the first half for wrestling Frenkie de Jong to the ground. Vinicius remonstrated vociferously with the referee, and Madrid may still have been distracted by the argument moments later when Barcelona took the lead. The goal came against the run of play, created by Ferran Torres, who slipped through Franck Kessie, just onside. Thibaut Courtois saved the Ivorian midfielder’s low shot but the ball rebounded off Militao, into his own net, with Nacho trying and failing to hack it clear. Madrid players and supporters reacted angrily as Barcelona midfielder Gavi got away with smashing into Militao, but the hosts struggled to carve out chances. Barcelona held their lead until the break comfortably, with supporters whistling the officials as they walked towards the tunnel. With Carlo Ancelotti’s side unable to muster a shot on target against an underwhelming Barcelona side, perhaps some of the home supporters’ frustration aimed at the referee was misplaced. Madrid struggled to connect with Benzema, isolated and unable to influence the game. Record Copa winners Barcelona should have doubled their lead with 20 minutes remaining when Torres cut the ball back to Kessie, but his goal-bound shot was blocked by his own team-mate, Ansu Fati. Rodrygo whipped a shot wide for Madrid in the final stages as they remained unable to test Ter Stegen, despite Barcelona’s deficiencies. More traditional roles were reversed as Madrid had more of the ball but Barcelona defended solidly and took the advantage back home. “Today they dominated us with the ball, but there are other aspects in the game, sometimes the opponent forces you to this,\" admitted Xavi. “Madrid can dominate you, it’s hard to get the ball off (Toni) Kroos and (Luka) Modric, but defence is part of the game.\" Read all the Latest Sports News here","pubDate":"2023-03-03 01:50:37","image_url":"https://images.news18.com/ibnlive/uploads/2023/03/copy-of-sports-2023-03-03t071800.096-16778081253x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"Why Chelsea are now a mediocre mid-table team, and what they can do to fix it","link":"https://metro.co.uk/2023/03/03/what-chelsea-need-to-do-to-avoid-being-a-mid-table-premier-league-team-18375254/","keywords":["Football","Sport","Chelsea FC","Graham Potter","Metro newspaper"],"creator":["Gavin Brown"],"video_url":null,"description":"The club haven't won in the last six games.","content":"Last weekend football solemnly marked the first anniversary of Russia’s invasion of Ukraine , an act that, on a far more trivial level, set in motion a course of events which led Chelsea to where they find themselves today. Chelsea news, exclusives and analysis Without Vladimir Putin’s murderous willy-waving there would be no Todd Boehly at Stamford Bridge, no monolithic spending spree, probably no Graham Potter and almost certainly no muddled slide into mid-table mediocrity. With Potter winless in six games it has been remarked that Chelsea’s reflex reaction would be to sack the manager, but that Chelsea no longer exist. Roman Abramovich is gone and with him Marina Granovskaia, Petr Cech and much of the behind-the-scenes brains trust which, along with the Russian oligarch’s money, made Chelsea such a consistent fixture at the head of the European game for two decades. New co-owner Boehly has also brought a lot of money, ambition and good intentions, but little evidence so far of anything more concrete beyond. Results on the field are the obvious and fairest barometer of a club’s progress – especially one that has spent so much on players – so it is only natural that when things go badly the scrutiny falls largely on the manager. But Potter is the frontman for a club undergoing tremendous upheaval above and beyond his control. Tottenham coach Antonio Conte recently bemoaned the lack of public profile and accountability afforded to sporting directors in the English game means it falls on managers and coaches to answer for decisions and repercussions over which they have little knowledge or control. It is fair to wonder whether Graham Potter might agree with him. Chelsea’s participation in the January transfer window wasn’t just enthusiastic, it was chaotic and seemingly naive. After Benfica told them Enzo Fernandes would not be sold for less than his huge release clause the Blues played hardball for a month before accepting the inevitable and paying the full fee at the deadline. Mudryk was signed from under Arsenal’s noses without any indication the club’s plan for him expands beyond frustrating a local rival. Both Fernandez and Mudryk will likely prove to be quality signings and will probably not be the only ones. Benoit Badiashile has made an encouraging start and Joao Felix has also shown promise but cannot be considered a long-term building block as the £9million Chelsea paid Atletico Madrid for the forward only covers a six-month loan with no option for a permanent deal. Noni Madueke and David Datro Fofana look more likely to have an impact in the future than right now and Malo Gusto and Andrey Santos have been loaned back out. Chelsea’s hectic window has left Potter with a bloated squad of some 31 first-team players, a situation which has reportedly left the former Brighton boss struggling to conduct meaningful training sessions which keep everyone involved and inevitably left noses out of joint when players don’t make the matchday squad. 'No way!' - Darren Bent tells Chelsea star he wouldn't get in the Arsenal team Arsenal believe Jack Wilshere will convince key target to snub Chelsea and Man Utd Chelsea face deadline to avoid paying £97million release clause for World Cup star The manager’s desire to keep everyone happy and involved has at times also appeared to have an influence on selection with impossible-to-predict recent Chelsea teams featuring countless changes in personnel, formation and tactics. Six changes were made for Sunday’s listless loss at Tottenham. In truth Potter’s squad rotation – a throwback to the Tinkerman era of former Chelsea boss Claudio Ranieri – is more about finding balanced and successful solutions than keeping everybody happy but there is a sense the manager should be more ruthless. Throughout his management career with Ostersund, Swansea and Brighton Potter has shown huge ability to build a team and an ethos, and it is the 47-year-old’s credentials as a ‘project builder’ which attracted Boehly in his search for the right coach to shape his new Chelsea. But football, as the old truism goes, is about results and Potter’s Chelsea are reaching the stage of needing a few good ones, whatever it takes to achieve them. If that means upsetting a few big names old or new then so be it. It’s time for the man with the long-term vision to apply some short-term focus, settle on a team he trusts and grind out a few wins. If Pierre-Emerick Aubameyang has to be called in from the naughty step to help achieve that, then so be it. To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video A settled side might also force players to take responsibility. In recent years Chelsea have become a team that lack leadership and with the line-up chopping and changing every week it is easier still for players to pass the buck for individual mistakes, collective failings and defeats. Raheem Sterling has captained England, Mason Mount and Reece James have both played well over 100 games for the club. It is time for them to set the standards for others and ensure they are met. Arsenal boss Mikel Arteta and Thomas Frank have both offered words of support for Potter this week. It’s normal for rival managers to rally around when one of their own is under threat but their comments had more than the ring of hollow platitudes about them. ‘(Graham is) a very good coach and it’s proven that he can do a good job,’ Frank told the BBC. ‘A good coach can work at every club. It’s just sometimes the circumstances create an environment where it’s difficult to get everything to just click. ‘There’s a lot of new players (at Chelsea), the team isn’t in sync, trying to find the right balance. A lot of players have been in and out [of the team]. Graham is searching for a solution and I’m convinced, over time, he will find that solution.’ Graham Potter is clearly a decent man who does what he thinks is best for long-term future of the club but winning games matters too and so does saving his job. There is still time. MORE : Liverpool increasingly confident of signing Chelsea star Mason Mount MORE : Man Utd, Arsenal and Chelsea identify new target as they consider summer bids for Southampton star Romeo Lavia For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2023-03-03 00:01:00","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Virgil van Dijk happy to put body on the line for Liverpool","link":"https://metro.co.uk/2023/03/03/virgil-van-dijk-happy-to-put-body-on-the-line-for-liverpool-18377800/","keywords":["Football","Sport","Liverpool FC","Metro newspaper","Virgil van Dijk"],"creator":["John Payne"],"video_url":null,"description":"'I want to be influential for this club but it caught up with me, unfortunately.'","content":"Virgil van Dijk has spoken of the sacrifices he is making to help Liverpool finish in the top four after admitting he has played too much across the last two seasons. The Netherlands captain, who got the opening goal in Wednesday’s 2-0 win over Wolves, has played the full 90 minutes in each of his four games since a rare seven-match absence with a hamstring injury. Van Dijk hardly takes a break when he is available for Jurgen Klopp ’s side and, although his form has dipped at times this season, he goes into Sunday’s crunch meeting with Manchester United expecting no let-up for the rest of the campaign. ‘We play every three to four days so what you have to do is sacrifice quite a bit,’ said the 31-year-old. ‘I would love to spend time with my family and my kids. ‘But obviously I need to get treatment every day, make sure I’m eating the right stuff and doing the right things in order to be ready for the next game. ‘That’s the life we live and we are very privileged and I really acknowledge that but you still have to make these sacrifices. That’s what’s going on behind the scenes.’ Upon returning from cruciate knee surgery last season, Van Dijk played the full 90 minutes for 49 consecutive matches before being substituted in the FA Cup final when Liverpool beat Chelsea on penalties. The Netherlands star, who also played every minute of 21 of his side’s 22 games before this season’s World Cup, added: ‘Obviously I came back from quite a complex injury that I had two years ago now. ‘That takes treatment, that takes time, it takes adaptation. That’s the way I have to handle myself. I played all the Premier League games because I want to be out there. ‘What caught up is I played too many games at a time. Gunmen threaten Lionel Messi and shoot up family-owned supermarket Carlo Ancelotti calls Barcelona's tactics 'strange' after Real Madrid's defeat Barcelona blocked from signing new players this summer by La Liga ‘I could have thought before the World Cup, “let’s rest a little bit”. But I didn’t because I want to be influential for this football club but it caught up with me, unfortunately. I’m not a robot and I think having the World Cup and then doing nothing for a week and coming back it was maybe not the right decision.’ Three wins and a draw in their last four games have left Liverpool six points adrift of the top four but Van Dijk accepts his attempts to secure a place in next season’s Champions League will take its toll. ‘You try to hit consistency and try to build up momentum,’ he said. ‘Coming back after being six weeks out, playing four games of 90 minutes in such a short space of time, I need time. Sometimes people will take it for granted and see it as normal but it isn’t.’ Liverpool’s Jurgen Klopp is ready to take on Manchester United this weekend (Picture: Getty) Jurgen Klopp has warned Manchester United his side will give them a ‘big fight’ on Sunday. The Reds beat Wolves 2-0 on Wednesday thanks to goals from Virgil van Dijk and Mohamed Salah. United, who won the Carabao Cup on Sunday and are still able to achieve a quadruple this term, are looking to do the double over their rivals after August’s 2-1 win at Old Trafford. But Klopp said: ‘It’s a big game against a team in form. We have to be ready, and we will give them a big fight. ‘You have to break an opponent down step by step, it’s not often they make mistakes and you get easy goals in the 420 or something games I’ve had.’ The Liverpool boss is hopeful his side have put their 5-2 Champions League defeat by Real Madrid behind them and added: ‘We looked a lot more stable today.’ MORE : Jurgen Klopp full of praise for struggling Liverpool stars after Wolves win MORE : Jurgen Klopp hits back at Jamie Carragher over criticism of Liverpool star Virgil van Dijk For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2023-03-03 00:01:00","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Haalandova agentica otvorila karte: ‘Taj klub bi za njega bio zemlja snova. Ima posebnu magiju‘","link":"https://sportske.jutarnji.hr/sn/nogomet/nogomet-medjunarodni/haalandova-agentica-otvorila-karte-taj-klub-bi-za-njega-bio-zemlja-snova-ima-posebnu-magiju-15311633","keywords":["Međunarodni nogomet"],"creator":null,"video_url":null,"description":"Rafaela Pimenta, agentica Erlinga Haalanda, potvrdila je da već naveliko planiraju odlazak norveškog centarfora iz Manchester Cityja, otvorivši vrata transferu \"iz snova\" u Real Madrid. Norvežanin je prošlog ljeta prešao na Etihad u ugovoru vrijednom 60 milijuna eura i uživa u izvrsnoj prvoj sezoni...","content":"Rafaela Pimenta, agentica Erlinga Haalanda, potvrdila je da već naveliko planiraju odlazak norveškog centarfora iz Manchester Cityja, otvorivši vrata transferu \"iz snova\" u Real Madrid. Norvežanin je prošlog ljeta prešao na Etihad u ugovoru vrijednom 60 milijuna eura i uživa u izvrsnoj prvoj sezoni u aktualnom prvaku Premier lige. Haaland je zabio 33 gola u 33 utakmice, od kojih 27 u Premier ligi, što je najveći broj pogodaka igrača Cityja u jednoj sezoni Premier lige ikada. Međutim, dok 22-godišnjak nastavlja rušiti rekorde, njegov je sljedeći potez izgleda već isplaniran, a agentica Pimenta potvrdila je da bi za Haalanda bio san da potpiše za Real Madrid. Govoreći na FT Business of Football summitu u Londonu, rekla je: - Postoji Premier liga. A tu je i Real Madrid. Real Madrid ima nešto svoje što ga čini \"zemljom snova\" za igrače. Madrid održava tu magiju. Ne natječe se u ligi kao što je Premiership, ali zato ima Ligu prvaka. Brazilska odvjetnica koja je preuzela brigu o Haalandu nakon smrti Mina Raiole prošle godine, istaknula je da \"voli planirati karijere igrača\". Potvrdila je da je Haaland želio prijeći u City i raditi s Pepom Guardiolom , te da je Premier liga sada \"atrakcija sama za sebe\", neovisno o klubovima koji se u njoj natječu. - Pokušavamo napraviti plan. Moramo imati cilj. Možda to nećemo postići, ali ako ne znamo kamo idemo, sigurno tamo nećemo stići. Kad imamo igrača, radimo planove. Čak i ako igrač ima samo 15 godina. Kad sam se počela baviti ovim poslom, ako bih igraču rekla ‘dovest ću te u Englesku‘, prva stvar koju bi on rekao bila bi: ‘Što sam krivo napravio? Zašto ti se ne sviđam?‘ Ali sad, kad pitam igrača ‘koji je tvoj cilj?‘, reći će Premier liga. Ne kažu City, Chelsea ili Arsenal nego Premier liga. Ovo je prvi put u 25 godina da čujem da toliko igrača kaže da žele ići u ligu. Engleska je pravo mjesto za agenta. Agent mora biti tamo gdje igrač želi biti. To je fantastična liga. Tako je natjecateljska, svaka utakmica je izazov, svi je žele gledati. Iako je Haaland u Cityju tek od prošlog ljeta, Guardiola je već bio prisiljen demantirati da njegov napadač ima \"klauzulu Real Madrida\" u ugovoru, prema kojoj bi se mogao pridružiti španjolskom divu 2024. godine. Erlingov otac i bivši veznjak Man Cityja Alf-Inge Haaland ranije je također tvrdio da će njegov sin vjerojatno ostati u Engleskoj samo dvije ili tri godine, prije nego što se odluči igrati u drugoj europskoj ligi. Kako god, Haaland očito opasno razmišlja o Real Madridu.","pubDate":"2023-03-03 06:34:23","image_url":"https://static.jutarnji.hr/images/slike/2023/03/03/28103591.jpg","source_id":"jutarnji","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"All Whites: ‘Number of candidates’ in mix as New Zealand Football’s coaching search drags on","link":"https://www.nzherald.co.nz/sport/all-whites-number-of-candidates-in-mix-as-new-zealand-footballs-coaching-search-drags-on/22LHZUNKDBCDZBIXBRDHWBDNKM/","keywords":null,"creator":null,"video_url":null,"description":"NZF boss: It would be ideal if the new person was in place for June, but not imperative.","content":"New Zealand Football would prefer to have a permanent All Whites head coach in place for the June international window – but are keeping an open mind on the timeframe. On Friday NZF announced a glamour match against Sweden in Stockholm on June 16, a rare match against a high-profile Uefa team for the All Whites. But it is still uncertain who will be in charge for that phase, which will feature a second game in Europe. Darren Bazeley has the role on an interim basis for the two home games against China later this month, before NZF will reconvene to discuss their options. NZF chief executive Andrew Pragnell told the Herald they won’t be going back to market, or re-advertising the role, after the extensive pre-Christmas search process to find a successor to Danny Hay. He maintained there are “a number of candidates” in contention and added that CV’s are still coming in, which continues to “put options on the table”. Pragnell declined to go into detail on who could still be in the mix. John Herdman has publicly signalled his intention to remain with Canada, while Des Buckingham has signed a new club deal in India. Wellington Phoenix coach Ufuk Talay indicated he wasn’t interested, after being overlooked initially, in favour of NZF’s preferred candidate (Herdman), which never came to pass. Advertisement Advertise with NZME. ”We need to check [post-March] who is in front of us and weigh up our best options going forward,” said Pragnell. He agreed it would be ideal if the new man was in place for June but said it wasn’t imperative. ”I’d be disappointed if this was drifting into the end of 2023 but the decision on who is more important than the timeframe,” said Pragnell. “Having said that, sooner rather than later is preferable.” Pragnell confirmed that Bazeley is “totally in the mix” for the full-time position. ”It’s a great chance for Darren, who has been in our national team set-ups for a long time, to put his mark on the team,” said Pragnell. “We will be looking at the feedback that comes out of that window, what the environment has been like, how we have gone.” The interview panel, comprised of Pragnell, high performance boss Keir Hansen, board member Jacqui Barron, a PFA representative and two senior players, will have discussions in early April. The Swedish encounter is a coup for NZF. The All Whites haven’t faced European opposition since November 2019, when they played Ireland and Lithuania in the first matches under Hay. Advertisement Advertise with NZME. Before that, New Zealand had only experienced four games against Uefa nations in the previous nine years, when they faced Northern Ireland and Belarus in the lead-up to the 2017 Fifa Confederations Cup, then Russia and Portugal at the main event. World No 23 Sweden missed qualification for the 2022 World Cup, finishing second in their group to Spain, then losing a playoff semifinal to Poland. But they reached the second round of the last European Championships - beaten in extra time by Ukraine - and the quarter-finals of the 2018 World Cup. In that tournament they topped the ‘group of death’ - ahead of Mexico, South Korea and Germany - then beat Switzerland in the round of 16, before falling to England in the last eight. ”We have been chasing top-50 nations and looking to play in Europe more often,” said Pragnell. It has been speculated that Jordan could be the second June opponent – with their national association announcing a match on June 20 – but Pragnell said that was premature. ”We are weighing up a couple of options and they may be in the mix,” said Pragnell. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-03-03 05:30:00","image_url":"https://www.nzherald.co.nz/resizer/36L2RzUaiCFtO_9KOB2YO8dH13A=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/IXSN2E65W4RKF46NXJ25JWVAJU.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Man Utd face Liverpool test, Arsenal back in the groove","link":"https://www.capitalfm.co.ke/sports/2023/03/03/man-utd-face-liverpool-test-arsenal-back-in-the-groove/","keywords":["English Premiership","Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"MANCHESTER, United Kingdom, Mar 3 – Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side […] The post Man Utd face Liverpool test, Arsenal back in the groove appeared first on Capital Sports.","content":"The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment of their League Cup final defeat behind them. Tottenham must bounce back quickly from an FA Cup exit to maintain their advantage over Newcastle and Liverpool in the race for a top-four finish. AFP Sport looks at some of the key talking points ahead of the weekend’s action in the English top flight. Liverpool won both Premier League fixtures against fierce rivals United last season by an aggregate score of 9-0. However, the fortunes of both clubs have dramatically changed over the past 12 months. Fresh from lifting the League Cup to end a six-year wait for silverware, United’s run of one defeat in 22 games has kept them in the hunt for a quadruple of trophies. But with an 11-point gap to leaders Arsenal, anything less than a first win at Anfield since 2016 for Erik ten Hag’s men could signal the end of their title challenge. Liverpool, who lost against United at Old Trafford earlier this season, are in need of the points in their push to finish in the top four. Jurgen Klopp’s men have crept back into contention for a Champions League place thanks to a run of 10 points from their past four league games. But in the middle of that run, the Reds’ deficiencies were brutally exposed in a 5-2 home defeat to Real Madrid in the Champions League. “I think Man United is the team in form in the moment, maybe together with Arsenal and City,” said Klopp after a 2-0 win over Wolves on Wednesday. “If you face United at the weekend whichever result you’ve had before, either way you have to strike back or whatever, but now we have to use it for our general situation. “We have to build on the performance and on the result and we try everything to do exactly that.” Arsenal’s bid for a first league title in 19 years looked to be on shaky ground last month when they took just one point from three games, including a 3-1 home defeat to City. But Mikel Arteta’s side have responded in style with three straight wins to carve out a five-point lead at the top of the table. “When you look at them every single day, you just feel how much they want it, how much they really want to produce what we ask them to do and how much they want to please our people,” said Arteta after Everton were dispatched 4-0 on Wednesday. “I had no doubts that we were going to turn things around in performances and results.” More of the same will be expected from Arsenal against a relegation-threatened Bournemouth side. City face a tougher test on paper with the visit of Newcastle, but there is little for the champions to fear in the Magpies’ form of late. Newcastle have slipped outside the top four after winning just once in the Premier League in 2023 so far. A big week for Tottenham got off to the worst possible start with defeat in their FA fifth-round match against Championship side Sheffield United. Spurs, who have not won a trophy since 2008, have to overturn a 1-0 first-leg deficit when they host AC Milan in the Champions League last 16 next week. But first they have a tricky trip to Molineux to face a Wolves team also desperate for the points to pull away from the relegation zone. “Now, the FA Cup has gone. We have other chances, other competitions, other games,” said Spurs assistant boss Cristian Stellini, who has deputised for Antonio Conte while he recovers from gallbladder surgery. “This is football. You have to keep going and find again the same desire.” Manchester City v Newcastle (3:30pm), Arsenal v Bournemouth, Aston Villa v Crystal Palace, Brighton v West Ham, Chelsea v Leeds, Wolves v Tottenham (all 6pm), Southampton v Leicester (8:30pm) Nottingham Forest v Everton (1400), Liverpool v Manchester United (1630) Brentford v Fulham (2000)","pubDate":"2023-03-03 04:11:46","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Man Utd face Liverpool test, Arsenal back in the groove","link":"https://punchng.com/man-utd-face-liverpool-test-arsenal-back-in-the-groove/","keywords":["Sports"],"creator":["Agency Report"],"video_url":null,"description":"Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment Read More","content":"Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment of their League Cup final defeat behind them. Tottenham must bounce back quickly from an FA Cup exit to maintain their advantage over Newcastle and Liverpool in the race for a top-four finish. AFP Sport looks at some of the key talking points ahead of the weekend’s action in the English top flight. – United’s revenge mission – Liverpool won both Premier League fixtures against fierce rivals United last season by an aggregate score of 9-0. However, the fortunes of both clubs have dramatically changed over the past 12 months. Fresh from lifting the League Cup to end a six-year wait for silverware, United’s run of one defeat in 22 games has kept them in the hunt for a quadruple of trophies. But with an 11-point gap to leaders Arsenal, anything less than a first win at Anfield since 2016 for Erik ten Hag’s men could signal the end of their title challenge. Liverpool, who lost against United at Old Trafford earlier this season, are in need of the points in their push to finish in the top four. Jurgen Klopp’s men have crept back into contention for a Champions League place thanks to a run of 10 points from their past four league games. But in the middle of that run, the Reds’ deficiencies were brutally exposed in a 5-2 home defeat to Real Madrid in the Champions League. “I think Man United is the team in form in the moment, maybe together with Arsenal and City,” said Klopp after a 2-0 win over Wolves on Wednesday. “If you face United at the weekend whichever result you’ve had before, either way you have to strike back or whatever, but now we have to use it for our general situation. “We have to build on the performance and on the result and we try everything to do exactly that.” – In-form Arsenal – Arsenal’s bid for a first league title in 19 years looked to be on shaky ground last month when they took just one point from three games, including a 3-1 home defeat to City. But Mikel Arteta’s side have responded in style with three straight wins to carve out a five-point lead at the top of the table. “When you look at them every single day, you just feel how much they want it, how much they really want to produce what we ask them to do and how much they want to please our people,” said Arteta after Everton were dispatched 4-0 on Wednesday. “I had no doubts that we were going to turn things around in performances and results.” Related News Casemiro lists five high quality players in Man Utd Balogun won’t play second fiddle at Arsenal Martinelli stars as leaders Arsenal crush Everton More of the same will be expected from Arsenal against a relegation-threatened Bournemouth side. City face a tougher test on paper with the visit of Newcastle, but there is little for the champions to fear in the Magpies’ form of late. Newcastle have slipped outside the top four after winning just once in the Premier League in 2023 so far. – Sorry start to Spurs’ big week – A big week for Tottenham got off to the worst possible start with defeat in their FA fifth-round match against Championship side Sheffield United. Spurs, who have not won a trophy since 2008, have to overturn a 1-0 first-leg deficit when they host AC Milan in the Champions League last 16 next week. But first they have a tricky trip to Molineux to face a Wolves team also desperate for the points to pull away from the relegation zone. “Now, the FA Cup has gone. We have other chances, other competitions, other games,” said Spurs assistant boss Cristian Stellini, who has deputised for Antonio Conte while he recovers from gallbladder surgery. “This is football. You have to keep going and find again the same desire.” Fixtures (all times GMT) Saturday Manchester City v Newcastle (1230), Arsenal v Bournemouth, Aston Villa v Crystal Palace, Brighton v West Ham, Chelsea v Leeds, Wolves v Tottenham (all 1500), Southampton v Leicester (1730) Sunday Nottingham Forest v Everton (1400), Liverpool v Manchester United (1630) Monday Brentford v Fulham (2000) AFP","pubDate":"2023-03-03 03:38:33","image_url":"https://cdn.punchng.com/wp-content/uploads/2021/09/10210647/Manchester-United.jpg","source_id":"punchng","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Napoli ‘to keep hands on wheel’ as Pogba return boosts Juve","link":"https://www.capitalfm.co.ke/sports/2023/03/03/napoli-to-keep-hands-on-wheel-as-pogba-return-boosts-juve/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"MILAN, Italy, Mar 3 – Napoli coach Luciano Spalletti says his players are drowning out what he sees as premature title chatter despite knowing victory over Lazio on Friday would send them 21 points clear in Serie A. The league leaders have won eight games in a row and 19 of their past 20 in […] The post Napoli ‘to keep hands on wheel’ as Pogba return boosts Juve appeared first on Capital Sports.","content":"The league leaders have won eight games in a row and 19 of their past 20 in the top flight — a run that began with a 2-1 victory away to Lazio on September 3. “We’re not listening to those who want us to take our hands off the wheel and start celebrating, because there are still twists and turns to come,” said Spalletti. “Our fans must take to the field with us and not wait for us at the finish line.” Napoli are closing in on a first Serie A crown since the days of Diego Maradona, who inspired the club to their only two league titles in 1987 and 1990. They have dropped just seven points over 24 games this season and midfielder Eljif Elmas insisted Napoli have no intention of slowing down. “Eighteen points is a big margin but honestly we’re not looking at the table because we want to try to win every game we have left,” Elmas told Radio Kiss Kiss. “We’re playing good football and our aim is to maintain this pace and keep doing what we’re doing because we deserve to be where we are. “We’re not getting carried away and we’re not going to ease up at all.” Lazio are back in the Champions League places following wins over Salernitana and Sampdoria but city rivals Roma, in fifth, will be eager to atone for their shock midweek loss to Cremonese. Roma will be without Jose Mourinho for Saturday’s visit of Juventus after the Portuguese coach was hit with a two-match ban after receiving his third red card of the season against Cremonese. “I’m emotional but not crazy,” said Mourinho. The league said after the match he also “entered the referees’ dressing room without permission and made seriously offensive statements”. “For the first time in my career a referee has spoken to me in an unjustifiable way,” added Mourinho. “To react like that, something must have happened. We need to see if we can do anything from a disciplinary perspective.” AC Milan have recovered from a dreadful start to 2023 by winning their past four games in all competitions without conceding. Stefano Pioli’s side face Fiorentina on Saturday ahead of next week’s second leg against Tottenham in the last 16 of the Champions League, while Inter Milan host Lecce on Sunday. The France midfielder made his first competitive appearance since April as Juventus defeated Torino 4-2 in the Turin derby on Tuesday. Pogba injured his right knee injury during pre-season in July shortly after his return to Juve following six years at Manchester United. The 29-year-old won four Serie A titles in as many seasons during his first spell in Italy, and Juve hope his recovery can help the club make an improbable push for a top-four place following a 15-point deduction for illicit transfer activity. 8 – successive league games in which Victor Osimhen has scored for Napoli. The Nigerian is Serie A’s top scorer this season with 19 goals — six more than nearest rival Lautaro Martinez. 30 – Cremonese’s 2-1 victory over Roma snapped the joint-longest run without a win for a club in Italian top-flight history. Ancona also went 30 Serie A games without winning between 1993 and 2004. Napoli v Lazio (10:45pm) Monza v Empoli (5pm), Atalanta v Udinese (8pm), Fiorentina v AC Milan (10:45pm) Spezia v Hellas Verona (2:30pm), Sampdoria v Salernitana (5pm), Inter Milan v Lecce (8pm), Roma v Juventus (10:45pm) Sassuolo v Cremonese (8:30pm), Torino v Bologna (10:45pm)","pubDate":"2023-03-03 03:38:22","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Gunmen Attack Rosario Supermarket Owned by Lionel Messi's Wife's Family, Leave Threat Note","link":"https://www.news18.com/news/football/gunmen-attack-rosario-supermarket-owned-by-lionel-messis-wifes-family-leave-threat-note-7206793.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country's third-largest city of Rosario, owned by the family of his wife, Antonella Roccuzzo","content":"A supermarket in the Argentine city of Rosario, owned by Lionel Messi’s wife, Antonella Roccuzo’s family, was attacked in the early hours of Friday by two gunmen on a motorcycle. The attackers left a note on cardboard following the open fire that threatened the Argentine icon. It is reported that the dissidents shot at least a dozen rounds of ammunition. The city’s mayor, Pablo Javkin, went to the supermarket and lashed out at federal authorities over what he called their failure to curb a surge in drug-related violence in Rosario, located about 190 miles (300 kilometers) northwest of the capital of Buenos Aires. The message read “Messi, we’re waiting for you. Javkin is also a drug trafficker, so he won’t take care of you.” Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country’s third-largest city of Rosario, owned by the family of his wife. ALSO READ| Copa Del Rey: Barcelona Dig Out First Leg El Clasico Win Over Real Madrid Messi has not commented. Considered by many to be the greatest football player of all time, Messi is revered in Argentina, especially since he led the national team to the country’s first World Cup victory in 36 years in Qatar in December. Messi currently plays for Paris Saint-Germain and spends much of his time overseas, though he often visits Rosario where he has a home in the suburb of Funes. The French team posted a photo on social media of Messi training on Thursday morning. In Rosario, prosecutor Federico Rébola said authorities were reviewing security camera footage and that the investigation was “preliminary.” It was the first time Messi’s in-laws had received this kind of threat, he added. Celia Arena, justice minister for Santa Fe province, where Rosario is located, said the attack amounted to “terrorism” by a “mafia\" group meant to intimidate the broader population. “The aim is to deliberately cause terror in the population and discourage those of us who are fighting against criminal violence, knowing that it will be an event of global significance,” Arena wrote in a social media post. Javkin, a center-left politician in opposition to the ruling Peronist coalition, appeared to throw suspicion of complicity for the attack on both criminal gangs and federal security officials. “I doubt everyone, even those who are supposed to protect us,” Javkin said in an interview with a local radio station. He said that he had recently had “very strong discussions” with members of the federal security forces over the past couple of weeks demanding that they crack down on the city’s crime. “Where are the ones who need to take care of us?” Javkin said. “It’s clear that those who have the weapons and have the possibility of investigating the criminals aren’t doing it, and it’s very easy for any gang to carry out something like this.” The federal government’s Security Minister Aníbal Fernández said drug-related violence was not a recent phenomenon in the city, and that Thursday’s attack was typical of what has happened there “for the last 20 years.” He said the incident was an example of how drug traffickers “have won” in Rosario, but now “we have to reverse that.\" Opposition politicians blamed President Alberto Fernández’s administration for the continuing violence in Rosario. His predecessor, Mauricio Macri, characterized the events as a warning that the country cannot “co-exist” with drug traffickers. Messi, 35, is currently renegotiating a contract with Paris Saint-Germain that ends this year amid speculation that the soccer superstar could decide to end his career playing for one of the local Rosario clubs, Newell’s. Messi, who this week won FIFA’s best men’s player award, could travel to Argentina later this month to join the national squad in playing two friendly matches. One takes place March 23 against Panama in Buenos Aires, while the other one will be five days later against Curacao in the northern city of Santiago del Estero. With Inputs From AP Read all the Latest Sports News here","pubDate":"2023-03-03 02:55:03","image_url":"https://images.news18.com/ibnlive/uploads/2023/02/copy-of-sports-2023-02-19t202656.703-16768186543x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"Shots fired at Messi family store, threatening message left for star","link":"https://www.capitalfm.co.ke/sports/2023/03/03/shots-fired-at-messi-family-store-threatening-message-left-for-star/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"ROSARIO, Argentina, Mar 3 – In the dead of night, two men fired shots at a closed supermarket belonging to the family of Lionel Messi’s wife, before leaving a threatening message on the ground aimed at the seven-time Ballon d’Or winner. “Messi, we’re waiting for you. Javkin is a narco, he won’t take care of […] The post Shots fired at Messi family store, threatening message left for star appeared first on Capital Sports.","content":"“Messi, we’re waiting for you. Javkin is a narco, he won’t take care of you,” said the handwritten message left on the ground by the men who shot 14 bullets into the supermarket’s metallic facade in the early hours of Thursday. Pablo Javkin is the mayor of Messi’s hometown, Rosario, where the supermarket is located, some 320 kilometers northwest of Buenos Aires. Javkin confirmed the supermarket belonged to the family of Antonela Roccuzzo, who shares three children with the football superstar, and said the aim of the attack was to “to create chaos in the city.” “Here, what’s sought is the repercussion, it’s perfidious,” he said. “What story goes more quickly viral in the world than an attack on Messi?” A witness confirmed seeing the two men arrive on a motorbike just before 3:00. One of them got off, fired the shots, dropped the note and they both fled. “This has been going on for some time,” said Javkin. “We have five security forces operating in Rosario yet they can do this because no one is chasing them.” Provincial police assistant chief Ivan Gonzalez told Cadena 3 television station that the message was “not a threat” but rather an attempt to “attract attention.” He said no one was hurt since there was no one on the premises at that hour. The prosecutor in charge of the case, Federico Rebola, told reporters that there had been no previously known threats made against the Roccuzzo family. “We’re concerned, this has a huge repercussion, we have the video images and we’re looking for more cameras,” he said. Rosario is a port city on the Parana river that has gradually become a nerve center for drug trafficking and the most violent city in Argentina, with 287 murders in 2022. The centrist mayor, left-wing governor of Santa Fe state, Omar Perotti, and center-left national government regularly pass on responsibility for counter-narcotics measures and the use of the city’s security forces to each other. At a meeting this week between the municipal, provincial and national security forces, provincial minister Claudio Brilloni said he had “urged the federal forces to greater collaboration, engagement and participation” in the fight against violence and criminality in Rosario. Among the right-wing opposition, two declared candidates for October’s presidential election called for help from the military police to fight drug-trafficking in Rosario. “The situation is complicated in Rosario… the drug traffickers have won,” said Security Minister Anibal Fernandez.","pubDate":"2023-03-03 01:54:05","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Copa Del Rey: Barcelona Dig Out First Leg El Clasico Win Over Real Madrid","link":"https://www.news18.com/news/football/copa-del-rey-barcelona-dig-out-first-leg-el-clasico-win-over-real-madrid-7206547.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Madrid defender Eder Militao deflected a rebound into his own goal after 26 minutes to split the teams and hand Barcelona the edge ahead of the second leg on April 5 at Camp Nou","content":"Eder Militao’s own goal handed a depleted Barcelona a surprise 1-0 away victory over Real Madrid in a stormy Copa del Rey semi-final first leg on Thursday. The Catalans arrived on the back of two consecutive defeats and without an injured trio of key players — top scorer Robert Lewandowski, key midfielder Pedri and explosive winger Ousmane Dembele. ALSO READ| Watch: Martin Odegaard’s Creamy Interception Against Alex Iwobi During Everton Game After their Europa League elimination by Manchester United last week and a first ever loss against La Liga minnows Almeria, Madrid fans smelled blood, but left bitterly frustrated. Militao deflected a rebound into his own goal after 26 minutes to split the teams and hand Barcelona the edge ahead of the second leg on April 5 at Camp Nou. The hosts had more of the ball but failed to muster a shot on target, while Barcelona defended well. “This was the game we wanted to play — not with this result, but it gives us confidence for the second leg,\" Madrid coach Carlo Ancelotti told reporters. “We did not let Barcelona do what they wanted, that’s good for us, and we just have to repeat it (at Camp Nou).\" Asked if Barcelona deserved to win or not, Ancelotti said it was clear his team deserved more. “No, that is obvious, we had chances, but I think that it was one of Madrid’s best games in terms of pressing high,\" added Ancelotti. “It was a bit strange, their way of playing, but they have learned very well, it’s a very solid team defensively.\" Barcelona lined up with Marcos Alonso out of position at centre-back, after Andreas Christensen was only deemed fit enough to start on the bench. Sergio Busquets made his 46th Clasico appearance, overtaking former Real Madrid and Barcelona greats Sergio Ramos and Lionel Messi to set a new record. Despite Barcelona’s seven-point lead over champions Madrid in La Liga, many, including Barca coach Xavi Hernandez, had Madrid as favourites. Los Blancos have not won the trophy since 2014 and pushed Barca back early on, with Benzema scoring a goal ruled out for offside. A handful of Madrid fans had protested outside the Santiago Bernabeu about Barca’s involvement in the “Negreira case\" — the Catalan club paying a former refereeing chief for advice until 2018. The temperature rose considerably when Vinicius Junior was booked midway through the first half for wrestling Frenkie de Jong to the ground. Vinicius remonstrated vociferously with the referee, and Madrid may still have been distracted by the argument moments later when Barcelona took the lead. The goal came against the run of play, created by Ferran Torres, who slipped through Franck Kessie, just onside. Thibaut Courtois saved the Ivorian midfielder’s low shot but the ball rebounded off Militao, into his own net, with Nacho trying and failing to hack it clear. Madrid players and supporters reacted angrily as Barcelona midfielder Gavi got away with smashing into Militao, but the hosts struggled to carve out chances. Barcelona held their lead until the break comfortably, with supporters whistling the officials as they walked towards the tunnel. With Carlo Ancelotti’s side unable to muster a shot on target against an underwhelming Barcelona side, perhaps some of the home supporters’ frustration aimed at the referee was misplaced. Madrid struggled to connect with Benzema, isolated and unable to influence the game. Record Copa winners Barcelona should have doubled their lead with 20 minutes remaining when Torres cut the ball back to Kessie, but his goal-bound shot was blocked by his own team-mate, Ansu Fati. Rodrygo whipped a shot wide for Madrid in the final stages as they remained unable to test Ter Stegen, despite Barcelona’s deficiencies. More traditional roles were reversed as Madrid had more of the ball but Barcelona defended solidly and took the advantage back home. “Today they dominated us with the ball, but there are other aspects in the game, sometimes the opponent forces you to this,\" admitted Xavi. “Madrid can dominate you, it’s hard to get the ball off (Toni) Kroos and (Luka) Modric, but defence is part of the game.\" Read all the Latest Sports News here","pubDate":"2023-03-03 01:50:37","image_url":"https://images.news18.com/ibnlive/uploads/2023/03/copy-of-sports-2023-03-03t071800.096-16778081253x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"Why Chelsea are now a mediocre mid-table team, and what they can do to fix it","link":"https://metro.co.uk/2023/03/03/what-chelsea-need-to-do-to-avoid-being-a-mid-table-premier-league-team-18375254/","keywords":["Football","Sport","Chelsea FC","Graham Potter","Metro newspaper"],"creator":["Gavin Brown"],"video_url":null,"description":"The club haven't won in the last six games.","content":"Last weekend football solemnly marked the first anniversary of Russia’s invasion of Ukraine , an act that, on a far more trivial level, set in motion a course of events which led Chelsea to where they find themselves today. Chelsea news, exclusives and analysis Without Vladimir Putin’s murderous willy-waving there would be no Todd Boehly at Stamford Bridge, no monolithic spending spree, probably no Graham Potter and almost certainly no muddled slide into mid-table mediocrity. With Potter winless in six games it has been remarked that Chelsea’s reflex reaction would be to sack the manager, but that Chelsea no longer exist. Roman Abramovich is gone and with him Marina Granovskaia, Petr Cech and much of the behind-the-scenes brains trust which, along with the Russian oligarch’s money, made Chelsea such a consistent fixture at the head of the European game for two decades. New co-owner Boehly has also brought a lot of money, ambition and good intentions, but little evidence so far of anything more concrete beyond. Results on the field are the obvious and fairest barometer of a club’s progress – especially one that has spent so much on players – so it is only natural that when things go badly the scrutiny falls largely on the manager. But Potter is the frontman for a club undergoing tremendous upheaval above and beyond his control. Tottenham coach Antonio Conte recently bemoaned the lack of public profile and accountability afforded to sporting directors in the English game means it falls on managers and coaches to answer for decisions and repercussions over which they have little knowledge or control. It is fair to wonder whether Graham Potter might agree with him. Chelsea’s participation in the January transfer window wasn’t just enthusiastic, it was chaotic and seemingly naive. After Benfica told them Enzo Fernandes would not be sold for less than his huge release clause the Blues played hardball for a month before accepting the inevitable and paying the full fee at the deadline. Mudryk was signed from under Arsenal’s noses without any indication the club’s plan for him expands beyond frustrating a local rival. Both Fernandez and Mudryk will likely prove to be quality signings and will probably not be the only ones. Benoit Badiashile has made an encouraging start and Joao Felix has also shown promise but cannot be considered a long-term building block as the £9million Chelsea paid Atletico Madrid for the forward only covers a six-month loan with no option for a permanent deal. Noni Madueke and David Datro Fofana look more likely to have an impact in the future than right now and Malo Gusto and Andrey Santos have been loaned back out. Chelsea’s hectic window has left Potter with a bloated squad of some 31 first-team players, a situation which has reportedly left the former Brighton boss struggling to conduct meaningful training sessions which keep everyone involved and inevitably left noses out of joint when players don’t make the matchday squad. 'No way!' - Darren Bent tells Chelsea star he wouldn't get in the Arsenal team Arsenal believe Jack Wilshere will convince key target to snub Chelsea and Man Utd Chelsea face deadline to avoid paying £97million release clause for World Cup star The manager’s desire to keep everyone happy and involved has at times also appeared to have an influence on selection with impossible-to-predict recent Chelsea teams featuring countless changes in personnel, formation and tactics. Six changes were made for Sunday’s listless loss at Tottenham. In truth Potter’s squad rotation – a throwback to the Tinkerman era of former Chelsea boss Claudio Ranieri – is more about finding balanced and successful solutions than keeping everybody happy but there is a sense the manager should be more ruthless. Throughout his management career with Ostersund, Swansea and Brighton Potter has shown huge ability to build a team and an ethos, and it is the 47-year-old’s credentials as a ‘project builder’ which attracted Boehly in his search for the right coach to shape his new Chelsea. But football, as the old truism goes, is about results and Potter’s Chelsea are reaching the stage of needing a few good ones, whatever it takes to achieve them. If that means upsetting a few big names old or new then so be it. It’s time for the man with the long-term vision to apply some short-term focus, settle on a team he trusts and grind out a few wins. If Pierre-Emerick Aubameyang has to be called in from the naughty step to help achieve that, then so be it. To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video A settled side might also force players to take responsibility. In recent years Chelsea have become a team that lack leadership and with the line-up chopping and changing every week it is easier still for players to pass the buck for individual mistakes, collective failings and defeats. Raheem Sterling has captained England, Mason Mount and Reece James have both played well over 100 games for the club. It is time for them to set the standards for others and ensure they are met. Arsenal boss Mikel Arteta and Thomas Frank have both offered words of support for Potter this week. It’s normal for rival managers to rally around when one of their own is under threat but their comments had more than the ring of hollow platitudes about them. ‘(Graham is) a very good coach and it’s proven that he can do a good job,’ Frank told the BBC. ‘A good coach can work at every club. It’s just sometimes the circumstances create an environment where it’s difficult to get everything to just click. ‘There’s a lot of new players (at Chelsea), the team isn’t in sync, trying to find the right balance. A lot of players have been in and out [of the team]. Graham is searching for a solution and I’m convinced, over time, he will find that solution.’ Graham Potter is clearly a decent man who does what he thinks is best for long-term future of the club but winning games matters too and so does saving his job. There is still time. MORE : Liverpool increasingly confident of signing Chelsea star Mason Mount MORE : Man Utd, Arsenal and Chelsea identify new target as they consider summer bids for Southampton star Romeo Lavia For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2023-03-03 00:01:00","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Virgil van Dijk happy to put body on the line for Liverpool","link":"https://metro.co.uk/2023/03/03/virgil-van-dijk-happy-to-put-body-on-the-line-for-liverpool-18377800/","keywords":["Football","Sport","Liverpool FC","Metro newspaper","Virgil van Dijk"],"creator":["John Payne"],"video_url":null,"description":"'I want to be influential for this club but it caught up with me, unfortunately.'","content":"Virgil van Dijk has spoken of the sacrifices he is making to help Liverpool finish in the top four after admitting he has played too much across the last two seasons. The Netherlands captain, who got the opening goal in Wednesday’s 2-0 win over Wolves, has played the full 90 minutes in each of his four games since a rare seven-match absence with a hamstring injury. Van Dijk hardly takes a break when he is available for Jurgen Klopp ’s side and, although his form has dipped at times this season, he goes into Sunday’s crunch meeting with Manchester United expecting no let-up for the rest of the campaign. ‘We play every three to four days so what you have to do is sacrifice quite a bit,’ said the 31-year-old. ‘I would love to spend time with my family and my kids. ‘But obviously I need to get treatment every day, make sure I’m eating the right stuff and doing the right things in order to be ready for the next game. ‘That’s the life we live and we are very privileged and I really acknowledge that but you still have to make these sacrifices. That’s what’s going on behind the scenes.’ Upon returning from cruciate knee surgery last season, Van Dijk played the full 90 minutes for 49 consecutive matches before being substituted in the FA Cup final when Liverpool beat Chelsea on penalties. The Netherlands star, who also played every minute of 21 of his side’s 22 games before this season’s World Cup, added: ‘Obviously I came back from quite a complex injury that I had two years ago now. ‘That takes treatment, that takes time, it takes adaptation. That’s the way I have to handle myself. I played all the Premier League games because I want to be out there. ‘What caught up is I played too many games at a time. Gunmen threaten Lionel Messi and shoot up family-owned supermarket Carlo Ancelotti calls Barcelona's tactics 'strange' after Real Madrid's defeat Barcelona blocked from signing new players this summer by La Liga ‘I could have thought before the World Cup, “let’s rest a little bit”. But I didn’t because I want to be influential for this football club but it caught up with me, unfortunately. I’m not a robot and I think having the World Cup and then doing nothing for a week and coming back it was maybe not the right decision.’ Three wins and a draw in their last four games have left Liverpool six points adrift of the top four but Van Dijk accepts his attempts to secure a place in next season’s Champions League will take its toll. ‘You try to hit consistency and try to build up momentum,’ he said. ‘Coming back after being six weeks out, playing four games of 90 minutes in such a short space of time, I need time. Sometimes people will take it for granted and see it as normal but it isn’t.’ Liverpool’s Jurgen Klopp is ready to take on Manchester United this weekend (Picture: Getty) Jurgen Klopp has warned Manchester United his side will give them a ‘big fight’ on Sunday. The Reds beat Wolves 2-0 on Wednesday thanks to goals from Virgil van Dijk and Mohamed Salah. United, who won the Carabao Cup on Sunday and are still able to achieve a quadruple this term, are looking to do the double over their rivals after August’s 2-1 win at Old Trafford. But Klopp said: ‘It’s a big game against a team in form. We have to be ready, and we will give them a big fight. ‘You have to break an opponent down step by step, it’s not often they make mistakes and you get easy goals in the 420 or something games I’ve had.’ The Liverpool boss is hopeful his side have put their 5-2 Champions League defeat by Real Madrid behind them and added: ‘We looked a lot more stable today.’ MORE : Jurgen Klopp full of praise for struggling Liverpool stars after Wolves win MORE : Jurgen Klopp hits back at Jamie Carragher over criticism of Liverpool star Virgil van Dijk For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2023-03-03 00:01:00","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Haalandova agentica otvorila karte: ‘Taj klub bi za njega bio zemlja snova. Ima posebnu magiju‘","link":"https://sportske.jutarnji.hr/sn/nogomet/nogomet-medjunarodni/haalandova-agentica-otvorila-karte-taj-klub-bi-za-njega-bio-zemlja-snova-ima-posebnu-magiju-15311633","keywords":["Međunarodni nogomet"],"creator":null,"video_url":null,"description":"Rafaela Pimenta, agentica Erlinga Haalanda, potvrdila je da već naveliko planiraju odlazak norveškog centarfora iz Manchester Cityja, otvorivši vrata transferu \"iz snova\" u Real Madrid. Norvežanin je prošlog ljeta prešao na Etihad u ugovoru vrijednom 60 milijuna eura i uživa u izvrsnoj prvoj sezoni...","content":"Rafaela Pimenta, agentica Erlinga Haalanda, potvrdila je da već naveliko planiraju odlazak norveškog centarfora iz Manchester Cityja, otvorivši vrata transferu \"iz snova\" u Real Madrid. Norvežanin je prošlog ljeta prešao na Etihad u ugovoru vrijednom 60 milijuna eura i uživa u izvrsnoj prvoj sezoni u aktualnom prvaku Premier lige. Haaland je zabio 33 gola u 33 utakmice, od kojih 27 u Premier ligi, što je najveći broj pogodaka igrača Cityja u jednoj sezoni Premier lige ikada. Međutim, dok 22-godišnjak nastavlja rušiti rekorde, njegov je sljedeći potez izgleda već isplaniran, a agentica Pimenta potvrdila je da bi za Haalanda bio san da potpiše za Real Madrid. Govoreći na FT Business of Football summitu u Londonu, rekla je: - Postoji Premier liga. A tu je i Real Madrid. Real Madrid ima nešto svoje što ga čini \"zemljom snova\" za igrače. Madrid održava tu magiju. Ne natječe se u ligi kao što je Premiership, ali zato ima Ligu prvaka. Brazilska odvjetnica koja je preuzela brigu o Haalandu nakon smrti Mina Raiole prošle godine, istaknula je da \"voli planirati karijere igrača\". Potvrdila je da je Haaland želio prijeći u City i raditi s Pepom Guardiolom , te da je Premier liga sada \"atrakcija sama za sebe\", neovisno o klubovima koji se u njoj natječu. - Pokušavamo napraviti plan. Moramo imati cilj. Možda to nećemo postići, ali ako ne znamo kamo idemo, sigurno tamo nećemo stići. Kad imamo igrača, radimo planove. Čak i ako igrač ima samo 15 godina. Kad sam se počela baviti ovim poslom, ako bih igraču rekla ‘dovest ću te u Englesku‘, prva stvar koju bi on rekao bila bi: ‘Što sam krivo napravio? Zašto ti se ne sviđam?‘ Ali sad, kad pitam igrača ‘koji je tvoj cilj?‘, reći će Premier liga. Ne kažu City, Chelsea ili Arsenal nego Premier liga. Ovo je prvi put u 25 godina da čujem da toliko igrača kaže da žele ići u ligu. Engleska je pravo mjesto za agenta. Agent mora biti tamo gdje igrač želi biti. To je fantastična liga. Tako je natjecateljska, svaka utakmica je izazov, svi je žele gledati. Iako je Haaland u Cityju tek od prošlog ljeta, Guardiola je već bio prisiljen demantirati da njegov napadač ima \"klauzulu Real Madrida\" u ugovoru, prema kojoj bi se mogao pridružiti španjolskom divu 2024. godine. Erlingov otac i bivši veznjak Man Cityja Alf-Inge Haaland ranije je također tvrdio da će njegov sin vjerojatno ostati u Engleskoj samo dvije ili tri godine, prije nego što se odluči igrati u drugoj europskoj ligi. Kako god, Haaland očito opasno razmišlja o Real Madridu.","pubDate":"2023-03-03 06:34:23","image_url":"https://static.jutarnji.hr/images/slike/2023/03/03/28103591.jpg","source_id":"jutarnji","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"All Whites: ‘Number of candidates’ in mix as New Zealand Football’s coaching search drags on","link":"https://www.nzherald.co.nz/sport/all-whites-number-of-candidates-in-mix-as-new-zealand-footballs-coaching-search-drags-on/22LHZUNKDBCDZBIXBRDHWBDNKM/","keywords":null,"creator":null,"video_url":null,"description":"NZF boss: It would be ideal if the new person was in place for June, but not imperative.","content":"New Zealand Football would prefer to have a permanent All Whites head coach in place for the June international window – but are keeping an open mind on the timeframe. On Friday NZF announced a glamour match against Sweden in Stockholm on June 16, a rare match against a high-profile Uefa team for the All Whites. But it is still uncertain who will be in charge for that phase, which will feature a second game in Europe. Darren Bazeley has the role on an interim basis for the two home games against China later this month, before NZF will reconvene to discuss their options. NZF chief executive Andrew Pragnell told the Herald they won’t be going back to market, or re-advertising the role, after the extensive pre-Christmas search process to find a successor to Danny Hay. He maintained there are “a number of candidates” in contention and added that CV’s are still coming in, which continues to “put options on the table”. Pragnell declined to go into detail on who could still be in the mix. John Herdman has publicly signalled his intention to remain with Canada, while Des Buckingham has signed a new club deal in India. Wellington Phoenix coach Ufuk Talay indicated he wasn’t interested, after being overlooked initially, in favour of NZF’s preferred candidate (Herdman), which never came to pass. Advertisement Advertise with NZME. ”We need to check [post-March] who is in front of us and weigh up our best options going forward,” said Pragnell. He agreed it would be ideal if the new man was in place for June but said it wasn’t imperative. ”I’d be disappointed if this was drifting into the end of 2023 but the decision on who is more important than the timeframe,” said Pragnell. “Having said that, sooner rather than later is preferable.” Pragnell confirmed that Bazeley is “totally in the mix” for the full-time position. ”It’s a great chance for Darren, who has been in our national team set-ups for a long time, to put his mark on the team,” said Pragnell. “We will be looking at the feedback that comes out of that window, what the environment has been like, how we have gone.” The interview panel, comprised of Pragnell, high performance boss Keir Hansen, board member Jacqui Barron, a PFA representative and two senior players, will have discussions in early April. The Swedish encounter is a coup for NZF. The All Whites haven’t faced European opposition since November 2019, when they played Ireland and Lithuania in the first matches under Hay. Advertisement Advertise with NZME. Before that, New Zealand had only experienced four games against Uefa nations in the previous nine years, when they faced Northern Ireland and Belarus in the lead-up to the 2017 Fifa Confederations Cup, then Russia and Portugal at the main event. World No 23 Sweden missed qualification for the 2022 World Cup, finishing second in their group to Spain, then losing a playoff semifinal to Poland. But they reached the second round of the last European Championships - beaten in extra time by Ukraine - and the quarter-finals of the 2018 World Cup. In that tournament they topped the ‘group of death’ - ahead of Mexico, South Korea and Germany - then beat Switzerland in the round of 16, before falling to England in the last eight. ”We have been chasing top-50 nations and looking to play in Europe more often,” said Pragnell. It has been speculated that Jordan could be the second June opponent – with their national association announcing a match on June 20 – but Pragnell said that was premature. ”We are weighing up a couple of options and they may be in the mix,” said Pragnell. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-03-03 05:30:00","image_url":"https://www.nzherald.co.nz/resizer/36L2RzUaiCFtO_9KOB2YO8dH13A=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/IXSN2E65W4RKF46NXJ25JWVAJU.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Man Utd face Liverpool test, Arsenal back in the groove","link":"https://www.capitalfm.co.ke/sports/2023/03/03/man-utd-face-liverpool-test-arsenal-back-in-the-groove/","keywords":["English Premiership","Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"MANCHESTER, United Kingdom, Mar 3 – Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side […] The post Man Utd face Liverpool test, Arsenal back in the groove appeared first on Capital Sports.","content":"The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment of their League Cup final defeat behind them. Tottenham must bounce back quickly from an FA Cup exit to maintain their advantage over Newcastle and Liverpool in the race for a top-four finish. AFP Sport looks at some of the key talking points ahead of the weekend’s action in the English top flight. Liverpool won both Premier League fixtures against fierce rivals United last season by an aggregate score of 9-0. However, the fortunes of both clubs have dramatically changed over the past 12 months. Fresh from lifting the League Cup to end a six-year wait for silverware, United’s run of one defeat in 22 games has kept them in the hunt for a quadruple of trophies. But with an 11-point gap to leaders Arsenal, anything less than a first win at Anfield since 2016 for Erik ten Hag’s men could signal the end of their title challenge. Liverpool, who lost against United at Old Trafford earlier this season, are in need of the points in their push to finish in the top four. Jurgen Klopp’s men have crept back into contention for a Champions League place thanks to a run of 10 points from their past four league games. But in the middle of that run, the Reds’ deficiencies were brutally exposed in a 5-2 home defeat to Real Madrid in the Champions League. “I think Man United is the team in form in the moment, maybe together with Arsenal and City,” said Klopp after a 2-0 win over Wolves on Wednesday. “If you face United at the weekend whichever result you’ve had before, either way you have to strike back or whatever, but now we have to use it for our general situation. “We have to build on the performance and on the result and we try everything to do exactly that.” Arsenal’s bid for a first league title in 19 years looked to be on shaky ground last month when they took just one point from three games, including a 3-1 home defeat to City. But Mikel Arteta’s side have responded in style with three straight wins to carve out a five-point lead at the top of the table. “When you look at them every single day, you just feel how much they want it, how much they really want to produce what we ask them to do and how much they want to please our people,” said Arteta after Everton were dispatched 4-0 on Wednesday. “I had no doubts that we were going to turn things around in performances and results.” More of the same will be expected from Arsenal against a relegation-threatened Bournemouth side. City face a tougher test on paper with the visit of Newcastle, but there is little for the champions to fear in the Magpies’ form of late. Newcastle have slipped outside the top four after winning just once in the Premier League in 2023 so far. A big week for Tottenham got off to the worst possible start with defeat in their FA fifth-round match against Championship side Sheffield United. Spurs, who have not won a trophy since 2008, have to overturn a 1-0 first-leg deficit when they host AC Milan in the Champions League last 16 next week. But first they have a tricky trip to Molineux to face a Wolves team also desperate for the points to pull away from the relegation zone. “Now, the FA Cup has gone. We have other chances, other competitions, other games,” said Spurs assistant boss Cristian Stellini, who has deputised for Antonio Conte while he recovers from gallbladder surgery. “This is football. You have to keep going and find again the same desire.” Manchester City v Newcastle (3:30pm), Arsenal v Bournemouth, Aston Villa v Crystal Palace, Brighton v West Ham, Chelsea v Leeds, Wolves v Tottenham (all 6pm), Southampton v Leicester (8:30pm) Nottingham Forest v Everton (1400), Liverpool v Manchester United (1630) Brentford v Fulham (2000)","pubDate":"2023-03-03 04:11:46","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Man Utd face Liverpool test, Arsenal back in the groove","link":"https://punchng.com/man-utd-face-liverpool-test-arsenal-back-in-the-groove/","keywords":["Sports"],"creator":["Agency Report"],"video_url":null,"description":"Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment Read More","content":"Rampant Manchester United are eager to inflict more pain on Liverpool at Anfield as Arsenal aim to pull further clear of Manchester City in the Premier League title race this weekend. The Gunners are hot favourites to see off Bournemouth at the Emirates, while City face a Newcastle side hoping to put the bitter disappointment of their League Cup final defeat behind them. Tottenham must bounce back quickly from an FA Cup exit to maintain their advantage over Newcastle and Liverpool in the race for a top-four finish. AFP Sport looks at some of the key talking points ahead of the weekend’s action in the English top flight. – United’s revenge mission – Liverpool won both Premier League fixtures against fierce rivals United last season by an aggregate score of 9-0. However, the fortunes of both clubs have dramatically changed over the past 12 months. Fresh from lifting the League Cup to end a six-year wait for silverware, United’s run of one defeat in 22 games has kept them in the hunt for a quadruple of trophies. But with an 11-point gap to leaders Arsenal, anything less than a first win at Anfield since 2016 for Erik ten Hag’s men could signal the end of their title challenge. Liverpool, who lost against United at Old Trafford earlier this season, are in need of the points in their push to finish in the top four. Jurgen Klopp’s men have crept back into contention for a Champions League place thanks to a run of 10 points from their past four league games. But in the middle of that run, the Reds’ deficiencies were brutally exposed in a 5-2 home defeat to Real Madrid in the Champions League. “I think Man United is the team in form in the moment, maybe together with Arsenal and City,” said Klopp after a 2-0 win over Wolves on Wednesday. “If you face United at the weekend whichever result you’ve had before, either way you have to strike back or whatever, but now we have to use it for our general situation. “We have to build on the performance and on the result and we try everything to do exactly that.” – In-form Arsenal – Arsenal’s bid for a first league title in 19 years looked to be on shaky ground last month when they took just one point from three games, including a 3-1 home defeat to City. But Mikel Arteta’s side have responded in style with three straight wins to carve out a five-point lead at the top of the table. “When you look at them every single day, you just feel how much they want it, how much they really want to produce what we ask them to do and how much they want to please our people,” said Arteta after Everton were dispatched 4-0 on Wednesday. “I had no doubts that we were going to turn things around in performances and results.” Related News Casemiro lists five high quality players in Man Utd Balogun won’t play second fiddle at Arsenal Martinelli stars as leaders Arsenal crush Everton More of the same will be expected from Arsenal against a relegation-threatened Bournemouth side. City face a tougher test on paper with the visit of Newcastle, but there is little for the champions to fear in the Magpies’ form of late. Newcastle have slipped outside the top four after winning just once in the Premier League in 2023 so far. – Sorry start to Spurs’ big week – A big week for Tottenham got off to the worst possible start with defeat in their FA fifth-round match against Championship side Sheffield United. Spurs, who have not won a trophy since 2008, have to overturn a 1-0 first-leg deficit when they host AC Milan in the Champions League last 16 next week. But first they have a tricky trip to Molineux to face a Wolves team also desperate for the points to pull away from the relegation zone. “Now, the FA Cup has gone. We have other chances, other competitions, other games,” said Spurs assistant boss Cristian Stellini, who has deputised for Antonio Conte while he recovers from gallbladder surgery. “This is football. You have to keep going and find again the same desire.” Fixtures (all times GMT) Saturday Manchester City v Newcastle (1230), Arsenal v Bournemouth, Aston Villa v Crystal Palace, Brighton v West Ham, Chelsea v Leeds, Wolves v Tottenham (all 1500), Southampton v Leicester (1730) Sunday Nottingham Forest v Everton (1400), Liverpool v Manchester United (1630) Monday Brentford v Fulham (2000) AFP","pubDate":"2023-03-03 03:38:33","image_url":"https://cdn.punchng.com/wp-content/uploads/2021/09/10210647/Manchester-United.jpg","source_id":"punchng","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Napoli ‘to keep hands on wheel’ as Pogba return boosts Juve","link":"https://www.capitalfm.co.ke/sports/2023/03/03/napoli-to-keep-hands-on-wheel-as-pogba-return-boosts-juve/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"MILAN, Italy, Mar 3 – Napoli coach Luciano Spalletti says his players are drowning out what he sees as premature title chatter despite knowing victory over Lazio on Friday would send them 21 points clear in Serie A. The league leaders have won eight games in a row and 19 of their past 20 in […] The post Napoli ‘to keep hands on wheel’ as Pogba return boosts Juve appeared first on Capital Sports.","content":"The league leaders have won eight games in a row and 19 of their past 20 in the top flight — a run that began with a 2-1 victory away to Lazio on September 3. “We’re not listening to those who want us to take our hands off the wheel and start celebrating, because there are still twists and turns to come,” said Spalletti. “Our fans must take to the field with us and not wait for us at the finish line.” Napoli are closing in on a first Serie A crown since the days of Diego Maradona, who inspired the club to their only two league titles in 1987 and 1990. They have dropped just seven points over 24 games this season and midfielder Eljif Elmas insisted Napoli have no intention of slowing down. “Eighteen points is a big margin but honestly we’re not looking at the table because we want to try to win every game we have left,” Elmas told Radio Kiss Kiss. “We’re playing good football and our aim is to maintain this pace and keep doing what we’re doing because we deserve to be where we are. “We’re not getting carried away and we’re not going to ease up at all.” Lazio are back in the Champions League places following wins over Salernitana and Sampdoria but city rivals Roma, in fifth, will be eager to atone for their shock midweek loss to Cremonese. Roma will be without Jose Mourinho for Saturday’s visit of Juventus after the Portuguese coach was hit with a two-match ban after receiving his third red card of the season against Cremonese. “I’m emotional but not crazy,” said Mourinho. The league said after the match he also “entered the referees’ dressing room without permission and made seriously offensive statements”. “For the first time in my career a referee has spoken to me in an unjustifiable way,” added Mourinho. “To react like that, something must have happened. We need to see if we can do anything from a disciplinary perspective.” AC Milan have recovered from a dreadful start to 2023 by winning their past four games in all competitions without conceding. Stefano Pioli’s side face Fiorentina on Saturday ahead of next week’s second leg against Tottenham in the last 16 of the Champions League, while Inter Milan host Lecce on Sunday. The France midfielder made his first competitive appearance since April as Juventus defeated Torino 4-2 in the Turin derby on Tuesday. Pogba injured his right knee injury during pre-season in July shortly after his return to Juve following six years at Manchester United. The 29-year-old won four Serie A titles in as many seasons during his first spell in Italy, and Juve hope his recovery can help the club make an improbable push for a top-four place following a 15-point deduction for illicit transfer activity. 8 – successive league games in which Victor Osimhen has scored for Napoli. The Nigerian is Serie A’s top scorer this season with 19 goals — six more than nearest rival Lautaro Martinez. 30 – Cremonese’s 2-1 victory over Roma snapped the joint-longest run without a win for a club in Italian top-flight history. Ancona also went 30 Serie A games without winning between 1993 and 2004. Napoli v Lazio (10:45pm) Monza v Empoli (5pm), Atalanta v Udinese (8pm), Fiorentina v AC Milan (10:45pm) Spezia v Hellas Verona (2:30pm), Sampdoria v Salernitana (5pm), Inter Milan v Lecce (8pm), Roma v Juventus (10:45pm) Sassuolo v Cremonese (8:30pm), Torino v Bologna (10:45pm)","pubDate":"2023-03-03 03:38:22","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Gunmen Attack Rosario Supermarket Owned by Lionel Messi's Wife's Family, Leave Threat Note","link":"https://www.news18.com/news/football/gunmen-attack-rosario-supermarket-owned-by-lionel-messis-wifes-family-leave-threat-note-7206793.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country's third-largest city of Rosario, owned by the family of his wife, Antonella Roccuzzo","content":"A supermarket in the Argentine city of Rosario, owned by Lionel Messi’s wife, Antonella Roccuzo’s family, was attacked in the early hours of Friday by two gunmen on a motorcycle. The attackers left a note on cardboard following the open fire that threatened the Argentine icon. It is reported that the dissidents shot at least a dozen rounds of ammunition. The city’s mayor, Pablo Javkin, went to the supermarket and lashed out at federal authorities over what he called their failure to curb a surge in drug-related violence in Rosario, located about 190 miles (300 kilometers) northwest of the capital of Buenos Aires. The message read “Messi, we’re waiting for you. Javkin is also a drug trafficker, so he won’t take care of you.” Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country’s third-largest city of Rosario, owned by the family of his wife. ALSO READ| Copa Del Rey: Barcelona Dig Out First Leg El Clasico Win Over Real Madrid Messi has not commented. Considered by many to be the greatest football player of all time, Messi is revered in Argentina, especially since he led the national team to the country’s first World Cup victory in 36 years in Qatar in December. Messi currently plays for Paris Saint-Germain and spends much of his time overseas, though he often visits Rosario where he has a home in the suburb of Funes. The French team posted a photo on social media of Messi training on Thursday morning. In Rosario, prosecutor Federico Rébola said authorities were reviewing security camera footage and that the investigation was “preliminary.” It was the first time Messi’s in-laws had received this kind of threat, he added. Celia Arena, justice minister for Santa Fe province, where Rosario is located, said the attack amounted to “terrorism” by a “mafia\" group meant to intimidate the broader population. “The aim is to deliberately cause terror in the population and discourage those of us who are fighting against criminal violence, knowing that it will be an event of global significance,” Arena wrote in a social media post. Javkin, a center-left politician in opposition to the ruling Peronist coalition, appeared to throw suspicion of complicity for the attack on both criminal gangs and federal security officials. “I doubt everyone, even those who are supposed to protect us,” Javkin said in an interview with a local radio station. He said that he had recently had “very strong discussions” with members of the federal security forces over the past couple of weeks demanding that they crack down on the city’s crime. “Where are the ones who need to take care of us?” Javkin said. “It’s clear that those who have the weapons and have the possibility of investigating the criminals aren’t doing it, and it’s very easy for any gang to carry out something like this.” The federal government’s Security Minister Aníbal Fernández said drug-related violence was not a recent phenomenon in the city, and that Thursday’s attack was typical of what has happened there “for the last 20 years.” He said the incident was an example of how drug traffickers “have won” in Rosario, but now “we have to reverse that.\" Opposition politicians blamed President Alberto Fernández’s administration for the continuing violence in Rosario. His predecessor, Mauricio Macri, characterized the events as a warning that the country cannot “co-exist” with drug traffickers. Messi, 35, is currently renegotiating a contract with Paris Saint-Germain that ends this year amid speculation that the soccer superstar could decide to end his career playing for one of the local Rosario clubs, Newell’s. Messi, who this week won FIFA’s best men’s player award, could travel to Argentina later this month to join the national squad in playing two friendly matches. One takes place March 23 against Panama in Buenos Aires, while the other one will be five days later against Curacao in the northern city of Santiago del Estero. With Inputs From AP Read all the Latest Sports News here","pubDate":"2023-03-03 02:55:03","image_url":"https://images.news18.com/ibnlive/uploads/2023/02/copy-of-sports-2023-02-19t202656.703-16768186543x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"Shots fired at Messi family store, threatening message left for star","link":"https://www.capitalfm.co.ke/sports/2023/03/03/shots-fired-at-messi-family-store-threatening-message-left-for-star/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"ROSARIO, Argentina, Mar 3 – In the dead of night, two men fired shots at a closed supermarket belonging to the family of Lionel Messi’s wife, before leaving a threatening message on the ground aimed at the seven-time Ballon d’Or winner. “Messi, we’re waiting for you. Javkin is a narco, he won’t take care of […] The post Shots fired at Messi family store, threatening message left for star appeared first on Capital Sports.","content":"“Messi, we’re waiting for you. Javkin is a narco, he won’t take care of you,” said the handwritten message left on the ground by the men who shot 14 bullets into the supermarket’s metallic facade in the early hours of Thursday. Pablo Javkin is the mayor of Messi’s hometown, Rosario, where the supermarket is located, some 320 kilometers northwest of Buenos Aires. Javkin confirmed the supermarket belonged to the family of Antonela Roccuzzo, who shares three children with the football superstar, and said the aim of the attack was to “to create chaos in the city.” “Here, what’s sought is the repercussion, it’s perfidious,” he said. “What story goes more quickly viral in the world than an attack on Messi?” A witness confirmed seeing the two men arrive on a motorbike just before 3:00. One of them got off, fired the shots, dropped the note and they both fled. “This has been going on for some time,” said Javkin. “We have five security forces operating in Rosario yet they can do this because no one is chasing them.” Provincial police assistant chief Ivan Gonzalez told Cadena 3 television station that the message was “not a threat” but rather an attempt to “attract attention.” He said no one was hurt since there was no one on the premises at that hour. The prosecutor in charge of the case, Federico Rebola, told reporters that there had been no previously known threats made against the Roccuzzo family. “We’re concerned, this has a huge repercussion, we have the video images and we’re looking for more cameras,” he said. Rosario is a port city on the Parana river that has gradually become a nerve center for drug trafficking and the most violent city in Argentina, with 287 murders in 2022. The centrist mayor, left-wing governor of Santa Fe state, Omar Perotti, and center-left national government regularly pass on responsibility for counter-narcotics measures and the use of the city’s security forces to each other. At a meeting this week between the municipal, provincial and national security forces, provincial minister Claudio Brilloni said he had “urged the federal forces to greater collaboration, engagement and participation” in the fight against violence and criminality in Rosario. Among the right-wing opposition, two declared candidates for October’s presidential election called for help from the military police to fight drug-trafficking in Rosario. “The situation is complicated in Rosario… the drug traffickers have won,” said Security Minister Anibal Fernandez.","pubDate":"2023-03-03 01:54:05","image_url":null,"source_id":"capitalfm","category":["sports"],"country":["kenya"],"language":"english"},{"title":"Copa Del Rey: Barcelona Dig Out First Leg El Clasico Win Over Real Madrid","link":"https://www.news18.com/news/football/copa-del-rey-barcelona-dig-out-first-leg-el-clasico-win-over-real-madrid-7206547.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Madrid defender Eder Militao deflected a rebound into his own goal after 26 minutes to split the teams and hand Barcelona the edge ahead of the second leg on April 5 at Camp Nou","content":"Eder Militao’s own goal handed a depleted Barcelona a surprise 1-0 away victory over Real Madrid in a stormy Copa del Rey semi-final first leg on Thursday. The Catalans arrived on the back of two consecutive defeats and without an injured trio of key players — top scorer Robert Lewandowski, key midfielder Pedri and explosive winger Ousmane Dembele. ALSO READ| Watch: Martin Odegaard’s Creamy Interception Against Alex Iwobi During Everton Game After their Europa League elimination by Manchester United last week and a first ever loss against La Liga minnows Almeria, Madrid fans smelled blood, but left bitterly frustrated. Militao deflected a rebound into his own goal after 26 minutes to split the teams and hand Barcelona the edge ahead of the second leg on April 5 at Camp Nou. The hosts had more of the ball but failed to muster a shot on target, while Barcelona defended well. “This was the game we wanted to play — not with this result, but it gives us confidence for the second leg,\" Madrid coach Carlo Ancelotti told reporters. “We did not let Barcelona do what they wanted, that’s good for us, and we just have to repeat it (at Camp Nou).\" Asked if Barcelona deserved to win or not, Ancelotti said it was clear his team deserved more. “No, that is obvious, we had chances, but I think that it was one of Madrid’s best games in terms of pressing high,\" added Ancelotti. “It was a bit strange, their way of playing, but they have learned very well, it’s a very solid team defensively.\" Barcelona lined up with Marcos Alonso out of position at centre-back, after Andreas Christensen was only deemed fit enough to start on the bench. Sergio Busquets made his 46th Clasico appearance, overtaking former Real Madrid and Barcelona greats Sergio Ramos and Lionel Messi to set a new record. Despite Barcelona’s seven-point lead over champions Madrid in La Liga, many, including Barca coach Xavi Hernandez, had Madrid as favourites. Los Blancos have not won the trophy since 2014 and pushed Barca back early on, with Benzema scoring a goal ruled out for offside. A handful of Madrid fans had protested outside the Santiago Bernabeu about Barca’s involvement in the “Negreira case\" — the Catalan club paying a former refereeing chief for advice until 2018. The temperature rose considerably when Vinicius Junior was booked midway through the first half for wrestling Frenkie de Jong to the ground. Vinicius remonstrated vociferously with the referee, and Madrid may still have been distracted by the argument moments later when Barcelona took the lead. The goal came against the run of play, created by Ferran Torres, who slipped through Franck Kessie, just onside. Thibaut Courtois saved the Ivorian midfielder’s low shot but the ball rebounded off Militao, into his own net, with Nacho trying and failing to hack it clear. Madrid players and supporters reacted angrily as Barcelona midfielder Gavi got away with smashing into Militao, but the hosts struggled to carve out chances. Barcelona held their lead until the break comfortably, with supporters whistling the officials as they walked towards the tunnel. With Carlo Ancelotti’s side unable to muster a shot on target against an underwhelming Barcelona side, perhaps some of the home supporters’ frustration aimed at the referee was misplaced. Madrid struggled to connect with Benzema, isolated and unable to influence the game. Record Copa winners Barcelona should have doubled their lead with 20 minutes remaining when Torres cut the ball back to Kessie, but his goal-bound shot was blocked by his own team-mate, Ansu Fati. Rodrygo whipped a shot wide for Madrid in the final stages as they remained unable to test Ter Stegen, despite Barcelona’s deficiencies. More traditional roles were reversed as Madrid had more of the ball but Barcelona defended solidly and took the advantage back home. “Today they dominated us with the ball, but there are other aspects in the game, sometimes the opponent forces you to this,\" admitted Xavi. “Madrid can dominate you, it’s hard to get the ball off (Toni) Kroos and (Luka) Modric, but defence is part of the game.\" Read all the Latest Sports News here","pubDate":"2023-03-03 01:50:37","image_url":"https://images.news18.com/ibnlive/uploads/2023/03/copy-of-sports-2023-03-03t071800.096-16778081253x2.jpg","source_id":"news18","category":["sports"],"country":["india"],"language":"english"},{"title":"Why Chelsea are now a mediocre mid-table team, and what they can do to fix it","link":"https://metro.co.uk/2023/03/03/what-chelsea-need-to-do-to-avoid-being-a-mid-table-premier-league-team-18375254/","keywords":["Football","Sport","Chelsea FC","Graham Potter","Metro newspaper"],"creator":["Gavin Brown"],"video_url":null,"description":"The club haven't won in the last six games.","content":"Last weekend football solemnly marked the first anniversary of Russia’s invasion of Ukraine , an act that, on a far more trivial level, set in motion a course of events which led Chelsea to where they find themselves today. Chelsea news, exclusives and analysis Without Vladimir Putin’s murderous willy-waving there would be no Todd Boehly at Stamford Bridge, no monolithic spending spree, probably no Graham Potter and almost certainly no muddled slide into mid-table mediocrity. With Potter winless in six games it has been remarked that Chelsea’s reflex reaction would be to sack the manager, but that Chelsea no longer exist. Roman Abramovich is gone and with him Marina Granovskaia, Petr Cech and much of the behind-the-scenes brains trust which, along with the Russian oligarch’s money, made Chelsea such a consistent fixture at the head of the European game for two decades. New co-owner Boehly has also brought a lot of money, ambition and good intentions, but little evidence so far of anything more concrete beyond. Results on the field are the obvious and fairest barometer of a club’s progress – especially one that has spent so much on players – so it is only natural that when things go badly the scrutiny falls largely on the manager. But Potter is the frontman for a club undergoing tremendous upheaval above and beyond his control. Tottenham coach Antonio Conte recently bemoaned the lack of public profile and accountability afforded to sporting directors in the English game means it falls on managers and coaches to answer for decisions and repercussions over which they have little knowledge or control. It is fair to wonder whether Graham Potter might agree with him. Chelsea’s participation in the January transfer window wasn’t just enthusiastic, it was chaotic and seemingly naive. After Benfica told them Enzo Fernandes would not be sold for less than his huge release clause the Blues played hardball for a month before accepting the inevitable and paying the full fee at the deadline. Mudryk was signed from under Arsenal’s noses without any indication the club’s plan for him expands beyond frustrating a local rival. Both Fernandez and Mudryk will likely prove to be quality signings and will probably not be the only ones. Benoit Badiashile has made an encouraging start and Joao Felix has also shown promise but cannot be considered a long-term building block as the £9million Chelsea paid Atletico Madrid for the forward only covers a six-month loan with no option for a permanent deal. Noni Madueke and David Datro Fofana look more likely to have an impact in the future than right now and Malo Gusto and Andrey Santos have been loaned back out. Chelsea’s hectic window has left Potter with a bloated squad of some 31 first-team players, a situation which has reportedly left the former Brighton boss struggling to conduct meaningful training sessions which keep everyone involved and inevitably left noses out of joint when players don’t make the matchday squad. 'No way!' - Darren Bent tells Chelsea star he wouldn't get in the Arsenal team Arsenal believe Jack Wilshere will convince key target to snub Chelsea and Man Utd Chelsea face deadline to avoid paying £97million release clause for World Cup star The manager’s desire to keep everyone happy and involved has at times also appeared to have an influence on selection with impossible-to-predict recent Chelsea teams featuring countless changes in personnel, formation and tactics. Six changes were made for Sunday’s listless loss at Tottenham. In truth Potter’s squad rotation – a throwback to the Tinkerman era of former Chelsea boss Claudio Ranieri – is more about finding balanced and successful solutions than keeping everybody happy but there is a sense the manager should be more ruthless. Throughout his management career with Ostersund, Swansea and Brighton Potter has shown huge ability to build a team and an ethos, and it is the 47-year-old’s credentials as a ‘project builder’ which attracted Boehly in his search for the right coach to shape his new Chelsea. But football, as the old truism goes, is about results and Potter’s Chelsea are reaching the stage of needing a few good ones, whatever it takes to achieve them. If that means upsetting a few big names old or new then so be it. It’s time for the man with the long-term vision to apply some short-term focus, settle on a team he trusts and grind out a few wins. If Pierre-Emerick Aubameyang has to be called in from the naughty step to help achieve that, then so be it. To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video A settled side might also force players to take responsibility. In recent years Chelsea have become a team that lack leadership and with the line-up chopping and changing every week it is easier still for players to pass the buck for individual mistakes, collective failings and defeats. Raheem Sterling has captained England, Mason Mount and Reece James have both played well over 100 games for the club. It is time for them to set the standards for others and ensure they are met. Arsenal boss Mikel Arteta and Thomas Frank have both offered words of support for Potter this week. It’s normal for rival managers to rally around when one of their own is under threat but their comments had more than the ring of hollow platitudes about them. ‘(Graham is) a very good coach and it’s proven that he can do a good job,’ Frank told the BBC. ‘A good coach can work at every club. It’s just sometimes the circumstances create an environment where it’s difficult to get everything to just click. ‘There’s a lot of new players (at Chelsea), the team isn’t in sync, trying to find the right balance. A lot of players have been in and out [of the team]. Graham is searching for a solution and I’m convinced, over time, he will find that solution.’ Graham Potter is clearly a decent man who does what he thinks is best for long-term future of the club but winning games matters too and so does saving his job. There is still time. MORE : Liverpool increasingly confident of signing Chelsea star Mason Mount MORE : Man Utd, Arsenal and Chelsea identify new target as they consider summer bids for Southampton star Romeo Lavia For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2023-03-03 00:01:00","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Virgil van Dijk happy to put body on the line for Liverpool","link":"https://metro.co.uk/2023/03/03/virgil-van-dijk-happy-to-put-body-on-the-line-for-liverpool-18377800/","keywords":["Football","Sport","Liverpool FC","Metro newspaper","Virgil van Dijk"],"creator":["John Payne"],"video_url":null,"description":"'I want to be influential for this club but it caught up with me, unfortunately.'","content":"Virgil van Dijk has spoken of the sacrifices he is making to help Liverpool finish in the top four after admitting he has played too much across the last two seasons. The Netherlands captain, who got the opening goal in Wednesday’s 2-0 win over Wolves, has played the full 90 minutes in each of his four games since a rare seven-match absence with a hamstring injury. Van Dijk hardly takes a break when he is available for Jurgen Klopp ’s side and, although his form has dipped at times this season, he goes into Sunday’s crunch meeting with Manchester United expecting no let-up for the rest of the campaign. ‘We play every three to four days so what you have to do is sacrifice quite a bit,’ said the 31-year-old. ‘I would love to spend time with my family and my kids. ‘But obviously I need to get treatment every day, make sure I’m eating the right stuff and doing the right things in order to be ready for the next game. ‘That’s the life we live and we are very privileged and I really acknowledge that but you still have to make these sacrifices. That’s what’s going on behind the scenes.’ Upon returning from cruciate knee surgery last season, Van Dijk played the full 90 minutes for 49 consecutive matches before being substituted in the FA Cup final when Liverpool beat Chelsea on penalties. The Netherlands star, who also played every minute of 21 of his side’s 22 games before this season’s World Cup, added: ‘Obviously I came back from quite a complex injury that I had two years ago now. ‘That takes treatment, that takes time, it takes adaptation. That’s the way I have to handle myself. I played all the Premier League games because I want to be out there. ‘What caught up is I played too many games at a time. Gunmen threaten Lionel Messi and shoot up family-owned supermarket Carlo Ancelotti calls Barcelona's tactics 'strange' after Real Madrid's defeat Barcelona blocked from signing new players this summer by La Liga ‘I could have thought before the World Cup, “let’s rest a little bit”. But I didn’t because I want to be influential for this football club but it caught up with me, unfortunately. I’m not a robot and I think having the World Cup and then doing nothing for a week and coming back it was maybe not the right decision.’ Three wins and a draw in their last four games have left Liverpool six points adrift of the top four but Van Dijk accepts his attempts to secure a place in next season’s Champions League will take its toll. ‘You try to hit consistency and try to build up momentum,’ he said. ‘Coming back after being six weeks out, playing four games of 90 minutes in such a short space of time, I need time. Sometimes people will take it for granted and see it as normal but it isn’t.’ Liverpool’s Jurgen Klopp is ready to take on Manchester United this weekend (Picture: Getty) Jurgen Klopp has warned Manchester United his side will give them a ‘big fight’ on Sunday. The Reds beat Wolves 2-0 on Wednesday thanks to goals from Virgil van Dijk and Mohamed Salah. United, who won the Carabao Cup on Sunday and are still able to achieve a quadruple this term, are looking to do the double over their rivals after August’s 2-1 win at Old Trafford. But Klopp said: ‘It’s a big game against a team in form. We have to be ready, and we will give them a big fight. ‘You have to break an opponent down step by step, it’s not often they make mistakes and you get easy goals in the 420 or something games I’ve had.’ The Liverpool boss is hopeful his side have put their 5-2 Champions League defeat by Real Madrid behind them and added: ‘We looked a lot more stable today.’ MORE : Jurgen Klopp full of praise for struggling Liverpool stars after Wolves win MORE : Jurgen Klopp hits back at Jamie Carragher over criticism of Liverpool star Virgil van Dijk For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2023-03-03 00:01:00","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"}]}