{"newsArray":[{"article_id":"c7b35fc6ecd007a5727a0e525e0163d4","title":"Who is Sam Allison, first black Premier League referee in 15 years? Career, stats and more","link":"https://www.hitc.com/en-gb/2023/12/15/who-is-sam-allison-first-black-premier-league-referee-career-stats/","keywords":["Football","Luton Town","Premier League","Sheffield United"],"creator":["Gary Kirkpatrick"],"video_url":null,"description":"The Premier League and the Professional Game Match Officials Limited (PGMOL) have announced that referee Sam Allison will officiate an English top-flight match game. Why... The post Who is Sam Allison, first black Premier League referee in 15 years? Career, stats and more appeared first on HITC.","content":"Why is this significant? Well, Allison will become the first black referee in 15 years to take charge of a fixture. Uriah Rennie – who spent 11 years as a Premier League whistler – was the last black official to referee a Premier League game and that came in 2008. The introduction of Allison to the Premier League’s refereeing contingent in 2023/24 marks a positive step forward for the division from an inclusivity perspective. So who is Sam Allison? We provide you with a comprehensive profile below including details on his career as an official, his stats and more. Born in England, 42-year-old Sam Allison is a professional football referee. He has for the first time when he acts as the man in the middle for home clash with on Boxing Day. Allison played at the highest non-league level as a footballer after spells with , Bristol City, Swindon Town and Exeter City. His attentions then turned to refereeing but juggled those duties with being a professional firefighter. But soon, Allison would focus all of his energy into full-time refereeing and joined the roster in 2020. There, he would become just the third black whistler in the league’s history. Allison won’t be involved in a Premier League for the first time come December 26, as he was appointed fourth official for Brighton’s home game with Chelsea in October 2022. Allison has always had ambitions of reaching the top level of refereeing in English football. He told the in March 2023: “I love football so much; it’s in my blood and it’s innate. I’d do anything to be involved in the game. Unfortunately, I didn’t reach the pinnacles as a football player but hopefully one day I can do it as a referee.” Sam Allison is a member of the Select Group 2. As part of the group, Allison largely officiates EFL matches and occasionally in League One and Two. Allison rose up the leagues and eventually took charge of EFL Championship games come the 2023/24 campaign. He will be very new to the pressures of the Premier League but is still adapting to being an official in the second tier of English football. These are Sam Allison’s referee stats as per . He has officiated in the EFL Championship, League One, League Two, FA Cup, EFL Cup, National League, Premier League 2, EFL Trophy and FA Youth Cup.","pubDate":"2023-12-15 12:19:21","image_url":"https://www.hitc.com/static/uploads/2023/12/GettyImages-1251400641-scaled-e1702642732868-1024x341.jpg","source_id":"hitc","source_priority":768,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7f9115552734abd9d35bd54da7e91740","title":"Steven Alzate (Standard) veut de la stabilité : “Mais Brighton a une option pour me rappeler en janvier”","link":"https://www.dhnet.be/sports/football/division-1a/standard/2023/12/15/steven-alzate-standard-veut-de-la-stabilite-mais-brighton-a-une-option-pour-me-rappeler-en-janvier-Z3SOTEHA7VBDRHNRAGA4ZRSJBY/","keywords":["Standard"],"creator":["Maxime Jacques"],"video_url":null,"description":"Prêté au Standard, où il se sent bien, Steven Alzate a envie de stabilité. Mais il n’a pas les cartes en main. ...","content":"Copier, coller. Cela fait deux saisons que Steven Alzate est prêté au Standard par Brighton lors du dernier jour du mercato. Et même dans les dernières minutes. Et cela fait aussi deux saisons que l’international colombien s’impose comme un élément essentiel du dispositif liégeois. Son assist face à Anderlecht, dimanche dernier, l’a encore rappelé. Mais à l’image de l’équipe, Alzate connaît des hauts et des bas ces dernières semaines. “ Si je dois comparer mon niveau par rapport à celui de la saison dernière, je dirais qu’il est assez similaire. Mais notre style de jeu a changé et on voit peut-être un peu moins mes qualités , explique-t-il avec honnêteté. L’an passé, on avait déjà cette instabilité mais je pense qu’on va dans la bonne direction. Quand je suis arrivé, au début du mois de septembre de cette saison, l’équipe était dans le fond du tableau. Désormais, on est à quelques points (NDLR : six) du top 6. Je suis donc content d’avoir pu aider l’équipe à s’améliorer.” guillement Anderlecht est un plus gros rival que Charleroi. Au fil des matchs qu’il a joués sous la vareuse liégeoise, le joueur de 25 ans a également pu goûter à l’ambiance particulière des matchs face à Anderlecht et à Charleroi. Des chocs qui s’enchaînent, en ce moment. Après deux Clasicos en quatre jours, place au choc wallon face aux Zèbres. Pour son plus grand plaisir. “ On sait que la rivalité avec ces deux clubs est grande et que les supporters attendent impatiemment ces matchs. Les gagner, cela représente vraiment quelque chose. Il y a probablement un peu plus d’excitation et de tension quand on joue face à Anderlecht mais Charleroi est un club qu’on veut absolument battre, ce samedi. C’est d’autant plus important pour rester dans la course aux playoffs 1.” À lire aussi Pourquoi le Standard a fait de Charleroi son adversaire préféré Pas de discussion avec Brighton… pour le moment Les playoffs 1, Steven Alzate espère jouer pour la première fois. Mais cela passera par des victoires et par… le fait qu’il reste à Sclessin en janvier. “ J’ai une clause de rappel dans mon prêt, explique-t-il. Pour le moment, il n’y a eu aucune discussion dans le sens d’un retour à Brighton cet hiver mais je n’ai pas toutes les cartes en main.” C’est d’ailleurs sa réalité depuis quelques mois. Entre ses prêts et ses retours en Angleterre, le Colombien est constamment en transit. Et il ne le cache pas : il aimerait mettre un terme à ces allers-retours. “ C’est un peu embêtant, avoue-t-il. J’ai envie de m’installer quelque part car pour un joueur, c’est toujours plus confortable.” Cela pourrait-il être à Liège ? Financièrement, cela semble compliqué puisque le joueur – sous contrat avec Brighon jusqu’en juin 2025 – est évalué à environ 5 millions d’euros. Une somme que le Standard est incapable de dépenser en ce moment. Mais cela n’empêche pas le numéro 17 liégeois d’apprécier son expérience principautaire. “Je suis bien ici et je ne me sens pas comme un joueur en prêt. C’est ma deuxième saison au Standard et je sens que j’ai le support de tout le monde.” À lire aussi Steven Alzate : “Sans cette connexion particulière établie la saison dernière, je ne serais pas revenu au Standard” Hoefkens voudrait “le garder cinq ans” Au premier rang dans la tribune des fans d’Alzate, il y a Carl Hoefkens, qui a titularisé le Colombien à dix reprises en championnat depuis que le médian est revenu à Sclessin. Un peu à l’image de Ronny Deila la saison dernière, l’actuel entraîneur des Rouches pose le nom du natif de Londres en premier sur la feuille du match. La seule fois où Alzate n’était pas sur le terrain, c’était d’ailleurs parce qu’il était suspendu (face à Westerlo, après avoir été exclu lors de son premier match à Eupen). Lorsqu’on a précisé au coach rouche que son joueur avait évoqué spontanément sa clause de rappel dès janvier, Hoefkens en a profité pour rappeler à quel point il était satisfait de son joueur. “On sait qu’un joueur de sa qualité peut être rappelé à tout moment mais pour le moment, rien ne l’indique. On verra le futur , indique le T1 du Matricule 16. S i cela ne tenait qu’à moi, je le garderais dans l’équipe pour les cinq prochaines années.” Mais entre vouloir et pouvoir, il y a parfois un fossé. Décrassage 11/12/2023 - Hoefkens a-t-il trouvé la formule magique pour le top 6 ? Pour accéder à cet article, veuillez vous connecter au réseau internet.","pubDate":"2023-12-15 12:18:32","image_url":null,"source_id":"dhnet","source_priority":337210,"country":["belgium"],"category":["sports"],"language":"french"},{"article_id":"00e896ced0c5e50f1437afc6e5868d77","title":"Où regarder Ukraine - Belgique (Futsal) en live ? Les directs sport à la télé ce vendredi 15 décembre en Belgique","link":"https://www.dhnet.be/sports/omnisports/2023/12/15/ou-regarder-ukraine-belgique-futsal-en-live-les-directs-sport-a-la-tele-ce-vendredi-15-decembre-en-belgique-E7WZXZYTIFG5HKMT7OSJJ4ZIWY/","keywords":["Autres sports"],"creator":["Bruno Verscheure"],"video_url":null,"description":"À quelle heure et sur quelle chaîne voir en direct les événements sportifs aujourd’hui depuis la Belgique ? Les matchs de football en live, le cyclisme en direct à la TV, le tennis en direct, le basket-ball, le hockey… ...","content":"Football 18h30 Schalke 04 – Greuther Fürth Eleven Sports 1 20h00 Dender – Liège Eleven 2 20h00 Zulte Waregem – Seraing Eleven 3 20h45 Westerlo – Eupen Eleven 1 20h45 Genoa – Juventus Eleven Sports 2 21h00 Monaco – Lyon Eleven Sports 1 21h00 Nottingham Forest – Tottenham VOOsport World 1 23h35 Eredivisie Holland 1 Basket-ball 20h30 Limburg United – Charleroi Pickx+ Sports 1, VOOsport World 3 20h30 Euroligue : Barcelone – Armani Milan VOOsport World 2 01h30 San Antonio Spurs – LA Lakers Eleven Sports 1 Biathlon 14h10 Coupe du monde à Leinzerheide Eurosport, ZDF Combiné nordique 10h20 Coupe du monde à Ramsau Eurosport 13h45 Coupe du monde à Ramsau Eurosport Fléchettes 20h00 Championnats du monde de darts VTM 2 Futsal 18h00 Ukraine – Belgique Pickx+ Sports 1 Golf 09h35 Mauritius Open VOOsport World 1 Saut à skis 15h35 Coupe du monde à Engelberg Eurosport Ski alpin 11h30 Super-G messieurs à Val Gardena Eurosport Ski de fond 09h55 Coupe du monde à Trondheim Eurosport 2 12h15 Coupe du monde à Trondheim Eurosport 2 Ski freestyle 20h50 Coupe du monde à Copper Mountain Eurosport 2 Snooker 14h15 Open d’Ecosse Eurosport 2 20h00 Open d’Ecosse Eurosport Snowboard 18h00 Coupe du monde à Copper Mountain Eurosport Vous ne savez jamais sur quelle chaîne regarder la course ou le match du moment en direct ? Vous êtes fans de sport, du foot au basket en passant par le cyclisme ? Notre programme TV vous informe de l’horaire du match en direct, ainsi que la chaîne de télévision sur laquelle il est diffusé. De cette manière, vous ne manquez plus aucun direct de vos événements sportifs préférés.","pubDate":"2023-12-15 12:18:06","image_url":null,"source_id":"dhnet","source_priority":337210,"country":["belgium"],"category":["sports"],"language":"french"},{"article_id":"3752251a1b5c157455b35d46d258728b","title":"Dortmund-PSG : Christophe Dugarry dégomme Kylian Mbappé","link":"https://www.lefigaro.fr/sports/football/ligue-des-champions/dortmund-psg-christophe-dugarry-degomme-kylian-mbappe-20231215","keywords":["Ligue des champions"],"creator":null,"video_url":null,"description":"Agacé en fin de match face à Dortmund, Kylian Mbappé n’a pas trouvé le chemin des filets mercredi soir en Ligue des champions. Une performance qui n’a pas été du goût de Christophe Dugarry.","content":"Le match nul (1-1) entre le Borussia Dortmund et le PSG a eu le don de frustrer Kylian Mbappé , pas en réussite mercredi soir dans la Ruhr. La star parisienne a paru agacée à l’issue de la rencontre malgré la qualification du club de la capitale en hutièmes de finale de la Ligue des champions . Une attitude qui n’a (clairement) pas été du goût du champion du monde 1998 avec l’équipe de France Christophe Dugarry qui a dégommé «KM». «Je lui reproche son attitude. Il se savait attendu, il devait être le leader de cette équipe. (…) Il ne se sent concerné par aucune tâche défensive. Il ne fait aucun effort quand un défenseur passe à trois-quatre mètres de lui. (…) L'exemplarité est capitale dans ce genre de match. J'ai vu un Mbappé passif. Il n'a harangué ses coéquipiers qu'à la fin. Il aurait dû le faire avant. Je ne l'ai pas vu faire le pressing sur Sule et Hummels. J'ai été très, très déçu de son comportement. Je pensais même qu'il allait surjouer. Mais non, il a subi tout le match. (…) Un leader doit montrer l'exemple et se sentir concerné. J'ai le souvenir de Zizou. Quand tu le voyais faire autant d'efforts, tu étais obligé de te bouger. Zizou était un collectif, lui est un individualiste» , a déclaré Dugarry à RMC Sport .","pubDate":"2023-12-15 12:17:18","image_url":"https://i.f1g.fr/media/cms/2365x1330_crop/2023/12/15/eb4c06c9a1dbedad3be666cb1a438e8e492cd6245f3c205ada60ed7b1ea9f23a.jpg","source_id":"lefigaro","source_priority":17866,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"40e7120c4d4476e8b048e964909cd620","title":"Mourinho-Marcenaro, arrivata la sanzione per il portoghese: è ufficiale","link":"https://www.areanapoli.it/varie/mourinho-marcenaro-arrivata-la-sanzione-per-il-portoghese-e-ufficiale_528563.html","keywords":["Varie"],"creator":["AreaNapoli.it"],"video_url":null,"description":"E' arrivata la sanzione per Josè Mourinho per le parole sull'arbitro Marcenaro, il comunicato dell'AS Roma ha chiarito la posizione.","content":"Jose Mourinho ha ricevuto ufficialmente la sanzione per le parole sull'arbitro Marcenaro , in seguito alle dichiarazioni prima della partita tra la sua Roma e il Sassuolo. Ecco il comunicato ufficiale della Roma: \" L’AS Roma, rappresentata dal suo CEO e dal suo Football General Manager, unitamente al proprio responsabile tecnico, José Mourinho, a seguito delle dichiarazioni dello stesso allenatore nel pre-partita della gara Sassuolo-Roma, e successivamente all’apertura del procedimento conseguente da parte della Procura Federale FIGC, comunicano di aver definito un accordo ex art. 126 del Codice di Giustizia Sportiva FIGC\". \" L’AS Roma e il proprio allenatore si riportano alle dichiarazioni espresse sia dal Direttore Tiago Pinto, che dal responsabile tecnico Mourinho, successivamente all’apertura del procedimento della PF FIGC, ribadendo il massimo rispetto e la massima collaborazione verso le Istituzioni Federali e l’AIA. Proprio in linea con questa condotta collaborativa, e per il rispetto e la fiducia del Club nei confronti delle Istituzioni arbitrali e della FIGC, l’AS Roma e l’allenatore, aderendo convintamente alla valutazione del Procuratore Federale, accettano su basi consensuali la comminatoria di una sanzione pecuniaria (di 20.000 euro, ndr.) che sarà integralmente devoluta in favore dell'Associazione Italiana Leucemie (AIL), ente che opera per nobili finalità benefiche in concreto aiuto dei più bisognosi\" . Ha concluso la nota ufficiale della Roma.","pubDate":"2023-12-15 12:15:00","image_url":"https://cdn.areanapoli.it/immagini/notizie/big/m/mourinho_jose_roma_6.jpg","source_id":"areanapoli","source_priority":714118,"country":["italy"],"category":["sports"],"language":"italian"},{"article_id":"567f15840ea27c0018f9f5df351fc855","title":"Philippe Clement told Rangers record before arrival means NOTHING now as Celtic icon stews over lost spark","link":"https://www.dailyrecord.co.uk/sport/football/football-news/philippe-clement-told-rangers-record-31681012","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ross Pilcher)"],"video_url":null,"description":"Paul Lambert reckons defeat at Parkhead this month will leave Rangers with too much to do in the title race.","content":"Philippe Clement watches on Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Paul Lambert has told Philippe Clement his experience on the continent will mean NOTHING when he takes Rangers to Parkhead. Celtic host their rivals on December 30 and the gap at the top of the Scottish Premiership could be closing in on their rivals if they defeat St Johnstone in one of their games in hand. It will be the Belgian's first taste of the red hot Old Firm fixture and it could be a pivotal one if the Light Blues can leapfrog their rivals to go top. However, Lambert reckons the knowhow this Celtic squad and Brendan Rodgers have for just the type of occasion gives them the edge and that victory would put them out in front when it comes to motoring on and claiming the Premiership crown. And he can't see Rangers recovering from a second successive derby defeat after losing 1-0 to a depleted Celtic side back in September. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Scott Brown makes astonishing Celtic season ticket claim as he insists they’re OVER performing in Champions League “It'll be very difficult to claw the title-fight back if they lose the next Old Firm game.,\" Lambert told Betway . \"This will be Philippe Clement's first experience of the Old Firm, whereas Brendan and the Celtic players know all about it. “There will also be a ban on Rangers fans - something that's crazy to me as fans are such a big part of the rivalry. We saw the same thing happen at Ibrox back in May - and I think that was terrible, too. “Clement is walking into a game where his international experience means nothing. This game is different from any other because of what it stands for. If Celtic win, I think they're in the drivers' seat. If Rangers get a result, then the title race will be back on. However, I still think Celtic are favourites as they're at home.” Celtic claimed a first home win in the Champions League for a decade in midweek. And having experienced first hand how helpful home form can be in making it out of the group with Dortmund, Lambert has urged the Hoops to get it right in their own backyard in order to give themselves a fighting chance. “I played at Celtic, and the key in the Champions League is the home form,\" he said. \"We finished on nine points in the Champions League group stages a few times, but we still couldn't get through. Six points are sometimes enough, yet we got nine and didn't make it to the next round! Gustaf Lagerbielke scores to make it 2-1 “We couldn't seem to get a point away from home. When I won the Champions League with Dortmund, we finished second in our group and we had 13 points, which was incredible! “Celtic are a different animal at home. The atmosphere at Celtic Park is unmatched and they'll be a match for most teams there. They need to make sure they win their home games and see what happens on their travels. “They should have beaten Lazio at Celtic Park and they have to win against Feyenoord just to end the campaign on a high. The 2-2 game against Atletico was incredible and most teams would have taken that result. “I was at the Lazio game, and that could have gone either way in Rome. They shouldn't have lost the home leg, and perhaps they wouldn't have if they had better game management and experience. “Celtic are doing their best with the finances they have. Any team who visits them finds it tough, but they need to start picking up points away from home. They'll be in with a shout of qualification if they do.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Champions League Paul Lambert Celtic FC Rangers FC Philippe Clement Brendan Rodgers Borussia Dortmund Scottish Premiership","pubDate":"2023-12-15 12:12:53","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31677875.ece/ALTERNATES/s615/0_JS319572699.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c9c49fa91549d3688ed04d02bf7be13d","title":"Europa League : Amoura avec Lukaku en pointe","link":"https://www.dzfoot.com/verts-deurope/europa-league-amoura-avec-lukaku-en-pointe-251480.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Verts du Monde"],"creator":["Salim D"],"video_url":null,"description":"Auteur d'une performance XXL face à Liverpool, Mohamed Amoura fait partie de l'équipe de la semaine en Europa League établie par Sofascore. L'attaquant algérien qui a obtenu une note de 9,3 se retrouve aux côtés de Lukaku à la pointe du onze le plus performant de la semaine. Buteur et passeur, Amoura s'est procuré trois […] The post Europa League : Amoura avec Lukaku en pointe appeared first on Football Algérien - DZFOOT.COM.","content":"Auteur d'une performance XXL face à Liverpool, Mohamed Amoura fait partie de l'équipe de la semaine en Europa League établie par Sofascore. L'attaquant algérien qui a obtenu une note de 9,3 se retrouve aux côtés de Lukaku à la pointe du onze le plus performant de la semaine. Buteur et passeur , Amoura s'est procuré trois occasions franches et a offert en plus de sa passe décisive deux autres ballons clé à ses coéquipiers. En plus de ses performances offensives, il a été très bon dans les duels au sol. 🌍 | Team of the Week This attacking-minded TOTW is a result of six blue ratings on the final day of the 2023/24 UEFA Europa League group stage! 🤯 Among a host of truly brilliant performances, one still slightly stands out – Kostas Fortounis is our #UEL Player of the Week. 🏅 pic.twitter.com/gSMZogNyi9 — Sofascore (@SofascoreINT) December 15, 2023 DZfoot","pubDate":"2023-12-15 12:10:56","image_url":null,"source_id":"dzfoot","source_priority":291587,"country":["algeria"],"category":["sports"],"language":"french"},{"article_id":"c63549904045dad36dba662f6c75fedc","title":"Mercato - OL : Un flop déjà sur le départ ?","link":"https://le10sport.com/football/mercato/mercato-un-flop-de-lol-deja-sur-le-depart-675612","keywords":null,"creator":null,"video_url":null,"description":"Arrivé à l'OL en provenance de Botafogo au mois de janvier dernier, Jeffinho peine à trouver sa place au sein de l'effectif rhodanien. En cruel manque de temps de jeu à Lyon, le Brésilien ne serait…","content":"Arrivé à l'OL en provenance de Botafogo au mois de janvier dernier, Jeffinho peine à trouver sa place au sein de l'effectif rhodanien. En cruel manque de temps de jeu à Lyon, le Brésilien ne serait pas contre un retour au pays. En effet, selon le média local Globo, le club basé à Rio de Janeiro envisage de faire revenir l'attaquant brésilien au prochain mercato hivernal. Dernier de Ligue 1 après 15 journées, l' OL est toujours en crise. Si le club rhodanien a quelque peu retrouvé des couleurs après sa large victoire contre Toulouse dimanche dernier (3-0), Lyon est toujours dans le besoin de se renforcer à l'approche du mercato hivernal. Mais en parallèle, l' Olympique Lyonnais compte aussi se montrer actif au niveau des ventes cet hiver. L'OL s'enflamme pour le retour de sa star https://t.co/nMHTqxCg6y pic.twitter.com/qBWKGQ1g7g En effet, selon les dernières informations du média brésilien Globo , Botafogo envisage de faire revenir Jeffinho . Le club brésilien, qui appartient à la galaxie Eagle Football de John Textor , aurait pris des contacts avec l'attaquant lyonnais en vue d'un retour en janvier. Pour l'heure, il n'y aurait pas d'offre concrète, mais le principal concerné ne serait pas contre un retour au pays, notamment pour disputer la Copa Libertadores 2024. Débarqué sur les bords du Rhône au mois de janvier dernier contre un chèque de 10 millions d'euros, Jeffinho n'a jamais réussi à convaincre les dirigeants lyonnais, n'inscrivant que deux petits buts en 19 matchs.","pubDate":"2023-12-15 12:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/229240.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"992d164c96a54ac3d4fadbb7e6583e37","title":"Oliveira: \"Napoli in grandissima difficoltà. Cagliari al Maradona per non perdere\"","link":"https://www.areanapoli.it/interviste/oliveira-napoli-in-grandissima-difficolta-cagliari-al-maradona-per-non-perdere_528562.html","keywords":["Interviste"],"creator":["AreaNapoli.it"],"video_url":null,"description":"L'ex bomber dei sardi ha analizzato la partita di domani, quando la squadra di Ranieri affronterà gli azzurri a Fuorigrotta.","content":"Lulu Oliveira , ex calciatore del Cagliari, ha parlato a 1 Football Club , programma in onda su 1 Station Radio. \"Cosa manca al Cagliari per trovare continuità? Da quel che ho visto nelle ultime partite, al Cagliari manca il gioco. È una squadra che fatica tantissimo a giocare un calcio più aperto. Soprattutto, i ragazzi di quest’anno non hanno ancora l’esperienza della massima serie. Sono tutti ragazzi che arrivano dalla Serie B. Ranieri sta facendo bene? Lo conosco, mi ha allenato a Firenze. È un tecnico che cerca soprattutto di motivare i suoi calciatori e, soprattutto, c’è sempre nei momenti difficili, come un padre. Cerca sempre di parlare con tutti, un allenatore grintoso che, alla sua età, ha ancora voglia di dimostrare il proprio valore. Faccio un esempio, quando mi dissero che sarebbe venuto a Cagliari non ci credevo. Oggi, però, è amato da tutti. E’ anche lui l’artefice di quei recuperi nel finale”. \"Che difficoltà possono trovare i calciatori del Napoli domani? C’è questa rivalità tra tifosi azzurri e cagliaritani, ma in questo momento sarà fondamentale non perdere. Il Cagliari è una squadra in salute che arriverà al Maradona per vincere”. \"Perché Kvara non riesce a segnare? La gente - è l'invito di Oliveira ai supporter campani - deve lasciare da parte quanto successo lo scorso anno. Il calcio è fatto così, ci sono momenti belli ed altri meno belli. Il Napoli ha avuto un allenatore che ha dato tutto e ha vinto. Il cambio tecnico, però, credo sia stato un po’ affrettato. Si sarebbe potuta trovare una soluzione, un tecnico così importante non può andare via in questo modo. Il Napoli, dunque, ha perso tantissimo\". \"Vedere gli azzurri era uno spettacolo. In questo momento, è una squadra in grandissima difficoltà ma sono sicuro che abbia le potenzialità di uscire da questo momento di difficoltà, così come il talento georgiano”.","pubDate":"2023-12-15 12:10:00","image_url":"https://cdn.areanapoli.it/immagini/notizie/big/o/oliveira_luis.jpg","source_id":"areanapoli","source_priority":714118,"country":["italy"],"category":["sports"],"language":"italian"},{"article_id":"36271a25e4622dd78b238d0384fbc861","title":"Ange Postecoglou not the only Tottenham manager playing exciting new brand of football as Molly Bartrip raves about Women’s boss Robert Vilahamn","link":"https://talksport.com/football/1678567/tottenham-women-ange-postecoglou-robert-vilahamn/","keywords":["Football","Premier League","Women's Super League"],"creator":["Uma Gurav"],"video_url":null,"description":null,"content":"Tottenham’s Molly Bartrip believes there are plenty of similarities between Ange Postecoglou and Robert Vilahamn, as the north London side eye a Champions League finish this season. Vilahamn was appointed as Tottenham Women’s new head coach shortly after Postecoglou’s arrival in and the Swede told talkSPORT in the summer about how he was trying to replicate the Australian’s style of play in his new role. It has certainly had the desired effect as Spurs have been one of the stories of the Women’s Super League (WSL) season, winning plaudits for their attractive brand of football. Despite recent heavy defeats to Manchester City and Manchester United, there is still plenty to be excited about for Spurs – who sit in sixth place in the table - and Bartrip says Vilahamn has given belief to the squad after an underwhelming season last year. Speaking exclusively to talkSPORT, Bartrip said: “There are similarities [between Vilahamn and Postecoglou]. I think you can see very clearly that there are. They want to play a way and they’re going to play a way where it doesn’t matter who the opposition is. “We’re going to play the Tottenham way and in the next few years, you’re going to see it be successful because that’s what the club wants. “So, in that way, it’s actually a really refreshing thing to be a part of [because] you know that this is the way we want to play and you just have to adapt to it. I’m lucky that I think this style suits me a lot, but at the same time, I think it’s really important that as footballers, you have to be adaptable. “The biggest thing Robert’s brought to us is just to be brave and I think that comes on the pitch [and] off the pitch [and] it puts people out of their comfort zone and I don’t think a lot of people are used to it. “He’s given me a lot of confidence. I am a confidence player – I’m not going to shy away from that – and he’s believed in all of us I think and it’s not easy to be a manager of 26 players. “He is definitely a manager you want to play for. He’s actually a really funny guy, too, and I think it helps when sometimes, you feel like they’re a real human and you can talk to them about other things that doesn’t even involve football. To be able to connect in that way is so important.” Bartrip has excelled this season for Spurs and worn the captain’s armband in Bethany England’s absence, with the Lionesses forward missing most of the season through injury. The centre-back’s performances have impressed her manager, with Vilahamn touting Bartrip for a future England call-up, and representing her country would be a dream come true for the 27-year-old. “I’d be lying to say that wasn’t a dream of mine. It is [a dream] and I think I’ve dreamt of it since I was a little kid. But I can only do what’s within my control. Right now, Tottenham’s in my control,” she explained. “It's all about the team for me. If we could get Champions League, that would be amazing. But at the same time, I think we just need to take every game as it comes. We really do. This league has got tougher and tougher every single season and teams are beating teams that you don’t expect.” Playing for the Lionesses would cap off a remarkable turn-around for Bartrip, who has openly spoken about her struggles with anxiety, depression and anorexia as a teenager. The 27-year-old now uses her platform to help create change as a mental health advocate and will be a part of the Spurs squad that walks out at the Tottenham Hotspur stadium this weekend as part of a huge North London derby in the WSL against Arsenal. Spurs have never beaten Arsenal - but did share a thrilling 3-3 draw with their locals in the Conti Cup in midweek – but Bartrip believes this could be the year they get one over the Gunners. “I really hope so. There’s a really good aura around the club at the moment [in both the] men’s and women’s [teams] and I think that’s also a massive thing in [terms of] how you play,” she finished. “I think you watch the men’s [team] and they’re doing really well. With us, we’ve got a new style and a new identity and people want to watch it. Hopefully, we can bring that style and give them a proper game because that’s what North London Derbies are about right?!” Postecoglou's Tottenham take on Nottingham Forest at the City Ground at 8pm on Friday night - live on talkSPORT!","pubDate":"2023-12-15 12:08:50","image_url":"https://talksport.com/wp-content/uploads/sites/5/2023/12/robert-vilahamn-manager-tottenham-hotspur-866116513.jpg?strip=all&w=960","source_id":"talksport","source_priority":4624,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c7b35fc6ecd007a5727a0e525e0163d4","title":"Who is Sam Allison, first black Premier League referee in 15 years? Career, stats and more","link":"https://www.hitc.com/en-gb/2023/12/15/who-is-sam-allison-first-black-premier-league-referee-career-stats/","keywords":["Football","Luton Town","Premier League","Sheffield United"],"creator":["Gary Kirkpatrick"],"video_url":null,"description":"The Premier League and the Professional Game Match Officials Limited (PGMOL) have announced that referee Sam Allison will officiate an English top-flight match game. Why... The post Who is Sam Allison, first black Premier League referee in 15 years? Career, stats and more appeared first on HITC.","content":"Why is this significant? Well, Allison will become the first black referee in 15 years to take charge of a fixture. Uriah Rennie – who spent 11 years as a Premier League whistler – was the last black official to referee a Premier League game and that came in 2008. The introduction of Allison to the Premier League’s refereeing contingent in 2023/24 marks a positive step forward for the division from an inclusivity perspective. So who is Sam Allison? We provide you with a comprehensive profile below including details on his career as an official, his stats and more. Born in England, 42-year-old Sam Allison is a professional football referee. He has for the first time when he acts as the man in the middle for home clash with on Boxing Day. Allison played at the highest non-league level as a footballer after spells with , Bristol City, Swindon Town and Exeter City. His attentions then turned to refereeing but juggled those duties with being a professional firefighter. But soon, Allison would focus all of his energy into full-time refereeing and joined the roster in 2020. There, he would become just the third black whistler in the league’s history. Allison won’t be involved in a Premier League for the first time come December 26, as he was appointed fourth official for Brighton’s home game with Chelsea in October 2022. Allison has always had ambitions of reaching the top level of refereeing in English football. He told the in March 2023: “I love football so much; it’s in my blood and it’s innate. I’d do anything to be involved in the game. Unfortunately, I didn’t reach the pinnacles as a football player but hopefully one day I can do it as a referee.” Sam Allison is a member of the Select Group 2. As part of the group, Allison largely officiates EFL matches and occasionally in League One and Two. Allison rose up the leagues and eventually took charge of EFL Championship games come the 2023/24 campaign. He will be very new to the pressures of the Premier League but is still adapting to being an official in the second tier of English football. These are Sam Allison’s referee stats as per . He has officiated in the EFL Championship, League One, League Two, FA Cup, EFL Cup, National League, Premier League 2, EFL Trophy and FA Youth Cup.","pubDate":"2023-12-15 12:19:21","image_url":"https://www.hitc.com/static/uploads/2023/12/GettyImages-1251400641-scaled-e1702642732868-1024x341.jpg","source_id":"hitc","source_priority":768,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7f9115552734abd9d35bd54da7e91740","title":"Steven Alzate (Standard) veut de la stabilité : “Mais Brighton a une option pour me rappeler en janvier”","link":"https://www.dhnet.be/sports/football/division-1a/standard/2023/12/15/steven-alzate-standard-veut-de-la-stabilite-mais-brighton-a-une-option-pour-me-rappeler-en-janvier-Z3SOTEHA7VBDRHNRAGA4ZRSJBY/","keywords":["Standard"],"creator":["Maxime Jacques"],"video_url":null,"description":"Prêté au Standard, où il se sent bien, Steven Alzate a envie de stabilité. Mais il n’a pas les cartes en main. ...","content":"Copier, coller. Cela fait deux saisons que Steven Alzate est prêté au Standard par Brighton lors du dernier jour du mercato. Et même dans les dernières minutes. Et cela fait aussi deux saisons que l’international colombien s’impose comme un élément essentiel du dispositif liégeois. Son assist face à Anderlecht, dimanche dernier, l’a encore rappelé. Mais à l’image de l’équipe, Alzate connaît des hauts et des bas ces dernières semaines. “ Si je dois comparer mon niveau par rapport à celui de la saison dernière, je dirais qu’il est assez similaire. Mais notre style de jeu a changé et on voit peut-être un peu moins mes qualités , explique-t-il avec honnêteté. L’an passé, on avait déjà cette instabilité mais je pense qu’on va dans la bonne direction. Quand je suis arrivé, au début du mois de septembre de cette saison, l’équipe était dans le fond du tableau. Désormais, on est à quelques points (NDLR : six) du top 6. Je suis donc content d’avoir pu aider l’équipe à s’améliorer.” guillement Anderlecht est un plus gros rival que Charleroi. Au fil des matchs qu’il a joués sous la vareuse liégeoise, le joueur de 25 ans a également pu goûter à l’ambiance particulière des matchs face à Anderlecht et à Charleroi. Des chocs qui s’enchaînent, en ce moment. Après deux Clasicos en quatre jours, place au choc wallon face aux Zèbres. Pour son plus grand plaisir. “ On sait que la rivalité avec ces deux clubs est grande et que les supporters attendent impatiemment ces matchs. Les gagner, cela représente vraiment quelque chose. Il y a probablement un peu plus d’excitation et de tension quand on joue face à Anderlecht mais Charleroi est un club qu’on veut absolument battre, ce samedi. C’est d’autant plus important pour rester dans la course aux playoffs 1.” À lire aussi Pourquoi le Standard a fait de Charleroi son adversaire préféré Pas de discussion avec Brighton… pour le moment Les playoffs 1, Steven Alzate espère jouer pour la première fois. Mais cela passera par des victoires et par… le fait qu’il reste à Sclessin en janvier. “ J’ai une clause de rappel dans mon prêt, explique-t-il. Pour le moment, il n’y a eu aucune discussion dans le sens d’un retour à Brighton cet hiver mais je n’ai pas toutes les cartes en main.” C’est d’ailleurs sa réalité depuis quelques mois. Entre ses prêts et ses retours en Angleterre, le Colombien est constamment en transit. Et il ne le cache pas : il aimerait mettre un terme à ces allers-retours. “ C’est un peu embêtant, avoue-t-il. J’ai envie de m’installer quelque part car pour un joueur, c’est toujours plus confortable.” Cela pourrait-il être à Liège ? Financièrement, cela semble compliqué puisque le joueur – sous contrat avec Brighon jusqu’en juin 2025 – est évalué à environ 5 millions d’euros. Une somme que le Standard est incapable de dépenser en ce moment. Mais cela n’empêche pas le numéro 17 liégeois d’apprécier son expérience principautaire. “Je suis bien ici et je ne me sens pas comme un joueur en prêt. C’est ma deuxième saison au Standard et je sens que j’ai le support de tout le monde.” À lire aussi Steven Alzate : “Sans cette connexion particulière établie la saison dernière, je ne serais pas revenu au Standard” Hoefkens voudrait “le garder cinq ans” Au premier rang dans la tribune des fans d’Alzate, il y a Carl Hoefkens, qui a titularisé le Colombien à dix reprises en championnat depuis que le médian est revenu à Sclessin. Un peu à l’image de Ronny Deila la saison dernière, l’actuel entraîneur des Rouches pose le nom du natif de Londres en premier sur la feuille du match. La seule fois où Alzate n’était pas sur le terrain, c’était d’ailleurs parce qu’il était suspendu (face à Westerlo, après avoir été exclu lors de son premier match à Eupen). Lorsqu’on a précisé au coach rouche que son joueur avait évoqué spontanément sa clause de rappel dès janvier, Hoefkens en a profité pour rappeler à quel point il était satisfait de son joueur. “On sait qu’un joueur de sa qualité peut être rappelé à tout moment mais pour le moment, rien ne l’indique. On verra le futur , indique le T1 du Matricule 16. S i cela ne tenait qu’à moi, je le garderais dans l’équipe pour les cinq prochaines années.” Mais entre vouloir et pouvoir, il y a parfois un fossé. Décrassage 11/12/2023 - Hoefkens a-t-il trouvé la formule magique pour le top 6 ? Pour accéder à cet article, veuillez vous connecter au réseau internet.","pubDate":"2023-12-15 12:18:32","image_url":null,"source_id":"dhnet","source_priority":337210,"country":["belgium"],"category":["sports"],"language":"french"},{"article_id":"00e896ced0c5e50f1437afc6e5868d77","title":"Où regarder Ukraine - Belgique (Futsal) en live ? Les directs sport à la télé ce vendredi 15 décembre en Belgique","link":"https://www.dhnet.be/sports/omnisports/2023/12/15/ou-regarder-ukraine-belgique-futsal-en-live-les-directs-sport-a-la-tele-ce-vendredi-15-decembre-en-belgique-E7WZXZYTIFG5HKMT7OSJJ4ZIWY/","keywords":["Autres sports"],"creator":["Bruno Verscheure"],"video_url":null,"description":"À quelle heure et sur quelle chaîne voir en direct les événements sportifs aujourd’hui depuis la Belgique ? Les matchs de football en live, le cyclisme en direct à la TV, le tennis en direct, le basket-ball, le hockey… ...","content":"Football 18h30 Schalke 04 – Greuther Fürth Eleven Sports 1 20h00 Dender – Liège Eleven 2 20h00 Zulte Waregem – Seraing Eleven 3 20h45 Westerlo – Eupen Eleven 1 20h45 Genoa – Juventus Eleven Sports 2 21h00 Monaco – Lyon Eleven Sports 1 21h00 Nottingham Forest – Tottenham VOOsport World 1 23h35 Eredivisie Holland 1 Basket-ball 20h30 Limburg United – Charleroi Pickx+ Sports 1, VOOsport World 3 20h30 Euroligue : Barcelone – Armani Milan VOOsport World 2 01h30 San Antonio Spurs – LA Lakers Eleven Sports 1 Biathlon 14h10 Coupe du monde à Leinzerheide Eurosport, ZDF Combiné nordique 10h20 Coupe du monde à Ramsau Eurosport 13h45 Coupe du monde à Ramsau Eurosport Fléchettes 20h00 Championnats du monde de darts VTM 2 Futsal 18h00 Ukraine – Belgique Pickx+ Sports 1 Golf 09h35 Mauritius Open VOOsport World 1 Saut à skis 15h35 Coupe du monde à Engelberg Eurosport Ski alpin 11h30 Super-G messieurs à Val Gardena Eurosport Ski de fond 09h55 Coupe du monde à Trondheim Eurosport 2 12h15 Coupe du monde à Trondheim Eurosport 2 Ski freestyle 20h50 Coupe du monde à Copper Mountain Eurosport 2 Snooker 14h15 Open d’Ecosse Eurosport 2 20h00 Open d’Ecosse Eurosport Snowboard 18h00 Coupe du monde à Copper Mountain Eurosport Vous ne savez jamais sur quelle chaîne regarder la course ou le match du moment en direct ? Vous êtes fans de sport, du foot au basket en passant par le cyclisme ? Notre programme TV vous informe de l’horaire du match en direct, ainsi que la chaîne de télévision sur laquelle il est diffusé. De cette manière, vous ne manquez plus aucun direct de vos événements sportifs préférés.","pubDate":"2023-12-15 12:18:06","image_url":null,"source_id":"dhnet","source_priority":337210,"country":["belgium"],"category":["sports"],"language":"french"},{"article_id":"3752251a1b5c157455b35d46d258728b","title":"Dortmund-PSG : Christophe Dugarry dégomme Kylian Mbappé","link":"https://www.lefigaro.fr/sports/football/ligue-des-champions/dortmund-psg-christophe-dugarry-degomme-kylian-mbappe-20231215","keywords":["Ligue des champions"],"creator":null,"video_url":null,"description":"Agacé en fin de match face à Dortmund, Kylian Mbappé n’a pas trouvé le chemin des filets mercredi soir en Ligue des champions. Une performance qui n’a pas été du goût de Christophe Dugarry.","content":"Le match nul (1-1) entre le Borussia Dortmund et le PSG a eu le don de frustrer Kylian Mbappé , pas en réussite mercredi soir dans la Ruhr. La star parisienne a paru agacée à l’issue de la rencontre malgré la qualification du club de la capitale en hutièmes de finale de la Ligue des champions . Une attitude qui n’a (clairement) pas été du goût du champion du monde 1998 avec l’équipe de France Christophe Dugarry qui a dégommé «KM». «Je lui reproche son attitude. Il se savait attendu, il devait être le leader de cette équipe. (…) Il ne se sent concerné par aucune tâche défensive. Il ne fait aucun effort quand un défenseur passe à trois-quatre mètres de lui. (…) L'exemplarité est capitale dans ce genre de match. J'ai vu un Mbappé passif. Il n'a harangué ses coéquipiers qu'à la fin. Il aurait dû le faire avant. Je ne l'ai pas vu faire le pressing sur Sule et Hummels. J'ai été très, très déçu de son comportement. Je pensais même qu'il allait surjouer. Mais non, il a subi tout le match. (…) Un leader doit montrer l'exemple et se sentir concerné. J'ai le souvenir de Zizou. Quand tu le voyais faire autant d'efforts, tu étais obligé de te bouger. Zizou était un collectif, lui est un individualiste» , a déclaré Dugarry à RMC Sport .","pubDate":"2023-12-15 12:17:18","image_url":"https://i.f1g.fr/media/cms/2365x1330_crop/2023/12/15/eb4c06c9a1dbedad3be666cb1a438e8e492cd6245f3c205ada60ed7b1ea9f23a.jpg","source_id":"lefigaro","source_priority":17866,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"40e7120c4d4476e8b048e964909cd620","title":"Mourinho-Marcenaro, arrivata la sanzione per il portoghese: è ufficiale","link":"https://www.areanapoli.it/varie/mourinho-marcenaro-arrivata-la-sanzione-per-il-portoghese-e-ufficiale_528563.html","keywords":["Varie"],"creator":["AreaNapoli.it"],"video_url":null,"description":"E' arrivata la sanzione per Josè Mourinho per le parole sull'arbitro Marcenaro, il comunicato dell'AS Roma ha chiarito la posizione.","content":"Jose Mourinho ha ricevuto ufficialmente la sanzione per le parole sull'arbitro Marcenaro , in seguito alle dichiarazioni prima della partita tra la sua Roma e il Sassuolo. Ecco il comunicato ufficiale della Roma: \" L’AS Roma, rappresentata dal suo CEO e dal suo Football General Manager, unitamente al proprio responsabile tecnico, José Mourinho, a seguito delle dichiarazioni dello stesso allenatore nel pre-partita della gara Sassuolo-Roma, e successivamente all’apertura del procedimento conseguente da parte della Procura Federale FIGC, comunicano di aver definito un accordo ex art. 126 del Codice di Giustizia Sportiva FIGC\". \" L’AS Roma e il proprio allenatore si riportano alle dichiarazioni espresse sia dal Direttore Tiago Pinto, che dal responsabile tecnico Mourinho, successivamente all’apertura del procedimento della PF FIGC, ribadendo il massimo rispetto e la massima collaborazione verso le Istituzioni Federali e l’AIA. Proprio in linea con questa condotta collaborativa, e per il rispetto e la fiducia del Club nei confronti delle Istituzioni arbitrali e della FIGC, l’AS Roma e l’allenatore, aderendo convintamente alla valutazione del Procuratore Federale, accettano su basi consensuali la comminatoria di una sanzione pecuniaria (di 20.000 euro, ndr.) che sarà integralmente devoluta in favore dell'Associazione Italiana Leucemie (AIL), ente che opera per nobili finalità benefiche in concreto aiuto dei più bisognosi\" . Ha concluso la nota ufficiale della Roma.","pubDate":"2023-12-15 12:15:00","image_url":"https://cdn.areanapoli.it/immagini/notizie/big/m/mourinho_jose_roma_6.jpg","source_id":"areanapoli","source_priority":714118,"country":["italy"],"category":["sports"],"language":"italian"},{"article_id":"567f15840ea27c0018f9f5df351fc855","title":"Philippe Clement told Rangers record before arrival means NOTHING now as Celtic icon stews over lost spark","link":"https://www.dailyrecord.co.uk/sport/football/football-news/philippe-clement-told-rangers-record-31681012","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ross Pilcher)"],"video_url":null,"description":"Paul Lambert reckons defeat at Parkhead this month will leave Rangers with too much to do in the title race.","content":"Philippe Clement watches on Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Paul Lambert has told Philippe Clement his experience on the continent will mean NOTHING when he takes Rangers to Parkhead. Celtic host their rivals on December 30 and the gap at the top of the Scottish Premiership could be closing in on their rivals if they defeat St Johnstone in one of their games in hand. It will be the Belgian's first taste of the red hot Old Firm fixture and it could be a pivotal one if the Light Blues can leapfrog their rivals to go top. However, Lambert reckons the knowhow this Celtic squad and Brendan Rodgers have for just the type of occasion gives them the edge and that victory would put them out in front when it comes to motoring on and claiming the Premiership crown. And he can't see Rangers recovering from a second successive derby defeat after losing 1-0 to a depleted Celtic side back in September. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Scott Brown makes astonishing Celtic season ticket claim as he insists they’re OVER performing in Champions League “It'll be very difficult to claw the title-fight back if they lose the next Old Firm game.,\" Lambert told Betway . \"This will be Philippe Clement's first experience of the Old Firm, whereas Brendan and the Celtic players know all about it. “There will also be a ban on Rangers fans - something that's crazy to me as fans are such a big part of the rivalry. We saw the same thing happen at Ibrox back in May - and I think that was terrible, too. “Clement is walking into a game where his international experience means nothing. This game is different from any other because of what it stands for. If Celtic win, I think they're in the drivers' seat. If Rangers get a result, then the title race will be back on. However, I still think Celtic are favourites as they're at home.” Celtic claimed a first home win in the Champions League for a decade in midweek. And having experienced first hand how helpful home form can be in making it out of the group with Dortmund, Lambert has urged the Hoops to get it right in their own backyard in order to give themselves a fighting chance. “I played at Celtic, and the key in the Champions League is the home form,\" he said. \"We finished on nine points in the Champions League group stages a few times, but we still couldn't get through. Six points are sometimes enough, yet we got nine and didn't make it to the next round! Gustaf Lagerbielke scores to make it 2-1 “We couldn't seem to get a point away from home. When I won the Champions League with Dortmund, we finished second in our group and we had 13 points, which was incredible! “Celtic are a different animal at home. The atmosphere at Celtic Park is unmatched and they'll be a match for most teams there. They need to make sure they win their home games and see what happens on their travels. “They should have beaten Lazio at Celtic Park and they have to win against Feyenoord just to end the campaign on a high. The 2-2 game against Atletico was incredible and most teams would have taken that result. “I was at the Lazio game, and that could have gone either way in Rome. They shouldn't have lost the home leg, and perhaps they wouldn't have if they had better game management and experience. “Celtic are doing their best with the finances they have. Any team who visits them finds it tough, but they need to start picking up points away from home. They'll be in with a shout of qualification if they do.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Champions League Paul Lambert Celtic FC Rangers FC Philippe Clement Brendan Rodgers Borussia Dortmund Scottish Premiership","pubDate":"2023-12-15 12:12:53","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31677875.ece/ALTERNATES/s615/0_JS319572699.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c9c49fa91549d3688ed04d02bf7be13d","title":"Europa League : Amoura avec Lukaku en pointe","link":"https://www.dzfoot.com/verts-deurope/europa-league-amoura-avec-lukaku-en-pointe-251480.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Verts du Monde"],"creator":["Salim D"],"video_url":null,"description":"Auteur d'une performance XXL face à Liverpool, Mohamed Amoura fait partie de l'équipe de la semaine en Europa League établie par Sofascore. L'attaquant algérien qui a obtenu une note de 9,3 se retrouve aux côtés de Lukaku à la pointe du onze le plus performant de la semaine. Buteur et passeur, Amoura s'est procuré trois […] The post Europa League : Amoura avec Lukaku en pointe appeared first on Football Algérien - DZFOOT.COM.","content":"Auteur d'une performance XXL face à Liverpool, Mohamed Amoura fait partie de l'équipe de la semaine en Europa League établie par Sofascore. L'attaquant algérien qui a obtenu une note de 9,3 se retrouve aux côtés de Lukaku à la pointe du onze le plus performant de la semaine. Buteur et passeur , Amoura s'est procuré trois occasions franches et a offert en plus de sa passe décisive deux autres ballons clé à ses coéquipiers. En plus de ses performances offensives, il a été très bon dans les duels au sol. 🌍 | Team of the Week This attacking-minded TOTW is a result of six blue ratings on the final day of the 2023/24 UEFA Europa League group stage! 🤯 Among a host of truly brilliant performances, one still slightly stands out – Kostas Fortounis is our #UEL Player of the Week. 🏅 pic.twitter.com/gSMZogNyi9 — Sofascore (@SofascoreINT) December 15, 2023 DZfoot","pubDate":"2023-12-15 12:10:56","image_url":null,"source_id":"dzfoot","source_priority":291587,"country":["algeria"],"category":["sports"],"language":"french"},{"article_id":"c63549904045dad36dba662f6c75fedc","title":"Mercato - OL : Un flop déjà sur le départ ?","link":"https://le10sport.com/football/mercato/mercato-un-flop-de-lol-deja-sur-le-depart-675612","keywords":null,"creator":null,"video_url":null,"description":"Arrivé à l'OL en provenance de Botafogo au mois de janvier dernier, Jeffinho peine à trouver sa place au sein de l'effectif rhodanien. En cruel manque de temps de jeu à Lyon, le Brésilien ne serait…","content":"Arrivé à l'OL en provenance de Botafogo au mois de janvier dernier, Jeffinho peine à trouver sa place au sein de l'effectif rhodanien. En cruel manque de temps de jeu à Lyon, le Brésilien ne serait pas contre un retour au pays. En effet, selon le média local Globo, le club basé à Rio de Janeiro envisage de faire revenir l'attaquant brésilien au prochain mercato hivernal. Dernier de Ligue 1 après 15 journées, l' OL est toujours en crise. Si le club rhodanien a quelque peu retrouvé des couleurs après sa large victoire contre Toulouse dimanche dernier (3-0), Lyon est toujours dans le besoin de se renforcer à l'approche du mercato hivernal. Mais en parallèle, l' Olympique Lyonnais compte aussi se montrer actif au niveau des ventes cet hiver. L'OL s'enflamme pour le retour de sa star https://t.co/nMHTqxCg6y pic.twitter.com/qBWKGQ1g7g En effet, selon les dernières informations du média brésilien Globo , Botafogo envisage de faire revenir Jeffinho . Le club brésilien, qui appartient à la galaxie Eagle Football de John Textor , aurait pris des contacts avec l'attaquant lyonnais en vue d'un retour en janvier. Pour l'heure, il n'y aurait pas d'offre concrète, mais le principal concerné ne serait pas contre un retour au pays, notamment pour disputer la Copa Libertadores 2024. Débarqué sur les bords du Rhône au mois de janvier dernier contre un chèque de 10 millions d'euros, Jeffinho n'a jamais réussi à convaincre les dirigeants lyonnais, n'inscrivant que deux petits buts en 19 matchs.","pubDate":"2023-12-15 12:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/229240.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"992d164c96a54ac3d4fadbb7e6583e37","title":"Oliveira: \"Napoli in grandissima difficoltà. Cagliari al Maradona per non perdere\"","link":"https://www.areanapoli.it/interviste/oliveira-napoli-in-grandissima-difficolta-cagliari-al-maradona-per-non-perdere_528562.html","keywords":["Interviste"],"creator":["AreaNapoli.it"],"video_url":null,"description":"L'ex bomber dei sardi ha analizzato la partita di domani, quando la squadra di Ranieri affronterà gli azzurri a Fuorigrotta.","content":"Lulu Oliveira , ex calciatore del Cagliari, ha parlato a 1 Football Club , programma in onda su 1 Station Radio. \"Cosa manca al Cagliari per trovare continuità? Da quel che ho visto nelle ultime partite, al Cagliari manca il gioco. È una squadra che fatica tantissimo a giocare un calcio più aperto. Soprattutto, i ragazzi di quest’anno non hanno ancora l’esperienza della massima serie. Sono tutti ragazzi che arrivano dalla Serie B. Ranieri sta facendo bene? Lo conosco, mi ha allenato a Firenze. È un tecnico che cerca soprattutto di motivare i suoi calciatori e, soprattutto, c’è sempre nei momenti difficili, come un padre. Cerca sempre di parlare con tutti, un allenatore grintoso che, alla sua età, ha ancora voglia di dimostrare il proprio valore. Faccio un esempio, quando mi dissero che sarebbe venuto a Cagliari non ci credevo. Oggi, però, è amato da tutti. E’ anche lui l’artefice di quei recuperi nel finale”. \"Che difficoltà possono trovare i calciatori del Napoli domani? C’è questa rivalità tra tifosi azzurri e cagliaritani, ma in questo momento sarà fondamentale non perdere. Il Cagliari è una squadra in salute che arriverà al Maradona per vincere”. \"Perché Kvara non riesce a segnare? La gente - è l'invito di Oliveira ai supporter campani - deve lasciare da parte quanto successo lo scorso anno. Il calcio è fatto così, ci sono momenti belli ed altri meno belli. Il Napoli ha avuto un allenatore che ha dato tutto e ha vinto. Il cambio tecnico, però, credo sia stato un po’ affrettato. Si sarebbe potuta trovare una soluzione, un tecnico così importante non può andare via in questo modo. Il Napoli, dunque, ha perso tantissimo\". \"Vedere gli azzurri era uno spettacolo. In questo momento, è una squadra in grandissima difficoltà ma sono sicuro che abbia le potenzialità di uscire da questo momento di difficoltà, così come il talento georgiano”.","pubDate":"2023-12-15 12:10:00","image_url":"https://cdn.areanapoli.it/immagini/notizie/big/o/oliveira_luis.jpg","source_id":"areanapoli","source_priority":714118,"country":["italy"],"category":["sports"],"language":"italian"},{"article_id":"36271a25e4622dd78b238d0384fbc861","title":"Ange Postecoglou not the only Tottenham manager playing exciting new brand of football as Molly Bartrip raves about Women’s boss Robert Vilahamn","link":"https://talksport.com/football/1678567/tottenham-women-ange-postecoglou-robert-vilahamn/","keywords":["Football","Premier League","Women's Super League"],"creator":["Uma Gurav"],"video_url":null,"description":null,"content":"Tottenham’s Molly Bartrip believes there are plenty of similarities between Ange Postecoglou and Robert Vilahamn, as the north London side eye a Champions League finish this season. Vilahamn was appointed as Tottenham Women’s new head coach shortly after Postecoglou’s arrival in and the Swede told talkSPORT in the summer about how he was trying to replicate the Australian’s style of play in his new role. It has certainly had the desired effect as Spurs have been one of the stories of the Women’s Super League (WSL) season, winning plaudits for their attractive brand of football. Despite recent heavy defeats to Manchester City and Manchester United, there is still plenty to be excited about for Spurs – who sit in sixth place in the table - and Bartrip says Vilahamn has given belief to the squad after an underwhelming season last year. Speaking exclusively to talkSPORT, Bartrip said: “There are similarities [between Vilahamn and Postecoglou]. I think you can see very clearly that there are. They want to play a way and they’re going to play a way where it doesn’t matter who the opposition is. “We’re going to play the Tottenham way and in the next few years, you’re going to see it be successful because that’s what the club wants. “So, in that way, it’s actually a really refreshing thing to be a part of [because] you know that this is the way we want to play and you just have to adapt to it. I’m lucky that I think this style suits me a lot, but at the same time, I think it’s really important that as footballers, you have to be adaptable. “The biggest thing Robert’s brought to us is just to be brave and I think that comes on the pitch [and] off the pitch [and] it puts people out of their comfort zone and I don’t think a lot of people are used to it. “He’s given me a lot of confidence. I am a confidence player – I’m not going to shy away from that – and he’s believed in all of us I think and it’s not easy to be a manager of 26 players. “He is definitely a manager you want to play for. He’s actually a really funny guy, too, and I think it helps when sometimes, you feel like they’re a real human and you can talk to them about other things that doesn’t even involve football. To be able to connect in that way is so important.” Bartrip has excelled this season for Spurs and worn the captain’s armband in Bethany England’s absence, with the Lionesses forward missing most of the season through injury. The centre-back’s performances have impressed her manager, with Vilahamn touting Bartrip for a future England call-up, and representing her country would be a dream come true for the 27-year-old. “I’d be lying to say that wasn’t a dream of mine. It is [a dream] and I think I’ve dreamt of it since I was a little kid. But I can only do what’s within my control. Right now, Tottenham’s in my control,” she explained. “It's all about the team for me. If we could get Champions League, that would be amazing. But at the same time, I think we just need to take every game as it comes. We really do. This league has got tougher and tougher every single season and teams are beating teams that you don’t expect.” Playing for the Lionesses would cap off a remarkable turn-around for Bartrip, who has openly spoken about her struggles with anxiety, depression and anorexia as a teenager. The 27-year-old now uses her platform to help create change as a mental health advocate and will be a part of the Spurs squad that walks out at the Tottenham Hotspur stadium this weekend as part of a huge North London derby in the WSL against Arsenal. Spurs have never beaten Arsenal - but did share a thrilling 3-3 draw with their locals in the Conti Cup in midweek – but Bartrip believes this could be the year they get one over the Gunners. “I really hope so. There’s a really good aura around the club at the moment [in both the] men’s and women’s [teams] and I think that’s also a massive thing in [terms of] how you play,” she finished. “I think you watch the men’s [team] and they’re doing really well. With us, we’ve got a new style and a new identity and people want to watch it. Hopefully, we can bring that style and give them a proper game because that’s what North London Derbies are about right?!” Postecoglou's Tottenham take on Nottingham Forest at the City Ground at 8pm on Friday night - live on talkSPORT!","pubDate":"2023-12-15 12:08:50","image_url":"https://talksport.com/wp-content/uploads/sites/5/2023/12/robert-vilahamn-manager-tottenham-hotspur-866116513.jpg?strip=all&w=960","source_id":"talksport","source_priority":4624,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c7b35fc6ecd007a5727a0e525e0163d4","title":"Who is Sam Allison, first black Premier League referee in 15 years? Career, stats and more","link":"https://www.hitc.com/en-gb/2023/12/15/who-is-sam-allison-first-black-premier-league-referee-career-stats/","keywords":["Football","Luton Town","Premier League","Sheffield United"],"creator":["Gary Kirkpatrick"],"video_url":null,"description":"The Premier League and the Professional Game Match Officials Limited (PGMOL) have announced that referee Sam Allison will officiate an English top-flight match game. Why... The post Who is Sam Allison, first black Premier League referee in 15 years? Career, stats and more appeared first on HITC.","content":"Why is this significant? Well, Allison will become the first black referee in 15 years to take charge of a fixture. Uriah Rennie – who spent 11 years as a Premier League whistler – was the last black official to referee a Premier League game and that came in 2008. The introduction of Allison to the Premier League’s refereeing contingent in 2023/24 marks a positive step forward for the division from an inclusivity perspective. So who is Sam Allison? We provide you with a comprehensive profile below including details on his career as an official, his stats and more. Born in England, 42-year-old Sam Allison is a professional football referee. He has for the first time when he acts as the man in the middle for home clash with on Boxing Day. Allison played at the highest non-league level as a footballer after spells with , Bristol City, Swindon Town and Exeter City. His attentions then turned to refereeing but juggled those duties with being a professional firefighter. But soon, Allison would focus all of his energy into full-time refereeing and joined the roster in 2020. There, he would become just the third black whistler in the league’s history. Allison won’t be involved in a Premier League for the first time come December 26, as he was appointed fourth official for Brighton’s home game with Chelsea in October 2022. Allison has always had ambitions of reaching the top level of refereeing in English football. He told the in March 2023: “I love football so much; it’s in my blood and it’s innate. I’d do anything to be involved in the game. Unfortunately, I didn’t reach the pinnacles as a football player but hopefully one day I can do it as a referee.” Sam Allison is a member of the Select Group 2. As part of the group, Allison largely officiates EFL matches and occasionally in League One and Two. Allison rose up the leagues and eventually took charge of EFL Championship games come the 2023/24 campaign. He will be very new to the pressures of the Premier League but is still adapting to being an official in the second tier of English football. These are Sam Allison’s referee stats as per . He has officiated in the EFL Championship, League One, League Two, FA Cup, EFL Cup, National League, Premier League 2, EFL Trophy and FA Youth Cup.","pubDate":"2023-12-15 12:19:21","image_url":"https://www.hitc.com/static/uploads/2023/12/GettyImages-1251400641-scaled-e1702642732868-1024x341.jpg","source_id":"hitc","source_priority":768,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7f9115552734abd9d35bd54da7e91740","title":"Steven Alzate (Standard) veut de la stabilité : “Mais Brighton a une option pour me rappeler en janvier”","link":"https://www.dhnet.be/sports/football/division-1a/standard/2023/12/15/steven-alzate-standard-veut-de-la-stabilite-mais-brighton-a-une-option-pour-me-rappeler-en-janvier-Z3SOTEHA7VBDRHNRAGA4ZRSJBY/","keywords":["Standard"],"creator":["Maxime Jacques"],"video_url":null,"description":"Prêté au Standard, où il se sent bien, Steven Alzate a envie de stabilité. Mais il n’a pas les cartes en main. ...","content":"Copier, coller. Cela fait deux saisons que Steven Alzate est prêté au Standard par Brighton lors du dernier jour du mercato. Et même dans les dernières minutes. Et cela fait aussi deux saisons que l’international colombien s’impose comme un élément essentiel du dispositif liégeois. Son assist face à Anderlecht, dimanche dernier, l’a encore rappelé. Mais à l’image de l’équipe, Alzate connaît des hauts et des bas ces dernières semaines. “ Si je dois comparer mon niveau par rapport à celui de la saison dernière, je dirais qu’il est assez similaire. Mais notre style de jeu a changé et on voit peut-être un peu moins mes qualités , explique-t-il avec honnêteté. L’an passé, on avait déjà cette instabilité mais je pense qu’on va dans la bonne direction. Quand je suis arrivé, au début du mois de septembre de cette saison, l’équipe était dans le fond du tableau. Désormais, on est à quelques points (NDLR : six) du top 6. Je suis donc content d’avoir pu aider l’équipe à s’améliorer.” guillement Anderlecht est un plus gros rival que Charleroi. Au fil des matchs qu’il a joués sous la vareuse liégeoise, le joueur de 25 ans a également pu goûter à l’ambiance particulière des matchs face à Anderlecht et à Charleroi. Des chocs qui s’enchaînent, en ce moment. Après deux Clasicos en quatre jours, place au choc wallon face aux Zèbres. Pour son plus grand plaisir. “ On sait que la rivalité avec ces deux clubs est grande et que les supporters attendent impatiemment ces matchs. Les gagner, cela représente vraiment quelque chose. Il y a probablement un peu plus d’excitation et de tension quand on joue face à Anderlecht mais Charleroi est un club qu’on veut absolument battre, ce samedi. C’est d’autant plus important pour rester dans la course aux playoffs 1.” À lire aussi Pourquoi le Standard a fait de Charleroi son adversaire préféré Pas de discussion avec Brighton… pour le moment Les playoffs 1, Steven Alzate espère jouer pour la première fois. Mais cela passera par des victoires et par… le fait qu’il reste à Sclessin en janvier. “ J’ai une clause de rappel dans mon prêt, explique-t-il. Pour le moment, il n’y a eu aucune discussion dans le sens d’un retour à Brighton cet hiver mais je n’ai pas toutes les cartes en main.” C’est d’ailleurs sa réalité depuis quelques mois. Entre ses prêts et ses retours en Angleterre, le Colombien est constamment en transit. Et il ne le cache pas : il aimerait mettre un terme à ces allers-retours. “ C’est un peu embêtant, avoue-t-il. J’ai envie de m’installer quelque part car pour un joueur, c’est toujours plus confortable.” Cela pourrait-il être à Liège ? Financièrement, cela semble compliqué puisque le joueur – sous contrat avec Brighon jusqu’en juin 2025 – est évalué à environ 5 millions d’euros. Une somme que le Standard est incapable de dépenser en ce moment. Mais cela n’empêche pas le numéro 17 liégeois d’apprécier son expérience principautaire. “Je suis bien ici et je ne me sens pas comme un joueur en prêt. C’est ma deuxième saison au Standard et je sens que j’ai le support de tout le monde.” À lire aussi Steven Alzate : “Sans cette connexion particulière établie la saison dernière, je ne serais pas revenu au Standard” Hoefkens voudrait “le garder cinq ans” Au premier rang dans la tribune des fans d’Alzate, il y a Carl Hoefkens, qui a titularisé le Colombien à dix reprises en championnat depuis que le médian est revenu à Sclessin. Un peu à l’image de Ronny Deila la saison dernière, l’actuel entraîneur des Rouches pose le nom du natif de Londres en premier sur la feuille du match. La seule fois où Alzate n’était pas sur le terrain, c’était d’ailleurs parce qu’il était suspendu (face à Westerlo, après avoir été exclu lors de son premier match à Eupen). Lorsqu’on a précisé au coach rouche que son joueur avait évoqué spontanément sa clause de rappel dès janvier, Hoefkens en a profité pour rappeler à quel point il était satisfait de son joueur. “On sait qu’un joueur de sa qualité peut être rappelé à tout moment mais pour le moment, rien ne l’indique. On verra le futur , indique le T1 du Matricule 16. S i cela ne tenait qu’à moi, je le garderais dans l’équipe pour les cinq prochaines années.” Mais entre vouloir et pouvoir, il y a parfois un fossé. Décrassage 11/12/2023 - Hoefkens a-t-il trouvé la formule magique pour le top 6 ? Pour accéder à cet article, veuillez vous connecter au réseau internet.","pubDate":"2023-12-15 12:18:32","image_url":null,"source_id":"dhnet","source_priority":337210,"country":["belgium"],"category":["sports"],"language":"french"},{"article_id":"00e896ced0c5e50f1437afc6e5868d77","title":"Où regarder Ukraine - Belgique (Futsal) en live ? Les directs sport à la télé ce vendredi 15 décembre en Belgique","link":"https://www.dhnet.be/sports/omnisports/2023/12/15/ou-regarder-ukraine-belgique-futsal-en-live-les-directs-sport-a-la-tele-ce-vendredi-15-decembre-en-belgique-E7WZXZYTIFG5HKMT7OSJJ4ZIWY/","keywords":["Autres sports"],"creator":["Bruno Verscheure"],"video_url":null,"description":"À quelle heure et sur quelle chaîne voir en direct les événements sportifs aujourd’hui depuis la Belgique ? Les matchs de football en live, le cyclisme en direct à la TV, le tennis en direct, le basket-ball, le hockey… ...","content":"Football 18h30 Schalke 04 – Greuther Fürth Eleven Sports 1 20h00 Dender – Liège Eleven 2 20h00 Zulte Waregem – Seraing Eleven 3 20h45 Westerlo – Eupen Eleven 1 20h45 Genoa – Juventus Eleven Sports 2 21h00 Monaco – Lyon Eleven Sports 1 21h00 Nottingham Forest – Tottenham VOOsport World 1 23h35 Eredivisie Holland 1 Basket-ball 20h30 Limburg United – Charleroi Pickx+ Sports 1, VOOsport World 3 20h30 Euroligue : Barcelone – Armani Milan VOOsport World 2 01h30 San Antonio Spurs – LA Lakers Eleven Sports 1 Biathlon 14h10 Coupe du monde à Leinzerheide Eurosport, ZDF Combiné nordique 10h20 Coupe du monde à Ramsau Eurosport 13h45 Coupe du monde à Ramsau Eurosport Fléchettes 20h00 Championnats du monde de darts VTM 2 Futsal 18h00 Ukraine – Belgique Pickx+ Sports 1 Golf 09h35 Mauritius Open VOOsport World 1 Saut à skis 15h35 Coupe du monde à Engelberg Eurosport Ski alpin 11h30 Super-G messieurs à Val Gardena Eurosport Ski de fond 09h55 Coupe du monde à Trondheim Eurosport 2 12h15 Coupe du monde à Trondheim Eurosport 2 Ski freestyle 20h50 Coupe du monde à Copper Mountain Eurosport 2 Snooker 14h15 Open d’Ecosse Eurosport 2 20h00 Open d’Ecosse Eurosport Snowboard 18h00 Coupe du monde à Copper Mountain Eurosport Vous ne savez jamais sur quelle chaîne regarder la course ou le match du moment en direct ? Vous êtes fans de sport, du foot au basket en passant par le cyclisme ? Notre programme TV vous informe de l’horaire du match en direct, ainsi que la chaîne de télévision sur laquelle il est diffusé. De cette manière, vous ne manquez plus aucun direct de vos événements sportifs préférés.","pubDate":"2023-12-15 12:18:06","image_url":null,"source_id":"dhnet","source_priority":337210,"country":["belgium"],"category":["sports"],"language":"french"},{"article_id":"3752251a1b5c157455b35d46d258728b","title":"Dortmund-PSG : Christophe Dugarry dégomme Kylian Mbappé","link":"https://www.lefigaro.fr/sports/football/ligue-des-champions/dortmund-psg-christophe-dugarry-degomme-kylian-mbappe-20231215","keywords":["Ligue des champions"],"creator":null,"video_url":null,"description":"Agacé en fin de match face à Dortmund, Kylian Mbappé n’a pas trouvé le chemin des filets mercredi soir en Ligue des champions. Une performance qui n’a pas été du goût de Christophe Dugarry.","content":"Le match nul (1-1) entre le Borussia Dortmund et le PSG a eu le don de frustrer Kylian Mbappé , pas en réussite mercredi soir dans la Ruhr. La star parisienne a paru agacée à l’issue de la rencontre malgré la qualification du club de la capitale en hutièmes de finale de la Ligue des champions . Une attitude qui n’a (clairement) pas été du goût du champion du monde 1998 avec l’équipe de France Christophe Dugarry qui a dégommé «KM». «Je lui reproche son attitude. Il se savait attendu, il devait être le leader de cette équipe. (…) Il ne se sent concerné par aucune tâche défensive. Il ne fait aucun effort quand un défenseur passe à trois-quatre mètres de lui. (…) L'exemplarité est capitale dans ce genre de match. J'ai vu un Mbappé passif. Il n'a harangué ses coéquipiers qu'à la fin. Il aurait dû le faire avant. Je ne l'ai pas vu faire le pressing sur Sule et Hummels. J'ai été très, très déçu de son comportement. Je pensais même qu'il allait surjouer. Mais non, il a subi tout le match. (…) Un leader doit montrer l'exemple et se sentir concerné. J'ai le souvenir de Zizou. Quand tu le voyais faire autant d'efforts, tu étais obligé de te bouger. Zizou était un collectif, lui est un individualiste» , a déclaré Dugarry à RMC Sport .","pubDate":"2023-12-15 12:17:18","image_url":"https://i.f1g.fr/media/cms/2365x1330_crop/2023/12/15/eb4c06c9a1dbedad3be666cb1a438e8e492cd6245f3c205ada60ed7b1ea9f23a.jpg","source_id":"lefigaro","source_priority":17866,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"40e7120c4d4476e8b048e964909cd620","title":"Mourinho-Marcenaro, arrivata la sanzione per il portoghese: è ufficiale","link":"https://www.areanapoli.it/varie/mourinho-marcenaro-arrivata-la-sanzione-per-il-portoghese-e-ufficiale_528563.html","keywords":["Varie"],"creator":["AreaNapoli.it"],"video_url":null,"description":"E' arrivata la sanzione per Josè Mourinho per le parole sull'arbitro Marcenaro, il comunicato dell'AS Roma ha chiarito la posizione.","content":"Jose Mourinho ha ricevuto ufficialmente la sanzione per le parole sull'arbitro Marcenaro , in seguito alle dichiarazioni prima della partita tra la sua Roma e il Sassuolo. Ecco il comunicato ufficiale della Roma: \" L’AS Roma, rappresentata dal suo CEO e dal suo Football General Manager, unitamente al proprio responsabile tecnico, José Mourinho, a seguito delle dichiarazioni dello stesso allenatore nel pre-partita della gara Sassuolo-Roma, e successivamente all’apertura del procedimento conseguente da parte della Procura Federale FIGC, comunicano di aver definito un accordo ex art. 126 del Codice di Giustizia Sportiva FIGC\". \" L’AS Roma e il proprio allenatore si riportano alle dichiarazioni espresse sia dal Direttore Tiago Pinto, che dal responsabile tecnico Mourinho, successivamente all’apertura del procedimento della PF FIGC, ribadendo il massimo rispetto e la massima collaborazione verso le Istituzioni Federali e l’AIA. Proprio in linea con questa condotta collaborativa, e per il rispetto e la fiducia del Club nei confronti delle Istituzioni arbitrali e della FIGC, l’AS Roma e l’allenatore, aderendo convintamente alla valutazione del Procuratore Federale, accettano su basi consensuali la comminatoria di una sanzione pecuniaria (di 20.000 euro, ndr.) che sarà integralmente devoluta in favore dell'Associazione Italiana Leucemie (AIL), ente che opera per nobili finalità benefiche in concreto aiuto dei più bisognosi\" . Ha concluso la nota ufficiale della Roma.","pubDate":"2023-12-15 12:15:00","image_url":"https://cdn.areanapoli.it/immagini/notizie/big/m/mourinho_jose_roma_6.jpg","source_id":"areanapoli","source_priority":714118,"country":["italy"],"category":["sports"],"language":"italian"},{"article_id":"567f15840ea27c0018f9f5df351fc855","title":"Philippe Clement told Rangers record before arrival means NOTHING now as Celtic icon stews over lost spark","link":"https://www.dailyrecord.co.uk/sport/football/football-news/philippe-clement-told-rangers-record-31681012","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ross Pilcher)"],"video_url":null,"description":"Paul Lambert reckons defeat at Parkhead this month will leave Rangers with too much to do in the title race.","content":"Philippe Clement watches on Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Paul Lambert has told Philippe Clement his experience on the continent will mean NOTHING when he takes Rangers to Parkhead. Celtic host their rivals on December 30 and the gap at the top of the Scottish Premiership could be closing in on their rivals if they defeat St Johnstone in one of their games in hand. It will be the Belgian's first taste of the red hot Old Firm fixture and it could be a pivotal one if the Light Blues can leapfrog their rivals to go top. However, Lambert reckons the knowhow this Celtic squad and Brendan Rodgers have for just the type of occasion gives them the edge and that victory would put them out in front when it comes to motoring on and claiming the Premiership crown. And he can't see Rangers recovering from a second successive derby defeat after losing 1-0 to a depleted Celtic side back in September. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Scott Brown makes astonishing Celtic season ticket claim as he insists they’re OVER performing in Champions League “It'll be very difficult to claw the title-fight back if they lose the next Old Firm game.,\" Lambert told Betway . \"This will be Philippe Clement's first experience of the Old Firm, whereas Brendan and the Celtic players know all about it. “There will also be a ban on Rangers fans - something that's crazy to me as fans are such a big part of the rivalry. We saw the same thing happen at Ibrox back in May - and I think that was terrible, too. “Clement is walking into a game where his international experience means nothing. This game is different from any other because of what it stands for. If Celtic win, I think they're in the drivers' seat. If Rangers get a result, then the title race will be back on. However, I still think Celtic are favourites as they're at home.” Celtic claimed a first home win in the Champions League for a decade in midweek. And having experienced first hand how helpful home form can be in making it out of the group with Dortmund, Lambert has urged the Hoops to get it right in their own backyard in order to give themselves a fighting chance. “I played at Celtic, and the key in the Champions League is the home form,\" he said. \"We finished on nine points in the Champions League group stages a few times, but we still couldn't get through. Six points are sometimes enough, yet we got nine and didn't make it to the next round! Gustaf Lagerbielke scores to make it 2-1 “We couldn't seem to get a point away from home. When I won the Champions League with Dortmund, we finished second in our group and we had 13 points, which was incredible! “Celtic are a different animal at home. The atmosphere at Celtic Park is unmatched and they'll be a match for most teams there. They need to make sure they win their home games and see what happens on their travels. “They should have beaten Lazio at Celtic Park and they have to win against Feyenoord just to end the campaign on a high. The 2-2 game against Atletico was incredible and most teams would have taken that result. “I was at the Lazio game, and that could have gone either way in Rome. They shouldn't have lost the home leg, and perhaps they wouldn't have if they had better game management and experience. “Celtic are doing their best with the finances they have. Any team who visits them finds it tough, but they need to start picking up points away from home. They'll be in with a shout of qualification if they do.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Champions League Paul Lambert Celtic FC Rangers FC Philippe Clement Brendan Rodgers Borussia Dortmund Scottish Premiership","pubDate":"2023-12-15 12:12:53","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article31677875.ece/ALTERNATES/s615/0_JS319572699.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c9c49fa91549d3688ed04d02bf7be13d","title":"Europa League : Amoura avec Lukaku en pointe","link":"https://www.dzfoot.com/verts-deurope/europa-league-amoura-avec-lukaku-en-pointe-251480.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Verts du Monde"],"creator":["Salim D"],"video_url":null,"description":"Auteur d'une performance XXL face à Liverpool, Mohamed Amoura fait partie de l'équipe de la semaine en Europa League établie par Sofascore. L'attaquant algérien qui a obtenu une note de 9,3 se retrouve aux côtés de Lukaku à la pointe du onze le plus performant de la semaine. Buteur et passeur, Amoura s'est procuré trois […] The post Europa League : Amoura avec Lukaku en pointe appeared first on Football Algérien - DZFOOT.COM.","content":"Auteur d'une performance XXL face à Liverpool, Mohamed Amoura fait partie de l'équipe de la semaine en Europa League établie par Sofascore. L'attaquant algérien qui a obtenu une note de 9,3 se retrouve aux côtés de Lukaku à la pointe du onze le plus performant de la semaine. Buteur et passeur , Amoura s'est procuré trois occasions franches et a offert en plus de sa passe décisive deux autres ballons clé à ses coéquipiers. En plus de ses performances offensives, il a été très bon dans les duels au sol. 🌍 | Team of the Week This attacking-minded TOTW is a result of six blue ratings on the final day of the 2023/24 UEFA Europa League group stage! 🤯 Among a host of truly brilliant performances, one still slightly stands out – Kostas Fortounis is our #UEL Player of the Week. 🏅 pic.twitter.com/gSMZogNyi9 — Sofascore (@SofascoreINT) December 15, 2023 DZfoot","pubDate":"2023-12-15 12:10:56","image_url":null,"source_id":"dzfoot","source_priority":291587,"country":["algeria"],"category":["sports"],"language":"french"},{"article_id":"c63549904045dad36dba662f6c75fedc","title":"Mercato - OL : Un flop déjà sur le départ ?","link":"https://le10sport.com/football/mercato/mercato-un-flop-de-lol-deja-sur-le-depart-675612","keywords":null,"creator":null,"video_url":null,"description":"Arrivé à l'OL en provenance de Botafogo au mois de janvier dernier, Jeffinho peine à trouver sa place au sein de l'effectif rhodanien. En cruel manque de temps de jeu à Lyon, le Brésilien ne serait…","content":"Arrivé à l'OL en provenance de Botafogo au mois de janvier dernier, Jeffinho peine à trouver sa place au sein de l'effectif rhodanien. En cruel manque de temps de jeu à Lyon, le Brésilien ne serait pas contre un retour au pays. En effet, selon le média local Globo, le club basé à Rio de Janeiro envisage de faire revenir l'attaquant brésilien au prochain mercato hivernal. Dernier de Ligue 1 après 15 journées, l' OL est toujours en crise. Si le club rhodanien a quelque peu retrouvé des couleurs après sa large victoire contre Toulouse dimanche dernier (3-0), Lyon est toujours dans le besoin de se renforcer à l'approche du mercato hivernal. Mais en parallèle, l' Olympique Lyonnais compte aussi se montrer actif au niveau des ventes cet hiver. L'OL s'enflamme pour le retour de sa star https://t.co/nMHTqxCg6y pic.twitter.com/qBWKGQ1g7g En effet, selon les dernières informations du média brésilien Globo , Botafogo envisage de faire revenir Jeffinho . Le club brésilien, qui appartient à la galaxie Eagle Football de John Textor , aurait pris des contacts avec l'attaquant lyonnais en vue d'un retour en janvier. Pour l'heure, il n'y aurait pas d'offre concrète, mais le principal concerné ne serait pas contre un retour au pays, notamment pour disputer la Copa Libertadores 2024. Débarqué sur les bords du Rhône au mois de janvier dernier contre un chèque de 10 millions d'euros, Jeffinho n'a jamais réussi à convaincre les dirigeants lyonnais, n'inscrivant que deux petits buts en 19 matchs.","pubDate":"2023-12-15 12:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/229240.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"992d164c96a54ac3d4fadbb7e6583e37","title":"Oliveira: \"Napoli in grandissima difficoltà. Cagliari al Maradona per non perdere\"","link":"https://www.areanapoli.it/interviste/oliveira-napoli-in-grandissima-difficolta-cagliari-al-maradona-per-non-perdere_528562.html","keywords":["Interviste"],"creator":["AreaNapoli.it"],"video_url":null,"description":"L'ex bomber dei sardi ha analizzato la partita di domani, quando la squadra di Ranieri affronterà gli azzurri a Fuorigrotta.","content":"Lulu Oliveira , ex calciatore del Cagliari, ha parlato a 1 Football Club , programma in onda su 1 Station Radio. \"Cosa manca al Cagliari per trovare continuità? Da quel che ho visto nelle ultime partite, al Cagliari manca il gioco. È una squadra che fatica tantissimo a giocare un calcio più aperto. Soprattutto, i ragazzi di quest’anno non hanno ancora l’esperienza della massima serie. Sono tutti ragazzi che arrivano dalla Serie B. Ranieri sta facendo bene? Lo conosco, mi ha allenato a Firenze. È un tecnico che cerca soprattutto di motivare i suoi calciatori e, soprattutto, c’è sempre nei momenti difficili, come un padre. Cerca sempre di parlare con tutti, un allenatore grintoso che, alla sua età, ha ancora voglia di dimostrare il proprio valore. Faccio un esempio, quando mi dissero che sarebbe venuto a Cagliari non ci credevo. Oggi, però, è amato da tutti. E’ anche lui l’artefice di quei recuperi nel finale”. \"Che difficoltà possono trovare i calciatori del Napoli domani? C’è questa rivalità tra tifosi azzurri e cagliaritani, ma in questo momento sarà fondamentale non perdere. Il Cagliari è una squadra in salute che arriverà al Maradona per vincere”. \"Perché Kvara non riesce a segnare? La gente - è l'invito di Oliveira ai supporter campani - deve lasciare da parte quanto successo lo scorso anno. Il calcio è fatto così, ci sono momenti belli ed altri meno belli. Il Napoli ha avuto un allenatore che ha dato tutto e ha vinto. Il cambio tecnico, però, credo sia stato un po’ affrettato. Si sarebbe potuta trovare una soluzione, un tecnico così importante non può andare via in questo modo. Il Napoli, dunque, ha perso tantissimo\". \"Vedere gli azzurri era uno spettacolo. In questo momento, è una squadra in grandissima difficoltà ma sono sicuro che abbia le potenzialità di uscire da questo momento di difficoltà, così come il talento georgiano”.","pubDate":"2023-12-15 12:10:00","image_url":"https://cdn.areanapoli.it/immagini/notizie/big/o/oliveira_luis.jpg","source_id":"areanapoli","source_priority":714118,"country":["italy"],"category":["sports"],"language":"italian"},{"article_id":"36271a25e4622dd78b238d0384fbc861","title":"Ange Postecoglou not the only Tottenham manager playing exciting new brand of football as Molly Bartrip raves about Women’s boss Robert Vilahamn","link":"https://talksport.com/football/1678567/tottenham-women-ange-postecoglou-robert-vilahamn/","keywords":["Football","Premier League","Women's Super League"],"creator":["Uma Gurav"],"video_url":null,"description":null,"content":"Tottenham’s Molly Bartrip believes there are plenty of similarities between Ange Postecoglou and Robert Vilahamn, as the north London side eye a Champions League finish this season. Vilahamn was appointed as Tottenham Women’s new head coach shortly after Postecoglou’s arrival in and the Swede told talkSPORT in the summer about how he was trying to replicate the Australian’s style of play in his new role. It has certainly had the desired effect as Spurs have been one of the stories of the Women’s Super League (WSL) season, winning plaudits for their attractive brand of football. Despite recent heavy defeats to Manchester City and Manchester United, there is still plenty to be excited about for Spurs – who sit in sixth place in the table - and Bartrip says Vilahamn has given belief to the squad after an underwhelming season last year. Speaking exclusively to talkSPORT, Bartrip said: “There are similarities [between Vilahamn and Postecoglou]. I think you can see very clearly that there are. They want to play a way and they’re going to play a way where it doesn’t matter who the opposition is. “We’re going to play the Tottenham way and in the next few years, you’re going to see it be successful because that’s what the club wants. “So, in that way, it’s actually a really refreshing thing to be a part of [because] you know that this is the way we want to play and you just have to adapt to it. I’m lucky that I think this style suits me a lot, but at the same time, I think it’s really important that as footballers, you have to be adaptable. “The biggest thing Robert’s brought to us is just to be brave and I think that comes on the pitch [and] off the pitch [and] it puts people out of their comfort zone and I don’t think a lot of people are used to it. “He’s given me a lot of confidence. I am a confidence player – I’m not going to shy away from that – and he’s believed in all of us I think and it’s not easy to be a manager of 26 players. “He is definitely a manager you want to play for. He’s actually a really funny guy, too, and I think it helps when sometimes, you feel like they’re a real human and you can talk to them about other things that doesn’t even involve football. To be able to connect in that way is so important.” Bartrip has excelled this season for Spurs and worn the captain’s armband in Bethany England’s absence, with the Lionesses forward missing most of the season through injury. The centre-back’s performances have impressed her manager, with Vilahamn touting Bartrip for a future England call-up, and representing her country would be a dream come true for the 27-year-old. “I’d be lying to say that wasn’t a dream of mine. It is [a dream] and I think I’ve dreamt of it since I was a little kid. But I can only do what’s within my control. Right now, Tottenham’s in my control,” she explained. “It's all about the team for me. If we could get Champions League, that would be amazing. But at the same time, I think we just need to take every game as it comes. We really do. This league has got tougher and tougher every single season and teams are beating teams that you don’t expect.” Playing for the Lionesses would cap off a remarkable turn-around for Bartrip, who has openly spoken about her struggles with anxiety, depression and anorexia as a teenager. The 27-year-old now uses her platform to help create change as a mental health advocate and will be a part of the Spurs squad that walks out at the Tottenham Hotspur stadium this weekend as part of a huge North London derby in the WSL against Arsenal. Spurs have never beaten Arsenal - but did share a thrilling 3-3 draw with their locals in the Conti Cup in midweek – but Bartrip believes this could be the year they get one over the Gunners. “I really hope so. There’s a really good aura around the club at the moment [in both the] men’s and women’s [teams] and I think that’s also a massive thing in [terms of] how you play,” she finished. “I think you watch the men’s [team] and they’re doing really well. With us, we’ve got a new style and a new identity and people want to watch it. Hopefully, we can bring that style and give them a proper game because that’s what North London Derbies are about right?!” Postecoglou's Tottenham take on Nottingham Forest at the City Ground at 8pm on Friday night - live on talkSPORT!","pubDate":"2023-12-15 12:08:50","image_url":"https://talksport.com/wp-content/uploads/sites/5/2023/12/robert-vilahamn-manager-tottenham-hotspur-866116513.jpg?strip=all&w=960","source_id":"talksport","source_priority":4624,"country":["united kingdom"],"category":["sports"],"language":"english"}]}