{"newsArray":[{"title":"Два зашеметяващи пропуска на Кристиано Роналдо при равенството на Ал Насър (видео)","link":"https://gong.bg/football-sviat/drugi/multimedia/video/dva-zashemetiavashti-propuska-na-kristiano-ronaldo-pri-ravenstvoto-na-al-nasyr-video-718777","keywords":["no"],"creator":null,"video_url":null,"description":"Кристиано Роналдо отбеляза първия си гол с екипа на Ал Насър. Той се оказа много ценен за отбора, тъй като го спаси от загуба в шампионатното гостуване на Ал Фатех, завършило 2:2. Португалецът беше точен от дузпа в добавеното време на двубоя, с което оформи крайния резултат. По-рано в срещата обаче Ронал...","content":"Кристиано Роналдо отбеляза първия си гол с екипа на Ал Насър. Той се оказа много ценен за отбора, тъй като го спаси от загуба в шампионатното гостуване на Ал Фатех, завършило 2:2. Португалецът беше точен от дузпа в добавеното време на двубоя, с което оформи крайния резултат. По-рано в срещата обаче Роналдо попадна под светлините на прожекторите с два ужасяващи пропуска. Нападателят изпусна две чисти положения за тима си в рамките на няколко минути при резултат 1:0 за Ал Фатех. @projectfootball Cristiano Ronaldo missed two huge chances for Al Nassr in the furst half of their game against Al Fateh 😳 #ronaldo #alnassr #football ♬ original sound - Daniel Първият пропуск е в 35-ата минута като Роналдо прати топката от бялата точка за изпълнение на дузпи право в напречната греда. Вторият пропуск е още по-шокиращ, тъй като португалецът не успя да уцели опразнената врата, след като топката срещна гредата при удар на негов съотборник. Cristiano Ronaldo misses two sitters in a matter of minutes for Al Nassr, his teammates were stunned. pic.twitter.com/6h00bIbrlq — SPORTbible (@sportbible) February 3, 2023","pubDate":"2023-02-04 08:18:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"ЦСКА 1948 показва състава за пролетта срещу Спартак Плевен","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/cska-1948-pokazva-systava-za-proletta-sreshtu-spartak-pleven-718774","keywords":["no"],"creator":null,"video_url":null,"description":"Отборът на ЦСКА 1948 излиза днес срещу Спартак Плевен в последната си контрола от зимната подготовка. Мачът е от 13:00 часа и ще се играе на стадиона в столичния комплекс „Царско село”. Треньорът на \"червените\" Тодор Янчев призна, че е избистрил титулярния състав за първия двубой от efbet Лига на 90% и и...","content":"Отборът на ЦСКА 1948 излиза днес срещу Спартак Плевен в последната си контрола от зимната подготовка. Мачът е от 13:00 часа и ще се играе на стадиона в столичния комплекс „Царско село”. Треньорът на \"червените\" Тодор Янчев призна, че е избистрил титулярния състав за първия двубой от efbet Лига на 90% и има колебния само за 1-2 поста. Очаква се в днешната проверка със Спартак Плевен да започнат 11-те, които ще стартират и срещу Хебър след седмица. По време на лагера в турския курорт Белек отборът на ЦСКА 1948 не загуби нито една от петте контроли, които изигра. \"Червените\" спечелиха срещу северномакедонския Шкендия (2:0), Аксу от Казахстан (4:1), сръбския Чукарички (2:1) и немския Ханза Рощок (2:1), а завърши 0:0 с грузинския Торпедо Кутаиси. efbet подкрепя българския спорт","pubDate":"2023-02-04 08:07:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Zwischen Wunder und Stromausfall: So liefen die letzten Super Bowls!","link":"https://www.nordbayern.de/sport/zwischen-wunder-und-stromausfall-so-liefen-die-letzten-super-bowls-1.8544771","keywords":null,"creator":null,"video_url":null,"description":"Es ist das größte Endspiel im American Football: Der legendäre Super Bowl. In diesem einem Duell entscheidet sich die Meisterschaft in der US-Profiliga NFL - und weil es um so viel geht, gab es schon viele legendäre Aufeinandertreffen. Wir blicken auf alle Super Bowls seit 2010 zurück und erzählen Geschichten von Stromausfällen, mutigen Entscheidungen und dem ewigen Tom Brady.","content":"Es ist das größte Endspiel im American Football: Der legendäre Super Bowl. In diesem einem Duell entscheidet sich die Meisterschaft in der US-Profiliga NFL - und weil es um so viel geht, gab es schon viele legendäre Aufeinandertreffen. Wir blicken auf alle Super Bowls seit 2010 zurück und erzählen Geschichten von Stromausfällen, mutigen Entscheidungen und dem ewigen Tom Brady. Im Sommer 2005 richtete Hurrikan Katrina verheerende Schäden im Südosten der USA an. Besonders hart getroffen wurde dabei der Großraum New Orleans, weite Teile des Stadtgebietes standen unter Wasser. Zigtausende Menschen mussten im Louisiana Superdome, dem Stadion der New Orleans Saints, Zuflucht finden. Und als sich die Stadt in den folgenden Jahren von der Naturkatastrophe erholte, stiegen auch die Saints heldenhaft empor: Am 7. Februar 2010 stand das Team um Quarterback Drew Brees erstmals im Super Bowl. Gegen die favorisierten Indianapolis Colts erwischte New Orleans im Dolphins Stadium im sonnigen Miami keinen besonders guten Start, die eigentlich so starke Offensive - kein Team erzielte während der Hauptrunde der Saison mehr Punkte - geriet komplett ins Stocken. Lediglich zwei Field Goals durch Saints-Kicker Garrett Hartley hielt die Saints im Spiel. Zu Beginn der zweiten Hälfte ließ sich Saints-Coach Sean Payton dann aber etwas einfallen: Mit einem völlig überraschenden Onside Kick erwischte er die Colts auf dem falschen Fuß, die Saints hingegen nutzten den anschließenden Ballbesitz, um erstmals in der Partie in Führung zu gehen. Durch eine überragende Schlussoffensive entschied New Orleans dann Super Bowl XLIV mit 31:17 für sich und gewann erstmals die so begehrte Lombardi Trophy - für eine Stadt, die es in den Jahren davor alles andere als einfach hatte. © imago sportfotodienst Ein Duell der Giganten wartete am 6. Februar 2011 im Cowboys Stadium in Arlington, Texas auf die Football-Fans: Die Green Bay Packers kamen als sechstplatziertes Team in der NFC bis in den Super Bowl, wären gegen die Pittsburgh Steelers (Nummer zwei in der AFC) also auf dem Papier der Underdog gewesen. Doch mit starken Leistungen in den Playoffs spielte sich das Team um Star-Quarterback Aaron Rodgers in die Favoritenrolle und ließ auch im ersten Viertel nichts anbrennen. Erst als \"Big Ben\" Roethlisberger und die Offensive der Steelers in Rollen kam, entwickelte sich eine Schlacht zwischen zwei defensivstarken Teams. Pittsburgh war in der Schlussphase wieder nah dran und erhielt mit etwas mehr als zwei Minuten auf der Uhr und einem Sechs-Punkte-Rückstand wieder den Ball - doch die Packers-Defense um Clay Matthews, A. J. Hawk und B. J. Raji hielt Stand und verteidigte die Führung. Die Lombardi-Trophy kam also nach Hause und bescherte den Packers den vierten Super-Bowl-Sieg und die insgesamt 13. NFL-Meisterschaft. © Timothy A. Clary/AFP Super Bowl XLVI war die Neuauflage des Endspiels von 2008, als die New York Giants den New England Patriots die \"perfekte Saison\" mit 19 Siegen in 19 Spielen versauten. Entsprechend heiß war das Team von Bill Belichick und Tom Brady, sich an den Giants zu rächen - doch auch am 5. Februar 2012 bewiesen die Giants im Lucas Oil Stadium von Indianapolis, dass sie eine Art Kryptonit für das Erfolgsrezept der Patriots sind. Mit einer bärenstarken Defensivleistung in der zweiten Hälfte gelang es dem von Tom Coughlin trainierten Team, in Schlagdistanz zu bleiben. In der letzten Minute des Spiels warf New-York-Quarterback Eli Manning den entscheidenden Pass auf Ahmad Bradshaw, die Giants gingen in Führung - und verteidigten diese bis zum Ende. Für die Giants war es der vierte Super Bowl der Teamgeschichte. © Steven C. Mitchell/dpa Eigentlich war es eine klare Sache am 3. Februar 2013: Im Super Bowl XLVII waren die Baltimore Ravens den San Francisco 49ers eigentlich klar überlegen und führten zu Beginn der zweiten Halbzeit klar mit 28:6. Dann aber fiel plötzlich das Licht im Mercedes-Benz-Superdome von New Orleans aus, die Ravens verloren den Schwung und San Francisco nutzte die Pause, um sich zu sammeln. Kaum waren die Lichter wieder an, drehte das Team um Colin Kaepernick auf und kam bis auf zwei Punkte ran - ehe Baltimore mit cleverem Zeitmanagement von Coach John Harbaugh und Quarterback Joe Flacco die Zeit von der Uhr nahm und den Vorsprung verteidigte. © Andy Lyons/AFP Es war eine Machtdemonstration der Seattle Seahawks, die am 2. Februar 2014 den Super Bowl XLVIII prägte: Das Team von Coach Pete Carroll war nicht nur in der Offensive dank Russell Wilson und Marshawn Lynch unaufhaltsam, sondern auch in der Defensive - zu dieser Zeit auch \"Legion of Boom\" genannt - deutlich stärker als die Denver Broncos, die an jenem Abend in New Jersey ihr Kontrahent waren. Mit einer 22:0-Führung ging es in die Pause, am Ende stand ein klarer 43:8-Sieg, der keinen Zweifel ließ, wer diesen Meistertitel verdient hatte. © Tannen Maury/dpa Nur ein Jahr später standen erneut die Seattle Seahawks im Endspiel, diesmal aber gegen die New England Patriots. In einer hart umkämpften Partie am 1. Februar 2015 spielte sich Seattle eine Zehn-Punkte-Führung für das letzte Viertel heraus, doch die Patriots wären nicht die Patriots, wenn sie darauf keine Antwort gehabt hätten. Tom Brady führte die Aufholjagd an, brachte New England wieder in Front - doch den letzten Ballbesitz hatten die Seahawks. Zum entscheidenden Faktor des Spiels avancierte dann Patriots-Rookie Malcolm Butler, der einen Pass von Seahawks-Quarterback Russell Wilson abfing und den vierten Super-Bowl-Titel für das Team aus Massachusetts besiegelte. © Christian Petersen/AFP Es war der letzte große Auftritt von Peyton Manning. Am 7. Februar 2016 traf der legendäre Quarterback mit seinen Denver Broncos auf die Carolina Panthers. Dank einer dominanten Defensivleistung, bei der allen voran Broncos-Linebacker Von Miller überzeugte, fuhr Denver einen relativ ungefährdeten 24:10-Sieg ein - Manning zog mit seinem Bruder Eli gleich und holte in Santa Clara seinen zweiten Super Bowl, ehe er die Schuhe an den Nagel hing und seine eindrucksvolle Karriere beendete. © Patrick Smith/AFP Und wieder einmal Tom Brady: Am 5. Februar 2017 holte der Dauerbrenner-Quarterback seinen fünften Super Bowl. Eigentlich war es im NRG Stadium von Houston schon aussichtslos aus Sicht der Patriots, drei Minuten vor Ende des dritten Viertels lag Atlanta fast schon uneinholbar mit 28:3 vorne. Aber eben nur fast, denn dann folgte ein schlechtes Zeitmanagement Atlantas, ein wieder einmal glänzend aufgelegter Brady und die größte Aufholjagd in der Super-Bowl-Geschichte. Mit 28:28 ging es erstmals bei einem Super Bowl in die Verlängerung, die Patriots gewannen den Münzwurf und nutzten gleich den ersten Ballbesitz für den Sieg. © Timothy A. Clary/AFP Sie waren favorisiert und erneut sah alles danach aus, als könnten die New England Patriots erneut ihre Vormachtstellung deutlich machen. Gegen die Philadelphia Eagles, den absoluten Underdog, war New England klar favorisiert. Den Eagles war zuvor Quarterback Carson Wentz verletzungsbedingt ausgefallen, sein Ersatzmann Nick Foles wurde ins kalte Wasser geworfen - und lernte schneller schwimmen als ein Otter im kalifornischen Zoo. Am 4. Februar 2018 schrieb Foles Geschichte, weil es ihm gelang, die New England Patriots in einen Shootout zu involvieren. Brady war dem an diesem Abend in Minneapolis nicht gewachsen und vergab in der Crunchtime die Chance, den sechsten Ring zu holen. Die Eagles feierten damit ihren ersten Super-Bowl-Sieg und ihre zweite NFL-Meisterschaft in einem denkwürdigen Spiel, das Rekorde brach. Beispielsweise die meisten überbrückten Yards in einem Super Bowl (1151 Yards) und die meisten Punkte, die das verlierende Team je in einem Super Bowl erzielte. © Timothy A. Clary/AFP Wieder einmal standen die New England Patriots mit Quarterback Brady und Headcoach Belichick im Super Bowl. Überraschender dagegen war der zweite Finalteilnehmer: Die Los Angeles Rams. Mit dem jüngsten Trainer der Liga, Sean McVay, und einem ebenfalls jungen Quarterback, Jared Goff, waren sie die Underdogs. Leider gab es während Super Bowl LIII kaum Überraschungen, bis zum letzten Viertel war kein einziger Touchdown gefallen. Das Spiel, das als einer der unspektakulärsten Super Bowls in die Geschichte einging, endete dank eines späten Touchdowns von Patriots-Runningback Sony Michel mit einem Sieg für New England. McVay gab anschließend zu, dass er \"ausgecoached\" wurde und auch Brady konnte keine Bestleistung abrufen. © HARRY HOW, AFP Für die Region war es ein ganz besonderes Spiel: Mit Mark Nzeocha stand ein gebürtiger Franke beim Super Bowl LIV auf dem Feld. Mit den San Francisco 49ers ging es für Nzeocha gegen die Kansas City Chiefs um Superstar Patrick Mahomes. Drei Viertel lang zeigte das Team aus Kalifornien eine starke Leistung und ging mit einer 20:10-Führung in den Schlussabschnitt - in dem Mahomes, Kelce und Co. plötzlich richtig aufdrehten. Mit einer dominanten Schlussdefensive und zwei schnellen Touchdowns drehte Kansas City die Partie und gewann zum zweiten Mal den Titel. Nzeocha ging aber nicht ganz leer aus: Immerhin durfte sich der Linebacker ins Goldene Buch von Rothenburg eintragen. © SAM GREENWOOD, AFP Es musste wohl so kommen. Die Tampa Bay Buccaneers hatten ein Heimspiel gegen die Kansas City Chiefs und ließen sich die wohl einmalige Chance nicht entgehen. Im Duell zweier Quarterback-Generationen zeigte Altmeister Tom Brady seinem jungen Herausforderer Patrick Mahomes die Grenzen auf und reckte hinterher zum sieben Mal in seiner Karriere die Vince Lombardi Trophy in den Himmel. Besonders beeindruckend: Die Offensive der Bucs kombinierte Lauf- und Passspielzüge eindrucksvoll und blieb drei Viertel lang absolut dominant - ehe sie sich mehr auf das Spiel mit der Uhr konzentrierte. Tampas Defensive hingegen ließ keinen einzigen Touchdown der sonst so offensivstarken Chiefs zu. © Ashley Landis, dpa Ein Super Bowl im eigenen Stadion - und das gleich zweimal in Folge. Wie die Buccaneers im Vorjahr gelang es den Los Angeles Rams im Jahr 2022, ins Finale in der eigenen Stadt einzuziehen. Für die Rams, die erst 2016 wieder aus St. Louis in die kalifornische Metropole gezogen waren, stand an jenem 13. Februar 2023 einiges auf dem Spiel. Das Team um Headcoach Sean McVay verstärkte sich mit hochkarätigen Neuzugängen und priorisierte eine erfolgreiche sportliche Gegenwart über eine erfolgreiche sportliche Zukunft. Auf der anderen Seite standen die Cincinnati Bengals, die mit jungen Supertalenten wie Joe Burrow, Ja'Marr Chase oder Tee Higgins gerade erst am Anfang der Entwicklung standen. In einer durchgehend knappen und spannenden Partie lieferten sich beide Teams einen sehenswerten Schlagabtausch. Die Bengals gingen im dritten Viertel verdient in Führung, konnten aber nicht nachlegen. Im Schlussabschnitt gelang den Rams dann noch einmal ein erfolgreicher Drive, der spätere Super-Bowl-MVP Cooper Kupp fing den Touchdown-Pass zum Sieg - und die Rams durften sich durch das 23:20 erstmals in ihrer Geschichte als Los Angeles Rams Super-Bowl-Champion nennen. © IMAGO/Mark J. Rebilas","pubDate":"2023-02-04 07:59:42","image_url":null,"source_id":"nordbayern","category":["sports"],"country":["germany"],"language":"german"},{"title":"News24.com | Ten Hag warns against Greenwood distraction for Man United","link":"https://www.news24.com/sport/Soccer/EnglishPremiership/ten-hag-warns-against-greenwood-distraction-for-man-united-20230204","keywords":null,"creator":null,"video_url":null,"description":"Manchester United manager Erik ten Hag told his players not to be distracted by Mason Greenwood's future on Friday, 24 hours after criminal charges against the 21-year-old forward were dropped.","content":"Manchester United manager Erik ten Hag told his players not to be distracted by Mason Greenwood's future on Friday, 24 hours after criminal charges against the 21-year-old forward were dropped. Greenwood had been facing charges including attempted rape and assault, but prosecutors said the case had been discontinued following the withdrawal of key witnesses and \"new material that came to light\". United issued a statement on Thursday saying the club would now \"conduct its own process before determining next steps\". In a short statement released on his behalf, Greenwood said he was \"relieved the matter is now over\". At a pre-match press conference on Friday, Ten Hag refused to be drawn on the subject. \"I can't add anything,\" said the Dutch manager, in his first season at Old Trafford. \"I refer to the statement of the club.\" Greenwood, who has two and a half years left on his contract, has been suspended from both training and playing for United since his arrest in January 2022. But with United still involved in four competitions, Ten Hag is keen for his players to be focused on the job at hand. \"That's our job, not to get distracted by anything,\" Ten Hag added. \"We are human beings and sometimes there are issues, we are not like robots, but we have to focus on our job. \"We have so many games so we don't have time to get distracted by anything. It's not easy but that is our job.\" Ten Hag has been credited with transforming United's fortunes as they sit fourth in the Premier League and reached the League Cup final this week for the first time in six years. Purse strings tightened But fatigue could halt their progress with the Red Devils also still in the running for the FA Cup and Europa League. Ten Hag was only able to add three loan signings: Marcel Sabitzer, Wout Weghorst and Jack Butland in January as the purse strings at Old Trafford were tightened as the Glazer family explore the possibility of selling the club. \"Of course we need players to cover that because there is a limit on every player but I think we have a depth in our squad,\" said Ten Hag. \"Maybe not that far as other teams but that also has something to do with your approach to it and how you do your load management. If you do that right, I think we can go far.\" Sabitzer could go straight into the side for Saturday's match against Crystal Palace following a deadline-day loan move from Bayern Munich. \"He did only one session but you can see he's a very fit player,\" said Ten Hag, who signed the Austrian after playmaker Christian Eriksen was ruled out until early May. \"I didn't have different expectations coming from Bayern Munich. In Germany their fitness is always good. I think he is ready to play.\" United defender Raphael Varane announced his retirement from international football on Thursday after a France career in which he won the World Cup in 2018 and finished as a runner-up last year in Qatar. France's loss could be United's gain if the 29-year-old former Real Madrid centre-back is able to extend his club career. \"For United, I think it's good news,\" Ten Hag said. \"Rapha achieved everything in terms of football club-wise but also with his nation. \"It is incredible what he achieved, big respect, and I am happy he puts all his energy and experience into the team.\"","pubDate":"2023-02-04 07:51:47","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Левски търси спонсор, за да привлече крило","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/levski-tyrsi-sponsor-za-da-privleche-krilo-718773","keywords":["no"],"creator":null,"video_url":null,"description":"Левски търси спонсор, който да помогне на клуба да купи испанеца Джавад ел Джемали, който е желан от старши треньора на \"сините\" Станимир Стоилов, пише \"Телеграф\". Към днешна дата 20-годишният футболист е собственост на кипърския Акритас Хлорака. Двата клуба са в напреднали преговори за трансфера му, а к...","content":"Левски търси спонсор, който да помогне на клуба да купи испанеца Джавад ел Джемали, който е желан от старши треньора на \"сините\" Станимир Стоилов, пише \"Телеграф\". Към днешна дата 20-годишният футболист е собственост на кипърския Акритас Хлорака. Двата клуба са в напреднали преговори за трансфера му, а към днешна дата цената на Джемали, който е юноша на испанския Еспаньол и има марокански корени, е 100 000 евро. Кипърците не искат да отстъпват и цент от въпросната сума, която обаче е непосилна за Левски. Заради това ръководството на \"сините\" търси спонсор, който да помогне финансова за трансфера. На \"Герена\" се обсъжда, ако някой фирма даде пари за сделката, да си получи обратно сумата дори с печалба, ако Джавад ел Джемали впоследствие бъде продаден за повече пари. Най-вероятно крилото, което е в Акритас от лятото на 2021 година, ще акостира в Левски. Младокът е твърд титуляр в кипърския тим от началото на сезона, а треньор му е бившият наставник на Локомотив Пловдив и ЦСКА Бруно Акрапович. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:49:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Билал Бари увеличава натоварванията","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/bilal-bari-uvelichava-natovarvaniiata-718772","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Нападателят на Левски Билал Бари увеличи натоварванията. В момента мароканецът с френски паспорт се възстановява от операцията, която претърпя в края на август. Футболистът получи тежка контузия в коляното по време на тренировка на сините и оттогава е аут от терените. Интервенцията бе извършена в Лион, а след това Бари започна да провежда рехабилитацията си в базата на френските национали Клерфонтен. Мароканецът често използва социалните мрежи, за да качва видеа от възстановяването си, като от последните стана ясно, че започва да увеличава натоварванията и е започнал бегови упражнения. Той вече започва да вдига и тежести с оперирания си крак, като сега трябва наново да изгражда мускулатурата на засегнатото място. През този сезон нападателят изигра 11 двубоя във всички турнири със синия екип, в които вкара три гола. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:45:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Ето кои трима играчи ще се борят за \"Футболист на годината\"","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/eto-koi-igrachi-shte-se-boriat-za-futbolist-na-godinata-718770","keywords":["no"],"creator":null,"video_url":null,"description":"Националите на Лудогорец Кирил Десподов и Антон Недялков са фаворити за Футболист №1 на 2022 година на България. Победителите от 62-ата анкета ще бъдат обявени в неделя, 5 февруари. Церемонията ще се проведе в Pirotska 5 Event Center в София. На събитието ще стане ясна призовата тройка при българските футболисти за...","content":"Националите на Лудогорец Кирил Десподов и Антон Недялков са фаворити за Футболист №1 на 2022 година на България. Победителите от 62-ата анкета ще бъдат обявени в неделя, 5 февруари. Церемонията ще се проведе в Pirotska 5 Event Center в София. На събитието ще стане ясна призовата тройка при българските футболисти за 2022 г. след гласуването на спортните журналисти. За челно място ще се бори и Илия Груев-младши, който играе във Вердер. Фаворит за приза обаче е Кирил Десподов. На събитието ще бъде обявен треньор №1 на България и неговите подгласници. Ще станат ясни и най-добрите в родното първенство за 2022 г. - най-добър вратар, най-добър защитник, най-добър полузащитник, най-добър нападател, най-добър чужденец. Ще бъде връчена и наградата за най-прогресиращ млад играч в българския футбол. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:36:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"I won the Champions League more times than Lionel Messi, but now I have no club and I’m only 30… these things happen","link":"https://www.thesun.co.uk/sport/21251701/more-champions-league-messi-unemployed-transfer/","keywords":["Football","Sport","Champions League"],"creator":["Dave Fraser"],"video_url":null,"description":null,"content":"A SERIAL winner, a 38-cap international, boasting more Champions League titles than Lionel Messi and still in his prime years. Also... unemployed. Once upon a time, the skilful midfielder was one of the most-sought-after stars in Europe. The Spain star, still only 30, is one of the most-decorated players in world football. And yet, at the conclusion of the January transfer window, he finds himself without a club. The man in question: former Real Madrid maestro Isco . Part of Valencia's talent factory of the 00s, Isco made his name at Malaga before securing a massive move to Real Madrid in 2013. In nine years at the Bernabeu, the midfielder contributed to over 100 goals in 353 games. Isco won a staggering five Champions League crowns, as well as three LaLiga titles until he departed in 2022, joining Sevilla. The 2012 Golden Boy was once on the radar of every Premier League \"Big Six\" side. BETTING SPECIAL - BEST FOOTBALL BETTING SITES IN THE UK But interest cooled in his later Los Blancos years, with Sevilla taking a chance on him in August 2022. After just four months and only 14 LaLiga games, his contract was terminated . On deadline day, Isco was on the brink of a free transfer to Bundesliga high-flyers Union Berlin. But the deal collapsed as the club cryptically claimed: \"We have our limits.\" Fabrizio Romano has since revealed the \"deal collapsed because financial conditions of the deal changed after the medical tests.\" According to Spanish pundit Anton Meana, the late shock is a blessing in disguise for Union Berlin. Meana brutally claimed: “I think Isco would have been a problem for Union. \"I don’t think Isco is up to that level of football, I don’t think he suits the Bundesliga, and even less so Union Berlin. “I think that Union have come out of this winning from all of the noise this generated on social media.” As a result, Isco currently finds himself unemployed. He has been linked with a move to Turkey - with the transfer window open until February 8. But for now, the man who was one of Spain's brightest young talents faces the very real possibility of being tossed on the scrapheap.","pubDate":"2023-02-04 07:33:01","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Конте може да води Тотнъм срещу Манчестър Сити, само пет дена след операцията","link":"https://gong.bg/football-sviat/anglia/multimedia/video/konte-mozhe-da-vodi-totnym-sreshtu-manchestyr-siti-samo-pet-dena-sled-operaciiata-718768","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Старши треньорът на Тотнъм - Антонио Конте, може да се завърне край терена още в неделя в предстоящото дерби срещу Манчестър Сити, само пет дни след операцията за отстраняване на жлъчния му мехур. Конте ще вземе окончателно решение след консултация със своя хирург в навечерието на мача, заяви неговият помощник Кристиан Стелини. „Решението ще бъде взето от Конте в часовете преди мача“, сподели Стелини. „Готови сме да направим всичко и Антонио и вероятно лекарите ще трябва да решат“, добави той. 53-годишният Конте се завърна в родината си след победата над Престън за ФА къп, но беше приет в болница заради \"остри коремни болки\". В момента той се възстановява заедно със своето семейство. Конте заяви, че операцията, която претърпя за отстраняване на жлъчния мехур, е преминала добре. Италианецът увери, че се чувства по-добре и благодари за съобщенията, които е получил. „Благодаря за всички чудесни съобщения. Операцията ми мина добре. Сега е време за възстановяване, но нямам търпение да се върна на терена при моя отбор“, написа италианският треньор в профила си в социалната мрежа Instagram.","pubDate":"2023-02-04 07:32:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Клуб от efbet Лига взима бивш футболист на Левски","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/klub-ot-efbet-liga-vzima-bivsh-futbolist-na-levski-718767","keywords":["no"],"creator":null,"video_url":null,"description":"Локомотив (София) очаква халфа Мартин Райнов. На 12 януари полузащитникът стана свободен агент, след като приключи отношенията си с румънския Арджеш. Бившият футболист на Левски, Берое, Локомотив (Пловдив) и други е разговарял с ръководството на столичните железничари. Двубоят се изигра на стадиона на...","content":"Локомотив (София) очаква халфа Мартин Райнов. На 12 януари полузащитникът стана свободен агент, след като приключи отношенията си с румънския Арджеш. Бившият футболист на Левски, Берое, Локомотив (Пловдив) и други е разговарял с ръководството на столичните железничари. Двубоят се изигра на стадиона на \"железничарите\" в столичния квартал \"Надежда\" Райнов е обявил, че, ако не си намери нов отбор в чужбина ще подсили \"червено-черните\". Така той е гласен за заместник на напусналия в посока ниските нива на футбола в Полша Симеон Славчев. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:30:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Два зашеметяващи пропуска на Кристиано Роналдо при равенството на Ал Насър (видео)","link":"https://gong.bg/football-sviat/drugi/multimedia/video/dva-zashemetiavashti-propuska-na-kristiano-ronaldo-pri-ravenstvoto-na-al-nasyr-video-718777","keywords":["no"],"creator":null,"video_url":null,"description":"Кристиано Роналдо отбеляза първия си гол с екипа на Ал Насър. Той се оказа много ценен за отбора, тъй като го спаси от загуба в шампионатното гостуване на Ал Фатех, завършило 2:2. Португалецът беше точен от дузпа в добавеното време на двубоя, с което оформи крайния резултат. По-рано в срещата обаче Ронал...","content":"Кристиано Роналдо отбеляза първия си гол с екипа на Ал Насър. Той се оказа много ценен за отбора, тъй като го спаси от загуба в шампионатното гостуване на Ал Фатех, завършило 2:2. Португалецът беше точен от дузпа в добавеното време на двубоя, с което оформи крайния резултат. По-рано в срещата обаче Роналдо попадна под светлините на прожекторите с два ужасяващи пропуска. Нападателят изпусна две чисти положения за тима си в рамките на няколко минути при резултат 1:0 за Ал Фатех. @projectfootball Cristiano Ronaldo missed two huge chances for Al Nassr in the furst half of their game against Al Fateh 😳 #ronaldo #alnassr #football ♬ original sound - Daniel Първият пропуск е в 35-ата минута като Роналдо прати топката от бялата точка за изпълнение на дузпи право в напречната греда. Вторият пропуск е още по-шокиращ, тъй като португалецът не успя да уцели опразнената врата, след като топката срещна гредата при удар на негов съотборник. Cristiano Ronaldo misses two sitters in a matter of minutes for Al Nassr, his teammates were stunned. pic.twitter.com/6h00bIbrlq — SPORTbible (@sportbible) February 3, 2023","pubDate":"2023-02-04 08:18:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"ЦСКА 1948 показва състава за пролетта срещу Спартак Плевен","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/cska-1948-pokazva-systava-za-proletta-sreshtu-spartak-pleven-718774","keywords":["no"],"creator":null,"video_url":null,"description":"Отборът на ЦСКА 1948 излиза днес срещу Спартак Плевен в последната си контрола от зимната подготовка. Мачът е от 13:00 часа и ще се играе на стадиона в столичния комплекс „Царско село”. Треньорът на \"червените\" Тодор Янчев призна, че е избистрил титулярния състав за първия двубой от efbet Лига на 90% и и...","content":"Отборът на ЦСКА 1948 излиза днес срещу Спартак Плевен в последната си контрола от зимната подготовка. Мачът е от 13:00 часа и ще се играе на стадиона в столичния комплекс „Царско село”. Треньорът на \"червените\" Тодор Янчев призна, че е избистрил титулярния състав за първия двубой от efbet Лига на 90% и има колебния само за 1-2 поста. Очаква се в днешната проверка със Спартак Плевен да започнат 11-те, които ще стартират и срещу Хебър след седмица. По време на лагера в турския курорт Белек отборът на ЦСКА 1948 не загуби нито една от петте контроли, които изигра. \"Червените\" спечелиха срещу северномакедонския Шкендия (2:0), Аксу от Казахстан (4:1), сръбския Чукарички (2:1) и немския Ханза Рощок (2:1), а завърши 0:0 с грузинския Торпедо Кутаиси. efbet подкрепя българския спорт","pubDate":"2023-02-04 08:07:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Zwischen Wunder und Stromausfall: So liefen die letzten Super Bowls!","link":"https://www.nordbayern.de/sport/zwischen-wunder-und-stromausfall-so-liefen-die-letzten-super-bowls-1.8544771","keywords":null,"creator":null,"video_url":null,"description":"Es ist das größte Endspiel im American Football: Der legendäre Super Bowl. In diesem einem Duell entscheidet sich die Meisterschaft in der US-Profiliga NFL - und weil es um so viel geht, gab es schon viele legendäre Aufeinandertreffen. Wir blicken auf alle Super Bowls seit 2010 zurück und erzählen Geschichten von Stromausfällen, mutigen Entscheidungen und dem ewigen Tom Brady.","content":"Es ist das größte Endspiel im American Football: Der legendäre Super Bowl. In diesem einem Duell entscheidet sich die Meisterschaft in der US-Profiliga NFL - und weil es um so viel geht, gab es schon viele legendäre Aufeinandertreffen. Wir blicken auf alle Super Bowls seit 2010 zurück und erzählen Geschichten von Stromausfällen, mutigen Entscheidungen und dem ewigen Tom Brady. Im Sommer 2005 richtete Hurrikan Katrina verheerende Schäden im Südosten der USA an. Besonders hart getroffen wurde dabei der Großraum New Orleans, weite Teile des Stadtgebietes standen unter Wasser. Zigtausende Menschen mussten im Louisiana Superdome, dem Stadion der New Orleans Saints, Zuflucht finden. Und als sich die Stadt in den folgenden Jahren von der Naturkatastrophe erholte, stiegen auch die Saints heldenhaft empor: Am 7. Februar 2010 stand das Team um Quarterback Drew Brees erstmals im Super Bowl. Gegen die favorisierten Indianapolis Colts erwischte New Orleans im Dolphins Stadium im sonnigen Miami keinen besonders guten Start, die eigentlich so starke Offensive - kein Team erzielte während der Hauptrunde der Saison mehr Punkte - geriet komplett ins Stocken. Lediglich zwei Field Goals durch Saints-Kicker Garrett Hartley hielt die Saints im Spiel. Zu Beginn der zweiten Hälfte ließ sich Saints-Coach Sean Payton dann aber etwas einfallen: Mit einem völlig überraschenden Onside Kick erwischte er die Colts auf dem falschen Fuß, die Saints hingegen nutzten den anschließenden Ballbesitz, um erstmals in der Partie in Führung zu gehen. Durch eine überragende Schlussoffensive entschied New Orleans dann Super Bowl XLIV mit 31:17 für sich und gewann erstmals die so begehrte Lombardi Trophy - für eine Stadt, die es in den Jahren davor alles andere als einfach hatte. © imago sportfotodienst Ein Duell der Giganten wartete am 6. Februar 2011 im Cowboys Stadium in Arlington, Texas auf die Football-Fans: Die Green Bay Packers kamen als sechstplatziertes Team in der NFC bis in den Super Bowl, wären gegen die Pittsburgh Steelers (Nummer zwei in der AFC) also auf dem Papier der Underdog gewesen. Doch mit starken Leistungen in den Playoffs spielte sich das Team um Star-Quarterback Aaron Rodgers in die Favoritenrolle und ließ auch im ersten Viertel nichts anbrennen. Erst als \"Big Ben\" Roethlisberger und die Offensive der Steelers in Rollen kam, entwickelte sich eine Schlacht zwischen zwei defensivstarken Teams. Pittsburgh war in der Schlussphase wieder nah dran und erhielt mit etwas mehr als zwei Minuten auf der Uhr und einem Sechs-Punkte-Rückstand wieder den Ball - doch die Packers-Defense um Clay Matthews, A. J. Hawk und B. J. Raji hielt Stand und verteidigte die Führung. Die Lombardi-Trophy kam also nach Hause und bescherte den Packers den vierten Super-Bowl-Sieg und die insgesamt 13. NFL-Meisterschaft. © Timothy A. Clary/AFP Super Bowl XLVI war die Neuauflage des Endspiels von 2008, als die New York Giants den New England Patriots die \"perfekte Saison\" mit 19 Siegen in 19 Spielen versauten. Entsprechend heiß war das Team von Bill Belichick und Tom Brady, sich an den Giants zu rächen - doch auch am 5. Februar 2012 bewiesen die Giants im Lucas Oil Stadium von Indianapolis, dass sie eine Art Kryptonit für das Erfolgsrezept der Patriots sind. Mit einer bärenstarken Defensivleistung in der zweiten Hälfte gelang es dem von Tom Coughlin trainierten Team, in Schlagdistanz zu bleiben. In der letzten Minute des Spiels warf New-York-Quarterback Eli Manning den entscheidenden Pass auf Ahmad Bradshaw, die Giants gingen in Führung - und verteidigten diese bis zum Ende. Für die Giants war es der vierte Super Bowl der Teamgeschichte. © Steven C. Mitchell/dpa Eigentlich war es eine klare Sache am 3. Februar 2013: Im Super Bowl XLVII waren die Baltimore Ravens den San Francisco 49ers eigentlich klar überlegen und führten zu Beginn der zweiten Halbzeit klar mit 28:6. Dann aber fiel plötzlich das Licht im Mercedes-Benz-Superdome von New Orleans aus, die Ravens verloren den Schwung und San Francisco nutzte die Pause, um sich zu sammeln. Kaum waren die Lichter wieder an, drehte das Team um Colin Kaepernick auf und kam bis auf zwei Punkte ran - ehe Baltimore mit cleverem Zeitmanagement von Coach John Harbaugh und Quarterback Joe Flacco die Zeit von der Uhr nahm und den Vorsprung verteidigte. © Andy Lyons/AFP Es war eine Machtdemonstration der Seattle Seahawks, die am 2. Februar 2014 den Super Bowl XLVIII prägte: Das Team von Coach Pete Carroll war nicht nur in der Offensive dank Russell Wilson und Marshawn Lynch unaufhaltsam, sondern auch in der Defensive - zu dieser Zeit auch \"Legion of Boom\" genannt - deutlich stärker als die Denver Broncos, die an jenem Abend in New Jersey ihr Kontrahent waren. Mit einer 22:0-Führung ging es in die Pause, am Ende stand ein klarer 43:8-Sieg, der keinen Zweifel ließ, wer diesen Meistertitel verdient hatte. © Tannen Maury/dpa Nur ein Jahr später standen erneut die Seattle Seahawks im Endspiel, diesmal aber gegen die New England Patriots. In einer hart umkämpften Partie am 1. Februar 2015 spielte sich Seattle eine Zehn-Punkte-Führung für das letzte Viertel heraus, doch die Patriots wären nicht die Patriots, wenn sie darauf keine Antwort gehabt hätten. Tom Brady führte die Aufholjagd an, brachte New England wieder in Front - doch den letzten Ballbesitz hatten die Seahawks. Zum entscheidenden Faktor des Spiels avancierte dann Patriots-Rookie Malcolm Butler, der einen Pass von Seahawks-Quarterback Russell Wilson abfing und den vierten Super-Bowl-Titel für das Team aus Massachusetts besiegelte. © Christian Petersen/AFP Es war der letzte große Auftritt von Peyton Manning. Am 7. Februar 2016 traf der legendäre Quarterback mit seinen Denver Broncos auf die Carolina Panthers. Dank einer dominanten Defensivleistung, bei der allen voran Broncos-Linebacker Von Miller überzeugte, fuhr Denver einen relativ ungefährdeten 24:10-Sieg ein - Manning zog mit seinem Bruder Eli gleich und holte in Santa Clara seinen zweiten Super Bowl, ehe er die Schuhe an den Nagel hing und seine eindrucksvolle Karriere beendete. © Patrick Smith/AFP Und wieder einmal Tom Brady: Am 5. Februar 2017 holte der Dauerbrenner-Quarterback seinen fünften Super Bowl. Eigentlich war es im NRG Stadium von Houston schon aussichtslos aus Sicht der Patriots, drei Minuten vor Ende des dritten Viertels lag Atlanta fast schon uneinholbar mit 28:3 vorne. Aber eben nur fast, denn dann folgte ein schlechtes Zeitmanagement Atlantas, ein wieder einmal glänzend aufgelegter Brady und die größte Aufholjagd in der Super-Bowl-Geschichte. Mit 28:28 ging es erstmals bei einem Super Bowl in die Verlängerung, die Patriots gewannen den Münzwurf und nutzten gleich den ersten Ballbesitz für den Sieg. © Timothy A. Clary/AFP Sie waren favorisiert und erneut sah alles danach aus, als könnten die New England Patriots erneut ihre Vormachtstellung deutlich machen. Gegen die Philadelphia Eagles, den absoluten Underdog, war New England klar favorisiert. Den Eagles war zuvor Quarterback Carson Wentz verletzungsbedingt ausgefallen, sein Ersatzmann Nick Foles wurde ins kalte Wasser geworfen - und lernte schneller schwimmen als ein Otter im kalifornischen Zoo. Am 4. Februar 2018 schrieb Foles Geschichte, weil es ihm gelang, die New England Patriots in einen Shootout zu involvieren. Brady war dem an diesem Abend in Minneapolis nicht gewachsen und vergab in der Crunchtime die Chance, den sechsten Ring zu holen. Die Eagles feierten damit ihren ersten Super-Bowl-Sieg und ihre zweite NFL-Meisterschaft in einem denkwürdigen Spiel, das Rekorde brach. Beispielsweise die meisten überbrückten Yards in einem Super Bowl (1151 Yards) und die meisten Punkte, die das verlierende Team je in einem Super Bowl erzielte. © Timothy A. Clary/AFP Wieder einmal standen die New England Patriots mit Quarterback Brady und Headcoach Belichick im Super Bowl. Überraschender dagegen war der zweite Finalteilnehmer: Die Los Angeles Rams. Mit dem jüngsten Trainer der Liga, Sean McVay, und einem ebenfalls jungen Quarterback, Jared Goff, waren sie die Underdogs. Leider gab es während Super Bowl LIII kaum Überraschungen, bis zum letzten Viertel war kein einziger Touchdown gefallen. Das Spiel, das als einer der unspektakulärsten Super Bowls in die Geschichte einging, endete dank eines späten Touchdowns von Patriots-Runningback Sony Michel mit einem Sieg für New England. McVay gab anschließend zu, dass er \"ausgecoached\" wurde und auch Brady konnte keine Bestleistung abrufen. © HARRY HOW, AFP Für die Region war es ein ganz besonderes Spiel: Mit Mark Nzeocha stand ein gebürtiger Franke beim Super Bowl LIV auf dem Feld. Mit den San Francisco 49ers ging es für Nzeocha gegen die Kansas City Chiefs um Superstar Patrick Mahomes. Drei Viertel lang zeigte das Team aus Kalifornien eine starke Leistung und ging mit einer 20:10-Führung in den Schlussabschnitt - in dem Mahomes, Kelce und Co. plötzlich richtig aufdrehten. Mit einer dominanten Schlussdefensive und zwei schnellen Touchdowns drehte Kansas City die Partie und gewann zum zweiten Mal den Titel. Nzeocha ging aber nicht ganz leer aus: Immerhin durfte sich der Linebacker ins Goldene Buch von Rothenburg eintragen. © SAM GREENWOOD, AFP Es musste wohl so kommen. Die Tampa Bay Buccaneers hatten ein Heimspiel gegen die Kansas City Chiefs und ließen sich die wohl einmalige Chance nicht entgehen. Im Duell zweier Quarterback-Generationen zeigte Altmeister Tom Brady seinem jungen Herausforderer Patrick Mahomes die Grenzen auf und reckte hinterher zum sieben Mal in seiner Karriere die Vince Lombardi Trophy in den Himmel. Besonders beeindruckend: Die Offensive der Bucs kombinierte Lauf- und Passspielzüge eindrucksvoll und blieb drei Viertel lang absolut dominant - ehe sie sich mehr auf das Spiel mit der Uhr konzentrierte. Tampas Defensive hingegen ließ keinen einzigen Touchdown der sonst so offensivstarken Chiefs zu. © Ashley Landis, dpa Ein Super Bowl im eigenen Stadion - und das gleich zweimal in Folge. Wie die Buccaneers im Vorjahr gelang es den Los Angeles Rams im Jahr 2022, ins Finale in der eigenen Stadt einzuziehen. Für die Rams, die erst 2016 wieder aus St. Louis in die kalifornische Metropole gezogen waren, stand an jenem 13. Februar 2023 einiges auf dem Spiel. Das Team um Headcoach Sean McVay verstärkte sich mit hochkarätigen Neuzugängen und priorisierte eine erfolgreiche sportliche Gegenwart über eine erfolgreiche sportliche Zukunft. Auf der anderen Seite standen die Cincinnati Bengals, die mit jungen Supertalenten wie Joe Burrow, Ja'Marr Chase oder Tee Higgins gerade erst am Anfang der Entwicklung standen. In einer durchgehend knappen und spannenden Partie lieferten sich beide Teams einen sehenswerten Schlagabtausch. Die Bengals gingen im dritten Viertel verdient in Führung, konnten aber nicht nachlegen. Im Schlussabschnitt gelang den Rams dann noch einmal ein erfolgreicher Drive, der spätere Super-Bowl-MVP Cooper Kupp fing den Touchdown-Pass zum Sieg - und die Rams durften sich durch das 23:20 erstmals in ihrer Geschichte als Los Angeles Rams Super-Bowl-Champion nennen. © IMAGO/Mark J. Rebilas","pubDate":"2023-02-04 07:59:42","image_url":null,"source_id":"nordbayern","category":["sports"],"country":["germany"],"language":"german"},{"title":"News24.com | Ten Hag warns against Greenwood distraction for Man United","link":"https://www.news24.com/sport/Soccer/EnglishPremiership/ten-hag-warns-against-greenwood-distraction-for-man-united-20230204","keywords":null,"creator":null,"video_url":null,"description":"Manchester United manager Erik ten Hag told his players not to be distracted by Mason Greenwood's future on Friday, 24 hours after criminal charges against the 21-year-old forward were dropped.","content":"Manchester United manager Erik ten Hag told his players not to be distracted by Mason Greenwood's future on Friday, 24 hours after criminal charges against the 21-year-old forward were dropped. Greenwood had been facing charges including attempted rape and assault, but prosecutors said the case had been discontinued following the withdrawal of key witnesses and \"new material that came to light\". United issued a statement on Thursday saying the club would now \"conduct its own process before determining next steps\". In a short statement released on his behalf, Greenwood said he was \"relieved the matter is now over\". At a pre-match press conference on Friday, Ten Hag refused to be drawn on the subject. \"I can't add anything,\" said the Dutch manager, in his first season at Old Trafford. \"I refer to the statement of the club.\" Greenwood, who has two and a half years left on his contract, has been suspended from both training and playing for United since his arrest in January 2022. But with United still involved in four competitions, Ten Hag is keen for his players to be focused on the job at hand. \"That's our job, not to get distracted by anything,\" Ten Hag added. \"We are human beings and sometimes there are issues, we are not like robots, but we have to focus on our job. \"We have so many games so we don't have time to get distracted by anything. It's not easy but that is our job.\" Ten Hag has been credited with transforming United's fortunes as they sit fourth in the Premier League and reached the League Cup final this week for the first time in six years. Purse strings tightened But fatigue could halt their progress with the Red Devils also still in the running for the FA Cup and Europa League. Ten Hag was only able to add three loan signings: Marcel Sabitzer, Wout Weghorst and Jack Butland in January as the purse strings at Old Trafford were tightened as the Glazer family explore the possibility of selling the club. \"Of course we need players to cover that because there is a limit on every player but I think we have a depth in our squad,\" said Ten Hag. \"Maybe not that far as other teams but that also has something to do with your approach to it and how you do your load management. If you do that right, I think we can go far.\" Sabitzer could go straight into the side for Saturday's match against Crystal Palace following a deadline-day loan move from Bayern Munich. \"He did only one session but you can see he's a very fit player,\" said Ten Hag, who signed the Austrian after playmaker Christian Eriksen was ruled out until early May. \"I didn't have different expectations coming from Bayern Munich. In Germany their fitness is always good. I think he is ready to play.\" United defender Raphael Varane announced his retirement from international football on Thursday after a France career in which he won the World Cup in 2018 and finished as a runner-up last year in Qatar. France's loss could be United's gain if the 29-year-old former Real Madrid centre-back is able to extend his club career. \"For United, I think it's good news,\" Ten Hag said. \"Rapha achieved everything in terms of football club-wise but also with his nation. \"It is incredible what he achieved, big respect, and I am happy he puts all his energy and experience into the team.\"","pubDate":"2023-02-04 07:51:47","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Левски търси спонсор, за да привлече крило","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/levski-tyrsi-sponsor-za-da-privleche-krilo-718773","keywords":["no"],"creator":null,"video_url":null,"description":"Левски търси спонсор, който да помогне на клуба да купи испанеца Джавад ел Джемали, който е желан от старши треньора на \"сините\" Станимир Стоилов, пише \"Телеграф\". Към днешна дата 20-годишният футболист е собственост на кипърския Акритас Хлорака. Двата клуба са в напреднали преговори за трансфера му, а к...","content":"Левски търси спонсор, който да помогне на клуба да купи испанеца Джавад ел Джемали, който е желан от старши треньора на \"сините\" Станимир Стоилов, пише \"Телеграф\". Към днешна дата 20-годишният футболист е собственост на кипърския Акритас Хлорака. Двата клуба са в напреднали преговори за трансфера му, а към днешна дата цената на Джемали, който е юноша на испанския Еспаньол и има марокански корени, е 100 000 евро. Кипърците не искат да отстъпват и цент от въпросната сума, която обаче е непосилна за Левски. Заради това ръководството на \"сините\" търси спонсор, който да помогне финансова за трансфера. На \"Герена\" се обсъжда, ако някой фирма даде пари за сделката, да си получи обратно сумата дори с печалба, ако Джавад ел Джемали впоследствие бъде продаден за повече пари. Най-вероятно крилото, което е в Акритас от лятото на 2021 година, ще акостира в Левски. Младокът е твърд титуляр в кипърския тим от началото на сезона, а треньор му е бившият наставник на Локомотив Пловдив и ЦСКА Бруно Акрапович. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:49:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Билал Бари увеличава натоварванията","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/bilal-bari-uvelichava-natovarvaniiata-718772","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Нападателят на Левски Билал Бари увеличи натоварванията. В момента мароканецът с френски паспорт се възстановява от операцията, която претърпя в края на август. Футболистът получи тежка контузия в коляното по време на тренировка на сините и оттогава е аут от терените. Интервенцията бе извършена в Лион, а след това Бари започна да провежда рехабилитацията си в базата на френските национали Клерфонтен. Мароканецът често използва социалните мрежи, за да качва видеа от възстановяването си, като от последните стана ясно, че започва да увеличава натоварванията и е започнал бегови упражнения. Той вече започва да вдига и тежести с оперирания си крак, като сега трябва наново да изгражда мускулатурата на засегнатото място. През този сезон нападателят изигра 11 двубоя във всички турнири със синия екип, в които вкара три гола. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:45:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Ето кои трима играчи ще се борят за \"Футболист на годината\"","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/eto-koi-igrachi-shte-se-boriat-za-futbolist-na-godinata-718770","keywords":["no"],"creator":null,"video_url":null,"description":"Националите на Лудогорец Кирил Десподов и Антон Недялков са фаворити за Футболист №1 на 2022 година на България. Победителите от 62-ата анкета ще бъдат обявени в неделя, 5 февруари. Церемонията ще се проведе в Pirotska 5 Event Center в София. На събитието ще стане ясна призовата тройка при българските футболисти за...","content":"Националите на Лудогорец Кирил Десподов и Антон Недялков са фаворити за Футболист №1 на 2022 година на България. Победителите от 62-ата анкета ще бъдат обявени в неделя, 5 февруари. Церемонията ще се проведе в Pirotska 5 Event Center в София. На събитието ще стане ясна призовата тройка при българските футболисти за 2022 г. след гласуването на спортните журналисти. За челно място ще се бори и Илия Груев-младши, който играе във Вердер. Фаворит за приза обаче е Кирил Десподов. На събитието ще бъде обявен треньор №1 на България и неговите подгласници. Ще станат ясни и най-добрите в родното първенство за 2022 г. - най-добър вратар, най-добър защитник, най-добър полузащитник, най-добър нападател, най-добър чужденец. Ще бъде връчена и наградата за най-прогресиращ млад играч в българския футбол. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:36:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"I won the Champions League more times than Lionel Messi, but now I have no club and I’m only 30… these things happen","link":"https://www.thesun.co.uk/sport/21251701/more-champions-league-messi-unemployed-transfer/","keywords":["Football","Sport","Champions League"],"creator":["Dave Fraser"],"video_url":null,"description":null,"content":"A SERIAL winner, a 38-cap international, boasting more Champions League titles than Lionel Messi and still in his prime years. Also... unemployed. Once upon a time, the skilful midfielder was one of the most-sought-after stars in Europe. The Spain star, still only 30, is one of the most-decorated players in world football. And yet, at the conclusion of the January transfer window, he finds himself without a club. The man in question: former Real Madrid maestro Isco . Part of Valencia's talent factory of the 00s, Isco made his name at Malaga before securing a massive move to Real Madrid in 2013. In nine years at the Bernabeu, the midfielder contributed to over 100 goals in 353 games. Isco won a staggering five Champions League crowns, as well as three LaLiga titles until he departed in 2022, joining Sevilla. The 2012 Golden Boy was once on the radar of every Premier League \"Big Six\" side. BETTING SPECIAL - BEST FOOTBALL BETTING SITES IN THE UK But interest cooled in his later Los Blancos years, with Sevilla taking a chance on him in August 2022. After just four months and only 14 LaLiga games, his contract was terminated . On deadline day, Isco was on the brink of a free transfer to Bundesliga high-flyers Union Berlin. But the deal collapsed as the club cryptically claimed: \"We have our limits.\" Fabrizio Romano has since revealed the \"deal collapsed because financial conditions of the deal changed after the medical tests.\" According to Spanish pundit Anton Meana, the late shock is a blessing in disguise for Union Berlin. Meana brutally claimed: “I think Isco would have been a problem for Union. \"I don’t think Isco is up to that level of football, I don’t think he suits the Bundesliga, and even less so Union Berlin. “I think that Union have come out of this winning from all of the noise this generated on social media.” As a result, Isco currently finds himself unemployed. He has been linked with a move to Turkey - with the transfer window open until February 8. But for now, the man who was one of Spain's brightest young talents faces the very real possibility of being tossed on the scrapheap.","pubDate":"2023-02-04 07:33:01","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Конте може да води Тотнъм срещу Манчестър Сити, само пет дена след операцията","link":"https://gong.bg/football-sviat/anglia/multimedia/video/konte-mozhe-da-vodi-totnym-sreshtu-manchestyr-siti-samo-pet-dena-sled-operaciiata-718768","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Старши треньорът на Тотнъм - Антонио Конте, може да се завърне край терена още в неделя в предстоящото дерби срещу Манчестър Сити, само пет дни след операцията за отстраняване на жлъчния му мехур. Конте ще вземе окончателно решение след консултация със своя хирург в навечерието на мача, заяви неговият помощник Кристиан Стелини. „Решението ще бъде взето от Конте в часовете преди мача“, сподели Стелини. „Готови сме да направим всичко и Антонио и вероятно лекарите ще трябва да решат“, добави той. 53-годишният Конте се завърна в родината си след победата над Престън за ФА къп, но беше приет в болница заради \"остри коремни болки\". В момента той се възстановява заедно със своето семейство. Конте заяви, че операцията, която претърпя за отстраняване на жлъчния мехур, е преминала добре. Италианецът увери, че се чувства по-добре и благодари за съобщенията, които е получил. „Благодаря за всички чудесни съобщения. Операцията ми мина добре. Сега е време за възстановяване, но нямам търпение да се върна на терена при моя отбор“, написа италианският треньор в профила си в социалната мрежа Instagram.","pubDate":"2023-02-04 07:32:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Клуб от efbet Лига взима бивш футболист на Левски","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/klub-ot-efbet-liga-vzima-bivsh-futbolist-na-levski-718767","keywords":["no"],"creator":null,"video_url":null,"description":"Локомотив (София) очаква халфа Мартин Райнов. На 12 януари полузащитникът стана свободен агент, след като приключи отношенията си с румънския Арджеш. Бившият футболист на Левски, Берое, Локомотив (Пловдив) и други е разговарял с ръководството на столичните железничари. Двубоят се изигра на стадиона на...","content":"Локомотив (София) очаква халфа Мартин Райнов. На 12 януари полузащитникът стана свободен агент, след като приключи отношенията си с румънския Арджеш. Бившият футболист на Левски, Берое, Локомотив (Пловдив) и други е разговарял с ръководството на столичните железничари. Двубоят се изигра на стадиона на \"железничарите\" в столичния квартал \"Надежда\" Райнов е обявил, че, ако не си намери нов отбор в чужбина ще подсили \"червено-черните\". Така той е гласен за заместник на напусналия в посока ниските нива на футбола в Полша Симеон Славчев. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:30:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Два зашеметяващи пропуска на Кристиано Роналдо при равенството на Ал Насър (видео)","link":"https://gong.bg/football-sviat/drugi/multimedia/video/dva-zashemetiavashti-propuska-na-kristiano-ronaldo-pri-ravenstvoto-na-al-nasyr-video-718777","keywords":["no"],"creator":null,"video_url":null,"description":"Кристиано Роналдо отбеляза първия си гол с екипа на Ал Насър. Той се оказа много ценен за отбора, тъй като го спаси от загуба в шампионатното гостуване на Ал Фатех, завършило 2:2. Португалецът беше точен от дузпа в добавеното време на двубоя, с което оформи крайния резултат. По-рано в срещата обаче Ронал...","content":"Кристиано Роналдо отбеляза първия си гол с екипа на Ал Насър. Той се оказа много ценен за отбора, тъй като го спаси от загуба в шампионатното гостуване на Ал Фатех, завършило 2:2. Португалецът беше точен от дузпа в добавеното време на двубоя, с което оформи крайния резултат. По-рано в срещата обаче Роналдо попадна под светлините на прожекторите с два ужасяващи пропуска. Нападателят изпусна две чисти положения за тима си в рамките на няколко минути при резултат 1:0 за Ал Фатех. @projectfootball Cristiano Ronaldo missed two huge chances for Al Nassr in the furst half of their game against Al Fateh 😳 #ronaldo #alnassr #football ♬ original sound - Daniel Първият пропуск е в 35-ата минута като Роналдо прати топката от бялата точка за изпълнение на дузпи право в напречната греда. Вторият пропуск е още по-шокиращ, тъй като португалецът не успя да уцели опразнената врата, след като топката срещна гредата при удар на негов съотборник. Cristiano Ronaldo misses two sitters in a matter of minutes for Al Nassr, his teammates were stunned. pic.twitter.com/6h00bIbrlq — SPORTbible (@sportbible) February 3, 2023","pubDate":"2023-02-04 08:18:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"ЦСКА 1948 показва състава за пролетта срещу Спартак Плевен","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/cska-1948-pokazva-systava-za-proletta-sreshtu-spartak-pleven-718774","keywords":["no"],"creator":null,"video_url":null,"description":"Отборът на ЦСКА 1948 излиза днес срещу Спартак Плевен в последната си контрола от зимната подготовка. Мачът е от 13:00 часа и ще се играе на стадиона в столичния комплекс „Царско село”. Треньорът на \"червените\" Тодор Янчев призна, че е избистрил титулярния състав за първия двубой от efbet Лига на 90% и и...","content":"Отборът на ЦСКА 1948 излиза днес срещу Спартак Плевен в последната си контрола от зимната подготовка. Мачът е от 13:00 часа и ще се играе на стадиона в столичния комплекс „Царско село”. Треньорът на \"червените\" Тодор Янчев призна, че е избистрил титулярния състав за първия двубой от efbet Лига на 90% и има колебния само за 1-2 поста. Очаква се в днешната проверка със Спартак Плевен да започнат 11-те, които ще стартират и срещу Хебър след седмица. По време на лагера в турския курорт Белек отборът на ЦСКА 1948 не загуби нито една от петте контроли, които изигра. \"Червените\" спечелиха срещу северномакедонския Шкендия (2:0), Аксу от Казахстан (4:1), сръбския Чукарички (2:1) и немския Ханза Рощок (2:1), а завърши 0:0 с грузинския Торпедо Кутаиси. efbet подкрепя българския спорт","pubDate":"2023-02-04 08:07:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Zwischen Wunder und Stromausfall: So liefen die letzten Super Bowls!","link":"https://www.nordbayern.de/sport/zwischen-wunder-und-stromausfall-so-liefen-die-letzten-super-bowls-1.8544771","keywords":null,"creator":null,"video_url":null,"description":"Es ist das größte Endspiel im American Football: Der legendäre Super Bowl. In diesem einem Duell entscheidet sich die Meisterschaft in der US-Profiliga NFL - und weil es um so viel geht, gab es schon viele legendäre Aufeinandertreffen. Wir blicken auf alle Super Bowls seit 2010 zurück und erzählen Geschichten von Stromausfällen, mutigen Entscheidungen und dem ewigen Tom Brady.","content":"Es ist das größte Endspiel im American Football: Der legendäre Super Bowl. In diesem einem Duell entscheidet sich die Meisterschaft in der US-Profiliga NFL - und weil es um so viel geht, gab es schon viele legendäre Aufeinandertreffen. Wir blicken auf alle Super Bowls seit 2010 zurück und erzählen Geschichten von Stromausfällen, mutigen Entscheidungen und dem ewigen Tom Brady. Im Sommer 2005 richtete Hurrikan Katrina verheerende Schäden im Südosten der USA an. Besonders hart getroffen wurde dabei der Großraum New Orleans, weite Teile des Stadtgebietes standen unter Wasser. Zigtausende Menschen mussten im Louisiana Superdome, dem Stadion der New Orleans Saints, Zuflucht finden. Und als sich die Stadt in den folgenden Jahren von der Naturkatastrophe erholte, stiegen auch die Saints heldenhaft empor: Am 7. Februar 2010 stand das Team um Quarterback Drew Brees erstmals im Super Bowl. Gegen die favorisierten Indianapolis Colts erwischte New Orleans im Dolphins Stadium im sonnigen Miami keinen besonders guten Start, die eigentlich so starke Offensive - kein Team erzielte während der Hauptrunde der Saison mehr Punkte - geriet komplett ins Stocken. Lediglich zwei Field Goals durch Saints-Kicker Garrett Hartley hielt die Saints im Spiel. Zu Beginn der zweiten Hälfte ließ sich Saints-Coach Sean Payton dann aber etwas einfallen: Mit einem völlig überraschenden Onside Kick erwischte er die Colts auf dem falschen Fuß, die Saints hingegen nutzten den anschließenden Ballbesitz, um erstmals in der Partie in Führung zu gehen. Durch eine überragende Schlussoffensive entschied New Orleans dann Super Bowl XLIV mit 31:17 für sich und gewann erstmals die so begehrte Lombardi Trophy - für eine Stadt, die es in den Jahren davor alles andere als einfach hatte. © imago sportfotodienst Ein Duell der Giganten wartete am 6. Februar 2011 im Cowboys Stadium in Arlington, Texas auf die Football-Fans: Die Green Bay Packers kamen als sechstplatziertes Team in der NFC bis in den Super Bowl, wären gegen die Pittsburgh Steelers (Nummer zwei in der AFC) also auf dem Papier der Underdog gewesen. Doch mit starken Leistungen in den Playoffs spielte sich das Team um Star-Quarterback Aaron Rodgers in die Favoritenrolle und ließ auch im ersten Viertel nichts anbrennen. Erst als \"Big Ben\" Roethlisberger und die Offensive der Steelers in Rollen kam, entwickelte sich eine Schlacht zwischen zwei defensivstarken Teams. Pittsburgh war in der Schlussphase wieder nah dran und erhielt mit etwas mehr als zwei Minuten auf der Uhr und einem Sechs-Punkte-Rückstand wieder den Ball - doch die Packers-Defense um Clay Matthews, A. J. Hawk und B. J. Raji hielt Stand und verteidigte die Führung. Die Lombardi-Trophy kam also nach Hause und bescherte den Packers den vierten Super-Bowl-Sieg und die insgesamt 13. NFL-Meisterschaft. © Timothy A. Clary/AFP Super Bowl XLVI war die Neuauflage des Endspiels von 2008, als die New York Giants den New England Patriots die \"perfekte Saison\" mit 19 Siegen in 19 Spielen versauten. Entsprechend heiß war das Team von Bill Belichick und Tom Brady, sich an den Giants zu rächen - doch auch am 5. Februar 2012 bewiesen die Giants im Lucas Oil Stadium von Indianapolis, dass sie eine Art Kryptonit für das Erfolgsrezept der Patriots sind. Mit einer bärenstarken Defensivleistung in der zweiten Hälfte gelang es dem von Tom Coughlin trainierten Team, in Schlagdistanz zu bleiben. In der letzten Minute des Spiels warf New-York-Quarterback Eli Manning den entscheidenden Pass auf Ahmad Bradshaw, die Giants gingen in Führung - und verteidigten diese bis zum Ende. Für die Giants war es der vierte Super Bowl der Teamgeschichte. © Steven C. Mitchell/dpa Eigentlich war es eine klare Sache am 3. Februar 2013: Im Super Bowl XLVII waren die Baltimore Ravens den San Francisco 49ers eigentlich klar überlegen und führten zu Beginn der zweiten Halbzeit klar mit 28:6. Dann aber fiel plötzlich das Licht im Mercedes-Benz-Superdome von New Orleans aus, die Ravens verloren den Schwung und San Francisco nutzte die Pause, um sich zu sammeln. Kaum waren die Lichter wieder an, drehte das Team um Colin Kaepernick auf und kam bis auf zwei Punkte ran - ehe Baltimore mit cleverem Zeitmanagement von Coach John Harbaugh und Quarterback Joe Flacco die Zeit von der Uhr nahm und den Vorsprung verteidigte. © Andy Lyons/AFP Es war eine Machtdemonstration der Seattle Seahawks, die am 2. Februar 2014 den Super Bowl XLVIII prägte: Das Team von Coach Pete Carroll war nicht nur in der Offensive dank Russell Wilson und Marshawn Lynch unaufhaltsam, sondern auch in der Defensive - zu dieser Zeit auch \"Legion of Boom\" genannt - deutlich stärker als die Denver Broncos, die an jenem Abend in New Jersey ihr Kontrahent waren. Mit einer 22:0-Führung ging es in die Pause, am Ende stand ein klarer 43:8-Sieg, der keinen Zweifel ließ, wer diesen Meistertitel verdient hatte. © Tannen Maury/dpa Nur ein Jahr später standen erneut die Seattle Seahawks im Endspiel, diesmal aber gegen die New England Patriots. In einer hart umkämpften Partie am 1. Februar 2015 spielte sich Seattle eine Zehn-Punkte-Führung für das letzte Viertel heraus, doch die Patriots wären nicht die Patriots, wenn sie darauf keine Antwort gehabt hätten. Tom Brady führte die Aufholjagd an, brachte New England wieder in Front - doch den letzten Ballbesitz hatten die Seahawks. Zum entscheidenden Faktor des Spiels avancierte dann Patriots-Rookie Malcolm Butler, der einen Pass von Seahawks-Quarterback Russell Wilson abfing und den vierten Super-Bowl-Titel für das Team aus Massachusetts besiegelte. © Christian Petersen/AFP Es war der letzte große Auftritt von Peyton Manning. Am 7. Februar 2016 traf der legendäre Quarterback mit seinen Denver Broncos auf die Carolina Panthers. Dank einer dominanten Defensivleistung, bei der allen voran Broncos-Linebacker Von Miller überzeugte, fuhr Denver einen relativ ungefährdeten 24:10-Sieg ein - Manning zog mit seinem Bruder Eli gleich und holte in Santa Clara seinen zweiten Super Bowl, ehe er die Schuhe an den Nagel hing und seine eindrucksvolle Karriere beendete. © Patrick Smith/AFP Und wieder einmal Tom Brady: Am 5. Februar 2017 holte der Dauerbrenner-Quarterback seinen fünften Super Bowl. Eigentlich war es im NRG Stadium von Houston schon aussichtslos aus Sicht der Patriots, drei Minuten vor Ende des dritten Viertels lag Atlanta fast schon uneinholbar mit 28:3 vorne. Aber eben nur fast, denn dann folgte ein schlechtes Zeitmanagement Atlantas, ein wieder einmal glänzend aufgelegter Brady und die größte Aufholjagd in der Super-Bowl-Geschichte. Mit 28:28 ging es erstmals bei einem Super Bowl in die Verlängerung, die Patriots gewannen den Münzwurf und nutzten gleich den ersten Ballbesitz für den Sieg. © Timothy A. Clary/AFP Sie waren favorisiert und erneut sah alles danach aus, als könnten die New England Patriots erneut ihre Vormachtstellung deutlich machen. Gegen die Philadelphia Eagles, den absoluten Underdog, war New England klar favorisiert. Den Eagles war zuvor Quarterback Carson Wentz verletzungsbedingt ausgefallen, sein Ersatzmann Nick Foles wurde ins kalte Wasser geworfen - und lernte schneller schwimmen als ein Otter im kalifornischen Zoo. Am 4. Februar 2018 schrieb Foles Geschichte, weil es ihm gelang, die New England Patriots in einen Shootout zu involvieren. Brady war dem an diesem Abend in Minneapolis nicht gewachsen und vergab in der Crunchtime die Chance, den sechsten Ring zu holen. Die Eagles feierten damit ihren ersten Super-Bowl-Sieg und ihre zweite NFL-Meisterschaft in einem denkwürdigen Spiel, das Rekorde brach. Beispielsweise die meisten überbrückten Yards in einem Super Bowl (1151 Yards) und die meisten Punkte, die das verlierende Team je in einem Super Bowl erzielte. © Timothy A. Clary/AFP Wieder einmal standen die New England Patriots mit Quarterback Brady und Headcoach Belichick im Super Bowl. Überraschender dagegen war der zweite Finalteilnehmer: Die Los Angeles Rams. Mit dem jüngsten Trainer der Liga, Sean McVay, und einem ebenfalls jungen Quarterback, Jared Goff, waren sie die Underdogs. Leider gab es während Super Bowl LIII kaum Überraschungen, bis zum letzten Viertel war kein einziger Touchdown gefallen. Das Spiel, das als einer der unspektakulärsten Super Bowls in die Geschichte einging, endete dank eines späten Touchdowns von Patriots-Runningback Sony Michel mit einem Sieg für New England. McVay gab anschließend zu, dass er \"ausgecoached\" wurde und auch Brady konnte keine Bestleistung abrufen. © HARRY HOW, AFP Für die Region war es ein ganz besonderes Spiel: Mit Mark Nzeocha stand ein gebürtiger Franke beim Super Bowl LIV auf dem Feld. Mit den San Francisco 49ers ging es für Nzeocha gegen die Kansas City Chiefs um Superstar Patrick Mahomes. Drei Viertel lang zeigte das Team aus Kalifornien eine starke Leistung und ging mit einer 20:10-Führung in den Schlussabschnitt - in dem Mahomes, Kelce und Co. plötzlich richtig aufdrehten. Mit einer dominanten Schlussdefensive und zwei schnellen Touchdowns drehte Kansas City die Partie und gewann zum zweiten Mal den Titel. Nzeocha ging aber nicht ganz leer aus: Immerhin durfte sich der Linebacker ins Goldene Buch von Rothenburg eintragen. © SAM GREENWOOD, AFP Es musste wohl so kommen. Die Tampa Bay Buccaneers hatten ein Heimspiel gegen die Kansas City Chiefs und ließen sich die wohl einmalige Chance nicht entgehen. Im Duell zweier Quarterback-Generationen zeigte Altmeister Tom Brady seinem jungen Herausforderer Patrick Mahomes die Grenzen auf und reckte hinterher zum sieben Mal in seiner Karriere die Vince Lombardi Trophy in den Himmel. Besonders beeindruckend: Die Offensive der Bucs kombinierte Lauf- und Passspielzüge eindrucksvoll und blieb drei Viertel lang absolut dominant - ehe sie sich mehr auf das Spiel mit der Uhr konzentrierte. Tampas Defensive hingegen ließ keinen einzigen Touchdown der sonst so offensivstarken Chiefs zu. © Ashley Landis, dpa Ein Super Bowl im eigenen Stadion - und das gleich zweimal in Folge. Wie die Buccaneers im Vorjahr gelang es den Los Angeles Rams im Jahr 2022, ins Finale in der eigenen Stadt einzuziehen. Für die Rams, die erst 2016 wieder aus St. Louis in die kalifornische Metropole gezogen waren, stand an jenem 13. Februar 2023 einiges auf dem Spiel. Das Team um Headcoach Sean McVay verstärkte sich mit hochkarätigen Neuzugängen und priorisierte eine erfolgreiche sportliche Gegenwart über eine erfolgreiche sportliche Zukunft. Auf der anderen Seite standen die Cincinnati Bengals, die mit jungen Supertalenten wie Joe Burrow, Ja'Marr Chase oder Tee Higgins gerade erst am Anfang der Entwicklung standen. In einer durchgehend knappen und spannenden Partie lieferten sich beide Teams einen sehenswerten Schlagabtausch. Die Bengals gingen im dritten Viertel verdient in Führung, konnten aber nicht nachlegen. Im Schlussabschnitt gelang den Rams dann noch einmal ein erfolgreicher Drive, der spätere Super-Bowl-MVP Cooper Kupp fing den Touchdown-Pass zum Sieg - und die Rams durften sich durch das 23:20 erstmals in ihrer Geschichte als Los Angeles Rams Super-Bowl-Champion nennen. © IMAGO/Mark J. Rebilas","pubDate":"2023-02-04 07:59:42","image_url":null,"source_id":"nordbayern","category":["sports"],"country":["germany"],"language":"german"},{"title":"News24.com | Ten Hag warns against Greenwood distraction for Man United","link":"https://www.news24.com/sport/Soccer/EnglishPremiership/ten-hag-warns-against-greenwood-distraction-for-man-united-20230204","keywords":null,"creator":null,"video_url":null,"description":"Manchester United manager Erik ten Hag told his players not to be distracted by Mason Greenwood's future on Friday, 24 hours after criminal charges against the 21-year-old forward were dropped.","content":"Manchester United manager Erik ten Hag told his players not to be distracted by Mason Greenwood's future on Friday, 24 hours after criminal charges against the 21-year-old forward were dropped. Greenwood had been facing charges including attempted rape and assault, but prosecutors said the case had been discontinued following the withdrawal of key witnesses and \"new material that came to light\". United issued a statement on Thursday saying the club would now \"conduct its own process before determining next steps\". In a short statement released on his behalf, Greenwood said he was \"relieved the matter is now over\". At a pre-match press conference on Friday, Ten Hag refused to be drawn on the subject. \"I can't add anything,\" said the Dutch manager, in his first season at Old Trafford. \"I refer to the statement of the club.\" Greenwood, who has two and a half years left on his contract, has been suspended from both training and playing for United since his arrest in January 2022. But with United still involved in four competitions, Ten Hag is keen for his players to be focused on the job at hand. \"That's our job, not to get distracted by anything,\" Ten Hag added. \"We are human beings and sometimes there are issues, we are not like robots, but we have to focus on our job. \"We have so many games so we don't have time to get distracted by anything. It's not easy but that is our job.\" Ten Hag has been credited with transforming United's fortunes as they sit fourth in the Premier League and reached the League Cup final this week for the first time in six years. Purse strings tightened But fatigue could halt their progress with the Red Devils also still in the running for the FA Cup and Europa League. Ten Hag was only able to add three loan signings: Marcel Sabitzer, Wout Weghorst and Jack Butland in January as the purse strings at Old Trafford were tightened as the Glazer family explore the possibility of selling the club. \"Of course we need players to cover that because there is a limit on every player but I think we have a depth in our squad,\" said Ten Hag. \"Maybe not that far as other teams but that also has something to do with your approach to it and how you do your load management. If you do that right, I think we can go far.\" Sabitzer could go straight into the side for Saturday's match against Crystal Palace following a deadline-day loan move from Bayern Munich. \"He did only one session but you can see he's a very fit player,\" said Ten Hag, who signed the Austrian after playmaker Christian Eriksen was ruled out until early May. \"I didn't have different expectations coming from Bayern Munich. In Germany their fitness is always good. I think he is ready to play.\" United defender Raphael Varane announced his retirement from international football on Thursday after a France career in which he won the World Cup in 2018 and finished as a runner-up last year in Qatar. France's loss could be United's gain if the 29-year-old former Real Madrid centre-back is able to extend his club career. \"For United, I think it's good news,\" Ten Hag said. \"Rapha achieved everything in terms of football club-wise but also with his nation. \"It is incredible what he achieved, big respect, and I am happy he puts all his energy and experience into the team.\"","pubDate":"2023-02-04 07:51:47","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Левски търси спонсор, за да привлече крило","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/levski-tyrsi-sponsor-za-da-privleche-krilo-718773","keywords":["no"],"creator":null,"video_url":null,"description":"Левски търси спонсор, който да помогне на клуба да купи испанеца Джавад ел Джемали, който е желан от старши треньора на \"сините\" Станимир Стоилов, пише \"Телеграф\". Към днешна дата 20-годишният футболист е собственост на кипърския Акритас Хлорака. Двата клуба са в напреднали преговори за трансфера му, а к...","content":"Левски търси спонсор, който да помогне на клуба да купи испанеца Джавад ел Джемали, който е желан от старши треньора на \"сините\" Станимир Стоилов, пише \"Телеграф\". Към днешна дата 20-годишният футболист е собственост на кипърския Акритас Хлорака. Двата клуба са в напреднали преговори за трансфера му, а към днешна дата цената на Джемали, който е юноша на испанския Еспаньол и има марокански корени, е 100 000 евро. Кипърците не искат да отстъпват и цент от въпросната сума, която обаче е непосилна за Левски. Заради това ръководството на \"сините\" търси спонсор, който да помогне финансова за трансфера. На \"Герена\" се обсъжда, ако някой фирма даде пари за сделката, да си получи обратно сумата дори с печалба, ако Джавад ел Джемали впоследствие бъде продаден за повече пари. Най-вероятно крилото, което е в Акритас от лятото на 2021 година, ще акостира в Левски. Младокът е твърд титуляр в кипърския тим от началото на сезона, а треньор му е бившият наставник на Локомотив Пловдив и ЦСКА Бруно Акрапович. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:49:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Билал Бари увеличава натоварванията","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/bilal-bari-uvelichava-natovarvaniiata-718772","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Нападателят на Левски Билал Бари увеличи натоварванията. В момента мароканецът с френски паспорт се възстановява от операцията, която претърпя в края на август. Футболистът получи тежка контузия в коляното по време на тренировка на сините и оттогава е аут от терените. Интервенцията бе извършена в Лион, а след това Бари започна да провежда рехабилитацията си в базата на френските национали Клерфонтен. Мароканецът често използва социалните мрежи, за да качва видеа от възстановяването си, като от последните стана ясно, че започва да увеличава натоварванията и е започнал бегови упражнения. Той вече започва да вдига и тежести с оперирания си крак, като сега трябва наново да изгражда мускулатурата на засегнатото място. През този сезон нападателят изигра 11 двубоя във всички турнири със синия екип, в които вкара три гола. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:45:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Ето кои трима играчи ще се борят за \"Футболист на годината\"","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/eto-koi-igrachi-shte-se-boriat-za-futbolist-na-godinata-718770","keywords":["no"],"creator":null,"video_url":null,"description":"Националите на Лудогорец Кирил Десподов и Антон Недялков са фаворити за Футболист №1 на 2022 година на България. Победителите от 62-ата анкета ще бъдат обявени в неделя, 5 февруари. Церемонията ще се проведе в Pirotska 5 Event Center в София. На събитието ще стане ясна призовата тройка при българските футболисти за...","content":"Националите на Лудогорец Кирил Десподов и Антон Недялков са фаворити за Футболист №1 на 2022 година на България. Победителите от 62-ата анкета ще бъдат обявени в неделя, 5 февруари. Церемонията ще се проведе в Pirotska 5 Event Center в София. На събитието ще стане ясна призовата тройка при българските футболисти за 2022 г. след гласуването на спортните журналисти. За челно място ще се бори и Илия Груев-младши, който играе във Вердер. Фаворит за приза обаче е Кирил Десподов. На събитието ще бъде обявен треньор №1 на България и неговите подгласници. Ще станат ясни и най-добрите в родното първенство за 2022 г. - най-добър вратар, най-добър защитник, най-добър полузащитник, най-добър нападател, най-добър чужденец. Ще бъде връчена и наградата за най-прогресиращ млад играч в българския футбол. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:36:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"I won the Champions League more times than Lionel Messi, but now I have no club and I’m only 30… these things happen","link":"https://www.thesun.co.uk/sport/21251701/more-champions-league-messi-unemployed-transfer/","keywords":["Football","Sport","Champions League"],"creator":["Dave Fraser"],"video_url":null,"description":null,"content":"A SERIAL winner, a 38-cap international, boasting more Champions League titles than Lionel Messi and still in his prime years. Also... unemployed. Once upon a time, the skilful midfielder was one of the most-sought-after stars in Europe. The Spain star, still only 30, is one of the most-decorated players in world football. And yet, at the conclusion of the January transfer window, he finds himself without a club. The man in question: former Real Madrid maestro Isco . Part of Valencia's talent factory of the 00s, Isco made his name at Malaga before securing a massive move to Real Madrid in 2013. In nine years at the Bernabeu, the midfielder contributed to over 100 goals in 353 games. Isco won a staggering five Champions League crowns, as well as three LaLiga titles until he departed in 2022, joining Sevilla. The 2012 Golden Boy was once on the radar of every Premier League \"Big Six\" side. BETTING SPECIAL - BEST FOOTBALL BETTING SITES IN THE UK But interest cooled in his later Los Blancos years, with Sevilla taking a chance on him in August 2022. After just four months and only 14 LaLiga games, his contract was terminated . On deadline day, Isco was on the brink of a free transfer to Bundesliga high-flyers Union Berlin. But the deal collapsed as the club cryptically claimed: \"We have our limits.\" Fabrizio Romano has since revealed the \"deal collapsed because financial conditions of the deal changed after the medical tests.\" According to Spanish pundit Anton Meana, the late shock is a blessing in disguise for Union Berlin. Meana brutally claimed: “I think Isco would have been a problem for Union. \"I don’t think Isco is up to that level of football, I don’t think he suits the Bundesliga, and even less so Union Berlin. “I think that Union have come out of this winning from all of the noise this generated on social media.” As a result, Isco currently finds himself unemployed. He has been linked with a move to Turkey - with the transfer window open until February 8. But for now, the man who was one of Spain's brightest young talents faces the very real possibility of being tossed on the scrapheap.","pubDate":"2023-02-04 07:33:01","image_url":null,"source_id":"thesun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Конте може да води Тотнъм срещу Манчестър Сити, само пет дена след операцията","link":"https://gong.bg/football-sviat/anglia/multimedia/video/konte-mozhe-da-vodi-totnym-sreshtu-manchestyr-siti-samo-pet-dena-sled-operaciiata-718768","keywords":["no"],"creator":null,"video_url":null,"description":"...","content":"Старши треньорът на Тотнъм - Антонио Конте, може да се завърне край терена още в неделя в предстоящото дерби срещу Манчестър Сити, само пет дни след операцията за отстраняване на жлъчния му мехур. Конте ще вземе окончателно решение след консултация със своя хирург в навечерието на мача, заяви неговият помощник Кристиан Стелини. „Решението ще бъде взето от Конте в часовете преди мача“, сподели Стелини. „Готови сме да направим всичко и Антонио и вероятно лекарите ще трябва да решат“, добави той. 53-годишният Конте се завърна в родината си след победата над Престън за ФА къп, но беше приет в болница заради \"остри коремни болки\". В момента той се възстановява заедно със своето семейство. Конте заяви, че операцията, която претърпя за отстраняване на жлъчния мехур, е преминала добре. Италианецът увери, че се чувства по-добре и благодари за съобщенията, които е получил. „Благодаря за всички чудесни съобщения. Операцията ми мина добре. Сега е време за възстановяване, но нямам търпение да се върна на терена при моя отбор“, написа италианският треньор в профила си в социалната мрежа Instagram.","pubDate":"2023-02-04 07:32:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"},{"title":"Клуб от efbet Лига взима бивш футболист на Левски","link":"https://gong.bg/bg-football/efbet-liga/multimedia/video/klub-ot-efbet-liga-vzima-bivsh-futbolist-na-levski-718767","keywords":["no"],"creator":null,"video_url":null,"description":"Локомотив (София) очаква халфа Мартин Райнов. На 12 януари полузащитникът стана свободен агент, след като приключи отношенията си с румънския Арджеш. Бившият футболист на Левски, Берое, Локомотив (Пловдив) и други е разговарял с ръководството на столичните железничари. Двубоят се изигра на стадиона на...","content":"Локомотив (София) очаква халфа Мартин Райнов. На 12 януари полузащитникът стана свободен агент, след като приключи отношенията си с румънския Арджеш. Бившият футболист на Левски, Берое, Локомотив (Пловдив) и други е разговарял с ръководството на столичните железничари. Двубоят се изигра на стадиона на \"железничарите\" в столичния квартал \"Надежда\" Райнов е обявил, че, ако не си намери нов отбор в чужбина ще подсили \"червено-черните\". Така той е гласен за заместник на напусналия в посока ниските нива на футбола в Полша Симеон Славчев. efbet подкрепя българския спорт","pubDate":"2023-02-04 07:30:00","image_url":null,"source_id":"gong","category":["sports"],"country":["bulgaria"],"language":"bulgarian"}]}