{"newsArray":[{"title":"Jeux des Îles 2023 : Les « Trano Mora » à Ivato comme Village des Jeux","link":"https://midi-madagasikara.mg/2022/11/22/jeux-des-iles-2023-les-trano-mora-a-ivato-comme-village-des-jeux/","keywords":["Sports","Ivato","Jeux des Îles 2023","Madagascar","Trano Mora"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Les logements flambants neufs à Ivato pourront recevoir les délégations participantes aux Jeux des Îles de l’océan Indien en 2023 à Antananarivo.  « Comme discuté avec le président de la République, les nouveaux appartements à Ivato serviront de village des jeux pour les 11es JIOI organisés à Antananarivo en 2023. En plus de ces appartements, une […] L’article <strong>Jeux des Îles 2023 : Les « Trano Mora » à Ivato comme Village des Jeux</strong> est apparu en premier sur Midi Madagasikara.","content":"Les logements flambants neufs à Ivato pourront recevoir les délégations participantes aux Jeux des Îles de l’océan Indien en 2023 à Antananarivo.  Les immeubles ne pourront recevoir les premiers occupants qu’en août 2023. « Comme discuté avec le président de la République, les nouveaux appartements à Ivato serviront de village des jeux pour les 11es JIOI organisés à Antananarivo en 2023. En plus de ces appartements, une partie des délégations sera logée dans des hôtels de la capitale. Nous avons déjà visité le site à Ivato lors de la réunion du Comité International des Jeux (CIJ) en janvier 2022« . Tels sont les dires de Siteny Randrianasoloniaiko lors d’un entretien téléphonique qu’il nous a accordé, hier. Ces immeubles construits dans le cadre du projet présidentiel ne seront alors livrés à leur futur propriétaire qu’en septembre 2023 après la tenue des jeux. En 1997, lors de l’organisation à domicile des 3es Jeux de la Francophonie, un village des jeux a été construit à Ankorondrano, les immeubles servant actuellement de bureaux et appartements pour les particuliers. À l’île Maurice en 2019, les délégations ont été hébergées dans les hôtels, et l’esprit du village des jeux manquait avec les différentes animations et échanges interculturels entre les îles participantes. Continuant sur cette lancée, le président du Comité Olympique Malgache nous a rassuré : « les Jeux seront bel et bien organisés à Antananarivo« . Par rapport aux infrastructures, les sites de la capitale répondent aux normes internationales. Le Stade rénové de Mahamasina, le plus grand de la région avec 40.000 places sera le théâtre des cérémonies d’ouverture et de clôture. « La construction de nouvelles infrastructures s’annonce compliquée, mais le plus important, ce sont les travaux de rénovation des sites existants« , a poursuivi le patron du COM. Parmi les infrastructures dans la capitale et ses environs, l’on peut également citer le Stade d’Alarobia pour l’athlétisme, les Gymnases d’Ankatso, d’Ankorondrano et de Mahamasina, le Palais des Sports de Mahamasina, les terrains de l’ASUT et de l’ACSA pour le tennis, la piscine de l’Académie Nationale des Sports à Ampefiloha et le Complexe Sportif de la CNaPS à Vontovorona. Avec 23 disciplines au menu des jeux, la mission s’annonce ardue pour le clan malgache car il faut une réelle volonté et collaboration entre l’Etat et le COM pour sa bonne organisation.  T.H  L’article <strong>Jeux des Îles 2023 : Les « Trano Mora » à Ivato comme Village des Jeux</strong> est apparu en premier sur Midi Madagasikara.","pubDate":"2022-11-22 03:00:00","image_url":null,"source_id":"madagasikara","country":["Madagascar"],"category":["sports"],"language":"french"},{"title":"Francisco Rodríguez entró en las papeletas para el Salón de la Fama","link":"https://primicia.com.ve/deportes/francisco-rodriguez-entro-en-las-papeletas-para-el-salon-de-la-fama/","keywords":["Deportes","Bob Abreu","Candidato","Francisco Rodríguez","fútbol","MLB","Omar Vizquel","papeletas","Salón de la Fama"],"creator":["Karla Benitez"],"video_url":null,"description":"La Asociación de Escritores de Béisbol de Estados Unidos anunció la lista completa para la votación de 2023. La entrada Francisco Rodríguez entró en las papeletas para el Salón de la Fama se publicó primero en Diario Primicia.","content":"El pitcher venezolano Francisco Rodríguez fue incluido en la boleta para la elección del Salón de la Fama de la Asociación de Escritores de Béisbol de Estados Unidos para 2023. Con este anuncio serán tres los criollos en competencia, ya que se une a Omar Vizquel y Bob Abreu. El anuncio de los resultados de la votación está previsto para el 24 de enero y la exaltación será el 23 de julio en las instalaciones del Clark Sports Center en Cooperstown. También aparecen como nuevos candidatos Carlos Beltrán, John Lackey, Jered Weaver, Bronson Arroyo, Matt Cain, RA Dickey, Jacoby Ellsbury, Andre Ethier, JJ Hardy, Mike Napoli, Jhonny Peralta, Houston Street y Jayson Werth. Para permanecer diez años en la boleta deben obtener al menos el 5% de los votos anualmente. Están otra vez en el ruedo Scott Rolen quien recibió 63,2 % en 2022, Todd Helton, Billy Wagner, Andrew Jones, Jeff Kent, Andy Pettite, Manny Ramírez, Álex Rodríguez, Gary Sheffield, Jimmy Rollins, Mark Buehrle y Torii Hunter. Se estima que entre los recién llegados que pueden obtener una buena cantidad de votos está Rodríguez. Recordemos que jugó 16 años en la MLB, participó seis veces en el Juego de Estrellas, recibió un par de veces el Premio Rolaids Relief y el Cy Young de la Liga Americana. The 2023 Hall of Fame ballot features 28 former players – 14 returning and 14 new candidates. The results will be announced live on on Jan. 24. — National Baseball Hall of Fame and Museum ⚾ (@baseballhall)","pubDate":"2022-11-22 01:32:46","image_url":null,"source_id":"primicia","country":["venezuela"],"category":["sports"],"language":"spanish"},{"title":"PSB to bear only ticketing expenses for Nations Cup","link":"https://www.thenews.com.pk/print/1012458-psb-to-bear-only-ticketing-expenses-for-nations-cup","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: The Pakistan Sports Board will only bear ticketing expenses of the players and team officials for the FIH Nations Cup starting from November 28 in Potchefstroom .‘The News’ has learnt from the sources that the PSB has declined to extend any additional favour to the...","content":null,"pubDate":"2022-11-22 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 3rd T20 Live Streaming: हार्दिक पंड्या एंड कंपनी सीरीज फतह करने कब और कहां उतरेगी, ऐसे देखें LIVE","link":"https://hindi.news18.com/news/sports/cricket-india-vs-new-zealand-3rd-t20-at-melbourne-cricket-stadium-live-streaming-when-and-where-to-watch-dd-sports-amazon-prime-dd-free-dish-4935877.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IND vs NZ,T20 Live Streaming Online on DD Sports, Amazon Prime Video:हार्दिक पंड्या की कप्तानी वाली भारतीय क्रिकेट टीम 3 मैचों की टी20 सीरीज में 1-0 की बढ़त बना चुकी है और अब तीसरा और आखिरी टी20 मैच जीतकर सीरीज फतह करना चाहेगी. भारत और न्यूजीलैंड के बीच यह मैच मंगलवार को नेपियर के मैकलीन पार्क में भारतीय समयानुसार दोपहर 12:00 बजे से खेला जाएगा.","content":null,"pubDate":"2022-11-22 00:59:01","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/11/Hardik-Pandya-with-Tim-Southee-16690783723x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Gallen reveals eye-watering $25m fortune","link":"https://www.couriermail.com.au/sport/boxing-mma/25-million-in-three-years-paul-gallen-reveals-eyewatering-boxing-fortune/news-story/709cd249a74ba30bdee521bf8a1a891d","keywords":["Kayo","MMA","Sport news and galleries"],"creator":null,"video_url":null,"description":"As he prepares for his last ever boxing fight, Paul Gallen has revealed he has grossed a mammoth $25 million from the sport in just the past three years.","content":"The Cronulla Sharks legend will take on Justin Hodges in Sydney on Wednesday night in a rematch after he defeated Hodges in their first fight in September. Watch Gallen v Hodges 2 & Michael Zerafa’s return to the ring LIVE on Main Event available on Foxtel & Kayo Sports, Wednesday November 23 from 7pm AEDT ORDER NOW >With Gallen set to hang up the gloves for good, the search is on for the next crosscode star to fill his shoes and become Australian boxing’s next pay-per-view golden goose.Gallen has long been linked to a fight with Sonny Bill Williams but said he has no desire whatsoever to fight the former NRL and All Blacks star, even if that means knocking a payday of up to $5 million.“I’ll never fight Sonny Bill, I’ll say that right now, even if they guaranteed $5 million in my bank account before the fight, because he’d make $5 million too,” Gallen said, per News Corp.“He had his chance. We should have fought twice over the last couple of years. The ego and arrogance from their side is at a level that I don’t want to be involved in.“No Limit don’t want to be involved with them, No Limit’s the biggest and best promoter in Australia and they don’t want to be involved with them? What does that say?“That fight will never happen, I’m not going to talk crap about Sonny. I was asked if Sonny should fight again, yes, Sonny is 37, he’s got plenty left in him.“Look what I’ve done in the last three years, grossed $25 million. He could do the same, make millions. But I will not fight Sonny Bill, ever.”Gallen said his boxing output over the last three years has been worth a mega $8.3 million annually.The 41-year-old was very well compensated for his gutsy performances in heavyweight fights against the likes of Mark Hunt, Lucas Browne, Justis Huni, Darcy Lussick and Kris Terzievski. His most recent fights against Hodges and Ben Hannant are just the icing on the cake.Last year Anthony Mundine revealed he had made a whopping $34 million from his storied boxing career.Australian boxing is desperate for a football player to fill Gallen’s shoes and the candidates include Williams, Roosters premiership forward Siosiua Taukeiaho, as well as current NRL stars Matt Lodge NRL, Junior Paulo and Tevita Pangai Jr. Williams is at a crossroads after his loss to UFC legend Hunt earlier this month, but Gallen believes his old foe could make plenty of money if he stays in boxing.“There’s definitely plenty of money to be made,” Gallen said.“I just don’t know if Sonny wants to do it. But if I were Sonny I wouldn’t be stopping.“The guy is 37. And look at what has happened with me from roughly the same age.“I’ve grossed $25 million over the past three years. That’s a lot of money.“So $25 million in three years … no, I wouldn’t be leaving if I were Sonny.”Gallen will fight Hodges at Sydney’s ICC Super Aware Theatre on Wednesday night and will be hoping to finish his boxing career on a high.The main event will see the maligned Michael Zerafa take Danilo Creati.When is Paul Gallen’s last boxing fight?Coverage of the fight card begins at 7pm on Wednesday on Main Event and Kayo Sports.Timing isn’t an exact science in boxing and with this jam-packed card, Gallen, Hodges and Zerafa may not step in the ring until after 9 or 10pm.How can I watch Gallen vs Hodges and Zerafa’s fight?This is a pay-per-view fight card, available to watch on Main Event or stream via Kayo Sports.You can purchase the PPV for $59.95 here.","pubDate":"2022-11-22 00:57:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Promoter suggests Jonas is the perfect Katie Taylor Croke Part fit","link":"https://www.irish-boxing.com/promoter-suggests-jonas-is-the-perfect-katie-taylor-croke-part-fit/","keywords":["Headline News","Latest","News","Pro News","Katie Taylor","Nathasa Jonas"],"creator":["irishboxing"],"video_url":null,"description":"Natasha Jonas is the biggest fight out there for Katie Taylor and should be her Croke Park opponent according to The post Promoter suggests Jonas is the perfect Katie Taylor Croke Part fit first appeared on Irish Boxing.","content":"Natasha Jonas is the biggest fight out there for Katie Taylor and should be her Croke Park opponent according to Ben Shalom . The Irish sporting legend is lining up a massive homecoming fight and is currently exploring options for a summer showdown at GAA Headquarters. Eddie Hearn hopes to tempt Amanda Serrano to Dublin and to re-run the ‘greatest female fight of all time’ on Jones Road. However, Boxxer Promoter Shalom believes another former Taylor foe is a better fit and bigger fight. The Liverpudlian beat Marie-Eve Dicaire on Saturday week to add the IBF super-welterweight championship to the WBO and WBC titles she’d already unified this year. The fighter who has fought Taylor in both the amateur and the pros has been linked to Jessica McCaskill and Claressa Shields but Shalom told Sky Sports that a rematch with Taylor is the fight to make. The Sky Sports aligned argues it’s a fight that makes sense for both and is one the fans would relish in seeing. “That is the fight that makes the most sense if we’re all thinking about where we could go. We saw what Shields-Marshall did. If we take a step back and say ‘how do we make something really special’, I think Jonas is the biggest name now I would say from England in women’s boxing and Katie Taylor is a huge star of the sport, between her and Claressa Shields for the biggest star,” Shalom said. “That for me is the fight that’s going to get the most attention from the casual fans, from the biggest audiences. I think it’s the fight that will get the biggest audience at this time with the support Natasha’s had on Sky and obviously where Katie Taylor’s at. So hopefully they may be sensible on the other side and we can make that fight. “It has to appeal to Katie,” Shalom continued. “We respect Katie Taylor massively. She will have seen Tasha Jonas’ ascendancy over the past year and I think if she wants a legacy fight, if she wants the biggest fight possible and she wants something to take home that fans can really buy into then I think Tasha Jonas is the fight. “I think I would not be averse to Natasha Jonas going to fight Katie Taylor at Croke Park.” Jonas trainer Joe Gallagher, whose parents hail from Sligo, said, “Katie Taylor, we’d love to see that rematch, there’s talk about Croke Park, let’s do it at Anfield. Natasha Jonas is the one that’s come closest to beating Katie Taylor, when you go look at the scorecards. “That’s another fight to see, Jessica McCaskill or Claressa coming down.”","pubDate":"2022-11-21 23:17:04","image_url":null,"source_id":"irish_boxing","country":["ireland"],"category":["sports"],"language":"english"},{"title":"AA adds nearly 100 additional flights to Phoenix for Super Bowl/WM Phoenix Open","link":"https://www.abc15.com/sports/super-bowl/american-airlines-adds-nearly-100-additional-flights-to-phoenix-for-super-bowl-wm-phoenix-open","keywords":null,"creator":null,"video_url":null,"description":"Super Bowl LVII is February 12 in Glendale and that same weekend the Waste Management Phoenix Open is taking place at TPC Scottsdale.","content":"The Valley is going to be a hot spot come February 2023 with sports fans flocking into Phoenix Sky Harbor.Super Bowl LVII is February 12 in Glendale and that same weekend the Waste Management Phoenix Open is taking place at TPC Scottsdale.Organizers expect hundreds of thousands of sports fans to be in town for those events as well as the festivities leading up to them. The 2023 Coors Light Birds Nest music festival is scheduled for February 8-11 with headliners The Chainsmokers, Machine Gun Kelly and Jason Aldean. And, Super Bowl organizers have planned an entire week of events, concerts, and parties ahead of the Big Game at State Farm Stadium.RELATED: MAP: Events leading up to Super Bowl LVII across in the ValleyTo help accommodate the influx of visitors, American Airlines is adding 91 extra flights from 22 cities to Phoenix Sky Harbor.Albuquerque, NM (ABQ)Atlanta, GA (ATL)Austin, TX (AUS)Boston, MA (BOS)Charlotte, NC (CLT)Denver, CO (DENDallas/Fort Worth, TX (DFW)Dulles, VA (IAD)New York, NY (JFK)Las Vegas, NV (LAS)Los Angeles, CA (LAX)Miami, FL (MIA)Oklahoma City, OK (OKC)Omaha, NE (OMA)Chicago, IL (ORD)Philadelphia, PA (PHL)Raleigh-Durham, NC (RDU)San Diego, CA (SAN)Seattle, WA (SEA)San Francisco, CA (SFO)Salt Lake City, UT (SLC)Tampa, FL (TPA)The extra flights are for dates February 9-14. “Whether you want to cheer on your favorite team as they score a touchdown or go wild as your preferred golfer hits a hole-in-one on the 16th hole, American Airlines is offering sports fans, more flights and more seats to see the action in person,” said Jason Reisinger, American’s Managing Director of Global Network Planning. “We’re excited to have football and golf fans travel to our Phoenix hub and experience everything “the Valley of the Sun” has to offer.”“The American Airlines team here at Phoenix Sky Harbor is excited to offer these additional flights and welcome sports fans from across the country,” said Managing Director of Phoenix Hub Operations Sophia Philis-Ortiz. “As Phoenix’s hometown airline, we understand the important role that air service plays in the continued success of our community.”","pubDate":"2022-11-21 22:35:04","image_url":null,"source_id":"abc15","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"‘I’ve been thrown out of better places than this’ – Martin Brundle ushered away after awkward encounter with Man City boss Pep Guardiola at Abu Dhabi Grand Prix","link":"https://talksport.com/sport/motorsport/1251042/martin-brundle-pep-guardiola-manchester-city-abu-dhabi/","keywords":["Football","Motorsport","Sport","Abu Dhabi Grand Prix","Formula 1"],"creator":["Phil Spencer"],"video_url":null,"description":null,"content":"Martin Brundle is no stranger to awkward encounters and faced another as he tried to speak to Manchester City manager Pep Guardiola on his latest grid walk. The Sky Sports F1 reporter has cult hero status as he meets and greets famous guests before races – and the Abu Dhabi Grand Prix was no different as the 2022 season came to an end. Brundle endured an awkward encounter with Pep GuardiolaSky Sports F1 The Man City boss was in attendance for the Abu Dhabi Grand PrixAFP Guardiola was a guest of Mercedes but wasn’t too pleased when asked for a third interview by Sky before the raceAFP One man who he bumped into was Manchester City boss Guardiola who was enjoying a break from action due to the World Cup in Qatar. While being used to working with the press as part of his role in the Premier League, Guardiola seemed a bit tired of talking to the media when approached by Brundle for a chat ahead of the race. After being approached by Brundle, he said: “I just spoke already with Sky! I spoke twice with Sky.” Brundle replied: “Okay, three times lucky then,” to which Guardiola sarcastically responded: “Yeah, I’m lucky.” The Sky Sports reporter then tried to talk about football, to which the Man City head coach said: “No, let’s not talk about football today. Brundle was then ushered away by two security guards, to which he joked: “It’s okay, I’ve been thrown out of better places than this.” With City’s next match not until December 22nd, Guardiola will no doubt be hoping that he and his players can enjoy a break before returning to what will be a hectic run of Christmas fixtures.","pubDate":"2022-11-21 22:22:00","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Harry Kane, Gareth Bale and Virgil van Dijk could have been handed one-match bans for wearing ‘OneLove’ armbands as England captain reveals disappointment at having to wear FIFA-approved armband","link":"https://talksport.com/football/1252746/england-harry-kane-onelove-armband-fifa-world-cup/","keywords":["Football","World Cup","World Cup 2022","FIFA","Football Association"],"creator":["Jake Lambourne"],"video_url":null,"description":null,"content":"Harry Kane, Virgil van Dijk and Gareth Bale could have reportedly been slapped with one-game bans if they defied FIFA to wear the ‘OneLove’ armband. A total of seven European skippers planned to wear the rainbow-coloured armbands at the World Cup to show their support for the LGBTQ+ community in Qatar. Kane wore the FIFA-approved armband for England’s clash against IranGetty Same-sex relationships are outlawed in the Gulf nation, with homosexuality even punishable by death. But on the eve of the World Cup, FIFA announced a new anti-discrimination armband which will promote a key message during each round of the global community. Countries were still keen to wear the ‘OneLove’ armbands, before a joint statement from England, Holland, Wales, Germany, Switzerland, Belgium and Denmark confirmed they will not be due to fear of being wrongfully punished. It was said how sanctions the nations could face included the skippers receiving a yellow card before matches kicked off. Kane, Van Dijk and Bale subsequently donned FIFA’s armband for their group stage matches on Monday. And according to Sky Sports, they decided against wearing the ‘OneLove’ armbands as they were faced with the threat of a one-match ban as well as a yellow card. GettyVan Dijk and six other European skippers had planned to wear the ‘OneLove’ armband in Qatar[/caption] Most read in football info Everything you need to know about World Cup from fixtures to stadiums and timings CHAOS 'Families screaming' as riot police deployed to Doha fan park during World Cup opener UNIMPRESSED Brundle ushered away after awkward encounter with Pep Guardiola in Abu Dhabi RETURN Southgate reveals Maguire was taken off against Iran because he was ill BOLD Rooney makes fresh dig at Ronaldo amid recent comments in Morgan interview clash England 6-2 Iran LIVE: Record-breaking Three Lions put on a show in World Cup opener Tottenham striker Kane spoke of his sadness and anger that the Three Lions weren’t able to show their support on the pitch. He said after their win over Iran: “We’re disappointed. We wanted to wear it, that decision was taken out of my hands. “I turned up to the stadium with the armband that I wore and I was told I had to wear that. “Look, it’s out of our control as players. I’m sure the FA and FIFA will continue those discussions but most importantly today we focused on the game and got a great result. GettyIt has been claimed that skippers that wore the ‘OneLove’ armband could have received a one-game ban[/caption] “You’ve seen over the last five years we’ve made a stand as a squad and we’ll continue to do that as much as we can. “We took a knee today as well but sometimes these decisions aren’t up to us and that’s the bottom line.” It was a view echoed by England boss Gareth Southgate, who said in his post-match press conference: “People know who we stand for, people know this group of players. “We took a knee as we felt we could make a difference. There are other things where we can’t make a difference, so we have to channel our energy in other directions. “Every coach has the right to focus on the football. There are other issues we want to speak about. For 12 months we have done that. But this is the World Cup. “We won’t refuse to answer anything and there’s nothing I won’t speak about, but the predominant part of my energy has to be on preparing the team. “Other people at our federation have to deal with our issues. It’s not the responsibility of the players, they didn’t decide where we are. That’s my feeling at the moment.” talkSPORT World Cup 2022 Coverage talkSPORT will be offering wall-to-wall coverage of the 2022 World Cup We’ll be broadcasting all 64 games in the tournament live, with over 600 hours of coverage across our network. You can tune in to talkSPORT and talkSPORT 2 via our free online streaming service at talkSPORT.com. talkSPORT is widely available across the UK via DAB digital radio and on 1089 or 1053 AM. You can also download the talkSPORT app, or ask your smart speaker to play talkSPORT.","pubDate":"2022-11-21 22:10:39","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"The Emirati refereeing staff appears in the match between Spain and Costa Rica","link":"https://thenewsglory.com/the-emirati-refereeing-staff-appears-in-the-match-between-spain-and-costa-rica/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"The International Federation of Football Associations (FIFA) chose an Emirati referee, led by international referee Mohammed Abdullah Hassan, to lead the match between Spain and Costa Rica, which is scheduled for tomorrow at Al-Thumama Stadium, in the Group E matches of the 2022 World Cup in Qatar. The Emirati arbitration team includes the two assistant […]","content":"The International Federation of Football Associations (FIFA) chose an Emirati referee, led by international referee Mohammed Abdullah Hassan, to lead the match between Spain and Costa Rica, which is scheduled for tomorrow at Al-Thumama Stadium, in the Group E matches of the 2022 World Cup in Qatar. The Emirati arbitration team includes the two assistant referees, Mohammed Al Hammadi and Hassan Al Mahri. This is the first appearance of the UAE refereeing team in the World Cup in Qatar, after the same team had previously appeared in the 2018 World Cup in Russia. The Emirati arbitration team prepared well for the honorable appearance in this event, after an intensive period of preparation and preparation, which lasted about four years, since the end of its participation in the last edition of the World Cup. The Emirati crew, led by Muhammad Abdullah Hassan, appeared in leading many important matches and tournaments, including managing the 2021 AFC Champions League final, between Al Hilal Saudi Arabia and the South Korean Pohang Steelers, the 2019 Asian Cup in the UAE, and many other foreign participations. This is the seventh time that UAE arbitration is present in the World Cup, after it was found in previous periods in the 94, 98, 2002, 2006, 2010 and 2018 editions. To view an electronic supplement.. World Cup teams , Please click on this link. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2022-11-21 22:05:00","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Lewandowski wants to dismantle Mexico’s goal at Stade 974","link":"https://thenewsglory.com/lewandowski-wants-to-dismantle-mexicos-goal-at-stade-974/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"Poland and its veteran scorer, Robert Lewandowski, will face Mexico at Stadium 974, the only one of the eight World Cup stadiums that will be completely dismantled, in Group C. Poland is counting in its ninth participation, most notably in 1974 and 1982, on the new striker of Barcelona, ​​​​Spain, and one of the makers […]","content":"Poland and its veteran scorer, Robert Lewandowski, will face Mexico at Stadium 974, the only one of the eight World Cup stadiums that will be completely dismantled, in Group C. Poland is counting in its ninth participation, most notably in 1974 and 1982, on the new striker of Barcelona, ​​​​Spain, and one of the makers of Bayern Munich’s glories in the last decade, who, with his experience (34 years), wants to compensate for a disappointing participation in 2018, when his team bottomed his group in the group stage and failed to score any. Goal. “Of course I am thinking about the last World Cup,” said Leiva, the best scorer in Poland’s history (76 in 134 international matches). I will do everything to fulfill my dream of scoring in the World Cup.” As for Mexico, participating for the 17th time, most notably in 1970 and 1986 at home when it reached the quarter-finals, its Argentine coach Gerardo “Tata” Martino hopes that Wolverhampton striker Raul Jimenez will be able to participate. The 31-year-old has not played with El Tre since last August due to a thigh injury, after a stuttering start to the season with another knee injury. To view an electronic supplement.. World Cup teams , Please click on this link. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2022-11-21 22:05:00","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"The Emirati refereeing staff appears in the match between Spain and Costa Rica","link":"https://thenewsglory.com/the-emirati-refereeing-staff-appears-in-the-match-between-spain-and-costa-rica/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"The International Federation of Football Associations (FIFA) chose an Emirati referee, led by international referee Mohammed Abdullah Hassan, to lead the match between Spain and Costa Rica, which is scheduled for tomorrow at Al-Thumama Stadium, in the Group E matches of the 2022 World Cup in Qatar. The Emirati arbitration team includes the two assistant […]","content":"The International Federation of Football Associations (FIFA) chose an Emirati referee, led by international referee Mohammed Abdullah Hassan, to lead the match between Spain and Costa Rica, which is scheduled for tomorrow at Al-Thumama Stadium, in the Group E matches of the 2022 World Cup in Qatar. The Emirati arbitration team includes the two assistant referees, Mohammed Al Hammadi and Hassan Al Mahri. This is the first appearance of the UAE refereeing team in the World Cup in Qatar, after the same team had previously appeared in the 2018 World Cup in Russia. The Emirati arbitration team prepared well for the honorable appearance in this event, after an intensive period of preparation and preparation, which lasted about four years, since the end of its participation in the last edition of the World Cup. The Emirati crew, led by Muhammad Abdullah Hassan, appeared in leading many important matches and tournaments, including managing the 2021 AFC Champions League final, between Al Hilal Saudi Arabia and the South Korean Pohang Steelers, the 2019 Asian Cup in the UAE, and many other foreign participations. This is the seventh time that UAE arbitration is present in the World Cup, after it was found in previous periods in the 94, 98, 2002, 2006, 2010 and 2018 editions. To view an electronic supplement.. World Cup teams , Please click on this link. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2022-11-21 22:05:00","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Fifa World Cup: England v Iran - Protests about women’s rights overshadow Iranian defeat","link":"https://www.newstalkzb.co.nz/news/sport/fifa-world-cup-england-v-iran-protests-about-women-s-rights-overshadow-iranian-defeat/","keywords":null,"creator":null,"video_url":null,"description":"Iran’s players didn’t sing their national anthem and didn’t celebrate their goals. In the stands, many Iranian fans showed solidarity with the protest movement that has roiled the country for months. Iran’s World Cup opener on Tuesday (NZT) against England was not just about football, but the political struggles gripping the Islamic Republic. And for some Iranian women, barred from attending men’s football matches at home, it was a precious first chance to see the national team live. “Do you know how painful it is to be the biggest football fan and never go to a match in 34 years?” said Afsani, a 34-year-old beekeeper from Tehran, who travelled to Qatar to watch the men’s team for the first time. She said she wept when she entered the Khalifa International Stadium. This is what courage looks like. https://t.co/OaFbwsvSXK— Piers Morgan (@piersmorgan) November 21, 2022 Like other Iran fans, Afsani declined to give her last name for fear of government reprisals. Iran lost 6-2 to a superior England team, but the result wasn’t the most important to Mayram, a 35-year-old Tehran resident who also watched her first football match live. She was disappointed that the players didn’t show more overt solidarity with the protests at home. “You have girls being killed in the street,” she said. “It’s hard to say but this is not a happy occasion. It is really sad.” Iran is competing in the World Cup amid a violent crackdown on a major women’s protest movement that has resulted in the deaths of at least 419 people, according Human Rights Activists in Iran, a group that has been monitoring the protests. The unrest was spurred by the September 16 death of 22-year-old Mahsa Amini in the custody of the country’s morality police. It first focused on the state-mandated hijab, or headscarf, for women, but has since morphed into one of the most serious threats to the Islamic Republic since the chaotic years following its founding. Many Iran fans in Doha wore T-shirts and waved signs with the mantra of the uprising — “Woman, Life, Freedom”. Others wore jerseys bearing the names of female protesters killed by Iranian security forces in recent weeks. Iranian football fans hold up signs calling for greater rights for women at the World Cup match between England and Iran. Photo / AP In the 22nd minute of the match — a reference to Amini’s age when she died — some fans chanted her name, though the refrain quickly faded out and was replaced by “Iran”. Other fans dressed in conservative black chadors and hijabs in the colour of the Iranian flag cheered loudly for their national team. Many of them declined to speak about the political situation, saying it was not relevant to them. Before international matches, Iran’s players usually sing the national anthem with the right hands on their heart. On Monday they stood silently, their arms draped around each other’s shoulders, prompting Iran’s state TV to cut from a close-up of the players’ faces to a wide shot of the pitch. During the match, the players didn’t celebrate their two goals, something that has become common in Iranian league matches since the protests began. The question of whether to root for the national team has divided Iranians. Many now view support for the Iranian team as a betrayal of the young women and men who have risked their lives in the streets. “The protest movement has overshadowed the football,” said Kamran, a linguistics professor who lives in the verdant northern province of Mazandaran. “I want Iran to lose these three games.” Others insist the national team, which includes players who have spoken out on social media in solidarity with the protests, is representative of the country’s people and not its ruling Shiite clerics. The team’s star forward, Sardar Azmoun, has been vocal about the protests online. He was on the bench during the match, to the dismay of fans who said they were looking to him to make a gesture of protest on the pitch. Two former football stars have even been arrested for backing the movement. Ali Jassim, a 14-year-old Iranian fan, said he was sure the political crisis was affecting the team’s performance, as England went up 3-0 at halftime. “I don’t know how they can focus in a stadium full of so many people who want them to fail,” he said. The Iranian government has tried to encourage citizens to support their team against Iran’s traditional enemies. Iran plays the United States on November 29 — a contentious showdown that last occurred at the 1998 World Cup in France. Observers note that the players are likely facing government pressure not to side with the protests. Already, Iranian athletes have drawn enormous scrutiny. When Iranian climber Elnaz Rekabi competed in South Korea without wearing her country’s mandatory headscarf, she became a lightning rod of the protest movement. A woman holds up sign at Iran's match against England. Photo / AP “At the end of the day, I want the players to achieve their dreams,” said Mariam, a 27-year-old sports fan and international relations student who travelled to Doha from Tehran to watch her first men’s soccer match live. “It’s not their fault our society is so polarised.” Mariam said a big achievement for the women protesting at home would be the right to choose whether to wear the hijab. “But after that, women will go for their right to be in stadiums.”","content":"Iran’s players didn’t sing their national anthem and didn’t celebrate their goals. In the stands, many Iranian fans showed solidarity with the protest movement that has roiled the country for months. Iran’s World Cup opener on Tuesday (NZT) against England was not just about football, but the political struggles gripping the Islamic Republic. And for some Iranian women, barred from attending men’s football matches at home, it was a precious first chance to see the national team live. “Do you know how painful it is to be the biggest football fan and never go to a match in 34 years?” said Afsani, a 34-year-old beekeeper from Tehran, who travelled to Qatar to watch the men’s team for the first time. She said she wept when she entered the Khalifa International Stadium. Like other Iran fans, Afsani declined to give her last name for fear of government reprisals. Iran lost 6-2 to a superior England team, but the result wasn’t the most important to Mayram, a 35-year-old Tehran resident who also watched her first football match live. She was disappointed that the players didn’t show more overt solidarity with the protests at home. “You have girls being killed in the street,” she said. “It’s hard to say but this is not a happy occasion. It is really sad.” Iran is competing in the World Cup amid a violent crackdown on a major women’s protest movement that has resulted in the deaths of at least 419 people, according Human Rights Activists in Iran, a group that has been monitoring the protests. The unrest was spurred by the September 16 death of 22-year-old Mahsa Amini in the custody of the country’s morality police. It first focused on the state-mandated hijab, or headscarf, for women, but has since morphed into one of the most serious threats to the Islamic Republic since the chaotic years following its founding. Many Iran fans in Doha wore T-shirts and waved signs with the mantra of the uprising — “Woman, Life, Freedom”. Others wore jerseys bearing the names of female protesters killed by Iranian security forces in recent weeks. In the 22nd minute of the match — a reference to Amini’s age when she died — some fans chanted her name, though the refrain quickly faded out and was replaced by “Iran”. Other fans dressed in conservative black chadors and hijabs in the colour of the Iranian flag cheered loudly for their national team. Many of them declined to speak about the political situation, saying it was not relevant to them. Before international matches, Iran’s players usually sing the national anthem with the right hands on their heart. On Monday they stood silently, their arms draped around each other’s shoulders, prompting Iran’s state TV to cut from a close-up of the players’ faces to a wide shot of the pitch. During the match, the players didn’t celebrate their two goals, something that has become common in Iranian league matches since the protests began. The question of whether to root for the national team has divided Iranians. Many now view support for the Iranian team as a betrayal of the young women and men who have risked their lives in the streets. “The protest movement has overshadowed the football,” said Kamran, a linguistics professor who lives in the verdant northern province of Mazandaran. “I want Iran to lose these three games.” Others insist the national team, which includes players who have spoken out on social media in solidarity with the protests, is representative of the country’s people and not its ruling Shiite clerics. The team’s star forward, Sardar Azmoun, has been vocal about the protests online. He was on the bench during the match, to the dismay of fans who said they were looking to him to make a gesture of protest on the pitch. Two former football stars have even been arrested for backing the movement. Ali Jassim, a 14-year-old Iranian fan, said he was sure the political crisis was affecting the team’s performance, as England went up 3-0 at halftime. “I don’t know how they can focus in a stadium full of so many people who want them to fail,” he said. The Iranian government has tried to encourage citizens to support their team against Iran’s traditional enemies. Iran plays the United States on November 29 — a contentious showdown that last occurred at the 1998 World Cup in France. Observers note that the players are likely facing government pressure not to side with the protests. Already, Iranian athletes have drawn enormous scrutiny. When Iranian climber Elnaz Rekabi competed in South Korea without wearing her country’s mandatory headscarf, she became a lightning rod of the protest movement. “At the end of the day, I want the players to achieve their dreams,” said Mariam, a 27-year-old sports fan and international relations student who travelled to Doha from Tehran to watch her first men’s soccer match live. “It’s not their fault our society is so polarised.” Mariam said a big achievement for the women protesting at home would be the right to choose whether to wear the hijab. “But after that, women will go for their right to be in stadiums.”","pubDate":"2022-11-21 21:27:26","image_url":"https://www.newstalkzb.co.nz/media/eqij5f5a/iranian-players-did-not-sing-their-anthem-before-their-world-cup-match-between-england-getty-images.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Giovanni van Bronckhorst’s Rangers red flag was on show BEFORE reign even started, says Ibrox hero in brutal assessment","link":"https://www.thescottishsun.co.uk/sport/football/9800903/giovanni-van-bronckhorst-rangers-red-flag-brutal-assessment/","keywords":["Football","Scottish Premiership","Sport"],"creator":["Chris Dodds"],"video_url":null,"description":null,"content":"KEVIN THOMSON believes that there were red flags shown even before Giovanni van Bronckhorst's Rangers tenure had begun. The Dutch boss was dismissed from his role only a year after replacing Steven Gerrard. 2 Van Bronckhorst was relieved of his duties this morning after only a year in charge. Credit: Getty 2 Kevin Thomson reckons there were VERY early warning signs Credit: Kenny Ramsay Despite being on the cusp of European euphoria and winning the Scottish Cup last term, van Bronckhorst oversaw a dramatic downturn in form that saw Rangers slip nine points behind league leaders Celtic before the World Cup break, as well as finishing bottom of their Champions League group. Gers dropped seven points out of a possible fifteen that remained and the Ibrox top brass decided that enough was enough by wielding the axe. And Thomson believes that the warning signs were there even BEFORE van Bronckhorst officially started his role - when he sat in the stands of Gers 3-1 defeat to Hibs in the Premier Sports Cup semi-final. The former Hibs midfielder acknowledged the success the Dutchman had as a player at Ibrox, but doesn't think he ever showed enough to suggest he was the right man to manage the club. Read More Rangers Stories Highs & lows Six of Gio van Bronckhorst's best days as Rangers manager and six of his worst Homecoming Graeme Souness reveals Steven Gerrard chat and weighs up Ibrox return chances He told BBC Sportsound : \"All the fans will remember his great playing days but when you get the opportunity to manage a great club, unfortunately, they need to carry the can when things don't go right. \"I don't know if plaudits is the right thing to say, but speaking at the Premier Sports Cup semi-final last year I had a lot of people agreeing with me when I thought he should've taken the team that day. \"I also said, and I know that there was legalities, but I was just offering my opinion with raw emotion on how the game changed. \"I remember when Walter Smith used to let Ally McCoist take the team and we were down to nine men against St Mirren . Most read in Football Tough test New Gers boss’ first game lined up in closed-door clash with Championship side OUT OF THE BLUE New name emerges as Gers manager contender and installed among favourites TOP TARGET Gers hero Alex Rae names front runner to replace van Bronckhorst after sacking BLUE BOSS Michael Beale favourite to be next Rangers boss as Gerrard drops out running \"Coisty used to always run the team, I know it was different and I know he was allowed to do it and I don't want to put Gio on the spot that he should've went into the dressing room at half-time. \"Nobody envisioned, not even Jack Ross did, how Hibs were going to play in that first half against Rangers. \"Looking back, it felt like the manager, the leader had to make a stamp and he had to show that he had the personality there and that he was ready to go forward. \"I felt like that was a little bit of a red flag for me, personally. \"I have to say, I don't know him personally, and I'm a big voucher for people doing well. \"I know a lot of the boys, the younger players and even the likes of Greegsy (Allan McGregor) and Steve Davis. \"I do have a small opinion that there's a small ingredient that you need to succeed at Rangers and when I used to watch him do interviews, i watched him and studied him in what he said and his body language on the touchline. \"I just feel like he needed that little bit of grit between his teeth, that sturdy bit at the back of your throat that Walter had. Read More on The Sun TESCO LIFE Tesco worker reveals the secret shop that most people don’t know about FRY WAIT? I couldn't wait to test out Asda's £32 air fryer - here's how it went \"I just feel like certain people are made for a club like Rangers and Gio as a player, that was unquestionable but i felt the team needed that spark and that passion. \"It looked like to me for the last few months that that had been lacking.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-11-21 21:27:01","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"America and Wales are tied in the strongest World Cup meetings","link":"https://thenewsglory.com/america-and-wales-are-tied-in-the-strongest-world-cup-meetings/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"America and Wales presented the most beautiful match in the World Cup so far after 4 matches and tied positively with a goal for each of them in a match that also witnessed a historic event when Timothy Weah, son of Liberian President George Weah, scored America’s first goal in the World Cup from a […]","content":"America and Wales presented the most beautiful match in the World Cup so far after 4 matches and tied positively with a goal for each of them in a match that also witnessed a historic event when Timothy Weah, son of Liberian President George Weah, scored America’s first goal in the World Cup from a wonderful move inside the penalty area in the half The first announced America’s first goal in the 37th minute of the match, taking advantage of a wonderful pass from Christian Pulisic, to end the first half with America’s lead. In the second half, the Wales national team moved forward and took advantage of the American national team’s retreat to the back, so that the Welsh national team captain, Gareth Bale, got a penalty kick in the 82nd minute, and the player himself managed to successfully pay the penalty kick, to snatch the equalizing point for the Wales national team, and the performance continued strong between The two teams, until the whistle of the match referee, who ended this football saga with a positive draw, and each team got a point from the match. With this result, the two teams got a point in the second group ranking table, which is led by the England team, after its great victory over Iran by six. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2022-11-21 21:22:49","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Canadian Premier League terminates Fath Sports' right to operate FC Edmonton - Canadian Premier League","link":"https://news.google.com/__i/rss/rd/articles/CBMiZGh0dHBzOi8vY2FucGwuY2EvYXJ0aWNsZS9jYW5hZGlhbi1wcmVtaWVyLWxlYWd1ZS10ZXJtaW5hdGVzLWZhdGgtc3BvcnRzLXJpZ2h0LXRvLW9wZXJhdGUtZmMtZWRtb250b27SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Canadian Premier League terminates Fath Sports' right to operate FC Edmonton  Canadian Premier LeagueFC Edmonton won't operate in 2023, CPL hints at 2024 return - Edmonton | Globalnews.ca  Global NewsCanadian Premier League Pulls Plug On FC Edmonton  Northern TribuneView Full Coverage on Google News","content":null,"pubDate":"2022-11-21 21:06:14","image_url":null,"source_id":"google","country":["canada"],"category":["sports"],"language":"english"},{"title":"Why Gallen is rejecting millions to fight SBW","link":"https://www.themercury.com.au/sport/boxing-mma/fight-club-2022-paul-gallen-rejects-5-million-sbw-fight-tim-tszyu-plans-shock-us-relocation/news-story/c53b22d36cee77b0396e714f7a9dd0e5","keywords":["Boxing MMA","Sport news and galleries"],"creator":null,"video_url":null,"description":"Not even a guaranteed $5 million will convince Paul Gallen to come out of retirement to fight Sonny Bill Williams next year.","content":"Gallen will farewell boxing with a rematch against Justin Hodges at Sydney’s ICC Super Aware Theatre on Wednesday night, and has closed the door on a potential mega-rich comeback fight against rival Williams.“I’ll never fight Sonny Bill, I’ll say that right now, even if they guaranteed $5 million in my bank account before the fight, because he’d make $5 million too,” Gallen said.“He had his chance. We should have fought twice over the last couple of years. The ego and arrogance from their side is at a level that I don’t want to be involved in.“No Limit don’t want to be involved with them, No Limit’s the biggest and best promoter in Australia and they don’t want to be involved with them? What does that say?“That fight will never happen, I’m not going to talk crap about Sonny. I was asked if Sonny should fight again, yes, Sonny is 37, he’s got plenty left in him.“Look what I’ve done in the last three years, grossed $25 million. He could do the same, make millions. But I will not fight Sonny Bill, ever.”Williams was recently stopped by Mark Hunt — his first loss in boxing — but is tipped to continue his fight career.Williams and his camp could not be reached for comment.The reason Gallen is so certain about retirement is clear – his family.“They don’t want me to fight anymore, they’re adamant,” Gallen said.“My missus is 100 per cent adamant, my son who I love more than life, he doesn’t want to see me do it anymore. And at some stage I’ve got to put them first.“I’ve been a professional athlete since I was 18 years old.”But Hodges plans to ruin Gallen’s retirement party for the sake of his own.“There is a lot of tension, it’s going to boil over in the fight, this one means a lot to both of us, it’s our last fight and we both want to go out as a winner,” Hodges said.“Last time I hit him, it wasn’t even a hard shot but I dropped him. I’ve only got to hit him once, he’s got to hit me multiple times just to slow me down.“If I pick my punches, land the right one at the right time, he won’t be getting up.”Hodges plans to celebrate victory by heading up to his home town of Cairns and drinking beer while fishing in the local rivers.Watch Gallen v Hodges 2 & Michael Zerafa’s return to the ring LIVE on Main Event available on Foxtel & Kayo Sports, Wednesday November 23 from 7pm AEDT ORDER NOW >TSZYU’S AUDACIOUS MOVE WILL RATTLE AUSTRALIAN BOXINGNot only has Tim Tszyu declared he will never fight Michael Zerafa, he’s revealed plans to permanently relocate to the United States following his world title fight against Jermell Charlo in January.Tszyu revealed his shock plans to live in the US to News Corp Australia after obtaining a travel visa on Monday that will allow him to be based there for the next 10 weeks in preparation for the undisputed super-welterweight showdown against champion Jermell Charlo.Earlier, Tszyu had phoned Paul Gallen during Monday’s live televised press conference promoting Gallen vs Justin Hodges and Zerafa vs Danilo Creati.Gallen, sitting next to Zerafa, answered the call and said: “Tim wants to know if you’re turning up this time”, to which Zerafa replied: “I’ll help pick him up off the canvas once he gets knocked out by Charlo”.The exchange, and the fact Zerafa has been put on the show by Tszyu’s promoters No Limit Boxing, has prompted speculation a Tszyu-Zerafa showdown looms in future.But Tszyu has shattered that notion. “He literally missed my fight, we had a fight and he pulled out, that’s it, the ship has sailed.“I’m onto Las Vegas. I’m considering moving to America, basing myself there, that’s the option I’m going.“Talking about fights against Zerafa? Come on man.“I’ll see what happens after the Charlo fight. I’ve conquered Australia, I’ve done what needs to be done, my goal is to conquer America and to do that, you’ve got to go there.“That’s what I’m doing. One step at a time. “First it was Minnesota, now it’s Las Vegas, the biggest stage of them all.“I’m chasing the biggest fights, I’m not chasing loudmouths and flops.“Zerafa needs me more than I need him, I don’t need him at all. He’s already pulled out and he showed his true colours there, so that fight is not happening and will never happen.“When he fought in America he was put on a stretcher after getting knocked out by Peter Quillin.”Tszyu met with Australian cricketer David Warner in Melbourne on Monday, and said he’d entertain a future fight at the MCG, but that won’t be against Zerafa.DEADLY AIRPORT CRASH THREATENS BOUT It’s not often a deadly airport crash threatens to cancel a fight, but that was nearly the case for rising star Paulo Aokuso, whose opponent David Zegarra narrowly avoided disaster last weekend.Zegarra was awaiting his flight to Sydney from Peru’s Lima Airport last Friday when a plane taking off from the runway collided with a truck, killing two people.Thankfully the out-of-control plane didn’t career into the crowded terminal where Zegarra was waiting.Naturally, the airport was closed for quite some time, and Zegarra had to scramble for a new flight.He’ll arrive for Wednesday’s fight in time, but with very little time to shed the water he’ll retain at high altitude, meaning there’s a fair chance he will weigh over the light-heavyweight limit of 79kg at Tuesday’s weigh-in.“Just as long as he turns up to fight, and as long as he returns home safely, I’m not fazed,” Aokuso said.“I don’t care if he’s five kilograms heavier, I’ll still take the fight. It’s not going to be an issue at all.”Aokuso’s cousin Joseph Sua’ali’i, who starred for Samoa at the Rugby League World Cup, will defy jet lag to attend the fight after his 30-hour flight home.Tokyo Olympian Aokuso (2-0, 2KO) continues to take huge risks early in his career as he seeks to break Jeff Fenech’s Australian record of fastest man to a world title, in six to seven pro bouts.Aokuso defeated the seasoned Michael Van Nimwegen on debut, then stopped former world title challenger Robert Berridge in his second.Now he takes on Zegarra (35-8-1, 22KO), whose been in the ring with the likes of David Lemieux, Ali Akhmedov and Julio Cesar Chavez Jr.“I’ve fought two experienced fighters in my first two professional fights, there’s nothing I haven’t seen,” Aokuso said.“He’ll bring his experience to the ring, different strategies, he’ll turn up the pace each round, but I know I’ll just do it.“I feel like a lot of people are sleeping on me. I’ve only had two fights and haven’t really shown much, but hopefully as my fights progress they’ll see it.”ROOSTERS ENFORCER FOCUSING ON THE ART OF SPEEDIf study is a guide, expect to see lightning speed from Sio Siua Taukeiaho in his boxing debut against giant former league prop Jaiman Lowe.The NRL Roosters enforcer has been watching two of the fastest punchers above middleweight in preparation for his fight.“I watch Canelo Alvarez a few times, and Andy Ruiz, as a heavyweight, the speed and power he’s got,” Taukeiaho said.“I want to apply pressure, especially a big bloke like him (Lowe), you also don’t want to get caught by one of his heavy hands but you do want to tire him out early.“I’ll throw my jabs and work around him, I want to pick him out, see how I go in round one and whatever I can see, I’ll bring that in round two. If I can close it early, cool.”WHERE RABBITOHS GUN FINDS HIS STRENGTHRabbitohs prop Daniel Suluka-Fifita will have all the support he needs in the crowd on Wednesday when he fights Bryce Jones.“With this challenge, my motivation is my family,” Suluka-Fifita said.“I have kids, they’ll be there Wednesday night. I’ve got two kids, twins, Tobias and Taimani, a boy and a girl who are three years old. They’re my why.“My partner Layla McKay is beautiful, she helps with everything at home, she’s great.“Once I see them on Wednesday night, I’ll be ready to go.”Former Rooster Suluka-Fifita grew up in Redfern and started boxing training at 14, and is confident this fight will have him primed for a massive NRL season.“When I wasn’t playing footy I was doing boxing, so I always had the desire and now I get to make my pro debut,” he said.“I haven’t had a break, I’ve been training for eight weeks. I feel fitter, this is probably the fittest I’ve felt in my career so I’m looking forward to the 2023 season with South Sydney and we’ll get it done.”","pubDate":"2022-11-21 21:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Bills-Lions Thanksgiving Week 12 Odds, Lines and Spread","link":"https://www.si.com/betting/2022/11/21/odds-lines-spread-bills-lions-thanksgiving-week-12","keywords":["NFL","Betting","Fantasy/Betting","NFL Betting"],"creator":["Frankie Taddeo"],"video_url":null,"description":"The Bills are large road favorites on Thanksgiving against the Lions.","content":"The Bills are large road favorites on Thanksgiving against the Lions.Josh Allen and the high-powered Bills are the appetizer for NFL fans on Thanksgiving Day, kicking off the Week 12 three-game holiday slate when they head to Ford Field to square off with Jared Goff and the surging Lions.Buffalo is 3-2 straight-up (SU) and 2-2-1 against the spread (ATS) on the road this season and aims to earn a victory for the second consecutive week at Ford Field. The Bills defeated the Browns at Ford Field in Week 11 after a a massive snowstorm in upstate New York forced Sunday’s game to be moved. The Lions have won three consecutive games both SU and ATS over the Packers, Bears and Giants and look to end a streak of futility on Thanksgiving. Detroit owns a 37-43-2 (.462) record on Turkey Day and has lost five consecutive games (0-5 SU, 2-3 ATS) dating back to 2017. Buffalo is 5-4-1 in its history on Thanksgiving and owns a two-game winning streak on America’s favorite football holiday with Allen under center, previously beating the Saints last season as well as the Cowboys back in 2019. Detroit has been an underdog  in nine out of ten games but has thrived in that role, posting a 6-3 ATS mark. Buffalo Bills vs. Detroit Lions OddsSpread: Buffalo -9 (-110) | Detroit +9 (-110)Moneyline: BUF (-400) | DET (+310)Total: 53.5 – Over (-110) | Under (-110)Public (Spread) Betting Percentages: BUF 48% | DET 52%Game Info: Nov. 24, 2022 | 12:30 p.m. ET | CBSBills Straight-Up Record: 7-3Bills Against The Spread Record: 5-4-1Lions Straight-Up Record: 4-6Lions Against The Spread Record: 6-4Bet on Bills-Lions at SI Sportsbook Vincent Carchietta-USA TODAY Sports The line has held steady since its opening of Buffalo as a nine-point road favorite over Detroit at SI Sportsbook. The game total has witnessed solid steam in early wagering, pushing the opening number of 52.5 up to 53.5. The Bills possess the NFL’s third-best aerial attack, averaging 283.4 passing yards per game, and face Detroit’s fifth-worst passing defense that allows 262.2 passing yards per game to quarterbacks. Buffalo needs to involve Gabe Davis more in the red zone, as the talented wideout has just one touchdown over his last four games. Buffalo finds a favorable ground matchup. The Bills possess the league’s ninth-best rushing attack (134 yards per game) and encounter Detroit’s 31st-ranked run defense that surrenders 153.7 yards per game. Devin Singletary has three rushing touchdowns in his last two games and is poised to find paydirt once again versus a defense that has allowed 12 rushing touchdowns to running backs this season.Josh Allen has only thrown two touchdowns over his last three games and should post solid production against a Lions’ secondary that has surrendered 16 passing scores to quarterbacks in 2022. The dual-threat talent could also find success using his legs against a Detroit defense that allowed three rushing scores to Justin Fields and Daniel Jones in the last two games.D’Andre Swift and Jamaal Williams have combined for 17 touchdowns and find an enticing matchup against a Bills’ defense that has surrendered four rushing touchdowns to running backs over the last three weeks. For player proposition bettors, Williams, who leads the NFL in touchdowns (12), will be an attractive leg to use in Same-Game Parlays (SGP) in his ‘Anytime Touchdown’ market.Goff has thrived at home this season, throwing 86.7% of his touchdowns (13/15) in front of Lions Nation. Respected money believes Detroit has enough balance both in the air and on the ground to stay within this big number. Grab the healthy amount of points on a live home underdog in a potential high-scoring affair.BETS: LIONS +9 (-110) Enter SI Sportsbook’s Free Perfect 10 Contest for a Shot at $10,000! TrendsDetroit is 3-0 ATS over its three-game winning streakThe under is 7-3 in Buffalo’s ten games this seasonThe over is 7-3 in the Lions’ ten games in 2022The Bills are 3-0 SU and 2-1 ATS in the last three meetings with the LionsDetroit is 0-5 SU and 2-3 ATS over its last five Thanksgiving Day games2022 SI Betting Thursday Night Football: 18-24-1+ Props -3.25 U2021 SI Betting Monday Night Football: 25-20 ATS + Props +5.75 U2021 SI Betting Playoffs: 8-7-1 ATS + Prop Wagers +4.00 U2021 SI Betting NFL Football: 53-44-1 ATS + Props +14.22 U2020 SI Betting NFL Football: 72-58-1 ATS (55%)Frankie Taddeo is a successful high-stakes fantasy football player who created the first-ever DFS program ever offered in a Las Vegas sportsbook. Frankie is SI Betting's Senior Analyst and provides his significant experience and resources in the sports betting scene. You can follow Frankie on Twitter @Frankie_Fantasy for his latest betting and fantasy insights from Las Vegas.Get fantasy and betting analysis in your inbox by signing up for the Winners Club newsletterCheck the Latest Odds from SI SportsbookMore Betting, Fantasy and NFL:• Giants-Cowboys Best Bet• Patriots-Vikings Best Bet• World Cup Odds• World Cup Golden Boot Odds• Early Week 12 Waiver Wire• MMQB Week 11 Awards","pubDate":"2022-11-21 20:52:23","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Ch_1200%2Cq_auto:good%2Cw_1200/MTkzOTExOTE1MDc5MTQ5MDQw/dandre-swift.png","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Argentina debuta y Francia inicia la defensa de su título este martes","link":"https://primicia.com.ve/deportes/argentina-debuta-y-francia-inicia-la-defensa-de-su-titulo-este-martes/","keywords":["Deportes","Albiceleste","Arabia Saudita","Argentina","Debut","Dinamarca","Francia","fútbol","Grupo C","Grupo D","Lionel Messi","Lionel Scaloni","México","previas","Túnez"],"creator":["Karla Benitez"],"video_url":null,"description":"Aunque es amplia favorita por historia y la jerarquía de sus jugadores, el recuerdo de lo que sucedió hace cuatro años obliga a la Albiceleste a tomarse muy en serio el primer partido contra los árabes. La entrada Argentina debuta y Francia inicia la defensa de su título este martes se publicó primero en Diario Primicia.","content":"Si hay un partido del Mundial que desvela a Argentina es el debut ante Arabia Saudí. Y en especial a su capitán Lionel Messi. Aunque es amplia favorita por historia y la jerarquía de sus jugadores, el recuerdo de lo que sucedió hace cuatro años obliga a la Albiceleste a tomarse muy en serio el primer partido contra los árabes el martes en el estadio Lusail por el Grupo C del Mundial. En Rusia 2018, Argentina debutó con un inesperado empate 1-1 contra la ignota Islandia, duelo en el que al capitán Messi desperdició un penal. El punto de partida condicionó al dos veces campeón mundial para el resto de la competencia, que terminaría con la eliminación ante Francia en los octavos de final. “Esperamos un partido difícil, por lo que significa el comienzo de un Mundial. Para muchos de este grupo es su primera Copa del Mundo, cada uno manejará como pueda la ansiedad y nervios”, dijo Messi el lunes en rueda de prensa previa al debut. “Pero cuando pasen cinco minutos trataremos de hacer lo que venimos haciendo, buscar ganar el partido desde el principio y respetando al rival”, añadió. Messi, el arquero suplente Franco Armani, el defensor Nicolás Otamendi y el delantero Ángel Di María son los únicos sobrevivientes del fracaso en Rusia. El resto del plantel argentino hará su debut en una Copa del Mundo. A diferencia de lo que sucedió en la última Copa del Mundo, a la que había clasificado de forma agónica, Argentina llega a Catar con la autoestima por las nubes. Bajo el mando de Lionel Scaloni fue campeón de la Copa América 2021, primer título en 28 años, está invicto hace 36 partidos, a uno de igualar el récord mundial que estableció Italia entre 2018 y 2021. “No sé si llegamos mejor (que al Mundial anterior), pero venimos de ganar y eso descomprime muchísimo. Eso nos hace trabajar de otra manera, hace que la gente no esté tan encima y pendiente de la selección, sino disfrutando”, valoró Messi. El único lunar han sido las lesiones de varios jugadores. En las últimas semanas, Scaloni sufrió las bajas del mediocampista Giovani Lo Celso y los delanteros Nicolás González y Joaquín Correa, quienes fueron parte del plantel campeón continental en Brasil. Incluso, Messi entrenó dos días diferenciado de sus compañeros por una sobrecarga muscular y se temió lo peor. “Me siento muy bien, me siento muy bien físicamente. Creo que llego en un gran momento tanto en lo personal como en lo físico y no tengo ningún problema, confirmó el astro del París Saint-Germain. Con su presencia asegurada, Messi se convertirá el martes en el primer futbolista argentino en disputar cinco mundiales, uno más que Diego Maradona y Javier Mascherano. Con seis goles en mundiales, el astro también busca superar a Gabriel Batistuta como máximo artillero de la Albiceleste en una Copa del Mundo (10). Mientras Argentina participa de mundiales de forma interrumpida desde 1974 y fue campeón en 1978 y 1986, Arabia Saudí se apresta a jugar su sexta Copa del Mundo con el objetivo primario de igualar su mejor marca en el torneo, los octavos de final en Estados Unidos 1994. Los triunfos de Ecuador 2-0 sobre Catar y la goleada de Inglaterra 6-2 sobre Irán en las dos primeras jornadas de la Copa del Mundo evidenciaron el desequilibrio de fuerzas del fútbol europeo y sudamericano con los equipos árabes. Pero Scaloni no se fía. “No me atrevo decir que las selecciones árabes estén por debajo. Ser favoritos hay que demostrarlo, los primeros partidos son diferentes a los demás, tienen carga emotiva diferente y hay que sacarlos adelante”, analizó. Y advirtió: “Los grandes favoritos no ganan los mundiales”. “Los detalles harán campeón del mundo a una selección y no necesariamente es el favorito o la que juegue mejor”, recalcó. El entrenador no confirmó el equipo, pero reconoció que la única duda pasa por el puesto en el mediocampo que quedó vacante por la lesión de Lo Celso: Alexis Mac Allister o Alejandro Gómez. El resto del equipo lo conformarán Emiliano Martínez, Nahuel Molina, Cristian Romero, Otamendi, Nicolás Tagliafico, Rodrigo De Paul, Leandro Paredes, Di María, Messi y Lautaro Martínez. El duelo será a las 6:00 de la mañana. Último entrenamiento de la Selección antes del debut frente a Arabia Saudita 📋 — Selección Argentina 🇦🇷 (@Argentina) Incluso sin el lesionado Karim Benzema, la campeona mundial vigente Francia dispone de un pelotón de opciones en su ataque. A la mayoría de los equipos les encantaría tener ya sea a Kylian Mbappé, Antoine Griezmann o a Olivier Giroud en su delantera, ya no se diga a los tres juntos. Entre ellos suman 119 goles con la selección, además de una abundancia de dinamismo, creatividad, experiencia y habilidad. Pero Francia carece de las mismas garantías en el mediocampo y es ahí donde Australia podría causarle problemas el martes cuando se enfrenten en su primer partido por el Grupo D de la Copa del Mundo. Francia sufrió para vencer 2-1 a Australia cuando ambos midieron fuerzas al estrenarse en el Mundial de Rusia hace cuatro años, y eso fue con una zona media que estaba en todo su esplendor. El entrenador francés Didier Deschamps no podrá contar con los lesionados N’Golo Kante y Paul Pogba, los pulmones del equipo campeón en 2018. Pogba acumula 91 partidos con Francia y uno de sus 11 goles fue en la victoria 4-2 sobre Croacia en la final de 2018. Las dolencias físicas se cebaron con Pogba desde entonces. Kante, en cambio, fue siempre un símbolo de regularidad, y Les Bleus echarán de menos su presencia. Incansable corredor, con una notable habilidad para cerrar espacios para recuperar pelotas y luego salir jugando de forma limpia, Kante es uno de los mejores volantes defensivos del mundo. Pero se recupera de una operación en el bíceps femoral y no podrá sumar a su cuenta de 53 partidos internacionales. Eso deja a Deschamps frente a Australia con un renovado mediocampo, donde el jugador más experimentado es Adrien Rabiot — compañero de Pogba en la Juventus — con 29 apariciones. Rabiot, de 27 años, se siente listo para emerger como el nuevo líder del mediocampo francés. “Cuando jugué con los equipos juveniles de Francia, usualmente era el más experimentado de mis compañeros. Ahora me encuentro en una posición similar”, dijo. “Siento que soy capaz de ayudar a otros y de guiar con el ejemplo. Me gusta estar en esta posición”. Se trata de un cambio radical para Rabiot, quien pidió que le sacases de la lista de reservas de para el Mundial de 2018. Quedó relegado durante dos años por Deschamps, quien dijo que esa decisión “fue un error enorme”. Ahora, Rabiot se perfila como titular por izquierda al saltar en el estadio Al Janoub junto a Aurelien Tchouameni, de 22 años, como el eje, y Eduardo Camavainga (20 años) o Matteo Guendouzi (23) por la derecha. Tchouameni ha impresionado jugando por Francia, pero apenas tiene 14 partidos con Les Bleus y nunca en un gran torneo. Lo mismo ocurre con Guendouzi, con seis partidos, y Camavinga, apenas cuatro. Australia, por su parte, posee un sólido bloque en el medio, encabezado por el experimentado Aaron Mooy, quien jugó un par de temporadas en la Liga Premier con el Brighton y acumula 53 encuentros con la selección absoluta. Mathew Leckie fue el mejor jugador de Australia en la Copa del Mundo de 2014 y representa una amenaza por las bandas. Leckie, de 31 años, es también el líder anotador del equipo con 13 goles internacionales. Leckie y Mooy fueron titulares ante Francia hace cuatro años. “No queremos experimentar el sentimiento luego de ese partido. Aunque ganamos, no jugamos lo suficientemente bien”, dijo el lunes el arquero francés Hugo Lloris. “Debemos ser cuidadosos de sus jugadas con pelota detenida y al contragolpe también son buenos”, insistió. Los planes del entrenador de Australia Graham Arnold fueron alterados cuando el atacante Martin Boyle quedó descartado del encuentro por una lesión en la rodilla. Boyle ha marcado cinco veces en 19 encuentros con Australia. A las 12:00 del mediodía será el pitazo inicial. ⚽ Mundial de De la mano de Mbappé, el campeón Francia 🇫🇷 tendrá su gran debut frente a Australia 🇦🇺 — Agencia Télam (@AgenciaTelam) El partido que enfrentará a Dinamarca y Túnez el miércoles en el Mundial pondrá frente a frente a uno de los países más críticos con el torneo que organiza Catar y a una de las cuatro selecciones árabes que compiten. La cita en el estadio Education City supondrá también el regreso de Christian Eriksen a un gran torneo tras el paro cardiaco que sufrió el año pasado en el Campeonato Europeo. Dinamarca tiene objetivos muy ambiciosos tras alcanzar las semifinales en la Eurocopa, seguida de una campaña de las eliminatorias casi perfecta, mientras Túnez busca superar la fase de grupos por primera vez en su sexta aparición en una Copa del Mundo. Desde su llegada a Catar, Dinamarca ha estado entrenando con una equipación negra en recuerdo de los trabajadores migrantes que fallecieron durante la construcción de la infraestructura para el torneo. Dinamarca tenía previsto emplear el brazalete antidiscriminación de la campaña “One Love” junto a otras selecciones europeas, pero los equipos retiraron la campaña luego de que la FIFA amenazó con sancionar su uso con tarjetas amarillas a los capitanes. “Imagine saltar al campo con una tarjeta amarilla clara para empezar. Eso no es posible y tenemos que asegurarnos de que no depende de los futbolistas tomar esa decisión”, afirmó el seleccionador danés Kasper Hjulmand. El técnico tunecino Jalal Kadri se refirió la polémica diciendo que “estamos en un país árabe con tradición islámica, tenemos que respetar la cultura de otros pueblos”. La vuelta de Eriksen es una de las historias más conmovedoras del torneo, menos de 18 meses después de que los médicos tuviesen que emplear un desfribilador para reanimarlo mientras un país horrorizado — y gran parte del mundo del fútbol — observaba su cuerpo sin vida tendido sobre el césped del estadio Parken de Copenhague. Es la última etapa de su notable regreso a la élite del fútbol, primero a la Liga Premier con Brentford y Manchester United, que demostró que sigue estando entre los mejores volantes creativos del mundo. En marzo reapareció con la selección y anotó dos minutos después de entrar al campo como sustituto en la derrota por 4-2 ante Holanda. “Esto es especial”, dijo Eriksen. “Desde la primera entrevista que hice, cuando dije en público que quería volver a jugar, (competir en un Mundial) era mi primer objetivo. Túnez solo ha conseguido dos victorias en una Copa Mundial: contra México en 1978 y ante Panamá hace cuatro años en Rusia. Pero con su afición viajando en masa para el primer Mundial en Oriente Medio, Kadri ha indicado que dejará el cargo si no avanzan a octavos. Pero esa es una tarea complicada en el Grupo D, que incluye a la vigente campeona Francia y a Australia. Comienza a las 9:00 a.m. 🗣️ El seleccionador de Túnez, Jalel Kadri, valoró la antesala del choque ante Dinamarca: “Nuestro objetivo es que estén orgullosos de nosotros” — Diario AS (@diarioas) La selección mexicana realizó su último entrenamiento previo a su debut en la Copa del Mundo de Catar 2022 contra su similar de Polonia. El combinado comandado por el argentino Gerardo Martino inició su práctica con un “torito” y todos los jugadores de México lucían contentos y relajados sobre la cancha del estadio Al Khor. Cabe destacar que en el entrenamiento estaban presentes Yon de Luisa y Jaime Ordiales, presidente de la Federación Mexicana de Fútbol y director de selecciones nacionales, respectivamente. El ‘Tata’ Martino tendría definido a su once inicial frente a Polonia y según diversos reportes, Henry Martín, jugador del América, sería el centro delantero ante el combinado europeo. El timonel argentino consideraría que el ariete azulcrema es la mejor opción para el primer partido de México en la justa del Medio Oriente al mostrar en los entrenamientos un mejor desempeño que Raúl Jiménez y Rogelio Funes Mori. Sobre el compromiso contra Polonia, Martino reconoció en conferencia de prensa que el resultado ante la plantilla liderada por Robert Lewandowski puede ser decisivo para las aspiraciones de ambas selecciones. “Nosotros siempre buscamos jugar de la misma forma, proponer el partido. El primer partido encamina el recorrido de una Selección en el Mundial; por las características del grupo, ante Polonia es todavía más decisivo”, expresó. Por su parte, Czeslaw Michniewicz, seleccionador de Polonia, destacó la trayectoria de ‘Tata’ Martino así como la experiencia de diversos jugadores de la Selección Mexicana. El estratega polaco aseguró que le tienen mucho respeto al combinado azteca. “Hemos hecho nuestros deberes de scouting y tenemos todo el respeto del mundo a un entrenador que estuvo en Barcelona, tiene jugadores con experiencia y hablamos de Ochoa, que tiene su quinta Copa del Mundo, Moreno también es experimentado, no tenemos esos jugadores de experiencia, tenemos que trasladar esa teoría a la práctica”, señaló. 3:00 p.m. es el inicio del compromiso. 🚨🇲🇽 México realizó su último entrenamiento antes de su debut en ante Robert Lewandowski y Polonia 🇵🇱 🔥 — beIN SPORTS Español (@ESbeINSPORTS)","pubDate":"2022-11-21 20:49:25","image_url":null,"source_id":"primicia","country":["venezuela"],"category":["sports"],"language":"spanish"},{"title":"Sports World Reacts to Tim Weah’s 2022 World Cup Goal for USMNT","link":"https://www.si.com/extra-mustard/2022/11/21/2022-world-cup-sports-world-reacts-tim-weah-goal-usmnt","keywords":["Wire","Breaking","Extra Mustard"],"creator":["Madison Williams"],"video_url":null,"description":"Multiple MLS teams shared the crowd’s reaction to the goal at watch parties around the country.","content":"Multiple MLS teams shared the crowd’s reaction to the goal at watch parties around the country.The United States men’s national team scored first in their match vs. Wales at the 2022 FIFA men’s World Cup on Monday thanks to 22-year-old winger Tim Weah.Weah’s goal came in the 38th minute of the first half after forward Christian Pulisic passed him the ball, putting the United States up 1–0. Because of the importance of Weah’s goal, social media went wild for the USMNT. Fans were excited to see an American World Cup goal for the first time in eight years. It was the first time an American man has scored in the World Cup since 2014 when Julian Green scored in the World Cup’s round of 16 against Belgium.Here’s some of the best social media reactions to the momentous goal on Monday afternoon.Multiple MLS teams across the country held watch parties for the USMNT’s match on Monday. Some of the teams posted videos of the reactions to Weah’s goal, with crowds cheering loudly while jumping up and down as their team took the lead.More Soccer Coverage:Tim Weah Nets First USMNT Goal vs. Wales (Video)How Long Is Soccer Halftime at the World Cup?Iran’s World Cup Presence Is One of Protest and Polarization","pubDate":"2022-11-21 20:36:16","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTkzOTExNjQwNDY5NTQ2NDgw/tim-weah.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Louis van Gaal says questions must be asked of FIFA over armband row","link":"https://kildare-nationalist.ie/2022/11/21/louis-van-gaal-says-questions-must-be-asked-of-fifa-over-armband-row/","keywords":["National Sport"],"creator":["Kildare Nationalist Reporter"],"video_url":null,"description":"By Jamie Gardner, PA Chief Sports Reporter, Doha Netherlands coach Louis van Gaal said questions must be asked over whether FIFA has behaved correctly in the row over anti-discrimination armbands at the World Cup in Qatar. The Dutch, who opened their Group A campaign with a 2-0 victory over African champions Senegal, were one of...","content":"By Jamie Gardner, PA Chief Sports Reporter, Doha Netherlands coach Louis van Gaal said questions must be asked over whether FIFA has behaved correctly in the row over anti-discrimination armbands at the World Cup in Qatar. The Dutch, who opened their Group A campaign with a 2-0 victory over African champions Senegal, were one of seven European nations who dropped plans to wear the rainbow-coloured... Source","pubDate":"2022-11-21 20:34:59","image_url":null,"source_id":"kildare-nationalist","country":["ireland"],"category":["sports"],"language":"english"},{"title":"’That technique’: Rob Holding & Joe Cole wowed by Arsenal player at World Cup today","link":"https://www.hitc.com/en-gb/2022/11/21/that-technique-rob-holding-joe-cole-wowed-by-arsenal-player-at-world-cup-today/?utm_source=rss&utm_medium=rss&utm_campaign=that-technique-rob-holding-joe-cole-wowed-by-arsenal-player-at-world-cup-today","keywords":["Arsenal","Competitions","England Football Team","FIFA World Cup","Football","Premier League","Teams","bukayo saka"],"creator":["Amir Mir"],"video_url":null,"description":"Joe Cole and Rob Holding reacted to Bukayo Saka’s performance during England’s 6-2 win over Iran at the 2022 FIFA World Cup in Qatar on... The post ’That technique’: Rob Holding & Joe Cole wowed by Arsenal player at World Cup today appeared first on HITC.","content":"Joe Cole and Rob Holding reacted to Bukayo Saka’s performance during England’s 6-2 win over Iran at the 2022 FIFA World Cup in Qatar on Monday. Arsenal defender Holding was watching from home and he posted on his Instagram story ‘yes sir’ to Saka netting a brace on football’s biggest stage. Former England midfielder Joe Cole knows a thing or two about scoring at a World Cup and he was left impressed by the technique of Saka’s first goal, as he told beIN SPORTS. Photo by Justin Setterfield/Getty Images Back in his playing days, Cole scored a sensational volley against Sweden from about 30 yards out which is probably one of England’s great goals at a World Cup. So, the Chelsea legend knows a thing or two about technique and he was impressed by Saka at the World Cup today. “It was a lovely delivery in (from Trippier) and it was the first contact which Harry Maguire wins so often,” said Cole. “But that technique. To open up your body and to have the awareness to let it come across you, then strike it. That’s a hell of a finish.” Photo by Stuart MacFarlane/Arsenal FC via Getty Images A DEBUT TO REMEMBER Arsenal fans would have understandably felt a little deflated when domestic football was postponed for the 2022 World Cup because they were on a roll. But a number of their star players could return from Qatar with even more confidence from when they first left north London. Saka could be one of those players because his World Cup debut couldn’t have gone any better. The post ’That technique’: Rob Holding & Joe Cole wowed by Arsenal player at World Cup today appeared first on HITC.","pubDate":"2022-11-21 20:30:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Francia va contra la maldición del campeón defensor y la macumba propia","link":"https://www.pagina12.com.ar/499859-francia-va-contra-la-maldicion-del-campeon-defensor-y-la-mac","keywords":null,"creator":["Cristian Dellocchio"],"video_url":null,"description":"El equipo de Deschamps, coronado en Rusia 2018, llega golpeadísimo por la seguidillas de lesiones que dejó afuera, por ejemplo, a Benzemá. Los antecedentes recientes de Italia en 2010, España en 2014 y Alemania en 2018 no lo ayudan. Además, Dinamarca-Túnez por el grupo que en octavos se cruzará con el de Argentina.","content":"Arrancó en Sudáfrica como una curiosidad, se repitió en Brasil 2014 y, cuatro años después en Rusia, la cosa ya tomó ribetes sobrenaturales. Las eliminaciones en primera ronda de los campeones defensores en los últimos tres Mundiales son prueba de que en la cita máxima puede pasar de todo. Y en Qatar los ojos estarán puestos en lo que pase con Francia , vigente dueña de la corona, que arrancará este martes su sueño de bicampeonato cuando se mida con Australia, desde las 16 (televisación de la TV Pública y DSports). Los galos tendrán que lidiar con brujerías ajenas, pero sobre todo propias. La inédita seguidillas de lesiones que afectó al equipo de Didier Deschamps no puede más que relacionarse con el escándalo desatado más temprano este año por el hermano de Paul Pogba, Mathias, quien aseguró que el volante contrató un hechicero para hacer lesionar a Kylian Mbappé en la previa de un duelo de Champions 2019 entre Manchester United (donde jugaba Pogba) y el PSG. Luego se sucedieron la denuncia policial de Paul contra su hermano por extorsión, la detención de Mathias, y la versión de que al futbolista le pedían más de 10 millones de euros para no revelar más secretos sobre sus manejos. Lo cierto es que Pogba no estará en Qatar y por lesión. Tampoco lo hará su compañero de mediocampo, clave para la coronación en Rusia, N'Golo Kanté . Y en los últimos días se sumaron las bajas del defensor Kimpembe, el goleador Nkunku y nada menos que la de Karim Benzemá . Creer o reventar. Lo cierto, más allá de toda creencia, es que este martes Francia debutará con Australia, idéntica primera cita a la de Rusia 2018, cuando el equipo de Deschamps se impuso 2 a 1 recién con un gol en contra en los minutos finales. Los galos también comparten zona otra vez con Dinamarca , con quien empataron sin goles en la primera fase hace cuatro años. El cuarto integrante del grupo es Túnez, que se medirá con los nórdicos este martes desde las 10 (televisación de TyC Sports y DSports) . El Grupo D tiene especial importancia para la Argentina , ya que de aquí saldrán los rivales de octavos de final del Grupo C que tiene a los de Scaloni. Por eso habrá mucho interés en el cruce del próximo sábado entre franceses y daneses , candidatos ambos a quedarse con la zona. Los antecedentes recientes preocupan sobre manera a los galos, ya que este año se vieron las caras por la Liga de Naciones de la UEFA y en las dos ocasiones festejó Dinamarca: 2 a 1 en París a principios de junio y 2 a 0 en Copenhague a fines de septiembre . Así, un descuido francés ante Australia les puede complicar las cosas seriamente a los de Deschamps y entonces empezará a sonar fuerte la \"maldición\" de los campeones defensores. Las eliminaciones en primera ronda son la norma para los que van a revalidar el título en los Mundiales, con seis salidas inmediatas a lo largo de la historia , tres de manera consecutiva e incluso cuatro en las últimas cinco ediciones si se suma el fiasco de Francia, justamente, en Corea Japón 2002. Vaya un repaso de los que llegaron con la medalla colgada en el pecho y se fueron rápidamente del Mundial: Post Segunda Guerra Mundial y ya lejos del primer plantel bicampeón del '34 y '38, Italia perdió 3 a 2 con Suecia y venció 2 a 0 a Paraguay, pero como sólo pasaba el primero a una fase final de grupos, se volvió rápido a su casa. Pelé se había dado a conocer al mundo en el '58 con apenas 18 años y luego miró desde el banco -por lesión- la consagración del '62 de la mano de Garrincha. Con 26 pirulos, llegaba pipí cucú a la cita en Inglaterra, pero fue el Mundial del famoso \"lo sacaron a patadas\". Brasil venció 2 a 0 a Bulgaria en el debut, con goles de Pelé y Garrincha, pero al 10 lo castigaron tanto que el DT lo guardó para la segunda fecha y fue derrota 3 a 1 con Hungría. Todo se definía en la jornada final, ante Portugal y Eusebio: la Pantera de Mozambique metió dos, los lusos ganaron 3 a 1 y Pelé terminó jugando en una pata. En 1970, tendría revancha. Estaba todo dado para una fiesta gala en Asia, de la mano de Zidane (29 años) y con Trezeguet y Henry ya maduros, dado que venían de alternar desde el banco en el '98 cuando tenían apenas 20 pirulos. Pero lo del equipo de Lemerre fue un papelón, ultimo en su grupo y sin goles a favor: 0-1 con Senegal, 0-0 con Uruguay y 0-2 con Dinamarca. Tras la consagración por penales de 2006, comenzó una mala para Italia que dura hasta hoy. En el primer Mundial africano arrancó empatando 1 a 1 con el Paraguay del Tata Martino, repitió score ante Nueva Zelanda y recibió el golpe de gracia de Eslovaquia con derrota 3-2 en la última fecha. Luego vino otra salida exprés en 2014 y las inéditas ausencias en Rusia y Qatar. La revolución del tiki tiki fue derrocada en Sudamérica casi que al instante, con un debut tenebroso de Iniesta, Casillas, Sergio Ramos y compañía: 1-5 ante Países Bajos. Luego llegó el 0-2 ante el Chile de Jorge Sampaoli y un 3-0 final sobre Australia a modo de honor. Siempre hay una primera vez y para los germanos fue en Kazán. En ninguno de sus 18 Mundiales previos Alemania se había ido en primera ronda, pero en Rusia se topó con algunas actuaciones heroicas que la sacaron del camino: 0-1 con México, 2-1 a Suecia y 0-2 final con Corea del Sur con dos goles inolvidables en tiempo de descuento. Por último y para los amantes de las coincidencias históricas, vaya otra tendencia que afecta a Francia en los Mundiales: cada vez que jugó una final, a la edición siguiente se fue en primera ronda. Al mencionado episodio de 1998/2002 se suma la de 2006/2010, ya que tras ser subcampeona en Alemania se despidió en primera fase de Sudáfrica luego de compartir zona con Uruguay (0-0), México (0-2) y la selección local (1-2).","pubDate":"2022-11-21 20:29:56","image_url":"https://images.pagina12.com.ar/styles/width960/public/2022-11/671077-whatsapp-20image-202022-11-21-20at-2016-03-21.jpeg?itok=CHvqHuFv","source_id":"pagina12","country":["argentina"],"category":["sports"],"language":"spanish"},{"title":"World Cup teams drop rainbow armbands after FIFA threats - CBC Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiVWh0dHBzOi8vd3d3LmNiYy5jYS9zcG9ydHMvc29jY2VyL3dvcmxkY3VwL3dvcmxkLWN1cC1vbmUtbG92ZS1hcm0tYmFuZHMtZmlmYS0xLjY2NTg2MTPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"World Cup teams drop rainbow armbands after FIFA threats  CBC SportsView Full Coverage on Google News","content":null,"pubDate":"2022-11-21 20:25:26","image_url":null,"source_id":"google","country":["canada"],"category":["sports"],"language":"english"},{"title":"World Cup 2022: Argentina vs. Saudi Arabia head-to-head record","link":"https://www.sportsmole.co.uk/football/argentina/world-cup-2022/feature/world-cup-2022-argentina-vs-saudi-arabia-head-to-head-record_500256.html","keywords":["Football","World Cup 2022","World Cup","Argentina","Saudi Arabia","Lionel Scaloni","Lionel Messi","Angel Di Maria","Sergio Aguero","Claudio Caniggia","Diego Simeone","Leonardo Rodriguez","Frank Rijkaard","Argentina vs Saudi Arabia","500256"],"creator":null,"video_url":null,"description":"Ahead of Tuesday's World Cup clash between Argentina and Saudi Arabia, Sports Mole looks at the head-to-head record between the two sides.","content":null,"pubDate":"2022-11-21 20:18:44","image_url":"https://sm.imgix.net/22/47/argsau.jpg","source_id":"sportsmole","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Preview: Denmark vs. Tunisia - prediction, team news, lineups","link":"https://www.sportsmole.co.uk/football/denmark/preview/preview-denmark-vs-tunisia-prediction-team-news-lineups_500247.html","keywords":["Football","Denmark","Tunisia","Kasper Hjulmand","Eric Chelle","Daniel Wass","Joachim Andersen","Andreas Christensen","Joakim Maehle","Christian Eriksen","Thomas Delaney","Pierre-Emile Hojbjerg","Kasparov Dolberg","Mikkel Damsgaard","Andreas Skov Olsen","Montassar Talbi","Youssef Msakni","Hannibal Mejbri","Wahbi Khazri","Anis Ben Slimane","Mohamed Drager","Montassar Talbi","Dylan Bronn Ali Abdi","Aymen Dahmen","Denmark vs Tunisia","500247"],"creator":null,"video_url":null,"description":"Sports Mole previews Tuesday's World Cup clash between Denmark and Tunisia, including predictions, team news and possible lineups.","content":null,"pubDate":"2022-11-21 20:17:40","image_url":"https://sm.imgix.net/22/46/dencro.jpg","source_id":"sportsmole","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Preview: Port Vale vs. Barnsley - prediction, team news, lineups","link":"https://www.sportsmole.co.uk/football/port-vale/efl-trophy/preview/preview-port-vale-vs-barnsley-prediction-team-news-lineups_500251.html","keywords":["Football","EFL Trophy","Port Vale","League One","Barnsley","Malvind Benning","Ademipo Odubeko","Darrell Clarke","Daniel Butterworth","Josh Martin","Fabio Jalo","James Wilson","Sam Robinson","James Norwood","Jack Aitchison","Slobodan Tedic","Will Lancaster","Jasper Moon","Aidan Stone","Jack Stevens","Michael Duff","David Worrall","Port Vale vs Barnsley","500251"],"creator":null,"video_url":null,"description":"Sports Mole previews Wednesday's EFL Trophy clash between Port Vale and Barnsley, including predictions, team news and possible lineups.","content":null,"pubDate":"2022-11-21 20:08:09","image_url":"https://sm.imgix.net/22/01/darrell-clarke_1.jpg","source_id":"sportsmole","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"NFL Scouting Notes: Caleb Williams, Blake Corum","link":"https://www.si.com/nfl/2022/11/21/nfl-draft-scouting-notes-caleb-williams","keywords":["NFL","HP Feature","News And Analysis"],"creator":["Albert Breer"],"video_url":null,"description":"Plus more notes on Week 12 of the college football season, including thoughts on Michigan RB Blake Corum and Georgia lineman Jalen Carter.","content":"Plus more notes on Week 12 of the college football season, including thoughts on Michigan RB Blake Corum and Georgia lineman Jalen Carter.MORE MMQB: How the Bills Dug Out of the Snow and Got Their Season Back on Track | Three Deep: How the Commanders Saved Their Season by Not Panicking | Takeaways: How the Raiders Finally Closed a Game; the Lions Are Winning The last few years, my Six From Saturday notes have been included at the bottom of my MMQB column on Monday mornings. This year, they’ll be published as a separate post each week. Here are my thoughts on this weekend’s college action, geared mostly toward what should be of interest to NFL fans.1) On Saturday night, I tweeted a true wow throw from USC QB Caleb Williams—one in which he rolled to his left and somehow let loose on a rope of a throw that probably traveled 30 yards in the air and cut through a slew of UCLA defenders to get to receiver Kyle Ford. Now, as we’ve been through here before, there are plenty of guys who’ve had these sorts of flashes early in their college careers, only to flame out before becoming draft-eligible. And the truth is very few NFL types have actually studied Williams, since he’s not draft-eligible until 2024. (I asked one AFC exec who’s watched him play, but hadn’t studied him, and he’d say only, “He can really sling it.”) Gary A. Vasquez/USA TODAY Sports There is reason to be optimistic that what we’re seeing from Williams is real, and the reason is we have proof. For a lot of these young quarterbacks, a lot of exposure can lead to, well, getting exposed. Conversely, Williams already has 496 pass attempts in two conferences under his belt. By comparison, Justin Fields had 618 at Georgia and Ohio State; and Cam Newton had just 292 in the SEC—between Florida and Auburn—and 628 total if you include junior college. So 22 games and 18 starts into Williams’s career—including more than 350 yards passing in four of his past five games, with a 33–3 TD-INT ratio for the season—is a really good sign that he should sustain this level of play next year and be well positioned for the 2024 draft.2) It was tough seeing Michigan workhorse Blake Corum go down Saturday—he had an Illinois defender crash into his knee and went down right away, dropping the ball on his way to the ground. Corum came out dressed for the second half, but after one third-quarter carry, it was clear he couldn’t go, and that was it for his afternoon. Corum’s been the engine for Michigan’s offense, with six games of 25-plus carries, and he was on his way to a seventh before getting hurt Saturday. Regardless of whether he can play against Ohio State on Saturday, or in any games after that, it seems like it’d be an easy call for him to go pro after an outstanding junior year. In a crowded 2023 running back class, his toughness and productivity will stand out—and put him in position to go inside the top 100-or-so picks if he runs well.“I’d call him a mid-round pick because of his size [5'10\", 210 pounds], and he might not run well, but he’s a good player,” one NFC exec says. “I like the vision, instincts, balance and body control. He runs hard. Good in the passing game, too, both catching and blocking.” In other words, the combine will be vital for one of the best players of this college football season.3) Speaking of injuries, it was really tough seeing quarterback Hendon Hooker go down on Saturday night with a torn ACL during Tennessee’s loss at South Carolina. My sense is the sixth-year senior, who’ll be 24 on draft day, was trending toward being a Day 2 pick (I heard Geno Smith and Case Keenum comps). His injury, of course, could affect that—because you could be talking about him losing a year of his rookie contract, which is big if you project him to be a quality backup and not a starter. One of the benefits of taking him high would be getting affordable quarterback depth.4) We said a lot of nice things about North Carolina quarterback Drake Maye last week, and I’d stand by a lot of them—he’s still someone to keep an eye on for 2024. But what happened Saturday for Maye against Georgia Tech (he threw for 202 yards, a pick and no touchdowns as the Heels blew a 17–0 lead to a team with an interim coach) is a good way to drive home the point we made on Williams. Maye will be fine, but over time, you get tested in different ways, and Maye, shy of 400 college attempts and in his 11th start, found that out in an ugly home loss that almost certainly eliminated the Heels from the College Football Playoff picture.5) Georgia DL Jalen Carter isn’t the flashiest prospect—but he’s been dominant week to week for another stout Bulldogs defense, was again against Kentucky and deserves a lot of credit for holding serve near the top of the 2023 draft through another season. Last year, I had a number of execs tell me they thought Carter was probably the best prospect on last year’s defense, which produced five first-round picks, including the first pick. But when we reported on the NFS rankings having Carter at No. 1 over Alabama’s Will Anderson Jr., a lot of people were surprised (or even seemed offended). Now? I think it might be a toss-up between those two.6) This will be a nervous week for me. But it’ll be worth every second of it so long as C.J. Stroud, Marvin Harrison Jr., JT Tuimoloau, Ryan Day and the rest of the Buckeyes settle the score. Go Bucks.More NFL Coverage:• This Patriots Defense Is a Belichick Masterpiece• The Night Flipper Anderson Set the Single-Game Receiving Record• Inside the Upside-Down World of Long Snappers• How the Commanders Saved Their Season by Not Panicking","pubDate":"2022-11-21 19:53:45","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTkzOTExMjE3NDE1MjY3Nzc5/caleb-williams-usc-quarterback-prospect.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Giants-Cowboys Thanksgiving Week 12 Odds, Lines and Spread","link":"https://www.si.com/betting/2022/11/21/odds-lines-spread-giants-cowboys-thanksgiving-week-12","keywords":["NFL Betting","Fantasy/Betting","Betting","NFL"],"creator":["Jennifer Piacenti"],"video_url":null,"description":"The Cowboys are favored by more than a touchdown against the Giants at home on Thanksgiving.","content":"The Cowboys are favored by more than a touchdown against the Giants at home on Thanksgiving.Two NFC East rivals face off for the Thanksgiving afternoon game in Dallas as the Cowboys (7-3) host the Giants (7-3) at AT&T Stadium. Both teams have identical records but the Cowboys are heavy home favorites. The Giants are coming off an upset loss at home versus the Lions, who are now 4-6, while the Cowboys are coming off a monster win versus the Vikings, handing them only their second loss of the season in a 40-3 trouncing.The Cowboys defeated the Giants, 23-16, in Week 3 at MetLife Stadium. The Cowboys did not have Dak Prescott in that game, but they ran ball very successfully with Cooper Rush under center.Here is where the market currently stands for Thursday’s clash.New York Giants vs. Dallas Cowboys OddsMoneyline: Giants (+310) | Cowboys (-400)Spread: Giants +7.5 (+105) | Cowboys +7.5 (-125)Total: 44.5 - Over (-118) | Under (+100)Date: Nov. 24, 2022 | 4:30 p.m. ET | FoxGiants Straight-Up Record: 7-3Giants Against the Spread Record: 7-3Cowboys Straight-Up Record: 7-3Cowboys Against the Spread Record: 7-3Bet on Giants-Cowboys at SI Sportsbook Robert Deutsch-USA TODAY Sports The Giants have exceeded all expectations this year and will need to win this one to get their momentum back on track. They will be without rookie wideout Wan’Dale Robinson, who suffered a torn ACL on Sunday, and they are operating with a decimated wide receiver crew. However, running back Saquon Barkley has been excellent this season - minus Sunday’s outlier versus the Lions - and Daniel Jones has been an efficient game manager and very good runner.The Giants averaged 20.5 points per game this year (21st), while allowing 20.4 (13th), mostly due to a soft run defense that is allowing 136 rushing yards per game. Unfortunately for the Giants, the Cowboys have a one-two punch in Ezekiel Elliott and Tony Pollard, who combined for five touchdowns versus the Vikings. The Cowboys boast the league’s best defense that is allowing only 16.7 (first) points per game this year. The offense has exploded again with Prescott looking fully healthy, and after starting slowly the team’s 25.1 points per game ranks seventh in the NFL. Though the Dallas defense is the stingiest in the league, the Cowboys can be beaten on the ground as they are also allowing 136 rushing yards per game. Barkley and Jones (who rushed for 79 yards in Week 3) will likely lead the charge Thursday.The Cowboys have won four of the five games in which they were favored this year, while the Giants have won five of the six games in which they were the underdogs.Dallas and New York are 7-3 against the spread (ATS) and the under has cashed in 70% of both teams’ games.Both teams are likely auditioning to sign Odell Beckham Jr. on Thursday. I’m going to go ahead and buy the hook for the home team with Thanksgiving Day energy. The Cowboys are trending in the better direction on both sides of the ball and the home crowd energy should lift them to a decisive victory that would guarantee an advantage should the Cowboys and Giants end up with identical records.(Note: should Micah Parsons be ruled out for this game, only play this up to 7)BET: Cowboys -7.5 (-125) Enter SI Sportsbook’s Free Perfect 10 Contest for a Shot at $10,000! Get fantasy and betting analysis in your inbox by signing up for the Winners Club newsletterCheck the Latest Odds from SI SportsbookMore Betting, Fantasy and NFL:• Patriots-Vikings Best Bet• Bills-Lions Best Bet• World Cup Odds• World Cup Golden Boot Odds• Early Week 12 Waiver Wire• MMQB Week 11 Awards","pubDate":"2022-11-21 19:49:56","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Ch_1200%2Cq_auto:good%2Cw_1200/MTkzOTExMDIwMTE1MjA3NjE5/daniel-jones.png","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Al-Tomooh Sports Club sets up special hall to cover World Cup","link":"https://www.arabtimesonline.com/news/al-tomooh-sports-club-sets-up-special-hall-to-cover-world-cup/","keywords":["Sports","qatar world cup"],"creator":["Arab Times"],"video_url":null,"description":"KUWAIT CITY, Nov 21: The Kuwaiti Tomooh Sports Club for Mental Disabilities has specialized a hall at its headquarters to cover events of the world cup tournament that started earlier today in Qatar. Acting Chargé d’Affairs of the Embassy of the United States of America James Holtsnider participating in the opening event. Meanwhile, visitors may … The post Al-Tomooh Sports Club sets up special hall to cover World Cup appeared first on ARAB TIMES - KUWAIT NEWS.","content":"This post has been read 489 times! KUWAIT CITY, Nov 21: The Kuwaiti Tomooh Sports Club for Mental Disabilities has specialized a hall at its headquarters to cover events of the world cup tournament that started earlier today in Qatar. Meanwhile, visitors may watch FIFA 2022 World Cup matches live at Kuwait’s newest outdoor entertainment venue, Container Park, Kuwait’s tourism authority said on Monday. Container Park will include restauraunts and cafes alongside a huge projecter screen where the global football matches will be hosted, Touristic Enterprises Company chairman Mohammad Al-Saqqaf told reporters at the site, located on the Blajat seafront. The venue, open daily from 10:00 a.m. to midnight from Sunday, will also host various games for adults and children. It is a youth initiative and one of the country’s environmentally-sustainable projects that will be recycled, explained the official. Tickets will be sold for cheap prices, while children aged under five and domestic workers will be allowed to enter for free. TEC plans to set up a calendar which will include monthly entertainment activities dedicated to the public, he added, mentioning an upcoming event hosted by another seafront venue, Green Island.(KUNA) This post has been read 490 times! KUWAIT CITY, Nov 13: The Touristic Enterprises Company … You must be to post a comment.","pubDate":"2022-11-21 19:46:26","image_url":null,"source_id":"arabtimesonline","country":["Kuwait"],"category":["sports"],"language":"arabic"}]}