{"newsArray":[{"title":"Liverpool v Arsenal: Best bets for Sunday and Monday’s Premier League and Championship games","link":"https://www.mirror.co.uk/sport/football/news/liverpool-arsenal-tips-odds-betting-29664077","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alex Hankin)"],"video_url":null,"description":"Our betting expert with tips for Anfield showdown, Leeds against Crystal Palace and a Bank Holiday acca PLUS La Liga angle","content":"Bet that there’s no place like home for Liverpool. The Arsenal WIN at Anfield today (4.30pm) is a strong 1X2 favourite – as short as 5/4. Even Prem defeats at Old Trafford, the Etihad and Goodison won’t deter the faithful from having that. Nor will the fact the Gunners haven’t won at Liverpool (90mins) since a 2-0 way back in 2012. There was a first ever Arsenal goal for Lukas Podolski that day if memory serves, by which I mean I looked it up on the internet. Sadly, Michael Thomas’s historic Kop-silencer of 1989 was pre-internet AND pre-Prem, so might not have happened at all. No need for googling that in their last home game Liverpool put seven past Manchester United . Even in this poor season they are W12 D5 L2 at Anfield. They’ve failed to score in just two of those games, and one was a second-string shuffle-up in the EFL Cup. Mo Salah has found the net in seven of his past 10 homes – if he starts, the 19/10 (Hills) ‘anytime scorer’ is plump. For an Arsenal angle I like Gabriel Martinelli ‘anytime’ at 13/5 (Bet365) – he’s blooming again. Crystal Palace ’s trip to Leeds (2pm) looks trappy, but with bobby-dazzler Rodrigo back, and a fixture list screaming ‘must-win’ in boss Javi Gracia’s ear, trust the hosts to at least rack up a lot of chances. Punt ‘OVER 4.5 Leeds shots on target’ at a bob-on 11/10 (Bet365). And big Pascal Struijk – who struck in the reverse fixture – looks a live longshot at 14/1 (Unibet) ‘anytime scorer’. Egg yourself on for an Easter Bank Holiday Monday special in the Championship tomorrow. This tier’s still chock full of meaningful games – by my count, 11 sides are still hungrily looking up, and seven feeling a bit queasy, looking down. Punt the WIN for 16-goal Carlton Morris and Luton, Preston, Norwich and Wigan plus the DRAW at Hull (all 3pm). The five-timer pays a cracking 43/1 (Bet365). Bookings magnet Ruben Sobrino is too big at 15/4 (Bet365) ‘to be shown a card’ when his scrappy Cadiz head to Real Betis (3.15pm) Last week: Winners at 6/5, 13/10 & 23/10","pubDate":"2023-04-09 00:01:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29664062.ece/ALTERNATES/s615/0_Chelsea-FC-v-Liverpool-FC-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Erik ten Hag hints he will stop using Man Utd tactic that Paul Scholes hated","link":"https://www.mirror.co.uk/sport/football/news/manutd-ten-hag-scholes-fernandes-29664868","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Dan Marsh)"],"video_url":null,"description":"Manchester United manager Erik ten Hag was full of praise for vice-captain Bruno Fernandes after he pulled the strings from a deeper central role in Saturday's win over Everton","content":"Erik ten Hag has dropped the biggest hint yet that he has no plans to utilise Bruno Fernandes in a wide position moving forward after the Manchester United star dazzled in a deep-lying midfield role against Everton . Fernandes, 28, has established himself as one of the club's most influential players since joining from Sporting Lisbon back in 2020 and has been a regular since Ten Hag succeeded Ralf Rangnick last summer. The Portuguese playmaker has played most of his football for United as a No.10, however, he has been deployed in a number of different roles by Ten Hag this term - including a brief spell on the wing . Erik ten Hag makes his feelings on Antony clear after Man Utd star left fans fuming Man Utd legend Bryan Robson involved in car crash en route to Everton match Fernandes played out wide with Wout Weghorst deployed as a No.10 in Manchester United's chastening 7-0 defeat against Liverpool last month and was heavily criticised for his petulant behaviour during the match. He rebounded in style with a brilliant performance in his usual role in United's 4-1 win over Real Betis in the Europa League just a few days later - and that prompted Old Trafford icon Paul Scholes to urge Ten Hag to never play his vice-captain out wide \"ever again\" . \"Some of the players who came in for criticism, Bruno especially, I thought he was brilliant in the centre of the pitch where we know that's his best position,\" Scholes told BT Sport after the win over Betis. \"I hope we never see him in a wide area ever again on the football pitch because it's just not his strength, he was so good in the centre of that pitch dictating play.\" Join the debate! Where do you think Ten Hag should play Bruno Fernandes going forward? Let us know here. Bruno Fernandes was hailed as the \"best player\" on the park by Erik ten Hag following Manchester United's 2-0 win over Everton ( Image: Stu Forster/Getty) Not for the first time, Fernandes pulled the strings from a deeper role in United's 2-0 win over Everton , which came hot on the heels of a midweek victory against Brentford. And Ten Hag's comments lauding Fernandes' performance indicate that a return to the wing is unlikely to occur anytime soon. \"I think [Fernandes] was brilliant but he was already playing brilliant over many games in a deeper role. Not everyone was recognising but also even last week at Newcastle he was playing very well,\" Ten Hag told Match of the Day following Saturday afternoon's match. \"Against Brentford played really well, today again, but I said he was definitely one of the best players, maybe the best player on the pitch, but we had more at a high level.\" After a difficult campaign last year, Fernandes has rediscovered some of his best form under Ten Hag and has managed to chalk up 10 goals and 12 assists in all competitions for Manchester United this term.","pubDate":"2023-04-09 00:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article28309734.ece/ALTERNATES/s615/0_MAIN-Blended-main-of-Ten-Hag-and-Scholes.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Nsoatreman FC shock Real Tamale United to book MTN FA Cup semifinal spot","link":"https://www.ghanafa.org/nsoatreman-fc-shock-real-tamale-united-to-book-mtn-fa-cup-semifinal-spot","keywords":null,"creator":null,"video_url":null,"description":"Premier League new boys Nsoatreman FC scored in the first half to eliminate three-time finalist Real Tamale United from the MTN FA Cup. The Nsoatre lads secured the win following a 1-0 win at the Aliu...","content":"Premier League new boys Nsoatreman FC scored in the first half to eliminate three-time finalist Real Tamale United from the MTN FA Cup. The Nsoatre lads secured passage to the semifinal following a 1-0 win at the Aliu Mahama Sports Stadium on Saturday. Nsoatreman FC went into the game looking to bounce back from a disastrous run of results in recent games having won only once in their last five appearances in the betPawa Premier League. After a fairly balanced game in the opening minutes, Philip Ofori gave Nsoatreman FC a surprising lead against the run of play through a 45 th minute corner kick. Real Tamale United switched back on immediately after halftime looking for the leveler but the visitors had Goalkeeper Daniel Afadzwu to thank for making three top quality saves to keep them in the game. Real Tamale United let down their fans after missing numerous golden chances that came their way as Nsoatreman held on to win 1-0 on the raod. Nsoatreman will now face the winner of the game between King Faisal and Aduana FC in the semifinal of the MTN FA Cup. The newly promoted Premier League side have now qualified to their first ever semifinal appearance in the history of the MTN FA Cup. GFA COMMUNICATIONS Get all the latest football news sent directly to your inbox","pubDate":"2023-04-08 23:57:09","image_url":null,"source_id":"ghanafa","category":["sports"],"country":["ghana"],"language":"english"},{"title":"Pakistan lost to Hong Kong in second match of AFC Women’s Olympic Qualifiers","link":"https://www.nation.com.pk/09-Apr-2023/pakistan-lost-to-hong-kong-in-second-match-of-afc-women-s-olympic-qualifiers","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan women’s football team was defeated at the hands of Hong Kong in their second clash of AFC Women’s Olympic Qualifiers at Hisor Central Stadium in Tajikistan.","content":"LAHORE - Pakistan women’s football team was defeated at the hands of Hong Kong in their second clash of AFC Women’s Olympic Qualifiers at Hisor Central Stadium in Tajikistan. According to information made available here on Saturday, Vice-Captain Malika Noor wore the captain’s armband in the absence of the injured Maria Khan and along with the side played impressively in the first half, the opponent missed an unchallenging penalty in the 33rd minute which skied over the keeper whereas goalkeeper Nisha Ashraf has been phenomenal as she saved an exceptional attempt of goal by Hong Kong in the 35th minute. The first half of the encounter remained goalless. In the second half of the game, Hong Kong showed its dominance in the dying moments of the match. In the 73rd minute, goalkeeper Nisha turned the long hit of Hong Kong’s captain Chan Wing Sze into an unfortunate own goal. The defensive side put up again a relatively better show but defender Sara Khan tried getting the ball away from the bar, causing a goal in favour of Hong Kong in the 90th minute. With a second consecutive loss, Pakistan’s journey in AFC Women’s Olympic Qualifier 2024 Paris has ended. Pakistan team faces the host Tajikistan on the 11th of April.","pubDate":"2023-04-08 23:45:25","image_url":"https://www.nation.com.pk/print_images/large/2023-04-09/pakistan-lost-to-hong-kong-in-second-match-of-afc-women-s-olympic-qualifiers-1680997515-5514.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ghana cruise to win over Senegal in International friendly","link":"https://www.ghanafa.org/ghana-score-cruise-to-win-over-senegal-in-international-friendly","keywords":null,"creator":null,"video_url":null,"description":"&amp;nbsp; The Black Queens of Ghana scored three first half goals to defeat the Teranga Lionesses of Senegal 3:0 in an international friendly at the Accra Sports Stadium on Saturday. &amp;nbsp;...","content":"The Black Queens of Ghana scored three first half goals to defeat the Teranga Lionesses of Senegal 3:0 in an international friendly at the Accra Sports Stadium on Saturday. Gifty Assifuah pounced on a rebound from an Evelyn Badu freekick to slot home the opener in the 2 nd minute to give the Queens an early lead. Six minutes later, Grace Asantewaa weaved her way through the edge of the penalty box leaving the defense of the opponents nonexistent and scoring a sublime solo goal to double the lead for the Queens. Cynthia Fiindib came to the rescue of the Queens after Portia Boakye lost possession in a dangerous area but Ghana goalkeeper Cynthia Konlan was on hand to deny the Senegalese in the 30 th minute. Gifty Assifuah grabbed her brace seconds before the half time whistle as Ghana went into the break with a on three goal advantage. Suzzy Dede Teye, Princess Owusu, Fidous Yakubu and Linda were introduced in the second half but that did not change the tempo of the game as the Queens pressed for more goals but were denied on several occasions. Senegal showed they were still in the contest when they had a good chance to get a consolation but Cynthia Fiindib was once again called to duty but pulled a great save to keep a clean sheet as the game ended 3:0 in favor of the Black Queens. Ghana will host Senegal in a second encounter at the Accra Sports Stadium on Tuesday, April 11, 2023 as both sides cont8nue to prepare for future assignments. Here are some photos from the match: GFA COMMUNICATIONS Get all the latest football news sent directly to your inbox","pubDate":"2023-04-08 23:14:45","image_url":null,"source_id":"ghanafa","category":["sports"],"country":["ghana"],"language":"english"},{"title":"Erik ten Hag makes his feelings on Antony clear after Man Utd star left fans fuming","link":"https://www.mirror.co.uk/sport/football/news/man-utd-ten-hag-antony-29664794","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Dan Marsh)"],"video_url":null,"description":"Manchester United winger Antony has been criticised by fans and pundits alike this season, but Erik ten Hag has defended the 23-year-old's record in front of goal","content":"Erik ten Hag believes that Antony has performed adequately since his blockbuster summer switch to Manchester United in the wake of recent criticism which has been directed at the winger. After months of speculation, the Brazil international arrived at Old Trafford in a deal which could eventually eclipse £85.5million from Ajax , where he flourished under the guidance of Ten Hag. The 23-year-old chalked up 12 goals and 10 assists in all competitions for the Dutch giants but has struggled to replicate the same explosive performances that first piqued United's attention since swapping Amsterdam for the Premier League . The former Sao Paolo youngster has even come in for some fierce criticism from several pundits, too, including Old Trafford icon Paul Scholes . Man Utd legend Bryan Robson involved in car crash en route to Everton match Paul Scholes bats back Erik ten Hag moan and serves reality check to Man Utd boss Antony's manager, however, is satisfied with the contributions he has made during his maiden season in English football - even if he does believe that the winger is capable of more in front of goal. Speaking after Manchester United's 2-0 win over Everton on Saturday, Ten Hag was asked whether he felt players within the squad were capable of stepping up to ease the goalscoring burden on top-scorer Marcus Rashford or whether he needed fresh blood. The Dutchman replied: \"Maybe both. I think they can. Antony already scored a couple of goals - seven or eight goals - scoring in big games, it’s not bad for a winger, right? In his first season. Also against big opponents like Barcelona , [Real] Betis. \" [Jadon] Sancho , he has a period out, [Anthony] Martial can definitely do it, Bruno [Fernandes] also we know it. He’s now playing in a little bit deeper role so he’s further away from the goal but we have goal scoring players in our squad. We have to work on our scoring abilities but also we have to think about the transfer market, yes.\" Join the debate! How do you think Antony has performed for Man Utd this season? Let us know here. Antony has been criticised by fans and pundits alike this term, but Erik ten Hag has defended the Manchester United winger ( Image: Michael Regan/Getty Images) As Ten Hag alluded to, Antony has netted several big goals for Manchester United this term and his tally of seven goals in all competitions (in addition to three assists) is a decent enough return, but his actual performances have left some people underwhelmed. He felt the full wrath of the United faithful last weekend when he was criticised for slowing down an attack when Ten Hag's team were chasing a goal at St James' Park in a match they eventually lost 2-0. The baffling moment capped an ineffective display and Antony was taken off by Ten Hag on the hour mark not long after his ill-judged decision to put the handbrake on. Antony was taken off after an hour again in Sunday's 2-0 win over Everton but was far more effective, with Scholes - who has been particularly vocal on the winger's performances in the past - insisting that it was the \"best game\" he had seen Antony have since joining the club.","pubDate":"2023-04-08 23:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29397263.ece/ALTERNATES/s615/21_MAIN-Liverpool-FC-v-Manchester-United-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Футболисты «Барселоны» из-за поражения «Реала» радовались в командном чате","link":"https://www.sports.ru/football/1115044824-zhest-futbolisty-barselony-v-komandnom-chate-radovalis-iz-za-porazheni.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Мадридский клуб уступил «Вильярреалу» (2:3) в домашнем матче 28-го тура Ла Лиги.","content":"Футболисты «Барселоны» обрадовались из-за поражения «Реала» Мадридский клуб уступил « Вильярреалу » (2:3) в домашнем матче 28-го тура Ла Лиги . Каталонцы занимают первое место в турнирной таблице чемпионата Испании, опережая на 12 очков мадридцев, при этом «Барселоне» еще предстоит провести матч в этом туре против «Жироны». Как пишет As, после завершения матча в Мадриде в командном чате «Барселоны» футболисты обменивались восторженными сообщениями и смайликами, не скрывая радость об итогах игры «Реала». «Жесть!» – сказано в одном из сообщений, которое было опубликовано в чате каталонского клуба.","pubDate":"2023-04-08 22:30:00","image_url":null,"source_id":"sports","category":["sports"],"country":["russia"],"language":"russian"},{"title":"\"Ma maman, elle a 83 ans. Elle sort d'un cancer. Point à la ligne\". Christophe Galtier réagit à la banderole insultante déployée lors de Nice - PSG","link":"https://www.nicematin.com/football/ma-maman-a-83-ans-et-sort-dun-cancer-point-a-la-ligne-christophe-galtier-reagit-a-la-banderole-insultante-deployee-lors-de-nice-psg-840044","keywords":null,"creator":null,"video_url":null,"description":"L'entraîneur du PSG Christophe Galtier, qui revenait à Nice pour la première fois depuis son départ du banc du Gym cet été, n'a pas été épargné par les supporters de son ancienne équipe ce samedi soir.","content":"Christophe Galtier a d'abord été sifflé à l’annonce des équipes. Au cœur de la première période, la Populaire Sud l’a ensuite copieusement insulté et une banderole (rapidement retirée et pas montrée dans son intégralité par le diffuseur) a été déployée avec écrit: “Avant/Après, la mamma di Galtier”. L’ancien coach du Gym n’a pas vraiment apprécié et s’en est plaint au délégué de la rencontre. Il a également levé le pouce de manière ironique en direction de la tribune des Ultras de la Populaire avant de venir les applaudir tout aussi ironiquement au coup de sifflet final. \"Vous avez vu? Vous avez entendu? Ma maman, elle a 83 ans, elle sort d'un cancer. Point à la ligne. Et si ces gens-là jouent une Coupe d'Europe, c'est grâce à mon travail de l'an dernier\", a réagi Christophe Galtier en conférence de presse . Et d'ajouter sur le match cette fois: \"Il était important de l'emporter après nos deux dernières contre-performances. J'avais demandé à mes joueurs d'être plus compacts, solidaires et accrocheurs dans la conquête du ballon. J'ai vu beaucoup de compensation et un grand gardien ce soir. On a marqué dans les moments importants. Avec tout le brouhaha autour de Paris et de moi, il était important de l'emporter.\"","pubDate":"2023-04-08 22:09:00","image_url":"https://fyooyzbm.filerobot.com/v7/FOOTBALL+NICE+PSG+PAR+%2829588905%29-oXtNCRhq.jpg?vh=b54625&ci_seal=bfca02492b&p=medium&v2&gravity=auto","source_id":"nicematin","category":["sports"],"country":["france"],"language":"french"},{"title":"Warriors break silence . . . lift the lid on 2019 AFCON debacle","link":"https://www.sundaymail.co.zw/warriors-break-silence-lift-the-lid-on-2019-afcon-debacle","keywords":["Sports","Top Stories"],"creator":["tawandamusarurwa"],"video_url":null,"description":"Petros Kausiyo Sports Editor FOUR years after their forgettable adventure at the Africa Cup of Nations (AFCON) in Egypt, where they hogged the limelight for endless off-field problems and were branded mercenaries by some within the ZIFA leadership, the Warriors have lifted the lid on the debacle that characterised their stay in Cairo. Zimbabwe, then […]","content":"The Sunday Mail FOUR years after their forgettable adventure at the Africa Cup of Nations (AFCON) in Egypt, where they hogged the limelight for endless off-field problems and were branded mercenaries by some within the ZIFA leadership, the Warriors have lifted the lid on the debacle that characterised their stay in Cairo. Zimbabwe, then under history-making coach Sunday Chidzambwa, arrived in Egypt for their fourth dance at the continental soccer showpiece on the back of some solid showings in the qualifiers. They had also excelled in the COSAFA Cup, which they had won back-to-back in 2017 and 2018. However, at AFCON, they were put in a tricky Group A that included hosts Egypt, Uganda and the Democratic Republic of Congo. All hell broke loose on the eve of their opening showdown against the Pharaohs at the Cairo International Stadium following contractual disputes between players and the Felton Kamambo-led ZIFA board. The disputes drew in the Confederation of African Football (CAF), which offered to pay players and later deduct the money from ZIFA’s share of the AFCON proceeds. Ironically, ZIFA were having disputes with the Warriors over money, at a time when Government — through the Warriors fundraising committee — had raised funds to be used by Chidzambwa and his men in Egypt. Kamambo and his ousted colleagues Philemon Machana and Bryton Malandule have, however, steadfastly denied receiving meaningful Government assistance. They insist they only received US$53 000 from the Ministry of Youth, Sport, Arts and Recreation, through the Sports and Recreation Commission (SRC). Players who spoke to The Sunday Mail Sport on condition of anonymity for fear of victimisation by the association indicated that they were made to understand that funding for their AFCON campaign in Egypt was coming from Government. “We are surprised to hear that Government did nothing to assist us in Egypt, when, in fact, it was ZIFA president Kamambo who addressed us and told us that Government had provided funds to meet all our demands as per the contracts,” said one of the players. “We actually had a problem with Malandule, who kept claiming that there was no money, and this created huge tension, resulting in players losing trust in him.” It has also since emerged that apart from Government, China-based striker Nyasha Mushekwi forked out over US$161 000 to pay the squad’s appearance fees for their final group game against DRC. According to their contracts, each of the 23 players who were in Egypt was entitled to US$5 000 in appearance fees and a daily allowance of US$150. Of late, Kamambo, Machana and Malandule have been on a crusade against Youth, Sport, Arts and Recreation Minister Kirsty Coventry over comments she made during a question-and-answer session in Parliament recently. Coventry told the legislators that ZIFA had not accounted for the funds provided to them. “For clarity, the SRC stepped in and suspended the (ZIFA) board for three main reasons. The first was that the Government had given ZIFA about US$2 million that has never been accounted for,” she said. “It wasn’t FIFA money but Zimbabwean money that parliamentarians should want to know where it has gone because it was never accounted for.” However, the trio of Kamambo, Machana and Malandule — with the support of ex-Central Region chairperson Stanley Chapeta and former chief executive officer Joseph Mamutse — have also threatened to sue Minister Coventry for her comments. They contend she misrepresented facts. In their statement read by Machana at a recent press conference, the ousted ZIFA board members also distanced themselves from allegations of sexual abuse. “We note with concern endless, inaccurate, misleading, (and) certainly unsubstantial and outright defamation utterances recently made in Parliament on 29 March by Honourable Minister Coventry during a question-and-answer session,” said Machana. “This is not the first time that the minister has been quoted publicly making such malicious and damaging utterances. She once issued a press statement in 2022, where she alleged the suspended members were sex predators.” The players, however, said they felt abandoned by Kamambo’s executive while in Egypt, hence the endless rows over contracts and appearance fees. “As far as we know, the daily allowances and other payments related to our contracts came from Government and we even had Minister (Kazembe) Kazembe coming to Egypt to try and resolve the serious problems, which were threatening our participation in the tournament. “ZIFA did not also honour the pledge to pay US$500 each for the draw bonus for the game against Uganda. “And it was even worse for the final match because they said there was no money, and Nyasha offered to pay the appearance fees if ZIFA didn’t. “So, when ZIFA failed to pay us in foreign currency and only gave us $7 000 after we came back, all the players had vowed not to play in the qualifiers for the 2021 AFCON. “Nyasha then lived up to his pledge and paid us our allowances.” They also claim that Nyasha and Marvelous Nakamba ended up buying air tickets for some players when they left Egypt. “ZIFA had not paid for air tickets for all of the players yet they had chartered a flight for supporters and councillors,’’ the player said. The national teams’ general manager, Wellington Mpandare, confirmed that, indeed, Mushekwi had bailed out the Warriors for their match against DRC. Just like former captain Knowledge Musona, ex-goalkeepers’ trainer Brenna Msiska and Chidzambwa before him, Mpandare noted that the Cairo debacle had been worsened by poor communication between ZIFA and the players. Chidzambwa, the country’s most successful national coach, told The Sunday Mail Sport in an earlier interview that “when the team was in Egypt, ZIFA deposited some of our dues in foreign currency accounts, but once the team returned home, the balance was paid in local currency at the ratio of one to one’’. He was also reportedly promised a car, which never materialised. This meant that Chidzambwa and his lieutenants, who were owed at least US$14 000 each at the end of the AFCON finals, only received RTGS$14 000 when they had returned home. Mpandare felt that had Government not chipped in with funding, including about US$300 000 that was paid to members of the technical department and the camping fees at the hotel they stayed before moving to the official CAF hotel, the Warriors campaign could have been worse. Such was the intensity of the disputes that Kamambo was forced to withdraw former referee Malandule as head of delegation and dispatched Premier Soccer League chairperson Farai Jere to take over the role. Although he has chosen to be modest about his role, Mushekwi has continued to receive plaudits and respect from fellow players for ensuring that the Warriors remained committed to national duty. They subsequently qualified for the 2021 AFCON in Cairo, Egypt, albeit under Croat Zdravko Logarusic. “A lot of players had been so frustrated and wanted to quit, but Nyasha flew to Zimbabwe and made available our outstanding appearance fees in foreign currency as per the contracts and urged us to continue playing for the country,’’ another player added. Mpandare also had a word of advice for the ousted ZIFA board members, urging them to avoid straining the association’s relationship with the Government. “If they have any queries, I am sure there are better ways of handling this and of engaging with the authorities than to engage in a public spat with the minister,” he said. “Assuming the ZIFA Congress, which recalled them, decides to reinstate them, how will they work with the Government? “I think they should apologise to the President, as the appointing authority, and to the minister for their actions, which are also regrettable at a time when the football family is advocating Government to directly fund the national teams.”","pubDate":"2023-04-08 22:07:21","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"WATCH: Bosso turn focus on DeMbare game","link":"https://www.sundaynews.co.zw/watch-bosso-turn-focus-on-dembare-game/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Ricky Zililo, Senior Sports Reporter AFTER seeing his charges squander a number of clear-cut chances in their derby against Chicken Inn, Highlanders Football Club coach Baltemar Brito is turning his focus on the epic encounter against Dynamos. The Bulawayo giants, who played a goalless draw against Chicken Inn on Good Friday at Barbourfields Stadium will […]","content":"The Sunday News AFTER seeing his charges squander a number of clear-cut chances in their derby against Chicken Inn, Highlanders Football Club coach Baltemar Brito is turning his focus on the epic encounter against Dynamos. The Bulawayo giants, who played a goalless draw against Chicken Inn on Good Friday at Barbourfields Stadium will play host to Dynamos on Saturday, three days before the two face off again in Independence Cup celebrations in Mount Darwin. Disappointed that his charges were wasteful against Chicken Inn especially in the first-half where striker Lynoth Chikuhwa twice hit the upright after beating the Gamecocks goalie Donovan Bernard, Brito felt that the draw was a fair result. Bosso started the derby on fire, with their playmaker Devine Mhindirira threading a defence-splitting pass to Chikuhwa in the first minute and the striker hit the far post having beaten Bernard. Minutes later, Chikuhwa missed the penalty as he hit the same post with Bernard sent the wrong way. The resultant penalty came after Bosso striker Stanley Ngala was brought down inside the box. Surprisingly, Highlanders goalkeeper Ariel Sibanda who usually takes penalties for his team stayed put at his goal area and watched Chikuhwa miss the spot kick. Highlanders enjoyed first-half dominance which they failed to turn into goals, with Mhindirira shining in the middle of the park, ably supported by Darlington Mukuli and Melikhaya Ncube, while wingbacks Andrew Mbeba and Archiford Faira occasionally overlapped to add numbers to their attacks which came to naught. Chicken Inn came stronger in the second-half, with veteran Tafadzwa Kutinyu dictating pace in the midfield, while Soccer Star of the Year finalist Brian Muza kept Highlanders’ central defenders Peter Muduhwa and Mbongeni Ndlovu on their toes. Chicken Inn found Sibanda resolute in Highlanders’ last line of defence. In his post-match interview, Brito said: “The first-half was one kind of performance and the second one was different. In the end I think the draw was a fair result. I think Chicken Inn didn’t have clear opportunities like we had in the first-half.” “We’re not happy at all that we dropped points, we know that local derbies have too many emotions and are not easy. Our team in the second-half didn’t compete like they did in the first-half. They started to split too much, waiting for the long ball and it gave Chicken Inn more time with the ball. Life goes on, we’ve Dynamos next week Saturday so we should change our focus and prepare for that game.” The draw left Highlanders still unbeaten after four games with eight points, two points behind leaders Caps United who beat Black Rhinos 2-0 on Good Friday. Chicken Inn’s gaffer Prince Matore was equally unhappy that his team dropped points. “We’ve always said that we need to collect maximum points at our home matches, these are two crucial points dropped today. “In the first-half our movement wasn’t what we wanted, our transitions were not what we wanted, and they were rushing everything. Second half, we rectified those things and it was a better second-half,” Matore said. Chicken Inn’s next assignment is another derby against Bulawayo Chiefs who were beaten 2-1 by FC Platinum. Follow on Twitter @ZililoR.","pubDate":"2023-04-08 22:05:29","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Liverpool v Arsenal: Best bets for Sunday and Monday’s Premier League and Championship games","link":"https://www.mirror.co.uk/sport/football/news/liverpool-arsenal-tips-odds-betting-29664077","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alex Hankin)"],"video_url":null,"description":"Our betting expert with tips for Anfield showdown, Leeds against Crystal Palace and a Bank Holiday acca PLUS La Liga angle","content":"Bet that there’s no place like home for Liverpool. The Arsenal WIN at Anfield today (4.30pm) is a strong 1X2 favourite – as short as 5/4. Even Prem defeats at Old Trafford, the Etihad and Goodison won’t deter the faithful from having that. Nor will the fact the Gunners haven’t won at Liverpool (90mins) since a 2-0 way back in 2012. There was a first ever Arsenal goal for Lukas Podolski that day if memory serves, by which I mean I looked it up on the internet. Sadly, Michael Thomas’s historic Kop-silencer of 1989 was pre-internet AND pre-Prem, so might not have happened at all. No need for googling that in their last home game Liverpool put seven past Manchester United . Even in this poor season they are W12 D5 L2 at Anfield. They’ve failed to score in just two of those games, and one was a second-string shuffle-up in the EFL Cup. Mo Salah has found the net in seven of his past 10 homes – if he starts, the 19/10 (Hills) ‘anytime scorer’ is plump. For an Arsenal angle I like Gabriel Martinelli ‘anytime’ at 13/5 (Bet365) – he’s blooming again. Crystal Palace ’s trip to Leeds (2pm) looks trappy, but with bobby-dazzler Rodrigo back, and a fixture list screaming ‘must-win’ in boss Javi Gracia’s ear, trust the hosts to at least rack up a lot of chances. Punt ‘OVER 4.5 Leeds shots on target’ at a bob-on 11/10 (Bet365). And big Pascal Struijk – who struck in the reverse fixture – looks a live longshot at 14/1 (Unibet) ‘anytime scorer’. Egg yourself on for an Easter Bank Holiday Monday special in the Championship tomorrow. This tier’s still chock full of meaningful games – by my count, 11 sides are still hungrily looking up, and seven feeling a bit queasy, looking down. Punt the WIN for 16-goal Carlton Morris and Luton, Preston, Norwich and Wigan plus the DRAW at Hull (all 3pm). The five-timer pays a cracking 43/1 (Bet365). Bookings magnet Ruben Sobrino is too big at 15/4 (Bet365) ‘to be shown a card’ when his scrappy Cadiz head to Real Betis (3.15pm) Last week: Winners at 6/5, 13/10 & 23/10","pubDate":"2023-04-09 00:01:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29664062.ece/ALTERNATES/s615/0_Chelsea-FC-v-Liverpool-FC-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Erik ten Hag hints he will stop using Man Utd tactic that Paul Scholes hated","link":"https://www.mirror.co.uk/sport/football/news/manutd-ten-hag-scholes-fernandes-29664868","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Dan Marsh)"],"video_url":null,"description":"Manchester United manager Erik ten Hag was full of praise for vice-captain Bruno Fernandes after he pulled the strings from a deeper central role in Saturday's win over Everton","content":"Erik ten Hag has dropped the biggest hint yet that he has no plans to utilise Bruno Fernandes in a wide position moving forward after the Manchester United star dazzled in a deep-lying midfield role against Everton . Fernandes, 28, has established himself as one of the club's most influential players since joining from Sporting Lisbon back in 2020 and has been a regular since Ten Hag succeeded Ralf Rangnick last summer. The Portuguese playmaker has played most of his football for United as a No.10, however, he has been deployed in a number of different roles by Ten Hag this term - including a brief spell on the wing . Erik ten Hag makes his feelings on Antony clear after Man Utd star left fans fuming Man Utd legend Bryan Robson involved in car crash en route to Everton match Fernandes played out wide with Wout Weghorst deployed as a No.10 in Manchester United's chastening 7-0 defeat against Liverpool last month and was heavily criticised for his petulant behaviour during the match. He rebounded in style with a brilliant performance in his usual role in United's 4-1 win over Real Betis in the Europa League just a few days later - and that prompted Old Trafford icon Paul Scholes to urge Ten Hag to never play his vice-captain out wide \"ever again\" . \"Some of the players who came in for criticism, Bruno especially, I thought he was brilliant in the centre of the pitch where we know that's his best position,\" Scholes told BT Sport after the win over Betis. \"I hope we never see him in a wide area ever again on the football pitch because it's just not his strength, he was so good in the centre of that pitch dictating play.\" Join the debate! Where do you think Ten Hag should play Bruno Fernandes going forward? Let us know here. Bruno Fernandes was hailed as the \"best player\" on the park by Erik ten Hag following Manchester United's 2-0 win over Everton ( Image: Stu Forster/Getty) Not for the first time, Fernandes pulled the strings from a deeper role in United's 2-0 win over Everton , which came hot on the heels of a midweek victory against Brentford. And Ten Hag's comments lauding Fernandes' performance indicate that a return to the wing is unlikely to occur anytime soon. \"I think [Fernandes] was brilliant but he was already playing brilliant over many games in a deeper role. Not everyone was recognising but also even last week at Newcastle he was playing very well,\" Ten Hag told Match of the Day following Saturday afternoon's match. \"Against Brentford played really well, today again, but I said he was definitely one of the best players, maybe the best player on the pitch, but we had more at a high level.\" After a difficult campaign last year, Fernandes has rediscovered some of his best form under Ten Hag and has managed to chalk up 10 goals and 12 assists in all competitions for Manchester United this term.","pubDate":"2023-04-09 00:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article28309734.ece/ALTERNATES/s615/0_MAIN-Blended-main-of-Ten-Hag-and-Scholes.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Nsoatreman FC shock Real Tamale United to book MTN FA Cup semifinal spot","link":"https://www.ghanafa.org/nsoatreman-fc-shock-real-tamale-united-to-book-mtn-fa-cup-semifinal-spot","keywords":null,"creator":null,"video_url":null,"description":"Premier League new boys Nsoatreman FC scored in the first half to eliminate three-time finalist Real Tamale United from the MTN FA Cup. The Nsoatre lads secured the win following a 1-0 win at the Aliu...","content":"Premier League new boys Nsoatreman FC scored in the first half to eliminate three-time finalist Real Tamale United from the MTN FA Cup. The Nsoatre lads secured passage to the semifinal following a 1-0 win at the Aliu Mahama Sports Stadium on Saturday. Nsoatreman FC went into the game looking to bounce back from a disastrous run of results in recent games having won only once in their last five appearances in the betPawa Premier League. After a fairly balanced game in the opening minutes, Philip Ofori gave Nsoatreman FC a surprising lead against the run of play through a 45 th minute corner kick. Real Tamale United switched back on immediately after halftime looking for the leveler but the visitors had Goalkeeper Daniel Afadzwu to thank for making three top quality saves to keep them in the game. Real Tamale United let down their fans after missing numerous golden chances that came their way as Nsoatreman held on to win 1-0 on the raod. Nsoatreman will now face the winner of the game between King Faisal and Aduana FC in the semifinal of the MTN FA Cup. The newly promoted Premier League side have now qualified to their first ever semifinal appearance in the history of the MTN FA Cup. GFA COMMUNICATIONS Get all the latest football news sent directly to your inbox","pubDate":"2023-04-08 23:57:09","image_url":null,"source_id":"ghanafa","category":["sports"],"country":["ghana"],"language":"english"},{"title":"Pakistan lost to Hong Kong in second match of AFC Women’s Olympic Qualifiers","link":"https://www.nation.com.pk/09-Apr-2023/pakistan-lost-to-hong-kong-in-second-match-of-afc-women-s-olympic-qualifiers","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan women’s football team was defeated at the hands of Hong Kong in their second clash of AFC Women’s Olympic Qualifiers at Hisor Central Stadium in Tajikistan.","content":"LAHORE - Pakistan women’s football team was defeated at the hands of Hong Kong in their second clash of AFC Women’s Olympic Qualifiers at Hisor Central Stadium in Tajikistan. According to information made available here on Saturday, Vice-Captain Malika Noor wore the captain’s armband in the absence of the injured Maria Khan and along with the side played impressively in the first half, the opponent missed an unchallenging penalty in the 33rd minute which skied over the keeper whereas goalkeeper Nisha Ashraf has been phenomenal as she saved an exceptional attempt of goal by Hong Kong in the 35th minute. The first half of the encounter remained goalless. In the second half of the game, Hong Kong showed its dominance in the dying moments of the match. In the 73rd minute, goalkeeper Nisha turned the long hit of Hong Kong’s captain Chan Wing Sze into an unfortunate own goal. The defensive side put up again a relatively better show but defender Sara Khan tried getting the ball away from the bar, causing a goal in favour of Hong Kong in the 90th minute. With a second consecutive loss, Pakistan’s journey in AFC Women’s Olympic Qualifier 2024 Paris has ended. Pakistan team faces the host Tajikistan on the 11th of April.","pubDate":"2023-04-08 23:45:25","image_url":"https://www.nation.com.pk/print_images/large/2023-04-09/pakistan-lost-to-hong-kong-in-second-match-of-afc-women-s-olympic-qualifiers-1680997515-5514.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ghana cruise to win over Senegal in International friendly","link":"https://www.ghanafa.org/ghana-score-cruise-to-win-over-senegal-in-international-friendly","keywords":null,"creator":null,"video_url":null,"description":"&amp;nbsp; The Black Queens of Ghana scored three first half goals to defeat the Teranga Lionesses of Senegal 3:0 in an international friendly at the Accra Sports Stadium on Saturday. &amp;nbsp;...","content":"The Black Queens of Ghana scored three first half goals to defeat the Teranga Lionesses of Senegal 3:0 in an international friendly at the Accra Sports Stadium on Saturday. Gifty Assifuah pounced on a rebound from an Evelyn Badu freekick to slot home the opener in the 2 nd minute to give the Queens an early lead. Six minutes later, Grace Asantewaa weaved her way through the edge of the penalty box leaving the defense of the opponents nonexistent and scoring a sublime solo goal to double the lead for the Queens. Cynthia Fiindib came to the rescue of the Queens after Portia Boakye lost possession in a dangerous area but Ghana goalkeeper Cynthia Konlan was on hand to deny the Senegalese in the 30 th minute. Gifty Assifuah grabbed her brace seconds before the half time whistle as Ghana went into the break with a on three goal advantage. Suzzy Dede Teye, Princess Owusu, Fidous Yakubu and Linda were introduced in the second half but that did not change the tempo of the game as the Queens pressed for more goals but were denied on several occasions. Senegal showed they were still in the contest when they had a good chance to get a consolation but Cynthia Fiindib was once again called to duty but pulled a great save to keep a clean sheet as the game ended 3:0 in favor of the Black Queens. Ghana will host Senegal in a second encounter at the Accra Sports Stadium on Tuesday, April 11, 2023 as both sides cont8nue to prepare for future assignments. Here are some photos from the match: GFA COMMUNICATIONS Get all the latest football news sent directly to your inbox","pubDate":"2023-04-08 23:14:45","image_url":null,"source_id":"ghanafa","category":["sports"],"country":["ghana"],"language":"english"},{"title":"Erik ten Hag makes his feelings on Antony clear after Man Utd star left fans fuming","link":"https://www.mirror.co.uk/sport/football/news/man-utd-ten-hag-antony-29664794","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Dan Marsh)"],"video_url":null,"description":"Manchester United winger Antony has been criticised by fans and pundits alike this season, but Erik ten Hag has defended the 23-year-old's record in front of goal","content":"Erik ten Hag believes that Antony has performed adequately since his blockbuster summer switch to Manchester United in the wake of recent criticism which has been directed at the winger. After months of speculation, the Brazil international arrived at Old Trafford in a deal which could eventually eclipse £85.5million from Ajax , where he flourished under the guidance of Ten Hag. The 23-year-old chalked up 12 goals and 10 assists in all competitions for the Dutch giants but has struggled to replicate the same explosive performances that first piqued United's attention since swapping Amsterdam for the Premier League . The former Sao Paolo youngster has even come in for some fierce criticism from several pundits, too, including Old Trafford icon Paul Scholes . Man Utd legend Bryan Robson involved in car crash en route to Everton match Paul Scholes bats back Erik ten Hag moan and serves reality check to Man Utd boss Antony's manager, however, is satisfied with the contributions he has made during his maiden season in English football - even if he does believe that the winger is capable of more in front of goal. Speaking after Manchester United's 2-0 win over Everton on Saturday, Ten Hag was asked whether he felt players within the squad were capable of stepping up to ease the goalscoring burden on top-scorer Marcus Rashford or whether he needed fresh blood. The Dutchman replied: \"Maybe both. I think they can. Antony already scored a couple of goals - seven or eight goals - scoring in big games, it’s not bad for a winger, right? In his first season. Also against big opponents like Barcelona , [Real] Betis. \" [Jadon] Sancho , he has a period out, [Anthony] Martial can definitely do it, Bruno [Fernandes] also we know it. He’s now playing in a little bit deeper role so he’s further away from the goal but we have goal scoring players in our squad. We have to work on our scoring abilities but also we have to think about the transfer market, yes.\" Join the debate! How do you think Antony has performed for Man Utd this season? Let us know here. Antony has been criticised by fans and pundits alike this term, but Erik ten Hag has defended the Manchester United winger ( Image: Michael Regan/Getty Images) As Ten Hag alluded to, Antony has netted several big goals for Manchester United this term and his tally of seven goals in all competitions (in addition to three assists) is a decent enough return, but his actual performances have left some people underwhelmed. He felt the full wrath of the United faithful last weekend when he was criticised for slowing down an attack when Ten Hag's team were chasing a goal at St James' Park in a match they eventually lost 2-0. The baffling moment capped an ineffective display and Antony was taken off by Ten Hag on the hour mark not long after his ill-judged decision to put the handbrake on. Antony was taken off after an hour again in Sunday's 2-0 win over Everton but was far more effective, with Scholes - who has been particularly vocal on the winger's performances in the past - insisting that it was the \"best game\" he had seen Antony have since joining the club.","pubDate":"2023-04-08 23:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29397263.ece/ALTERNATES/s615/21_MAIN-Liverpool-FC-v-Manchester-United-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Футболисты «Барселоны» из-за поражения «Реала» радовались в командном чате","link":"https://www.sports.ru/football/1115044824-zhest-futbolisty-barselony-v-komandnom-chate-radovalis-iz-za-porazheni.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Мадридский клуб уступил «Вильярреалу» (2:3) в домашнем матче 28-го тура Ла Лиги.","content":"Футболисты «Барселоны» обрадовались из-за поражения «Реала» Мадридский клуб уступил « Вильярреалу » (2:3) в домашнем матче 28-го тура Ла Лиги . Каталонцы занимают первое место в турнирной таблице чемпионата Испании, опережая на 12 очков мадридцев, при этом «Барселоне» еще предстоит провести матч в этом туре против «Жироны». Как пишет As, после завершения матча в Мадриде в командном чате «Барселоны» футболисты обменивались восторженными сообщениями и смайликами, не скрывая радость об итогах игры «Реала». «Жесть!» – сказано в одном из сообщений, которое было опубликовано в чате каталонского клуба.","pubDate":"2023-04-08 22:30:00","image_url":null,"source_id":"sports","category":["sports"],"country":["russia"],"language":"russian"},{"title":"\"Ma maman, elle a 83 ans. Elle sort d'un cancer. Point à la ligne\". Christophe Galtier réagit à la banderole insultante déployée lors de Nice - PSG","link":"https://www.nicematin.com/football/ma-maman-a-83-ans-et-sort-dun-cancer-point-a-la-ligne-christophe-galtier-reagit-a-la-banderole-insultante-deployee-lors-de-nice-psg-840044","keywords":null,"creator":null,"video_url":null,"description":"L'entraîneur du PSG Christophe Galtier, qui revenait à Nice pour la première fois depuis son départ du banc du Gym cet été, n'a pas été épargné par les supporters de son ancienne équipe ce samedi soir.","content":"Christophe Galtier a d'abord été sifflé à l’annonce des équipes. Au cœur de la première période, la Populaire Sud l’a ensuite copieusement insulté et une banderole (rapidement retirée et pas montrée dans son intégralité par le diffuseur) a été déployée avec écrit: “Avant/Après, la mamma di Galtier”. L’ancien coach du Gym n’a pas vraiment apprécié et s’en est plaint au délégué de la rencontre. Il a également levé le pouce de manière ironique en direction de la tribune des Ultras de la Populaire avant de venir les applaudir tout aussi ironiquement au coup de sifflet final. \"Vous avez vu? Vous avez entendu? Ma maman, elle a 83 ans, elle sort d'un cancer. Point à la ligne. Et si ces gens-là jouent une Coupe d'Europe, c'est grâce à mon travail de l'an dernier\", a réagi Christophe Galtier en conférence de presse . Et d'ajouter sur le match cette fois: \"Il était important de l'emporter après nos deux dernières contre-performances. J'avais demandé à mes joueurs d'être plus compacts, solidaires et accrocheurs dans la conquête du ballon. J'ai vu beaucoup de compensation et un grand gardien ce soir. On a marqué dans les moments importants. Avec tout le brouhaha autour de Paris et de moi, il était important de l'emporter.\"","pubDate":"2023-04-08 22:09:00","image_url":"https://fyooyzbm.filerobot.com/v7/FOOTBALL+NICE+PSG+PAR+%2829588905%29-oXtNCRhq.jpg?vh=b54625&ci_seal=bfca02492b&p=medium&v2&gravity=auto","source_id":"nicematin","category":["sports"],"country":["france"],"language":"french"},{"title":"Warriors break silence . . . lift the lid on 2019 AFCON debacle","link":"https://www.sundaymail.co.zw/warriors-break-silence-lift-the-lid-on-2019-afcon-debacle","keywords":["Sports","Top Stories"],"creator":["tawandamusarurwa"],"video_url":null,"description":"Petros Kausiyo Sports Editor FOUR years after their forgettable adventure at the Africa Cup of Nations (AFCON) in Egypt, where they hogged the limelight for endless off-field problems and were branded mercenaries by some within the ZIFA leadership, the Warriors have lifted the lid on the debacle that characterised their stay in Cairo. Zimbabwe, then […]","content":"The Sunday Mail FOUR years after their forgettable adventure at the Africa Cup of Nations (AFCON) in Egypt, where they hogged the limelight for endless off-field problems and were branded mercenaries by some within the ZIFA leadership, the Warriors have lifted the lid on the debacle that characterised their stay in Cairo. Zimbabwe, then under history-making coach Sunday Chidzambwa, arrived in Egypt for their fourth dance at the continental soccer showpiece on the back of some solid showings in the qualifiers. They had also excelled in the COSAFA Cup, which they had won back-to-back in 2017 and 2018. However, at AFCON, they were put in a tricky Group A that included hosts Egypt, Uganda and the Democratic Republic of Congo. All hell broke loose on the eve of their opening showdown against the Pharaohs at the Cairo International Stadium following contractual disputes between players and the Felton Kamambo-led ZIFA board. The disputes drew in the Confederation of African Football (CAF), which offered to pay players and later deduct the money from ZIFA’s share of the AFCON proceeds. Ironically, ZIFA were having disputes with the Warriors over money, at a time when Government — through the Warriors fundraising committee — had raised funds to be used by Chidzambwa and his men in Egypt. Kamambo and his ousted colleagues Philemon Machana and Bryton Malandule have, however, steadfastly denied receiving meaningful Government assistance. They insist they only received US$53 000 from the Ministry of Youth, Sport, Arts and Recreation, through the Sports and Recreation Commission (SRC). Players who spoke to The Sunday Mail Sport on condition of anonymity for fear of victimisation by the association indicated that they were made to understand that funding for their AFCON campaign in Egypt was coming from Government. “We are surprised to hear that Government did nothing to assist us in Egypt, when, in fact, it was ZIFA president Kamambo who addressed us and told us that Government had provided funds to meet all our demands as per the contracts,” said one of the players. “We actually had a problem with Malandule, who kept claiming that there was no money, and this created huge tension, resulting in players losing trust in him.” It has also since emerged that apart from Government, China-based striker Nyasha Mushekwi forked out over US$161 000 to pay the squad’s appearance fees for their final group game against DRC. According to their contracts, each of the 23 players who were in Egypt was entitled to US$5 000 in appearance fees and a daily allowance of US$150. Of late, Kamambo, Machana and Malandule have been on a crusade against Youth, Sport, Arts and Recreation Minister Kirsty Coventry over comments she made during a question-and-answer session in Parliament recently. Coventry told the legislators that ZIFA had not accounted for the funds provided to them. “For clarity, the SRC stepped in and suspended the (ZIFA) board for three main reasons. The first was that the Government had given ZIFA about US$2 million that has never been accounted for,” she said. “It wasn’t FIFA money but Zimbabwean money that parliamentarians should want to know where it has gone because it was never accounted for.” However, the trio of Kamambo, Machana and Malandule — with the support of ex-Central Region chairperson Stanley Chapeta and former chief executive officer Joseph Mamutse — have also threatened to sue Minister Coventry for her comments. They contend she misrepresented facts. In their statement read by Machana at a recent press conference, the ousted ZIFA board members also distanced themselves from allegations of sexual abuse. “We note with concern endless, inaccurate, misleading, (and) certainly unsubstantial and outright defamation utterances recently made in Parliament on 29 March by Honourable Minister Coventry during a question-and-answer session,” said Machana. “This is not the first time that the minister has been quoted publicly making such malicious and damaging utterances. She once issued a press statement in 2022, where she alleged the suspended members were sex predators.” The players, however, said they felt abandoned by Kamambo’s executive while in Egypt, hence the endless rows over contracts and appearance fees. “As far as we know, the daily allowances and other payments related to our contracts came from Government and we even had Minister (Kazembe) Kazembe coming to Egypt to try and resolve the serious problems, which were threatening our participation in the tournament. “ZIFA did not also honour the pledge to pay US$500 each for the draw bonus for the game against Uganda. “And it was even worse for the final match because they said there was no money, and Nyasha offered to pay the appearance fees if ZIFA didn’t. “So, when ZIFA failed to pay us in foreign currency and only gave us $7 000 after we came back, all the players had vowed not to play in the qualifiers for the 2021 AFCON. “Nyasha then lived up to his pledge and paid us our allowances.” They also claim that Nyasha and Marvelous Nakamba ended up buying air tickets for some players when they left Egypt. “ZIFA had not paid for air tickets for all of the players yet they had chartered a flight for supporters and councillors,’’ the player said. The national teams’ general manager, Wellington Mpandare, confirmed that, indeed, Mushekwi had bailed out the Warriors for their match against DRC. Just like former captain Knowledge Musona, ex-goalkeepers’ trainer Brenna Msiska and Chidzambwa before him, Mpandare noted that the Cairo debacle had been worsened by poor communication between ZIFA and the players. Chidzambwa, the country’s most successful national coach, told The Sunday Mail Sport in an earlier interview that “when the team was in Egypt, ZIFA deposited some of our dues in foreign currency accounts, but once the team returned home, the balance was paid in local currency at the ratio of one to one’’. He was also reportedly promised a car, which never materialised. This meant that Chidzambwa and his lieutenants, who were owed at least US$14 000 each at the end of the AFCON finals, only received RTGS$14 000 when they had returned home. Mpandare felt that had Government not chipped in with funding, including about US$300 000 that was paid to members of the technical department and the camping fees at the hotel they stayed before moving to the official CAF hotel, the Warriors campaign could have been worse. Such was the intensity of the disputes that Kamambo was forced to withdraw former referee Malandule as head of delegation and dispatched Premier Soccer League chairperson Farai Jere to take over the role. Although he has chosen to be modest about his role, Mushekwi has continued to receive plaudits and respect from fellow players for ensuring that the Warriors remained committed to national duty. They subsequently qualified for the 2021 AFCON in Cairo, Egypt, albeit under Croat Zdravko Logarusic. “A lot of players had been so frustrated and wanted to quit, but Nyasha flew to Zimbabwe and made available our outstanding appearance fees in foreign currency as per the contracts and urged us to continue playing for the country,’’ another player added. Mpandare also had a word of advice for the ousted ZIFA board members, urging them to avoid straining the association’s relationship with the Government. “If they have any queries, I am sure there are better ways of handling this and of engaging with the authorities than to engage in a public spat with the minister,” he said. “Assuming the ZIFA Congress, which recalled them, decides to reinstate them, how will they work with the Government? “I think they should apologise to the President, as the appointing authority, and to the minister for their actions, which are also regrettable at a time when the football family is advocating Government to directly fund the national teams.”","pubDate":"2023-04-08 22:07:21","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"WATCH: Bosso turn focus on DeMbare game","link":"https://www.sundaynews.co.zw/watch-bosso-turn-focus-on-dembare-game/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Ricky Zililo, Senior Sports Reporter AFTER seeing his charges squander a number of clear-cut chances in their derby against Chicken Inn, Highlanders Football Club coach Baltemar Brito is turning his focus on the epic encounter against Dynamos. The Bulawayo giants, who played a goalless draw against Chicken Inn on Good Friday at Barbourfields Stadium will […]","content":"The Sunday News AFTER seeing his charges squander a number of clear-cut chances in their derby against Chicken Inn, Highlanders Football Club coach Baltemar Brito is turning his focus on the epic encounter against Dynamos. The Bulawayo giants, who played a goalless draw against Chicken Inn on Good Friday at Barbourfields Stadium will play host to Dynamos on Saturday, three days before the two face off again in Independence Cup celebrations in Mount Darwin. Disappointed that his charges were wasteful against Chicken Inn especially in the first-half where striker Lynoth Chikuhwa twice hit the upright after beating the Gamecocks goalie Donovan Bernard, Brito felt that the draw was a fair result. Bosso started the derby on fire, with their playmaker Devine Mhindirira threading a defence-splitting pass to Chikuhwa in the first minute and the striker hit the far post having beaten Bernard. Minutes later, Chikuhwa missed the penalty as he hit the same post with Bernard sent the wrong way. The resultant penalty came after Bosso striker Stanley Ngala was brought down inside the box. Surprisingly, Highlanders goalkeeper Ariel Sibanda who usually takes penalties for his team stayed put at his goal area and watched Chikuhwa miss the spot kick. Highlanders enjoyed first-half dominance which they failed to turn into goals, with Mhindirira shining in the middle of the park, ably supported by Darlington Mukuli and Melikhaya Ncube, while wingbacks Andrew Mbeba and Archiford Faira occasionally overlapped to add numbers to their attacks which came to naught. Chicken Inn came stronger in the second-half, with veteran Tafadzwa Kutinyu dictating pace in the midfield, while Soccer Star of the Year finalist Brian Muza kept Highlanders’ central defenders Peter Muduhwa and Mbongeni Ndlovu on their toes. Chicken Inn found Sibanda resolute in Highlanders’ last line of defence. In his post-match interview, Brito said: “The first-half was one kind of performance and the second one was different. In the end I think the draw was a fair result. I think Chicken Inn didn’t have clear opportunities like we had in the first-half.” “We’re not happy at all that we dropped points, we know that local derbies have too many emotions and are not easy. Our team in the second-half didn’t compete like they did in the first-half. They started to split too much, waiting for the long ball and it gave Chicken Inn more time with the ball. Life goes on, we’ve Dynamos next week Saturday so we should change our focus and prepare for that game.” The draw left Highlanders still unbeaten after four games with eight points, two points behind leaders Caps United who beat Black Rhinos 2-0 on Good Friday. Chicken Inn’s gaffer Prince Matore was equally unhappy that his team dropped points. “We’ve always said that we need to collect maximum points at our home matches, these are two crucial points dropped today. “In the first-half our movement wasn’t what we wanted, our transitions were not what we wanted, and they were rushing everything. Second half, we rectified those things and it was a better second-half,” Matore said. Chicken Inn’s next assignment is another derby against Bulawayo Chiefs who were beaten 2-1 by FC Platinum. Follow on Twitter @ZililoR.","pubDate":"2023-04-08 22:05:29","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Liverpool v Arsenal: Best bets for Sunday and Monday’s Premier League and Championship games","link":"https://www.mirror.co.uk/sport/football/news/liverpool-arsenal-tips-odds-betting-29664077","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alex Hankin)"],"video_url":null,"description":"Our betting expert with tips for Anfield showdown, Leeds against Crystal Palace and a Bank Holiday acca PLUS La Liga angle","content":"Bet that there’s no place like home for Liverpool. The Arsenal WIN at Anfield today (4.30pm) is a strong 1X2 favourite – as short as 5/4. Even Prem defeats at Old Trafford, the Etihad and Goodison won’t deter the faithful from having that. Nor will the fact the Gunners haven’t won at Liverpool (90mins) since a 2-0 way back in 2012. There was a first ever Arsenal goal for Lukas Podolski that day if memory serves, by which I mean I looked it up on the internet. Sadly, Michael Thomas’s historic Kop-silencer of 1989 was pre-internet AND pre-Prem, so might not have happened at all. No need for googling that in their last home game Liverpool put seven past Manchester United . Even in this poor season they are W12 D5 L2 at Anfield. They’ve failed to score in just two of those games, and one was a second-string shuffle-up in the EFL Cup. Mo Salah has found the net in seven of his past 10 homes – if he starts, the 19/10 (Hills) ‘anytime scorer’ is plump. For an Arsenal angle I like Gabriel Martinelli ‘anytime’ at 13/5 (Bet365) – he’s blooming again. Crystal Palace ’s trip to Leeds (2pm) looks trappy, but with bobby-dazzler Rodrigo back, and a fixture list screaming ‘must-win’ in boss Javi Gracia’s ear, trust the hosts to at least rack up a lot of chances. Punt ‘OVER 4.5 Leeds shots on target’ at a bob-on 11/10 (Bet365). And big Pascal Struijk – who struck in the reverse fixture – looks a live longshot at 14/1 (Unibet) ‘anytime scorer’. Egg yourself on for an Easter Bank Holiday Monday special in the Championship tomorrow. This tier’s still chock full of meaningful games – by my count, 11 sides are still hungrily looking up, and seven feeling a bit queasy, looking down. Punt the WIN for 16-goal Carlton Morris and Luton, Preston, Norwich and Wigan plus the DRAW at Hull (all 3pm). The five-timer pays a cracking 43/1 (Bet365). Bookings magnet Ruben Sobrino is too big at 15/4 (Bet365) ‘to be shown a card’ when his scrappy Cadiz head to Real Betis (3.15pm) Last week: Winners at 6/5, 13/10 & 23/10","pubDate":"2023-04-09 00:01:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29664062.ece/ALTERNATES/s615/0_Chelsea-FC-v-Liverpool-FC-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Erik ten Hag hints he will stop using Man Utd tactic that Paul Scholes hated","link":"https://www.mirror.co.uk/sport/football/news/manutd-ten-hag-scholes-fernandes-29664868","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Dan Marsh)"],"video_url":null,"description":"Manchester United manager Erik ten Hag was full of praise for vice-captain Bruno Fernandes after he pulled the strings from a deeper central role in Saturday's win over Everton","content":"Erik ten Hag has dropped the biggest hint yet that he has no plans to utilise Bruno Fernandes in a wide position moving forward after the Manchester United star dazzled in a deep-lying midfield role against Everton . Fernandes, 28, has established himself as one of the club's most influential players since joining from Sporting Lisbon back in 2020 and has been a regular since Ten Hag succeeded Ralf Rangnick last summer. The Portuguese playmaker has played most of his football for United as a No.10, however, he has been deployed in a number of different roles by Ten Hag this term - including a brief spell on the wing . Erik ten Hag makes his feelings on Antony clear after Man Utd star left fans fuming Man Utd legend Bryan Robson involved in car crash en route to Everton match Fernandes played out wide with Wout Weghorst deployed as a No.10 in Manchester United's chastening 7-0 defeat against Liverpool last month and was heavily criticised for his petulant behaviour during the match. He rebounded in style with a brilliant performance in his usual role in United's 4-1 win over Real Betis in the Europa League just a few days later - and that prompted Old Trafford icon Paul Scholes to urge Ten Hag to never play his vice-captain out wide \"ever again\" . \"Some of the players who came in for criticism, Bruno especially, I thought he was brilliant in the centre of the pitch where we know that's his best position,\" Scholes told BT Sport after the win over Betis. \"I hope we never see him in a wide area ever again on the football pitch because it's just not his strength, he was so good in the centre of that pitch dictating play.\" Join the debate! Where do you think Ten Hag should play Bruno Fernandes going forward? Let us know here. Bruno Fernandes was hailed as the \"best player\" on the park by Erik ten Hag following Manchester United's 2-0 win over Everton ( Image: Stu Forster/Getty) Not for the first time, Fernandes pulled the strings from a deeper role in United's 2-0 win over Everton , which came hot on the heels of a midweek victory against Brentford. And Ten Hag's comments lauding Fernandes' performance indicate that a return to the wing is unlikely to occur anytime soon. \"I think [Fernandes] was brilliant but he was already playing brilliant over many games in a deeper role. Not everyone was recognising but also even last week at Newcastle he was playing very well,\" Ten Hag told Match of the Day following Saturday afternoon's match. \"Against Brentford played really well, today again, but I said he was definitely one of the best players, maybe the best player on the pitch, but we had more at a high level.\" After a difficult campaign last year, Fernandes has rediscovered some of his best form under Ten Hag and has managed to chalk up 10 goals and 12 assists in all competitions for Manchester United this term.","pubDate":"2023-04-09 00:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article28309734.ece/ALTERNATES/s615/0_MAIN-Blended-main-of-Ten-Hag-and-Scholes.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Nsoatreman FC shock Real Tamale United to book MTN FA Cup semifinal spot","link":"https://www.ghanafa.org/nsoatreman-fc-shock-real-tamale-united-to-book-mtn-fa-cup-semifinal-spot","keywords":null,"creator":null,"video_url":null,"description":"Premier League new boys Nsoatreman FC scored in the first half to eliminate three-time finalist Real Tamale United from the MTN FA Cup. The Nsoatre lads secured the win following a 1-0 win at the Aliu...","content":"Premier League new boys Nsoatreman FC scored in the first half to eliminate three-time finalist Real Tamale United from the MTN FA Cup. The Nsoatre lads secured passage to the semifinal following a 1-0 win at the Aliu Mahama Sports Stadium on Saturday. Nsoatreman FC went into the game looking to bounce back from a disastrous run of results in recent games having won only once in their last five appearances in the betPawa Premier League. After a fairly balanced game in the opening minutes, Philip Ofori gave Nsoatreman FC a surprising lead against the run of play through a 45 th minute corner kick. Real Tamale United switched back on immediately after halftime looking for the leveler but the visitors had Goalkeeper Daniel Afadzwu to thank for making three top quality saves to keep them in the game. Real Tamale United let down their fans after missing numerous golden chances that came their way as Nsoatreman held on to win 1-0 on the raod. Nsoatreman will now face the winner of the game between King Faisal and Aduana FC in the semifinal of the MTN FA Cup. The newly promoted Premier League side have now qualified to their first ever semifinal appearance in the history of the MTN FA Cup. GFA COMMUNICATIONS Get all the latest football news sent directly to your inbox","pubDate":"2023-04-08 23:57:09","image_url":null,"source_id":"ghanafa","category":["sports"],"country":["ghana"],"language":"english"},{"title":"Pakistan lost to Hong Kong in second match of AFC Women’s Olympic Qualifiers","link":"https://www.nation.com.pk/09-Apr-2023/pakistan-lost-to-hong-kong-in-second-match-of-afc-women-s-olympic-qualifiers","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan women’s football team was defeated at the hands of Hong Kong in their second clash of AFC Women’s Olympic Qualifiers at Hisor Central Stadium in Tajikistan.","content":"LAHORE - Pakistan women’s football team was defeated at the hands of Hong Kong in their second clash of AFC Women’s Olympic Qualifiers at Hisor Central Stadium in Tajikistan. According to information made available here on Saturday, Vice-Captain Malika Noor wore the captain’s armband in the absence of the injured Maria Khan and along with the side played impressively in the first half, the opponent missed an unchallenging penalty in the 33rd minute which skied over the keeper whereas goalkeeper Nisha Ashraf has been phenomenal as she saved an exceptional attempt of goal by Hong Kong in the 35th minute. The first half of the encounter remained goalless. In the second half of the game, Hong Kong showed its dominance in the dying moments of the match. In the 73rd minute, goalkeeper Nisha turned the long hit of Hong Kong’s captain Chan Wing Sze into an unfortunate own goal. The defensive side put up again a relatively better show but defender Sara Khan tried getting the ball away from the bar, causing a goal in favour of Hong Kong in the 90th minute. With a second consecutive loss, Pakistan’s journey in AFC Women’s Olympic Qualifier 2024 Paris has ended. Pakistan team faces the host Tajikistan on the 11th of April.","pubDate":"2023-04-08 23:45:25","image_url":"https://www.nation.com.pk/print_images/large/2023-04-09/pakistan-lost-to-hong-kong-in-second-match-of-afc-women-s-olympic-qualifiers-1680997515-5514.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ghana cruise to win over Senegal in International friendly","link":"https://www.ghanafa.org/ghana-score-cruise-to-win-over-senegal-in-international-friendly","keywords":null,"creator":null,"video_url":null,"description":"&amp;nbsp; The Black Queens of Ghana scored three first half goals to defeat the Teranga Lionesses of Senegal 3:0 in an international friendly at the Accra Sports Stadium on Saturday. &amp;nbsp;...","content":"The Black Queens of Ghana scored three first half goals to defeat the Teranga Lionesses of Senegal 3:0 in an international friendly at the Accra Sports Stadium on Saturday. Gifty Assifuah pounced on a rebound from an Evelyn Badu freekick to slot home the opener in the 2 nd minute to give the Queens an early lead. Six minutes later, Grace Asantewaa weaved her way through the edge of the penalty box leaving the defense of the opponents nonexistent and scoring a sublime solo goal to double the lead for the Queens. Cynthia Fiindib came to the rescue of the Queens after Portia Boakye lost possession in a dangerous area but Ghana goalkeeper Cynthia Konlan was on hand to deny the Senegalese in the 30 th minute. Gifty Assifuah grabbed her brace seconds before the half time whistle as Ghana went into the break with a on three goal advantage. Suzzy Dede Teye, Princess Owusu, Fidous Yakubu and Linda were introduced in the second half but that did not change the tempo of the game as the Queens pressed for more goals but were denied on several occasions. Senegal showed they were still in the contest when they had a good chance to get a consolation but Cynthia Fiindib was once again called to duty but pulled a great save to keep a clean sheet as the game ended 3:0 in favor of the Black Queens. Ghana will host Senegal in a second encounter at the Accra Sports Stadium on Tuesday, April 11, 2023 as both sides cont8nue to prepare for future assignments. Here are some photos from the match: GFA COMMUNICATIONS Get all the latest football news sent directly to your inbox","pubDate":"2023-04-08 23:14:45","image_url":null,"source_id":"ghanafa","category":["sports"],"country":["ghana"],"language":"english"},{"title":"Erik ten Hag makes his feelings on Antony clear after Man Utd star left fans fuming","link":"https://www.mirror.co.uk/sport/football/news/man-utd-ten-hag-antony-29664794","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Dan Marsh)"],"video_url":null,"description":"Manchester United winger Antony has been criticised by fans and pundits alike this season, but Erik ten Hag has defended the 23-year-old's record in front of goal","content":"Erik ten Hag believes that Antony has performed adequately since his blockbuster summer switch to Manchester United in the wake of recent criticism which has been directed at the winger. After months of speculation, the Brazil international arrived at Old Trafford in a deal which could eventually eclipse £85.5million from Ajax , where he flourished under the guidance of Ten Hag. The 23-year-old chalked up 12 goals and 10 assists in all competitions for the Dutch giants but has struggled to replicate the same explosive performances that first piqued United's attention since swapping Amsterdam for the Premier League . The former Sao Paolo youngster has even come in for some fierce criticism from several pundits, too, including Old Trafford icon Paul Scholes . Man Utd legend Bryan Robson involved in car crash en route to Everton match Paul Scholes bats back Erik ten Hag moan and serves reality check to Man Utd boss Antony's manager, however, is satisfied with the contributions he has made during his maiden season in English football - even if he does believe that the winger is capable of more in front of goal. Speaking after Manchester United's 2-0 win over Everton on Saturday, Ten Hag was asked whether he felt players within the squad were capable of stepping up to ease the goalscoring burden on top-scorer Marcus Rashford or whether he needed fresh blood. The Dutchman replied: \"Maybe both. I think they can. Antony already scored a couple of goals - seven or eight goals - scoring in big games, it’s not bad for a winger, right? In his first season. Also against big opponents like Barcelona , [Real] Betis. \" [Jadon] Sancho , he has a period out, [Anthony] Martial can definitely do it, Bruno [Fernandes] also we know it. He’s now playing in a little bit deeper role so he’s further away from the goal but we have goal scoring players in our squad. We have to work on our scoring abilities but also we have to think about the transfer market, yes.\" Join the debate! How do you think Antony has performed for Man Utd this season? Let us know here. Antony has been criticised by fans and pundits alike this term, but Erik ten Hag has defended the Manchester United winger ( Image: Michael Regan/Getty Images) As Ten Hag alluded to, Antony has netted several big goals for Manchester United this term and his tally of seven goals in all competitions (in addition to three assists) is a decent enough return, but his actual performances have left some people underwhelmed. He felt the full wrath of the United faithful last weekend when he was criticised for slowing down an attack when Ten Hag's team were chasing a goal at St James' Park in a match they eventually lost 2-0. The baffling moment capped an ineffective display and Antony was taken off by Ten Hag on the hour mark not long after his ill-judged decision to put the handbrake on. Antony was taken off after an hour again in Sunday's 2-0 win over Everton but was far more effective, with Scholes - who has been particularly vocal on the winger's performances in the past - insisting that it was the \"best game\" he had seen Antony have since joining the club.","pubDate":"2023-04-08 23:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29397263.ece/ALTERNATES/s615/21_MAIN-Liverpool-FC-v-Manchester-United-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Футболисты «Барселоны» из-за поражения «Реала» радовались в командном чате","link":"https://www.sports.ru/football/1115044824-zhest-futbolisty-barselony-v-komandnom-chate-radovalis-iz-za-porazheni.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Мадридский клуб уступил «Вильярреалу» (2:3) в домашнем матче 28-го тура Ла Лиги.","content":"Футболисты «Барселоны» обрадовались из-за поражения «Реала» Мадридский клуб уступил « Вильярреалу » (2:3) в домашнем матче 28-го тура Ла Лиги . Каталонцы занимают первое место в турнирной таблице чемпионата Испании, опережая на 12 очков мадридцев, при этом «Барселоне» еще предстоит провести матч в этом туре против «Жироны». Как пишет As, после завершения матча в Мадриде в командном чате «Барселоны» футболисты обменивались восторженными сообщениями и смайликами, не скрывая радость об итогах игры «Реала». «Жесть!» – сказано в одном из сообщений, которое было опубликовано в чате каталонского клуба.","pubDate":"2023-04-08 22:30:00","image_url":null,"source_id":"sports","category":["sports"],"country":["russia"],"language":"russian"},{"title":"\"Ma maman, elle a 83 ans. Elle sort d'un cancer. Point à la ligne\". Christophe Galtier réagit à la banderole insultante déployée lors de Nice - PSG","link":"https://www.nicematin.com/football/ma-maman-a-83-ans-et-sort-dun-cancer-point-a-la-ligne-christophe-galtier-reagit-a-la-banderole-insultante-deployee-lors-de-nice-psg-840044","keywords":null,"creator":null,"video_url":null,"description":"L'entraîneur du PSG Christophe Galtier, qui revenait à Nice pour la première fois depuis son départ du banc du Gym cet été, n'a pas été épargné par les supporters de son ancienne équipe ce samedi soir.","content":"Christophe Galtier a d'abord été sifflé à l’annonce des équipes. Au cœur de la première période, la Populaire Sud l’a ensuite copieusement insulté et une banderole (rapidement retirée et pas montrée dans son intégralité par le diffuseur) a été déployée avec écrit: “Avant/Après, la mamma di Galtier”. L’ancien coach du Gym n’a pas vraiment apprécié et s’en est plaint au délégué de la rencontre. Il a également levé le pouce de manière ironique en direction de la tribune des Ultras de la Populaire avant de venir les applaudir tout aussi ironiquement au coup de sifflet final. \"Vous avez vu? Vous avez entendu? Ma maman, elle a 83 ans, elle sort d'un cancer. Point à la ligne. Et si ces gens-là jouent une Coupe d'Europe, c'est grâce à mon travail de l'an dernier\", a réagi Christophe Galtier en conférence de presse . Et d'ajouter sur le match cette fois: \"Il était important de l'emporter après nos deux dernières contre-performances. J'avais demandé à mes joueurs d'être plus compacts, solidaires et accrocheurs dans la conquête du ballon. J'ai vu beaucoup de compensation et un grand gardien ce soir. On a marqué dans les moments importants. Avec tout le brouhaha autour de Paris et de moi, il était important de l'emporter.\"","pubDate":"2023-04-08 22:09:00","image_url":"https://fyooyzbm.filerobot.com/v7/FOOTBALL+NICE+PSG+PAR+%2829588905%29-oXtNCRhq.jpg?vh=b54625&ci_seal=bfca02492b&p=medium&v2&gravity=auto","source_id":"nicematin","category":["sports"],"country":["france"],"language":"french"},{"title":"Warriors break silence . . . lift the lid on 2019 AFCON debacle","link":"https://www.sundaymail.co.zw/warriors-break-silence-lift-the-lid-on-2019-afcon-debacle","keywords":["Sports","Top Stories"],"creator":["tawandamusarurwa"],"video_url":null,"description":"Petros Kausiyo Sports Editor FOUR years after their forgettable adventure at the Africa Cup of Nations (AFCON) in Egypt, where they hogged the limelight for endless off-field problems and were branded mercenaries by some within the ZIFA leadership, the Warriors have lifted the lid on the debacle that characterised their stay in Cairo. Zimbabwe, then […]","content":"The Sunday Mail FOUR years after their forgettable adventure at the Africa Cup of Nations (AFCON) in Egypt, where they hogged the limelight for endless off-field problems and were branded mercenaries by some within the ZIFA leadership, the Warriors have lifted the lid on the debacle that characterised their stay in Cairo. Zimbabwe, then under history-making coach Sunday Chidzambwa, arrived in Egypt for their fourth dance at the continental soccer showpiece on the back of some solid showings in the qualifiers. They had also excelled in the COSAFA Cup, which they had won back-to-back in 2017 and 2018. However, at AFCON, they were put in a tricky Group A that included hosts Egypt, Uganda and the Democratic Republic of Congo. All hell broke loose on the eve of their opening showdown against the Pharaohs at the Cairo International Stadium following contractual disputes between players and the Felton Kamambo-led ZIFA board. The disputes drew in the Confederation of African Football (CAF), which offered to pay players and later deduct the money from ZIFA’s share of the AFCON proceeds. Ironically, ZIFA were having disputes with the Warriors over money, at a time when Government — through the Warriors fundraising committee — had raised funds to be used by Chidzambwa and his men in Egypt. Kamambo and his ousted colleagues Philemon Machana and Bryton Malandule have, however, steadfastly denied receiving meaningful Government assistance. They insist they only received US$53 000 from the Ministry of Youth, Sport, Arts and Recreation, through the Sports and Recreation Commission (SRC). Players who spoke to The Sunday Mail Sport on condition of anonymity for fear of victimisation by the association indicated that they were made to understand that funding for their AFCON campaign in Egypt was coming from Government. “We are surprised to hear that Government did nothing to assist us in Egypt, when, in fact, it was ZIFA president Kamambo who addressed us and told us that Government had provided funds to meet all our demands as per the contracts,” said one of the players. “We actually had a problem with Malandule, who kept claiming that there was no money, and this created huge tension, resulting in players losing trust in him.” It has also since emerged that apart from Government, China-based striker Nyasha Mushekwi forked out over US$161 000 to pay the squad’s appearance fees for their final group game against DRC. According to their contracts, each of the 23 players who were in Egypt was entitled to US$5 000 in appearance fees and a daily allowance of US$150. Of late, Kamambo, Machana and Malandule have been on a crusade against Youth, Sport, Arts and Recreation Minister Kirsty Coventry over comments she made during a question-and-answer session in Parliament recently. Coventry told the legislators that ZIFA had not accounted for the funds provided to them. “For clarity, the SRC stepped in and suspended the (ZIFA) board for three main reasons. The first was that the Government had given ZIFA about US$2 million that has never been accounted for,” she said. “It wasn’t FIFA money but Zimbabwean money that parliamentarians should want to know where it has gone because it was never accounted for.” However, the trio of Kamambo, Machana and Malandule — with the support of ex-Central Region chairperson Stanley Chapeta and former chief executive officer Joseph Mamutse — have also threatened to sue Minister Coventry for her comments. They contend she misrepresented facts. In their statement read by Machana at a recent press conference, the ousted ZIFA board members also distanced themselves from allegations of sexual abuse. “We note with concern endless, inaccurate, misleading, (and) certainly unsubstantial and outright defamation utterances recently made in Parliament on 29 March by Honourable Minister Coventry during a question-and-answer session,” said Machana. “This is not the first time that the minister has been quoted publicly making such malicious and damaging utterances. She once issued a press statement in 2022, where she alleged the suspended members were sex predators.” The players, however, said they felt abandoned by Kamambo’s executive while in Egypt, hence the endless rows over contracts and appearance fees. “As far as we know, the daily allowances and other payments related to our contracts came from Government and we even had Minister (Kazembe) Kazembe coming to Egypt to try and resolve the serious problems, which were threatening our participation in the tournament. “ZIFA did not also honour the pledge to pay US$500 each for the draw bonus for the game against Uganda. “And it was even worse for the final match because they said there was no money, and Nyasha offered to pay the appearance fees if ZIFA didn’t. “So, when ZIFA failed to pay us in foreign currency and only gave us $7 000 after we came back, all the players had vowed not to play in the qualifiers for the 2021 AFCON. “Nyasha then lived up to his pledge and paid us our allowances.” They also claim that Nyasha and Marvelous Nakamba ended up buying air tickets for some players when they left Egypt. “ZIFA had not paid for air tickets for all of the players yet they had chartered a flight for supporters and councillors,’’ the player said. The national teams’ general manager, Wellington Mpandare, confirmed that, indeed, Mushekwi had bailed out the Warriors for their match against DRC. Just like former captain Knowledge Musona, ex-goalkeepers’ trainer Brenna Msiska and Chidzambwa before him, Mpandare noted that the Cairo debacle had been worsened by poor communication between ZIFA and the players. Chidzambwa, the country’s most successful national coach, told The Sunday Mail Sport in an earlier interview that “when the team was in Egypt, ZIFA deposited some of our dues in foreign currency accounts, but once the team returned home, the balance was paid in local currency at the ratio of one to one’’. He was also reportedly promised a car, which never materialised. This meant that Chidzambwa and his lieutenants, who were owed at least US$14 000 each at the end of the AFCON finals, only received RTGS$14 000 when they had returned home. Mpandare felt that had Government not chipped in with funding, including about US$300 000 that was paid to members of the technical department and the camping fees at the hotel they stayed before moving to the official CAF hotel, the Warriors campaign could have been worse. Such was the intensity of the disputes that Kamambo was forced to withdraw former referee Malandule as head of delegation and dispatched Premier Soccer League chairperson Farai Jere to take over the role. Although he has chosen to be modest about his role, Mushekwi has continued to receive plaudits and respect from fellow players for ensuring that the Warriors remained committed to national duty. They subsequently qualified for the 2021 AFCON in Cairo, Egypt, albeit under Croat Zdravko Logarusic. “A lot of players had been so frustrated and wanted to quit, but Nyasha flew to Zimbabwe and made available our outstanding appearance fees in foreign currency as per the contracts and urged us to continue playing for the country,’’ another player added. Mpandare also had a word of advice for the ousted ZIFA board members, urging them to avoid straining the association’s relationship with the Government. “If they have any queries, I am sure there are better ways of handling this and of engaging with the authorities than to engage in a public spat with the minister,” he said. “Assuming the ZIFA Congress, which recalled them, decides to reinstate them, how will they work with the Government? “I think they should apologise to the President, as the appointing authority, and to the minister for their actions, which are also regrettable at a time when the football family is advocating Government to directly fund the national teams.”","pubDate":"2023-04-08 22:07:21","image_url":null,"source_id":"sundaymail","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"WATCH: Bosso turn focus on DeMbare game","link":"https://www.sundaynews.co.zw/watch-bosso-turn-focus-on-dembare-game/","keywords":["Sports"],"creator":["vusumuzi"],"video_url":null,"description":"Ricky Zililo, Senior Sports Reporter AFTER seeing his charges squander a number of clear-cut chances in their derby against Chicken Inn, Highlanders Football Club coach Baltemar Brito is turning his focus on the epic encounter against Dynamos. The Bulawayo giants, who played a goalless draw against Chicken Inn on Good Friday at Barbourfields Stadium will […]","content":"The Sunday News AFTER seeing his charges squander a number of clear-cut chances in their derby against Chicken Inn, Highlanders Football Club coach Baltemar Brito is turning his focus on the epic encounter against Dynamos. The Bulawayo giants, who played a goalless draw against Chicken Inn on Good Friday at Barbourfields Stadium will play host to Dynamos on Saturday, three days before the two face off again in Independence Cup celebrations in Mount Darwin. Disappointed that his charges were wasteful against Chicken Inn especially in the first-half where striker Lynoth Chikuhwa twice hit the upright after beating the Gamecocks goalie Donovan Bernard, Brito felt that the draw was a fair result. Bosso started the derby on fire, with their playmaker Devine Mhindirira threading a defence-splitting pass to Chikuhwa in the first minute and the striker hit the far post having beaten Bernard. Minutes later, Chikuhwa missed the penalty as he hit the same post with Bernard sent the wrong way. The resultant penalty came after Bosso striker Stanley Ngala was brought down inside the box. Surprisingly, Highlanders goalkeeper Ariel Sibanda who usually takes penalties for his team stayed put at his goal area and watched Chikuhwa miss the spot kick. Highlanders enjoyed first-half dominance which they failed to turn into goals, with Mhindirira shining in the middle of the park, ably supported by Darlington Mukuli and Melikhaya Ncube, while wingbacks Andrew Mbeba and Archiford Faira occasionally overlapped to add numbers to their attacks which came to naught. Chicken Inn came stronger in the second-half, with veteran Tafadzwa Kutinyu dictating pace in the midfield, while Soccer Star of the Year finalist Brian Muza kept Highlanders’ central defenders Peter Muduhwa and Mbongeni Ndlovu on their toes. Chicken Inn found Sibanda resolute in Highlanders’ last line of defence. In his post-match interview, Brito said: “The first-half was one kind of performance and the second one was different. In the end I think the draw was a fair result. I think Chicken Inn didn’t have clear opportunities like we had in the first-half.” “We’re not happy at all that we dropped points, we know that local derbies have too many emotions and are not easy. Our team in the second-half didn’t compete like they did in the first-half. They started to split too much, waiting for the long ball and it gave Chicken Inn more time with the ball. Life goes on, we’ve Dynamos next week Saturday so we should change our focus and prepare for that game.” The draw left Highlanders still unbeaten after four games with eight points, two points behind leaders Caps United who beat Black Rhinos 2-0 on Good Friday. Chicken Inn’s gaffer Prince Matore was equally unhappy that his team dropped points. “We’ve always said that we need to collect maximum points at our home matches, these are two crucial points dropped today. “In the first-half our movement wasn’t what we wanted, our transitions were not what we wanted, and they were rushing everything. Second half, we rectified those things and it was a better second-half,” Matore said. Chicken Inn’s next assignment is another derby against Bulawayo Chiefs who were beaten 2-1 by FC Platinum. Follow on Twitter @ZililoR.","pubDate":"2023-04-08 22:05:29","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"}]}