{"newsArray":[{"article_id":"1481ed7fcb03b2d5a1688d5d6d9fc473","title":"Марсель - Брайтон: де і коли дивитися онлайн матч Ліги Європи 05.10.2023","link":"https://champion.com.ua/football/2023/10/05/940150/marsel-brayton-de-dyvytysya-match-lihy-yevropy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі другого туру Ліги Європи Марсель зіграє з Брайтоном.Підключитися до МегогоМатч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом.Дивитися поєдинок можна на медіасервісі Megogo....","content":"#Брайтон , #Марсель Джерело - Чемпіон . У матчі другого туру Ліги Європи Марсель зіграє з Брайтоном. Підключитися до Мегого Матч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом. Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-10-05 17:46:52","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"52c27f337a0713844fd7c96733242f91","title":"Локомотив Київ - Тростянець 2:1: огляд матчу Другої ліги","link":"https://champion.com.ua/football/2023/10/05/940356/lokomotyv-kyyiv-trostyanets-21-ohlyad-matchu-druhoyi-lihy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Локомотив Київ переграв Тростянець у межах 11-го туру Другої ліги.Чемпіонат України - Друга ліга11 тур, 5 жовтняЛокомотив Київ - Тростянець 2:1 (1:1)Голи:1:0 - 16 Титаренко (пен), 1:1 - 35 Грищенко, 90+2 Бринько✅ Підписуйтесь на наш телеграм-канал, щ...","content":"#Чемпіонат України, Друга ліга , #Локомотив , #Тростянець Джерело - Чемпіон . Локомотив Київ переграв Тростянець у межах 11-го туру Другої ліги. Чемпіонат України - Друга ліга 11 тур, 5 жовтня Локомотив Київ - Тростянець 2:1 (1:1) Голи: 1:0 - 16 Титаренко (пен), 1:1 - 35 Грищенко, 90+2 Бринько ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 17:38:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"08c0791a4d268e89ed79664b6ebfdf29","title":"Ракув - Штурм: де і коли дивитися онлайн матч Ліги Європи 05.10.2023","link":"https://champion.com.ua/football/2023/10/05/940149/rakuv-shturm-de-dyvytysya-match-lihy-yevropy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі другого туру Ліги Європи Ракув Владислава Кочергіна прийме австрійський Штурм.Підключитися до МегогоМатч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом.Дивитися поєдинок можна на медіасервісі Megogo....","content":"#Ракув , #Штурм , #Владислав Кочергін Джерело - Чемпіон . У матчі другого туру Ліги Європи Ракув Владислава Кочергіна прийме австрійський Штурм. Підключитися до Мегого Матч відбудеться у четвер, 5 жовтня . Початок матчу о 19:45 за київським часом. Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-10-05 17:29:21","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"727e2e413faa7a5d1dfd268e88cf7d69","title":"Mel Tucker's lawyer offers 'new evidence' to Michigan State","link":"https://www.postguam.com/sports/nation/mel-tuckers-lawyer-offers-new-evidence-to-michigan-state/article_a7398949-1b21-523f-9462-3f336a356dec.html","keywords":null,"creator":["Field Level Media"],"video_url":null,"description":"Mel Tucker's lawyer offers 'new evidence' to Michigan State","content":"A lawyer for former Michigan State football coach Mel Tucker presented \"new evidence\" to the school Thursday in the form of a 106-page letter. Michigan State fired Tucker last month after an investigation into sexual harassment allegations involving a sexual assault awareness speaker, Brenda Tracy. Attorney Jennifer Z. Belveal sent the letter to the university's interim president, Dr. Teresa Woodruff, and the board of trustees just before an administrative hearing into the misconduct allegations against Tucker began on Thursday morning. The letter claims that Tucker's accuser \"appears to have made a career out of misleading and manipulating people.\" It also says Tracy \"manipulated a key witness\" and \"deleted key evidence\" when she filed her formal complaint against Tucker in December 2022. Tracy's attorney did not respond to a request for comment from ESPN. Tucker, 51, did not attend Thursday's hearing due to an undisclosed medical condition, according to his representatives. At stake for Tucker is the $79 million he had remaining on his contract when the school fired him on Sept. 27. The university said Tucker violated his contract's moral turpitude clause and brought ridicule upon the school with his actions, including what Tracy said was an unwanted phone sex encounter. Tucker was hired in February 2020. The Spartans (2-3, 0-2 Big Ten) have lost all three games since elevating defensive backs coach Harlon Barnett to interim head coach. --Field Level Media","pubDate":"2023-10-05 17:27:49","image_url":"https://bloximages.newyork1.vip.townnews.com/postguam.com/content/tncms/assets/v3/editorial/3/b4/3b4fc70f-78a4-5daf-bf7e-bf7af480f1c3/651ef648be900.image.jpg?resize=300%2C200","source_id":"postguam","source_priority":93374,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"de2522e6a82d281f9c081133393c0dac","title":"Тріпп'єр: Мій син хотів вийти з підтрибунки з Мбаппе, а не мною","link":"https://champion.com.ua/football/2023/10/05/940355/trippyer-miy-syn-khotiv-vyyty-z-pidtrybunky-z-mbappe-a-ne-mnoyu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Син капітана Ньюкасла Кірана Тріпп'єра Джейкоб - великий фанат Кіліана Мбаппе.Про це англієць розповів порталу Sky Sports Premier League.\"Він просто схиблений на Мбаппе, постійно дивиться відеонарізки його моментів на ютубі. Джейкоб хотів вийти з ним...","content":"#Ньюкасл Юнайтед , #Тріпп'єр Джерело - Чемпіон . Син капітана Ньюкасла Кірана Тріпп'єра Джейкоб - великий фанат Кіліана Мбаппе. Про це англієць розповів порталу Sky Sports Premier League. \"Він просто схиблений на Мбаппе, постійно дивиться відеонарізки його моментів на ютубі. Джейкоб хотів вийти з ним, а не мною! Я сказав синові: \"Якщо вийдеш з Мбаппе, то навіть не дивися на мене в підтрибунці\". Ньюкасл - ПСЖ 4:1: огляд матчу Я вже грав проти Кіліана - то був його дебютний матч за Монако, коли я виступав за Тоттенгем. Також я грав проти нього у своєму дебютному матчі за збірну Англії\", - сказав Тріпп'єр. \"I said to him if you get to walk out with him, don't look at me in the tunnel!\" 😤 Not Kieran Trippier's son wanting to switch sides and walk out with Kylian Mbappe instead of his dad 😂 pic.twitter.com/CWbhd3dkVA — Sky Sports Premier League (@SkySportsPL) October 4, 2023 ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 17:17:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"b7131556494b384c52b457e8ed4a8341","title":"COLLEGE FOOTBALL FRENZY: If we had a 12-team NCAA playoff this year, who makes it?","link":"https://calgarysun.com/sports/football/if-we-had-a-12-team-ncaa-playoff-this-year-who-makes-it","keywords":["Football","Sports"],"creator":["Todd Saelhof"],"video_url":null,"description":null,"content":"Let’s pretend it’s next year in the NCAA football world. That makes it the first year of the 12-team playoff — quite the brave new NCAA football world. And where would we all be if we used this year’s first five weeks to fill out this new landscape? Let’s pretend we know. Call this 2023 pick ’em a trial run for breaking out the 2024 bracket. The first few for our dynamite dozen seem to be no-brainers although, if you’re like us, you’re waiting for the Texas two-step to kick in. The No. 3 Texas Longhorns (5-0) are due to lose, right? They’ll drop some game, some time soon. Perhaps that comes as early as this Saturday, when the Red River Rivalry/Showdown/Shootout takes to the streets of Big D. That’s Texas versus the No. 12 Oklahoma Sooners (5-0) in Week 6 early action at the Cotton Bowl in Dallas (noon ET, ABC). Even if it isn’t this week, we like the Longhorns to boot one — at least one at some point — and fumble away an unbeaten season and a likely a top-four finish to catch the coveted bye in the first round of the make-believe 12-team College Football Playoff. Our feeling is the reigning two-time national champs — the No. 1 Georgia Bulldogs (5-0) will go unbeaten again to reach the top four. The same goes for one of the two Big Ten giants — the No. 2 Michigan Wolverines (5-0) or the No. 4 Ohio State Buckeyes (4-0). You know we’re leaning Michigan to make that happen, mainly because Ohio State is Ohio State. Joining Georgia and Michigan in the top four, though? If the No. 10 Notre Dame Fighting Irish (5-1) run the gauntlet — a massive challenge given they visit the No. 24 Louisville Cardinals (5-0) late Saturday (7:30 p.m. ET, ABC) and host the No. 9 USC Trojans (5-0) next week — they deserve a top-four slot. And the other comes — fittingly — from the Pac-12 in its final version of itself. So much to choose from, but it comes down to the USC/No. 7 Washington Huskies (5-0) tilt in early November in SoCal. The winner — we’ll say USC with the Lincoln Riley factor — would get our vote, unbeaten or not by season’s end. So with Georgia, Michigan, Notre Dame and USC getting the first-round byes in the 12-team playoff, how do the next eight greats shake out for our bracket? • Big 12 — Texas and Oklahoma • ACC — No. 5 Florida State Seminoles (5-0) • Big Ten — Ohio State • Pac-12 — Washington, No. 8 Oregon Ducks (5-0) • SEC — No. 11 Alabama Crimson Tide (4-1) • Group of Five — No. 24 Fresno State Bulldogs (5-0) Let’s give QB Drew Allar another year to push No. 6 Penn State (5-0) into the playoff. Plus, if the Big Ten’s proposed dissolution of divisions takes effect in 2024, PSU gets out from behind both Michigan and Ohio State to make hay … That Group of Five top-12 spot is interesting. Marshall (4-0) has a tough, but doable schedule to make noise, although hosting James Madison (5-0) — the other Sun Belt unbeaten — later this month will decide a lot. Air Force (5-0) has a flightpath to be in our make-shift 12-team bracket, too, although Mountain West rival Fresno State already has the better resumé. Liberty (4-0) is the only other unbeaten Group of Fiver and Tulane (4-1) tops the one-loss GOF contenders … The other Power Five unbeatens? No. 14 North Carolina (4-0), No. 17 Miami (4-0), No. 20 Kentucky (5-0), No. 21 Missouri (5-0) and unranked Maryland (5-0), which could give Ohio State trouble early Saturday at The Horseshoe (noon ET, FOX). After all, QB Taulia Tagovailoa is a gamer for Maryland, with nearly 1,500 yards and 13 passing TDs to put him among the nation’s elite pivots … At the other end of the standings, the winless FBS teams — only four — are Virginia (0-5), UConn (0-5), Nevada (0-5) and newcomer Sam Houston (0-4). It’s only the third time in 22 editions of Red River Rivalry/Showdown/Shootout that both Texas and Oklahoma are 5-0 heading into the tilt. Should be a good one, but anything would be after last year’s 49-0 beatdown by Texas … A two-loss No. 23 LSU (3-2) does not belong in the AP Top 25. Not with 22 unbeaten teams out here and a handful of them lower than No. 25 in the rankings. Think Kentucky (5-0), which hosts No. 1 Georgia (5-0) late Saturday (7 p.m. ET) … No. 11 Alabama (4-1) best be careful against host Texas A&M (4-1) in its matinee (3:30 p.m. ET, CBS), since A&M always plays its powerhouse rival well under embattled coach Jimbo Fisher and ’Bama QB Jalen Milroe might be dealing with a hamstring injury … Is it just us or is Nebraska (2-3), which visits Illinois (2-3) on Friday (8 p.m. ET), getting further away from returning to legitimacy? Didn’t think it was just us. How about adding injury to insult where deflated No. 19 Duke (4-1) is concerned? In an effort to lead his team back late in that emotional Week 5 loss to Notre Dame, QB Riley Leonard — a legit Heisman Trophy contender — suffered a high-ankle sprain and is out for a few weeks … Iowa (4-1), hosting Purdue (2-3) on Saturday afternoon (3:30 p.m. ET), has suffered a big hit to its barely functioning offence with QB Cade McNamara taking a knee for the rest of the season. The transfer from Michigan is gone with a torn ACL … Colorado (3-2), which heads to Arizona State (1-4) on Saturday (6:30 p.m. ET), is without two-way star Travis Hunter for at least two more weeks with a lacerated liver. Ouch! … Disgraced coach Mel Tucker and his lawyers are still putting up a fight against Sparty, having filed a letter alleging new evidence in his case with Michigan State in the days after his dismissal by the school … One of the best additions to ESPN College GameDay is Pat McAfee’s field-goal kicking contest, as the fantastic analyst proves it’s no easy feat — or is that feet? — to boot a three-pointer. Plus it’s a ton of fun to watch college fans try to win thousands of dollars while taking pointers — and getting ridiculed — by the GameDay team. Entertaining stuff. Rank Team (last week) Record 1. Georgia (1) 5-0 2. Michigan (2) 5-0 3. Texas (3) 5-0 4. Ohio State (4) 4-0 5. Florida State (5) 4-0 6. Penn State (6) 5-0 7. Washington (7) 5-0 8. Oregon (9) 5-0 9. USC (8) 5-0 10. Notre Dame (11) 5-1 11. Alabama (12) 4-1 12. Oklahoma (14) 5-0 13. Washington State (16) 4-0 14. North Carolina (15) 4-0 15. Oregon State (19) 4-1 16. Ole Miss (20) 4-1 17. Miami (18) 4-0 18. Utah (10) 4-1 19. Duke (17) 4-1 20. Kentucky (NR) 5-0 21. Missouri (23) 5-0 22. Tennessee (21) 4-1 23. LSU (13) 3-2 24. Fresno State (25) 5-0 25. Louisville (NR) 5-0 NR — not ranked Saturday, noon ET, in Dallas, ABC/TSN3 Seems like the underdog always wins the Red River Rivalry/Showdown/Shootout. PICK: OKLAHOMA Saturday, 3:30 p.m. ET, CBS Alabama in a pick ’em? End of day, ’Bama’s still ’Bama, but watch QB Milroe’s status. PICK: ALABAMA Saturday, 6:30 p.m. ET Back drinking Coach Prime’s Kool-Aid as Buffs bounce back from two losses. PICK: COLORADO Saturday, 7:30 p.m. ET, ABC Notre Dame won’t wait until the final minutes to take care of over-its-head Louisville. PICK: NOTRE DAME tsaelhof@postmedia.com http://www.twitter.com/ToddSaelhofPM","pubDate":"2023-10-05 17:15:44","image_url":null,"source_id":"calgarysun","source_priority":193932,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"92a33711d4ea051b0a2e2faceec2e861","title":"Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events","link":"https://www.dailymail.co.uk/sport/nfl/article-12598671/Kansas-City-Chiefs-reveal-stunning-custom-wrapped-YACHT-dock-Frankfurt-NFL-Germany-game-month-ChampionShip-set-host-fan-watch-party-VIP-events.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The boat will float less than 1,000 feet from the Eiserner Steg (Iron Footbridge) on the Main River before the Chiefs-Dolphins game at Deutsche Bank Park on November 5.","content":"Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events The Chiefs will be playing the Dolphins at Deutsche Bank Park on November 4 Germany is the latest country to host an NFL game after the UK, Mexico & Japan DailyMail.com provides all the latest international sports news By Alastair Talbot For Dailymail.Com Published: 17:47 BST, 5 October 2023 | Updated: 18:14 BST, 5 October 2023 e-mail View comments The Kansas City Chiefs have revealed a stunning custom-wrapped yacht that will be docked in Frankfurt for the NFL's game in Germany next month, with 'ChampionShip' set to host fans with a watch party and VIP events. The boat will float less than 1,000 feet from the Eiserner Steg (Iron Footbridge) on the Main River before the Chiefs-Dolphins game at Deutsche Bank Park on November 5. All three of the Chiefs' Super Bowl titles will also be on board the vessel, which will be open to the public on Friday, November 3 and Saturday, November 4, according to Fox 4 Kansas City . Tickets will be on sale starting on Tuesday, October 17 at 7 a.m. Fans can look forward to several events on board Kansas City's yacht, including 'Their Draft Moment', which consists of holding up a Chiefs jersey like they had just made the team's roster after coming through the ranks of college football. A yacht in honor of the Chiefs called 'ChampionSHIP' will be in Frankfurt, Germany, next month Fans will get a chance to lift the Vince Lombardi Trophy given to players during Super Bowl LVII Another fun activity on the ship is called 'The Catch', which involves having your photo taken as if you're catching a touchdown pass from quarterback Patrick Mahomes. 'Locker Room Ready' will see fans have their own replica lockers like the players have at Arrowhead Stadium. 'Postgame Press Conference': Step up to the podium and say 'Time's yours', like Andy Reid. Frankfurt will be the third German City to host an NFL game next month after Munich & Berlin Deutsche Bank Park - home of Eintracht Frankfurt - will host Chiefs-Dolphins on November 5 Fans will also get a shot to be snapped with the Super Bowl LVII trophy that players lifted in Arizona this past February. They will get a chance to pose for pictures in front of Frankfurt's skyline too. Chiefs Hall of Fame members Christian Okoye and and Dante Hall will be on board the vessel in Hesse to hold meet-and-greet sessions with fans. Germany is the latest country to host an NFL game abroad in recent years. Previous destinations include London, Mexico City, Monterrey and Tokyo. Regular season games were held in Munich and Berlin last year. Share or comment on this article: Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-05 17:14:29","image_url":"https://i.dailymail.co.uk/1s/2023/10/05/18/76215771-0-image-a-8_1696526003052.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"07f9d86c8453cb5cfe0c350ba443d5f5","title":"Астана - Вікторія Пльзень 1:2: огляд матчу Ліги конференцій","link":"https://champion.com.ua/football/2023/10/05/940354/astana-viktoriya-plzen-12-ohlyad-matchu-lihy-konferentsiy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Вікторія Пльзень здобула мінімальну перемогу над Астаною в межах 2-го туру групового етапу Ліги конференцій УЄФА.Ліга конференцій УЄФА2 тур, 5 жовтняАстана - Вікторія Пльзень 1:2 (0:0)Голи:1:0 - 51 Томасов, 1:1 - 54 Хори, 1:2 - 57 Калвах✅ Підписуйтес...","content":"#Астана , #Вікторія , #Ліга конференцій Джерело - Чемпіон . Вікторія Пльзень здобула мінімальну перемогу над Астаною в межах 2-го туру групового етапу Ліги конференцій УЄФА. Ліга конференцій УЄФА 2 тур, 5 жовтня Астана - Вікторія Пльзень 1:2 (0:0) Голи: 1:0 - 51 Томасов, 1:1 - 54 Хори, 1:2 - 57 Калвах ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 16:58:46","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"f3dce78a344d0440883e9158a8ff5796","title":"NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors","link":"https://www.dailymail.co.uk/sport/nfl/article-12598199/NFL-asks-TV-networks-air-Taylor-Swifts-Eras-Tour-movie-promo-FREE-games-continues-lean-Travis-Kelce-romance-rumors.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TV executives are wondering if the NFL's goal with Swift is to have her perform at the Super Bowl halftime show in February, but Usher has already been chose as the event's main act.","content":"NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors Sources told The New York Post that costs for ad time was all taken care of Even Kelce came out saying the NFL regular coverage of Swift on TV is too much DailyMail.com provides all the latest international sports news By Alastair Talbot For Dailymail.Com Published: 16:17, 5 October 2023 | Updated: 17:56, 5 October 2023 e-mail 51 shares 17 View comments The NFL has asked several national TV networks, including NBC, ESPN, Fox and CBS, to show promos for Taylor Swift 's upcoming movie for free, according to The New York Post . ESPN and NBC agreed to fulfill the league's request by showing promos for Swift's movie before the start of their pregame shows this past Sunday and Monday. ESPN also played content related to Swift's movie during 'Sunday NFL Countdown' and 'Monday NFL Countdown'. NBC's free promo came on TV during its pregame show, 'Football Night in America', before cameras focused on Swift, who attended Chiefs-Jets to watch her new beau, Travis Kelce . Another Swift commercial was aired during Sunday night's game on NBC. The NFL asked TV networks to air ads for Taylor Swift’s 'Eras' Tour movie ahead of its release An ad for Swift's 'Eras' Tour movie shown on TV during the Chiefs-Jets broadcast on NBC Sources told The Post that costs for ad time was all taken care of. These 30-second commercial slots tend to come with a six-figure price tag for 'Sunday Night Football' games. Swift was spotted at MetLife Stadium with pals Blake Lively, Ryan Reynolds and Hugh Jackman, Sunday. Shots of all four celebs were regularly shown on NBC's coverage of the game. Fox nor CBS displayed promos for Swift's movie last week. The Chiefs-Jets game wasn't aired on either channel. CBS will show Chiefs-Vikings at 4.25 p.m. on Sunday. Amazon, which has a relationship with Swift through Amazon Music, will show the Chiefs taking on the Denver Broncos on the next edition of its 'Thursday Night Football' show on October 12. A day later, the 'Taylor Swift: The Eras Tour' concert movie will be out in theaters. However, many TV executives are starting to wonder what is the end goal with pushing Swift-related content during football games. She is one of the biggest pop stars worldwide and is having a huge impact on TV ratings. Close to 27million viewers turned it to watch Chief-Jets on NBC, with the channel showing Swift at the game at least 17 times. Even Kelce said it was too much after the game. Even Swift's new beau, Travis Kelce, said the NFL airing the singer's content was too much The 'Taylor Swift: The Eras Tour' concert movie will be out in theaters this month on October 13 The NFL's female teen audience increased by 40,000 from the previous week's Steelers-Raiders game on Sunday, September 24. TV execs are questioning if the NFL's goal with Swift is to have her perform on the Super Bowl halftime show, but Usher has already been chosen as the event's main act. Sponsorship may be another reason why the league didn't go after Swift for arguably its biggest game of each season. Swift has a deal in place with Diet Coke while the Super Bowl halftime show is mainly sponsored by Pepsi. The singer and the event do share Apple Music as a common sponsor, however. The NFL has also been heavily promoting Swift-related content to attract her fans to games. The 'You Belong With Me' hitmaker featured on the league's social handles, noting in its bios the Chiefs are '2-0 as swifties' and writing, 'NFL (Taylor Version). Share or comment on this article: NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors e-mail 51 shares Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-05 16:56:14","image_url":"https://i.dailymail.co.uk/1s/2023/10/05/17/76215391-0-image-a-3_1696524970887.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"44a2f58d469616054bcde4f8e4fd3e4e","title":"«Барселона» и «Реал» заинтересованы в вингере «Баварии» Сане","link":"https://www.sport-express.ru/football/transfers/news/barselona-i-real-zainteresovany-v-vingere-bavarii-sane-2130485/","keywords":["Футбол - Трансферы"],"creator":null,"video_url":null,"description":"Полузащитник «Баварии» Лерой Сане заинтересован «Барселону» и «Реал».","content":"Полузащитник «Баварии» Лерой Сане заинтересован «Барселону» и «Реал», сообщает Bild. Контракт 27-летнего немца с мюнхенцами истекает в конце следующего сезона, но он все еще не получил предложение с новым соглашением. Сане планирует обдумать свое будущее в конце сезона. В текущем сезоне вингер забил 6 голов в 10 матчах за «Баварию». Он выступает за немецкий клуб с 2020 года. Портал Transfermarkt оценивает стоимость Сане в 65 миллионов евро.","pubDate":"2023-10-05 16:53:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"1481ed7fcb03b2d5a1688d5d6d9fc473","title":"Марсель - Брайтон: де і коли дивитися онлайн матч Ліги Європи 05.10.2023","link":"https://champion.com.ua/football/2023/10/05/940150/marsel-brayton-de-dyvytysya-match-lihy-yevropy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі другого туру Ліги Європи Марсель зіграє з Брайтоном.Підключитися до МегогоМатч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом.Дивитися поєдинок можна на медіасервісі Megogo....","content":"#Брайтон , #Марсель Джерело - Чемпіон . У матчі другого туру Ліги Європи Марсель зіграє з Брайтоном. Підключитися до Мегого Матч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом. Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-10-05 17:46:52","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"52c27f337a0713844fd7c96733242f91","title":"Локомотив Київ - Тростянець 2:1: огляд матчу Другої ліги","link":"https://champion.com.ua/football/2023/10/05/940356/lokomotyv-kyyiv-trostyanets-21-ohlyad-matchu-druhoyi-lihy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Локомотив Київ переграв Тростянець у межах 11-го туру Другої ліги.Чемпіонат України - Друга ліга11 тур, 5 жовтняЛокомотив Київ - Тростянець 2:1 (1:1)Голи:1:0 - 16 Титаренко (пен), 1:1 - 35 Грищенко, 90+2 Бринько✅ Підписуйтесь на наш телеграм-канал, щ...","content":"#Чемпіонат України, Друга ліга , #Локомотив , #Тростянець Джерело - Чемпіон . Локомотив Київ переграв Тростянець у межах 11-го туру Другої ліги. Чемпіонат України - Друга ліга 11 тур, 5 жовтня Локомотив Київ - Тростянець 2:1 (1:1) Голи: 1:0 - 16 Титаренко (пен), 1:1 - 35 Грищенко, 90+2 Бринько ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 17:38:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"08c0791a4d268e89ed79664b6ebfdf29","title":"Ракув - Штурм: де і коли дивитися онлайн матч Ліги Європи 05.10.2023","link":"https://champion.com.ua/football/2023/10/05/940149/rakuv-shturm-de-dyvytysya-match-lihy-yevropy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі другого туру Ліги Європи Ракув Владислава Кочергіна прийме австрійський Штурм.Підключитися до МегогоМатч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом.Дивитися поєдинок можна на медіасервісі Megogo....","content":"#Ракув , #Штурм , #Владислав Кочергін Джерело - Чемпіон . У матчі другого туру Ліги Європи Ракув Владислава Кочергіна прийме австрійський Штурм. Підключитися до Мегого Матч відбудеться у четвер, 5 жовтня . Початок матчу о 19:45 за київським часом. Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-10-05 17:29:21","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"727e2e413faa7a5d1dfd268e88cf7d69","title":"Mel Tucker's lawyer offers 'new evidence' to Michigan State","link":"https://www.postguam.com/sports/nation/mel-tuckers-lawyer-offers-new-evidence-to-michigan-state/article_a7398949-1b21-523f-9462-3f336a356dec.html","keywords":null,"creator":["Field Level Media"],"video_url":null,"description":"Mel Tucker's lawyer offers 'new evidence' to Michigan State","content":"A lawyer for former Michigan State football coach Mel Tucker presented \"new evidence\" to the school Thursday in the form of a 106-page letter. Michigan State fired Tucker last month after an investigation into sexual harassment allegations involving a sexual assault awareness speaker, Brenda Tracy. Attorney Jennifer Z. Belveal sent the letter to the university's interim president, Dr. Teresa Woodruff, and the board of trustees just before an administrative hearing into the misconduct allegations against Tucker began on Thursday morning. The letter claims that Tucker's accuser \"appears to have made a career out of misleading and manipulating people.\" It also says Tracy \"manipulated a key witness\" and \"deleted key evidence\" when she filed her formal complaint against Tucker in December 2022. Tracy's attorney did not respond to a request for comment from ESPN. Tucker, 51, did not attend Thursday's hearing due to an undisclosed medical condition, according to his representatives. At stake for Tucker is the $79 million he had remaining on his contract when the school fired him on Sept. 27. The university said Tucker violated his contract's moral turpitude clause and brought ridicule upon the school with his actions, including what Tracy said was an unwanted phone sex encounter. Tucker was hired in February 2020. The Spartans (2-3, 0-2 Big Ten) have lost all three games since elevating defensive backs coach Harlon Barnett to interim head coach. --Field Level Media","pubDate":"2023-10-05 17:27:49","image_url":"https://bloximages.newyork1.vip.townnews.com/postguam.com/content/tncms/assets/v3/editorial/3/b4/3b4fc70f-78a4-5daf-bf7e-bf7af480f1c3/651ef648be900.image.jpg?resize=300%2C200","source_id":"postguam","source_priority":93374,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"de2522e6a82d281f9c081133393c0dac","title":"Тріпп'єр: Мій син хотів вийти з підтрибунки з Мбаппе, а не мною","link":"https://champion.com.ua/football/2023/10/05/940355/trippyer-miy-syn-khotiv-vyyty-z-pidtrybunky-z-mbappe-a-ne-mnoyu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Син капітана Ньюкасла Кірана Тріпп'єра Джейкоб - великий фанат Кіліана Мбаппе.Про це англієць розповів порталу Sky Sports Premier League.\"Він просто схиблений на Мбаппе, постійно дивиться відеонарізки його моментів на ютубі. Джейкоб хотів вийти з ним...","content":"#Ньюкасл Юнайтед , #Тріпп'єр Джерело - Чемпіон . Син капітана Ньюкасла Кірана Тріпп'єра Джейкоб - великий фанат Кіліана Мбаппе. Про це англієць розповів порталу Sky Sports Premier League. \"Він просто схиблений на Мбаппе, постійно дивиться відеонарізки його моментів на ютубі. Джейкоб хотів вийти з ним, а не мною! Я сказав синові: \"Якщо вийдеш з Мбаппе, то навіть не дивися на мене в підтрибунці\". Ньюкасл - ПСЖ 4:1: огляд матчу Я вже грав проти Кіліана - то був його дебютний матч за Монако, коли я виступав за Тоттенгем. Також я грав проти нього у своєму дебютному матчі за збірну Англії\", - сказав Тріпп'єр. \"I said to him if you get to walk out with him, don't look at me in the tunnel!\" 😤 Not Kieran Trippier's son wanting to switch sides and walk out with Kylian Mbappe instead of his dad 😂 pic.twitter.com/CWbhd3dkVA — Sky Sports Premier League (@SkySportsPL) October 4, 2023 ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 17:17:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"b7131556494b384c52b457e8ed4a8341","title":"COLLEGE FOOTBALL FRENZY: If we had a 12-team NCAA playoff this year, who makes it?","link":"https://calgarysun.com/sports/football/if-we-had-a-12-team-ncaa-playoff-this-year-who-makes-it","keywords":["Football","Sports"],"creator":["Todd Saelhof"],"video_url":null,"description":null,"content":"Let’s pretend it’s next year in the NCAA football world. That makes it the first year of the 12-team playoff — quite the brave new NCAA football world. And where would we all be if we used this year’s first five weeks to fill out this new landscape? Let’s pretend we know. Call this 2023 pick ’em a trial run for breaking out the 2024 bracket. The first few for our dynamite dozen seem to be no-brainers although, if you’re like us, you’re waiting for the Texas two-step to kick in. The No. 3 Texas Longhorns (5-0) are due to lose, right? They’ll drop some game, some time soon. Perhaps that comes as early as this Saturday, when the Red River Rivalry/Showdown/Shootout takes to the streets of Big D. That’s Texas versus the No. 12 Oklahoma Sooners (5-0) in Week 6 early action at the Cotton Bowl in Dallas (noon ET, ABC). Even if it isn’t this week, we like the Longhorns to boot one — at least one at some point — and fumble away an unbeaten season and a likely a top-four finish to catch the coveted bye in the first round of the make-believe 12-team College Football Playoff. Our feeling is the reigning two-time national champs — the No. 1 Georgia Bulldogs (5-0) will go unbeaten again to reach the top four. The same goes for one of the two Big Ten giants — the No. 2 Michigan Wolverines (5-0) or the No. 4 Ohio State Buckeyes (4-0). You know we’re leaning Michigan to make that happen, mainly because Ohio State is Ohio State. Joining Georgia and Michigan in the top four, though? If the No. 10 Notre Dame Fighting Irish (5-1) run the gauntlet — a massive challenge given they visit the No. 24 Louisville Cardinals (5-0) late Saturday (7:30 p.m. ET, ABC) and host the No. 9 USC Trojans (5-0) next week — they deserve a top-four slot. And the other comes — fittingly — from the Pac-12 in its final version of itself. So much to choose from, but it comes down to the USC/No. 7 Washington Huskies (5-0) tilt in early November in SoCal. The winner — we’ll say USC with the Lincoln Riley factor — would get our vote, unbeaten or not by season’s end. So with Georgia, Michigan, Notre Dame and USC getting the first-round byes in the 12-team playoff, how do the next eight greats shake out for our bracket? • Big 12 — Texas and Oklahoma • ACC — No. 5 Florida State Seminoles (5-0) • Big Ten — Ohio State • Pac-12 — Washington, No. 8 Oregon Ducks (5-0) • SEC — No. 11 Alabama Crimson Tide (4-1) • Group of Five — No. 24 Fresno State Bulldogs (5-0) Let’s give QB Drew Allar another year to push No. 6 Penn State (5-0) into the playoff. Plus, if the Big Ten’s proposed dissolution of divisions takes effect in 2024, PSU gets out from behind both Michigan and Ohio State to make hay … That Group of Five top-12 spot is interesting. Marshall (4-0) has a tough, but doable schedule to make noise, although hosting James Madison (5-0) — the other Sun Belt unbeaten — later this month will decide a lot. Air Force (5-0) has a flightpath to be in our make-shift 12-team bracket, too, although Mountain West rival Fresno State already has the better resumé. Liberty (4-0) is the only other unbeaten Group of Fiver and Tulane (4-1) tops the one-loss GOF contenders … The other Power Five unbeatens? No. 14 North Carolina (4-0), No. 17 Miami (4-0), No. 20 Kentucky (5-0), No. 21 Missouri (5-0) and unranked Maryland (5-0), which could give Ohio State trouble early Saturday at The Horseshoe (noon ET, FOX). After all, QB Taulia Tagovailoa is a gamer for Maryland, with nearly 1,500 yards and 13 passing TDs to put him among the nation’s elite pivots … At the other end of the standings, the winless FBS teams — only four — are Virginia (0-5), UConn (0-5), Nevada (0-5) and newcomer Sam Houston (0-4). It’s only the third time in 22 editions of Red River Rivalry/Showdown/Shootout that both Texas and Oklahoma are 5-0 heading into the tilt. Should be a good one, but anything would be after last year’s 49-0 beatdown by Texas … A two-loss No. 23 LSU (3-2) does not belong in the AP Top 25. Not with 22 unbeaten teams out here and a handful of them lower than No. 25 in the rankings. Think Kentucky (5-0), which hosts No. 1 Georgia (5-0) late Saturday (7 p.m. ET) … No. 11 Alabama (4-1) best be careful against host Texas A&M (4-1) in its matinee (3:30 p.m. ET, CBS), since A&M always plays its powerhouse rival well under embattled coach Jimbo Fisher and ’Bama QB Jalen Milroe might be dealing with a hamstring injury … Is it just us or is Nebraska (2-3), which visits Illinois (2-3) on Friday (8 p.m. ET), getting further away from returning to legitimacy? Didn’t think it was just us. How about adding injury to insult where deflated No. 19 Duke (4-1) is concerned? In an effort to lead his team back late in that emotional Week 5 loss to Notre Dame, QB Riley Leonard — a legit Heisman Trophy contender — suffered a high-ankle sprain and is out for a few weeks … Iowa (4-1), hosting Purdue (2-3) on Saturday afternoon (3:30 p.m. ET), has suffered a big hit to its barely functioning offence with QB Cade McNamara taking a knee for the rest of the season. The transfer from Michigan is gone with a torn ACL … Colorado (3-2), which heads to Arizona State (1-4) on Saturday (6:30 p.m. ET), is without two-way star Travis Hunter for at least two more weeks with a lacerated liver. Ouch! … Disgraced coach Mel Tucker and his lawyers are still putting up a fight against Sparty, having filed a letter alleging new evidence in his case with Michigan State in the days after his dismissal by the school … One of the best additions to ESPN College GameDay is Pat McAfee’s field-goal kicking contest, as the fantastic analyst proves it’s no easy feat — or is that feet? — to boot a three-pointer. Plus it’s a ton of fun to watch college fans try to win thousands of dollars while taking pointers — and getting ridiculed — by the GameDay team. Entertaining stuff. Rank Team (last week) Record 1. Georgia (1) 5-0 2. Michigan (2) 5-0 3. Texas (3) 5-0 4. Ohio State (4) 4-0 5. Florida State (5) 4-0 6. Penn State (6) 5-0 7. Washington (7) 5-0 8. Oregon (9) 5-0 9. USC (8) 5-0 10. Notre Dame (11) 5-1 11. Alabama (12) 4-1 12. Oklahoma (14) 5-0 13. Washington State (16) 4-0 14. North Carolina (15) 4-0 15. Oregon State (19) 4-1 16. Ole Miss (20) 4-1 17. Miami (18) 4-0 18. Utah (10) 4-1 19. Duke (17) 4-1 20. Kentucky (NR) 5-0 21. Missouri (23) 5-0 22. Tennessee (21) 4-1 23. LSU (13) 3-2 24. Fresno State (25) 5-0 25. Louisville (NR) 5-0 NR — not ranked Saturday, noon ET, in Dallas, ABC/TSN3 Seems like the underdog always wins the Red River Rivalry/Showdown/Shootout. PICK: OKLAHOMA Saturday, 3:30 p.m. ET, CBS Alabama in a pick ’em? End of day, ’Bama’s still ’Bama, but watch QB Milroe’s status. PICK: ALABAMA Saturday, 6:30 p.m. ET Back drinking Coach Prime’s Kool-Aid as Buffs bounce back from two losses. PICK: COLORADO Saturday, 7:30 p.m. ET, ABC Notre Dame won’t wait until the final minutes to take care of over-its-head Louisville. PICK: NOTRE DAME tsaelhof@postmedia.com http://www.twitter.com/ToddSaelhofPM","pubDate":"2023-10-05 17:15:44","image_url":null,"source_id":"calgarysun","source_priority":193932,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"92a33711d4ea051b0a2e2faceec2e861","title":"Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events","link":"https://www.dailymail.co.uk/sport/nfl/article-12598671/Kansas-City-Chiefs-reveal-stunning-custom-wrapped-YACHT-dock-Frankfurt-NFL-Germany-game-month-ChampionShip-set-host-fan-watch-party-VIP-events.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The boat will float less than 1,000 feet from the Eiserner Steg (Iron Footbridge) on the Main River before the Chiefs-Dolphins game at Deutsche Bank Park on November 5.","content":"Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events The Chiefs will be playing the Dolphins at Deutsche Bank Park on November 4 Germany is the latest country to host an NFL game after the UK, Mexico & Japan DailyMail.com provides all the latest international sports news By Alastair Talbot For Dailymail.Com Published: 17:47 BST, 5 October 2023 | Updated: 18:14 BST, 5 October 2023 e-mail View comments The Kansas City Chiefs have revealed a stunning custom-wrapped yacht that will be docked in Frankfurt for the NFL's game in Germany next month, with 'ChampionShip' set to host fans with a watch party and VIP events. The boat will float less than 1,000 feet from the Eiserner Steg (Iron Footbridge) on the Main River before the Chiefs-Dolphins game at Deutsche Bank Park on November 5. All three of the Chiefs' Super Bowl titles will also be on board the vessel, which will be open to the public on Friday, November 3 and Saturday, November 4, according to Fox 4 Kansas City . Tickets will be on sale starting on Tuesday, October 17 at 7 a.m. Fans can look forward to several events on board Kansas City's yacht, including 'Their Draft Moment', which consists of holding up a Chiefs jersey like they had just made the team's roster after coming through the ranks of college football. A yacht in honor of the Chiefs called 'ChampionSHIP' will be in Frankfurt, Germany, next month Fans will get a chance to lift the Vince Lombardi Trophy given to players during Super Bowl LVII Another fun activity on the ship is called 'The Catch', which involves having your photo taken as if you're catching a touchdown pass from quarterback Patrick Mahomes. 'Locker Room Ready' will see fans have their own replica lockers like the players have at Arrowhead Stadium. 'Postgame Press Conference': Step up to the podium and say 'Time's yours', like Andy Reid. Frankfurt will be the third German City to host an NFL game next month after Munich & Berlin Deutsche Bank Park - home of Eintracht Frankfurt - will host Chiefs-Dolphins on November 5 Fans will also get a shot to be snapped with the Super Bowl LVII trophy that players lifted in Arizona this past February. They will get a chance to pose for pictures in front of Frankfurt's skyline too. Chiefs Hall of Fame members Christian Okoye and and Dante Hall will be on board the vessel in Hesse to hold meet-and-greet sessions with fans. Germany is the latest country to host an NFL game abroad in recent years. Previous destinations include London, Mexico City, Monterrey and Tokyo. Regular season games were held in Munich and Berlin last year. Share or comment on this article: Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-05 17:14:29","image_url":"https://i.dailymail.co.uk/1s/2023/10/05/18/76215771-0-image-a-8_1696526003052.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"07f9d86c8453cb5cfe0c350ba443d5f5","title":"Астана - Вікторія Пльзень 1:2: огляд матчу Ліги конференцій","link":"https://champion.com.ua/football/2023/10/05/940354/astana-viktoriya-plzen-12-ohlyad-matchu-lihy-konferentsiy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Вікторія Пльзень здобула мінімальну перемогу над Астаною в межах 2-го туру групового етапу Ліги конференцій УЄФА.Ліга конференцій УЄФА2 тур, 5 жовтняАстана - Вікторія Пльзень 1:2 (0:0)Голи:1:0 - 51 Томасов, 1:1 - 54 Хори, 1:2 - 57 Калвах✅ Підписуйтес...","content":"#Астана , #Вікторія , #Ліга конференцій Джерело - Чемпіон . Вікторія Пльзень здобула мінімальну перемогу над Астаною в межах 2-го туру групового етапу Ліги конференцій УЄФА. Ліга конференцій УЄФА 2 тур, 5 жовтня Астана - Вікторія Пльзень 1:2 (0:0) Голи: 1:0 - 51 Томасов, 1:1 - 54 Хори, 1:2 - 57 Калвах ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 16:58:46","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"f3dce78a344d0440883e9158a8ff5796","title":"NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors","link":"https://www.dailymail.co.uk/sport/nfl/article-12598199/NFL-asks-TV-networks-air-Taylor-Swifts-Eras-Tour-movie-promo-FREE-games-continues-lean-Travis-Kelce-romance-rumors.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TV executives are wondering if the NFL's goal with Swift is to have her perform at the Super Bowl halftime show in February, but Usher has already been chose as the event's main act.","content":"NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors Sources told The New York Post that costs for ad time was all taken care of Even Kelce came out saying the NFL regular coverage of Swift on TV is too much DailyMail.com provides all the latest international sports news By Alastair Talbot For Dailymail.Com Published: 16:17, 5 October 2023 | Updated: 17:56, 5 October 2023 e-mail 51 shares 17 View comments The NFL has asked several national TV networks, including NBC, ESPN, Fox and CBS, to show promos for Taylor Swift 's upcoming movie for free, according to The New York Post . ESPN and NBC agreed to fulfill the league's request by showing promos for Swift's movie before the start of their pregame shows this past Sunday and Monday. ESPN also played content related to Swift's movie during 'Sunday NFL Countdown' and 'Monday NFL Countdown'. NBC's free promo came on TV during its pregame show, 'Football Night in America', before cameras focused on Swift, who attended Chiefs-Jets to watch her new beau, Travis Kelce . Another Swift commercial was aired during Sunday night's game on NBC. The NFL asked TV networks to air ads for Taylor Swift’s 'Eras' Tour movie ahead of its release An ad for Swift's 'Eras' Tour movie shown on TV during the Chiefs-Jets broadcast on NBC Sources told The Post that costs for ad time was all taken care of. These 30-second commercial slots tend to come with a six-figure price tag for 'Sunday Night Football' games. Swift was spotted at MetLife Stadium with pals Blake Lively, Ryan Reynolds and Hugh Jackman, Sunday. Shots of all four celebs were regularly shown on NBC's coverage of the game. Fox nor CBS displayed promos for Swift's movie last week. The Chiefs-Jets game wasn't aired on either channel. CBS will show Chiefs-Vikings at 4.25 p.m. on Sunday. Amazon, which has a relationship with Swift through Amazon Music, will show the Chiefs taking on the Denver Broncos on the next edition of its 'Thursday Night Football' show on October 12. A day later, the 'Taylor Swift: The Eras Tour' concert movie will be out in theaters. However, many TV executives are starting to wonder what is the end goal with pushing Swift-related content during football games. She is one of the biggest pop stars worldwide and is having a huge impact on TV ratings. Close to 27million viewers turned it to watch Chief-Jets on NBC, with the channel showing Swift at the game at least 17 times. Even Kelce said it was too much after the game. Even Swift's new beau, Travis Kelce, said the NFL airing the singer's content was too much The 'Taylor Swift: The Eras Tour' concert movie will be out in theaters this month on October 13 The NFL's female teen audience increased by 40,000 from the previous week's Steelers-Raiders game on Sunday, September 24. TV execs are questioning if the NFL's goal with Swift is to have her perform on the Super Bowl halftime show, but Usher has already been chosen as the event's main act. Sponsorship may be another reason why the league didn't go after Swift for arguably its biggest game of each season. Swift has a deal in place with Diet Coke while the Super Bowl halftime show is mainly sponsored by Pepsi. The singer and the event do share Apple Music as a common sponsor, however. The NFL has also been heavily promoting Swift-related content to attract her fans to games. The 'You Belong With Me' hitmaker featured on the league's social handles, noting in its bios the Chiefs are '2-0 as swifties' and writing, 'NFL (Taylor Version). Share or comment on this article: NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors e-mail 51 shares Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-05 16:56:14","image_url":"https://i.dailymail.co.uk/1s/2023/10/05/17/76215391-0-image-a-3_1696524970887.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"44a2f58d469616054bcde4f8e4fd3e4e","title":"«Барселона» и «Реал» заинтересованы в вингере «Баварии» Сане","link":"https://www.sport-express.ru/football/transfers/news/barselona-i-real-zainteresovany-v-vingere-bavarii-sane-2130485/","keywords":["Футбол - Трансферы"],"creator":null,"video_url":null,"description":"Полузащитник «Баварии» Лерой Сане заинтересован «Барселону» и «Реал».","content":"Полузащитник «Баварии» Лерой Сане заинтересован «Барселону» и «Реал», сообщает Bild. Контракт 27-летнего немца с мюнхенцами истекает в конце следующего сезона, но он все еще не получил предложение с новым соглашением. Сане планирует обдумать свое будущее в конце сезона. В текущем сезоне вингер забил 6 голов в 10 матчах за «Баварию». Он выступает за немецкий клуб с 2020 года. Портал Transfermarkt оценивает стоимость Сане в 65 миллионов евро.","pubDate":"2023-10-05 16:53:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"1481ed7fcb03b2d5a1688d5d6d9fc473","title":"Марсель - Брайтон: де і коли дивитися онлайн матч Ліги Європи 05.10.2023","link":"https://champion.com.ua/football/2023/10/05/940150/marsel-brayton-de-dyvytysya-match-lihy-yevropy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі другого туру Ліги Європи Марсель зіграє з Брайтоном.Підключитися до МегогоМатч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом.Дивитися поєдинок можна на медіасервісі Megogo....","content":"#Брайтон , #Марсель Джерело - Чемпіон . У матчі другого туру Ліги Європи Марсель зіграє з Брайтоном. Підключитися до Мегого Матч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом. Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-10-05 17:46:52","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"52c27f337a0713844fd7c96733242f91","title":"Локомотив Київ - Тростянець 2:1: огляд матчу Другої ліги","link":"https://champion.com.ua/football/2023/10/05/940356/lokomotyv-kyyiv-trostyanets-21-ohlyad-matchu-druhoyi-lihy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Локомотив Київ переграв Тростянець у межах 11-го туру Другої ліги.Чемпіонат України - Друга ліга11 тур, 5 жовтняЛокомотив Київ - Тростянець 2:1 (1:1)Голи:1:0 - 16 Титаренко (пен), 1:1 - 35 Грищенко, 90+2 Бринько✅ Підписуйтесь на наш телеграм-канал, щ...","content":"#Чемпіонат України, Друга ліга , #Локомотив , #Тростянець Джерело - Чемпіон . Локомотив Київ переграв Тростянець у межах 11-го туру Другої ліги. Чемпіонат України - Друга ліга 11 тур, 5 жовтня Локомотив Київ - Тростянець 2:1 (1:1) Голи: 1:0 - 16 Титаренко (пен), 1:1 - 35 Грищенко, 90+2 Бринько ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 17:38:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"08c0791a4d268e89ed79664b6ebfdf29","title":"Ракув - Штурм: де і коли дивитися онлайн матч Ліги Європи 05.10.2023","link":"https://champion.com.ua/football/2023/10/05/940149/rakuv-shturm-de-dyvytysya-match-lihy-yevropy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі другого туру Ліги Європи Ракув Владислава Кочергіна прийме австрійський Штурм.Підключитися до МегогоМатч відбудеться у четвер, 5 жовтня. Початок матчу о 19:45 за київським часом.Дивитися поєдинок можна на медіасервісі Megogo....","content":"#Ракув , #Штурм , #Владислав Кочергін Джерело - Чемпіон . У матчі другого туру Ліги Європи Ракув Владислава Кочергіна прийме австрійський Штурм. Підключитися до Мегого Матч відбудеться у четвер, 5 жовтня . Початок матчу о 19:45 за київським часом. Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-10-05 17:29:21","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"727e2e413faa7a5d1dfd268e88cf7d69","title":"Mel Tucker's lawyer offers 'new evidence' to Michigan State","link":"https://www.postguam.com/sports/nation/mel-tuckers-lawyer-offers-new-evidence-to-michigan-state/article_a7398949-1b21-523f-9462-3f336a356dec.html","keywords":null,"creator":["Field Level Media"],"video_url":null,"description":"Mel Tucker's lawyer offers 'new evidence' to Michigan State","content":"A lawyer for former Michigan State football coach Mel Tucker presented \"new evidence\" to the school Thursday in the form of a 106-page letter. Michigan State fired Tucker last month after an investigation into sexual harassment allegations involving a sexual assault awareness speaker, Brenda Tracy. Attorney Jennifer Z. Belveal sent the letter to the university's interim president, Dr. Teresa Woodruff, and the board of trustees just before an administrative hearing into the misconduct allegations against Tucker began on Thursday morning. The letter claims that Tucker's accuser \"appears to have made a career out of misleading and manipulating people.\" It also says Tracy \"manipulated a key witness\" and \"deleted key evidence\" when she filed her formal complaint against Tucker in December 2022. Tracy's attorney did not respond to a request for comment from ESPN. Tucker, 51, did not attend Thursday's hearing due to an undisclosed medical condition, according to his representatives. At stake for Tucker is the $79 million he had remaining on his contract when the school fired him on Sept. 27. The university said Tucker violated his contract's moral turpitude clause and brought ridicule upon the school with his actions, including what Tracy said was an unwanted phone sex encounter. Tucker was hired in February 2020. The Spartans (2-3, 0-2 Big Ten) have lost all three games since elevating defensive backs coach Harlon Barnett to interim head coach. --Field Level Media","pubDate":"2023-10-05 17:27:49","image_url":"https://bloximages.newyork1.vip.townnews.com/postguam.com/content/tncms/assets/v3/editorial/3/b4/3b4fc70f-78a4-5daf-bf7e-bf7af480f1c3/651ef648be900.image.jpg?resize=300%2C200","source_id":"postguam","source_priority":93374,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"de2522e6a82d281f9c081133393c0dac","title":"Тріпп'єр: Мій син хотів вийти з підтрибунки з Мбаппе, а не мною","link":"https://champion.com.ua/football/2023/10/05/940355/trippyer-miy-syn-khotiv-vyyty-z-pidtrybunky-z-mbappe-a-ne-mnoyu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Син капітана Ньюкасла Кірана Тріпп'єра Джейкоб - великий фанат Кіліана Мбаппе.Про це англієць розповів порталу Sky Sports Premier League.\"Він просто схиблений на Мбаппе, постійно дивиться відеонарізки його моментів на ютубі. Джейкоб хотів вийти з ним...","content":"#Ньюкасл Юнайтед , #Тріпп'єр Джерело - Чемпіон . Син капітана Ньюкасла Кірана Тріпп'єра Джейкоб - великий фанат Кіліана Мбаппе. Про це англієць розповів порталу Sky Sports Premier League. \"Він просто схиблений на Мбаппе, постійно дивиться відеонарізки його моментів на ютубі. Джейкоб хотів вийти з ним, а не мною! Я сказав синові: \"Якщо вийдеш з Мбаппе, то навіть не дивися на мене в підтрибунці\". Ньюкасл - ПСЖ 4:1: огляд матчу Я вже грав проти Кіліана - то був його дебютний матч за Монако, коли я виступав за Тоттенгем. Також я грав проти нього у своєму дебютному матчі за збірну Англії\", - сказав Тріпп'єр. \"I said to him if you get to walk out with him, don't look at me in the tunnel!\" 😤 Not Kieran Trippier's son wanting to switch sides and walk out with Kylian Mbappe instead of his dad 😂 pic.twitter.com/CWbhd3dkVA — Sky Sports Premier League (@SkySportsPL) October 4, 2023 ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 17:17:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"b7131556494b384c52b457e8ed4a8341","title":"COLLEGE FOOTBALL FRENZY: If we had a 12-team NCAA playoff this year, who makes it?","link":"https://calgarysun.com/sports/football/if-we-had-a-12-team-ncaa-playoff-this-year-who-makes-it","keywords":["Football","Sports"],"creator":["Todd Saelhof"],"video_url":null,"description":null,"content":"Let’s pretend it’s next year in the NCAA football world. That makes it the first year of the 12-team playoff — quite the brave new NCAA football world. And where would we all be if we used this year’s first five weeks to fill out this new landscape? Let’s pretend we know. Call this 2023 pick ’em a trial run for breaking out the 2024 bracket. The first few for our dynamite dozen seem to be no-brainers although, if you’re like us, you’re waiting for the Texas two-step to kick in. The No. 3 Texas Longhorns (5-0) are due to lose, right? They’ll drop some game, some time soon. Perhaps that comes as early as this Saturday, when the Red River Rivalry/Showdown/Shootout takes to the streets of Big D. That’s Texas versus the No. 12 Oklahoma Sooners (5-0) in Week 6 early action at the Cotton Bowl in Dallas (noon ET, ABC). Even if it isn’t this week, we like the Longhorns to boot one — at least one at some point — and fumble away an unbeaten season and a likely a top-four finish to catch the coveted bye in the first round of the make-believe 12-team College Football Playoff. Our feeling is the reigning two-time national champs — the No. 1 Georgia Bulldogs (5-0) will go unbeaten again to reach the top four. The same goes for one of the two Big Ten giants — the No. 2 Michigan Wolverines (5-0) or the No. 4 Ohio State Buckeyes (4-0). You know we’re leaning Michigan to make that happen, mainly because Ohio State is Ohio State. Joining Georgia and Michigan in the top four, though? If the No. 10 Notre Dame Fighting Irish (5-1) run the gauntlet — a massive challenge given they visit the No. 24 Louisville Cardinals (5-0) late Saturday (7:30 p.m. ET, ABC) and host the No. 9 USC Trojans (5-0) next week — they deserve a top-four slot. And the other comes — fittingly — from the Pac-12 in its final version of itself. So much to choose from, but it comes down to the USC/No. 7 Washington Huskies (5-0) tilt in early November in SoCal. The winner — we’ll say USC with the Lincoln Riley factor — would get our vote, unbeaten or not by season’s end. So with Georgia, Michigan, Notre Dame and USC getting the first-round byes in the 12-team playoff, how do the next eight greats shake out for our bracket? • Big 12 — Texas and Oklahoma • ACC — No. 5 Florida State Seminoles (5-0) • Big Ten — Ohio State • Pac-12 — Washington, No. 8 Oregon Ducks (5-0) • SEC — No. 11 Alabama Crimson Tide (4-1) • Group of Five — No. 24 Fresno State Bulldogs (5-0) Let’s give QB Drew Allar another year to push No. 6 Penn State (5-0) into the playoff. Plus, if the Big Ten’s proposed dissolution of divisions takes effect in 2024, PSU gets out from behind both Michigan and Ohio State to make hay … That Group of Five top-12 spot is interesting. Marshall (4-0) has a tough, but doable schedule to make noise, although hosting James Madison (5-0) — the other Sun Belt unbeaten — later this month will decide a lot. Air Force (5-0) has a flightpath to be in our make-shift 12-team bracket, too, although Mountain West rival Fresno State already has the better resumé. Liberty (4-0) is the only other unbeaten Group of Fiver and Tulane (4-1) tops the one-loss GOF contenders … The other Power Five unbeatens? No. 14 North Carolina (4-0), No. 17 Miami (4-0), No. 20 Kentucky (5-0), No. 21 Missouri (5-0) and unranked Maryland (5-0), which could give Ohio State trouble early Saturday at The Horseshoe (noon ET, FOX). After all, QB Taulia Tagovailoa is a gamer for Maryland, with nearly 1,500 yards and 13 passing TDs to put him among the nation’s elite pivots … At the other end of the standings, the winless FBS teams — only four — are Virginia (0-5), UConn (0-5), Nevada (0-5) and newcomer Sam Houston (0-4). It’s only the third time in 22 editions of Red River Rivalry/Showdown/Shootout that both Texas and Oklahoma are 5-0 heading into the tilt. Should be a good one, but anything would be after last year’s 49-0 beatdown by Texas … A two-loss No. 23 LSU (3-2) does not belong in the AP Top 25. Not with 22 unbeaten teams out here and a handful of them lower than No. 25 in the rankings. Think Kentucky (5-0), which hosts No. 1 Georgia (5-0) late Saturday (7 p.m. ET) … No. 11 Alabama (4-1) best be careful against host Texas A&M (4-1) in its matinee (3:30 p.m. ET, CBS), since A&M always plays its powerhouse rival well under embattled coach Jimbo Fisher and ’Bama QB Jalen Milroe might be dealing with a hamstring injury … Is it just us or is Nebraska (2-3), which visits Illinois (2-3) on Friday (8 p.m. ET), getting further away from returning to legitimacy? Didn’t think it was just us. How about adding injury to insult where deflated No. 19 Duke (4-1) is concerned? In an effort to lead his team back late in that emotional Week 5 loss to Notre Dame, QB Riley Leonard — a legit Heisman Trophy contender — suffered a high-ankle sprain and is out for a few weeks … Iowa (4-1), hosting Purdue (2-3) on Saturday afternoon (3:30 p.m. ET), has suffered a big hit to its barely functioning offence with QB Cade McNamara taking a knee for the rest of the season. The transfer from Michigan is gone with a torn ACL … Colorado (3-2), which heads to Arizona State (1-4) on Saturday (6:30 p.m. ET), is without two-way star Travis Hunter for at least two more weeks with a lacerated liver. Ouch! … Disgraced coach Mel Tucker and his lawyers are still putting up a fight against Sparty, having filed a letter alleging new evidence in his case with Michigan State in the days after his dismissal by the school … One of the best additions to ESPN College GameDay is Pat McAfee’s field-goal kicking contest, as the fantastic analyst proves it’s no easy feat — or is that feet? — to boot a three-pointer. Plus it’s a ton of fun to watch college fans try to win thousands of dollars while taking pointers — and getting ridiculed — by the GameDay team. Entertaining stuff. Rank Team (last week) Record 1. Georgia (1) 5-0 2. Michigan (2) 5-0 3. Texas (3) 5-0 4. Ohio State (4) 4-0 5. Florida State (5) 4-0 6. Penn State (6) 5-0 7. Washington (7) 5-0 8. Oregon (9) 5-0 9. USC (8) 5-0 10. Notre Dame (11) 5-1 11. Alabama (12) 4-1 12. Oklahoma (14) 5-0 13. Washington State (16) 4-0 14. North Carolina (15) 4-0 15. Oregon State (19) 4-1 16. Ole Miss (20) 4-1 17. Miami (18) 4-0 18. Utah (10) 4-1 19. Duke (17) 4-1 20. Kentucky (NR) 5-0 21. Missouri (23) 5-0 22. Tennessee (21) 4-1 23. LSU (13) 3-2 24. Fresno State (25) 5-0 25. Louisville (NR) 5-0 NR — not ranked Saturday, noon ET, in Dallas, ABC/TSN3 Seems like the underdog always wins the Red River Rivalry/Showdown/Shootout. PICK: OKLAHOMA Saturday, 3:30 p.m. ET, CBS Alabama in a pick ’em? End of day, ’Bama’s still ’Bama, but watch QB Milroe’s status. PICK: ALABAMA Saturday, 6:30 p.m. ET Back drinking Coach Prime’s Kool-Aid as Buffs bounce back from two losses. PICK: COLORADO Saturday, 7:30 p.m. ET, ABC Notre Dame won’t wait until the final minutes to take care of over-its-head Louisville. PICK: NOTRE DAME tsaelhof@postmedia.com http://www.twitter.com/ToddSaelhofPM","pubDate":"2023-10-05 17:15:44","image_url":null,"source_id":"calgarysun","source_priority":193932,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"92a33711d4ea051b0a2e2faceec2e861","title":"Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events","link":"https://www.dailymail.co.uk/sport/nfl/article-12598671/Kansas-City-Chiefs-reveal-stunning-custom-wrapped-YACHT-dock-Frankfurt-NFL-Germany-game-month-ChampionShip-set-host-fan-watch-party-VIP-events.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The boat will float less than 1,000 feet from the Eiserner Steg (Iron Footbridge) on the Main River before the Chiefs-Dolphins game at Deutsche Bank Park on November 5.","content":"Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events The Chiefs will be playing the Dolphins at Deutsche Bank Park on November 4 Germany is the latest country to host an NFL game after the UK, Mexico & Japan DailyMail.com provides all the latest international sports news By Alastair Talbot For Dailymail.Com Published: 17:47 BST, 5 October 2023 | Updated: 18:14 BST, 5 October 2023 e-mail View comments The Kansas City Chiefs have revealed a stunning custom-wrapped yacht that will be docked in Frankfurt for the NFL's game in Germany next month, with 'ChampionShip' set to host fans with a watch party and VIP events. The boat will float less than 1,000 feet from the Eiserner Steg (Iron Footbridge) on the Main River before the Chiefs-Dolphins game at Deutsche Bank Park on November 5. All three of the Chiefs' Super Bowl titles will also be on board the vessel, which will be open to the public on Friday, November 3 and Saturday, November 4, according to Fox 4 Kansas City . Tickets will be on sale starting on Tuesday, October 17 at 7 a.m. Fans can look forward to several events on board Kansas City's yacht, including 'Their Draft Moment', which consists of holding up a Chiefs jersey like they had just made the team's roster after coming through the ranks of college football. A yacht in honor of the Chiefs called 'ChampionSHIP' will be in Frankfurt, Germany, next month Fans will get a chance to lift the Vince Lombardi Trophy given to players during Super Bowl LVII Another fun activity on the ship is called 'The Catch', which involves having your photo taken as if you're catching a touchdown pass from quarterback Patrick Mahomes. 'Locker Room Ready' will see fans have their own replica lockers like the players have at Arrowhead Stadium. 'Postgame Press Conference': Step up to the podium and say 'Time's yours', like Andy Reid. Frankfurt will be the third German City to host an NFL game next month after Munich & Berlin Deutsche Bank Park - home of Eintracht Frankfurt - will host Chiefs-Dolphins on November 5 Fans will also get a shot to be snapped with the Super Bowl LVII trophy that players lifted in Arizona this past February. They will get a chance to pose for pictures in front of Frankfurt's skyline too. Chiefs Hall of Fame members Christian Okoye and and Dante Hall will be on board the vessel in Hesse to hold meet-and-greet sessions with fans. Germany is the latest country to host an NFL game abroad in recent years. Previous destinations include London, Mexico City, Monterrey and Tokyo. Regular season games were held in Munich and Berlin last year. Share or comment on this article: Kansas City Chiefs reveal stunning custom-wrapped YACHT that will dock in Frankfurt for NFL Germany game next month... with 'ChampionShip' set to host fan watch party and VIP events e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-05 17:14:29","image_url":"https://i.dailymail.co.uk/1s/2023/10/05/18/76215771-0-image-a-8_1696526003052.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"07f9d86c8453cb5cfe0c350ba443d5f5","title":"Астана - Вікторія Пльзень 1:2: огляд матчу Ліги конференцій","link":"https://champion.com.ua/football/2023/10/05/940354/astana-viktoriya-plzen-12-ohlyad-matchu-lihy-konferentsiy","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Вікторія Пльзень здобула мінімальну перемогу над Астаною в межах 2-го туру групового етапу Ліги конференцій УЄФА.Ліга конференцій УЄФА2 тур, 5 жовтняАстана - Вікторія Пльзень 1:2 (0:0)Голи:1:0 - 51 Томасов, 1:1 - 54 Хори, 1:2 - 57 Калвах✅ Підписуйтес...","content":"#Астана , #Вікторія , #Ліга конференцій Джерело - Чемпіон . Вікторія Пльзень здобула мінімальну перемогу над Астаною в межах 2-го туру групового етапу Ліги конференцій УЄФА. Ліга конференцій УЄФА 2 тур, 5 жовтня Астана - Вікторія Пльзень 1:2 (0:0) Голи: 1:0 - 51 Томасов, 1:1 - 54 Хори, 1:2 - 57 Калвах ✅ Підписуйтесь на наш телеграм-канал, щоб завжди бути в курсі головних подій зі світу спорту!","pubDate":"2023-10-05 16:58:46","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"f3dce78a344d0440883e9158a8ff5796","title":"NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors","link":"https://www.dailymail.co.uk/sport/nfl/article-12598199/NFL-asks-TV-networks-air-Taylor-Swifts-Eras-Tour-movie-promo-FREE-games-continues-lean-Travis-Kelce-romance-rumors.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"TV executives are wondering if the NFL's goal with Swift is to have her perform at the Super Bowl halftime show in February, but Usher has already been chose as the event's main act.","content":"NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors Sources told The New York Post that costs for ad time was all taken care of Even Kelce came out saying the NFL regular coverage of Swift on TV is too much DailyMail.com provides all the latest international sports news By Alastair Talbot For Dailymail.Com Published: 16:17, 5 October 2023 | Updated: 17:56, 5 October 2023 e-mail 51 shares 17 View comments The NFL has asked several national TV networks, including NBC, ESPN, Fox and CBS, to show promos for Taylor Swift 's upcoming movie for free, according to The New York Post . ESPN and NBC agreed to fulfill the league's request by showing promos for Swift's movie before the start of their pregame shows this past Sunday and Monday. ESPN also played content related to Swift's movie during 'Sunday NFL Countdown' and 'Monday NFL Countdown'. NBC's free promo came on TV during its pregame show, 'Football Night in America', before cameras focused on Swift, who attended Chiefs-Jets to watch her new beau, Travis Kelce . Another Swift commercial was aired during Sunday night's game on NBC. The NFL asked TV networks to air ads for Taylor Swift’s 'Eras' Tour movie ahead of its release An ad for Swift's 'Eras' Tour movie shown on TV during the Chiefs-Jets broadcast on NBC Sources told The Post that costs for ad time was all taken care of. These 30-second commercial slots tend to come with a six-figure price tag for 'Sunday Night Football' games. Swift was spotted at MetLife Stadium with pals Blake Lively, Ryan Reynolds and Hugh Jackman, Sunday. Shots of all four celebs were regularly shown on NBC's coverage of the game. Fox nor CBS displayed promos for Swift's movie last week. The Chiefs-Jets game wasn't aired on either channel. CBS will show Chiefs-Vikings at 4.25 p.m. on Sunday. Amazon, which has a relationship with Swift through Amazon Music, will show the Chiefs taking on the Denver Broncos on the next edition of its 'Thursday Night Football' show on October 12. A day later, the 'Taylor Swift: The Eras Tour' concert movie will be out in theaters. However, many TV executives are starting to wonder what is the end goal with pushing Swift-related content during football games. She is one of the biggest pop stars worldwide and is having a huge impact on TV ratings. Close to 27million viewers turned it to watch Chief-Jets on NBC, with the channel showing Swift at the game at least 17 times. Even Kelce said it was too much after the game. Even Swift's new beau, Travis Kelce, said the NFL airing the singer's content was too much The 'Taylor Swift: The Eras Tour' concert movie will be out in theaters this month on October 13 The NFL's female teen audience increased by 40,000 from the previous week's Steelers-Raiders game on Sunday, September 24. TV execs are questioning if the NFL's goal with Swift is to have her perform on the Super Bowl halftime show, but Usher has already been chosen as the event's main act. Sponsorship may be another reason why the league didn't go after Swift for arguably its biggest game of each season. Swift has a deal in place with Diet Coke while the Super Bowl halftime show is mainly sponsored by Pepsi. The singer and the event do share Apple Music as a common sponsor, however. The NFL has also been heavily promoting Swift-related content to attract her fans to games. The 'You Belong With Me' hitmaker featured on the league's social handles, noting in its bios the Chiefs are '2-0 as swifties' and writing, 'NFL (Taylor Version). Share or comment on this article: NFL 'asks its TV networks to air Taylor Swift's Eras Tour movie promo for FREE during games' - as it continues to lean into Travis Kelce romance rumors e-mail 51 shares Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-05 16:56:14","image_url":"https://i.dailymail.co.uk/1s/2023/10/05/17/76215391-0-image-a-3_1696524970887.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"44a2f58d469616054bcde4f8e4fd3e4e","title":"«Барселона» и «Реал» заинтересованы в вингере «Баварии» Сане","link":"https://www.sport-express.ru/football/transfers/news/barselona-i-real-zainteresovany-v-vingere-bavarii-sane-2130485/","keywords":["Футбол - Трансферы"],"creator":null,"video_url":null,"description":"Полузащитник «Баварии» Лерой Сане заинтересован «Барселону» и «Реал».","content":"Полузащитник «Баварии» Лерой Сане заинтересован «Барселону» и «Реал», сообщает Bild. Контракт 27-летнего немца с мюнхенцами истекает в конце следующего сезона, но он все еще не получил предложение с новым соглашением. Сане планирует обдумать свое будущее в конце сезона. В текущем сезоне вингер забил 6 голов в 10 матчах за «Баварию». Он выступает за немецкий клуб с 2020 года. Портал Transfermarkt оценивает стоимость Сане в 65 миллионов евро.","pubDate":"2023-10-05 16:53:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"}]}