{"newsArray":[{"title":"News24.com | Clive Barker honoured with provincial send-off: Funeral confirmed for Thursday","link":"https://www.news24.com/sport/Soccer/BafanaBafana/clive-barker-honoured-with-provincial-send-off-funeral-confirmed-for-thursday-20230612","keywords":null,"creator":null,"video_url":null,"description":"Legendary Bafana Bafana coach Clive Barker's official funeral will take place on Thursday, 15 June.","content":"Legendary Bafana Bafana coach Clive Barker's official provincial funeral will take place on Thursday. The date was finalised after discussions between Barker's family and government officials. Barker, 78, died on Saturday with thousands mourning the passing of the iconic South African football figure. On Monday, Sports Minister Zizi Kodwa, South African Football Association (SAFA) president Danny Jordaan and Barker's Africa Cup of Nations-winning captain, Neil Tovey, paid their respects to the family. The minister announced that Barker will receive an official provincial send-off to celebrate his life, following the family's wishes and government processes. \"We want to celebrate his life, but, in doing so, we thought we should come to the family, get affirmed to the family's wishes,\" Kodwa said while addressing the media. \"We couldn't announce certain things as you know, in government, there will be processes that must be followed. \"Now that the family has been accepted by the provincial government to have some form of a provincial official [funeral], we hope that the province will act immediately.\" More details on the funeral will follow.","pubDate":"2023-06-12 14:00:19","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Binzi sweeps monthly awards","link":"https://www.chronicle.co.zw/binzi-sweeps-monthly-awards/","keywords":["Headlines","Sport","Top Stories"],"creator":["Chronicle Editor"],"video_url":null,"description":"Ricky Zililo ricky.zililo@chronicle.co.zw MANICA Diamonds Football Club striker Fortune Binzi’s form has seen him being voted as the Castle Lager Premier Soccer League’s Player of the Month for March, April and May. Binzi is the league’s leading goal scorer with eight goals after 12 matches. The league’s awards come after the 24-year-old striker was voted […]","content":"The Chronicle MANICA Diamonds Football Club striker Fortune Binzi’s form has seen him being voted as the Castle Lager Premier Soccer League’s Player of the Month for March, April and May. Binzi is the league’s leading goal scorer with eight goals after 12 matches. The league’s awards come after the 24-year-old striker was voted as the Footballers Union of Zimbabwe (Fuz) Player of the Month for April. In landing the Fuz award, Binzi beat Highlanders goalkeeper Ariel Sibanda, Hwange striker Brighton Makopa, Dynamos’ defensive midfielder Tanaka Shandirwa and Bulawayo Chiefs’ attacking midfielder Mthokozisi Msebe. Meanwhile, under fire Dynamos Football Club gaffer Herbert Maruwa was voted as the Castle Lager Premier Soccer League Coach of the Month for March. Maruwa led Dynamos to two wins in March, beating Hwange 1-0 at Barbourfields Stadium and clobbering Sheasham 4-0 at the National Sports Stadium. Ngezi Platinum Stars’ coach Takesure Chiragwi won the April and May accolades. In April, Chiragwi led Ngezi Platinum Stars to 11 points out of a possible 15 points from three wins and two draws. Chiragwi, whose team is at the top of the table with 23 points from 12 outings, surprisingly won the May award with seven points from four games. He won two, drew one and lost 2-0 to Chicken Inn. If statistics are anything to go by, Bulawayo Chiefs’ coach Lizwe Sweswe will feel hard done to be overlooked for the May award as he amassed eight points from two wins and two draws. Sweswe has transformed Bulawayo Chiefs, leading them to 17 points in 12 matches. They are six points adrift of leaders Ngezi Platinum Stars.","pubDate":"2023-06-12 12:49:28","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Snl24.com | Chiefs advised to go for Mayele over Chivaviro","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/chiefs-advised-to-go-for-mayele-over-chivaviro-20230612","keywords":null,"creator":null,"video_url":null,"description":"Former Kaizer Chiefs attacker Kanga Nzenza has advised the Soweto giants to break the bank for Young Africans striker Fiston Mayele over Ranga Chivaviro.","content":"Both strikers are reportedly on the top of the list of Kaizer Chiefs after impressing this season. Mayele has scored 14 goals in 17 matches for Yanga in continental football this season, while Ranga has scored 7 in 10 CAF Confederation Cup matches alongside 10 goals in the DStv Premiership. | “That'd be a good one. Mayele would be a good one,” Nzenza tells . “If Chiefs had asked me about Saile, I would have told them, but they didn’t ask me. “I knew about Saile, but he is not the type of player who will get you those goals but a type of player who will supply you with balls coming from midfield. “He needs somebody to advise him, he’s rushing too much, that’s why he’s complicating things. \"He is mobile, and very powerful. “Most strikers today, when they are heading the ball, they close their eyes. How can a striker close his eyes when heading a ball? “I know about Ranga, but still, I will go for Mayele, he is a better player Ranga Chivaviro. “Honestly Mayele is better than Chivaviro.”","pubDate":"2023-06-12 12:47:58","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Aston Villa 'favourites' for transfer as Atletico Madrid admit defeat","link":"https://www.birminghammail.co.uk/sport/football/transfer-news/aston-villa-favourites-transfer-atletico-27105356","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Joseph Chapman)"],"video_url":null,"description":"Aston Villa transfer latest as the links with Real Mallorca attacker Kang-in Lee re-emerge ahead of the summer window","content":"Aston Villa are now reportedly favourites to bring Kang-in Lee to England this summer, amid reports that the South Korean is intent on leaving Real Mallorca - and with the chances of him completing a move to Atletico Madrid this summer decreasing. International Lee, 22, is likely to be in demand this summer and Matteo Moretto is reporting that Atletico Madrid had entered into negotiations with their Spanish counterparts over a potential deal and had offered around 10m Euros, but that was waved away by Mallorca, who demanded that any interested parties submit offers closer to his release clause, which is in the region of 18m Euros. Lee has been playing for Mallorca for the last couple of years, having made the switch from La Liga rivals Valencia in the summer of 2021 on a free transfer, having come through the Valencia academy and broken into their first-team; during his time at the Mestalla he played regularly for a couple of years, and that spell included run outs in the Champions League. READ: Stan Collymore makes Liverpool point as Christian Purslow leaves Aston Villa LIVE: Purslow steps down, Chelsea transfer link, Oxlade-Chamberlain update Since his switch to Mallorca, the forward has been a regular pick in the side. In Lee's first campaign at the club he scored his team's only goal in a 6-1 defeat at Real Madrid and this year he managed to add a further six goals and seven assists to his name - including a late winner at the home of former club Valencia. Newcastle United were linked with a move for the player in January, and could be rivals to Villa for the services of Lee, but for now the reports in Spain suggest that the Lions are the frontrunners. Lee appeared in all four of his country's World Cup matches this winter, and that included one start - in the 2-1 win over Portugal. He has two years left on his current contract with Mallorca. READ: Christian Purslow stepping down from Aston Villa role as V Sports make statement READ: Christian Purslow contribution at Aston Villa which 'nobody can deny'","pubDate":"2023-06-12 12:24:17","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article25948245.ece/ALTERNATES/s615/0_GettyImages-1455225261.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ivan Toney says 'scary' Wolves ace is hardest opponent","link":"https://www.birminghammail.co.uk/sport/football/football-news/ivan-toney-craig-dawson-wolves-27105062","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Michael Baggaley)"],"video_url":null,"description":"Wolverhampton Wanderers news from BirminghamLive as Ivan Toney names a Wolves player as his toughest opponent","content":"Signing of the season? Wolves certainly have a claim for that having paid just £3.3million to bring Craig Dawson in from West Ham in January. The 32-year-old centre back’s consistent performances proved crucial as Julen Lopetegui led the club to Premier League safety with side built on a strong defence. So, Wolves fans don’t need telling about just what an impressive player Dawson is… but it’s always nice to get that from an opposition view point. In this case, the verdict comes from Ivan Toney who has given his first interview since he was given an eight-month ban for betting. Talking to Kick Game UK , the Brentford striker discusses a range of topics, including the hardest centre back he has faced this season. He has no hesitation in naming Dawson first, explaining: “Dawson when he was at West Ham. Read More: Fabrizio Romano names likely next club for Wolves ace Joao Moutinho as Nuno makes point Read More: 'Tough for me' - £20.5m defender could offer solution as Wolves consider options “Centre backs like that are scary, they will put their head in anywhere. I remember one time he went up for a header with someone and he went on the floor. I went to see if he was okay, and his nose was bent to the side. I said, ‘bro are you okay? Your nose is finished!’ “He said, ‘no that was from the last game!’ “The fact his nose was like that and he was still playing in this game.…you know he was ready to get involved. “I think Zouma as well because he is so big and aggressive, they are the scary ones. Also, I’m a Liverpool fan so Van Dijk is up there as well, he is one of the best.” Dawson joined Wolves on a two-and-a-half year deal and is bound to be a key part of the side again next season. Lopetegui paired him successfully with Max Kilman in central defence although there has been some speculation whether Kilman will be at the club next season because he has been linked with Spurs. But Wolves have Nathan Collins and Toti waiting to step up and Conor Coady is also due to return for pre-season training after spending last season on loan at Everton. Read Next: Plea for Fabio Silva as Wolves face 'massive' transfer decision Steve Davis talks Wolves pride, pressure and relentless challenge","pubDate":"2023-06-12 12:05:39","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27105199.ece/ALTERNATES/s615/0_Ivan-Toney-Wolves.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Palace FC favourites for HIV League","link":"https://www.chronicle.co.zw/palace-fc-favourites-for-hiv-league/","keywords":["Headlines","Sport","Top Stories"],"creator":["Chronicle Editor"],"video_url":null,"description":"Innocent Kurira, Sports Reporter PALACE FC have emerged as favourites for the HIV Prevention Soccer League (HPSL) title after 12 rounds of action. The HIV PSL is a Bulawayo community-based competition that seeks to spread the awareness of HIV and deviant behaviour through football. It was launched in 2016 and has a partnership with the […]","content":"The Chronicle PALACE FC have emerged as favourites for the HIV Prevention Soccer League (HPSL) title after 12 rounds of action. The HIV PSL is a Bulawayo community-based competition that seeks to spread the awareness of HIV and deviant behaviour through football. It was launched in 2016 and has a partnership with the Zimbabwe National Family Planning Council, Population Services International, Positive Living Association of Zimbabwe, Matabeleland Aids Council, Builders International, Dot Youth and World Vision. Palace have accumulated 33 points this season and are a point ahead of defending champions Dynamos Bulawayo Chapter FC, who have a game in hand. The two teams have opened a huge gap between them and the chasing pack as High Point in third place have only collected 22 points after 12 matches. Palace FC coach Blessing Marangwanda says his side is just taking each game as it comes. “This is our maiden season and l must say the league is tougher than we had anticipated this season but we hope to continue with the same form we have shown and hopefully we will maintain the same form. Paymore “Payerz” Moyo who is in charge of Seven Warriors who are eighth on the table with 18 points also feels the league is highly competitive this season. “The level of competition this season is tough, all teams in the league are stronger. As Seven Warriors FC we want to finish in the top four. Also keeping in mind the need to educate the youngsters to stay away from drug abuse,” said Moyo.","pubDate":"2023-06-12 12:02:26","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Belgium name two replacements for injured skipper Kevin De Bruyne","link":"https://thefrontierpost.com/belgium-name-two-replacements-for-injured-skipper-kevin-de-bruyne/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"BRUSSELS (Reuters): Belgium have named two replacements for captain Kevin De Bruyne, who will miss their European Championship qualifiers against Austria and Estonia after suffering an injury in Saturday’s Champions League final. The 20-year-old pair of Johan Bakayoko and Aster Vranckx have been promoted from the under-21 squad, the Belgian football association said on Monday, […]","content":"BRUSSELS (Reuters): Belgium have named two replacements for captain Kevin De Bruyne, who will miss their European Championship qualifiers against Austria and Estonia after suffering an injury in Saturday’s Champions League final. The 20-year-old pair of Johan Bakayoko and Aster Vranckx have been promoted from the under-21 squad, the Belgian football association said on Monday, for the Group F games against Austria in Brussels on Saturday and away to Estonia on June 20. It is a second call-up for PSV Eindhoven striker Bakayoko but a first for Vranckx, who plays for AC Milan. De Bruyne, who would have captained the team in the Group F encounters, tore his hamstring in Manchester City’s victory over Inter Milan in Istanbul on Saturday.","pubDate":"2023-06-12 12:01:33","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Peter Bosz appointed new coach at PSV Eindhoven","link":"https://thefrontierpost.com/peter-bosz-appointed-new-coach-at-psv-eindhoven/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"AMSTERDAM (Reuters): PSV Eindhoven appointed Peter Bosz as their new coach on Monday, on a three-year deal as he replaces Ruud van Nistelrooy, the club said. Bosz was last at Olympique Lyonnais in France, where he was fired last October, and before that had coached Ajax Amsterdam, Borussia Dortmund and Bayer Leverkusen. The 59-year-old former […]","content":"AMSTERDAM (Reuters): PSV Eindhoven appointed Peter Bosz as their new coach on Monday, on a three-year deal as he replaces Ruud van Nistelrooy, the club said. Bosz was last at Olympique Lyonnais in France, where he was fired last October, and before that had coached Ajax Amsterdam, Borussia Dortmund and Bayer Leverkusen. The 59-year-old former Dutch international succeeds Van Nistelrooy, who made a dramatic departure from PSV last month with one league match left in the season after media revelations of a breakdown in his relationship with key players. A statement from the club on Monday said PSV and Bosz had extensive discussions about the vision, playing style and player group. “I think my way of playing can lead to success. PSV has had periods in the past when they dominated Dutch football. I want to revive those times,” it quoted him as saying (psv.nl). Under Van Nistelrooy, they finished runners-up to Feyenoord in the Dutch league to qualify for the early round of the Champions League, and they won the Dutch Cup.","pubDate":"2023-06-12 12:00:18","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Snl24.com | All Stars positive Pirates to pay compensation","link":"https://www.snl24.com/KickOff/SANews/Premiership/Orlando-Pirates/all-stars-positive-pirates-to-pay-compensation-20230612","keywords":null,"creator":null,"video_url":null,"description":"All Stars are holding out hope of receiving compensation for star player Siphelo Baloni from Orlando Pirates who is believed to have joined the Soweto giants as a free agent.","content":"All Stars had signed the exciting midfielder on a one-year deal which expires at the end of June 2023. The 23-year-old is believed to be joining the Buccaneers on a three-year deal. | \"We only had one player that had an option to extend, which is Ryan Baartman, so all the other players are free to go,\" All Stars director Thando Sodinga tells . “It’s something the club has been doing each and every other season. “The chairman doesn’t believe in long-term signings. “Things have been going smoothly since coming to Johannesburg. It was Morgan Mammila who convinced the chairman to come to Joburg. “Most of the signings were done by him. I’d say most of these players signed for a season. On the other hand, compromising the team. “It’s one of the reasons that made the chairman upset, as he gave him power man. “The thing is, the All Stars chairman will believe anything people promise to achieve for him, and realise it later. “When he joined All Stars, Morgan was in charge of everything. He gave all these players a season. “I think if these players had long-term contracts the chairman would be thinking twice or not even consider leaving football. “Keeping the same team, continuity…they were going to be strong this season. “But Pirates have always been good to All Stars, coming from the Memela issue, the All Stars chairman has a very close relationship with the Orlando Pirates chairman. “I’m sure they are going to compensate him for Baloni. That I don’t even doubt, even if this boy was going for free. “If it was up to us and there were many more players, we were going to recommend them to Pirates.”","pubDate":"2023-06-12 11:59:28","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"AC Milan Pay Tribute To 'Unforgettable' Ex-Owner Silvio Berlusconi","link":"https://sports.ndtv.com/football/ac-milan-pay-tribute-to-unforgettable-ex-owner-silvio-berlusconi-4114740","keywords":null,"creator":null,"video_url":null,"description":"AC Milan, the football club which won a host of domestic and European titles under Silvio Berlusconi's ownership, called him \"unforgettable\" in a tribute after his death aged 86 Monday.","content":"AC Milan, the football club which won a host of domestic and European titles under Silvio Berlusconi's ownership, called him \"unforgettable\" in a tribute after his death aged 86 Monday. \"Thank you, Mr President. Always with us,\" the club said in a statement, adding it was \"grieving the passing of the unforgettable Silvio Berlusconi.\" \"Tomorrow, we will dream of new ambitions, create new challenges, and seek new victories. Which will represent the good, the strong, and the true that lies inside us, in all of us who shared this adventure of binding our lives to a dream called Milan,\" the statement continued. Berlusconi reigned supreme at Milan from 1986 until 2017, during which time the club won 29 trophies, including five Champions League and eight Italian league titles. Carlo Ancelotti, who won two Champions League titles as a player for AC Milan in 1989 and 1990 before then coaching the club to two more European successes in 2003 and 2007, led the tributes to the former club president. \"Today's sadness doesn't erase the happy moments spent together,\" Ancelotti, the current Real Madrid manager, tweeted along with a photo of him standing beside Berlusconi. \"There remains infinite gratitude to the president, but above all to an ironic, loyal, intelligent, sincere man, fundamental in my adventure as a football player first, and then as a coach. Thanks President.\" AC Monza, the club Berlusconi and his long-standing business partner Adriano Galliani bought in 2018 after he sold AC Milan, said the former Italian prime minister's death left an unfillable hole. \"Adriano Galliani and AC Monza mourn the passing of president Silvio Berlusconi,\" the club said in a statement. \"A gap that will never be filled, forever with us. Thank you for everything presidente.\" When Berlusconi purchased Monza in 2018, the club was in the third tier of Italian football. Advertisement Berlusconi vowed to take Monza to Serie A and with the help of Galliani the team based near Milan reached the top flight for the first time in their history last season. Monza will play in the Italian top flight again next season after finishing the just-completed campaign in 11th place. A second former legendary coach of AC Milan, Arrigo Sacchi, hailed the memory of \"a fabulous friend to whom I owe everything\", cited by the Ansa news agency. Several other clubs also joined in tributes, including Aurelio De Laurentiis, the president of Italian champions Napoli expressing his \"condolences\". \"Silvio Berlusconi changed the history of Italian football,\" said Gabriele Gravina, president of the Italian football federation. \"His contribution in terms of passion, innovation and investments, always with particular attention to the beautiful game, has been fundamental for the affirmation of our football at international level.\" Serie A president Lorenzo Casini added: \"He made history... by taking Italian football to the roof of Europe and the world.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-12 11:58:52","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | Clive Barker honoured with provincial send-off: Funeral confirmed for Thursday","link":"https://www.news24.com/sport/Soccer/BafanaBafana/clive-barker-honoured-with-provincial-send-off-funeral-confirmed-for-thursday-20230612","keywords":null,"creator":null,"video_url":null,"description":"Legendary Bafana Bafana coach Clive Barker's official funeral will take place on Thursday, 15 June.","content":"Legendary Bafana Bafana coach Clive Barker's official provincial funeral will take place on Thursday. The date was finalised after discussions between Barker's family and government officials. Barker, 78, died on Saturday with thousands mourning the passing of the iconic South African football figure. On Monday, Sports Minister Zizi Kodwa, South African Football Association (SAFA) president Danny Jordaan and Barker's Africa Cup of Nations-winning captain, Neil Tovey, paid their respects to the family. The minister announced that Barker will receive an official provincial send-off to celebrate his life, following the family's wishes and government processes. \"We want to celebrate his life, but, in doing so, we thought we should come to the family, get affirmed to the family's wishes,\" Kodwa said while addressing the media. \"We couldn't announce certain things as you know, in government, there will be processes that must be followed. \"Now that the family has been accepted by the provincial government to have some form of a provincial official [funeral], we hope that the province will act immediately.\" More details on the funeral will follow.","pubDate":"2023-06-12 14:00:19","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Binzi sweeps monthly awards","link":"https://www.chronicle.co.zw/binzi-sweeps-monthly-awards/","keywords":["Headlines","Sport","Top Stories"],"creator":["Chronicle Editor"],"video_url":null,"description":"Ricky Zililo ricky.zililo@chronicle.co.zw MANICA Diamonds Football Club striker Fortune Binzi’s form has seen him being voted as the Castle Lager Premier Soccer League’s Player of the Month for March, April and May. Binzi is the league’s leading goal scorer with eight goals after 12 matches. The league’s awards come after the 24-year-old striker was voted […]","content":"The Chronicle MANICA Diamonds Football Club striker Fortune Binzi’s form has seen him being voted as the Castle Lager Premier Soccer League’s Player of the Month for March, April and May. Binzi is the league’s leading goal scorer with eight goals after 12 matches. The league’s awards come after the 24-year-old striker was voted as the Footballers Union of Zimbabwe (Fuz) Player of the Month for April. In landing the Fuz award, Binzi beat Highlanders goalkeeper Ariel Sibanda, Hwange striker Brighton Makopa, Dynamos’ defensive midfielder Tanaka Shandirwa and Bulawayo Chiefs’ attacking midfielder Mthokozisi Msebe. Meanwhile, under fire Dynamos Football Club gaffer Herbert Maruwa was voted as the Castle Lager Premier Soccer League Coach of the Month for March. Maruwa led Dynamos to two wins in March, beating Hwange 1-0 at Barbourfields Stadium and clobbering Sheasham 4-0 at the National Sports Stadium. Ngezi Platinum Stars’ coach Takesure Chiragwi won the April and May accolades. In April, Chiragwi led Ngezi Platinum Stars to 11 points out of a possible 15 points from three wins and two draws. Chiragwi, whose team is at the top of the table with 23 points from 12 outings, surprisingly won the May award with seven points from four games. He won two, drew one and lost 2-0 to Chicken Inn. If statistics are anything to go by, Bulawayo Chiefs’ coach Lizwe Sweswe will feel hard done to be overlooked for the May award as he amassed eight points from two wins and two draws. Sweswe has transformed Bulawayo Chiefs, leading them to 17 points in 12 matches. They are six points adrift of leaders Ngezi Platinum Stars.","pubDate":"2023-06-12 12:49:28","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Snl24.com | Chiefs advised to go for Mayele over Chivaviro","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/chiefs-advised-to-go-for-mayele-over-chivaviro-20230612","keywords":null,"creator":null,"video_url":null,"description":"Former Kaizer Chiefs attacker Kanga Nzenza has advised the Soweto giants to break the bank for Young Africans striker Fiston Mayele over Ranga Chivaviro.","content":"Both strikers are reportedly on the top of the list of Kaizer Chiefs after impressing this season. Mayele has scored 14 goals in 17 matches for Yanga in continental football this season, while Ranga has scored 7 in 10 CAF Confederation Cup matches alongside 10 goals in the DStv Premiership. | “That'd be a good one. Mayele would be a good one,” Nzenza tells . “If Chiefs had asked me about Saile, I would have told them, but they didn’t ask me. “I knew about Saile, but he is not the type of player who will get you those goals but a type of player who will supply you with balls coming from midfield. “He needs somebody to advise him, he’s rushing too much, that’s why he’s complicating things. \"He is mobile, and very powerful. “Most strikers today, when they are heading the ball, they close their eyes. How can a striker close his eyes when heading a ball? “I know about Ranga, but still, I will go for Mayele, he is a better player Ranga Chivaviro. “Honestly Mayele is better than Chivaviro.”","pubDate":"2023-06-12 12:47:58","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Aston Villa 'favourites' for transfer as Atletico Madrid admit defeat","link":"https://www.birminghammail.co.uk/sport/football/transfer-news/aston-villa-favourites-transfer-atletico-27105356","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Joseph Chapman)"],"video_url":null,"description":"Aston Villa transfer latest as the links with Real Mallorca attacker Kang-in Lee re-emerge ahead of the summer window","content":"Aston Villa are now reportedly favourites to bring Kang-in Lee to England this summer, amid reports that the South Korean is intent on leaving Real Mallorca - and with the chances of him completing a move to Atletico Madrid this summer decreasing. International Lee, 22, is likely to be in demand this summer and Matteo Moretto is reporting that Atletico Madrid had entered into negotiations with their Spanish counterparts over a potential deal and had offered around 10m Euros, but that was waved away by Mallorca, who demanded that any interested parties submit offers closer to his release clause, which is in the region of 18m Euros. Lee has been playing for Mallorca for the last couple of years, having made the switch from La Liga rivals Valencia in the summer of 2021 on a free transfer, having come through the Valencia academy and broken into their first-team; during his time at the Mestalla he played regularly for a couple of years, and that spell included run outs in the Champions League. READ: Stan Collymore makes Liverpool point as Christian Purslow leaves Aston Villa LIVE: Purslow steps down, Chelsea transfer link, Oxlade-Chamberlain update Since his switch to Mallorca, the forward has been a regular pick in the side. In Lee's first campaign at the club he scored his team's only goal in a 6-1 defeat at Real Madrid and this year he managed to add a further six goals and seven assists to his name - including a late winner at the home of former club Valencia. Newcastle United were linked with a move for the player in January, and could be rivals to Villa for the services of Lee, but for now the reports in Spain suggest that the Lions are the frontrunners. Lee appeared in all four of his country's World Cup matches this winter, and that included one start - in the 2-1 win over Portugal. He has two years left on his current contract with Mallorca. READ: Christian Purslow stepping down from Aston Villa role as V Sports make statement READ: Christian Purslow contribution at Aston Villa which 'nobody can deny'","pubDate":"2023-06-12 12:24:17","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article25948245.ece/ALTERNATES/s615/0_GettyImages-1455225261.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ivan Toney says 'scary' Wolves ace is hardest opponent","link":"https://www.birminghammail.co.uk/sport/football/football-news/ivan-toney-craig-dawson-wolves-27105062","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Michael Baggaley)"],"video_url":null,"description":"Wolverhampton Wanderers news from BirminghamLive as Ivan Toney names a Wolves player as his toughest opponent","content":"Signing of the season? Wolves certainly have a claim for that having paid just £3.3million to bring Craig Dawson in from West Ham in January. The 32-year-old centre back’s consistent performances proved crucial as Julen Lopetegui led the club to Premier League safety with side built on a strong defence. So, Wolves fans don’t need telling about just what an impressive player Dawson is… but it’s always nice to get that from an opposition view point. In this case, the verdict comes from Ivan Toney who has given his first interview since he was given an eight-month ban for betting. Talking to Kick Game UK , the Brentford striker discusses a range of topics, including the hardest centre back he has faced this season. He has no hesitation in naming Dawson first, explaining: “Dawson when he was at West Ham. Read More: Fabrizio Romano names likely next club for Wolves ace Joao Moutinho as Nuno makes point Read More: 'Tough for me' - £20.5m defender could offer solution as Wolves consider options “Centre backs like that are scary, they will put their head in anywhere. I remember one time he went up for a header with someone and he went on the floor. I went to see if he was okay, and his nose was bent to the side. I said, ‘bro are you okay? Your nose is finished!’ “He said, ‘no that was from the last game!’ “The fact his nose was like that and he was still playing in this game.…you know he was ready to get involved. “I think Zouma as well because he is so big and aggressive, they are the scary ones. Also, I’m a Liverpool fan so Van Dijk is up there as well, he is one of the best.” Dawson joined Wolves on a two-and-a-half year deal and is bound to be a key part of the side again next season. Lopetegui paired him successfully with Max Kilman in central defence although there has been some speculation whether Kilman will be at the club next season because he has been linked with Spurs. But Wolves have Nathan Collins and Toti waiting to step up and Conor Coady is also due to return for pre-season training after spending last season on loan at Everton. Read Next: Plea for Fabio Silva as Wolves face 'massive' transfer decision Steve Davis talks Wolves pride, pressure and relentless challenge","pubDate":"2023-06-12 12:05:39","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27105199.ece/ALTERNATES/s615/0_Ivan-Toney-Wolves.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Palace FC favourites for HIV League","link":"https://www.chronicle.co.zw/palace-fc-favourites-for-hiv-league/","keywords":["Headlines","Sport","Top Stories"],"creator":["Chronicle Editor"],"video_url":null,"description":"Innocent Kurira, Sports Reporter PALACE FC have emerged as favourites for the HIV Prevention Soccer League (HPSL) title after 12 rounds of action. The HIV PSL is a Bulawayo community-based competition that seeks to spread the awareness of HIV and deviant behaviour through football. It was launched in 2016 and has a partnership with the […]","content":"The Chronicle PALACE FC have emerged as favourites for the HIV Prevention Soccer League (HPSL) title after 12 rounds of action. The HIV PSL is a Bulawayo community-based competition that seeks to spread the awareness of HIV and deviant behaviour through football. It was launched in 2016 and has a partnership with the Zimbabwe National Family Planning Council, Population Services International, Positive Living Association of Zimbabwe, Matabeleland Aids Council, Builders International, Dot Youth and World Vision. Palace have accumulated 33 points this season and are a point ahead of defending champions Dynamos Bulawayo Chapter FC, who have a game in hand. The two teams have opened a huge gap between them and the chasing pack as High Point in third place have only collected 22 points after 12 matches. Palace FC coach Blessing Marangwanda says his side is just taking each game as it comes. “This is our maiden season and l must say the league is tougher than we had anticipated this season but we hope to continue with the same form we have shown and hopefully we will maintain the same form. Paymore “Payerz” Moyo who is in charge of Seven Warriors who are eighth on the table with 18 points also feels the league is highly competitive this season. “The level of competition this season is tough, all teams in the league are stronger. As Seven Warriors FC we want to finish in the top four. Also keeping in mind the need to educate the youngsters to stay away from drug abuse,” said Moyo.","pubDate":"2023-06-12 12:02:26","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Belgium name two replacements for injured skipper Kevin De Bruyne","link":"https://thefrontierpost.com/belgium-name-two-replacements-for-injured-skipper-kevin-de-bruyne/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"BRUSSELS (Reuters): Belgium have named two replacements for captain Kevin De Bruyne, who will miss their European Championship qualifiers against Austria and Estonia after suffering an injury in Saturday’s Champions League final. The 20-year-old pair of Johan Bakayoko and Aster Vranckx have been promoted from the under-21 squad, the Belgian football association said on Monday, […]","content":"BRUSSELS (Reuters): Belgium have named two replacements for captain Kevin De Bruyne, who will miss their European Championship qualifiers against Austria and Estonia after suffering an injury in Saturday’s Champions League final. The 20-year-old pair of Johan Bakayoko and Aster Vranckx have been promoted from the under-21 squad, the Belgian football association said on Monday, for the Group F games against Austria in Brussels on Saturday and away to Estonia on June 20. It is a second call-up for PSV Eindhoven striker Bakayoko but a first for Vranckx, who plays for AC Milan. De Bruyne, who would have captained the team in the Group F encounters, tore his hamstring in Manchester City’s victory over Inter Milan in Istanbul on Saturday.","pubDate":"2023-06-12 12:01:33","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Peter Bosz appointed new coach at PSV Eindhoven","link":"https://thefrontierpost.com/peter-bosz-appointed-new-coach-at-psv-eindhoven/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"AMSTERDAM (Reuters): PSV Eindhoven appointed Peter Bosz as their new coach on Monday, on a three-year deal as he replaces Ruud van Nistelrooy, the club said. Bosz was last at Olympique Lyonnais in France, where he was fired last October, and before that had coached Ajax Amsterdam, Borussia Dortmund and Bayer Leverkusen. The 59-year-old former […]","content":"AMSTERDAM (Reuters): PSV Eindhoven appointed Peter Bosz as their new coach on Monday, on a three-year deal as he replaces Ruud van Nistelrooy, the club said. Bosz was last at Olympique Lyonnais in France, where he was fired last October, and before that had coached Ajax Amsterdam, Borussia Dortmund and Bayer Leverkusen. The 59-year-old former Dutch international succeeds Van Nistelrooy, who made a dramatic departure from PSV last month with one league match left in the season after media revelations of a breakdown in his relationship with key players. A statement from the club on Monday said PSV and Bosz had extensive discussions about the vision, playing style and player group. “I think my way of playing can lead to success. PSV has had periods in the past when they dominated Dutch football. I want to revive those times,” it quoted him as saying (psv.nl). Under Van Nistelrooy, they finished runners-up to Feyenoord in the Dutch league to qualify for the early round of the Champions League, and they won the Dutch Cup.","pubDate":"2023-06-12 12:00:18","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Snl24.com | All Stars positive Pirates to pay compensation","link":"https://www.snl24.com/KickOff/SANews/Premiership/Orlando-Pirates/all-stars-positive-pirates-to-pay-compensation-20230612","keywords":null,"creator":null,"video_url":null,"description":"All Stars are holding out hope of receiving compensation for star player Siphelo Baloni from Orlando Pirates who is believed to have joined the Soweto giants as a free agent.","content":"All Stars had signed the exciting midfielder on a one-year deal which expires at the end of June 2023. The 23-year-old is believed to be joining the Buccaneers on a three-year deal. | \"We only had one player that had an option to extend, which is Ryan Baartman, so all the other players are free to go,\" All Stars director Thando Sodinga tells . “It’s something the club has been doing each and every other season. “The chairman doesn’t believe in long-term signings. “Things have been going smoothly since coming to Johannesburg. It was Morgan Mammila who convinced the chairman to come to Joburg. “Most of the signings were done by him. I’d say most of these players signed for a season. On the other hand, compromising the team. “It’s one of the reasons that made the chairman upset, as he gave him power man. “The thing is, the All Stars chairman will believe anything people promise to achieve for him, and realise it later. “When he joined All Stars, Morgan was in charge of everything. He gave all these players a season. “I think if these players had long-term contracts the chairman would be thinking twice or not even consider leaving football. “Keeping the same team, continuity…they were going to be strong this season. “But Pirates have always been good to All Stars, coming from the Memela issue, the All Stars chairman has a very close relationship with the Orlando Pirates chairman. “I’m sure they are going to compensate him for Baloni. That I don’t even doubt, even if this boy was going for free. “If it was up to us and there were many more players, we were going to recommend them to Pirates.”","pubDate":"2023-06-12 11:59:28","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"AC Milan Pay Tribute To 'Unforgettable' Ex-Owner Silvio Berlusconi","link":"https://sports.ndtv.com/football/ac-milan-pay-tribute-to-unforgettable-ex-owner-silvio-berlusconi-4114740","keywords":null,"creator":null,"video_url":null,"description":"AC Milan, the football club which won a host of domestic and European titles under Silvio Berlusconi's ownership, called him \"unforgettable\" in a tribute after his death aged 86 Monday.","content":"AC Milan, the football club which won a host of domestic and European titles under Silvio Berlusconi's ownership, called him \"unforgettable\" in a tribute after his death aged 86 Monday. \"Thank you, Mr President. Always with us,\" the club said in a statement, adding it was \"grieving the passing of the unforgettable Silvio Berlusconi.\" \"Tomorrow, we will dream of new ambitions, create new challenges, and seek new victories. Which will represent the good, the strong, and the true that lies inside us, in all of us who shared this adventure of binding our lives to a dream called Milan,\" the statement continued. Berlusconi reigned supreme at Milan from 1986 until 2017, during which time the club won 29 trophies, including five Champions League and eight Italian league titles. Carlo Ancelotti, who won two Champions League titles as a player for AC Milan in 1989 and 1990 before then coaching the club to two more European successes in 2003 and 2007, led the tributes to the former club president. \"Today's sadness doesn't erase the happy moments spent together,\" Ancelotti, the current Real Madrid manager, tweeted along with a photo of him standing beside Berlusconi. \"There remains infinite gratitude to the president, but above all to an ironic, loyal, intelligent, sincere man, fundamental in my adventure as a football player first, and then as a coach. Thanks President.\" AC Monza, the club Berlusconi and his long-standing business partner Adriano Galliani bought in 2018 after he sold AC Milan, said the former Italian prime minister's death left an unfillable hole. \"Adriano Galliani and AC Monza mourn the passing of president Silvio Berlusconi,\" the club said in a statement. \"A gap that will never be filled, forever with us. Thank you for everything presidente.\" When Berlusconi purchased Monza in 2018, the club was in the third tier of Italian football. Advertisement Berlusconi vowed to take Monza to Serie A and with the help of Galliani the team based near Milan reached the top flight for the first time in their history last season. Monza will play in the Italian top flight again next season after finishing the just-completed campaign in 11th place. A second former legendary coach of AC Milan, Arrigo Sacchi, hailed the memory of \"a fabulous friend to whom I owe everything\", cited by the Ansa news agency. Several other clubs also joined in tributes, including Aurelio De Laurentiis, the president of Italian champions Napoli expressing his \"condolences\". \"Silvio Berlusconi changed the history of Italian football,\" said Gabriele Gravina, president of the Italian football federation. \"His contribution in terms of passion, innovation and investments, always with particular attention to the beautiful game, has been fundamental for the affirmation of our football at international level.\" Serie A president Lorenzo Casini added: \"He made history... by taking Italian football to the roof of Europe and the world.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-12 11:58:52","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | Clive Barker honoured with provincial send-off: Funeral confirmed for Thursday","link":"https://www.news24.com/sport/Soccer/BafanaBafana/clive-barker-honoured-with-provincial-send-off-funeral-confirmed-for-thursday-20230612","keywords":null,"creator":null,"video_url":null,"description":"Legendary Bafana Bafana coach Clive Barker's official funeral will take place on Thursday, 15 June.","content":"Legendary Bafana Bafana coach Clive Barker's official provincial funeral will take place on Thursday. The date was finalised after discussions between Barker's family and government officials. Barker, 78, died on Saturday with thousands mourning the passing of the iconic South African football figure. On Monday, Sports Minister Zizi Kodwa, South African Football Association (SAFA) president Danny Jordaan and Barker's Africa Cup of Nations-winning captain, Neil Tovey, paid their respects to the family. The minister announced that Barker will receive an official provincial send-off to celebrate his life, following the family's wishes and government processes. \"We want to celebrate his life, but, in doing so, we thought we should come to the family, get affirmed to the family's wishes,\" Kodwa said while addressing the media. \"We couldn't announce certain things as you know, in government, there will be processes that must be followed. \"Now that the family has been accepted by the provincial government to have some form of a provincial official [funeral], we hope that the province will act immediately.\" More details on the funeral will follow.","pubDate":"2023-06-12 14:00:19","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Binzi sweeps monthly awards","link":"https://www.chronicle.co.zw/binzi-sweeps-monthly-awards/","keywords":["Headlines","Sport","Top Stories"],"creator":["Chronicle Editor"],"video_url":null,"description":"Ricky Zililo ricky.zililo@chronicle.co.zw MANICA Diamonds Football Club striker Fortune Binzi’s form has seen him being voted as the Castle Lager Premier Soccer League’s Player of the Month for March, April and May. Binzi is the league’s leading goal scorer with eight goals after 12 matches. The league’s awards come after the 24-year-old striker was voted […]","content":"The Chronicle MANICA Diamonds Football Club striker Fortune Binzi’s form has seen him being voted as the Castle Lager Premier Soccer League’s Player of the Month for March, April and May. Binzi is the league’s leading goal scorer with eight goals after 12 matches. The league’s awards come after the 24-year-old striker was voted as the Footballers Union of Zimbabwe (Fuz) Player of the Month for April. In landing the Fuz award, Binzi beat Highlanders goalkeeper Ariel Sibanda, Hwange striker Brighton Makopa, Dynamos’ defensive midfielder Tanaka Shandirwa and Bulawayo Chiefs’ attacking midfielder Mthokozisi Msebe. Meanwhile, under fire Dynamos Football Club gaffer Herbert Maruwa was voted as the Castle Lager Premier Soccer League Coach of the Month for March. Maruwa led Dynamos to two wins in March, beating Hwange 1-0 at Barbourfields Stadium and clobbering Sheasham 4-0 at the National Sports Stadium. Ngezi Platinum Stars’ coach Takesure Chiragwi won the April and May accolades. In April, Chiragwi led Ngezi Platinum Stars to 11 points out of a possible 15 points from three wins and two draws. Chiragwi, whose team is at the top of the table with 23 points from 12 outings, surprisingly won the May award with seven points from four games. He won two, drew one and lost 2-0 to Chicken Inn. If statistics are anything to go by, Bulawayo Chiefs’ coach Lizwe Sweswe will feel hard done to be overlooked for the May award as he amassed eight points from two wins and two draws. Sweswe has transformed Bulawayo Chiefs, leading them to 17 points in 12 matches. They are six points adrift of leaders Ngezi Platinum Stars.","pubDate":"2023-06-12 12:49:28","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Snl24.com | Chiefs advised to go for Mayele over Chivaviro","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/chiefs-advised-to-go-for-mayele-over-chivaviro-20230612","keywords":null,"creator":null,"video_url":null,"description":"Former Kaizer Chiefs attacker Kanga Nzenza has advised the Soweto giants to break the bank for Young Africans striker Fiston Mayele over Ranga Chivaviro.","content":"Both strikers are reportedly on the top of the list of Kaizer Chiefs after impressing this season. Mayele has scored 14 goals in 17 matches for Yanga in continental football this season, while Ranga has scored 7 in 10 CAF Confederation Cup matches alongside 10 goals in the DStv Premiership. | “That'd be a good one. Mayele would be a good one,” Nzenza tells . “If Chiefs had asked me about Saile, I would have told them, but they didn’t ask me. “I knew about Saile, but he is not the type of player who will get you those goals but a type of player who will supply you with balls coming from midfield. “He needs somebody to advise him, he’s rushing too much, that’s why he’s complicating things. \"He is mobile, and very powerful. “Most strikers today, when they are heading the ball, they close their eyes. How can a striker close his eyes when heading a ball? “I know about Ranga, but still, I will go for Mayele, he is a better player Ranga Chivaviro. “Honestly Mayele is better than Chivaviro.”","pubDate":"2023-06-12 12:47:58","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Aston Villa 'favourites' for transfer as Atletico Madrid admit defeat","link":"https://www.birminghammail.co.uk/sport/football/transfer-news/aston-villa-favourites-transfer-atletico-27105356","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Joseph Chapman)"],"video_url":null,"description":"Aston Villa transfer latest as the links with Real Mallorca attacker Kang-in Lee re-emerge ahead of the summer window","content":"Aston Villa are now reportedly favourites to bring Kang-in Lee to England this summer, amid reports that the South Korean is intent on leaving Real Mallorca - and with the chances of him completing a move to Atletico Madrid this summer decreasing. International Lee, 22, is likely to be in demand this summer and Matteo Moretto is reporting that Atletico Madrid had entered into negotiations with their Spanish counterparts over a potential deal and had offered around 10m Euros, but that was waved away by Mallorca, who demanded that any interested parties submit offers closer to his release clause, which is in the region of 18m Euros. Lee has been playing for Mallorca for the last couple of years, having made the switch from La Liga rivals Valencia in the summer of 2021 on a free transfer, having come through the Valencia academy and broken into their first-team; during his time at the Mestalla he played regularly for a couple of years, and that spell included run outs in the Champions League. READ: Stan Collymore makes Liverpool point as Christian Purslow leaves Aston Villa LIVE: Purslow steps down, Chelsea transfer link, Oxlade-Chamberlain update Since his switch to Mallorca, the forward has been a regular pick in the side. In Lee's first campaign at the club he scored his team's only goal in a 6-1 defeat at Real Madrid and this year he managed to add a further six goals and seven assists to his name - including a late winner at the home of former club Valencia. Newcastle United were linked with a move for the player in January, and could be rivals to Villa for the services of Lee, but for now the reports in Spain suggest that the Lions are the frontrunners. Lee appeared in all four of his country's World Cup matches this winter, and that included one start - in the 2-1 win over Portugal. He has two years left on his current contract with Mallorca. READ: Christian Purslow stepping down from Aston Villa role as V Sports make statement READ: Christian Purslow contribution at Aston Villa which 'nobody can deny'","pubDate":"2023-06-12 12:24:17","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article25948245.ece/ALTERNATES/s615/0_GettyImages-1455225261.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ivan Toney says 'scary' Wolves ace is hardest opponent","link":"https://www.birminghammail.co.uk/sport/football/football-news/ivan-toney-craig-dawson-wolves-27105062","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Michael Baggaley)"],"video_url":null,"description":"Wolverhampton Wanderers news from BirminghamLive as Ivan Toney names a Wolves player as his toughest opponent","content":"Signing of the season? Wolves certainly have a claim for that having paid just £3.3million to bring Craig Dawson in from West Ham in January. The 32-year-old centre back’s consistent performances proved crucial as Julen Lopetegui led the club to Premier League safety with side built on a strong defence. So, Wolves fans don’t need telling about just what an impressive player Dawson is… but it’s always nice to get that from an opposition view point. In this case, the verdict comes from Ivan Toney who has given his first interview since he was given an eight-month ban for betting. Talking to Kick Game UK , the Brentford striker discusses a range of topics, including the hardest centre back he has faced this season. He has no hesitation in naming Dawson first, explaining: “Dawson when he was at West Ham. Read More: Fabrizio Romano names likely next club for Wolves ace Joao Moutinho as Nuno makes point Read More: 'Tough for me' - £20.5m defender could offer solution as Wolves consider options “Centre backs like that are scary, they will put their head in anywhere. I remember one time he went up for a header with someone and he went on the floor. I went to see if he was okay, and his nose was bent to the side. I said, ‘bro are you okay? Your nose is finished!’ “He said, ‘no that was from the last game!’ “The fact his nose was like that and he was still playing in this game.…you know he was ready to get involved. “I think Zouma as well because he is so big and aggressive, they are the scary ones. Also, I’m a Liverpool fan so Van Dijk is up there as well, he is one of the best.” Dawson joined Wolves on a two-and-a-half year deal and is bound to be a key part of the side again next season. Lopetegui paired him successfully with Max Kilman in central defence although there has been some speculation whether Kilman will be at the club next season because he has been linked with Spurs. But Wolves have Nathan Collins and Toti waiting to step up and Conor Coady is also due to return for pre-season training after spending last season on loan at Everton. Read Next: Plea for Fabio Silva as Wolves face 'massive' transfer decision Steve Davis talks Wolves pride, pressure and relentless challenge","pubDate":"2023-06-12 12:05:39","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27105199.ece/ALTERNATES/s615/0_Ivan-Toney-Wolves.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Palace FC favourites for HIV League","link":"https://www.chronicle.co.zw/palace-fc-favourites-for-hiv-league/","keywords":["Headlines","Sport","Top Stories"],"creator":["Chronicle Editor"],"video_url":null,"description":"Innocent Kurira, Sports Reporter PALACE FC have emerged as favourites for the HIV Prevention Soccer League (HPSL) title after 12 rounds of action. The HIV PSL is a Bulawayo community-based competition that seeks to spread the awareness of HIV and deviant behaviour through football. It was launched in 2016 and has a partnership with the […]","content":"The Chronicle PALACE FC have emerged as favourites for the HIV Prevention Soccer League (HPSL) title after 12 rounds of action. The HIV PSL is a Bulawayo community-based competition that seeks to spread the awareness of HIV and deviant behaviour through football. It was launched in 2016 and has a partnership with the Zimbabwe National Family Planning Council, Population Services International, Positive Living Association of Zimbabwe, Matabeleland Aids Council, Builders International, Dot Youth and World Vision. Palace have accumulated 33 points this season and are a point ahead of defending champions Dynamos Bulawayo Chapter FC, who have a game in hand. The two teams have opened a huge gap between them and the chasing pack as High Point in third place have only collected 22 points after 12 matches. Palace FC coach Blessing Marangwanda says his side is just taking each game as it comes. “This is our maiden season and l must say the league is tougher than we had anticipated this season but we hope to continue with the same form we have shown and hopefully we will maintain the same form. Paymore “Payerz” Moyo who is in charge of Seven Warriors who are eighth on the table with 18 points also feels the league is highly competitive this season. “The level of competition this season is tough, all teams in the league are stronger. As Seven Warriors FC we want to finish in the top four. Also keeping in mind the need to educate the youngsters to stay away from drug abuse,” said Moyo.","pubDate":"2023-06-12 12:02:26","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Belgium name two replacements for injured skipper Kevin De Bruyne","link":"https://thefrontierpost.com/belgium-name-two-replacements-for-injured-skipper-kevin-de-bruyne/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"BRUSSELS (Reuters): Belgium have named two replacements for captain Kevin De Bruyne, who will miss their European Championship qualifiers against Austria and Estonia after suffering an injury in Saturday’s Champions League final. The 20-year-old pair of Johan Bakayoko and Aster Vranckx have been promoted from the under-21 squad, the Belgian football association said on Monday, […]","content":"BRUSSELS (Reuters): Belgium have named two replacements for captain Kevin De Bruyne, who will miss their European Championship qualifiers against Austria and Estonia after suffering an injury in Saturday’s Champions League final. The 20-year-old pair of Johan Bakayoko and Aster Vranckx have been promoted from the under-21 squad, the Belgian football association said on Monday, for the Group F games against Austria in Brussels on Saturday and away to Estonia on June 20. It is a second call-up for PSV Eindhoven striker Bakayoko but a first for Vranckx, who plays for AC Milan. De Bruyne, who would have captained the team in the Group F encounters, tore his hamstring in Manchester City’s victory over Inter Milan in Istanbul on Saturday.","pubDate":"2023-06-12 12:01:33","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Peter Bosz appointed new coach at PSV Eindhoven","link":"https://thefrontierpost.com/peter-bosz-appointed-new-coach-at-psv-eindhoven/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"AMSTERDAM (Reuters): PSV Eindhoven appointed Peter Bosz as their new coach on Monday, on a three-year deal as he replaces Ruud van Nistelrooy, the club said. Bosz was last at Olympique Lyonnais in France, where he was fired last October, and before that had coached Ajax Amsterdam, Borussia Dortmund and Bayer Leverkusen. The 59-year-old former […]","content":"AMSTERDAM (Reuters): PSV Eindhoven appointed Peter Bosz as their new coach on Monday, on a three-year deal as he replaces Ruud van Nistelrooy, the club said. Bosz was last at Olympique Lyonnais in France, where he was fired last October, and before that had coached Ajax Amsterdam, Borussia Dortmund and Bayer Leverkusen. The 59-year-old former Dutch international succeeds Van Nistelrooy, who made a dramatic departure from PSV last month with one league match left in the season after media revelations of a breakdown in his relationship with key players. A statement from the club on Monday said PSV and Bosz had extensive discussions about the vision, playing style and player group. “I think my way of playing can lead to success. PSV has had periods in the past when they dominated Dutch football. I want to revive those times,” it quoted him as saying (psv.nl). Under Van Nistelrooy, they finished runners-up to Feyenoord in the Dutch league to qualify for the early round of the Champions League, and they won the Dutch Cup.","pubDate":"2023-06-12 12:00:18","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Snl24.com | All Stars positive Pirates to pay compensation","link":"https://www.snl24.com/KickOff/SANews/Premiership/Orlando-Pirates/all-stars-positive-pirates-to-pay-compensation-20230612","keywords":null,"creator":null,"video_url":null,"description":"All Stars are holding out hope of receiving compensation for star player Siphelo Baloni from Orlando Pirates who is believed to have joined the Soweto giants as a free agent.","content":"All Stars had signed the exciting midfielder on a one-year deal which expires at the end of June 2023. The 23-year-old is believed to be joining the Buccaneers on a three-year deal. | \"We only had one player that had an option to extend, which is Ryan Baartman, so all the other players are free to go,\" All Stars director Thando Sodinga tells . “It’s something the club has been doing each and every other season. “The chairman doesn’t believe in long-term signings. “Things have been going smoothly since coming to Johannesburg. It was Morgan Mammila who convinced the chairman to come to Joburg. “Most of the signings were done by him. I’d say most of these players signed for a season. On the other hand, compromising the team. “It’s one of the reasons that made the chairman upset, as he gave him power man. “The thing is, the All Stars chairman will believe anything people promise to achieve for him, and realise it later. “When he joined All Stars, Morgan was in charge of everything. He gave all these players a season. “I think if these players had long-term contracts the chairman would be thinking twice or not even consider leaving football. “Keeping the same team, continuity…they were going to be strong this season. “But Pirates have always been good to All Stars, coming from the Memela issue, the All Stars chairman has a very close relationship with the Orlando Pirates chairman. “I’m sure they are going to compensate him for Baloni. That I don’t even doubt, even if this boy was going for free. “If it was up to us and there were many more players, we were going to recommend them to Pirates.”","pubDate":"2023-06-12 11:59:28","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"AC Milan Pay Tribute To 'Unforgettable' Ex-Owner Silvio Berlusconi","link":"https://sports.ndtv.com/football/ac-milan-pay-tribute-to-unforgettable-ex-owner-silvio-berlusconi-4114740","keywords":null,"creator":null,"video_url":null,"description":"AC Milan, the football club which won a host of domestic and European titles under Silvio Berlusconi's ownership, called him \"unforgettable\" in a tribute after his death aged 86 Monday.","content":"AC Milan, the football club which won a host of domestic and European titles under Silvio Berlusconi's ownership, called him \"unforgettable\" in a tribute after his death aged 86 Monday. \"Thank you, Mr President. Always with us,\" the club said in a statement, adding it was \"grieving the passing of the unforgettable Silvio Berlusconi.\" \"Tomorrow, we will dream of new ambitions, create new challenges, and seek new victories. Which will represent the good, the strong, and the true that lies inside us, in all of us who shared this adventure of binding our lives to a dream called Milan,\" the statement continued. Berlusconi reigned supreme at Milan from 1986 until 2017, during which time the club won 29 trophies, including five Champions League and eight Italian league titles. Carlo Ancelotti, who won two Champions League titles as a player for AC Milan in 1989 and 1990 before then coaching the club to two more European successes in 2003 and 2007, led the tributes to the former club president. \"Today's sadness doesn't erase the happy moments spent together,\" Ancelotti, the current Real Madrid manager, tweeted along with a photo of him standing beside Berlusconi. \"There remains infinite gratitude to the president, but above all to an ironic, loyal, intelligent, sincere man, fundamental in my adventure as a football player first, and then as a coach. Thanks President.\" AC Monza, the club Berlusconi and his long-standing business partner Adriano Galliani bought in 2018 after he sold AC Milan, said the former Italian prime minister's death left an unfillable hole. \"Adriano Galliani and AC Monza mourn the passing of president Silvio Berlusconi,\" the club said in a statement. \"A gap that will never be filled, forever with us. Thank you for everything presidente.\" When Berlusconi purchased Monza in 2018, the club was in the third tier of Italian football. Advertisement Berlusconi vowed to take Monza to Serie A and with the help of Galliani the team based near Milan reached the top flight for the first time in their history last season. Monza will play in the Italian top flight again next season after finishing the just-completed campaign in 11th place. A second former legendary coach of AC Milan, Arrigo Sacchi, hailed the memory of \"a fabulous friend to whom I owe everything\", cited by the Ansa news agency. Several other clubs also joined in tributes, including Aurelio De Laurentiis, the president of Italian champions Napoli expressing his \"condolences\". \"Silvio Berlusconi changed the history of Italian football,\" said Gabriele Gravina, president of the Italian football federation. \"His contribution in terms of passion, innovation and investments, always with particular attention to the beautiful game, has been fundamental for the affirmation of our football at international level.\" Serie A president Lorenzo Casini added: \"He made history... by taking Italian football to the roof of Europe and the world.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-12 11:58:52","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"}]}