{"newsArray":[{"title":"Ross County chief blasts SPFL ‘entertainment killer’ and calls for VAR overhaul","link":"https://www.thescottishsun.co.uk/sport/football/10348398/ross-county-spfl-entertainment-killer-var-overhaul/","keywords":["Football","Refereeing","Scottish Premiership","VAR"],"creator":["David Oliver"],"video_url":null,"description":null,"content":"ROY MacGREGOR has begged Hampden chiefs to sort the VAR chaos he says is “killing” the enjoyment for fans. Ross County’s owner fears interference and long delays are spoiling the entertainment for supporters of all clubs. 4 Staggies supremo MacGregor says the system isn't working as sold to clubs Credit: Kenny Ramsay 4 Two penalties were awarded after VAR checks in Celtic's 5-1 win over St Mirren last weekend. Credit: Kenny Ramsay 4 Pauses for video rewinds have delayed games this season. Credit: SNS He believes there’s now a “groundswell of opinion” among fans, managers and owners for major changes to a system which was introduced only five months ago. And the Staggies chairman says clubs did NOT expect so many on-field calls to be over-ruled, or so much time wasted waiting for the decisions. MacGregor told SunSport : “There is a groundswell of opinion from people who are not happy. Read More in Football floodlights, camera... action 9 times Scottish football has made it to Hollywood Pimp my pad Inside the most lavish homes of Scots footy heroes - including pools & cinemas “Not just managers but supporters and owners. “They’re asking, ‘Have they got this right?’ and, ‘Who makes the decisions?’. \"It’s detracting from a supporter’s experience. “They don’t want to wait two minutes for a decision, as we had in two separate incidents. Most read in Football MORE MOVE Rangers star Alfredo Morelos 'signs pre-contract with European giants' MOTD MUTINY Match of The Day chaos as hosts stage mutiny after BBC pull Lineker off air 'INDEFENSIBLE' Sturgeon slams BBC after Gary Lineker forced to step down from MOTD Pimp my pad Inside the most lavish homes of Scots footy heroes - including pools & cinemas “It’s taking the enjoyment away. We’re forgetting about fans here for entertainment and for fun. “We’re in the entertainment industry, after all, but VAR has been killing the entertainment. “I’m not saying this on behalf of Ross County. I’m saying it on behalf of Scottish football . It’s what everyone is thinking.” MacGregor believes the decision-making process flies in the face of everything clubs were told about VAR prior to its introduction in October. He said: “We all wanted VAR brought in to deal with offsides and clear, factual issues — but that’s not happening. 4 Referees are going to the screen too often, he believes. Credit: SNS “We were told VAR would only intervene in cases of clear and obvious error by the ref. “But we’re at the stage where VAR is refereeing the game rather than the referee being in charge. “The VAR simply cannot have the same spatial awareness as a ref who’s on the pitch. “The point was to help the referee — not just have two referees. “When the VAR asks the ref to look at an incident on the screen, the ref questions his own judgement. That can’t be good. “I have always been very supportive of refs. But we need clarity with VAR and things are not being properly explained to us. Read more on the Scottish Sun WHERE'S MR. RIGHT? I’m looking for a handsome cowboy but men never slide into my DMs OH NO I dyed my brown hair blonde & tried the ‘pull test’…I was left totally horrified “Look at the number of handball incidents. We need clarity on what is and isn’t deliberate handball. “Our manager has spoken to the SFA . We all just want the right decisions.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-03-11 08:29:04","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How Man Utd could look like England next season as Harry Kane leads flurry of potential Three Lions signings","link":"https://www.thescottishsun.co.uk/sport/football/10348468/man-utd-line-up-harry-kane-england/","keywords":["Football","Sport","Chelsea transfer news","Manchester United transfer news"],"creator":["Sam Street"],"video_url":null,"description":null,"content":"MANCHESTER UNITED appear to be finally on the right track as Erik Ten Hag closes in on a top four finish. But a 7-0 hammering at Liverpool showed there is work to be done on the transfer front for the Red Devils to be ready for Champions League football. 9 Erik ten Hag will need reinforcements ahead of a likely Champions League campaign next season Credit: EPA 9 Harry Kane is top of Man Utd's summer wish list Credit: PA 9 Man Utd's line up could look a lot more like England next season Harry Kane is a top target, with United confident of a deal . And there is little doubt that should Kane join, he will be accompanied in a front three by Marcus Rashford. The local hero has yet to pen a new deal but with him already enjoying a record goal tally under Ten Hag, why would he want to be anywhere else? On the right, Jadon Sancho will continue to face competition from Alejandro Garnacho and Antony. However, the ex-Man City youngster is expected to hold down regular place at Old Trafford for many years to come. Sancho's old Dortmund team-mate Jude Bellingham is the most sought after player in Europe going into this summer's transfer window. Real Madrid and Liverpool are the favourites to land the midfielder but he has been a United target since his Birmingham days. Should Liverpool fail to make the top four and Bellingham not fancy a move to Spain, the Red Devils will instantly move to pole position for his signature. Most read in Football TEACHER'S PET I was the hottest teacher, parents hit on me & their kids weren't in my class 'BODY GOALS' Helen Flanagan puts on eye-popping display as she shows off new boob job GO WITH THE SNOW Scotland faces -17C weekend WHITEOUT with heavy snow hitting central belt FRESH START Griffiths explains Oz move as he opens up on Rangers and Hearts fan torment HOW TO GET FREE BETS ON FOOTBALL 9 Man Utd still have an eye on Jude Bellingham despite Liverpool and Real Madrid leading the race Credit: Getty 9 Declan Rice is a player United have been interested in for a long time Credit: Getty 9 Mason Mount is available on a free transfer in 2024, so could be allowed to leave on the cheap this summer Credit: Getty And partnering Bellingham could be Declan Rice, who has also been a long term United target. The signing for Rice would also set up an intriguing battle for a place with enforcer Casemiro, who has more than lived up to his £70m price tag to become one of the team's most impressive performers. However, the Red Devils will face stiff competition from London sides Arsenal and Chelsea for Rice's signature . But they could get one over Chelsea by purchasing Mason Mount in a cut price deal, with his contract to expire in 2024. The attacking midfielder has yet to agree a new deal with the Blues and both his performances and relationship with the West London club's hierarchy appear to be deteriorating . It is thought that the West Londoners would be prepared to sell for a fee of around £50m . Signing Mason Mount would also ramp up the pressure on Bruno Fernandes. The vice-captain infuriated United fans with his display at Anfield, as he was even accused of asking to be substituted . Aaron Wan-Bissaka has yet to impress Gareth Southgate sufficiently on the ball to earn an England cap. However, things are different at Old Trafford where his attitude has impressed the manager and he has muscled his way into first team contention. Captain Harry Maguire is also in and out of the team, and a potential candidate to leave United in the summer. However, he claims Erik ten Hag has told him he is a top centre-back and he may yet decide to stay and fight for his place. Luke Shaw has shown himself to be capable of filling it at left-centre-back when called upon, and is set to continue starting there or at left-back for the foreseeable future. 9 Man Utd have used among the lowest number of English players in the Premier League this season, but that could be about to change Should Shaw make a more permanent switch to centre-back, United would need to decide whether or not to sign competition for Tyrell Malacia at left-back. Chelsea's Ben Chilwell is far from a top Man Utd target, but he is a lifelong fan of the club. In goal, David de Gea is closing in on a new deal but is looking less and less a long-term option. That is reflected in Man Utd preparing to offer the Spaniard a reduced and incentive-based contract . The Sun has revealed that the 32-year-old will only be able to pick up the maximum £250,000-salary he is being offered if he plays in over 50 per cent of matches. England goalkeeper Jordan Pickford is in no hurry to leave Everton as he has just agreed a new £150,000-a-week deal . However, the Toffees are 18th in the table having played a game more than the competition. Read more on the Scottish Sun WHERE'S MR. RIGHT? I’m looking for a handsome cowboy but men never slide into my DMs OH NO I dyed my brown hair blonde & tried the ‘pull test’…I was left totally horrified With Pickford's impending new contract containing no relegation clause, it is difficult to see the Three Lions stopper playing in the Championship. And though Chelsea are said to be the club most keen on Pickford, with their need for a new goalkeeper greater than Man Utd's, the Red Devils will have to purchase a new man between the sticks in the relatively near future. 9 Ben Chilwell is a lifelong Man Utd fan Credit: Getty 9 Jordan Pickford is at risk of being relegated Credit: Alamy","pubDate":"2023-03-11 08:23:58","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bournemouth vs Liverpool LIVE SCORE: Premier League latest as Reds look to build on Man Utd mauling – stream, TV channel","link":"https://www.thescottishsun.co.uk/sport/football/10337935/bournemouth-liverpool-live-score-result-stream-watch-premier-league-online/","keywords":["Football","Sport","Premier League","Sport Live Blogs"],"creator":["Nyle Smith"],"video_url":null,"description":null,"content":"TOP four chasing Liverpool go up against relegation-threatened Bournemouth as they look to build on their 7-0 Premier League pummelling on Manchester United. Goals from Cody Gakpo, Darwin Nunez, Mo Salah and Roberto Firmino handed the Red Devils their heaviest defeat since Wolves in 1930. While Reiss Nelson's stoppage time strike saw Arsenal snatch all three points from the Cherries in their recent outing. Kick-off time: TODAY, Saturday, March 11 - 12:30pm GMT Live stream: BT Sport TV channel: BT Sport 1 CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 Follow ALL the action with our live blog below... Load more entries… Topics Football Premier League Sport Live Blogs Bournemouth Liverpool YOU MIGHT LIKE","pubDate":"2023-03-11 08:00:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | 'Football gods on our side': Dondol Stars to bag at least R400k after Nedbank Cup giant-killing run","link":"https://www.news24.com/sport/Soccer/PSL/football-gods-on-our-side-dondol-stars-to-bag-at-least-r400k-after-nedbank-cup-giant-killing-run-20230311","keywords":null,"creator":null,"video_url":null,"description":"Dondol Stars have defied the footballing odds this season, knocking over SuperSport United and AmaZulu in the Nedbank Cup.","content":"Dondol Stars have defied the footballing odds this season. The third-tier outfit, vying to climb out of the ABC Motsepe League (Gauteng Province), added another Premier Soccer League giant killing to their list. After outwitting SuperSport United in the Nedbank Cup Round of 32 in a 2-1 win, the Mamelodi-based side went after AmaZulu in the last 16 on Wednesday. Stars cancelled out Hendrick Ekstein's opening goal in the second half via Renaldo Fox and forced the Durban side all the way to a penalty shootout, winning 5-4 to advance to the quarter-finals. \"We are happy and excited. I hoped and prayed that our boys come to the party, and they came,\" Dondol co-coach Khuliso Rashamuse said during his post-match interview with SuperSport TV. \"We pushed our players. We did not have anything to lose. They came to the party, and they danced and had fun. \"Penalties are lotteries. Anything can happen. The football gods were on our side. It was in the players' hearts, they wanted it the most, that's where we won it. \"Besides it being history, it is a great achievement of the team. We want to remain humble. Focus on the league, and if we win, we go to the Gladafrica Championship (now Motsepe Foundation Championship). My life, Vini's (co-coach Vincent Rammoni) life and the players' changes.\" READ | Mtolo collapsed with 15 minutes left to train, says coach. After that, things moved fast The Dondol Stars will aim to join Baroka FC, who defeated Kaizer Chiefs in last eight round of 2011 and remain the only third tier team to fell top flight opposition in the Nedbank Cup quarter-finals. The ABC Motsepe League side are now guaranteed to walk away with at least R400 000 for their efforts, which could go a long way for the club from the third tier. And if that is not enough, it could increase to R1 million if they are to nab a semi-final shout. Advancing to the final will see that purse increase to R2.5 million, while winning the tournament will see Dondol claim R7 million. Dondol, alongside Mamelodi Sundowns, have thus far advanced to Monday's (13 March) quarter-final draw. Meanwhile, Dondol Stars are top of the Gauteng stream of the ABC Motsepe League with a healthy nine-point lead over second place Pele Pele FC. If they are to win the Gauteng stream, they will then enter the overall playoff and have a chance of being crowned ABC Motsepe League champions. The two teams in the final playoff match will be promoted to the Motsepe Foundation Championship.","pubDate":"2023-03-11 07:50:32","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Μπενζεμά στο Instagram μετά από δηλώσεις Ντεσάν: «Τι θράσος, καληνύχτα Ντιντιέ»","link":"https://www.gazzetta.gr/football/moyntial-2022/2204452/mpenzema-sto-instagram-meta-apo-diloseis-ntesan-ti-thrasos-kalinyhta","keywords":["Ποδόσφαιρο","Μουντιάλ 2022","Κωνσταντίνος Κωλαΐτης","Ρεάλ Μαδρίτης","Γαλλία","Καρίμ Μπενζεμά","Ντιντιέ Ντεσάν"],"creator":null,"video_url":null,"description":"Ο Ντιντιέ Ντεσάν παραχώρησε συνέντευξη στην «Parisien» στην οποία μίλησε μεταξύ άλλων για το σίριαλ της απουσίας του Καρίμ Μπενζεμά από το Μουντιάλ, με τον Γάλλο στράικερ να απαντά στο Instagram με emoji... κλόουν και «αιχμηρές» ατάκες.","content":"Η εθνική Γαλλίας θα συνεχίσει με τον Ντιντιέ Ντεσάν στο τιμόνι της τουλάχιστον μέχρι το Παγκόσμιο Κύπελλο του 2026 και ο ομοσπονδιακός τεχνικός των Μπλε παραχώρησε την πρώτη του συνέντευξη μετά την ανανέωση του συμβολαίου του, στην οποία αναπόφευκτα αναφέρθηκε και στον Καρίμ Μπενζεμά. Ο Γάλλος στράικερ αποτέλεσε ένα από τα μεγάλα «πλήγματα» για το σύνολο του Ντεσάν στο Μουντιάλ αφού προερχόταν από τραυματισμό και κρίθηκε ανέτοιμος, μένοντας εν τέλει εκτός αποστολής. Στα τέλη Νοεμβρίου κι ενώ η Γαλλία βάδιζε εκ του ασφαλούς στην πρόκριση στα νοκ-άουτ, υπήρξαν δημοσιεύματα που ήθελαν τον εκλέκτορα των Μπλε να καλεί εκ νέου τον φορ της Ρεάλ στην αποστολή για την τελική ευθεία της διοργάνωσης, κάτι που δεν συνέβη ποτέ. Ο ίδιος ο Μπενζεμά, μάλιστα, δήλωσε λίγες μέρες αργότερα σε ανάρτηση του στο Instagram ότι «δεν ενδιαφέρομαι» και την επομένη του τελικού του Μουντιάλ ανακοίνωσε και τυπικά τους τίτλους τέλους από την εθνική , κάνοντας ακολούθως unfollow όλους τους συμπαίκτες του. Πλέον, τρεις μήνες μετά το εν λόγω σίριαλ, ο Ντεσάν έδωσε τη δική του εκδοχή για το ζήτημα με την αρχική απουσία του Μπενζεμά λόγω τραυματισμού και τον λόγο που δεν επέστρεψε, τονίζοντας ότι ο ίδιος ο παίκτης τού είπε πως δεν ήταν σε θέση να βοηθήσει. « Με προσβάλλει που το λέτε αυτό. Υπάρχει μόνο μία αλήθεια και ο Καρίμ την ξέρει καλά. Ο Καρίμ μπήκε στην προεπιλογή μας στις 14 Νοεμβρίου μετά από ένα διάστημα που ήταν σχεδόν ανενεργός με τον σύλλογό του. Ακολούθησε ατομικό πρόγραμμα, η επιστροφή του στις ομαδικές προπονήσεις αναβλήθηκε. Δεν ήταν 100% σίγουρος ότι θα μπορούσε να ξεκινήσει στο ματς με την Αυστραλία. Ο Καρίμ ήταν εκνευρισμένος γιατί το Μουντιάλ σήμαινε πολλά για αυτόν. Στην καλύτερη των περιπτώσεων θα γυρνούσε στις προπονήσεις στις 10 Δεκεμβρίου. Την τελευταία φορά που τον είδα του είπα ''Καρίμ, μη βιαστείς''. Να οργάνωνε την επιστροφή του με τον team manager. Όταν ξύπνησα, είχε ήδη φύγει. Ήταν απόφασή του, δεν θα σας πει κάτι άλλο, το καταλαβαίνω και το σέβομαι» «Πιστεύετε πραγματικά πως μπορεί να συγκριθεί ένα φιλικό με τη Ρεάλ Μαδρίτης με την ένταση ενός ημιτελικού Μουντιάλ; Το ταλέντο και το στάτους του δεν αμφισβητούνται, αλλά μπορείτε να φανταστείτε να γύριζε την τελευταία στιγμή; Ο ίδιος ο Καρίμ μού είπε ότι δεν θα ήταν έτοιμος ». Απ' ό,τι φαίνεται, όμως, ο Μπενζεμά δεν συμφωνεί καθόλου με την εκδοχή του Γάλλου τεχνικού. Συγκεκριμένα, ανέβασε story στο Instagam με φωτογραφία από τη συνέντευξη κι έγραψε «Τι θράσος», συνοδεύοντας τη φράση με ένα emoji κλόουν! Στο δεύτερο story που ακολούθησε, έγραψε χαρακτηριστικά «Καληνύχτα Άγιε Ντιντιέ».","pubDate":"2023-03-11 07:03:19","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Programme du Samedi 11 Mars 2023","link":"https://www.dzfoot.com/programme-tv/programme-du-samedi-11-mars-2023-239384.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Programme TV","Ligue 1","Diffusion","Premier League"],"creator":null,"video_url":null,"description":"Voici le programme de DZfoot! Au sommaire, une sélection (non-exhaustive) des matchs impliquant les Algériens évoluant à travers le monde ainsi qu’une liste des plus belles affiches du jour. Tous les horaires indiqués sont à l’heure d’Alger. Matchs des Algériens évoluant à l'étranger 15:30 Bundesliga (Allemagne) | Leipzig - Mönchengladbach (Bensebaini*) beIN Sports 7 (Mena); beIN […] The post Programme du Samedi 11 Mars 2023 appeared first on Football Algérien - DZFOOT.COM.","content":"Voici le programme de DZfoot! Au sommaire , une sélection (non-exhaustive) des matchs impliquant les Algériens évoluant à travers le monde ainsi qu’une liste des plus belles affiches du jour. Tous les horaires indiqués sont à l’heure d’Alger. Matchs des Algériens évoluant à l'étranger 15:30 Bundesliga (Allemagne) | Leipzig - Mönchengladbach ( Bensebaini* ) beIN Sports 7 (Mena); beIN Sports 5 max (France) 17:00 Ligue 1 (France) | Auxerre - Rennes (A. Zedadka) beIN Sports 2 (Mena); Prime Video (France) 18:15 Pro League (Belgique) | Westerlo - Courtrai KV (Kadri) Eleven Sports Online 18:30 Premier League (Angleterre) | Crystal Palace - Manchester City (Mahrez) beIN Sports Premium 1 (Mena); Canal+ Foot (France) 18:45 Eredivisie (Pays-Bas) | Fortuna Sittard - Twente (R. Zerrouki) 20:45 Super League (Suisse) | Lugano - Zürich (Amoura) 21:00 Ligue 1 (France) | Brest - PSG (Belkebla) beIN Sports 2 (Mena); Prime Video (France) *Suspendu DZfoot","pubDate":"2023-03-11 07:00:40","image_url":null,"source_id":"dzfoot","category":["sports"],"country":["algeria"],"language":"french"},{"title":"Σάλκε vs Ντόρτμουντ: Ένα ντέρμπι, μία κοιλάδα","link":"https://www.gazzetta.gr/football/bundesliga/2204330/salke-vs-ntortmoynt-ena-ntermpi-mia-koilada","keywords":["Ποδόσφαιρο","Bundesliga","Δημοσθένης Γεωργακόπουλος","Ντόρτμουντ","Σάλκε"],"creator":null,"video_url":null,"description":"Το ντέρμπι της κοιλάδας του Ρουρ διεξάγεται σήμερα στην Bundesliga και ο Δημοσθένης Γεωργακόπουλος θυμάται πέντε από τις πιο επικές μονομαχίες, στην πρόσφατη ιστορία, μεταξύ των δύο ομάδων.","content":"Το ντέρμπι του Λέμαν Οι τερματοφύλακες παίζουν πάντοτε καθοριστικό ρόλο σε κάθε ντέρμπι, σε όλες τις χώρες. Το κάνουν με τις αποκρούσεις τους, όμως στο συγκεκριμένο ματς, ο Γενς Λέμαν πρωταγωνίστησε, χάρις στο τέρμα που πέτυχε και διαμόρφωσε το τελικό αποτέλεσμα. Στο ντέρμπι της 20 ης αγωνιστικής, τη σεζόν 1997-98, η Ντόρτμουντ είχε το προβάδισμα με 2-1, με τον Γερμανό γκολκίπερ να προωθείται στις καθυστερήσεις, σε ένα κόρνερ της Σάλκε. Ο Λέμαν κατάφερε να βρει δίχτυα από κοντά και να δώσει το βαθμό της ισοπαλίας στην ομάδα του (2-2), απέναντι στη... μετέπειτα ομάδα του. Όταν η Ντόρτμουντ «γκρέμισε» τα όνειρα τίτλου της Σάλκε Η... κλισέ έκφραση που υπάρχει σε κάθε ντέρμπι είναι ότι «σε αυτά τα ματς το γόητρο αποτελεί το μεγαλύτερο κίνητρο». Κάτι που επαληθεύτηκε 100% στη συγκεκριμένη αναμέτρηση της σεζόν 2006-07. Μία αγωνιστική πριν το τέλος, η Σάλκε ήταν στην πρώτη της βαθμολογίας και ήθελε τη νίκη στο Βεστφάλεν, ώστε να αγκαλιάσει το πρώτο της πρωτάθλημα μετά από σχεδόν 50 χρόνια. Ωστόσο, η μισητή – και βαθμολογικά αδιάφορη – αντίπαλός της είχε αντίθετη άποψη. Η Ντόρτμουντ επικράτησε με 2-0 στο παιχνίδι της 33 ης αγωνιστικής και «γκρέμισε» τη Σάλκε από την κορυφή. Ένα αποτέλεσμα που ουσιαστικά χάρισε τον τίτλο στη Στουτγκάρδη και άφησε στα... κρύα του λουτρού τους «βασιλικούς μπλε». Από την κόλαση, στον παράδεισο Μόλις στο ξεκίνημα της Bundesliga, για τη σεζόν 2008-09, οι δύο ομάδες χάρισαν στο κοινό μία αναμέτρηση υψηλού επιπέδου, με απίστευτες διακυμάνσεις στο σκορ. Η Σάλκε φάνηκε πως θα είχε εύκολο έργο στην έδρα της Ντόρτμουντ, καθώς με τη συμπλήρωση μίας ώρας αγώνα είχε προηγηθεί στο σκορ με 0-3. Παρόλα αυτά, η ομάδα του Γιούργκεν Κλοπ έκανε ένα απίστευτο come back. Μέσα σε διάστημα 20 λεπτών σκόραρε τρεις φορές, διαμορφώνοντας το τελικό 3-3. Μάλιστα, θα μπορούσε να πάρει και τη νίκη, αν είχε λόγο χρόνο ακόμα, αφού οι φιλοξενούμενοι μετρούσαν δύο αποβολές και αγωνίζονταν με εννέα παίκτες. Η κορυφαία παράσταση Ένα από τα πιο τρελά παιχνίδια στην ιστορία της Bundesliga και σίγουρα το πιο εντυπωσιακό ντέρμπι της κοιλάδας του Ρουρ. Στη 13 η αγωνιστική της σεζόν 2017-18, η Ντόρτμουντ έκανε πάρτι στο πρώτο ημίωρο της αναμέτρησης. Προηγήθηκε με το εντυπωσιακό 4-0 και όλα έδειχναν πως θα έφτανε σε μία άνετη επικράτηση. Ωστόσο... κατάφερε να μην κερδίσει καν. Η Σάλκε, αντί να καταρρεύσει, στάθηκε στα πόδια της και στην επανάληψη έφερε τα πάνω-κάτω. Πλήρωσε με το ίδιο νόμισμα την αντίπαλό της, πετυχαίνοντας τέσσερα τέρματα στο τελευταίο 30λεπτο, ισοφαρίζοντας σε 4-4. Η εκδίκηση της Σάλκε Χρειάστηκε να περάσουν δώδεκα χρόνια για να δει η Ντόρτμουντ την αντίθετη όψη του νομίσματος και να στερηθεί τον τίτλο από την μισητή αντίπαλό της. Όπως είχε κάνει εκείνη τη σεζόν 2006-07, έτσι έκανε και η Σάλκε τη σεζόν 2018-19. Με νίκη στην αναμέτρηση της 31ης αγωνιστικής, οι «κιτρινόμαυροι» θα προσπερνούσαν την Μπάγερν και θα ανέβαιναν στην κορυφή της βαθμολογίας, τρεις στροφές πριν την ολοκλήρωση της κούρσας. Ωστόσο, οι «βασιλικοί μπλε» τους χάλασαν τα σχέδια και μάλιστα μέσα στο Signal Iduna Park. Η Σάλκε επικράτησε με το εντυπωσιακό 2-4 και άφησε την Ντόρτμουντ στη δεύτερη θέση, όπου έμεινε ως το τέλος. Και κυρίως, για την ίδια, απομακρύνθηκε από την επικίνδυνη ζώνη.","pubDate":"2023-03-11 07:00:00","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Ολυμπιακός: Οι Μπακαμπού και Μπιέλ έχουν τα 20 από τα 50 «Ερυθρόλευκα» τέρματα στο πρωτάθλημα! (vid)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2203709/olympiakos-oi-mpakampoy-kai-mpiel-ehoyn-ta-20-apo-ta-50","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ολυμπιακός","Δημήτρης Τομαράς","ΑΕΚ","Πεπ Μπιέλ","Σεντρίκ Μπακαμπού"],"creator":null,"video_url":null,"description":"Ο Ισπανός με τον Γαλλοκονγκολέζο φορ είναι το πλέον παραγωγικό δίδυμο και όχι μόνο σε ότι αφορά στην ομάδα του Ολυμπιακού στη Stoiximan Super League 1.","content":"Ο Ισπανός Πεπ Μπιέλ έχει φτάσει τα 8 γκολ στο Πρωτάθλημα της Stoiximan Super League 1 μετά την εμφάνισή του με τον Ολυμπιακό κόντρα στον Λεβαδειακό . Από μέρους του ο Μπιέλ δεν άνοιξε μόνο το σκορ κόντρα στους Βοιωτούς με ένα σούπερ τελείωμα αλλά είχε συνολικά 2 γκολ και 1 κερδισμένο πέναλτι στον αγώνα. Μάλιστα το πέναλτι θα μπορούσε να το είχε χτυπήσει ο ίδιος αλλά άφησε τον συμπαίκτη του, Σεντρίκ Μπακαμπού να το κάνει για να φτάσει ο Γαλλοκονγκολέζος τα 12 τέρματα στην κατηγορία. Ο Μπιέλ μίλησε για τη συγκεκριμένη κίνηση λέγοντας στη COSMOTE TV ότι «στην πραγματικότητα εγώ του έδωσα τη μπάλα. Παρόλο που ήταν η σειρά μου να εκτελέσω το πέναλτι. Οι επιθετικοί έχουν ανάγκη τα γκολ, θέλουν όλοι να σκοράρουν και αν το κάνουν όλοι στο ίδιο παιχνίδι τότε ακόμα καλύτερα». Οι δύο ποδοσφαιριστές, έχουν λοιπόν «χτίσει» ένα πολύ «παραγωγικό» δίδυμο που έφτασε να είναι και το πιο «παραγωγικό» της κατηγορίας. Τα 12 γκολ του Μπακαμπού μαζί με τα 8 Μπιέλ φτάνουν τα 20 από τα 50 των Πειραιωτών χωρίς να βάλουμε μέσα σε αυτά ασίστ ή συμμετοχή σε φάσεις με γκολ. Το συγκεκριμένο δίδυμο μάλιστα σκοράρει ανά 149 λεπτά και το ακολουθεί ρο δίδυμο της ΑΕΚ με Λιβάι Γκαρσία και Άμραμπατ των 152' και των 19 τερμάτων. Ο Ολυμπιακός έχει στο σύνολο 50 γκολ με τον Μπακαμπού να έχει 12 τέρματα και 1 ασίστ και τον Μπιέλ 8 γκολ και 2 ασίστ. Υπενθυμίζεται πως τόσο ο Μπιέλ όσο και ο Μπακαμπού είναι φαβορί για βασικοί με την ΑΕΚ την Κυριακή.","pubDate":"2023-03-11 06:59:01","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Αθλητικές εφημερίδες: Όλα τα πρωτοσέλιδα της ημέρας (11/03) στο Gazzetta","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2204450/athlitikes-efimerides-ola-ta-protoselida-tis-imeras-1103-sto","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Newsroom"],"creator":null,"video_url":null,"description":"Το ΑΕΚ-Ολυμπιακός, η προσφυγή της Ενωσης στο CAS για τα κοντά δοκάρια, η πρώτη Κορακάκη, ο τελικός Κυπέλλου Γυναικών στο βόλεϊ κι η νίκη του Παναθηναϊκού επί του Ερυθρού Αστέρα πρωταγωνιστούν στα σημερινά πρωτοσέλιδα.","content":"Sport Day : «Campeones», το σύνθημα του Μίτσελ στους παίκτες για το ντέρμπι με την ΑΕΚ. Εκεί θέλει να χτυπήσει ο Αλμέιδα τον Ολυμπιακό. Δύσκολα ο Λιβάι Γκαρσία, οι σκέψεις του Αργεντινού. Αλλαξε το... έργο ο Σερέλης στον μπασκετικό Παναθηναϊκό με τη νίκη επί του Ερυθρού Αστέρα. Για μπάλα και τσίπουρα ο ΠΑΟΚ στον Βόλο. Η ζαριά με Ρούμπεν για Γιοβάνοβιτς ενόψει Ατρόμητου. Χρυσό η Άννα Κορακάκη στην σκοποβολή. Live Sport: Όπως παλιά ο Παναθηναϊκός νίκησε τον Ερυθρό Αστέρα, ώρα κούπας στο βόλεϊ γυναικών με τον τελικό Κυπέλλου μεταξύ Παναθηναϊκού και ΑΕΚ. Και διπλό και στο CAS η Ενωση για το ματς με τον Ατρόμητο. Η μεταμόρφωση Κουρμπέλη σε 8άρι. SL2: Απιαστη η Κηφισιά, 2-1 στην Καλαμάτα. Το πλάνο νίκης του Μίτσελ. ΦΩΣ των Σπορ : «Θα παίξουμε ως πρωταθλητές», το μήνυμα Μίτσελ στους παίκτες για το ντέρμπι με ΑΕΚ. Πρώτη σε όλη την Ευρώπη η Κορακάκη. Φυσάει η ομάδα μπάσκετ, ο Μπέικον δεν χάλασε τον Παναθηναϊκό (έμεινε εκτός αποστολής με απόφαση Σερέλη). Πρωταθλητής : Δίψα για ρεβάνς. Εξαιρετικό το κλίμα στου Ρέντη πριν το ματς με την ΑΕΚ. Παίκτης του μήνα ο Χουάνγκ. Το μήνυμα του Βαγγέλη Μαρινάκη για τα γενέθλια του Ολυμπιακού: Αλύγιστοι θα πάμε ψηλότερα. Αθλητική Ώρα των Σπορ : Θέλει σαν τρελός να παίξει ο Λιβάι, αλλά... ΑΕΚάρα φέρε μας το Κύπελλο. Η ΑΕΚ θέλει να φέρει το Final-4 BCL στην Αθήνα. Η ΑΕΚ πάει στο CAS για να ξεμπροστιάσει το παρασκήνιο για τα «κοντά δοκάρια» του Περιστερίου. Metrosport : Ευκαιρία Καμάτσο. Ετοιμάζεται να επιστρέψει στην 11άδα του Αρη έναν χρόνο μετά. Σιαμπάνης: Πρόστιμο 25.000 ευρώ για τη διαρροή των στοιχείων του. Αλώβητος σε βαθμούς και ρόστερ. Δεν αρκεί στον ΠΑΟΚ η νίκη στον Βόλο. Πρέπει να μην κιτρινιστούν Ινγκασον, Κουλιεράκης, Σβαμπ, Ολιβέιρα και Ζίβκοβιτς. ΔΕΙΤΕ ΟΛΑ ΤΑ ΠΡΩΤΟΣΕΛΙΔΑ ΑΘΛΗΤΙΚΩΝ ΕΦΗΜΕΡΙΔΩΝ ΜΕ ΕΝΑ ΚΛΙΚ","pubDate":"2023-03-11 06:37:38","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Mbappé : Transfert annoncé, la date est fixée","link":"https://le10sport.com/football/mercato/mbappe-transfert-annonce-la-date-est-fixee-636611","keywords":null,"creator":null,"video_url":null,"description":"Après la défaite du PSG face au Bayern Munich, Kylian Mbappé n'a pas souhaité aborder le sujet brûlant de son avenir à Paris. Mais en Espagne, cette question a fait les gros titres de l'actualité ce…","content":"Après la défaite du PSG face au Bayern Munich, Kylian Mbappé n'a pas souhaité aborder le sujet brûlant de son avenir à Paris. Mais en Espagne, cette question a fait les gros titres de l'actualité ce jeudi et vendredi. Selon plusieurs médias, le joueur de 24 ans aurait de grandes chances de quitter la France en 2024, au terme de son contrat avec le PSG. Samedi dernier, Kylian Mbappé avait annoncé que son avenir au PSG ne dépendait pas du résultat du match face au Bayern Munich . Bien heureusement pour le club parisien. Car face à la formation allemande, l'équipe française n'a pas existé ce mercredi soir (2-0). Eliminé en huitièmes de finale de Ligue des champions pour la deuxième année consécutive, le PSG déçoit encore et toujours. Alors quand Mbappé débarque en zone mixte après le match, les journalistes se sont précipités vers lui pour lui poser la question. « Si cette défaite relance mon avenir au PSG ? Non, non. On verra. Ce qui m’importe, c’est de gagner le championnat. Pour le reste, on verra » a répondu Mbappé. «Mbappé n'a servi à rien» : Désastre au PSG, il dégoupille https://t.co/ltz5nmBOsG pic.twitter.com/praxO81RjN Mais en Espagne, on pense connaître la décision de Mbappé. Selon plusieurs médias, notamment OK Diario, le joueur regretterait sa prolongation au PSG et désirerait s'engager avec le Real Madrid. Une chose est sûre, ce ne sera pas pour cet été. « Il est impossible que le PSG accepte de négocier pour Mbappé cet été » annonce Edu Aguirre . A en croire le journaliste d' El Chiringuito, Mbappé devrait s'engager avec le Real Madrid en 2024, une fois son aventure parisienne terminée. Une tendance confirmée par OK Diario , qui précise que le joueur va devoir regagner la confiance du club espagnol, encore marqué par le feuilleton de l'année dernière. Ce sera à Mbappé de contacter le Real Madrid et de faire le premier pas. Le début d'un nouveau feuilleton ?","pubDate":"2023-03-11 05:30:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0020/202802.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"Ross County chief blasts SPFL ‘entertainment killer’ and calls for VAR overhaul","link":"https://www.thescottishsun.co.uk/sport/football/10348398/ross-county-spfl-entertainment-killer-var-overhaul/","keywords":["Football","Refereeing","Scottish Premiership","VAR"],"creator":["David Oliver"],"video_url":null,"description":null,"content":"ROY MacGREGOR has begged Hampden chiefs to sort the VAR chaos he says is “killing” the enjoyment for fans. Ross County’s owner fears interference and long delays are spoiling the entertainment for supporters of all clubs. 4 Staggies supremo MacGregor says the system isn't working as sold to clubs Credit: Kenny Ramsay 4 Two penalties were awarded after VAR checks in Celtic's 5-1 win over St Mirren last weekend. Credit: Kenny Ramsay 4 Pauses for video rewinds have delayed games this season. Credit: SNS He believes there’s now a “groundswell of opinion” among fans, managers and owners for major changes to a system which was introduced only five months ago. And the Staggies chairman says clubs did NOT expect so many on-field calls to be over-ruled, or so much time wasted waiting for the decisions. MacGregor told SunSport : “There is a groundswell of opinion from people who are not happy. Read More in Football floodlights, camera... action 9 times Scottish football has made it to Hollywood Pimp my pad Inside the most lavish homes of Scots footy heroes - including pools & cinemas “Not just managers but supporters and owners. “They’re asking, ‘Have they got this right?’ and, ‘Who makes the decisions?’. \"It’s detracting from a supporter’s experience. “They don’t want to wait two minutes for a decision, as we had in two separate incidents. Most read in Football MORE MOVE Rangers star Alfredo Morelos 'signs pre-contract with European giants' MOTD MUTINY Match of The Day chaos as hosts stage mutiny after BBC pull Lineker off air 'INDEFENSIBLE' Sturgeon slams BBC after Gary Lineker forced to step down from MOTD Pimp my pad Inside the most lavish homes of Scots footy heroes - including pools & cinemas “It’s taking the enjoyment away. We’re forgetting about fans here for entertainment and for fun. “We’re in the entertainment industry, after all, but VAR has been killing the entertainment. “I’m not saying this on behalf of Ross County. I’m saying it on behalf of Scottish football . It’s what everyone is thinking.” MacGregor believes the decision-making process flies in the face of everything clubs were told about VAR prior to its introduction in October. He said: “We all wanted VAR brought in to deal with offsides and clear, factual issues — but that’s not happening. 4 Referees are going to the screen too often, he believes. Credit: SNS “We were told VAR would only intervene in cases of clear and obvious error by the ref. “But we’re at the stage where VAR is refereeing the game rather than the referee being in charge. “The VAR simply cannot have the same spatial awareness as a ref who’s on the pitch. “The point was to help the referee — not just have two referees. “When the VAR asks the ref to look at an incident on the screen, the ref questions his own judgement. That can’t be good. “I have always been very supportive of refs. But we need clarity with VAR and things are not being properly explained to us. Read more on the Scottish Sun WHERE'S MR. RIGHT? I’m looking for a handsome cowboy but men never slide into my DMs OH NO I dyed my brown hair blonde & tried the ‘pull test’…I was left totally horrified “Look at the number of handball incidents. We need clarity on what is and isn’t deliberate handball. “Our manager has spoken to the SFA . We all just want the right decisions.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-03-11 08:29:04","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How Man Utd could look like England next season as Harry Kane leads flurry of potential Three Lions signings","link":"https://www.thescottishsun.co.uk/sport/football/10348468/man-utd-line-up-harry-kane-england/","keywords":["Football","Sport","Chelsea transfer news","Manchester United transfer news"],"creator":["Sam Street"],"video_url":null,"description":null,"content":"MANCHESTER UNITED appear to be finally on the right track as Erik Ten Hag closes in on a top four finish. But a 7-0 hammering at Liverpool showed there is work to be done on the transfer front for the Red Devils to be ready for Champions League football. 9 Erik ten Hag will need reinforcements ahead of a likely Champions League campaign next season Credit: EPA 9 Harry Kane is top of Man Utd's summer wish list Credit: PA 9 Man Utd's line up could look a lot more like England next season Harry Kane is a top target, with United confident of a deal . And there is little doubt that should Kane join, he will be accompanied in a front three by Marcus Rashford. The local hero has yet to pen a new deal but with him already enjoying a record goal tally under Ten Hag, why would he want to be anywhere else? On the right, Jadon Sancho will continue to face competition from Alejandro Garnacho and Antony. However, the ex-Man City youngster is expected to hold down regular place at Old Trafford for many years to come. Sancho's old Dortmund team-mate Jude Bellingham is the most sought after player in Europe going into this summer's transfer window. Real Madrid and Liverpool are the favourites to land the midfielder but he has been a United target since his Birmingham days. Should Liverpool fail to make the top four and Bellingham not fancy a move to Spain, the Red Devils will instantly move to pole position for his signature. Most read in Football TEACHER'S PET I was the hottest teacher, parents hit on me & their kids weren't in my class 'BODY GOALS' Helen Flanagan puts on eye-popping display as she shows off new boob job GO WITH THE SNOW Scotland faces -17C weekend WHITEOUT with heavy snow hitting central belt FRESH START Griffiths explains Oz move as he opens up on Rangers and Hearts fan torment HOW TO GET FREE BETS ON FOOTBALL 9 Man Utd still have an eye on Jude Bellingham despite Liverpool and Real Madrid leading the race Credit: Getty 9 Declan Rice is a player United have been interested in for a long time Credit: Getty 9 Mason Mount is available on a free transfer in 2024, so could be allowed to leave on the cheap this summer Credit: Getty And partnering Bellingham could be Declan Rice, who has also been a long term United target. The signing for Rice would also set up an intriguing battle for a place with enforcer Casemiro, who has more than lived up to his £70m price tag to become one of the team's most impressive performers. However, the Red Devils will face stiff competition from London sides Arsenal and Chelsea for Rice's signature . But they could get one over Chelsea by purchasing Mason Mount in a cut price deal, with his contract to expire in 2024. The attacking midfielder has yet to agree a new deal with the Blues and both his performances and relationship with the West London club's hierarchy appear to be deteriorating . It is thought that the West Londoners would be prepared to sell for a fee of around £50m . Signing Mason Mount would also ramp up the pressure on Bruno Fernandes. The vice-captain infuriated United fans with his display at Anfield, as he was even accused of asking to be substituted . Aaron Wan-Bissaka has yet to impress Gareth Southgate sufficiently on the ball to earn an England cap. However, things are different at Old Trafford where his attitude has impressed the manager and he has muscled his way into first team contention. Captain Harry Maguire is also in and out of the team, and a potential candidate to leave United in the summer. However, he claims Erik ten Hag has told him he is a top centre-back and he may yet decide to stay and fight for his place. Luke Shaw has shown himself to be capable of filling it at left-centre-back when called upon, and is set to continue starting there or at left-back for the foreseeable future. 9 Man Utd have used among the lowest number of English players in the Premier League this season, but that could be about to change Should Shaw make a more permanent switch to centre-back, United would need to decide whether or not to sign competition for Tyrell Malacia at left-back. Chelsea's Ben Chilwell is far from a top Man Utd target, but he is a lifelong fan of the club. In goal, David de Gea is closing in on a new deal but is looking less and less a long-term option. That is reflected in Man Utd preparing to offer the Spaniard a reduced and incentive-based contract . The Sun has revealed that the 32-year-old will only be able to pick up the maximum £250,000-salary he is being offered if he plays in over 50 per cent of matches. England goalkeeper Jordan Pickford is in no hurry to leave Everton as he has just agreed a new £150,000-a-week deal . However, the Toffees are 18th in the table having played a game more than the competition. Read more on the Scottish Sun WHERE'S MR. RIGHT? I’m looking for a handsome cowboy but men never slide into my DMs OH NO I dyed my brown hair blonde & tried the ‘pull test’…I was left totally horrified With Pickford's impending new contract containing no relegation clause, it is difficult to see the Three Lions stopper playing in the Championship. And though Chelsea are said to be the club most keen on Pickford, with their need for a new goalkeeper greater than Man Utd's, the Red Devils will have to purchase a new man between the sticks in the relatively near future. 9 Ben Chilwell is a lifelong Man Utd fan Credit: Getty 9 Jordan Pickford is at risk of being relegated Credit: Alamy","pubDate":"2023-03-11 08:23:58","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bournemouth vs Liverpool LIVE SCORE: Premier League latest as Reds look to build on Man Utd mauling – stream, TV channel","link":"https://www.thescottishsun.co.uk/sport/football/10337935/bournemouth-liverpool-live-score-result-stream-watch-premier-league-online/","keywords":["Football","Sport","Premier League","Sport Live Blogs"],"creator":["Nyle Smith"],"video_url":null,"description":null,"content":"TOP four chasing Liverpool go up against relegation-threatened Bournemouth as they look to build on their 7-0 Premier League pummelling on Manchester United. Goals from Cody Gakpo, Darwin Nunez, Mo Salah and Roberto Firmino handed the Red Devils their heaviest defeat since Wolves in 1930. While Reiss Nelson's stoppage time strike saw Arsenal snatch all three points from the Cherries in their recent outing. Kick-off time: TODAY, Saturday, March 11 - 12:30pm GMT Live stream: BT Sport TV channel: BT Sport 1 CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 Follow ALL the action with our live blog below... Load more entries… Topics Football Premier League Sport Live Blogs Bournemouth Liverpool YOU MIGHT LIKE","pubDate":"2023-03-11 08:00:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | 'Football gods on our side': Dondol Stars to bag at least R400k after Nedbank Cup giant-killing run","link":"https://www.news24.com/sport/Soccer/PSL/football-gods-on-our-side-dondol-stars-to-bag-at-least-r400k-after-nedbank-cup-giant-killing-run-20230311","keywords":null,"creator":null,"video_url":null,"description":"Dondol Stars have defied the footballing odds this season, knocking over SuperSport United and AmaZulu in the Nedbank Cup.","content":"Dondol Stars have defied the footballing odds this season. The third-tier outfit, vying to climb out of the ABC Motsepe League (Gauteng Province), added another Premier Soccer League giant killing to their list. After outwitting SuperSport United in the Nedbank Cup Round of 32 in a 2-1 win, the Mamelodi-based side went after AmaZulu in the last 16 on Wednesday. Stars cancelled out Hendrick Ekstein's opening goal in the second half via Renaldo Fox and forced the Durban side all the way to a penalty shootout, winning 5-4 to advance to the quarter-finals. \"We are happy and excited. I hoped and prayed that our boys come to the party, and they came,\" Dondol co-coach Khuliso Rashamuse said during his post-match interview with SuperSport TV. \"We pushed our players. We did not have anything to lose. They came to the party, and they danced and had fun. \"Penalties are lotteries. Anything can happen. The football gods were on our side. It was in the players' hearts, they wanted it the most, that's where we won it. \"Besides it being history, it is a great achievement of the team. We want to remain humble. Focus on the league, and if we win, we go to the Gladafrica Championship (now Motsepe Foundation Championship). My life, Vini's (co-coach Vincent Rammoni) life and the players' changes.\" READ | Mtolo collapsed with 15 minutes left to train, says coach. After that, things moved fast The Dondol Stars will aim to join Baroka FC, who defeated Kaizer Chiefs in last eight round of 2011 and remain the only third tier team to fell top flight opposition in the Nedbank Cup quarter-finals. The ABC Motsepe League side are now guaranteed to walk away with at least R400 000 for their efforts, which could go a long way for the club from the third tier. And if that is not enough, it could increase to R1 million if they are to nab a semi-final shout. Advancing to the final will see that purse increase to R2.5 million, while winning the tournament will see Dondol claim R7 million. Dondol, alongside Mamelodi Sundowns, have thus far advanced to Monday's (13 March) quarter-final draw. Meanwhile, Dondol Stars are top of the Gauteng stream of the ABC Motsepe League with a healthy nine-point lead over second place Pele Pele FC. If they are to win the Gauteng stream, they will then enter the overall playoff and have a chance of being crowned ABC Motsepe League champions. The two teams in the final playoff match will be promoted to the Motsepe Foundation Championship.","pubDate":"2023-03-11 07:50:32","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Μπενζεμά στο Instagram μετά από δηλώσεις Ντεσάν: «Τι θράσος, καληνύχτα Ντιντιέ»","link":"https://www.gazzetta.gr/football/moyntial-2022/2204452/mpenzema-sto-instagram-meta-apo-diloseis-ntesan-ti-thrasos-kalinyhta","keywords":["Ποδόσφαιρο","Μουντιάλ 2022","Κωνσταντίνος Κωλαΐτης","Ρεάλ Μαδρίτης","Γαλλία","Καρίμ Μπενζεμά","Ντιντιέ Ντεσάν"],"creator":null,"video_url":null,"description":"Ο Ντιντιέ Ντεσάν παραχώρησε συνέντευξη στην «Parisien» στην οποία μίλησε μεταξύ άλλων για το σίριαλ της απουσίας του Καρίμ Μπενζεμά από το Μουντιάλ, με τον Γάλλο στράικερ να απαντά στο Instagram με emoji... κλόουν και «αιχμηρές» ατάκες.","content":"Η εθνική Γαλλίας θα συνεχίσει με τον Ντιντιέ Ντεσάν στο τιμόνι της τουλάχιστον μέχρι το Παγκόσμιο Κύπελλο του 2026 και ο ομοσπονδιακός τεχνικός των Μπλε παραχώρησε την πρώτη του συνέντευξη μετά την ανανέωση του συμβολαίου του, στην οποία αναπόφευκτα αναφέρθηκε και στον Καρίμ Μπενζεμά. Ο Γάλλος στράικερ αποτέλεσε ένα από τα μεγάλα «πλήγματα» για το σύνολο του Ντεσάν στο Μουντιάλ αφού προερχόταν από τραυματισμό και κρίθηκε ανέτοιμος, μένοντας εν τέλει εκτός αποστολής. Στα τέλη Νοεμβρίου κι ενώ η Γαλλία βάδιζε εκ του ασφαλούς στην πρόκριση στα νοκ-άουτ, υπήρξαν δημοσιεύματα που ήθελαν τον εκλέκτορα των Μπλε να καλεί εκ νέου τον φορ της Ρεάλ στην αποστολή για την τελική ευθεία της διοργάνωσης, κάτι που δεν συνέβη ποτέ. Ο ίδιος ο Μπενζεμά, μάλιστα, δήλωσε λίγες μέρες αργότερα σε ανάρτηση του στο Instagram ότι «δεν ενδιαφέρομαι» και την επομένη του τελικού του Μουντιάλ ανακοίνωσε και τυπικά τους τίτλους τέλους από την εθνική , κάνοντας ακολούθως unfollow όλους τους συμπαίκτες του. Πλέον, τρεις μήνες μετά το εν λόγω σίριαλ, ο Ντεσάν έδωσε τη δική του εκδοχή για το ζήτημα με την αρχική απουσία του Μπενζεμά λόγω τραυματισμού και τον λόγο που δεν επέστρεψε, τονίζοντας ότι ο ίδιος ο παίκτης τού είπε πως δεν ήταν σε θέση να βοηθήσει. « Με προσβάλλει που το λέτε αυτό. Υπάρχει μόνο μία αλήθεια και ο Καρίμ την ξέρει καλά. Ο Καρίμ μπήκε στην προεπιλογή μας στις 14 Νοεμβρίου μετά από ένα διάστημα που ήταν σχεδόν ανενεργός με τον σύλλογό του. Ακολούθησε ατομικό πρόγραμμα, η επιστροφή του στις ομαδικές προπονήσεις αναβλήθηκε. Δεν ήταν 100% σίγουρος ότι θα μπορούσε να ξεκινήσει στο ματς με την Αυστραλία. Ο Καρίμ ήταν εκνευρισμένος γιατί το Μουντιάλ σήμαινε πολλά για αυτόν. Στην καλύτερη των περιπτώσεων θα γυρνούσε στις προπονήσεις στις 10 Δεκεμβρίου. Την τελευταία φορά που τον είδα του είπα ''Καρίμ, μη βιαστείς''. Να οργάνωνε την επιστροφή του με τον team manager. Όταν ξύπνησα, είχε ήδη φύγει. Ήταν απόφασή του, δεν θα σας πει κάτι άλλο, το καταλαβαίνω και το σέβομαι» «Πιστεύετε πραγματικά πως μπορεί να συγκριθεί ένα φιλικό με τη Ρεάλ Μαδρίτης με την ένταση ενός ημιτελικού Μουντιάλ; Το ταλέντο και το στάτους του δεν αμφισβητούνται, αλλά μπορείτε να φανταστείτε να γύριζε την τελευταία στιγμή; Ο ίδιος ο Καρίμ μού είπε ότι δεν θα ήταν έτοιμος ». Απ' ό,τι φαίνεται, όμως, ο Μπενζεμά δεν συμφωνεί καθόλου με την εκδοχή του Γάλλου τεχνικού. Συγκεκριμένα, ανέβασε story στο Instagam με φωτογραφία από τη συνέντευξη κι έγραψε «Τι θράσος», συνοδεύοντας τη φράση με ένα emoji κλόουν! Στο δεύτερο story που ακολούθησε, έγραψε χαρακτηριστικά «Καληνύχτα Άγιε Ντιντιέ».","pubDate":"2023-03-11 07:03:19","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Programme du Samedi 11 Mars 2023","link":"https://www.dzfoot.com/programme-tv/programme-du-samedi-11-mars-2023-239384.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Programme TV","Ligue 1","Diffusion","Premier League"],"creator":null,"video_url":null,"description":"Voici le programme de DZfoot! Au sommaire, une sélection (non-exhaustive) des matchs impliquant les Algériens évoluant à travers le monde ainsi qu’une liste des plus belles affiches du jour. Tous les horaires indiqués sont à l’heure d’Alger. Matchs des Algériens évoluant à l'étranger 15:30 Bundesliga (Allemagne) | Leipzig - Mönchengladbach (Bensebaini*) beIN Sports 7 (Mena); beIN […] The post Programme du Samedi 11 Mars 2023 appeared first on Football Algérien - DZFOOT.COM.","content":"Voici le programme de DZfoot! Au sommaire , une sélection (non-exhaustive) des matchs impliquant les Algériens évoluant à travers le monde ainsi qu’une liste des plus belles affiches du jour. Tous les horaires indiqués sont à l’heure d’Alger. Matchs des Algériens évoluant à l'étranger 15:30 Bundesliga (Allemagne) | Leipzig - Mönchengladbach ( Bensebaini* ) beIN Sports 7 (Mena); beIN Sports 5 max (France) 17:00 Ligue 1 (France) | Auxerre - Rennes (A. Zedadka) beIN Sports 2 (Mena); Prime Video (France) 18:15 Pro League (Belgique) | Westerlo - Courtrai KV (Kadri) Eleven Sports Online 18:30 Premier League (Angleterre) | Crystal Palace - Manchester City (Mahrez) beIN Sports Premium 1 (Mena); Canal+ Foot (France) 18:45 Eredivisie (Pays-Bas) | Fortuna Sittard - Twente (R. Zerrouki) 20:45 Super League (Suisse) | Lugano - Zürich (Amoura) 21:00 Ligue 1 (France) | Brest - PSG (Belkebla) beIN Sports 2 (Mena); Prime Video (France) *Suspendu DZfoot","pubDate":"2023-03-11 07:00:40","image_url":null,"source_id":"dzfoot","category":["sports"],"country":["algeria"],"language":"french"},{"title":"Σάλκε vs Ντόρτμουντ: Ένα ντέρμπι, μία κοιλάδα","link":"https://www.gazzetta.gr/football/bundesliga/2204330/salke-vs-ntortmoynt-ena-ntermpi-mia-koilada","keywords":["Ποδόσφαιρο","Bundesliga","Δημοσθένης Γεωργακόπουλος","Ντόρτμουντ","Σάλκε"],"creator":null,"video_url":null,"description":"Το ντέρμπι της κοιλάδας του Ρουρ διεξάγεται σήμερα στην Bundesliga και ο Δημοσθένης Γεωργακόπουλος θυμάται πέντε από τις πιο επικές μονομαχίες, στην πρόσφατη ιστορία, μεταξύ των δύο ομάδων.","content":"Το ντέρμπι του Λέμαν Οι τερματοφύλακες παίζουν πάντοτε καθοριστικό ρόλο σε κάθε ντέρμπι, σε όλες τις χώρες. Το κάνουν με τις αποκρούσεις τους, όμως στο συγκεκριμένο ματς, ο Γενς Λέμαν πρωταγωνίστησε, χάρις στο τέρμα που πέτυχε και διαμόρφωσε το τελικό αποτέλεσμα. Στο ντέρμπι της 20 ης αγωνιστικής, τη σεζόν 1997-98, η Ντόρτμουντ είχε το προβάδισμα με 2-1, με τον Γερμανό γκολκίπερ να προωθείται στις καθυστερήσεις, σε ένα κόρνερ της Σάλκε. Ο Λέμαν κατάφερε να βρει δίχτυα από κοντά και να δώσει το βαθμό της ισοπαλίας στην ομάδα του (2-2), απέναντι στη... μετέπειτα ομάδα του. Όταν η Ντόρτμουντ «γκρέμισε» τα όνειρα τίτλου της Σάλκε Η... κλισέ έκφραση που υπάρχει σε κάθε ντέρμπι είναι ότι «σε αυτά τα ματς το γόητρο αποτελεί το μεγαλύτερο κίνητρο». Κάτι που επαληθεύτηκε 100% στη συγκεκριμένη αναμέτρηση της σεζόν 2006-07. Μία αγωνιστική πριν το τέλος, η Σάλκε ήταν στην πρώτη της βαθμολογίας και ήθελε τη νίκη στο Βεστφάλεν, ώστε να αγκαλιάσει το πρώτο της πρωτάθλημα μετά από σχεδόν 50 χρόνια. Ωστόσο, η μισητή – και βαθμολογικά αδιάφορη – αντίπαλός της είχε αντίθετη άποψη. Η Ντόρτμουντ επικράτησε με 2-0 στο παιχνίδι της 33 ης αγωνιστικής και «γκρέμισε» τη Σάλκε από την κορυφή. Ένα αποτέλεσμα που ουσιαστικά χάρισε τον τίτλο στη Στουτγκάρδη και άφησε στα... κρύα του λουτρού τους «βασιλικούς μπλε». Από την κόλαση, στον παράδεισο Μόλις στο ξεκίνημα της Bundesliga, για τη σεζόν 2008-09, οι δύο ομάδες χάρισαν στο κοινό μία αναμέτρηση υψηλού επιπέδου, με απίστευτες διακυμάνσεις στο σκορ. Η Σάλκε φάνηκε πως θα είχε εύκολο έργο στην έδρα της Ντόρτμουντ, καθώς με τη συμπλήρωση μίας ώρας αγώνα είχε προηγηθεί στο σκορ με 0-3. Παρόλα αυτά, η ομάδα του Γιούργκεν Κλοπ έκανε ένα απίστευτο come back. Μέσα σε διάστημα 20 λεπτών σκόραρε τρεις φορές, διαμορφώνοντας το τελικό 3-3. Μάλιστα, θα μπορούσε να πάρει και τη νίκη, αν είχε λόγο χρόνο ακόμα, αφού οι φιλοξενούμενοι μετρούσαν δύο αποβολές και αγωνίζονταν με εννέα παίκτες. Η κορυφαία παράσταση Ένα από τα πιο τρελά παιχνίδια στην ιστορία της Bundesliga και σίγουρα το πιο εντυπωσιακό ντέρμπι της κοιλάδας του Ρουρ. Στη 13 η αγωνιστική της σεζόν 2017-18, η Ντόρτμουντ έκανε πάρτι στο πρώτο ημίωρο της αναμέτρησης. Προηγήθηκε με το εντυπωσιακό 4-0 και όλα έδειχναν πως θα έφτανε σε μία άνετη επικράτηση. Ωστόσο... κατάφερε να μην κερδίσει καν. Η Σάλκε, αντί να καταρρεύσει, στάθηκε στα πόδια της και στην επανάληψη έφερε τα πάνω-κάτω. Πλήρωσε με το ίδιο νόμισμα την αντίπαλό της, πετυχαίνοντας τέσσερα τέρματα στο τελευταίο 30λεπτο, ισοφαρίζοντας σε 4-4. Η εκδίκηση της Σάλκε Χρειάστηκε να περάσουν δώδεκα χρόνια για να δει η Ντόρτμουντ την αντίθετη όψη του νομίσματος και να στερηθεί τον τίτλο από την μισητή αντίπαλό της. Όπως είχε κάνει εκείνη τη σεζόν 2006-07, έτσι έκανε και η Σάλκε τη σεζόν 2018-19. Με νίκη στην αναμέτρηση της 31ης αγωνιστικής, οι «κιτρινόμαυροι» θα προσπερνούσαν την Μπάγερν και θα ανέβαιναν στην κορυφή της βαθμολογίας, τρεις στροφές πριν την ολοκλήρωση της κούρσας. Ωστόσο, οι «βασιλικοί μπλε» τους χάλασαν τα σχέδια και μάλιστα μέσα στο Signal Iduna Park. Η Σάλκε επικράτησε με το εντυπωσιακό 2-4 και άφησε την Ντόρτμουντ στη δεύτερη θέση, όπου έμεινε ως το τέλος. Και κυρίως, για την ίδια, απομακρύνθηκε από την επικίνδυνη ζώνη.","pubDate":"2023-03-11 07:00:00","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Ολυμπιακός: Οι Μπακαμπού και Μπιέλ έχουν τα 20 από τα 50 «Ερυθρόλευκα» τέρματα στο πρωτάθλημα! (vid)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2203709/olympiakos-oi-mpakampoy-kai-mpiel-ehoyn-ta-20-apo-ta-50","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ολυμπιακός","Δημήτρης Τομαράς","ΑΕΚ","Πεπ Μπιέλ","Σεντρίκ Μπακαμπού"],"creator":null,"video_url":null,"description":"Ο Ισπανός με τον Γαλλοκονγκολέζο φορ είναι το πλέον παραγωγικό δίδυμο και όχι μόνο σε ότι αφορά στην ομάδα του Ολυμπιακού στη Stoiximan Super League 1.","content":"Ο Ισπανός Πεπ Μπιέλ έχει φτάσει τα 8 γκολ στο Πρωτάθλημα της Stoiximan Super League 1 μετά την εμφάνισή του με τον Ολυμπιακό κόντρα στον Λεβαδειακό . Από μέρους του ο Μπιέλ δεν άνοιξε μόνο το σκορ κόντρα στους Βοιωτούς με ένα σούπερ τελείωμα αλλά είχε συνολικά 2 γκολ και 1 κερδισμένο πέναλτι στον αγώνα. Μάλιστα το πέναλτι θα μπορούσε να το είχε χτυπήσει ο ίδιος αλλά άφησε τον συμπαίκτη του, Σεντρίκ Μπακαμπού να το κάνει για να φτάσει ο Γαλλοκονγκολέζος τα 12 τέρματα στην κατηγορία. Ο Μπιέλ μίλησε για τη συγκεκριμένη κίνηση λέγοντας στη COSMOTE TV ότι «στην πραγματικότητα εγώ του έδωσα τη μπάλα. Παρόλο που ήταν η σειρά μου να εκτελέσω το πέναλτι. Οι επιθετικοί έχουν ανάγκη τα γκολ, θέλουν όλοι να σκοράρουν και αν το κάνουν όλοι στο ίδιο παιχνίδι τότε ακόμα καλύτερα». Οι δύο ποδοσφαιριστές, έχουν λοιπόν «χτίσει» ένα πολύ «παραγωγικό» δίδυμο που έφτασε να είναι και το πιο «παραγωγικό» της κατηγορίας. Τα 12 γκολ του Μπακαμπού μαζί με τα 8 Μπιέλ φτάνουν τα 20 από τα 50 των Πειραιωτών χωρίς να βάλουμε μέσα σε αυτά ασίστ ή συμμετοχή σε φάσεις με γκολ. Το συγκεκριμένο δίδυμο μάλιστα σκοράρει ανά 149 λεπτά και το ακολουθεί ρο δίδυμο της ΑΕΚ με Λιβάι Γκαρσία και Άμραμπατ των 152' και των 19 τερμάτων. Ο Ολυμπιακός έχει στο σύνολο 50 γκολ με τον Μπακαμπού να έχει 12 τέρματα και 1 ασίστ και τον Μπιέλ 8 γκολ και 2 ασίστ. Υπενθυμίζεται πως τόσο ο Μπιέλ όσο και ο Μπακαμπού είναι φαβορί για βασικοί με την ΑΕΚ την Κυριακή.","pubDate":"2023-03-11 06:59:01","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Αθλητικές εφημερίδες: Όλα τα πρωτοσέλιδα της ημέρας (11/03) στο Gazzetta","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2204450/athlitikes-efimerides-ola-ta-protoselida-tis-imeras-1103-sto","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Newsroom"],"creator":null,"video_url":null,"description":"Το ΑΕΚ-Ολυμπιακός, η προσφυγή της Ενωσης στο CAS για τα κοντά δοκάρια, η πρώτη Κορακάκη, ο τελικός Κυπέλλου Γυναικών στο βόλεϊ κι η νίκη του Παναθηναϊκού επί του Ερυθρού Αστέρα πρωταγωνιστούν στα σημερινά πρωτοσέλιδα.","content":"Sport Day : «Campeones», το σύνθημα του Μίτσελ στους παίκτες για το ντέρμπι με την ΑΕΚ. Εκεί θέλει να χτυπήσει ο Αλμέιδα τον Ολυμπιακό. Δύσκολα ο Λιβάι Γκαρσία, οι σκέψεις του Αργεντινού. Αλλαξε το... έργο ο Σερέλης στον μπασκετικό Παναθηναϊκό με τη νίκη επί του Ερυθρού Αστέρα. Για μπάλα και τσίπουρα ο ΠΑΟΚ στον Βόλο. Η ζαριά με Ρούμπεν για Γιοβάνοβιτς ενόψει Ατρόμητου. Χρυσό η Άννα Κορακάκη στην σκοποβολή. Live Sport: Όπως παλιά ο Παναθηναϊκός νίκησε τον Ερυθρό Αστέρα, ώρα κούπας στο βόλεϊ γυναικών με τον τελικό Κυπέλλου μεταξύ Παναθηναϊκού και ΑΕΚ. Και διπλό και στο CAS η Ενωση για το ματς με τον Ατρόμητο. Η μεταμόρφωση Κουρμπέλη σε 8άρι. SL2: Απιαστη η Κηφισιά, 2-1 στην Καλαμάτα. Το πλάνο νίκης του Μίτσελ. ΦΩΣ των Σπορ : «Θα παίξουμε ως πρωταθλητές», το μήνυμα Μίτσελ στους παίκτες για το ντέρμπι με ΑΕΚ. Πρώτη σε όλη την Ευρώπη η Κορακάκη. Φυσάει η ομάδα μπάσκετ, ο Μπέικον δεν χάλασε τον Παναθηναϊκό (έμεινε εκτός αποστολής με απόφαση Σερέλη). Πρωταθλητής : Δίψα για ρεβάνς. Εξαιρετικό το κλίμα στου Ρέντη πριν το ματς με την ΑΕΚ. Παίκτης του μήνα ο Χουάνγκ. Το μήνυμα του Βαγγέλη Μαρινάκη για τα γενέθλια του Ολυμπιακού: Αλύγιστοι θα πάμε ψηλότερα. Αθλητική Ώρα των Σπορ : Θέλει σαν τρελός να παίξει ο Λιβάι, αλλά... ΑΕΚάρα φέρε μας το Κύπελλο. Η ΑΕΚ θέλει να φέρει το Final-4 BCL στην Αθήνα. Η ΑΕΚ πάει στο CAS για να ξεμπροστιάσει το παρασκήνιο για τα «κοντά δοκάρια» του Περιστερίου. Metrosport : Ευκαιρία Καμάτσο. Ετοιμάζεται να επιστρέψει στην 11άδα του Αρη έναν χρόνο μετά. Σιαμπάνης: Πρόστιμο 25.000 ευρώ για τη διαρροή των στοιχείων του. Αλώβητος σε βαθμούς και ρόστερ. Δεν αρκεί στον ΠΑΟΚ η νίκη στον Βόλο. Πρέπει να μην κιτρινιστούν Ινγκασον, Κουλιεράκης, Σβαμπ, Ολιβέιρα και Ζίβκοβιτς. ΔΕΙΤΕ ΟΛΑ ΤΑ ΠΡΩΤΟΣΕΛΙΔΑ ΑΘΛΗΤΙΚΩΝ ΕΦΗΜΕΡΙΔΩΝ ΜΕ ΕΝΑ ΚΛΙΚ","pubDate":"2023-03-11 06:37:38","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Mbappé : Transfert annoncé, la date est fixée","link":"https://le10sport.com/football/mercato/mbappe-transfert-annonce-la-date-est-fixee-636611","keywords":null,"creator":null,"video_url":null,"description":"Après la défaite du PSG face au Bayern Munich, Kylian Mbappé n'a pas souhaité aborder le sujet brûlant de son avenir à Paris. Mais en Espagne, cette question a fait les gros titres de l'actualité ce…","content":"Après la défaite du PSG face au Bayern Munich, Kylian Mbappé n'a pas souhaité aborder le sujet brûlant de son avenir à Paris. Mais en Espagne, cette question a fait les gros titres de l'actualité ce jeudi et vendredi. Selon plusieurs médias, le joueur de 24 ans aurait de grandes chances de quitter la France en 2024, au terme de son contrat avec le PSG. Samedi dernier, Kylian Mbappé avait annoncé que son avenir au PSG ne dépendait pas du résultat du match face au Bayern Munich . Bien heureusement pour le club parisien. Car face à la formation allemande, l'équipe française n'a pas existé ce mercredi soir (2-0). Eliminé en huitièmes de finale de Ligue des champions pour la deuxième année consécutive, le PSG déçoit encore et toujours. Alors quand Mbappé débarque en zone mixte après le match, les journalistes se sont précipités vers lui pour lui poser la question. « Si cette défaite relance mon avenir au PSG ? Non, non. On verra. Ce qui m’importe, c’est de gagner le championnat. Pour le reste, on verra » a répondu Mbappé. «Mbappé n'a servi à rien» : Désastre au PSG, il dégoupille https://t.co/ltz5nmBOsG pic.twitter.com/praxO81RjN Mais en Espagne, on pense connaître la décision de Mbappé. Selon plusieurs médias, notamment OK Diario, le joueur regretterait sa prolongation au PSG et désirerait s'engager avec le Real Madrid. Une chose est sûre, ce ne sera pas pour cet été. « Il est impossible que le PSG accepte de négocier pour Mbappé cet été » annonce Edu Aguirre . A en croire le journaliste d' El Chiringuito, Mbappé devrait s'engager avec le Real Madrid en 2024, une fois son aventure parisienne terminée. Une tendance confirmée par OK Diario , qui précise que le joueur va devoir regagner la confiance du club espagnol, encore marqué par le feuilleton de l'année dernière. Ce sera à Mbappé de contacter le Real Madrid et de faire le premier pas. Le début d'un nouveau feuilleton ?","pubDate":"2023-03-11 05:30:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0020/202802.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"Ross County chief blasts SPFL ‘entertainment killer’ and calls for VAR overhaul","link":"https://www.thescottishsun.co.uk/sport/football/10348398/ross-county-spfl-entertainment-killer-var-overhaul/","keywords":["Football","Refereeing","Scottish Premiership","VAR"],"creator":["David Oliver"],"video_url":null,"description":null,"content":"ROY MacGREGOR has begged Hampden chiefs to sort the VAR chaos he says is “killing” the enjoyment for fans. Ross County’s owner fears interference and long delays are spoiling the entertainment for supporters of all clubs. 4 Staggies supremo MacGregor says the system isn't working as sold to clubs Credit: Kenny Ramsay 4 Two penalties were awarded after VAR checks in Celtic's 5-1 win over St Mirren last weekend. Credit: Kenny Ramsay 4 Pauses for video rewinds have delayed games this season. Credit: SNS He believes there’s now a “groundswell of opinion” among fans, managers and owners for major changes to a system which was introduced only five months ago. And the Staggies chairman says clubs did NOT expect so many on-field calls to be over-ruled, or so much time wasted waiting for the decisions. MacGregor told SunSport : “There is a groundswell of opinion from people who are not happy. Read More in Football floodlights, camera... action 9 times Scottish football has made it to Hollywood Pimp my pad Inside the most lavish homes of Scots footy heroes - including pools & cinemas “Not just managers but supporters and owners. “They’re asking, ‘Have they got this right?’ and, ‘Who makes the decisions?’. \"It’s detracting from a supporter’s experience. “They don’t want to wait two minutes for a decision, as we had in two separate incidents. Most read in Football MORE MOVE Rangers star Alfredo Morelos 'signs pre-contract with European giants' MOTD MUTINY Match of The Day chaos as hosts stage mutiny after BBC pull Lineker off air 'INDEFENSIBLE' Sturgeon slams BBC after Gary Lineker forced to step down from MOTD Pimp my pad Inside the most lavish homes of Scots footy heroes - including pools & cinemas “It’s taking the enjoyment away. We’re forgetting about fans here for entertainment and for fun. “We’re in the entertainment industry, after all, but VAR has been killing the entertainment. “I’m not saying this on behalf of Ross County. I’m saying it on behalf of Scottish football . It’s what everyone is thinking.” MacGregor believes the decision-making process flies in the face of everything clubs were told about VAR prior to its introduction in October. He said: “We all wanted VAR brought in to deal with offsides and clear, factual issues — but that’s not happening. 4 Referees are going to the screen too often, he believes. Credit: SNS “We were told VAR would only intervene in cases of clear and obvious error by the ref. “But we’re at the stage where VAR is refereeing the game rather than the referee being in charge. “The VAR simply cannot have the same spatial awareness as a ref who’s on the pitch. “The point was to help the referee — not just have two referees. “When the VAR asks the ref to look at an incident on the screen, the ref questions his own judgement. That can’t be good. “I have always been very supportive of refs. But we need clarity with VAR and things are not being properly explained to us. Read more on the Scottish Sun WHERE'S MR. RIGHT? I’m looking for a handsome cowboy but men never slide into my DMs OH NO I dyed my brown hair blonde & tried the ‘pull test’…I was left totally horrified “Look at the number of handball incidents. We need clarity on what is and isn’t deliberate handball. “Our manager has spoken to the SFA . We all just want the right decisions.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-03-11 08:29:04","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How Man Utd could look like England next season as Harry Kane leads flurry of potential Three Lions signings","link":"https://www.thescottishsun.co.uk/sport/football/10348468/man-utd-line-up-harry-kane-england/","keywords":["Football","Sport","Chelsea transfer news","Manchester United transfer news"],"creator":["Sam Street"],"video_url":null,"description":null,"content":"MANCHESTER UNITED appear to be finally on the right track as Erik Ten Hag closes in on a top four finish. But a 7-0 hammering at Liverpool showed there is work to be done on the transfer front for the Red Devils to be ready for Champions League football. 9 Erik ten Hag will need reinforcements ahead of a likely Champions League campaign next season Credit: EPA 9 Harry Kane is top of Man Utd's summer wish list Credit: PA 9 Man Utd's line up could look a lot more like England next season Harry Kane is a top target, with United confident of a deal . And there is little doubt that should Kane join, he will be accompanied in a front three by Marcus Rashford. The local hero has yet to pen a new deal but with him already enjoying a record goal tally under Ten Hag, why would he want to be anywhere else? On the right, Jadon Sancho will continue to face competition from Alejandro Garnacho and Antony. However, the ex-Man City youngster is expected to hold down regular place at Old Trafford for many years to come. Sancho's old Dortmund team-mate Jude Bellingham is the most sought after player in Europe going into this summer's transfer window. Real Madrid and Liverpool are the favourites to land the midfielder but he has been a United target since his Birmingham days. Should Liverpool fail to make the top four and Bellingham not fancy a move to Spain, the Red Devils will instantly move to pole position for his signature. Most read in Football TEACHER'S PET I was the hottest teacher, parents hit on me & their kids weren't in my class 'BODY GOALS' Helen Flanagan puts on eye-popping display as she shows off new boob job GO WITH THE SNOW Scotland faces -17C weekend WHITEOUT with heavy snow hitting central belt FRESH START Griffiths explains Oz move as he opens up on Rangers and Hearts fan torment HOW TO GET FREE BETS ON FOOTBALL 9 Man Utd still have an eye on Jude Bellingham despite Liverpool and Real Madrid leading the race Credit: Getty 9 Declan Rice is a player United have been interested in for a long time Credit: Getty 9 Mason Mount is available on a free transfer in 2024, so could be allowed to leave on the cheap this summer Credit: Getty And partnering Bellingham could be Declan Rice, who has also been a long term United target. The signing for Rice would also set up an intriguing battle for a place with enforcer Casemiro, who has more than lived up to his £70m price tag to become one of the team's most impressive performers. However, the Red Devils will face stiff competition from London sides Arsenal and Chelsea for Rice's signature . But they could get one over Chelsea by purchasing Mason Mount in a cut price deal, with his contract to expire in 2024. The attacking midfielder has yet to agree a new deal with the Blues and both his performances and relationship with the West London club's hierarchy appear to be deteriorating . It is thought that the West Londoners would be prepared to sell for a fee of around £50m . Signing Mason Mount would also ramp up the pressure on Bruno Fernandes. The vice-captain infuriated United fans with his display at Anfield, as he was even accused of asking to be substituted . Aaron Wan-Bissaka has yet to impress Gareth Southgate sufficiently on the ball to earn an England cap. However, things are different at Old Trafford where his attitude has impressed the manager and he has muscled his way into first team contention. Captain Harry Maguire is also in and out of the team, and a potential candidate to leave United in the summer. However, he claims Erik ten Hag has told him he is a top centre-back and he may yet decide to stay and fight for his place. Luke Shaw has shown himself to be capable of filling it at left-centre-back when called upon, and is set to continue starting there or at left-back for the foreseeable future. 9 Man Utd have used among the lowest number of English players in the Premier League this season, but that could be about to change Should Shaw make a more permanent switch to centre-back, United would need to decide whether or not to sign competition for Tyrell Malacia at left-back. Chelsea's Ben Chilwell is far from a top Man Utd target, but he is a lifelong fan of the club. In goal, David de Gea is closing in on a new deal but is looking less and less a long-term option. That is reflected in Man Utd preparing to offer the Spaniard a reduced and incentive-based contract . The Sun has revealed that the 32-year-old will only be able to pick up the maximum £250,000-salary he is being offered if he plays in over 50 per cent of matches. England goalkeeper Jordan Pickford is in no hurry to leave Everton as he has just agreed a new £150,000-a-week deal . However, the Toffees are 18th in the table having played a game more than the competition. Read more on the Scottish Sun WHERE'S MR. RIGHT? I’m looking for a handsome cowboy but men never slide into my DMs OH NO I dyed my brown hair blonde & tried the ‘pull test’…I was left totally horrified With Pickford's impending new contract containing no relegation clause, it is difficult to see the Three Lions stopper playing in the Championship. And though Chelsea are said to be the club most keen on Pickford, with their need for a new goalkeeper greater than Man Utd's, the Red Devils will have to purchase a new man between the sticks in the relatively near future. 9 Ben Chilwell is a lifelong Man Utd fan Credit: Getty 9 Jordan Pickford is at risk of being relegated Credit: Alamy","pubDate":"2023-03-11 08:23:58","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bournemouth vs Liverpool LIVE SCORE: Premier League latest as Reds look to build on Man Utd mauling – stream, TV channel","link":"https://www.thescottishsun.co.uk/sport/football/10337935/bournemouth-liverpool-live-score-result-stream-watch-premier-league-online/","keywords":["Football","Sport","Premier League","Sport Live Blogs"],"creator":["Nyle Smith"],"video_url":null,"description":null,"content":"TOP four chasing Liverpool go up against relegation-threatened Bournemouth as they look to build on their 7-0 Premier League pummelling on Manchester United. Goals from Cody Gakpo, Darwin Nunez, Mo Salah and Roberto Firmino handed the Red Devils their heaviest defeat since Wolves in 1930. While Reiss Nelson's stoppage time strike saw Arsenal snatch all three points from the Cherries in their recent outing. Kick-off time: TODAY, Saturday, March 11 - 12:30pm GMT Live stream: BT Sport TV channel: BT Sport 1 CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 Follow ALL the action with our live blog below... Load more entries… Topics Football Premier League Sport Live Blogs Bournemouth Liverpool YOU MIGHT LIKE","pubDate":"2023-03-11 08:00:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | 'Football gods on our side': Dondol Stars to bag at least R400k after Nedbank Cup giant-killing run","link":"https://www.news24.com/sport/Soccer/PSL/football-gods-on-our-side-dondol-stars-to-bag-at-least-r400k-after-nedbank-cup-giant-killing-run-20230311","keywords":null,"creator":null,"video_url":null,"description":"Dondol Stars have defied the footballing odds this season, knocking over SuperSport United and AmaZulu in the Nedbank Cup.","content":"Dondol Stars have defied the footballing odds this season. The third-tier outfit, vying to climb out of the ABC Motsepe League (Gauteng Province), added another Premier Soccer League giant killing to their list. After outwitting SuperSport United in the Nedbank Cup Round of 32 in a 2-1 win, the Mamelodi-based side went after AmaZulu in the last 16 on Wednesday. Stars cancelled out Hendrick Ekstein's opening goal in the second half via Renaldo Fox and forced the Durban side all the way to a penalty shootout, winning 5-4 to advance to the quarter-finals. \"We are happy and excited. I hoped and prayed that our boys come to the party, and they came,\" Dondol co-coach Khuliso Rashamuse said during his post-match interview with SuperSport TV. \"We pushed our players. We did not have anything to lose. They came to the party, and they danced and had fun. \"Penalties are lotteries. Anything can happen. The football gods were on our side. It was in the players' hearts, they wanted it the most, that's where we won it. \"Besides it being history, it is a great achievement of the team. We want to remain humble. Focus on the league, and if we win, we go to the Gladafrica Championship (now Motsepe Foundation Championship). My life, Vini's (co-coach Vincent Rammoni) life and the players' changes.\" READ | Mtolo collapsed with 15 minutes left to train, says coach. After that, things moved fast The Dondol Stars will aim to join Baroka FC, who defeated Kaizer Chiefs in last eight round of 2011 and remain the only third tier team to fell top flight opposition in the Nedbank Cup quarter-finals. The ABC Motsepe League side are now guaranteed to walk away with at least R400 000 for their efforts, which could go a long way for the club from the third tier. And if that is not enough, it could increase to R1 million if they are to nab a semi-final shout. Advancing to the final will see that purse increase to R2.5 million, while winning the tournament will see Dondol claim R7 million. Dondol, alongside Mamelodi Sundowns, have thus far advanced to Monday's (13 March) quarter-final draw. Meanwhile, Dondol Stars are top of the Gauteng stream of the ABC Motsepe League with a healthy nine-point lead over second place Pele Pele FC. If they are to win the Gauteng stream, they will then enter the overall playoff and have a chance of being crowned ABC Motsepe League champions. The two teams in the final playoff match will be promoted to the Motsepe Foundation Championship.","pubDate":"2023-03-11 07:50:32","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Μπενζεμά στο Instagram μετά από δηλώσεις Ντεσάν: «Τι θράσος, καληνύχτα Ντιντιέ»","link":"https://www.gazzetta.gr/football/moyntial-2022/2204452/mpenzema-sto-instagram-meta-apo-diloseis-ntesan-ti-thrasos-kalinyhta","keywords":["Ποδόσφαιρο","Μουντιάλ 2022","Κωνσταντίνος Κωλαΐτης","Ρεάλ Μαδρίτης","Γαλλία","Καρίμ Μπενζεμά","Ντιντιέ Ντεσάν"],"creator":null,"video_url":null,"description":"Ο Ντιντιέ Ντεσάν παραχώρησε συνέντευξη στην «Parisien» στην οποία μίλησε μεταξύ άλλων για το σίριαλ της απουσίας του Καρίμ Μπενζεμά από το Μουντιάλ, με τον Γάλλο στράικερ να απαντά στο Instagram με emoji... κλόουν και «αιχμηρές» ατάκες.","content":"Η εθνική Γαλλίας θα συνεχίσει με τον Ντιντιέ Ντεσάν στο τιμόνι της τουλάχιστον μέχρι το Παγκόσμιο Κύπελλο του 2026 και ο ομοσπονδιακός τεχνικός των Μπλε παραχώρησε την πρώτη του συνέντευξη μετά την ανανέωση του συμβολαίου του, στην οποία αναπόφευκτα αναφέρθηκε και στον Καρίμ Μπενζεμά. Ο Γάλλος στράικερ αποτέλεσε ένα από τα μεγάλα «πλήγματα» για το σύνολο του Ντεσάν στο Μουντιάλ αφού προερχόταν από τραυματισμό και κρίθηκε ανέτοιμος, μένοντας εν τέλει εκτός αποστολής. Στα τέλη Νοεμβρίου κι ενώ η Γαλλία βάδιζε εκ του ασφαλούς στην πρόκριση στα νοκ-άουτ, υπήρξαν δημοσιεύματα που ήθελαν τον εκλέκτορα των Μπλε να καλεί εκ νέου τον φορ της Ρεάλ στην αποστολή για την τελική ευθεία της διοργάνωσης, κάτι που δεν συνέβη ποτέ. Ο ίδιος ο Μπενζεμά, μάλιστα, δήλωσε λίγες μέρες αργότερα σε ανάρτηση του στο Instagram ότι «δεν ενδιαφέρομαι» και την επομένη του τελικού του Μουντιάλ ανακοίνωσε και τυπικά τους τίτλους τέλους από την εθνική , κάνοντας ακολούθως unfollow όλους τους συμπαίκτες του. Πλέον, τρεις μήνες μετά το εν λόγω σίριαλ, ο Ντεσάν έδωσε τη δική του εκδοχή για το ζήτημα με την αρχική απουσία του Μπενζεμά λόγω τραυματισμού και τον λόγο που δεν επέστρεψε, τονίζοντας ότι ο ίδιος ο παίκτης τού είπε πως δεν ήταν σε θέση να βοηθήσει. « Με προσβάλλει που το λέτε αυτό. Υπάρχει μόνο μία αλήθεια και ο Καρίμ την ξέρει καλά. Ο Καρίμ μπήκε στην προεπιλογή μας στις 14 Νοεμβρίου μετά από ένα διάστημα που ήταν σχεδόν ανενεργός με τον σύλλογό του. Ακολούθησε ατομικό πρόγραμμα, η επιστροφή του στις ομαδικές προπονήσεις αναβλήθηκε. Δεν ήταν 100% σίγουρος ότι θα μπορούσε να ξεκινήσει στο ματς με την Αυστραλία. Ο Καρίμ ήταν εκνευρισμένος γιατί το Μουντιάλ σήμαινε πολλά για αυτόν. Στην καλύτερη των περιπτώσεων θα γυρνούσε στις προπονήσεις στις 10 Δεκεμβρίου. Την τελευταία φορά που τον είδα του είπα ''Καρίμ, μη βιαστείς''. Να οργάνωνε την επιστροφή του με τον team manager. Όταν ξύπνησα, είχε ήδη φύγει. Ήταν απόφασή του, δεν θα σας πει κάτι άλλο, το καταλαβαίνω και το σέβομαι» «Πιστεύετε πραγματικά πως μπορεί να συγκριθεί ένα φιλικό με τη Ρεάλ Μαδρίτης με την ένταση ενός ημιτελικού Μουντιάλ; Το ταλέντο και το στάτους του δεν αμφισβητούνται, αλλά μπορείτε να φανταστείτε να γύριζε την τελευταία στιγμή; Ο ίδιος ο Καρίμ μού είπε ότι δεν θα ήταν έτοιμος ». Απ' ό,τι φαίνεται, όμως, ο Μπενζεμά δεν συμφωνεί καθόλου με την εκδοχή του Γάλλου τεχνικού. Συγκεκριμένα, ανέβασε story στο Instagam με φωτογραφία από τη συνέντευξη κι έγραψε «Τι θράσος», συνοδεύοντας τη φράση με ένα emoji κλόουν! Στο δεύτερο story που ακολούθησε, έγραψε χαρακτηριστικά «Καληνύχτα Άγιε Ντιντιέ».","pubDate":"2023-03-11 07:03:19","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Programme du Samedi 11 Mars 2023","link":"https://www.dzfoot.com/programme-tv/programme-du-samedi-11-mars-2023-239384.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Programme TV","Ligue 1","Diffusion","Premier League"],"creator":null,"video_url":null,"description":"Voici le programme de DZfoot! Au sommaire, une sélection (non-exhaustive) des matchs impliquant les Algériens évoluant à travers le monde ainsi qu’une liste des plus belles affiches du jour. Tous les horaires indiqués sont à l’heure d’Alger. Matchs des Algériens évoluant à l'étranger 15:30 Bundesliga (Allemagne) | Leipzig - Mönchengladbach (Bensebaini*) beIN Sports 7 (Mena); beIN […] The post Programme du Samedi 11 Mars 2023 appeared first on Football Algérien - DZFOOT.COM.","content":"Voici le programme de DZfoot! Au sommaire , une sélection (non-exhaustive) des matchs impliquant les Algériens évoluant à travers le monde ainsi qu’une liste des plus belles affiches du jour. Tous les horaires indiqués sont à l’heure d’Alger. Matchs des Algériens évoluant à l'étranger 15:30 Bundesliga (Allemagne) | Leipzig - Mönchengladbach ( Bensebaini* ) beIN Sports 7 (Mena); beIN Sports 5 max (France) 17:00 Ligue 1 (France) | Auxerre - Rennes (A. Zedadka) beIN Sports 2 (Mena); Prime Video (France) 18:15 Pro League (Belgique) | Westerlo - Courtrai KV (Kadri) Eleven Sports Online 18:30 Premier League (Angleterre) | Crystal Palace - Manchester City (Mahrez) beIN Sports Premium 1 (Mena); Canal+ Foot (France) 18:45 Eredivisie (Pays-Bas) | Fortuna Sittard - Twente (R. Zerrouki) 20:45 Super League (Suisse) | Lugano - Zürich (Amoura) 21:00 Ligue 1 (France) | Brest - PSG (Belkebla) beIN Sports 2 (Mena); Prime Video (France) *Suspendu DZfoot","pubDate":"2023-03-11 07:00:40","image_url":null,"source_id":"dzfoot","category":["sports"],"country":["algeria"],"language":"french"},{"title":"Σάλκε vs Ντόρτμουντ: Ένα ντέρμπι, μία κοιλάδα","link":"https://www.gazzetta.gr/football/bundesliga/2204330/salke-vs-ntortmoynt-ena-ntermpi-mia-koilada","keywords":["Ποδόσφαιρο","Bundesliga","Δημοσθένης Γεωργακόπουλος","Ντόρτμουντ","Σάλκε"],"creator":null,"video_url":null,"description":"Το ντέρμπι της κοιλάδας του Ρουρ διεξάγεται σήμερα στην Bundesliga και ο Δημοσθένης Γεωργακόπουλος θυμάται πέντε από τις πιο επικές μονομαχίες, στην πρόσφατη ιστορία, μεταξύ των δύο ομάδων.","content":"Το ντέρμπι του Λέμαν Οι τερματοφύλακες παίζουν πάντοτε καθοριστικό ρόλο σε κάθε ντέρμπι, σε όλες τις χώρες. Το κάνουν με τις αποκρούσεις τους, όμως στο συγκεκριμένο ματς, ο Γενς Λέμαν πρωταγωνίστησε, χάρις στο τέρμα που πέτυχε και διαμόρφωσε το τελικό αποτέλεσμα. Στο ντέρμπι της 20 ης αγωνιστικής, τη σεζόν 1997-98, η Ντόρτμουντ είχε το προβάδισμα με 2-1, με τον Γερμανό γκολκίπερ να προωθείται στις καθυστερήσεις, σε ένα κόρνερ της Σάλκε. Ο Λέμαν κατάφερε να βρει δίχτυα από κοντά και να δώσει το βαθμό της ισοπαλίας στην ομάδα του (2-2), απέναντι στη... μετέπειτα ομάδα του. Όταν η Ντόρτμουντ «γκρέμισε» τα όνειρα τίτλου της Σάλκε Η... κλισέ έκφραση που υπάρχει σε κάθε ντέρμπι είναι ότι «σε αυτά τα ματς το γόητρο αποτελεί το μεγαλύτερο κίνητρο». Κάτι που επαληθεύτηκε 100% στη συγκεκριμένη αναμέτρηση της σεζόν 2006-07. Μία αγωνιστική πριν το τέλος, η Σάλκε ήταν στην πρώτη της βαθμολογίας και ήθελε τη νίκη στο Βεστφάλεν, ώστε να αγκαλιάσει το πρώτο της πρωτάθλημα μετά από σχεδόν 50 χρόνια. Ωστόσο, η μισητή – και βαθμολογικά αδιάφορη – αντίπαλός της είχε αντίθετη άποψη. Η Ντόρτμουντ επικράτησε με 2-0 στο παιχνίδι της 33 ης αγωνιστικής και «γκρέμισε» τη Σάλκε από την κορυφή. Ένα αποτέλεσμα που ουσιαστικά χάρισε τον τίτλο στη Στουτγκάρδη και άφησε στα... κρύα του λουτρού τους «βασιλικούς μπλε». Από την κόλαση, στον παράδεισο Μόλις στο ξεκίνημα της Bundesliga, για τη σεζόν 2008-09, οι δύο ομάδες χάρισαν στο κοινό μία αναμέτρηση υψηλού επιπέδου, με απίστευτες διακυμάνσεις στο σκορ. Η Σάλκε φάνηκε πως θα είχε εύκολο έργο στην έδρα της Ντόρτμουντ, καθώς με τη συμπλήρωση μίας ώρας αγώνα είχε προηγηθεί στο σκορ με 0-3. Παρόλα αυτά, η ομάδα του Γιούργκεν Κλοπ έκανε ένα απίστευτο come back. Μέσα σε διάστημα 20 λεπτών σκόραρε τρεις φορές, διαμορφώνοντας το τελικό 3-3. Μάλιστα, θα μπορούσε να πάρει και τη νίκη, αν είχε λόγο χρόνο ακόμα, αφού οι φιλοξενούμενοι μετρούσαν δύο αποβολές και αγωνίζονταν με εννέα παίκτες. Η κορυφαία παράσταση Ένα από τα πιο τρελά παιχνίδια στην ιστορία της Bundesliga και σίγουρα το πιο εντυπωσιακό ντέρμπι της κοιλάδας του Ρουρ. Στη 13 η αγωνιστική της σεζόν 2017-18, η Ντόρτμουντ έκανε πάρτι στο πρώτο ημίωρο της αναμέτρησης. Προηγήθηκε με το εντυπωσιακό 4-0 και όλα έδειχναν πως θα έφτανε σε μία άνετη επικράτηση. Ωστόσο... κατάφερε να μην κερδίσει καν. Η Σάλκε, αντί να καταρρεύσει, στάθηκε στα πόδια της και στην επανάληψη έφερε τα πάνω-κάτω. Πλήρωσε με το ίδιο νόμισμα την αντίπαλό της, πετυχαίνοντας τέσσερα τέρματα στο τελευταίο 30λεπτο, ισοφαρίζοντας σε 4-4. Η εκδίκηση της Σάλκε Χρειάστηκε να περάσουν δώδεκα χρόνια για να δει η Ντόρτμουντ την αντίθετη όψη του νομίσματος και να στερηθεί τον τίτλο από την μισητή αντίπαλό της. Όπως είχε κάνει εκείνη τη σεζόν 2006-07, έτσι έκανε και η Σάλκε τη σεζόν 2018-19. Με νίκη στην αναμέτρηση της 31ης αγωνιστικής, οι «κιτρινόμαυροι» θα προσπερνούσαν την Μπάγερν και θα ανέβαιναν στην κορυφή της βαθμολογίας, τρεις στροφές πριν την ολοκλήρωση της κούρσας. Ωστόσο, οι «βασιλικοί μπλε» τους χάλασαν τα σχέδια και μάλιστα μέσα στο Signal Iduna Park. Η Σάλκε επικράτησε με το εντυπωσιακό 2-4 και άφησε την Ντόρτμουντ στη δεύτερη θέση, όπου έμεινε ως το τέλος. Και κυρίως, για την ίδια, απομακρύνθηκε από την επικίνδυνη ζώνη.","pubDate":"2023-03-11 07:00:00","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Ολυμπιακός: Οι Μπακαμπού και Μπιέλ έχουν τα 20 από τα 50 «Ερυθρόλευκα» τέρματα στο πρωτάθλημα! (vid)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2203709/olympiakos-oi-mpakampoy-kai-mpiel-ehoyn-ta-20-apo-ta-50","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ολυμπιακός","Δημήτρης Τομαράς","ΑΕΚ","Πεπ Μπιέλ","Σεντρίκ Μπακαμπού"],"creator":null,"video_url":null,"description":"Ο Ισπανός με τον Γαλλοκονγκολέζο φορ είναι το πλέον παραγωγικό δίδυμο και όχι μόνο σε ότι αφορά στην ομάδα του Ολυμπιακού στη Stoiximan Super League 1.","content":"Ο Ισπανός Πεπ Μπιέλ έχει φτάσει τα 8 γκολ στο Πρωτάθλημα της Stoiximan Super League 1 μετά την εμφάνισή του με τον Ολυμπιακό κόντρα στον Λεβαδειακό . Από μέρους του ο Μπιέλ δεν άνοιξε μόνο το σκορ κόντρα στους Βοιωτούς με ένα σούπερ τελείωμα αλλά είχε συνολικά 2 γκολ και 1 κερδισμένο πέναλτι στον αγώνα. Μάλιστα το πέναλτι θα μπορούσε να το είχε χτυπήσει ο ίδιος αλλά άφησε τον συμπαίκτη του, Σεντρίκ Μπακαμπού να το κάνει για να φτάσει ο Γαλλοκονγκολέζος τα 12 τέρματα στην κατηγορία. Ο Μπιέλ μίλησε για τη συγκεκριμένη κίνηση λέγοντας στη COSMOTE TV ότι «στην πραγματικότητα εγώ του έδωσα τη μπάλα. Παρόλο που ήταν η σειρά μου να εκτελέσω το πέναλτι. Οι επιθετικοί έχουν ανάγκη τα γκολ, θέλουν όλοι να σκοράρουν και αν το κάνουν όλοι στο ίδιο παιχνίδι τότε ακόμα καλύτερα». Οι δύο ποδοσφαιριστές, έχουν λοιπόν «χτίσει» ένα πολύ «παραγωγικό» δίδυμο που έφτασε να είναι και το πιο «παραγωγικό» της κατηγορίας. Τα 12 γκολ του Μπακαμπού μαζί με τα 8 Μπιέλ φτάνουν τα 20 από τα 50 των Πειραιωτών χωρίς να βάλουμε μέσα σε αυτά ασίστ ή συμμετοχή σε φάσεις με γκολ. Το συγκεκριμένο δίδυμο μάλιστα σκοράρει ανά 149 λεπτά και το ακολουθεί ρο δίδυμο της ΑΕΚ με Λιβάι Γκαρσία και Άμραμπατ των 152' και των 19 τερμάτων. Ο Ολυμπιακός έχει στο σύνολο 50 γκολ με τον Μπακαμπού να έχει 12 τέρματα και 1 ασίστ και τον Μπιέλ 8 γκολ και 2 ασίστ. Υπενθυμίζεται πως τόσο ο Μπιέλ όσο και ο Μπακαμπού είναι φαβορί για βασικοί με την ΑΕΚ την Κυριακή.","pubDate":"2023-03-11 06:59:01","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Αθλητικές εφημερίδες: Όλα τα πρωτοσέλιδα της ημέρας (11/03) στο Gazzetta","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2204450/athlitikes-efimerides-ola-ta-protoselida-tis-imeras-1103-sto","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Newsroom"],"creator":null,"video_url":null,"description":"Το ΑΕΚ-Ολυμπιακός, η προσφυγή της Ενωσης στο CAS για τα κοντά δοκάρια, η πρώτη Κορακάκη, ο τελικός Κυπέλλου Γυναικών στο βόλεϊ κι η νίκη του Παναθηναϊκού επί του Ερυθρού Αστέρα πρωταγωνιστούν στα σημερινά πρωτοσέλιδα.","content":"Sport Day : «Campeones», το σύνθημα του Μίτσελ στους παίκτες για το ντέρμπι με την ΑΕΚ. Εκεί θέλει να χτυπήσει ο Αλμέιδα τον Ολυμπιακό. Δύσκολα ο Λιβάι Γκαρσία, οι σκέψεις του Αργεντινού. Αλλαξε το... έργο ο Σερέλης στον μπασκετικό Παναθηναϊκό με τη νίκη επί του Ερυθρού Αστέρα. Για μπάλα και τσίπουρα ο ΠΑΟΚ στον Βόλο. Η ζαριά με Ρούμπεν για Γιοβάνοβιτς ενόψει Ατρόμητου. Χρυσό η Άννα Κορακάκη στην σκοποβολή. Live Sport: Όπως παλιά ο Παναθηναϊκός νίκησε τον Ερυθρό Αστέρα, ώρα κούπας στο βόλεϊ γυναικών με τον τελικό Κυπέλλου μεταξύ Παναθηναϊκού και ΑΕΚ. Και διπλό και στο CAS η Ενωση για το ματς με τον Ατρόμητο. Η μεταμόρφωση Κουρμπέλη σε 8άρι. SL2: Απιαστη η Κηφισιά, 2-1 στην Καλαμάτα. Το πλάνο νίκης του Μίτσελ. ΦΩΣ των Σπορ : «Θα παίξουμε ως πρωταθλητές», το μήνυμα Μίτσελ στους παίκτες για το ντέρμπι με ΑΕΚ. Πρώτη σε όλη την Ευρώπη η Κορακάκη. Φυσάει η ομάδα μπάσκετ, ο Μπέικον δεν χάλασε τον Παναθηναϊκό (έμεινε εκτός αποστολής με απόφαση Σερέλη). Πρωταθλητής : Δίψα για ρεβάνς. Εξαιρετικό το κλίμα στου Ρέντη πριν το ματς με την ΑΕΚ. Παίκτης του μήνα ο Χουάνγκ. Το μήνυμα του Βαγγέλη Μαρινάκη για τα γενέθλια του Ολυμπιακού: Αλύγιστοι θα πάμε ψηλότερα. Αθλητική Ώρα των Σπορ : Θέλει σαν τρελός να παίξει ο Λιβάι, αλλά... ΑΕΚάρα φέρε μας το Κύπελλο. Η ΑΕΚ θέλει να φέρει το Final-4 BCL στην Αθήνα. Η ΑΕΚ πάει στο CAS για να ξεμπροστιάσει το παρασκήνιο για τα «κοντά δοκάρια» του Περιστερίου. Metrosport : Ευκαιρία Καμάτσο. Ετοιμάζεται να επιστρέψει στην 11άδα του Αρη έναν χρόνο μετά. Σιαμπάνης: Πρόστιμο 25.000 ευρώ για τη διαρροή των στοιχείων του. Αλώβητος σε βαθμούς και ρόστερ. Δεν αρκεί στον ΠΑΟΚ η νίκη στον Βόλο. Πρέπει να μην κιτρινιστούν Ινγκασον, Κουλιεράκης, Σβαμπ, Ολιβέιρα και Ζίβκοβιτς. ΔΕΙΤΕ ΟΛΑ ΤΑ ΠΡΩΤΟΣΕΛΙΔΑ ΑΘΛΗΤΙΚΩΝ ΕΦΗΜΕΡΙΔΩΝ ΜΕ ΕΝΑ ΚΛΙΚ","pubDate":"2023-03-11 06:37:38","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Mbappé : Transfert annoncé, la date est fixée","link":"https://le10sport.com/football/mercato/mbappe-transfert-annonce-la-date-est-fixee-636611","keywords":null,"creator":null,"video_url":null,"description":"Après la défaite du PSG face au Bayern Munich, Kylian Mbappé n'a pas souhaité aborder le sujet brûlant de son avenir à Paris. Mais en Espagne, cette question a fait les gros titres de l'actualité ce…","content":"Après la défaite du PSG face au Bayern Munich, Kylian Mbappé n'a pas souhaité aborder le sujet brûlant de son avenir à Paris. Mais en Espagne, cette question a fait les gros titres de l'actualité ce jeudi et vendredi. Selon plusieurs médias, le joueur de 24 ans aurait de grandes chances de quitter la France en 2024, au terme de son contrat avec le PSG. Samedi dernier, Kylian Mbappé avait annoncé que son avenir au PSG ne dépendait pas du résultat du match face au Bayern Munich . Bien heureusement pour le club parisien. Car face à la formation allemande, l'équipe française n'a pas existé ce mercredi soir (2-0). Eliminé en huitièmes de finale de Ligue des champions pour la deuxième année consécutive, le PSG déçoit encore et toujours. Alors quand Mbappé débarque en zone mixte après le match, les journalistes se sont précipités vers lui pour lui poser la question. « Si cette défaite relance mon avenir au PSG ? Non, non. On verra. Ce qui m’importe, c’est de gagner le championnat. Pour le reste, on verra » a répondu Mbappé. «Mbappé n'a servi à rien» : Désastre au PSG, il dégoupille https://t.co/ltz5nmBOsG pic.twitter.com/praxO81RjN Mais en Espagne, on pense connaître la décision de Mbappé. Selon plusieurs médias, notamment OK Diario, le joueur regretterait sa prolongation au PSG et désirerait s'engager avec le Real Madrid. Une chose est sûre, ce ne sera pas pour cet été. « Il est impossible que le PSG accepte de négocier pour Mbappé cet été » annonce Edu Aguirre . A en croire le journaliste d' El Chiringuito, Mbappé devrait s'engager avec le Real Madrid en 2024, une fois son aventure parisienne terminée. Une tendance confirmée par OK Diario , qui précise que le joueur va devoir regagner la confiance du club espagnol, encore marqué par le feuilleton de l'année dernière. Ce sera à Mbappé de contacter le Real Madrid et de faire le premier pas. Le début d'un nouveau feuilleton ?","pubDate":"2023-03-11 05:30:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0020/202802.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"}]}