{"newsArray":[{"title":"Meet Cody Mauch, the most interesting offensive lineman in the NFL draft","link":"https://www.espn.com/nfl/draft2023/story/_/id/35993456/cody-mauch-north-dakota-state-taking-smile-2023-nfl-draft?device=featurephone","keywords":null,"creator":null,"video_url":null,"description":"A former walk-on at North Dakota State, Mauch has added technique, weight (and hair) to a jovial personality and a toothless grin.","content":"EVERY SO OFTEN , North Dakota State offensive tackle Cody Mauch will hear from Kendrick Lenzen, his childhood friend and former grade school teammate, via FaceTime. \"He'll be like, 'Hey, give me a smile,'\" Mauch said. \"It's like he's admiring his work.\" Lenzen is responsible for what might become the most recognizable gap-tooth grin in the NFL since Michael Strahan. Mauch hasn't had his two front teeth since colliding with Lenzen while chasing a loose ball in a middle school basketball game. After several dental stopgaps, Mauch decided that he wouldn't repair his teeth until he finished playing football. He could be waiting a while to fix that smile. Mauch (pronounced \"Mouck\") enters the NFL draft later this month as one of the top offensive tackles on the board and Todd McShay's No. 52 overall prospect. ESPN's Matt Miller lists Mauch as his No. 5 tackle and there's a chance the North Dakota State standout hears his name called on the draft's first night in Kansas City, Missouri. \"I can say I knocked out an NFL player's teeth,\" Lenzen said. Mauch's path to the doorstep of the NFL stands out, given where his journey began and what he looked like when he left home. He grew up in Hankinson, North Dakota, a town of 922 in the southeast corner of the state, where he played nine-man football and graduated in a class of 18. Mauch arrived at North Dakota State as a 220-pound walk-on tight end and left 82 pounds heavier as an All-America tackle. The physical transformation makes the 6-foot-5, 302-pound Mauch hard to miss, especially with his long red hair and missing teeth. His personality matches the look. At NDSU, he became known for creative first-down celebrations, having in-game conversations with opposing linemen and playing the air fiddle (and even a real one) after FCS semifinal victories. \"His nickname is 'Tud,'\" said North Dakota State defensive lineman Jake Kava, Mauch's friend and housemate. \"When you think of a guy with the nickname Tud, that's Cody. No front teeth, big smile, long, flowing red hair.\" Beneath the friendly exterior is a talent who can play all five offensive line spots and has an intriguing combination of skills and power. He just approaches football with a smile. MAUCH WALKED ON at North Dakota State after receiving mostly Division II offers out of Hankinson High School, where he played tight end, quarterback and defensive end in the nine-man game. When Bison offensive lineman Nash Jensen first saw Mauch, he thought: \"Who's this scrawny little redhead?\" During a practice in the spring of 2018, North Dakota State coach Chris Klieman called over Jim Kramer, the team's longtime strength coach. Klieman gestured toward Mauch, who had redshirted the previous season and was working with the tight ends. \"That kid's going to be a big kid,\" Klieman told Kramer. But Klieman, who is now the head coach at defending Big 12 champion Kansas State, saw Mauch at a new position, where he could ultimately reach a much higher level. \"He was the first person who ever told me I might have a shot at the NFL,\" Mauch recalled. \"That was before I really even started playing offensive line. I'm like, 'Man, this guy's crazy. How's he know?'\" North Dakota State doesn't treat its players as finished products. Kramer works with a nutritionist to take measurements and predicts the mass that players can add without compromising their effectiveness. Linebackers become defensive ends, tight ends become tackles and so on. The approach has helped NDSU become the nation's premier FCS program, winning nine national titles since 2011 and playing for another in January. Since 2014, North Dakota State has had 10 players drafted, including two first-round quarterbacks (Trey Lance and Carson Wentz) and four offensive linemen. At first, Kramer didn't fully buy Klieman's vision for Mauch. \"I don't know if I saw that he was going to be a 300-pounder,\" Kramer said. \"But Coach Klieman saw it. Then Cody started working.\" Mauch spent the next months in the weight room and dining halls or other eateries in and around campus. NDSU has an all-you-can-eat program for freshmen and \"Cody took full advantage,\" said Matt Entz, who replaced Klieman as coach in December 2018. Kramer outlined a more aggressive in-season training plan for Mauch, since he wasn't on the depth chart. Mauch also spent much of his free offseason time eating and lifting. \"It made such a difference,\" said Joe Mauch, Cody's father. \"Small-town kid, we don't really have too much of a weight program. At school, the weight room is in a corner on the stage. Not a lot, aside from a squat rack and a bench press.\" When the 2018 season kicked off, NDSU listed Cody at 269 pounds, a 35-pound increase from his 2017 weight. By the fall of 2019, he was up to 290 pounds. Mauch also didn't stop growing vertically, measuring 6-foot-5 at the combine, an inch taller than when he arrived in Fargo. \"He's a kid with big hips, big hands, big features,\" Entz said. \"We knew that at some point, he was going to gain some weight. I don't know if anyone really knew what he was going to be, or that he was going to turn out to be potentially a Day 1, Day 2 type of draft pick.\" Mauch began playing the ogre position, an extra offensive lineman who occasionally wears a tight end's number. In 2019, he suited up as both No. 70 (offensive line) and No. 88 (tight end), catching a 2-point conversion in an FCS playoff semifinal win. By the COVID-delayed spring season of 2021, his positional path became clear. North Dakota State initially moved all-conference tackle Cordell Volson from right tackle to left, while placing Mauch on the right side. After two games, the two switched. Volson earned first-team All-America honors that season and in the fall, before becoming a fourth-round draft pick of the Cincinnati Bengals. Mauch remained the team's starter at left tackle. \"He's such a hardworking kid,\" said Jensen, who started multiple seasons next to Mauch at left guard. \"Just to see his progression from being a tight end/defensive end to an All-American, top NFL prospect [for] offensive line, is absolutely crazy. \"I couldn't be more proud.\" Mauch occasionally gets Facebook or Snapchat memories that show what he looked like when he arrived at North Dakota State. The before-and-after graphic of his measurables appeared on TV during the 2023 FCS playoffs and at pre-draft events like the Senior Bowl. \"It's like, 'Wow, I can't believe that's the way I looked,'\" Mauch said. \"It makes you happy for the way things have gone and how different life is now.\" WHEN STACEY MAUCH saw her son walk in the door, she started to cry. Cody was back home from Fargo, where he had visited the E.R. and a dentist, following the collision with Lenzen in the basketball game. His front teeth couldn't be salvaged, and his lips and face had swelled like a balloon. Stacey didn't want to see Cody in pain. As a schoolteacher in Hankinson, she also worried about the impact of such a noticeable facial injury for a seventh-grader. \"You just want your kids to grow up confident and happy,\" Stacey Mauch said. \"'Get your teeth fixed, you'll be confident and be ready to smile and take on the world.' But this guy doesn't need teeth to do that. He's shown that over and over, the way he flashes the smile and the confidence he has.\" Since Cody's mouth was still growing, the plan called for him to wait for implants. He went through several sets of braces to widen his mouth and used a retainer and a \"flipper\" with false teeth. But the retainers kept breaking. After several years, Mauch stopped wearing anything. \"I'm sure my mom and dad were probably a little upset, just because of how much money they paid in braces and all the different dentist appointments, all the broken retainers,\" he said. \"But everyone who knows me knows that no teeth kind of fits my personality. I'm an easygoing, goofy guy. I don't really care how I look.\" Cody is the second of eight children, spanning ages 25 to 7, and comes from a large family that goes back generations around Hankinson. As a boy, he spent summer days at the family crops farm alongside Joe. Tasks ranged from maintenance on tractors and other equipment to clearing fields. When Cody got his driver's license, he began driving a truck. \"You learn the way to work,\" Joe said. \"Our kids have been working on a farm since they were 8 years old.\" Hankinson's school had about 300 students in one building, kindergarten through 12th grade, and only offered a handful of sports. Mauch competed in everything: football, basketball, baseball and track, earning all-region honors in both basketball and track, while setting school records for touchdown receptions and sacks. His older brother, Carter, was a multisport standout, and his younger siblings also competed. \"Whatever was going on for sports in the world, that's what was going on in our front yard, too,\" Stacey Mauch said. \"If it was football season, they would mow a football field out there. If it was baseball season, they would mow a baseball field.\" Cody knew everyone around town, and he and his friends found ways to entertain themselves. Once they began driving, they started to do \"Main-ers.\" \"Just rip it up and down Main Street,\" said Cody, who started with a 2000 Grand Am before buying one of his dad's F-150 trucks. \"There's no stop lights or anything, so it takes you probably 45 seconds to get from one side of town to the other.\" Cody recently looked at a picture of his kindergarten class and realized almost everyone had graduated high school together. In November, Hankinson honored Cody with a celebration at the school. His NFL draft plans aren't firmly set, but Joe expects a party at the VFW or the American Legion in Hankinson, where family and friends will gather. \"I'm definitely going to pay a lot more attention to the draft this year,\" Lenzen said. \"I'm excited, kind of in disbelief. Cody's put a lot of work in, but it's a dream that a lot of people don't get to have.\" DURING MAUCH'S FRESHMAN year at North Dakota State, Hank Jacobs, the team's director of football operations, looked at the clean-cut walk-on and made a suggestion: Grow out the red hair. Mauch wasn't convinced, but he stopped going to the barber. \"I'm like, 'Eh, I'll just do it, why not?'\" Mauch said. \"I've been growing it out for probably four years now. Saved a lot of money on haircuts.\" The long red hair, a trait Mauch shares with two of his sisters, is part of his signature look. He added a red beard while at NDSU. There's only one drawback. \"There was hair everywhere,\" said Kava, who shared a house with Mauch. \"I was the vacuum guy, so I had to clean it out and I was like, 'Cody, could you please cut your hair, for my sake?' It's annoying to clean up, but it's here to stay. It's definitely part of the thing he has going.\" Mauch incorporated his locks into a first-down signal: the hair point. Other celebrations after NDSU moved the chains included a slide, a somersault and several that were rehearsed but too difficult to perform in games, like the Maucharena (his spin on the '90s dance) and the conga line. Naturally, Mauch named one celebration \"A-gap power,\" where he smiles after first downs. His missing teeth actually became a conversation topic during games with opposing players. \"The D-ends and D-tackles, they're asking him, 'Why don't you have two front teeth?'\" Jensen said. \"As each play went along, the story got longer and longer. He probably changed it from time to time, just to mess with them.\" Mauch didn't make the conversations all about himself. By his third year as a starter, he had built relationships with opposing linemen, and tried to get to know new ones. \"You're kicking these guys' butts and then talking to them about their uncle and farming,\" Kava said. \"I think we were playing [Northern Iowa] and he's talking about egg science with their D-tackle. We'd get home and he would tell me, 'We were talking about the new combine from John Deere.' \"I'm like, 'Cody, you're something else.'\" Not surprisingly, Mauch was in the middle of North Dakota State's fiddle-playing tradition after FCS semifinal wins. Since the national title game is held annually in Frisco, Texas, North Dakota State plays the country song \"If you're gonna play in Texas [You Gotta Have a Fiddle in the Band]\" in the Fargodome when it advances. Bison players will play air fiddle, but after a win over Incarnate Word in December, someone handed Mauch a real one. Middle schoolers in nearby Moorhead, Minnesota, noticed Mauch's fiddle form on TV and invited him to learn how to play correctly. \"Just a classroom of sixth- and seventh-graders making fun of me for not knowing how to hold it, not playing it right,\" Mauch said. \"That was cool to get humbled by those guys.\" For Mauch, the in-game displays made football fun, especially while playing on the line. He clicked instantly with the offensive linemen after switching over. Mauch loved that the group's success hinged on being unified, but individual personalities could still stand out. During pregame meals, the linemen would compile their Mount Rushmores -- top fours -- for a variety of topics: snacks, favorite foods, least favorite foods, favorite places in Fargo, and more. \"The stupid stuff that was right in my wheelhouse,\" Mauch said. Then, the Bison would usually proceed to mash their opponents. They ranked in the top 10 nationally in rushing throughout Mauch's career. Mauch's philosophy impacted everyone around him, even his coaches. \"I didn't think the football field was the place to have fun,\" NDSU offensive line coach Dan Larson said. \"But he has fun with it and it makes football enjoyable to him. We stopped worrying about whether he was doing first-down signals, or if a guy runs by and he gives a high-five, but [the opposing player] won't do it, he gives himself a high-five. \"When I stopped worrying about those parts of it and just the snap and the finish, his level of football even went up. Because it's who he is.\" ON NFL SUNDAYS in recent years, Mauch and his housemates would gather in their living room and watch games on four mounted TVs. Sometimes they'd even bring in a fifth screen. Mauch used the time to unwind, but as he got older, his attention shifted. \"I'm sitting there, watching the left tackle, watching the center,\" he said. \"I was just putting myself in their shoes.\" Mauch's appearance and personality project fun, but he takes football seriously. Entz never questioned Mauch's commitment, noting that he approaches the grind of the game with some balance. Larson learned that as long as he smiled once in a while, he could challenge Mauch just like any other player. Since Mauch is relatively new to playing offensive line, he had to build up his strength and technique. Kava remembered being able to bull-rush Mauch early in their careers before Mauch added \"that tackle weight.\" Larson worked on hand placement with Mauch but saw him thrive at playing with his hips low to keep defenders from getting past him in pass protection. Mauch's footwork and ability to move are his greatest assets. Larson thinks the right blocking scheme will make Mauch a \"vertical monster,\" where he can pull and run downfield. Mauch doesn't have the longest arms, which measured 32 and three-eighths inches at the NFL combine, and might not project as a tackle for every team, but he can play all over the line, as he displayed during Senior Bowl week. \"He's the only guy in this draft class who has proven he can play all five spots,\" Senior Bowl executive director and former ESPN draft analyst Jim Nagy said. \"Those guys are really hard to find. In the [Senior Bowl] game, he played left guard, center and right tackle, so he's proven he can play on both sides, which is big, too.\" While scouting Mauch's film, Nagy never flagged arm length as a potential drawback. Mauch held up well against better competition during Senior Bowl week, and players on the National team voted him as their top offensive lineman. Nagy said most teams he talked to before the event pegged Mauch as a second-round pick, but Mauch's performance gave him \"a legit chance\" to go at the end of the first round. \"I would start him at left tackle, because that's the premium position and prove to me that he can't play there,\" Nagy said. \"If he can't play there, then we'll slide him into guard or center and there'll be a Pro Bowl-level player inside.\" An AFC scout said Mauch likely projects as a Day 2 pick but added that all teams are starving for tackles. \"His passion and the emphasis he puts on playing the game jumped out,\" the scout said of Mauch. \"I wanted to keep watching this guy.\" Everyone will soon be watching Mauch in the NFL. Mauch appreciates his unlikely path to pro ball: small town, nine-man ball, three years as a walk-on at NDSU. He considers receiving a scholarship to be among the best moments of his life. Another moment will come soon when his name is called in Kansas City at the draft. Mauch looks forward to entering a pro facility with his signature smile and becoming \"a locker-room guy,\" just like he was at NDSU. \"It gets more serious the older you get, the higher level you get to, but it's still football at the heart, so you just go have fun,\" he said. \"If you're enjoying yourself, other people see that.\"","pubDate":"2023-04-10 16:23:05","image_url":null,"source_id":"espn","category":["sports"],"country":["australia","canada","united kingdom","india","singapore","united states of america"],"language":"english"},{"title":"«Τίναξε» την μπάνκα με επτάδα ισοπαλιών!","link":"https://www.gazzetta.gr/football/2212718/tinaxe-tin-mpanka-me-eptada-isopalion","keywords":["Ποδόσφαιρο","Newsroom","Προγνωστικά"],"creator":null,"video_url":null,"description":"Ω ρε μάνα, μια δελτιάρα! Οκτάδα χιναριών σε ζητούμενα, με 247 στήλες! Τα έψαχνε όλα ο τυπάς. Από τις δυάδες μέχρι και την οκτάδα!","content":"Η ΣΥΝΕΧΕΙΑ ΕΔΩ","pubDate":"2023-04-10 15:18:47","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"«Ο ιδιοκτήτης της Καλλιθέας συνελήφθη με κατηγορίες για ενδοοικογενειακή βία»","link":"https://www.gazzetta.gr/football/superleague-2/2212803/o-idioktitis-tis-kallitheas-synelifthi-me-katigories-gia","keywords":["Ποδόσφαιρο","Superleague 2","Athens Kallithea","Newsroom"],"creator":null,"video_url":null,"description":"Η «Aspen Daily News» και το «Athletic» μετέδωσαν πως ο Αντριου Μπάρογουεϊ βρίσκεται αντιμέτωπος με κατηγορίες που αφορούν ενδοοικογενειακή βία.","content":"Αντιμέτωπος με κατηγορίες που αφορούν ενδοοικογενειακή βία βρίσκεται, σύμφωνα με ξένα ΜΜΕ, ο Αντριου Μπάρογουεϊ, ιδιοκτήτης της Athens Kallithea όπως και άλλων αθλητικών σωματείων στην Ευρώπη και τις ΗΠΑ . Σύμφωνα με τα όσα αποκάλυψε η «Aspen Daily News» και αναπαρήγαγαν αρκετά άλλα media όπως το «Athletic», ο επιχειρηματίας που εδρεύει πέρα από τον Ατλαντικό συνελήφθη την περασμένη Πέμπτη (6/4) για χρήση βίας κατά τη συζύγου του και ναι μεν αφέθηκε ελεύθερος με εγγύηση, όμως στο άμεσο μέλλον θα εκδικαστεί η υπόθεσή του ενώπιον των αρμόδιων δικαστικών αρχών. Οπως δημοσιεύτηκε εκείνο το βράδυ βρίσκονταν με τη σύζυγό του στο ξενοδοχείο «Limelight Hotel» στο Ασπεν και η αστυνομία της περιοχής δέχθηκε κλήση ότι ακούγονταν «φωνές» από το δωμάτιό τους. Ετσι τα όργανα της τάξης μετέβησαν εκεί, όπου τους άνοιξαν την πόρτα εκείνος και η γυναίκα του. Σύμφωνα με τα σχετικά ρεπορτάζ στην ένορκη κατάθεση που πάρθηκε η σύζυγός του «εμφανίστηκε να κλαίει, είχε μελανιές στον αστράγαλο και τα γόνατα και αίμα στα χέρια της». Οι αστυνομικοί ανέκριναν τόσο τον Μπάρογουεϊ όσο και τη γυναίκα του αλλά και την νταντά, ενώ όπως υποστηρίζεται η δεύτερη είπε στις αρχές ότι ο άνδρας της «προσπάθησε να την πνίξει με το ένα χέρι και την έριξε στο πάτωμα στο μπάνιο και μία δεύτερη φορά στην κουζίνα, ύστερα από έναν τσακωμό τους». Η πλευρά του πρώτου ανέφερε πως εκείνος και η γυναίκα του περνούν ένα «δύσκολο» διαζύγιο με αντεγκλήσεις που αφορούν οικογενειακές αλλά και οι οικονομικές διαφορές. Η νταντά από την πλευρά της, πάντα σύμφωνα με τα σχετικά δημοσιεύματα, κατέθεσε πως άκουσε «πριν το δείπνο να σπάνε γυαλιά», ότι «υπήρχαν τσακωμοί» και παράλληλα μετέφερε στους αστυνομικούς πως η γυναίκα του Μπάρογουεϊ της είπε ότι «ο Αντριου με χτύπησε». Σύμφωνα με την έκθεση της αστυνομίας ο πρόεδρος της Athens Kallithea συνελήφθη για πράξεις ενδοοικογενειακής βίας κατά της συζύγου του, η οποία τον κατήγγειλλε πως την «εξανάγκασε σε αναγκαστική σεξουαλική επαφή», ενώ γίνεται αναφορά για σφίξιμο από το λαιμό της (στραγγαλισμό). Το ζευγάρι, σύμφωνα με την εν λόγω έκθεση οδηγήθηκε πρόσφατα στο χωρισμό, καθώς υπήρξε ακραία κτητικότητα με αποτέλεσμα να κορυφωθούν τα κρούσματα ενδοοικογενειακής βίας. Αυτά αναφέρονται στην ένορκη κατάθεση της συζύγου. Το «Athletic» ανέφερε πως επικοινώνησε με την πλευρά του Μπάρογουεϊ , αλλά εκείνη δεν ήθελε να σχολιάσει κάτι.","pubDate":"2023-04-10 15:00:21","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Confira os convocados para a Seleção Brasileira de Flag Football para torneio intercontinental nos EUA","link":"https://www.terra.com.br/esportes/confira-os-convocados-para-a-selecao-brasileira-de-flag-football-para-torneio-intercontinental-nos-eua,978c3151cc5a6936830334ed6ace3ad53yoj51g4.html","keywords":null,"creator":["LANCE!"],"video_url":null,"description":"O head coach da Seleção Brasileira de Flag Football, Heitor Medeiros, anunciou a convocação de ...","content":"O head coach da Seleção Brasileira de Flag Football, Heitor Medeiros, anunciou a convocação de 12 jogadores para a IFAF Americas Continental Flag Football Championship, que acontece em julho, em Charlotte, nos Estados Unidos e é classificatório para o mundial da categoria. A seleção feminina já havia sido convocada na semana anterior. A lista conta com jogadores importantes do FABR , como os wide receivers Victor Hugo 'Mega', do Six Spartans, Athos Daniel, do Coritiba Crocodiles, e João Mendes, do Rio Preto Weilers. Além dos 12 convocados, foram chamados cinco atletas para a lista de suplentes. Rio Preto Weilers, Coritiba Crocodiles e Floripa Ghosts são os times com mais convocados na lista, com dois atletas chamados cada. Os tres times também possuem um atleta na lista de suplentes. Em dezembro do ano passado, a Seleção Brasileira de Flag Football conquistou o 1º Sul-Americano da modalidade organizado pela Confederação Brasileira de Futebol Americano (CBFA) em Itapecerica da Serra-SP. O que é o flag football O flag footbal é uma modalidade derivada do futebol americano, mas que não possui contato físico entre os atletas. Nas partidas, os atletas levam as fitas amarradas nas cinturas, e o objetivo principal é retirar as bandeiras (flag no Inglês) do adversário. Essa ação simula o tackle da NFL e significa o fim de uma jogada. Contudo, é importante ressaltar que o impacto físico e a força utilizada pelos jogadores de futebol americano para bloquear os ataques não existem no flag. A expectativa é que o flag football faça parte do programa dos Jogos Olímpicos de 2028 que serão realizados em Los Angeles, nos Estados Unidos. A NFL ratificou apoio à Federação Internacional de Futebol Americano (IFAF) para alcançar esse objetivo. Confira os convocados: Quarterback Vitor Paiva - Rio Football Academy SN Renato Munford - Floripa Ghosts Wide receivers Athos Daniel - Coritiba Crocodiles Victor Hugo 'Mega' - Six Spartans Pedro Clemente - Vasco Almirantes João Mendes - Rio Preto Weilers Matheus Silva - Coritiba Crocodiles DB Edmar dos Santos - NO Mercy-USA Felipe Nunes Índio - Cavalaria 2 de Julho Thalys Almeida - Rio Preto Weilers Caique Andrade - Gators Flag Matheus Oliveira 'Viza' - Floripa Ghosts Suplentes Lucas Caravita- Rio Preto Weilers Adan Rodrigues - Coritiba Crocodiles Charles Wagner - Rebeldes do Cerrado Nicolas Quadros - Floripa Ghosts Paulo Souza - São Paulo Buzz + Os melhores conteúdos no seu e-mail gratuitamente. Escolha a sua Newsletter favorita do Terra. Clique aqui!","pubDate":"2023-04-10 14:44:13","image_url":null,"source_id":"terra","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"France : Boudaoui a dépassé la barre des 100 matchs avec Nice","link":"https://www.dzfoot.com/verts-deurope/france-boudaoui-a-depasse-la-barre-des-100-matchs-avec-nice-240734.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Verts du Monde"],"creator":null,"video_url":null,"description":"Le milieu de terrain algérien de l’OGC Nice, Hicham Boudaoui, a atteint la barre symbolique des 100 matchs disputés sous les couleurs de la formation française. Depuis son arrivée chez les Aiglons, le natif de Béchar e eu une belle progression qui a attiré les regards de nombreux clubs européens. Homme fort de l’effectif, il […] The post France : Boudaoui a dépassé la barre des 100 matchs avec Nice appeared first on Football Algérien - DZFOOT.COM.","content":"Le milieu de terrain algérien de l’OGC Nice, Hicham Boudaoui, a atteint la barre symbolique des 100 matchs disputés sous les couleurs de la formation française. Depuis son arrivée chez les Aiglons, le natif de Béchar e eu une belle progression qui a attiré les regards de nombreux clubs européens. Homme fort de l’effectif, il a été prolongé en janvier dernier jusqu’en juin 2027. Comme c’est de coutume avec les joueurs ayant atteint les 100 matchs avec l’équipe, Hicham Boudaoui sera honoré lors de la prochaine rencontre à domicile des Niçois, le jeudi 20 avril 2023, pour la réception du club suisse de Bâle en quarts de finale de la Ligue Europa Conférence. DZfoot","pubDate":"2023-04-10 14:42:58","image_url":null,"source_id":"dzfoot","category":["sports"],"country":["algeria"],"language":"french"},{"title":"Snl24.com | Zamalek President: My Prison Sentence Is To Blame For Poor Form","link":"https://www.snl24.com/soccerladuma/International/African-Football/mortada-mansour-my-prison-sentence-is-to-blame-for-zamaleks-poor-results-20230410","keywords":null,"creator":null,"video_url":null,"description":"Zamalek president Mortada Mansour has blamed his prison sentence for the team's poor form this season.","content":"Zamalek president Mortada Mansour has blamed his prison sentence for the team's poor form this season. Mansour had been away from the team for a month after spending time in jail for verbally insulting Al Ahly president Mahmoud El-Khatib. Soliman Wahdan replaced Mansour as the president on interim basis, before the 70-year-old returned earlier this month. However, Mansour feels his absence had a direct effort on the first team, who sit fourth on the Egyptian Premier League table and were eliminated from the CAF Champions League group stages. “What is happening with Zamalek is not fair because usually when a father of a family is imprisoned, the children are affected and that of course, leads to negative results,” Mansour said via the club’s TV channel. “Jesualdo Ferreira was responsible for not playing the new signings and that is why people were very quick to write them off. “The players were affected by my imprisonment, and this resulted in us dropping six points in the CAF Champions League group stages.\" You must be to read and post comments.","pubDate":"2023-04-10 14:34:44","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Chippa announce new interim coach, Lentjies demoted","link":"https://www.snl24.com/KickOff/SANews/Premiership/Chippa-United/chippa-united-demote-kurt-lentjies-after-defeat-to-orlando-pirates-20230410","keywords":null,"creator":null,"video_url":null,"description":"Chippa United have demoted coach Kurt Lentjies to the DStv Diski Challenge side after the weekend's defeat to Orlando Pirates.","content":"Lentjies took over from Morgan Mamilla last month, but the club extended their winless run to six matches in the league with the defeat to the Buccaneers. The Gqeberha-based outfit confirmed on Monday that Siyabulela Gwambi will take charge of the first team for the remainder of the campaign. “Chippa United Football Club would like to announce that Kurt Lentjies has been redeployed to head up our DSTV Diski Challenge Team,” the club's statement read. “Siyabulela Gwambi has been appointed interim coach for remainder of the season. “Gwambi has been a loyal servant of the club having acquired his CAF License A coaching credentials Club Chairman, Mr. Siviwe Mpengesi has called upon all Chilli Boys faithfuls to rally behind the Gqeberha born native and his charges as they look for positive results.”","pubDate":"2023-04-10 14:13:00","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"(VIDEO) Sedamnaest godina kasnije: Marco Materazzi otkrio šta je rekao Zidaneu","link":"https://sport1.oslobodjenje.ba/s1/fudbal/ino-fudbal/video-sedamnaest-godina-kasnije-marco-materazzi-otkrio-sta-je-rekao-zidaneu-851350","keywords":["Ino fudbal"],"creator":null,"video_url":null,"description":"Sedamnaest godina nakon antologijskog trenutka u finalu Svjetskog prvenstva 2006. godine Marco Materazzi je konačno otkrio šta je rekao Zinedineu Zida...","content":"Sedamnaest godina nakon antologijskog trenutka u finalu Svjetskog prvenstva 2006. godine Marco Materazzi je konačno otkrio šta je rekao Zinedineu Zidaneu prije nego ga je Francuz glavom udario i poslao na zemlju. Iako se isprva govorilo da mu je psovao majku, i sam Zidane je ranije izjavio kako mu je uvrijedio sestru, ali nikada nije bilo tačno rečeno šta je Materazzi uradio, pa je uslijedial takva reakcija francuskog asa. - Zidane mi je ponudio dres. Rekao sam mu da bih radije uzeo njegovu sestru, rekao je Marco Materazzi u podcastu \"Italian football TV\". Sve se to dogodilo u produžecima finalne utakmice, a Francuska je ostala sa desetoricom igrača do kraja produžetaka, da bi Italija nakon penala savladala Francuze. “Zidane offered me his jersey, I said no I prefer his sister” - Marco Materazzi on what was really said before he got headbutted","pubDate":"2023-04-10 14:00:54","image_url":"https://cdn.oslobodjenje.ba/images/slike/new/2023/04/10/6249413.png","source_id":"oslobodjenje","category":["sports"],"country":["Bosnia And Herzegovina"],"language":"bosnian"},{"title":"Manchester City can brush aside Bayern Munich in exciting Champions League duel","link":"https://metro.co.uk/2023/04/10/manchester-city-can-brush-aside-bayern-munich-in-champions-league-18583286/","keywords":["Football","Sport","Bayern Munich FC","Champions League","Erling Haaland","Jack Grealish","Manchester City FC","Metro newspaper","Pep Guardiola","The Tipster","Thomas Tuchel"],"creator":["The Tipster"],"video_url":null,"description":"This might be Manchester City's best chance of Champions League glory.","content":"THERE will be further opportunities to win the Champions League , of course there will, but it’s difficult not to feel this may be Manchester City ’s best shot as they are at the peak of their powers. The stylish, sumptuous second-half display at Southampton was as ruthless as football can get while wrapped up as pure entertainment. City weren’t at their best in the first half but led through Erling Haaland ’s 45th-minute strike . They stepped up a gear when asked and it looked for all the world as though they could have easily won by more than the final 4-1 scoreline if required. Now the defending Premier League champions entertain Bayern Munich in a Champions League quarter-final first leg which looked a daunting prospect when it was drawn. But Pep Guardiola has led his troops to eight straight wins and ten victories plus a couple of draws in all competitions since their last defeat, a 1-0 reversal at Tottenham at the beginning of February. One of the two draws was at RB Leipzig in the previous round and they proceeded to thump them 7-0 in the return leg at the Etihad Stadium. Ian Wright tells Frank Lampard to recall Chelsea flop and reveals major 'worry' Ex-Chelsea star says current side are 'nothing like' the team he played for Paul Scholes names the player who can help Frank Lampard get permanent Chelsea job The winning sequence also includes the 4-1 demolition of Liverpool and the last time City were beaten in front of their home fans was a 2-1 defeat to Brentford in November when their players probably had one eye on the imminent World Cup. Bayern, who have lost two of their last four matches, are now managed by former Chelsea boss Thomas Tuchel so their perfect record in this season’s competition under Julian Nagelsmann’s command doesn’t necessarily hold water. Tuchel is a more cautious coach and may be happy to stay in contention for the second leg in Bavaria. That could be a fatal strategy and City are not only worth backing to win at 4/5 with Betfred, they should be supported to do so by more than one goal at 21/10 with Paddy Power, Betfair and Sky Bet. Haaland is 13/5 with the first two firms to bag the opening goal while Jack Grealish, currently in fabulous form, is 13/2 with BetUK and Unibet to get on the scoresheet. • 23/20 Benfica, who have won eight of their last night games, to beat Inter Milan, winners just once in their last eight matches, in tonight’s other quarter-final (William Hill) • 13/10 Putney puncher Joe Joyce to strengthen his elite heavyweight boxing credentials by stopping New Jersey-based Chinese opponent Zhilei ‘Big Bang’ Zhang between rounds seven and 12 at the Copper Box in London on Saturday (Betfair) MORE : How many goals has Erling Haaland scored this season for Manchester City? MORE : Erling Haaland on the same level as Lionel Messi and Cristiano Ronaldo, claims Pep Guardiola","pubDate":"2023-04-10 13:36:17","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PGMOL Suspends Referee Pending Investigation Into Robertson Incident","link":"https://thewillnews.com/pgmol-suspends-referee-pending-investigation-into-robertson-incident/?utm_source=rss&utm_medium=rss&utm_campaign=pgmol-suspends-referee-pending-investigation-into-robertson-incident","keywords":["Sports","Andy Robertson","Constantine Hatzidakis","PGMOL"],"creator":["Jude Obafemi, THEWILL"],"video_url":null,"description":"April 10, (THEWILL) – An assistant referee, who allegedly elbowed Liverpool player, Andy Robertson, during halftime in their match against Arsenal, will not be appointed for future matches until an investigation is completed, according to a statement by the referee’s body on Monday. Video replays showed Robertson confronting the official, Constantine Hatzidakis, at halftime during […] The post PGMOL Suspends Referee Pending Investigation Into Robertson Incident appeared first on THEWILL NEWS MEDIA.","content":"April 10, (THEWILL) – An assistant referee, who allegedly elbowed Liverpool player, Andy Robertson, during halftime in their match against Arsenal, will not be appointed for future matches until an investigation is completed, according to a statement by the referee’s body on Monday. Video replays showed Robertson confronting the official, Constantine Hatzidakis, at halftime during Sunday’s game, with Hatzidakis appearing to brush off the Liverpool player and catch him with his elbow. The FA is currently investigating the incident as THEWILL reported. In a statement, the Professional Game Match Officials Limited (PGMOL) said, “PGMOL will not be appointing Constantine Hatzidakis to fixtures in any of the competition it serves while the FA investigates the incident involving the assistant referee and Liverpool defender Andrew Robertson at Anfield.” Liverpool manager, Jurgen Klopp, commented after the 2-2 draw, stating that he did not witness the incident but had heard that “something happened.” The incident has since sparked controversy and discussion among football fans and experts alike, with many expressing their concerns about the integrity and safety of the sport. The investigation by the FA is ongoing, and further updates are expected in due course.","pubDate":"2023-04-10 13:19:07","image_url":null,"source_id":"thewillnigeria","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Meet Cody Mauch, the most interesting offensive lineman in the NFL draft","link":"https://www.espn.com/nfl/draft2023/story/_/id/35993456/cody-mauch-north-dakota-state-taking-smile-2023-nfl-draft?device=featurephone","keywords":null,"creator":null,"video_url":null,"description":"A former walk-on at North Dakota State, Mauch has added technique, weight (and hair) to a jovial personality and a toothless grin.","content":"EVERY SO OFTEN , North Dakota State offensive tackle Cody Mauch will hear from Kendrick Lenzen, his childhood friend and former grade school teammate, via FaceTime. \"He'll be like, 'Hey, give me a smile,'\" Mauch said. \"It's like he's admiring his work.\" Lenzen is responsible for what might become the most recognizable gap-tooth grin in the NFL since Michael Strahan. Mauch hasn't had his two front teeth since colliding with Lenzen while chasing a loose ball in a middle school basketball game. After several dental stopgaps, Mauch decided that he wouldn't repair his teeth until he finished playing football. He could be waiting a while to fix that smile. Mauch (pronounced \"Mouck\") enters the NFL draft later this month as one of the top offensive tackles on the board and Todd McShay's No. 52 overall prospect. ESPN's Matt Miller lists Mauch as his No. 5 tackle and there's a chance the North Dakota State standout hears his name called on the draft's first night in Kansas City, Missouri. \"I can say I knocked out an NFL player's teeth,\" Lenzen said. Mauch's path to the doorstep of the NFL stands out, given where his journey began and what he looked like when he left home. He grew up in Hankinson, North Dakota, a town of 922 in the southeast corner of the state, where he played nine-man football and graduated in a class of 18. Mauch arrived at North Dakota State as a 220-pound walk-on tight end and left 82 pounds heavier as an All-America tackle. The physical transformation makes the 6-foot-5, 302-pound Mauch hard to miss, especially with his long red hair and missing teeth. His personality matches the look. At NDSU, he became known for creative first-down celebrations, having in-game conversations with opposing linemen and playing the air fiddle (and even a real one) after FCS semifinal victories. \"His nickname is 'Tud,'\" said North Dakota State defensive lineman Jake Kava, Mauch's friend and housemate. \"When you think of a guy with the nickname Tud, that's Cody. No front teeth, big smile, long, flowing red hair.\" Beneath the friendly exterior is a talent who can play all five offensive line spots and has an intriguing combination of skills and power. He just approaches football with a smile. MAUCH WALKED ON at North Dakota State after receiving mostly Division II offers out of Hankinson High School, where he played tight end, quarterback and defensive end in the nine-man game. When Bison offensive lineman Nash Jensen first saw Mauch, he thought: \"Who's this scrawny little redhead?\" During a practice in the spring of 2018, North Dakota State coach Chris Klieman called over Jim Kramer, the team's longtime strength coach. Klieman gestured toward Mauch, who had redshirted the previous season and was working with the tight ends. \"That kid's going to be a big kid,\" Klieman told Kramer. But Klieman, who is now the head coach at defending Big 12 champion Kansas State, saw Mauch at a new position, where he could ultimately reach a much higher level. \"He was the first person who ever told me I might have a shot at the NFL,\" Mauch recalled. \"That was before I really even started playing offensive line. I'm like, 'Man, this guy's crazy. How's he know?'\" North Dakota State doesn't treat its players as finished products. Kramer works with a nutritionist to take measurements and predicts the mass that players can add without compromising their effectiveness. Linebackers become defensive ends, tight ends become tackles and so on. The approach has helped NDSU become the nation's premier FCS program, winning nine national titles since 2011 and playing for another in January. Since 2014, North Dakota State has had 10 players drafted, including two first-round quarterbacks (Trey Lance and Carson Wentz) and four offensive linemen. At first, Kramer didn't fully buy Klieman's vision for Mauch. \"I don't know if I saw that he was going to be a 300-pounder,\" Kramer said. \"But Coach Klieman saw it. Then Cody started working.\" Mauch spent the next months in the weight room and dining halls or other eateries in and around campus. NDSU has an all-you-can-eat program for freshmen and \"Cody took full advantage,\" said Matt Entz, who replaced Klieman as coach in December 2018. Kramer outlined a more aggressive in-season training plan for Mauch, since he wasn't on the depth chart. Mauch also spent much of his free offseason time eating and lifting. \"It made such a difference,\" said Joe Mauch, Cody's father. \"Small-town kid, we don't really have too much of a weight program. At school, the weight room is in a corner on the stage. Not a lot, aside from a squat rack and a bench press.\" When the 2018 season kicked off, NDSU listed Cody at 269 pounds, a 35-pound increase from his 2017 weight. By the fall of 2019, he was up to 290 pounds. Mauch also didn't stop growing vertically, measuring 6-foot-5 at the combine, an inch taller than when he arrived in Fargo. \"He's a kid with big hips, big hands, big features,\" Entz said. \"We knew that at some point, he was going to gain some weight. I don't know if anyone really knew what he was going to be, or that he was going to turn out to be potentially a Day 1, Day 2 type of draft pick.\" Mauch began playing the ogre position, an extra offensive lineman who occasionally wears a tight end's number. In 2019, he suited up as both No. 70 (offensive line) and No. 88 (tight end), catching a 2-point conversion in an FCS playoff semifinal win. By the COVID-delayed spring season of 2021, his positional path became clear. North Dakota State initially moved all-conference tackle Cordell Volson from right tackle to left, while placing Mauch on the right side. After two games, the two switched. Volson earned first-team All-America honors that season and in the fall, before becoming a fourth-round draft pick of the Cincinnati Bengals. Mauch remained the team's starter at left tackle. \"He's such a hardworking kid,\" said Jensen, who started multiple seasons next to Mauch at left guard. \"Just to see his progression from being a tight end/defensive end to an All-American, top NFL prospect [for] offensive line, is absolutely crazy. \"I couldn't be more proud.\" Mauch occasionally gets Facebook or Snapchat memories that show what he looked like when he arrived at North Dakota State. The before-and-after graphic of his measurables appeared on TV during the 2023 FCS playoffs and at pre-draft events like the Senior Bowl. \"It's like, 'Wow, I can't believe that's the way I looked,'\" Mauch said. \"It makes you happy for the way things have gone and how different life is now.\" WHEN STACEY MAUCH saw her son walk in the door, she started to cry. Cody was back home from Fargo, where he had visited the E.R. and a dentist, following the collision with Lenzen in the basketball game. His front teeth couldn't be salvaged, and his lips and face had swelled like a balloon. Stacey didn't want to see Cody in pain. As a schoolteacher in Hankinson, she also worried about the impact of such a noticeable facial injury for a seventh-grader. \"You just want your kids to grow up confident and happy,\" Stacey Mauch said. \"'Get your teeth fixed, you'll be confident and be ready to smile and take on the world.' But this guy doesn't need teeth to do that. He's shown that over and over, the way he flashes the smile and the confidence he has.\" Since Cody's mouth was still growing, the plan called for him to wait for implants. He went through several sets of braces to widen his mouth and used a retainer and a \"flipper\" with false teeth. But the retainers kept breaking. After several years, Mauch stopped wearing anything. \"I'm sure my mom and dad were probably a little upset, just because of how much money they paid in braces and all the different dentist appointments, all the broken retainers,\" he said. \"But everyone who knows me knows that no teeth kind of fits my personality. I'm an easygoing, goofy guy. I don't really care how I look.\" Cody is the second of eight children, spanning ages 25 to 7, and comes from a large family that goes back generations around Hankinson. As a boy, he spent summer days at the family crops farm alongside Joe. Tasks ranged from maintenance on tractors and other equipment to clearing fields. When Cody got his driver's license, he began driving a truck. \"You learn the way to work,\" Joe said. \"Our kids have been working on a farm since they were 8 years old.\" Hankinson's school had about 300 students in one building, kindergarten through 12th grade, and only offered a handful of sports. Mauch competed in everything: football, basketball, baseball and track, earning all-region honors in both basketball and track, while setting school records for touchdown receptions and sacks. His older brother, Carter, was a multisport standout, and his younger siblings also competed. \"Whatever was going on for sports in the world, that's what was going on in our front yard, too,\" Stacey Mauch said. \"If it was football season, they would mow a football field out there. If it was baseball season, they would mow a baseball field.\" Cody knew everyone around town, and he and his friends found ways to entertain themselves. Once they began driving, they started to do \"Main-ers.\" \"Just rip it up and down Main Street,\" said Cody, who started with a 2000 Grand Am before buying one of his dad's F-150 trucks. \"There's no stop lights or anything, so it takes you probably 45 seconds to get from one side of town to the other.\" Cody recently looked at a picture of his kindergarten class and realized almost everyone had graduated high school together. In November, Hankinson honored Cody with a celebration at the school. His NFL draft plans aren't firmly set, but Joe expects a party at the VFW or the American Legion in Hankinson, where family and friends will gather. \"I'm definitely going to pay a lot more attention to the draft this year,\" Lenzen said. \"I'm excited, kind of in disbelief. Cody's put a lot of work in, but it's a dream that a lot of people don't get to have.\" DURING MAUCH'S FRESHMAN year at North Dakota State, Hank Jacobs, the team's director of football operations, looked at the clean-cut walk-on and made a suggestion: Grow out the red hair. Mauch wasn't convinced, but he stopped going to the barber. \"I'm like, 'Eh, I'll just do it, why not?'\" Mauch said. \"I've been growing it out for probably four years now. Saved a lot of money on haircuts.\" The long red hair, a trait Mauch shares with two of his sisters, is part of his signature look. He added a red beard while at NDSU. There's only one drawback. \"There was hair everywhere,\" said Kava, who shared a house with Mauch. \"I was the vacuum guy, so I had to clean it out and I was like, 'Cody, could you please cut your hair, for my sake?' It's annoying to clean up, but it's here to stay. It's definitely part of the thing he has going.\" Mauch incorporated his locks into a first-down signal: the hair point. Other celebrations after NDSU moved the chains included a slide, a somersault and several that were rehearsed but too difficult to perform in games, like the Maucharena (his spin on the '90s dance) and the conga line. Naturally, Mauch named one celebration \"A-gap power,\" where he smiles after first downs. His missing teeth actually became a conversation topic during games with opposing players. \"The D-ends and D-tackles, they're asking him, 'Why don't you have two front teeth?'\" Jensen said. \"As each play went along, the story got longer and longer. He probably changed it from time to time, just to mess with them.\" Mauch didn't make the conversations all about himself. By his third year as a starter, he had built relationships with opposing linemen, and tried to get to know new ones. \"You're kicking these guys' butts and then talking to them about their uncle and farming,\" Kava said. \"I think we were playing [Northern Iowa] and he's talking about egg science with their D-tackle. We'd get home and he would tell me, 'We were talking about the new combine from John Deere.' \"I'm like, 'Cody, you're something else.'\" Not surprisingly, Mauch was in the middle of North Dakota State's fiddle-playing tradition after FCS semifinal wins. Since the national title game is held annually in Frisco, Texas, North Dakota State plays the country song \"If you're gonna play in Texas [You Gotta Have a Fiddle in the Band]\" in the Fargodome when it advances. Bison players will play air fiddle, but after a win over Incarnate Word in December, someone handed Mauch a real one. Middle schoolers in nearby Moorhead, Minnesota, noticed Mauch's fiddle form on TV and invited him to learn how to play correctly. \"Just a classroom of sixth- and seventh-graders making fun of me for not knowing how to hold it, not playing it right,\" Mauch said. \"That was cool to get humbled by those guys.\" For Mauch, the in-game displays made football fun, especially while playing on the line. He clicked instantly with the offensive linemen after switching over. Mauch loved that the group's success hinged on being unified, but individual personalities could still stand out. During pregame meals, the linemen would compile their Mount Rushmores -- top fours -- for a variety of topics: snacks, favorite foods, least favorite foods, favorite places in Fargo, and more. \"The stupid stuff that was right in my wheelhouse,\" Mauch said. Then, the Bison would usually proceed to mash their opponents. They ranked in the top 10 nationally in rushing throughout Mauch's career. Mauch's philosophy impacted everyone around him, even his coaches. \"I didn't think the football field was the place to have fun,\" NDSU offensive line coach Dan Larson said. \"But he has fun with it and it makes football enjoyable to him. We stopped worrying about whether he was doing first-down signals, or if a guy runs by and he gives a high-five, but [the opposing player] won't do it, he gives himself a high-five. \"When I stopped worrying about those parts of it and just the snap and the finish, his level of football even went up. Because it's who he is.\" ON NFL SUNDAYS in recent years, Mauch and his housemates would gather in their living room and watch games on four mounted TVs. Sometimes they'd even bring in a fifth screen. Mauch used the time to unwind, but as he got older, his attention shifted. \"I'm sitting there, watching the left tackle, watching the center,\" he said. \"I was just putting myself in their shoes.\" Mauch's appearance and personality project fun, but he takes football seriously. Entz never questioned Mauch's commitment, noting that he approaches the grind of the game with some balance. Larson learned that as long as he smiled once in a while, he could challenge Mauch just like any other player. Since Mauch is relatively new to playing offensive line, he had to build up his strength and technique. Kava remembered being able to bull-rush Mauch early in their careers before Mauch added \"that tackle weight.\" Larson worked on hand placement with Mauch but saw him thrive at playing with his hips low to keep defenders from getting past him in pass protection. Mauch's footwork and ability to move are his greatest assets. Larson thinks the right blocking scheme will make Mauch a \"vertical monster,\" where he can pull and run downfield. Mauch doesn't have the longest arms, which measured 32 and three-eighths inches at the NFL combine, and might not project as a tackle for every team, but he can play all over the line, as he displayed during Senior Bowl week. \"He's the only guy in this draft class who has proven he can play all five spots,\" Senior Bowl executive director and former ESPN draft analyst Jim Nagy said. \"Those guys are really hard to find. In the [Senior Bowl] game, he played left guard, center and right tackle, so he's proven he can play on both sides, which is big, too.\" While scouting Mauch's film, Nagy never flagged arm length as a potential drawback. Mauch held up well against better competition during Senior Bowl week, and players on the National team voted him as their top offensive lineman. Nagy said most teams he talked to before the event pegged Mauch as a second-round pick, but Mauch's performance gave him \"a legit chance\" to go at the end of the first round. \"I would start him at left tackle, because that's the premium position and prove to me that he can't play there,\" Nagy said. \"If he can't play there, then we'll slide him into guard or center and there'll be a Pro Bowl-level player inside.\" An AFC scout said Mauch likely projects as a Day 2 pick but added that all teams are starving for tackles. \"His passion and the emphasis he puts on playing the game jumped out,\" the scout said of Mauch. \"I wanted to keep watching this guy.\" Everyone will soon be watching Mauch in the NFL. Mauch appreciates his unlikely path to pro ball: small town, nine-man ball, three years as a walk-on at NDSU. He considers receiving a scholarship to be among the best moments of his life. Another moment will come soon when his name is called in Kansas City at the draft. Mauch looks forward to entering a pro facility with his signature smile and becoming \"a locker-room guy,\" just like he was at NDSU. \"It gets more serious the older you get, the higher level you get to, but it's still football at the heart, so you just go have fun,\" he said. \"If you're enjoying yourself, other people see that.\"","pubDate":"2023-04-10 16:23:05","image_url":null,"source_id":"espn","category":["sports"],"country":["australia","canada","united kingdom","india","singapore","united states of america"],"language":"english"},{"title":"«Τίναξε» την μπάνκα με επτάδα ισοπαλιών!","link":"https://www.gazzetta.gr/football/2212718/tinaxe-tin-mpanka-me-eptada-isopalion","keywords":["Ποδόσφαιρο","Newsroom","Προγνωστικά"],"creator":null,"video_url":null,"description":"Ω ρε μάνα, μια δελτιάρα! Οκτάδα χιναριών σε ζητούμενα, με 247 στήλες! Τα έψαχνε όλα ο τυπάς. Από τις δυάδες μέχρι και την οκτάδα!","content":"Η ΣΥΝΕΧΕΙΑ ΕΔΩ","pubDate":"2023-04-10 15:18:47","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"«Ο ιδιοκτήτης της Καλλιθέας συνελήφθη με κατηγορίες για ενδοοικογενειακή βία»","link":"https://www.gazzetta.gr/football/superleague-2/2212803/o-idioktitis-tis-kallitheas-synelifthi-me-katigories-gia","keywords":["Ποδόσφαιρο","Superleague 2","Athens Kallithea","Newsroom"],"creator":null,"video_url":null,"description":"Η «Aspen Daily News» και το «Athletic» μετέδωσαν πως ο Αντριου Μπάρογουεϊ βρίσκεται αντιμέτωπος με κατηγορίες που αφορούν ενδοοικογενειακή βία.","content":"Αντιμέτωπος με κατηγορίες που αφορούν ενδοοικογενειακή βία βρίσκεται, σύμφωνα με ξένα ΜΜΕ, ο Αντριου Μπάρογουεϊ, ιδιοκτήτης της Athens Kallithea όπως και άλλων αθλητικών σωματείων στην Ευρώπη και τις ΗΠΑ . Σύμφωνα με τα όσα αποκάλυψε η «Aspen Daily News» και αναπαρήγαγαν αρκετά άλλα media όπως το «Athletic», ο επιχειρηματίας που εδρεύει πέρα από τον Ατλαντικό συνελήφθη την περασμένη Πέμπτη (6/4) για χρήση βίας κατά τη συζύγου του και ναι μεν αφέθηκε ελεύθερος με εγγύηση, όμως στο άμεσο μέλλον θα εκδικαστεί η υπόθεσή του ενώπιον των αρμόδιων δικαστικών αρχών. Οπως δημοσιεύτηκε εκείνο το βράδυ βρίσκονταν με τη σύζυγό του στο ξενοδοχείο «Limelight Hotel» στο Ασπεν και η αστυνομία της περιοχής δέχθηκε κλήση ότι ακούγονταν «φωνές» από το δωμάτιό τους. Ετσι τα όργανα της τάξης μετέβησαν εκεί, όπου τους άνοιξαν την πόρτα εκείνος και η γυναίκα του. Σύμφωνα με τα σχετικά ρεπορτάζ στην ένορκη κατάθεση που πάρθηκε η σύζυγός του «εμφανίστηκε να κλαίει, είχε μελανιές στον αστράγαλο και τα γόνατα και αίμα στα χέρια της». Οι αστυνομικοί ανέκριναν τόσο τον Μπάρογουεϊ όσο και τη γυναίκα του αλλά και την νταντά, ενώ όπως υποστηρίζεται η δεύτερη είπε στις αρχές ότι ο άνδρας της «προσπάθησε να την πνίξει με το ένα χέρι και την έριξε στο πάτωμα στο μπάνιο και μία δεύτερη φορά στην κουζίνα, ύστερα από έναν τσακωμό τους». Η πλευρά του πρώτου ανέφερε πως εκείνος και η γυναίκα του περνούν ένα «δύσκολο» διαζύγιο με αντεγκλήσεις που αφορούν οικογενειακές αλλά και οι οικονομικές διαφορές. Η νταντά από την πλευρά της, πάντα σύμφωνα με τα σχετικά δημοσιεύματα, κατέθεσε πως άκουσε «πριν το δείπνο να σπάνε γυαλιά», ότι «υπήρχαν τσακωμοί» και παράλληλα μετέφερε στους αστυνομικούς πως η γυναίκα του Μπάρογουεϊ της είπε ότι «ο Αντριου με χτύπησε». Σύμφωνα με την έκθεση της αστυνομίας ο πρόεδρος της Athens Kallithea συνελήφθη για πράξεις ενδοοικογενειακής βίας κατά της συζύγου του, η οποία τον κατήγγειλλε πως την «εξανάγκασε σε αναγκαστική σεξουαλική επαφή», ενώ γίνεται αναφορά για σφίξιμο από το λαιμό της (στραγγαλισμό). Το ζευγάρι, σύμφωνα με την εν λόγω έκθεση οδηγήθηκε πρόσφατα στο χωρισμό, καθώς υπήρξε ακραία κτητικότητα με αποτέλεσμα να κορυφωθούν τα κρούσματα ενδοοικογενειακής βίας. Αυτά αναφέρονται στην ένορκη κατάθεση της συζύγου. Το «Athletic» ανέφερε πως επικοινώνησε με την πλευρά του Μπάρογουεϊ , αλλά εκείνη δεν ήθελε να σχολιάσει κάτι.","pubDate":"2023-04-10 15:00:21","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Confira os convocados para a Seleção Brasileira de Flag Football para torneio intercontinental nos EUA","link":"https://www.terra.com.br/esportes/confira-os-convocados-para-a-selecao-brasileira-de-flag-football-para-torneio-intercontinental-nos-eua,978c3151cc5a6936830334ed6ace3ad53yoj51g4.html","keywords":null,"creator":["LANCE!"],"video_url":null,"description":"O head coach da Seleção Brasileira de Flag Football, Heitor Medeiros, anunciou a convocação de ...","content":"O head coach da Seleção Brasileira de Flag Football, Heitor Medeiros, anunciou a convocação de 12 jogadores para a IFAF Americas Continental Flag Football Championship, que acontece em julho, em Charlotte, nos Estados Unidos e é classificatório para o mundial da categoria. A seleção feminina já havia sido convocada na semana anterior. A lista conta com jogadores importantes do FABR , como os wide receivers Victor Hugo 'Mega', do Six Spartans, Athos Daniel, do Coritiba Crocodiles, e João Mendes, do Rio Preto Weilers. Além dos 12 convocados, foram chamados cinco atletas para a lista de suplentes. Rio Preto Weilers, Coritiba Crocodiles e Floripa Ghosts são os times com mais convocados na lista, com dois atletas chamados cada. Os tres times também possuem um atleta na lista de suplentes. Em dezembro do ano passado, a Seleção Brasileira de Flag Football conquistou o 1º Sul-Americano da modalidade organizado pela Confederação Brasileira de Futebol Americano (CBFA) em Itapecerica da Serra-SP. O que é o flag football O flag footbal é uma modalidade derivada do futebol americano, mas que não possui contato físico entre os atletas. Nas partidas, os atletas levam as fitas amarradas nas cinturas, e o objetivo principal é retirar as bandeiras (flag no Inglês) do adversário. Essa ação simula o tackle da NFL e significa o fim de uma jogada. Contudo, é importante ressaltar que o impacto físico e a força utilizada pelos jogadores de futebol americano para bloquear os ataques não existem no flag. A expectativa é que o flag football faça parte do programa dos Jogos Olímpicos de 2028 que serão realizados em Los Angeles, nos Estados Unidos. A NFL ratificou apoio à Federação Internacional de Futebol Americano (IFAF) para alcançar esse objetivo. Confira os convocados: Quarterback Vitor Paiva - Rio Football Academy SN Renato Munford - Floripa Ghosts Wide receivers Athos Daniel - Coritiba Crocodiles Victor Hugo 'Mega' - Six Spartans Pedro Clemente - Vasco Almirantes João Mendes - Rio Preto Weilers Matheus Silva - Coritiba Crocodiles DB Edmar dos Santos - NO Mercy-USA Felipe Nunes Índio - Cavalaria 2 de Julho Thalys Almeida - Rio Preto Weilers Caique Andrade - Gators Flag Matheus Oliveira 'Viza' - Floripa Ghosts Suplentes Lucas Caravita- Rio Preto Weilers Adan Rodrigues - Coritiba Crocodiles Charles Wagner - Rebeldes do Cerrado Nicolas Quadros - Floripa Ghosts Paulo Souza - São Paulo Buzz + Os melhores conteúdos no seu e-mail gratuitamente. Escolha a sua Newsletter favorita do Terra. Clique aqui!","pubDate":"2023-04-10 14:44:13","image_url":null,"source_id":"terra","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"France : Boudaoui a dépassé la barre des 100 matchs avec Nice","link":"https://www.dzfoot.com/verts-deurope/france-boudaoui-a-depasse-la-barre-des-100-matchs-avec-nice-240734.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Verts du Monde"],"creator":null,"video_url":null,"description":"Le milieu de terrain algérien de l’OGC Nice, Hicham Boudaoui, a atteint la barre symbolique des 100 matchs disputés sous les couleurs de la formation française. Depuis son arrivée chez les Aiglons, le natif de Béchar e eu une belle progression qui a attiré les regards de nombreux clubs européens. Homme fort de l’effectif, il […] The post France : Boudaoui a dépassé la barre des 100 matchs avec Nice appeared first on Football Algérien - DZFOOT.COM.","content":"Le milieu de terrain algérien de l’OGC Nice, Hicham Boudaoui, a atteint la barre symbolique des 100 matchs disputés sous les couleurs de la formation française. Depuis son arrivée chez les Aiglons, le natif de Béchar e eu une belle progression qui a attiré les regards de nombreux clubs européens. Homme fort de l’effectif, il a été prolongé en janvier dernier jusqu’en juin 2027. Comme c’est de coutume avec les joueurs ayant atteint les 100 matchs avec l’équipe, Hicham Boudaoui sera honoré lors de la prochaine rencontre à domicile des Niçois, le jeudi 20 avril 2023, pour la réception du club suisse de Bâle en quarts de finale de la Ligue Europa Conférence. DZfoot","pubDate":"2023-04-10 14:42:58","image_url":null,"source_id":"dzfoot","category":["sports"],"country":["algeria"],"language":"french"},{"title":"Snl24.com | Zamalek President: My Prison Sentence Is To Blame For Poor Form","link":"https://www.snl24.com/soccerladuma/International/African-Football/mortada-mansour-my-prison-sentence-is-to-blame-for-zamaleks-poor-results-20230410","keywords":null,"creator":null,"video_url":null,"description":"Zamalek president Mortada Mansour has blamed his prison sentence for the team's poor form this season.","content":"Zamalek president Mortada Mansour has blamed his prison sentence for the team's poor form this season. Mansour had been away from the team for a month after spending time in jail for verbally insulting Al Ahly president Mahmoud El-Khatib. Soliman Wahdan replaced Mansour as the president on interim basis, before the 70-year-old returned earlier this month. However, Mansour feels his absence had a direct effort on the first team, who sit fourth on the Egyptian Premier League table and were eliminated from the CAF Champions League group stages. “What is happening with Zamalek is not fair because usually when a father of a family is imprisoned, the children are affected and that of course, leads to negative results,” Mansour said via the club’s TV channel. “Jesualdo Ferreira was responsible for not playing the new signings and that is why people were very quick to write them off. “The players were affected by my imprisonment, and this resulted in us dropping six points in the CAF Champions League group stages.\" You must be to read and post comments.","pubDate":"2023-04-10 14:34:44","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Chippa announce new interim coach, Lentjies demoted","link":"https://www.snl24.com/KickOff/SANews/Premiership/Chippa-United/chippa-united-demote-kurt-lentjies-after-defeat-to-orlando-pirates-20230410","keywords":null,"creator":null,"video_url":null,"description":"Chippa United have demoted coach Kurt Lentjies to the DStv Diski Challenge side after the weekend's defeat to Orlando Pirates.","content":"Lentjies took over from Morgan Mamilla last month, but the club extended their winless run to six matches in the league with the defeat to the Buccaneers. The Gqeberha-based outfit confirmed on Monday that Siyabulela Gwambi will take charge of the first team for the remainder of the campaign. “Chippa United Football Club would like to announce that Kurt Lentjies has been redeployed to head up our DSTV Diski Challenge Team,” the club's statement read. “Siyabulela Gwambi has been appointed interim coach for remainder of the season. “Gwambi has been a loyal servant of the club having acquired his CAF License A coaching credentials Club Chairman, Mr. Siviwe Mpengesi has called upon all Chilli Boys faithfuls to rally behind the Gqeberha born native and his charges as they look for positive results.”","pubDate":"2023-04-10 14:13:00","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"(VIDEO) Sedamnaest godina kasnije: Marco Materazzi otkrio šta je rekao Zidaneu","link":"https://sport1.oslobodjenje.ba/s1/fudbal/ino-fudbal/video-sedamnaest-godina-kasnije-marco-materazzi-otkrio-sta-je-rekao-zidaneu-851350","keywords":["Ino fudbal"],"creator":null,"video_url":null,"description":"Sedamnaest godina nakon antologijskog trenutka u finalu Svjetskog prvenstva 2006. godine Marco Materazzi je konačno otkrio šta je rekao Zinedineu Zida...","content":"Sedamnaest godina nakon antologijskog trenutka u finalu Svjetskog prvenstva 2006. godine Marco Materazzi je konačno otkrio šta je rekao Zinedineu Zidaneu prije nego ga je Francuz glavom udario i poslao na zemlju. Iako se isprva govorilo da mu je psovao majku, i sam Zidane je ranije izjavio kako mu je uvrijedio sestru, ali nikada nije bilo tačno rečeno šta je Materazzi uradio, pa je uslijedial takva reakcija francuskog asa. - Zidane mi je ponudio dres. Rekao sam mu da bih radije uzeo njegovu sestru, rekao je Marco Materazzi u podcastu \"Italian football TV\". Sve se to dogodilo u produžecima finalne utakmice, a Francuska je ostala sa desetoricom igrača do kraja produžetaka, da bi Italija nakon penala savladala Francuze. “Zidane offered me his jersey, I said no I prefer his sister” - Marco Materazzi on what was really said before he got headbutted","pubDate":"2023-04-10 14:00:54","image_url":"https://cdn.oslobodjenje.ba/images/slike/new/2023/04/10/6249413.png","source_id":"oslobodjenje","category":["sports"],"country":["Bosnia And Herzegovina"],"language":"bosnian"},{"title":"Manchester City can brush aside Bayern Munich in exciting Champions League duel","link":"https://metro.co.uk/2023/04/10/manchester-city-can-brush-aside-bayern-munich-in-champions-league-18583286/","keywords":["Football","Sport","Bayern Munich FC","Champions League","Erling Haaland","Jack Grealish","Manchester City FC","Metro newspaper","Pep Guardiola","The Tipster","Thomas Tuchel"],"creator":["The Tipster"],"video_url":null,"description":"This might be Manchester City's best chance of Champions League glory.","content":"THERE will be further opportunities to win the Champions League , of course there will, but it’s difficult not to feel this may be Manchester City ’s best shot as they are at the peak of their powers. The stylish, sumptuous second-half display at Southampton was as ruthless as football can get while wrapped up as pure entertainment. City weren’t at their best in the first half but led through Erling Haaland ’s 45th-minute strike . They stepped up a gear when asked and it looked for all the world as though they could have easily won by more than the final 4-1 scoreline if required. Now the defending Premier League champions entertain Bayern Munich in a Champions League quarter-final first leg which looked a daunting prospect when it was drawn. But Pep Guardiola has led his troops to eight straight wins and ten victories plus a couple of draws in all competitions since their last defeat, a 1-0 reversal at Tottenham at the beginning of February. One of the two draws was at RB Leipzig in the previous round and they proceeded to thump them 7-0 in the return leg at the Etihad Stadium. Ian Wright tells Frank Lampard to recall Chelsea flop and reveals major 'worry' Ex-Chelsea star says current side are 'nothing like' the team he played for Paul Scholes names the player who can help Frank Lampard get permanent Chelsea job The winning sequence also includes the 4-1 demolition of Liverpool and the last time City were beaten in front of their home fans was a 2-1 defeat to Brentford in November when their players probably had one eye on the imminent World Cup. Bayern, who have lost two of their last four matches, are now managed by former Chelsea boss Thomas Tuchel so their perfect record in this season’s competition under Julian Nagelsmann’s command doesn’t necessarily hold water. Tuchel is a more cautious coach and may be happy to stay in contention for the second leg in Bavaria. That could be a fatal strategy and City are not only worth backing to win at 4/5 with Betfred, they should be supported to do so by more than one goal at 21/10 with Paddy Power, Betfair and Sky Bet. Haaland is 13/5 with the first two firms to bag the opening goal while Jack Grealish, currently in fabulous form, is 13/2 with BetUK and Unibet to get on the scoresheet. • 23/20 Benfica, who have won eight of their last night games, to beat Inter Milan, winners just once in their last eight matches, in tonight’s other quarter-final (William Hill) • 13/10 Putney puncher Joe Joyce to strengthen his elite heavyweight boxing credentials by stopping New Jersey-based Chinese opponent Zhilei ‘Big Bang’ Zhang between rounds seven and 12 at the Copper Box in London on Saturday (Betfair) MORE : How many goals has Erling Haaland scored this season for Manchester City? MORE : Erling Haaland on the same level as Lionel Messi and Cristiano Ronaldo, claims Pep Guardiola","pubDate":"2023-04-10 13:36:17","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PGMOL Suspends Referee Pending Investigation Into Robertson Incident","link":"https://thewillnews.com/pgmol-suspends-referee-pending-investigation-into-robertson-incident/?utm_source=rss&utm_medium=rss&utm_campaign=pgmol-suspends-referee-pending-investigation-into-robertson-incident","keywords":["Sports","Andy Robertson","Constantine Hatzidakis","PGMOL"],"creator":["Jude Obafemi, THEWILL"],"video_url":null,"description":"April 10, (THEWILL) – An assistant referee, who allegedly elbowed Liverpool player, Andy Robertson, during halftime in their match against Arsenal, will not be appointed for future matches until an investigation is completed, according to a statement by the referee’s body on Monday. Video replays showed Robertson confronting the official, Constantine Hatzidakis, at halftime during […] The post PGMOL Suspends Referee Pending Investigation Into Robertson Incident appeared first on THEWILL NEWS MEDIA.","content":"April 10, (THEWILL) – An assistant referee, who allegedly elbowed Liverpool player, Andy Robertson, during halftime in their match against Arsenal, will not be appointed for future matches until an investigation is completed, according to a statement by the referee’s body on Monday. Video replays showed Robertson confronting the official, Constantine Hatzidakis, at halftime during Sunday’s game, with Hatzidakis appearing to brush off the Liverpool player and catch him with his elbow. The FA is currently investigating the incident as THEWILL reported. In a statement, the Professional Game Match Officials Limited (PGMOL) said, “PGMOL will not be appointing Constantine Hatzidakis to fixtures in any of the competition it serves while the FA investigates the incident involving the assistant referee and Liverpool defender Andrew Robertson at Anfield.” Liverpool manager, Jurgen Klopp, commented after the 2-2 draw, stating that he did not witness the incident but had heard that “something happened.” The incident has since sparked controversy and discussion among football fans and experts alike, with many expressing their concerns about the integrity and safety of the sport. The investigation by the FA is ongoing, and further updates are expected in due course.","pubDate":"2023-04-10 13:19:07","image_url":null,"source_id":"thewillnigeria","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Meet Cody Mauch, the most interesting offensive lineman in the NFL draft","link":"https://www.espn.com/nfl/draft2023/story/_/id/35993456/cody-mauch-north-dakota-state-taking-smile-2023-nfl-draft?device=featurephone","keywords":null,"creator":null,"video_url":null,"description":"A former walk-on at North Dakota State, Mauch has added technique, weight (and hair) to a jovial personality and a toothless grin.","content":"EVERY SO OFTEN , North Dakota State offensive tackle Cody Mauch will hear from Kendrick Lenzen, his childhood friend and former grade school teammate, via FaceTime. \"He'll be like, 'Hey, give me a smile,'\" Mauch said. \"It's like he's admiring his work.\" Lenzen is responsible for what might become the most recognizable gap-tooth grin in the NFL since Michael Strahan. Mauch hasn't had his two front teeth since colliding with Lenzen while chasing a loose ball in a middle school basketball game. After several dental stopgaps, Mauch decided that he wouldn't repair his teeth until he finished playing football. He could be waiting a while to fix that smile. Mauch (pronounced \"Mouck\") enters the NFL draft later this month as one of the top offensive tackles on the board and Todd McShay's No. 52 overall prospect. ESPN's Matt Miller lists Mauch as his No. 5 tackle and there's a chance the North Dakota State standout hears his name called on the draft's first night in Kansas City, Missouri. \"I can say I knocked out an NFL player's teeth,\" Lenzen said. Mauch's path to the doorstep of the NFL stands out, given where his journey began and what he looked like when he left home. He grew up in Hankinson, North Dakota, a town of 922 in the southeast corner of the state, where he played nine-man football and graduated in a class of 18. Mauch arrived at North Dakota State as a 220-pound walk-on tight end and left 82 pounds heavier as an All-America tackle. The physical transformation makes the 6-foot-5, 302-pound Mauch hard to miss, especially with his long red hair and missing teeth. His personality matches the look. At NDSU, he became known for creative first-down celebrations, having in-game conversations with opposing linemen and playing the air fiddle (and even a real one) after FCS semifinal victories. \"His nickname is 'Tud,'\" said North Dakota State defensive lineman Jake Kava, Mauch's friend and housemate. \"When you think of a guy with the nickname Tud, that's Cody. No front teeth, big smile, long, flowing red hair.\" Beneath the friendly exterior is a talent who can play all five offensive line spots and has an intriguing combination of skills and power. He just approaches football with a smile. MAUCH WALKED ON at North Dakota State after receiving mostly Division II offers out of Hankinson High School, where he played tight end, quarterback and defensive end in the nine-man game. When Bison offensive lineman Nash Jensen first saw Mauch, he thought: \"Who's this scrawny little redhead?\" During a practice in the spring of 2018, North Dakota State coach Chris Klieman called over Jim Kramer, the team's longtime strength coach. Klieman gestured toward Mauch, who had redshirted the previous season and was working with the tight ends. \"That kid's going to be a big kid,\" Klieman told Kramer. But Klieman, who is now the head coach at defending Big 12 champion Kansas State, saw Mauch at a new position, where he could ultimately reach a much higher level. \"He was the first person who ever told me I might have a shot at the NFL,\" Mauch recalled. \"That was before I really even started playing offensive line. I'm like, 'Man, this guy's crazy. How's he know?'\" North Dakota State doesn't treat its players as finished products. Kramer works with a nutritionist to take measurements and predicts the mass that players can add without compromising their effectiveness. Linebackers become defensive ends, tight ends become tackles and so on. The approach has helped NDSU become the nation's premier FCS program, winning nine national titles since 2011 and playing for another in January. Since 2014, North Dakota State has had 10 players drafted, including two first-round quarterbacks (Trey Lance and Carson Wentz) and four offensive linemen. At first, Kramer didn't fully buy Klieman's vision for Mauch. \"I don't know if I saw that he was going to be a 300-pounder,\" Kramer said. \"But Coach Klieman saw it. Then Cody started working.\" Mauch spent the next months in the weight room and dining halls or other eateries in and around campus. NDSU has an all-you-can-eat program for freshmen and \"Cody took full advantage,\" said Matt Entz, who replaced Klieman as coach in December 2018. Kramer outlined a more aggressive in-season training plan for Mauch, since he wasn't on the depth chart. Mauch also spent much of his free offseason time eating and lifting. \"It made such a difference,\" said Joe Mauch, Cody's father. \"Small-town kid, we don't really have too much of a weight program. At school, the weight room is in a corner on the stage. Not a lot, aside from a squat rack and a bench press.\" When the 2018 season kicked off, NDSU listed Cody at 269 pounds, a 35-pound increase from his 2017 weight. By the fall of 2019, he was up to 290 pounds. Mauch also didn't stop growing vertically, measuring 6-foot-5 at the combine, an inch taller than when he arrived in Fargo. \"He's a kid with big hips, big hands, big features,\" Entz said. \"We knew that at some point, he was going to gain some weight. I don't know if anyone really knew what he was going to be, or that he was going to turn out to be potentially a Day 1, Day 2 type of draft pick.\" Mauch began playing the ogre position, an extra offensive lineman who occasionally wears a tight end's number. In 2019, he suited up as both No. 70 (offensive line) and No. 88 (tight end), catching a 2-point conversion in an FCS playoff semifinal win. By the COVID-delayed spring season of 2021, his positional path became clear. North Dakota State initially moved all-conference tackle Cordell Volson from right tackle to left, while placing Mauch on the right side. After two games, the two switched. Volson earned first-team All-America honors that season and in the fall, before becoming a fourth-round draft pick of the Cincinnati Bengals. Mauch remained the team's starter at left tackle. \"He's such a hardworking kid,\" said Jensen, who started multiple seasons next to Mauch at left guard. \"Just to see his progression from being a tight end/defensive end to an All-American, top NFL prospect [for] offensive line, is absolutely crazy. \"I couldn't be more proud.\" Mauch occasionally gets Facebook or Snapchat memories that show what he looked like when he arrived at North Dakota State. The before-and-after graphic of his measurables appeared on TV during the 2023 FCS playoffs and at pre-draft events like the Senior Bowl. \"It's like, 'Wow, I can't believe that's the way I looked,'\" Mauch said. \"It makes you happy for the way things have gone and how different life is now.\" WHEN STACEY MAUCH saw her son walk in the door, she started to cry. Cody was back home from Fargo, where he had visited the E.R. and a dentist, following the collision with Lenzen in the basketball game. His front teeth couldn't be salvaged, and his lips and face had swelled like a balloon. Stacey didn't want to see Cody in pain. As a schoolteacher in Hankinson, she also worried about the impact of such a noticeable facial injury for a seventh-grader. \"You just want your kids to grow up confident and happy,\" Stacey Mauch said. \"'Get your teeth fixed, you'll be confident and be ready to smile and take on the world.' But this guy doesn't need teeth to do that. He's shown that over and over, the way he flashes the smile and the confidence he has.\" Since Cody's mouth was still growing, the plan called for him to wait for implants. He went through several sets of braces to widen his mouth and used a retainer and a \"flipper\" with false teeth. But the retainers kept breaking. After several years, Mauch stopped wearing anything. \"I'm sure my mom and dad were probably a little upset, just because of how much money they paid in braces and all the different dentist appointments, all the broken retainers,\" he said. \"But everyone who knows me knows that no teeth kind of fits my personality. I'm an easygoing, goofy guy. I don't really care how I look.\" Cody is the second of eight children, spanning ages 25 to 7, and comes from a large family that goes back generations around Hankinson. As a boy, he spent summer days at the family crops farm alongside Joe. Tasks ranged from maintenance on tractors and other equipment to clearing fields. When Cody got his driver's license, he began driving a truck. \"You learn the way to work,\" Joe said. \"Our kids have been working on a farm since they were 8 years old.\" Hankinson's school had about 300 students in one building, kindergarten through 12th grade, and only offered a handful of sports. Mauch competed in everything: football, basketball, baseball and track, earning all-region honors in both basketball and track, while setting school records for touchdown receptions and sacks. His older brother, Carter, was a multisport standout, and his younger siblings also competed. \"Whatever was going on for sports in the world, that's what was going on in our front yard, too,\" Stacey Mauch said. \"If it was football season, they would mow a football field out there. If it was baseball season, they would mow a baseball field.\" Cody knew everyone around town, and he and his friends found ways to entertain themselves. Once they began driving, they started to do \"Main-ers.\" \"Just rip it up and down Main Street,\" said Cody, who started with a 2000 Grand Am before buying one of his dad's F-150 trucks. \"There's no stop lights or anything, so it takes you probably 45 seconds to get from one side of town to the other.\" Cody recently looked at a picture of his kindergarten class and realized almost everyone had graduated high school together. In November, Hankinson honored Cody with a celebration at the school. His NFL draft plans aren't firmly set, but Joe expects a party at the VFW or the American Legion in Hankinson, where family and friends will gather. \"I'm definitely going to pay a lot more attention to the draft this year,\" Lenzen said. \"I'm excited, kind of in disbelief. Cody's put a lot of work in, but it's a dream that a lot of people don't get to have.\" DURING MAUCH'S FRESHMAN year at North Dakota State, Hank Jacobs, the team's director of football operations, looked at the clean-cut walk-on and made a suggestion: Grow out the red hair. Mauch wasn't convinced, but he stopped going to the barber. \"I'm like, 'Eh, I'll just do it, why not?'\" Mauch said. \"I've been growing it out for probably four years now. Saved a lot of money on haircuts.\" The long red hair, a trait Mauch shares with two of his sisters, is part of his signature look. He added a red beard while at NDSU. There's only one drawback. \"There was hair everywhere,\" said Kava, who shared a house with Mauch. \"I was the vacuum guy, so I had to clean it out and I was like, 'Cody, could you please cut your hair, for my sake?' It's annoying to clean up, but it's here to stay. It's definitely part of the thing he has going.\" Mauch incorporated his locks into a first-down signal: the hair point. Other celebrations after NDSU moved the chains included a slide, a somersault and several that were rehearsed but too difficult to perform in games, like the Maucharena (his spin on the '90s dance) and the conga line. Naturally, Mauch named one celebration \"A-gap power,\" where he smiles after first downs. His missing teeth actually became a conversation topic during games with opposing players. \"The D-ends and D-tackles, they're asking him, 'Why don't you have two front teeth?'\" Jensen said. \"As each play went along, the story got longer and longer. He probably changed it from time to time, just to mess with them.\" Mauch didn't make the conversations all about himself. By his third year as a starter, he had built relationships with opposing linemen, and tried to get to know new ones. \"You're kicking these guys' butts and then talking to them about their uncle and farming,\" Kava said. \"I think we were playing [Northern Iowa] and he's talking about egg science with their D-tackle. We'd get home and he would tell me, 'We were talking about the new combine from John Deere.' \"I'm like, 'Cody, you're something else.'\" Not surprisingly, Mauch was in the middle of North Dakota State's fiddle-playing tradition after FCS semifinal wins. Since the national title game is held annually in Frisco, Texas, North Dakota State plays the country song \"If you're gonna play in Texas [You Gotta Have a Fiddle in the Band]\" in the Fargodome when it advances. Bison players will play air fiddle, but after a win over Incarnate Word in December, someone handed Mauch a real one. Middle schoolers in nearby Moorhead, Minnesota, noticed Mauch's fiddle form on TV and invited him to learn how to play correctly. \"Just a classroom of sixth- and seventh-graders making fun of me for not knowing how to hold it, not playing it right,\" Mauch said. \"That was cool to get humbled by those guys.\" For Mauch, the in-game displays made football fun, especially while playing on the line. He clicked instantly with the offensive linemen after switching over. Mauch loved that the group's success hinged on being unified, but individual personalities could still stand out. During pregame meals, the linemen would compile their Mount Rushmores -- top fours -- for a variety of topics: snacks, favorite foods, least favorite foods, favorite places in Fargo, and more. \"The stupid stuff that was right in my wheelhouse,\" Mauch said. Then, the Bison would usually proceed to mash their opponents. They ranked in the top 10 nationally in rushing throughout Mauch's career. Mauch's philosophy impacted everyone around him, even his coaches. \"I didn't think the football field was the place to have fun,\" NDSU offensive line coach Dan Larson said. \"But he has fun with it and it makes football enjoyable to him. We stopped worrying about whether he was doing first-down signals, or if a guy runs by and he gives a high-five, but [the opposing player] won't do it, he gives himself a high-five. \"When I stopped worrying about those parts of it and just the snap and the finish, his level of football even went up. Because it's who he is.\" ON NFL SUNDAYS in recent years, Mauch and his housemates would gather in their living room and watch games on four mounted TVs. Sometimes they'd even bring in a fifth screen. Mauch used the time to unwind, but as he got older, his attention shifted. \"I'm sitting there, watching the left tackle, watching the center,\" he said. \"I was just putting myself in their shoes.\" Mauch's appearance and personality project fun, but he takes football seriously. Entz never questioned Mauch's commitment, noting that he approaches the grind of the game with some balance. Larson learned that as long as he smiled once in a while, he could challenge Mauch just like any other player. Since Mauch is relatively new to playing offensive line, he had to build up his strength and technique. Kava remembered being able to bull-rush Mauch early in their careers before Mauch added \"that tackle weight.\" Larson worked on hand placement with Mauch but saw him thrive at playing with his hips low to keep defenders from getting past him in pass protection. Mauch's footwork and ability to move are his greatest assets. Larson thinks the right blocking scheme will make Mauch a \"vertical monster,\" where he can pull and run downfield. Mauch doesn't have the longest arms, which measured 32 and three-eighths inches at the NFL combine, and might not project as a tackle for every team, but he can play all over the line, as he displayed during Senior Bowl week. \"He's the only guy in this draft class who has proven he can play all five spots,\" Senior Bowl executive director and former ESPN draft analyst Jim Nagy said. \"Those guys are really hard to find. In the [Senior Bowl] game, he played left guard, center and right tackle, so he's proven he can play on both sides, which is big, too.\" While scouting Mauch's film, Nagy never flagged arm length as a potential drawback. Mauch held up well against better competition during Senior Bowl week, and players on the National team voted him as their top offensive lineman. Nagy said most teams he talked to before the event pegged Mauch as a second-round pick, but Mauch's performance gave him \"a legit chance\" to go at the end of the first round. \"I would start him at left tackle, because that's the premium position and prove to me that he can't play there,\" Nagy said. \"If he can't play there, then we'll slide him into guard or center and there'll be a Pro Bowl-level player inside.\" An AFC scout said Mauch likely projects as a Day 2 pick but added that all teams are starving for tackles. \"His passion and the emphasis he puts on playing the game jumped out,\" the scout said of Mauch. \"I wanted to keep watching this guy.\" Everyone will soon be watching Mauch in the NFL. Mauch appreciates his unlikely path to pro ball: small town, nine-man ball, three years as a walk-on at NDSU. He considers receiving a scholarship to be among the best moments of his life. Another moment will come soon when his name is called in Kansas City at the draft. Mauch looks forward to entering a pro facility with his signature smile and becoming \"a locker-room guy,\" just like he was at NDSU. \"It gets more serious the older you get, the higher level you get to, but it's still football at the heart, so you just go have fun,\" he said. \"If you're enjoying yourself, other people see that.\"","pubDate":"2023-04-10 16:23:05","image_url":null,"source_id":"espn","category":["sports"],"country":["australia","canada","united kingdom","india","singapore","united states of america"],"language":"english"},{"title":"«Τίναξε» την μπάνκα με επτάδα ισοπαλιών!","link":"https://www.gazzetta.gr/football/2212718/tinaxe-tin-mpanka-me-eptada-isopalion","keywords":["Ποδόσφαιρο","Newsroom","Προγνωστικά"],"creator":null,"video_url":null,"description":"Ω ρε μάνα, μια δελτιάρα! Οκτάδα χιναριών σε ζητούμενα, με 247 στήλες! Τα έψαχνε όλα ο τυπάς. Από τις δυάδες μέχρι και την οκτάδα!","content":"Η ΣΥΝΕΧΕΙΑ ΕΔΩ","pubDate":"2023-04-10 15:18:47","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"«Ο ιδιοκτήτης της Καλλιθέας συνελήφθη με κατηγορίες για ενδοοικογενειακή βία»","link":"https://www.gazzetta.gr/football/superleague-2/2212803/o-idioktitis-tis-kallitheas-synelifthi-me-katigories-gia","keywords":["Ποδόσφαιρο","Superleague 2","Athens Kallithea","Newsroom"],"creator":null,"video_url":null,"description":"Η «Aspen Daily News» και το «Athletic» μετέδωσαν πως ο Αντριου Μπάρογουεϊ βρίσκεται αντιμέτωπος με κατηγορίες που αφορούν ενδοοικογενειακή βία.","content":"Αντιμέτωπος με κατηγορίες που αφορούν ενδοοικογενειακή βία βρίσκεται, σύμφωνα με ξένα ΜΜΕ, ο Αντριου Μπάρογουεϊ, ιδιοκτήτης της Athens Kallithea όπως και άλλων αθλητικών σωματείων στην Ευρώπη και τις ΗΠΑ . Σύμφωνα με τα όσα αποκάλυψε η «Aspen Daily News» και αναπαρήγαγαν αρκετά άλλα media όπως το «Athletic», ο επιχειρηματίας που εδρεύει πέρα από τον Ατλαντικό συνελήφθη την περασμένη Πέμπτη (6/4) για χρήση βίας κατά τη συζύγου του και ναι μεν αφέθηκε ελεύθερος με εγγύηση, όμως στο άμεσο μέλλον θα εκδικαστεί η υπόθεσή του ενώπιον των αρμόδιων δικαστικών αρχών. Οπως δημοσιεύτηκε εκείνο το βράδυ βρίσκονταν με τη σύζυγό του στο ξενοδοχείο «Limelight Hotel» στο Ασπεν και η αστυνομία της περιοχής δέχθηκε κλήση ότι ακούγονταν «φωνές» από το δωμάτιό τους. Ετσι τα όργανα της τάξης μετέβησαν εκεί, όπου τους άνοιξαν την πόρτα εκείνος και η γυναίκα του. Σύμφωνα με τα σχετικά ρεπορτάζ στην ένορκη κατάθεση που πάρθηκε η σύζυγός του «εμφανίστηκε να κλαίει, είχε μελανιές στον αστράγαλο και τα γόνατα και αίμα στα χέρια της». Οι αστυνομικοί ανέκριναν τόσο τον Μπάρογουεϊ όσο και τη γυναίκα του αλλά και την νταντά, ενώ όπως υποστηρίζεται η δεύτερη είπε στις αρχές ότι ο άνδρας της «προσπάθησε να την πνίξει με το ένα χέρι και την έριξε στο πάτωμα στο μπάνιο και μία δεύτερη φορά στην κουζίνα, ύστερα από έναν τσακωμό τους». Η πλευρά του πρώτου ανέφερε πως εκείνος και η γυναίκα του περνούν ένα «δύσκολο» διαζύγιο με αντεγκλήσεις που αφορούν οικογενειακές αλλά και οι οικονομικές διαφορές. Η νταντά από την πλευρά της, πάντα σύμφωνα με τα σχετικά δημοσιεύματα, κατέθεσε πως άκουσε «πριν το δείπνο να σπάνε γυαλιά», ότι «υπήρχαν τσακωμοί» και παράλληλα μετέφερε στους αστυνομικούς πως η γυναίκα του Μπάρογουεϊ της είπε ότι «ο Αντριου με χτύπησε». Σύμφωνα με την έκθεση της αστυνομίας ο πρόεδρος της Athens Kallithea συνελήφθη για πράξεις ενδοοικογενειακής βίας κατά της συζύγου του, η οποία τον κατήγγειλλε πως την «εξανάγκασε σε αναγκαστική σεξουαλική επαφή», ενώ γίνεται αναφορά για σφίξιμο από το λαιμό της (στραγγαλισμό). Το ζευγάρι, σύμφωνα με την εν λόγω έκθεση οδηγήθηκε πρόσφατα στο χωρισμό, καθώς υπήρξε ακραία κτητικότητα με αποτέλεσμα να κορυφωθούν τα κρούσματα ενδοοικογενειακής βίας. Αυτά αναφέρονται στην ένορκη κατάθεση της συζύγου. Το «Athletic» ανέφερε πως επικοινώνησε με την πλευρά του Μπάρογουεϊ , αλλά εκείνη δεν ήθελε να σχολιάσει κάτι.","pubDate":"2023-04-10 15:00:21","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Confira os convocados para a Seleção Brasileira de Flag Football para torneio intercontinental nos EUA","link":"https://www.terra.com.br/esportes/confira-os-convocados-para-a-selecao-brasileira-de-flag-football-para-torneio-intercontinental-nos-eua,978c3151cc5a6936830334ed6ace3ad53yoj51g4.html","keywords":null,"creator":["LANCE!"],"video_url":null,"description":"O head coach da Seleção Brasileira de Flag Football, Heitor Medeiros, anunciou a convocação de ...","content":"O head coach da Seleção Brasileira de Flag Football, Heitor Medeiros, anunciou a convocação de 12 jogadores para a IFAF Americas Continental Flag Football Championship, que acontece em julho, em Charlotte, nos Estados Unidos e é classificatório para o mundial da categoria. A seleção feminina já havia sido convocada na semana anterior. A lista conta com jogadores importantes do FABR , como os wide receivers Victor Hugo 'Mega', do Six Spartans, Athos Daniel, do Coritiba Crocodiles, e João Mendes, do Rio Preto Weilers. Além dos 12 convocados, foram chamados cinco atletas para a lista de suplentes. Rio Preto Weilers, Coritiba Crocodiles e Floripa Ghosts são os times com mais convocados na lista, com dois atletas chamados cada. Os tres times também possuem um atleta na lista de suplentes. Em dezembro do ano passado, a Seleção Brasileira de Flag Football conquistou o 1º Sul-Americano da modalidade organizado pela Confederação Brasileira de Futebol Americano (CBFA) em Itapecerica da Serra-SP. O que é o flag football O flag footbal é uma modalidade derivada do futebol americano, mas que não possui contato físico entre os atletas. Nas partidas, os atletas levam as fitas amarradas nas cinturas, e o objetivo principal é retirar as bandeiras (flag no Inglês) do adversário. Essa ação simula o tackle da NFL e significa o fim de uma jogada. Contudo, é importante ressaltar que o impacto físico e a força utilizada pelos jogadores de futebol americano para bloquear os ataques não existem no flag. A expectativa é que o flag football faça parte do programa dos Jogos Olímpicos de 2028 que serão realizados em Los Angeles, nos Estados Unidos. A NFL ratificou apoio à Federação Internacional de Futebol Americano (IFAF) para alcançar esse objetivo. Confira os convocados: Quarterback Vitor Paiva - Rio Football Academy SN Renato Munford - Floripa Ghosts Wide receivers Athos Daniel - Coritiba Crocodiles Victor Hugo 'Mega' - Six Spartans Pedro Clemente - Vasco Almirantes João Mendes - Rio Preto Weilers Matheus Silva - Coritiba Crocodiles DB Edmar dos Santos - NO Mercy-USA Felipe Nunes Índio - Cavalaria 2 de Julho Thalys Almeida - Rio Preto Weilers Caique Andrade - Gators Flag Matheus Oliveira 'Viza' - Floripa Ghosts Suplentes Lucas Caravita- Rio Preto Weilers Adan Rodrigues - Coritiba Crocodiles Charles Wagner - Rebeldes do Cerrado Nicolas Quadros - Floripa Ghosts Paulo Souza - São Paulo Buzz + Os melhores conteúdos no seu e-mail gratuitamente. Escolha a sua Newsletter favorita do Terra. Clique aqui!","pubDate":"2023-04-10 14:44:13","image_url":null,"source_id":"terra","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"France : Boudaoui a dépassé la barre des 100 matchs avec Nice","link":"https://www.dzfoot.com/verts-deurope/france-boudaoui-a-depasse-la-barre-des-100-matchs-avec-nice-240734.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Verts du Monde"],"creator":null,"video_url":null,"description":"Le milieu de terrain algérien de l’OGC Nice, Hicham Boudaoui, a atteint la barre symbolique des 100 matchs disputés sous les couleurs de la formation française. Depuis son arrivée chez les Aiglons, le natif de Béchar e eu une belle progression qui a attiré les regards de nombreux clubs européens. Homme fort de l’effectif, il […] The post France : Boudaoui a dépassé la barre des 100 matchs avec Nice appeared first on Football Algérien - DZFOOT.COM.","content":"Le milieu de terrain algérien de l’OGC Nice, Hicham Boudaoui, a atteint la barre symbolique des 100 matchs disputés sous les couleurs de la formation française. Depuis son arrivée chez les Aiglons, le natif de Béchar e eu une belle progression qui a attiré les regards de nombreux clubs européens. Homme fort de l’effectif, il a été prolongé en janvier dernier jusqu’en juin 2027. Comme c’est de coutume avec les joueurs ayant atteint les 100 matchs avec l’équipe, Hicham Boudaoui sera honoré lors de la prochaine rencontre à domicile des Niçois, le jeudi 20 avril 2023, pour la réception du club suisse de Bâle en quarts de finale de la Ligue Europa Conférence. DZfoot","pubDate":"2023-04-10 14:42:58","image_url":null,"source_id":"dzfoot","category":["sports"],"country":["algeria"],"language":"french"},{"title":"Snl24.com | Zamalek President: My Prison Sentence Is To Blame For Poor Form","link":"https://www.snl24.com/soccerladuma/International/African-Football/mortada-mansour-my-prison-sentence-is-to-blame-for-zamaleks-poor-results-20230410","keywords":null,"creator":null,"video_url":null,"description":"Zamalek president Mortada Mansour has blamed his prison sentence for the team's poor form this season.","content":"Zamalek president Mortada Mansour has blamed his prison sentence for the team's poor form this season. Mansour had been away from the team for a month after spending time in jail for verbally insulting Al Ahly president Mahmoud El-Khatib. Soliman Wahdan replaced Mansour as the president on interim basis, before the 70-year-old returned earlier this month. However, Mansour feels his absence had a direct effort on the first team, who sit fourth on the Egyptian Premier League table and were eliminated from the CAF Champions League group stages. “What is happening with Zamalek is not fair because usually when a father of a family is imprisoned, the children are affected and that of course, leads to negative results,” Mansour said via the club’s TV channel. “Jesualdo Ferreira was responsible for not playing the new signings and that is why people were very quick to write them off. “The players were affected by my imprisonment, and this resulted in us dropping six points in the CAF Champions League group stages.\" You must be to read and post comments.","pubDate":"2023-04-10 14:34:44","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Chippa announce new interim coach, Lentjies demoted","link":"https://www.snl24.com/KickOff/SANews/Premiership/Chippa-United/chippa-united-demote-kurt-lentjies-after-defeat-to-orlando-pirates-20230410","keywords":null,"creator":null,"video_url":null,"description":"Chippa United have demoted coach Kurt Lentjies to the DStv Diski Challenge side after the weekend's defeat to Orlando Pirates.","content":"Lentjies took over from Morgan Mamilla last month, but the club extended their winless run to six matches in the league with the defeat to the Buccaneers. The Gqeberha-based outfit confirmed on Monday that Siyabulela Gwambi will take charge of the first team for the remainder of the campaign. “Chippa United Football Club would like to announce that Kurt Lentjies has been redeployed to head up our DSTV Diski Challenge Team,” the club's statement read. “Siyabulela Gwambi has been appointed interim coach for remainder of the season. “Gwambi has been a loyal servant of the club having acquired his CAF License A coaching credentials Club Chairman, Mr. Siviwe Mpengesi has called upon all Chilli Boys faithfuls to rally behind the Gqeberha born native and his charges as they look for positive results.”","pubDate":"2023-04-10 14:13:00","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"(VIDEO) Sedamnaest godina kasnije: Marco Materazzi otkrio šta je rekao Zidaneu","link":"https://sport1.oslobodjenje.ba/s1/fudbal/ino-fudbal/video-sedamnaest-godina-kasnije-marco-materazzi-otkrio-sta-je-rekao-zidaneu-851350","keywords":["Ino fudbal"],"creator":null,"video_url":null,"description":"Sedamnaest godina nakon antologijskog trenutka u finalu Svjetskog prvenstva 2006. godine Marco Materazzi je konačno otkrio šta je rekao Zinedineu Zida...","content":"Sedamnaest godina nakon antologijskog trenutka u finalu Svjetskog prvenstva 2006. godine Marco Materazzi je konačno otkrio šta je rekao Zinedineu Zidaneu prije nego ga je Francuz glavom udario i poslao na zemlju. Iako se isprva govorilo da mu je psovao majku, i sam Zidane je ranije izjavio kako mu je uvrijedio sestru, ali nikada nije bilo tačno rečeno šta je Materazzi uradio, pa je uslijedial takva reakcija francuskog asa. - Zidane mi je ponudio dres. Rekao sam mu da bih radije uzeo njegovu sestru, rekao je Marco Materazzi u podcastu \"Italian football TV\". Sve se to dogodilo u produžecima finalne utakmice, a Francuska je ostala sa desetoricom igrača do kraja produžetaka, da bi Italija nakon penala savladala Francuze. “Zidane offered me his jersey, I said no I prefer his sister” - Marco Materazzi on what was really said before he got headbutted","pubDate":"2023-04-10 14:00:54","image_url":"https://cdn.oslobodjenje.ba/images/slike/new/2023/04/10/6249413.png","source_id":"oslobodjenje","category":["sports"],"country":["Bosnia And Herzegovina"],"language":"bosnian"},{"title":"Manchester City can brush aside Bayern Munich in exciting Champions League duel","link":"https://metro.co.uk/2023/04/10/manchester-city-can-brush-aside-bayern-munich-in-champions-league-18583286/","keywords":["Football","Sport","Bayern Munich FC","Champions League","Erling Haaland","Jack Grealish","Manchester City FC","Metro newspaper","Pep Guardiola","The Tipster","Thomas Tuchel"],"creator":["The Tipster"],"video_url":null,"description":"This might be Manchester City's best chance of Champions League glory.","content":"THERE will be further opportunities to win the Champions League , of course there will, but it’s difficult not to feel this may be Manchester City ’s best shot as they are at the peak of their powers. The stylish, sumptuous second-half display at Southampton was as ruthless as football can get while wrapped up as pure entertainment. City weren’t at their best in the first half but led through Erling Haaland ’s 45th-minute strike . They stepped up a gear when asked and it looked for all the world as though they could have easily won by more than the final 4-1 scoreline if required. Now the defending Premier League champions entertain Bayern Munich in a Champions League quarter-final first leg which looked a daunting prospect when it was drawn. But Pep Guardiola has led his troops to eight straight wins and ten victories plus a couple of draws in all competitions since their last defeat, a 1-0 reversal at Tottenham at the beginning of February. One of the two draws was at RB Leipzig in the previous round and they proceeded to thump them 7-0 in the return leg at the Etihad Stadium. Ian Wright tells Frank Lampard to recall Chelsea flop and reveals major 'worry' Ex-Chelsea star says current side are 'nothing like' the team he played for Paul Scholes names the player who can help Frank Lampard get permanent Chelsea job The winning sequence also includes the 4-1 demolition of Liverpool and the last time City were beaten in front of their home fans was a 2-1 defeat to Brentford in November when their players probably had one eye on the imminent World Cup. Bayern, who have lost two of their last four matches, are now managed by former Chelsea boss Thomas Tuchel so their perfect record in this season’s competition under Julian Nagelsmann’s command doesn’t necessarily hold water. Tuchel is a more cautious coach and may be happy to stay in contention for the second leg in Bavaria. That could be a fatal strategy and City are not only worth backing to win at 4/5 with Betfred, they should be supported to do so by more than one goal at 21/10 with Paddy Power, Betfair and Sky Bet. Haaland is 13/5 with the first two firms to bag the opening goal while Jack Grealish, currently in fabulous form, is 13/2 with BetUK and Unibet to get on the scoresheet. • 23/20 Benfica, who have won eight of their last night games, to beat Inter Milan, winners just once in their last eight matches, in tonight’s other quarter-final (William Hill) • 13/10 Putney puncher Joe Joyce to strengthen his elite heavyweight boxing credentials by stopping New Jersey-based Chinese opponent Zhilei ‘Big Bang’ Zhang between rounds seven and 12 at the Copper Box in London on Saturday (Betfair) MORE : How many goals has Erling Haaland scored this season for Manchester City? MORE : Erling Haaland on the same level as Lionel Messi and Cristiano Ronaldo, claims Pep Guardiola","pubDate":"2023-04-10 13:36:17","image_url":null,"source_id":"metro","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PGMOL Suspends Referee Pending Investigation Into Robertson Incident","link":"https://thewillnews.com/pgmol-suspends-referee-pending-investigation-into-robertson-incident/?utm_source=rss&utm_medium=rss&utm_campaign=pgmol-suspends-referee-pending-investigation-into-robertson-incident","keywords":["Sports","Andy Robertson","Constantine Hatzidakis","PGMOL"],"creator":["Jude Obafemi, THEWILL"],"video_url":null,"description":"April 10, (THEWILL) – An assistant referee, who allegedly elbowed Liverpool player, Andy Robertson, during halftime in their match against Arsenal, will not be appointed for future matches until an investigation is completed, according to a statement by the referee’s body on Monday. Video replays showed Robertson confronting the official, Constantine Hatzidakis, at halftime during […] The post PGMOL Suspends Referee Pending Investigation Into Robertson Incident appeared first on THEWILL NEWS MEDIA.","content":"April 10, (THEWILL) – An assistant referee, who allegedly elbowed Liverpool player, Andy Robertson, during halftime in their match against Arsenal, will not be appointed for future matches until an investigation is completed, according to a statement by the referee’s body on Monday. Video replays showed Robertson confronting the official, Constantine Hatzidakis, at halftime during Sunday’s game, with Hatzidakis appearing to brush off the Liverpool player and catch him with his elbow. The FA is currently investigating the incident as THEWILL reported. In a statement, the Professional Game Match Officials Limited (PGMOL) said, “PGMOL will not be appointing Constantine Hatzidakis to fixtures in any of the competition it serves while the FA investigates the incident involving the assistant referee and Liverpool defender Andrew Robertson at Anfield.” Liverpool manager, Jurgen Klopp, commented after the 2-2 draw, stating that he did not witness the incident but had heard that “something happened.” The incident has since sparked controversy and discussion among football fans and experts alike, with many expressing their concerns about the integrity and safety of the sport. The investigation by the FA is ongoing, and further updates are expected in due course.","pubDate":"2023-04-10 13:19:07","image_url":null,"source_id":"thewillnigeria","category":["sports"],"country":["nigeria"],"language":"english"}]}