{"newsArray":[{"title":"NPFL: Rangers Set For Abia Warriors Battle","link":"https://independent.ng/npfl-rangers-set-for-abia-warriors-battle/","keywords":["Sports"],"creator":["Ayo Bada"],"video_url":null,"description":"LAGOS  – Rangers International FC management has assured its supporters that the club is physi­cally, psychologically, and men­tally set for the 2022/2023 Nigeria Premier Football League (NPFL) with an ‘Oriental Derby’ clash against Abia Warriors in Awka. Administrative Secretary of the club, Barrister Ferdinand Ugwuarua, made this disclo­sure, Wednesday, at the club’s headquarters during a […]","content":null,"pubDate":"2023-01-12 06:15:00","image_url":null,"source_id":"independentng","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"A difficult day for Maigh Cuilinn men as All-Ireland hopes ended","link":"https://connachttribune.ie/a-difficult-day-for-maigh-cuilinn-men-as-all-ireland-hopes-ended/","keywords":["Connacht Tribune","Sports","connacht tribune","All-Ireland senior football semi-final","glen v maigh cuilinn"],"creator":["John McIntyre"],"video_url":null,"description":"Glen (Derry) 1-11 Maigh Cuilinn 0-12 By John McIntyre at Croke Park MAIGH Cuilinn footballers will hardly need the help of a psychologist to pick through the bones of this narrow, noble defeat in Sunday’s All-Ireland Club Senior Football semi-final at Croke Park. For there is no great mystery surrounding the eclipse of the […]","content":"Glen (Derry) 1-11 Maigh Cuilinn 0-12 By John McIntyre at Croke Park MAIGH Cuilinn footballers will hardly need the help of a psychologist to pick through the bones of this narrow, noble defeat in Sunday’s All-Ireland Club Senior Football semi-final at Croke Park. For there is no great mystery surrounding the eclipse of the Galway champions – they simply didn’t play well enough to overcome the challenge of their well-organised Glen opponents who were never behind. Maigh Cuillin may have been outsiders to keep a superb season going, but it’s only reasonable to assume that if they had brought their best form to GAA headquarters and settled quicker, they would now be preparing for an All-Ireland final. Sure, the Derry men were good and got most things right on the day, but they are hardly world-beaters and were hanging on desperately at the finish as Maigh Cuilinn piled forward, having finally thrown caution to the wind. Considering that it took them 18 minutes to register a score, were always chasing the game, and a number of key influences didn’t have the desired impact, Maigh Cuilinn’s sense of regret over a somewhat below-par display will be sharpened by being only two points adrift at the finish. Too often, Maigh Cuilinn players carried the ball into traffic – there was a reluctance to shoot from out the field, though Peter Cooke was a notable exception – and they suffered numerous turnovers and block-downs inside the Glen 25-yard line. Typical of Ulster teams, Glen retreated in numbers and it’s a tactic that they are more used to than Maigh Cuillin. At times, there were 29 players in one half of the field and that scenario made it difficult to get the best out of Don Connellan’s team. Perhaps, the sideline could have shaken things up more quickly. Their first sub didn’t enter the field until the 53rd minute, even though it was a bold move to place Galway captain Seán Kelly in the full-forward line for the second-half. Typical of the man, Kelly never gave up and forced a couple of turnovers which led to Dessie Conneely converting frees, but it was at the expense of his trademark runs from deep. To be honest, Kelly looked a fatigued individual by the finish – an understandable legacy of a frightening schedule between club and county over the past 12 months. For more, read this week’s Connacht Tribune. Connacht Tribune Digital Edition App Download the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play. Or purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE . Get the Connacht Tribune Live app The Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.","pubDate":"2023-01-12 06:00:58","image_url":null,"source_id":"connachttribune","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Concession of early goals puts gallant Galway champs on the back foot","link":"https://connachttribune.ie/concession-of-early-goals-puts-gallant-galway-champs-on-the-back-foot/","keywords":["Connacht Tribune","Sports","connacht tribune","galbally pearses v dunmore machales","all ireland club intermediate football semi final"],"creator":["John McIntyre"],"video_url":null,"description":"Galbally Pearses 4-4 Dunmore MacHales 1-9 John McIntyre in Mullingar MIDWAY through this absorbing All-Ireland Club Intermediate Football semi-final at St Loman’s Park, Mullingar on Saturday, Dunmore MacHales were staring down the barrel of an ugly defeat. Two points down having played with the strong wind and with their defence being repeatedly carved open by […]","content":"Galbally Pearses 4-4 Dunmore MacHales 1-9 John McIntyre in Mullingar MIDWAY through this absorbing All-Ireland Club Intermediate Football semi-final at St Loman’s Park, Mullingar on Saturday, Dunmore MacHales were staring down the barrel of an ugly defeat. Two points down having played with the strong wind and with their defence being repeatedly carved open by the strong-running and athletic Ulster champions, there appeared little hope of a successful salvage operation for Gary Delaney’s charges on the resumption. But Dunmore MacHales have developed an inner-steel during their triumphant Galway and provincial campaigns, and this never-say-die spirit saw them storm back into contention to leave them on the brink of a famous victory with three minutes of normal time remaining. Full forward Pádraig Costello’s fifth pointed free of the semi-final saw the MacHales edge 1-9 to 3-2 in front and with their fans in the big crowd roaring on their approval of a courageous display, the Galway champions had somehow turned the game back in their favour. But all day, Galbally ruled the skies and from the resulting kick-out, influential midfielder Cormac Donnelly leaped highest to secure possession and from his delivery into the Dunmore danger area, Daniel Kerr planted the ball past Conor Gleeson for his team’s fourth goal. In the space of 60 seconds, Dunmore’s ecstasy had turned into agony, typical of the rollercoaster ride this semi-final had become. It was a tough outcome on the one-time traditional power of Galway football, but their defensive lines were too easily breached in the opening half. Galbally had come into the match with a reputation as something of a goal-scoring machine and they had the ball in the Dunmore net inside three minutes when Ronan Nugent raised the first of his three green flags. Donnelly’s centre should never have reached him, but the soccer-style finish from the lively half-forward was top quality. For more, read this week’s Connacht Tribune. Connacht Tribune Digital Edition App Download the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play. Or purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE . Get the Connacht Tribune Live app The Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.","pubDate":"2023-01-12 06:00:52","image_url":null,"source_id":"connachttribune","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Battling Galway junior football champions run out of steam in extra time","link":"https://connachttribune.ie/battling-galway-junior-football-champions-run-out-of-steam-in-extra-time/","keywords":["Connacht Tribune","Sports","connacht tribune","stewartstown harps v clifden","all ireland junior club football championship"],"creator":["Our Reporter"],"video_url":null,"description":"STEWARTSTOWN HARPS 1-14 CLIFDEN 1-9 (after extra time) By Kevin Egan at Dr. Hyde Park IT will be of little consolation to them this week, and perhaps little consolation for a long time to come, but Clifden played their part in a truly wonderful, memorable sporting occasion last Saturday, and while there is no such […]","content":"STEWARTSTOWN HARPS 1-14 CLIFDEN 1-9 (after extra time) By Kevin Egan at Dr. Hyde Park IT will be of little consolation to them this week, and perhaps little consolation for a long time to come, but Clifden played their part in a truly wonderful, memorable sporting occasion last Saturday, and while there is no such thing as a good way to exit the All-Ireland Junior Club football championship, this was the closest thing imaginable. The Venn diagram of people who attended both this fixture, and Galway’s FBD league opener against Leitrim the previous night, would have a very small intersection, if in fact there is anyone else outside of this reporter who was there for both fixtures. It’s impossible to imagine two games with a starker contrast. The action in the Dome was sterile, emotionless, and while there was certainly quality on show, intercounty footballers will invariably look good in the absence of real pressure on the execution of their skills. At the Hyde the following day, Stewartstown and Clifden emptied themselves, physically and emotionally, in pursuit of the ultimate dream for any club footballer – a chance to pull on their parish jersey and walk out onto Croke Park for an All-Ireland final. There were moments of brilliance, and there were mistakes, but the defensive play was full of energy and physicality, and so scores had to be mined from the earth, rather than picked up off the ground. And for the rare handful of neutrals who were there, there was all the drama in the world. For 55 minutes, maybe more, that drama seemed to lead towards a win for Clifden – but ultimately, Stewartstown found a way to extend the game for an extra 20, and once they did, the younger, less physically mature Naomh Feichín players were always likely to be on the back foot. A window of opportunity was opened when, at the start of the second half of extra time, Stewartstown defender James Campbell was black-carded, leaving the Tyrone side down to 14 players. They led by two points at that stage and were about to have the wind at their backs, but with so much energy having been expended up to then, an extra man was always likely to play a huge part. Sure enough, their chance came. Darragh Kennedy, who had been full of life and a constant threat once he came onto the field, drove at a tiring Stewartstown defence, and he was dragged down by Gerard O’Neill, just inside the large square. For more, read this week’s Connacht Tribune. Connacht Tribune Digital Edition App Download the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play. Or purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE . Get the Connacht Tribune Live app The Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.","pubDate":"2023-01-12 06:00:41","image_url":null,"source_id":"connachttribune","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Lee Keegan admirer Caelan Doris shares Mayo football great's drive for success","link":"https://www.irishmirror.ie/sport/rugby-union/lee-keegan-admirer-caelan-doris-28932797","keywords":["Sport"],"creator":["news@irishmirror.ie (Michael Scully)"],"video_url":null,"description":"Keegan, who is newly retired from the inter-county GAA scene, never got to reach the pinnacle in terms of All-Ireland glory. Doris still has time on his side to win a Champions Cup with Leinster and to win more than a Triple Crown with Ireland.","content":"They have never met and they play different sports but there is a burning desire in Caelan Doris to win rugby's top prizes that was there throughout Lee Keegan's inter-county GAA career. Doris has Euro progress on his mind but is one of many Mayo men and women in mourning over Keegan's retirement from the county game this week. Keegan was a driving force in Mayo's ceaseless push for All-Ireland football glory that, for the Westport man, resulted in a string of near-misses. READ MORE: Denis Leamy on his 'Hail Mary' against the Saints when they last played Munster at Thomond Park “Yeah, it’s a shame,\" said Ireland back row Doris. \"He has been a great servant to Mayo for so many years, a very resilient fella.\" For a time Keegan was involved in the almost annual pilgrimage to Croke Park as Mayo failed at the last hurdle on six occasions between 2012 and 2021. “I would have gone up from probably second and third year. We used to get the bus up from Mayo quite a bit. \"I’ve only been to one or two lately, though. I was at the final last year (2021) against Tyrone.” That will go down as Keegan's last final and, as usual, he gave it everything, leading Mayo's ultimately fruitless comeback in the second half. Doris is still only 24 - he's almost 10 years younger than Keegan - and so, fitness permitting, has plenty of time left. He has won four URC titles with Leinster but, having been fast-tracked into the province's senior squad in time for the 2018-19 season, that promotion came just too late for their fourth and latest Champions Cup success against Racing in Bilbao. He played in last season's final loss to La Rochelle and in the quarter-final defeat to Saracens in 2020, but missed the 2019 final loss to Sarries and the 2021 semi-final defeat to La Rochelle. Thus Doris remains part of a new Blues generation hungry to add their name to the list of European champions with Leinster. On Monday morning, in the forwards meeting, clips from last year's final were highlighted again. \"Every now and then they come up,\" Doris said. \"It still hurts seeing them, these ones were mainly set-piece but there's been different ones in the past. \"If there's a valid point in the clip that keeps coming up rather than just the game as a whole. This game has come up a few times.” “There is quite a vivid memory of the dressing room after and how bleak and silent it was, and not wanting to experience that again.” If Leinster keep winning, after this weekend they will play all their remaining European games this season at the Aviva Stadium - including the final. \"That’s definitely another motivator,\" said Doris. \"One for me in particular, in that the trophies I’ve experienced and the Pro14 wins were during Covid. \"So the image of having my family and friends there at a final is definitely a motivating factor, sharing that with them. \"But there's a lot of work to be done before then. “It’s definitely an exciting prospect and that’s why it’s easy to get motivated for these games because we know if we perform well in these, it sets us up well to have as many home games as possible. \"Which ultimately helps us to get to the final, hopefully.” It's a similar enough story with Ireland. Last year's Triple Crown success has whetted the appetite for the bigger rewards - a Six Nations title, a Grand Slam, the Rugby World Cup to come later in the year. With his Leinster hat on again, Doris says it has been easy to get players' heads around needing to focus against Gloucester at Kingsholm on Saturday as the Champions Cup resumes. \"Our north star is getting a trophy, which we didn't do last year in either competition - so there's still quite a bit of hurt from that and that's a big driver for us,\" he said. “They're going to be a different team, it's away from home, it's a completely different challenge. \"It's a blank slate, in a way.\" READ NEXT:","pubDate":"2023-01-12 06:00:00","image_url":"https://i2-prod.irishmirror.ie/incoming/article28933181.ece/ALTERNATES/s98/0_Untitled-design-22.png","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"10 best value youngsters available in transfer market including Arsenal star and Chelsea target","link":"https://www.irishmirror.ie/sport/soccer/best-value-youngsters-january-transfers-28928038","keywords":["Sport"],"creator":["news@irishmirror.ie (Tom Victor)"],"video_url":null,"description":"Top talents from across Europe's biggest leagues could still find themselves on the move in January, with the CIES Football Observatory outlining the best potential value-for-money deals","content":"As we approach the halfway point in the January transfer window, a number of Premier League clubs still have plenty of business to do. Some big-hitters acted early, with Liverpool swooping for Cody Gakpo , but others may leave things a little longer. Chelsea's move for Joao Felix might not be their last bit of business, while Manchester United and Arsenal could also find themselves dipping back into the market before the end of the month. It is always a challenge for clubs to find value for money in January, which is why some prefer to do the bulk of their business in the close-season. However, there are a few players who have been identified as potentially smart bets in what could yet become a busy month for clubs around Europe. New data from the CIES Football Observatory has attempted to identify the best value-for-money recruits by age group. To find its top 10s, it has stuck to those players whose contracts expire in the summer, and looked at the potential upside they could provide to a buying club. The top-10 list relies on what is known as an \"impact score\" for the players in question. This is a combination of the sporting level of matches played during the last year, minutes played in official games, as well as playing performances. CIES has separated the players by age-group, with the likes of Adrien Rabiot, Youri Tielemans and Marco Asensio among the bigger names to feature. Here, though, Mirror Football has looked at those in the 24-and-under age category. Which of these players would you like at your club? Have your say in the comments section 10. Jaidon Anthony (Bournemouth) Anthony, who turned 23 in December, could leave Bournemouth on the cheap as he enters the closing months of his contract. The winger was a regular in last season's promotion campaign, and has scored Premier League goals this season against Nottingham Forest and Everton . 9. Timur Suleymanov (Nizhny Novgorod) Russian forward Suleymanov has been capped by his country at under-21 level, and helped Nizhny Novgorod win promotion to the top-flight in 2021. The 22-year-old from Dagestan has seven Russian Premier League goals this term plus a further two in the cup. 8. Muhannad Al-Shanqeeti (Al-Ittihad) A 23-year-old right-back, Al-Shanqeeti already has 66 appearances under his belt in the Saudi top flight. The defender made his senior Saudi Arabia debut at the 2021 Arab Cup but missed out on a spot in his country's World Cup squad in 2022. 7. Federico Gattoni (San Lorenzo) Centre-back Gattoni was a regular for San Lorenzo in the 2022 season as they finished in the upper reaches of the Argentine Primera Division table, captaining the side on multiple occasions. He also played three times for the club in qualifiers for the 2021 Copa Libertadores as they lost to Santos in a play-off. 6. Ben Brereton Diaz (Blackburn) Blackburn and Chile forward Brereton Diaz doesn't turn 24 until April, but already has more than 150 senior appearances under his belt. The former Nottingham Forest man scored a career-high 22 goals in the 2021-22 season and has 10 to his name this term. 5. Reiss Nelson (Arsenal) Arsenal academy product Nelson is rebuilding his reputation in north London after a couple of loan spells away from the club. It may come too late to extend his career with the Gunners, though, with his contract expiring in the summer. Nelson returned to the Emirates Stadium after reaching last season's Europa Conference League final with Feyenoord, but struggled for minutes at the start of the season. In October, though, he scored his first Premier League goals in more than two years after coming off the bench to star against Nottingham Forest. 4. Facundo Colidio (Inter Milan) Colidio joined Inter as a highly-rated teenager back in 2017, but is still waiting for his senior debut for the club. The Argentina under-20 international spent the 2022 season on loan at Tigre in his homeland, notching five goals and six assists. 3. Youssoufa Moukoko (Borussia Dortmund) Borussia Dortmund forward Moukoko could yet extend his deal with the German club. However, with interest from the likes of Chelsea and Barcelona , it's clear there are plenty who would be keen to see him playing elsewhere next term. The forward made his Dortmund debut one day after turning 16, and brought up 50 games for the club earlier this season. Still just 18, he was part of Germany's squad for the World Cup in Qatar and featured in the defeat to Japan. 2. Omar Marmoush (Wolfsburg) Egyptian forward Marmoush signed for Wolfsburg in 2017, when he was still in his teens. Now just a few weeks shy of his 24th birthday, he has returned from a loan at Stuttgart to play a bigger role for his parent club. Comfortable on the left wing or in attack, the youngster has scored against Stuttgart and Borussia Monchengladbach in this season's Bundesliga. He also has two senior international goals for Egypt, and was part of the squad which reached the final of the 2021 Africa Cup of Nations. 1. Evan N'Dicka (Eintracht Frankfurt) Number one on the list is another Bundesliga star, and another man to have been linked with the Premier League. French defender N'Dicka has been linked with Arsenal, among other clubs, after thriving in Eintracht Frankfurt colours. The centre-back began his career with Auxerre, but has racked up more than 100 Bundesliga appearances since joining Frankfurt in his teens. A French under-21 international, he was also part of the starting XI as Oliver Glasner's team beat Rangers to win the 2021-22 Europa League. Back in December, reports suggested Arsenal had a verbal agreement in place to bring the defender to north London at the end of his deal in Germany. Nothing has been officially announced, though, and other clubs including Roma remain in the hunt.","pubDate":"2023-01-12 06:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article28926946.ece/ALTERNATES/s98/1_Banner-10-best-value-transfers-available-in-January-including-Arsenal-star-and-Chelsea-target.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Tabitha maintains 2nd position on rankings","link":"https://mwnation.com/tabitha-maintains-2nd-position-on-rankings/","keywords":["National Sports"],"creator":null,"video_url":null,"description":" Italy-based Malawian women’s football icon Tabitha Chawinga has maintained her position as the second best African woman footballer in ESPN sports channel’s monthly rankings for December 2022. The channel rates the performance of women footballers and teams worldwide. The Inter Milan forward trails reigning African Women’s Footballer of the Year Nigerian Asiat Oshoala while Spain-based […] The post Tabitha maintains 2nd position on rankings appeared first on The Nation Online.","content":"Italy-based Malawian women’s football icon Tabitha Chawinga has maintained her position as the second best African woman footballer in ESPN sports channel’s monthly rankings for December 2022. The channel rates the performance of women footballers and teams worldwide. The Inter Milan forward trails reigning African Women’s Footballer of the Year Nigerian Asiat Oshoala while Spain-based Zambian Rachel Kundananji, who came tops in the previous rankings, has dropped to third. Tabitha’s sister, Temwa, who came third in the November tankings, has not made the top 10. Reads part of the statement by ESPN: “This month’s Power Rankings sees an old-timer [Oshoala] return to the top of the standings, while players based in England, Portugal, Italy and France are rewarded for their work, as well as some of the usuals plying their trade in Spain. It says the Spain-based forward has hit form again for Barcelona after a slow recovery from a long spell on the sidelines through injury. On Tabitha, ESPN says: “Malawi star Chawinga continued her fine form in December, scoring twice to secure a 2-1 win over Pomigliano. “Chawinga has scored nine goals in as many Serie A Women games since joining Inter from Wuhan Jiangda, also notching four assists in the league.” In an interview, Tabitha, who leads the Serie A Women’s scorers’chart, said she was excited to have maintained the second slot. “I think Oshoala has also done really well and deserves her place on the top. I thank God for His blessings and I will keep on working hard,”she said. On her part, Temwa said she is not surprised with her omission as the Chinese Superleague concluded in November. “So, honestly, there was no way I would have still made the top 10,” said the Wuhan Jiangda striker, who won the golden boots for the Chinese Women’s Superleague and Chinese National Cup.","pubDate":"2023-01-12 05:33:00","image_url":null,"source_id":"mwnation","country":["malawi"],"category":["sports"],"language":"english"},{"title":"Bulgarian Georgi second Al Dhafra winter deals","link":"https://thenewsglory.com/bulgarian-georgi-second-al-dhafra-winter-deals/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"Al Dhafra Football Club contracted, on Wednesday evening, with Bulgarian international playmaker Georgi Milanov from Levski Sofia Club, as the team’s second deal during the winter transfer period. The club published, through its Twitter account, a picture of the player in the team’s shirt, but without revealing the details of the contract. It is noteworthy […]","content":"Al Dhafra Football Club contracted, on Wednesday evening, with Bulgarian international playmaker Georgi Milanov from Levski Sofia Club, as the team’s second deal during the winter transfer period. The club published, through its Twitter account, a picture of the player in the team’s shirt, but without revealing the details of the contract. It is noteworthy that Al Dhafra Club had signed last Sunday with Brazilian striker Thiago de Luonco from JAF Japan. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2023-01-12 03:07:33","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"NPFL New Season: Kwara Utd Call For Support","link":"https://leadership.ng/npfl-new-season-kwara-utd-call-for-support/","keywords":["Sports"],"creator":["Abdullahi Olesin"],"video_url":null,"description":"Kwara United Football Club has called for prayer and support of all and sundry ahead of their campaign in the 2022/2023 Nigeria Premier Football League (NPFL) season. The Afonja Warriors will begin their against Gombe United at the Adamasingba Stadium in Ibadan on Sunday. The club chairman, Kumbi Titiloye said despite the preparations and sacrifices, […]","content":null,"pubDate":"2023-01-12 02:51:28","image_url":null,"source_id":"leadership","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Forest brawl with Wolves after advancing in the Carabao Cup","link":"https://www.themercury.com.au/sport/football/forest-brawl-with-wolves-after-advancing-in-the-carabao-cup/video/9eb8076d54f03b26c0752a553068886b","keywords":["Football"],"creator":null,"video_url":null,"description":"Football: After Nottingham Forest held their nerve in the penalty shootout against Wolverhampton, the two teams clashed in tense scenes.","content":"Football: After Nottingham Forest held their nerve in the penalty shootout against Wolverhampton, the two teams clashed in tense scenes.","pubDate":"2023-01-12 02:36:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Watch live: National Futsal Championships – Pitch 1, Day 4","link":"https://www.themercury.com.au/sport/live-streams/football/watch-live-all-the-action-from-pitch-1-at-the-national-futsal-championships-day-3/news-story/353ff37e1bee12b7dca890293ccadd9a","keywords":["Football","Live Stream"],"creator":null,"video_url":null,"description":"It was a rough start for NSW Country on day four of the national futsal championships as Queensland found their goalscoring touch in an U12 boys quarterfinal.","content":"NSW Country scored the opening goal of the game in the third minute from a long goalkeeper throw that went in from an easy tap in. From there, it was all Queensland who banged in the next four goals to lead 4-1 at halftime.In a high scoring affair, Queensland ended up taking a 10-4 win to progress through to the semi-finals with some handy momentum.Meanwhile, a goal in the first 13 seconds of the match was the perfect start for NSW Thunder who came out 3-1 victors over NSW Lightning in the U15 girls competition. After the fast start, Lightning bounced back with a goal to level the scores before Thunder scored again to make it 2-1 at halftime. It was a gritty finish to the game as an aggressive Lightning side, trailing by a goal, threw everything at Thunder in attack.But Thunder proved the better side after all, scoring from a turnover in the 37th minute to ice the game. PREVIEWThe kids from country NSW will be determined to make their mark on the National Futsal Championships finals stage. The quarter-finals will kick off in a big way on Thursday, with KommunityTV live streaming every finals match from Field 1. The boys and girls from the bush will take centre stage on finals day, with Country NSW taking the court in three finals clashes. WATCH ALL OF THE ACTION FROM PITCH 1 IN THE VIDEO PLAYER ABOVEFUTSAL P1D4The sky blues will have their work cut out for them in all three games as they come up against the mighty maroon warriors from Queensland. First up it will be the Under-12 boys who will be determined to upset the apple cart against a strong Queensland outfit in the opening game of day four. Queensland were a dominant force in the group stages, finishing undefeated and racking up an incredible 31 goals in four games. WATCH THE ACTION FROM PITCH 7 While the Under-12 NSW Country boys haven’t scored a win yet across the regular rounds, they have shown enough fighting spirit to consider themselves a chance of pulling off the shock of the tournament. The other two State of Origin quarter-final battles will come in the Under-13 Girls and Under-14 Boys with the games being played back-to-back from 10.30am. Queensland will again go into those quarter-finals as outright favourites, but if there is one thing Country NSW loves, it is rooting for the underdog. REPLAYSFootball Victoria v Football SA (U15 boys SF)Watch a full replay as Football Victoria v Football SA.Football Queensland v NSW Country (U14 boys QF)Watch a full replay as Football Queensland v NSW Country.Football Queensland v NSW Country (U13 girls QF)Watch a full replay as Football Queensland v NSW Country.Football NSW Thunder v Football NSW Lightning (U15 girls QF)Watch a full replay as Football NSW Thunder v Football NSW Lightning (U15 girls QF).Football Queensland v NSW Country (U12 boys QF)Watch a full replay as Football Queensland v NSW Country.","pubDate":"2023-01-12 02:31:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Chelsea is football’s ‘hardest job’: Potter","link":"https://www.capitalfm.co.ke/sports/2023/01/12/chelsea-is-footballs-hardest-job-potter/","keywords":["English Premiership","Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"LONDON, United Kingdom, Jan 12 – Graham Potter claims he has the hardest job in football as injury-ravaged Chelsea struggle to live up to expectations following Todd Boehly’s takeover of the Premier League club. Potter’s side are languishing in 10th place in the top flight despite Boehly authorising a spending spree on new signings that […] The post Chelsea is football’s ‘hardest job’: Potter appeared first on Capital Sports.","content":"LONDON, United Kingdom, Jan 12 – Graham Potter claims he has the hardest job in football as injury-ravaged Chelsea struggle to live up to expectations following Todd Boehly’s takeover of the Premier League club. Potter’s side are languishing in 10th place in the top flight despite Boehly authorising a spending spree on new signings that has reached almost £350 million ($425 million) since the end of last season. Hired to replace the sacked Thomas Tuchel in September, former Brighton boss Potter is beginning to hear calls for his dismissal just four months later. Blues fans added to the pressure on Potter during Sunday’s woeful 4-0 FA Cup third round defeat at Manchester City when they sang the names of Tuchel and former owner Roman Abramovich. Add an ever-growing injury list that has denied Potter the services of stars including N’Golo Kante, Ben Chilwell and Reece James and it is perhaps not surprising the Chelsea manager ranks his job as the toughest in the sport. “I have the utmost respect for the previous ownership and what they achieved and what they did. It’s fantastic,” Potter told reporters ahead of Thursday’s west London derby at Fulham. “But, unfortunately, they’re not here anymore. It’s a new ownership, everything’s changed pretty quickly. “Lots of things went and you have to try to build it up again. But, in the meantime, you’ve still got Chelsea, you’ve still got the demands and the expectations. “I think this is probably the hardest job in football. Because of the leadership change and because of the expectations and, rightly, where people see Chelsea.” – ‘Change is challenging’ – Potter was boosted by the signing of Portugal forward Joao Felix on loan from Atletico Madrid for the rest of the season. But the 47-year-old understands the need for immediate results to stave off further sack talk, so he held a meeting with senior players Cesar Azpilicueta, Thiago Silva, Jorginho and Mateo Kovacic on Tuesday in an attempt to calm the crisis. “They were honest, articulated their concerns well, their positivity, their responsibility. I think we are in a place where we can move forward,” Potter said. “The reality of where the club is in terms of establishing itself as a well-run football club, functioning well in a really competitive environment, maybe we’re not quite there yet. “In my head, that’s quite easy for me to understand and get. But I know there’s a lot of people that don’t see it that way.” Insisting he retains the support of Boehly and co-owner Behdad Eghbali, Potter added: “I’ve been in regular dialogue with the owners and they’ve been really supportive, fantastic. “Change is challenging in any organisation. But I didn’t think we’d lose 10 first-team players. That’s just where we’re at. “This is a new era, a new chapter. We’re going through some pain, it’s difficult at the moment.” The post Chelsea is football’s ‘hardest job’: Potter appeared first on Capital Sports.","pubDate":"2023-01-12 02:08:36","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Bills’ Hamlin out of hospital as he recovers from cardiac arrest","link":"https://www.capitalfm.co.ke/sports/2023/01/12/bills-hamlin-out-of-hospital-as-he-recovers-from-cardiac-arrest/","keywords":["NFL","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"WASHINGTON, United States, Jan 11 – Buffalo Bills player Damar Hamlin has been discharged from hospital to continue recovering at home more than a week after his cardiac arrest during an NFL game shocked the league, the team said Wednesday. The Bills said in a statement that the 24-year-old underwent a “comprehensive medical and neurological […] The post Bills’ Hamlin out of hospital as he recovers from cardiac arrest appeared first on Capital Sports.","content":"WASHINGTON, United States, Jan 11 – Buffalo Bills player Damar Hamlin has been discharged from hospital to continue recovering at home more than a week after his cardiac arrest during an NFL game shocked the league, the team said Wednesday. The Bills said in a statement that the 24-year-old underwent a “comprehensive medical and neurological evaluation” at a hospital in Buffalo, New York, on Tuesday after being transferred there from Cincinnati a day earlier. “We have completed a series of tests and evaluations, and in consultation with the team physicians, we are confident that Damar can be safely discharged to continue his rehabilitation at home and with the Bills,” Jamie Nadler, a critical care physician, said in a statement released through the Bills. Bills coach Sean McDermott told reporters that the team would leave it up to Hamlin to decide when he wants to return to club facilities. “His health is first and foremost on our mind as far as his situation,” McDermott said. “We’ll welcome him back as he feels ready.” Hamlin, a defensive safety, was left in critical condition on January 2 when he collapsed during the Bills’ clash with the Bengals in Cincinnati, forcing the abandonment of the Monday night football game. The frightening incident, in which team medical staff resuscitated Hamlin on the field before he was taken to hospital by ambulance, once again put more scrutiny on the physically punishing nature of America’s most popular sport, although the precise cause of Hamlin’s medical emergency has yet to be determined. Hamlin has made steady progress since he was hospitalized, regaining consciousness last Wednesday and addressing teammates via a video call Friday after a breathing tube was removed. He was released from the University of Cincinnati Medical Center on Monday and admitted to the hospital in Buffalo as doctors continued to try to pinpoint the cause of the cardiac arrest and determine what ongoing treatment might be needed. After the move Hamlin tweeted his thanks to the medical staff in Cincinnati and expressed gratitude for the outpouring of goodwill across the sporting world. Millions of dollars in donations poured into a GoFundMe toy drive that he started as part of his charitable foundation. Over the weekend NFL teams held moments of prayer and celebrated his recovery with on-field insignia and “Love for Damar” messages on signs and T-shirts. “The same love you all have shown me is the same love that I plan to put back into the world ‘n more,” Hamlin tweeted Monday. – Beyond excited – Bills players had returned to action on Sunday with a 35-23 victory over the New England Patriots, the players wearing patches of Hamlin’s No. 3 jersey on their uniforms. The Bills medical and training staff who attended Hamlin when he collapsed were honored before the game. Buffalo Bills safety Damar Hamlin, seen here celebrating a tackle in an NFL game against Minnesota, has been released from hospital more than a week after suffering cardiac arrest on the field © GETTY IMAGES NORTH AMERICA/AFP/File / Isaiah Vazquez Timothy Pritts, a UCMC physician, said Monday that Hamlin had watched that game from his hospital room — reacting enthusiastically when teammate Nyheim Hines returned the opening kick off 96 yards for a touchdown. “He was beyond excited,” Pritts said. “When the opening kick off was run back he jumped up and down, got up out of his chair and set off every alarm possible in the ICU in the process.” While McDermott indicated Hamlin’s release from hospital was another boost for the team, he said Hamlin and his father, Mario, had indicated they want players and staff to focus on their upcoming playoff game against the Miami Dolphins. “They want us to go do our job, and that’s what we’ve got to do,” McDermott said. The post Bills’ Hamlin out of hospital as he recovers from cardiac arrest appeared first on Capital Sports.","pubDate":"2023-01-12 02:04:49","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Noel Le Graet steps back from duties as French FA president","link":"https://www.sportsmole.co.uk/football/france/news/noel-le-graet-steps-back-from-duties-as-french-fa-president_503946.html","keywords":["Football","France","Noel Le Graet","Zinedine Zidane","Didier Deschamps","Kylian Mbappe","Sonia Souid","Eric Borghini","Philippe Diallo","503946"],"creator":null,"video_url":null,"description":"Noel Le Graet, president of the French Football Federation, steps back from his duties amid allegations of improper conduct against a female sports agent.","content":null,"pubDate":"2023-01-12 00:39:13","image_url":"https://sm.imgix.net/23/02/noel-le-graet.jpg","source_id":"sportsmole","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Guardiola: Man City deserved Carabao Cup loss to Southampton - ESPN","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3d3dy5lc3BuLmNvbS5zZy9zb2NjZXIvbWFuY2hlc3Rlci1jaXR5LWVuZ21hbl9jaXR5L3N0b3J5LzQ4NTAxNzcvZ3VhcmRpb2xhLW1hbmNoZXN0ZXItY2l0eS1kZXNlcnZlZC1jYXJhYmFvLWN1cC1sb3NzLXRvLXNvdXRoYW1wdG9u0gGaAWh0dHBzOi8vd3d3LmVzcG4uY29tLnNnL2Zvb3RiYWxsL21hbmNoZXN0ZXItY2l0eS1lbmdtYW5fY2l0eS9zdG9yeS80ODUwMTc3L2d1YXJkaW9sYS1tYW5jaGVzdGVyLWNpdHktZGVzZXJ2ZWQtY2FyYWJhby1jdXAtbG9zcy10by1zb3V0aGFtcHRvbj9wbGF0Zm9ybT1hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Guardiola: Man City deserved Carabao Cup loss to Southampton  ESPNSloppy Man City get the Carabao Cup shock they deserve as Southampton punish Guardiola's squad rotation  Goal SingaporeSouthampton stun Man City to reach League Cup semis  Yahoo Singapore NewsSouthampton vs. Manchester City - Football Match Report - January 12, 2023  ESPNSouthampton vs Manchester City: Lineups and LIVE updates  Goal SingaporeView Full coverage on Google News","content":null,"pubDate":"2023-01-12 00:23:00","image_url":null,"source_id":"google","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Watch moment brawl erupts after Nottingham Forest’s dramatic shootout win over Wolves as players celebrate on pitch","link":"https://www.thesun.co.uk/sport/football/21016251/nottingham-forest-wolves-carabao-cup-2/","keywords":["Football","Carabao Cup"],"creator":["Kealan Hughes"],"video_url":null,"description":null,"content":"NOTTINGHAM FOREST’S clash with Wolves erupted into a brawl following the full-time whistle. The match ended 1-1 after 90 minutes with Forest progressing to the semi-final after winning the penalty shoot-out 4-3. Unsavoury scenes after Nottingham Forest's penalty shoot-out victory over Wolves in the Carabao Cup quarter-final, with both sets of players were involved in a scuffle that boiled over at the City Ground pic.twitter.com/wXtK0GE5E4— Sky Sports Football (@SkyFootball) January 11, 2023 ReutersMorgan Gibbs-White celebrated the win in front of the Wolves fans[/caption] GettyDean Henderson joined him and their behaviour upset the Wolves players[/caption] Gibbs-White and Wolves’ Toti Gomes were at the centre of the flare up ReutersThere was a fiery atmosphere throughout the cup tie[/caption] ReutersStewards had to intervene to separate the two sets of players[/caption] Cue bedlam from the Forest players led by goalkeeper Dean Henderson and Morgan Gibbs-White. The shot-stopper celebrated with the Forest faithful as his midfield team-mate decided to wind up his former team. Gibbs-White joined Forest from Wolves last summer and celebrated the win by sliding in front of the travelling faithful and putting his fingers in his ears. Manchester United loanee Henderson then bounced up and down with a group of team-mates before a melee broke out between the two sets of players. Gibbs-White appeared to be the target of the Wolves stars’ anger as Henderson and Serge Aurier rushed in to defend their team-mate. Wolves centre-back Toti Gomes squared up to the pair before stewards tried the separate the trio. Several Forest stars including striker Emmanuel Dennis tried to pull an emotional Gomes away from the situation. BETTING SPECIAL – BEST OFFERS FOR EXISTING CUSTOMERS Aurier in particular looked very annoyed but was soon calmed down by Wolves manager Julen Lopetegui. Jesse Lingard was also involved in the altercation despite not even being named in the matchday squad. It was a sour end to the tie but Forest fans may have enjoyed the spectacle as they celebrated reaching the semi-final of a domestic cup for the first time since 1992. They will take on Manchester United in the two-legged tie later this month.","pubDate":"2023-01-11 23:46:11","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Chicago State mulls adding Division I football program","link":"https://www.thestar.com/sports/football/ncaa/2023/01/11/chicago-state-mulls-adding-division-i-football-program.html","keywords":null,"creator":["The Associated Press"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-11 23:33:18","image_url":null,"source_id":"thestar","country":["canada"],"category":["sports"],"language":"english"},{"title":"Football: Forest beat Wolves in shootout to reach League Cup semis","link":"https://www.straitstimes.com/sport/football/football-forest-beat-wolves-in-shootout-to-reach-league-cup-semis","keywords":null,"creator":null,"video_url":null,"description":"January 12, 2023 7:04 AMForest keeper Dean Henderson made the decisive save from Joe Hodge’s penalty shootout spot kick.","content":null,"pubDate":"2023-01-11 23:04:27","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Watch Lionel Messi turn on the style and finish stunning team goal in first game back for PSG following World Cup win","link":"https://www.thesun.co.uk/sport/21016073/lionel-messi-psg-world-cup/","keywords":["Football","France Ligue 1","Sport","World Cup"],"creator":["Kealan Hughes"],"video_url":null,"description":null,"content":"LIONEL MESSI was the star of the show in his first game since the World Cup as PSG beat Angers 2-0. The forward has had a few weeks off since his historic World Cup win but showed no signs of rustiness on his return. Lionel Messi is starting 2023 how he finished 2022 It was marginal, but the GOAT doubles PSG's lead He makes it look so easy… pic.twitter.com/KujydPyEAn— Football on BT Sport (@btsportfootball) January 11, 2023 GettyLionel Messi paid tribute to the late Pele before the game[/caption] APMessi impressed with a goal on his PSG return[/caption] Messi started in attack alongside Neymar and Hugo Ekitike, who opened the scoring in the fifth minute. The 35-year-old then got in the act after he finished off a brilliant PSG move to slot the ball into the back of the net with his weaker foot. Messi started the passing move and played a one-two with Sergio Ramos before finding Ekitike. He continued his clever run into the box and was picked out by Nordi Mukiele before scoring. The linesman raised his flag to spoil Messi’s celebration – only for VAR to rule the Argentine had in fact timed his run to perfection. With PSG cruising Messi decided to turn on the style as the clock wound down. The World Cup winner was surrounded in the corner of the penalty box by two Angers defenders yet still managed to wrangle himself free with the ball. He cleverly turned away from one before flicking the ball past the second and finding Mukiele. Lionel Messi could find space in a phone box pic.twitter.com/0UrCruZK5T— Football on BT Sport (@btsportfootball) January 11, 2023 FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS PSG’s win means they have lost just once in 18 Ligue Un games and top the league by six points. Messi now has eight goals in 14 league games this season and he paid tribute to the late Pele ahead of kick-off.","pubDate":"2023-01-11 23:03:57","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Nottingham Forest penalty hero Dean Henderson goes from high to huge low as he faces being barred from Carabao Cup semis","link":"https://www.thesun.ie/sport/football/10039067/nottingham-forest-henderson-barred-carabao-cup-manchester-united/","keywords":["Football","Sport","Premier League"],"creator":["Henry Tomlinson"],"video_url":null,"description":null,"content":"DEAN HENDERSON looks set to miss out on the Carabao Cup semi-finals following the cup draw. Nottingham Forest beat Wolves in the quarter-finals after a penalty shootout in which Henderson made two vital saves. ReutersDean Henderson may not be able to play in the Carabao Cup semi-finals[/caption] The goalkeeper denied Wolves‘ Ruben Neves and Joe Hodge to help Forest make their first appearance in the semi-finals since 1992. However, after being the hero, Henderson could now miss out on playing after Forest were drawn against Manchester United in the next round. The 25-year-old is on a season-long loan from the Red Devils at the City Ground and could be deemed illegible to play against his parent club. When the clubs faced each other in the Premier League in December, Henderson was on the sidelines as Wayne Hennessey took his place in goal. Henderson would likely need to get special permission from the Old Trafford side in order to be able to play. But with the Red Devils desperate for silverware, it looks likely Hennessey will likely return to the side for the two-legged tie. Forest boss Steve Cooper was told that Henderson would not be able to play and admitted that the news has put a “dampener” on the celebrations. He said: “Only just thought of that. Got me on the spot there. It is unfortunate. HOW TO GET FREE BETS ON FOOTBALL “That has put a bit of a dampener on it.” He added: “It is frustrating. “Especially after seeing the night he has had tonight, he was excellent in the penalty shootout but he was more than good in the game.  “It’s unfortunate because he’s part of our group, he is so invested in the group and how we work as well as what we’re trying to become.  “To do that you need a really good goalkeeper.  “Not only is he committing as a goalkeeper, he is buying into being in the city and the greater good of the club.  “It has put a dampener on it for me tonight.” It would be a blow to Forest’s chances of progress to the final as Henderson is the clear number one at the club. Since joining the club in the summer, the shot-stopper has been crucial in keeping the club in a competitive position in the Premier League.","pubDate":"2023-01-11 22:43:57","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"‘You’re treated like a god’ – Celtic star Giorgos Giakoumakis will have fans BOWING for him in Japan says SPFL hero","link":"https://www.thescottishsun.co.uk/sport/football/10047895/celtic-giorgos-giakoumakis-fans-bowing-japan/","keywords":["Football","Scottish Premiership","Sport"],"creator":["Derek McGregor"],"video_url":null,"description":null,"content":"CELTIC striker Giorgos Giakoumakis has had Celtic fans cheering him plenty of times. But Ross County legend Alex Schalk says the Greek ace will have supporters BOWING if he scores for Urawa Red Diamonds. AlamyGiakoumakis is closing in on his Celtic exit[/caption] GettyFormer Ross County star Schalk is loving life in Japan[/caption] SunSport understands the Japanese outfit are confident they will strike a deal for Giakoumakis within days. We revealed Celtic want a package worth up to £8million for the 29-year-old, who is under contract until 2026. That’s not a problem for cash-rich Urawa who will also hand Giakoumakis a highly lucrative contract. Dutch ace Schalk — who was an inspiration for County as they won the 2016 League Cup — signed for Urawa last April. Even though there have been challenging Covid measures in Japan until recently, the 30-year-old has relished playing for the club, and experiencing a whole new way of life. Schalk said: “There have been reports for a while now of the club’s interest in Giorgos Giakoumakis. “I can’t speak highly enough of the club and the life out here. Giakoumakis is the type of player who clearly doesn’t lack clubs interested in him. “Of course, I don’t know what else he is being offered. “But all I can say is I am sure Urawa’s proposal will definitely be worth serious consideration by him. “I joined the club almost a year ago — and I was blown away by life here. “I never expected Urawa to be this big. It’s incredible. “It’s one of THE biggest clubs in Asia. “The fanbase is crazy, and the stadium is so beautiful. “When you walk in a city like Tokyo — where there’s 40million people — you think you will be quite anonymous. “But even when I walked through the streets of Tokyo I had people bowing for me. “There were constant requests for signatures and photographs. “I was amazed but humbled. As Europeans, we can’t understand this culture. You’re treated like a god here. “And especially at Urawa club, it’s like the Feyenoord of Asia. In fact, the clubs actually have a collaboration. “The magnitude of the club is insane. When we fly for away games, there are fans waiting at the airport to see us coming in. “They are sleeping in front of the hotels. Urawa is an incredible club. I have seen that kind of adulation when I played for Ross County against Celtic at Celtic Park. “Our stadium at Saitama was a World Cup finals venue and it has a 60,000-capacity. “Covid had a massive impact in Japan like every other country, and restrictions have been very severe. “Up until last week we were still testing three times a week. “It has been impossible for my father, my partner and my child to come and visit. That’s been hard. “Hopefully, though, I’ll be seeing them again soon. “I’ve still never regretted coming to Japan. “Before I signed I spoke to people about Urawa and their consistent reaction was, ‘Wow, you should go there’. “As soon as my name was mentioned on Twitter about a possible transfer, I had a thousand messages from Urawa fans pleading with me to sign for the club. “Once I saw the figures for the deal, it wasn’t one I could turn down. “I have no doubts it will be the same now for Giakoumakis — he will have many Urawa fans urging him to join. “It’s life-changing in every respect. “Japan is a beautiful country, it’s clean and the people are so respectful. “The World Cup performances by the national team were very impressive — and there’s no doubt football in this country is really on the up. “Urawa have also qualified for the Asian Champions League final, which we play over two legs in April and May. “We are currently in a pre-season training camp for three weeks. “We finished ninth in the J.League which was disappointing. A club like Urawa wants to play for every title, just like Celtic do.” Schalk can’t wait to welcome Giakoumakis, who was joint top scorer in the Premiership last season with ex-County ace Regan Charles-Cook, to his club. But he’s hoping the Greek striker won’t replace him in the Urawa line-up. Schalk added: “For Giakoumakis, I can only say good things about the club, and all of the experiences that come with it. “If he does sign then I realise it could be difficult for me. “In Japan clubs are only allowed to use five of their foreign players. “If he signs then Urawa will have six — and someone will have to sit in the stand. “I hope that won’t be me, but we will see.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-01-11 22:30:45","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Giorgos Giakoumakis closes in on Celtic exit as J.League transfer timeline revealed – but Hoops confident of landing Cho","link":"https://www.thescottishsun.co.uk/sport/football/10047729/giorgos-giakoumakis-celtic-exit-jleague-transfer-timeline-cho/","keywords":["Football","Scottish Premiership","Sport"],"creator":["David Robson"],"video_url":null,"description":null,"content":"PARKHEAD chiefs are eager to offload want-away striker Giorgos Giakoumakis to Urawa Red Diamonds. The Japanese outfit are deep in talks over a £8m deal for the Greek hitman. GettyGiakoumakis looks set to leave Celtic[/caption] GettyCho could be the man to replace Giakoumakis at Parkhead[/caption] They know there are other clubs interested, with Italians Sampdoria eager to strike an agreement with the Hoops and the player, who finished last season as the Premiership’s joint-top scorer. But the J.League side hope to land Giakoumakis by tabling him a big-money offer he cannot refuse. Further discussions are set to take place in the next couple of days, which could see a deal done by the weekend. Celtic‘s recruitment chiefs are lining up a replacement for the striker and continue to find new signings for Ange Postecoglou. And South Korea striker Cho Gue-sung could be their final piece of their January jigsaw. Club bosses are in talks with his club Jeonbuk Hyundai Motors, and it’s understood the Premiership champions have tabled a £2.6m offer, with a 50 per cent sell-on clause up to £5.2m. MLS outfit Minnesota are also in talks and have offered a bigger transfer fee of £4.4m up front, with a 30 per cent sell-on. The Hoops are thought to be confident their deal will be accepted. The standout World Cup star admitted earlier in the week that he was aware of interest from Celtic. Speaking about Postecoglou’s side, he said: “Celtic have six Japanese players in its squad. “As you can see there, it is a team that has invested heavily in the Asian market over the past few years and there have been talks.” Meanwhile, Postecoglou has warned his players to be wary of a Viaplay Cup shock to Kilmarnock. The Hoops face Derek McInnes’ side in Saturday’s semi-final — just a week after beating them 2-0 in a Parkhead league clash. Postecoglou said: “There is no doubt the cup is different from the league. You just have to look at what happened down south in the FA Cup over the weekend, and just in cup football in general. “I have been around long enough to know that there is always a different element to those games. “It allows players to play with a little less fear, even though there is so much on edge. Particularly teams that are not expected to win — because they have nothing to lose. “It’s not like they are losing three points or falling behind in the league table. “You give it all out there and see what comes of it, so we have to be ready for that. We need to have the same sort of mentality and not just expect that, because we were successful in last week’s game, it will be the same. “It’s a bit of an unusual situation, where you are playing the same team two weeks in a row. “I have no doubt that Derek will have his team up for it and we’ve got to be ready. We will be up for it as well.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page ","pubDate":"2023-01-11 22:30:01","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"France : Andy Delort buteur et passeur face à Montpellier","link":"https://www.dzfoot.com/verts-deurope/france-andy-delort-buteur-et-passeur-face-a-montpellier-236719.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Verts du Monde","Bilal Brahimi","Hicham Boudaoui","Ligue 1 Uber Eats","Montpellier HSC","ogc nice","Youcef Atal","Andy Delort"],"creator":null,"video_url":null,"description":"Toujours pour cette 18e journée de Ligue 1 Uber Eats, l'OGC Nice recevait Montpellier pour un duel entre deux équipes qui sont dans le ventre du mou du championnat français. L'OGC Nice s'impose avec la manière et se relance clairement face à Montpellier (6-1). Les Niçois ont ouvert le score rapidement avec Nicolas Pépé, qui […] The post France : Andy Delort buteur et passeur face à Montpellier appeared first on Football Algérien - DZFOOT.COM.","content":"Toujours pour cette 18e journée de Ligue 1 Uber Eats, l'OGC Nice recevait Montpellier pour un duel entre deux équipes qui sont dans le ventre du mou du championnat français. L'OGC Nice s'impose avec la manière et se relance clairement face à Montpellier (6-1). Les Niçois ont ouvert le score rapidement avec Nicolas Pépé, qui va même s'offrir un doublé (15', 56') et Khéphren Thuram va permettre à ses coéquipiers de passer une fin de première mi-temps avec un net avantage (35', 3-0). L'attaquant algérien Andy Delort, qui a commencé la rencontre sur le banc, va entrer à l'heure de jeu (67') et se mettre au service de son équipe en inscrivant son 6e but de la saison en Ligue 1 (75'). L'ancien montpelliérain va même offrir une passe décisive à Ross Barkley, qui va lui aussi s'offrir un doublé (82',85'). Pour la première de Didier Digard, (ancien pensionnaire de Ligue 1) sur le banc niçois, c'est une victoire importante pour bien débuter l'année. L'OGC Nice revient à la 10e place au classement et Montpellier reste 15e. BUT de Andy Delort avec l’OGC Nice !!! ⚽️ pic.twitter.com/AciwglCWhs DZfoot","pubDate":"2023-01-11 22:26:16","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"Football: Man City exit League Cup after shock loss to Southampton","link":"https://www.straitstimes.com/sport/football/football-man-city-exit-league-cup-after-shock-loss-to-southampton","keywords":null,"creator":null,"video_url":null,"description":"January 12, 2023 6:14 AMSouthampton score twice in the first half through Sekou Mara and Moussa Djenepo.","content":null,"pubDate":"2023-01-11 22:14:49","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Paddy Carr reacts to Donegal’s McKenna Cup loss to Monaghan","link":"https://highlandradio.com/2023/01/11/paddy-carr-reacts-to-donegals-mckenna-cup-loss-to-monaghan/","keywords":["Audio","Sport","Top Stories"],"creator":["highlandsport"],"video_url":null,"description":"Donegal suffered a 2-07 to 0-15 loss to Monaghan in their final McKenna Cup game of the season. Goals in either half from Joel Bradley Walsh and Luke McGlynn helped keep Donegal in touch but the Farney county proved just too strong as they ran out two point winners. Next up for Donegal is the … Paddy Carr reacts to Donegal’s McKenna Cup loss to Monaghan Read More » The post Paddy Carr reacts to Donegal’s McKenna Cup loss to Monaghan appeared first on Highland Radio - Latest Donegal News and Sport.","content":"Donegal suffered a 2-07 to 0-15 loss to Monaghan in their final McKenna Cup game of the season. Goals in either half from Joel Bradley Walsh and Luke McGlynn helped keep Donegal in touch but the Farney county proved just too strong as they ran out two point winners. Next up for Donegal is the National Football League meeting with All Ireland champions, Kerry at the end of January. Donegal boss Paddy Carr spoke with Oisin Kelly after the game… document.createElement('audio'); https://highlandradio.com/wp-content/uploads/2023/01/1101-Paddy-Carr.mp3 The post Paddy Carr reacts to Donegal’s McKenna Cup loss to Monaghan appeared first on Highland Radio - Latest Donegal News and Sport.","pubDate":"2023-01-11 22:05:37","image_url":null,"source_id":"highlandradio","country":["ireland"],"category":["sports"],"language":"english"},{"title":"6 Conditions for disengaging the “engagement” in the “second group” .. and the fate of the “white” is in the hands of others","link":"https://thenewsglory.com/6-conditions-for-disengaging-the-engagement-in-the-second-group-and-the-fate-of-the-white-is-in-the-hands-of-others/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"The cards of the second group were scattered in the Gulf Football Cup “Gulf 25”, which is currently being hosted by the Iraqi city of Basra, after a dramatic scenario in which the Bahraini team was victorious over its Qatari counterpart in the last minutes of the match that brought them together at the end […]","content":"The cards of the second group were scattered in the Gulf Football Cup “Gulf 25”, which is currently being hosted by the Iraqi city of Basra, after a dramatic scenario in which the Bahraini team was victorious over its Qatari counterpart in the last minutes of the match that brought them together at the end of the second round the day before yesterday. This restored the fortunes of all the teams, including the national team, which currently does not have any points, to enter the group into a cycle of very complex calculations, the easiest of which is for the leading Bahraini team, while the national team is required to beat Qatar by a difference of two goals, and wait for Kuwait to lose against Bahrain to qualify for the semi-finals. Final. Article 7 of the competition regulations specified six conditions for dissolving any clash in points in the event that two or more teams tied in the group to determine the qualifiers for the semi-finals, namely: the goal difference between the tied players in points, the most scored goals, the goal difference in all matches of the tournament, and the most scored in the tournament. All matches, the lowest cards (yellow: 1, red: 3), and finally the draw. The Bahraini team topped the group with six points (it has 4 goals and it has 2), but despite that it has not decided its qualification, and the Qatari team comes behind it with three goals (it has 3 goals and it has 2), and Kuwait is third with three points (it has a goal and it has 2) and «White Fourth, without points (it has one goal and it has 3), and the last round, which will be held at seven o’clock tomorrow evening, will witness a confrontation between “Al-Abyad” and Qatar at Al-Mina Stadium, while Bahrain and Kuwait will meet at the same time at the Basra Stadium. The team’s fortunes diminished greatly after losing in the first round at the hands of Bahrain 1-2 and Kuwait 0-1, and it was on the verge of an official exit from the tournament, but the dramatic scenario that ended with Bahrain turning the loss against Qatar 0-1 into a 2-1 victory revived hopes. Al-Abyad”, but he does not have his destiny in his hands, as it is represented in winning Qatar by a difference of two goals and waiting for a gift for Bahrain’s victory over Kuwait with any result. A state of uncertainty dominates the fans about the team’s ability to qualify for the Golden Square even with this opportunity, due to their loss of conviction in the capabilities of the national team coach Aruabarina and the lack of experience of the list he called up, and the expulsion of a group of players with great experience, led by the national team’s top scorer Ali Mabkhout, as well. The “White” suffers from injury to some players, such as striker Fabio Lima. The coach of the national team said in the press conference after the loss from Kuwait with a clean goal, that the opportunity to qualify is very difficult, and he continued: “It depends on the results of the rest of the teams in the group in the last round. I think morale will not be at its best, and for this I will try to push players who are technically and morally ready in the Qatar match. And he stressed that what most enhances the team’s chances of achieving the “possible impossible” scenario is that the players will not be under pressure against Qatar, like the rest of the three teams, because their chances are originally very small and dependent on the feet of others, unlike the rest of the teams that have the reins in their hands, and will be under pressure. Big pressure. “The most important thing for (Al-Annabi) is to win the last match and qualify, but the calculations are complicated,” said Qatar’s coach, Portuguese Pinheiro, in a press statement. Bahrain’s coach, Portuguese Souza, said in a press statement that “the three Bahrain confrontations are difficult, and each match has its circumstances and calculations, and in general I have great confidence in the capabilities and capabilities of all players.” Qualification conditions after a tie in points in the group stage in “Gulf 25” ■ The goal difference between the teams, or the two teams that are equal in points. ■ Most goals scored. ■ Goal difference in all tournament matches. ■ Most scored in all tournament matches. ■ The lowest cards (yellow: 1 point, red: 3 degrees). ■ lottery. The chances of qualifying for the second group teams to the round of 4 National team qualification accounts ■ Beating Qatar by two goals and losing Kuwait by any number of goals against Bahrain. Bahrain qualifying accounts ■ A tie with Kuwait is sufficient for him. ■ Loss from Kuwait by any result, and Al-Abyad and Qatar tied. ■ The loss from Kuwait by a difference of two goals only, with the loss or tie of “Al-Abyad” with Qatar. Qatar qualifying accounts ■ Victory over Al-Abyad, regardless of the outcome of Bahrain and Kuwait. ■ A tie with Al-Abyad, and Bahrain’s victory over Kuwait. Kuwait qualification accounts ■ Victory over Bahrain and Qatar tied with Al-Abyad. ■ Beating Bahrain by three goals. ■ A tie with Bahrain and Qatar’s loss from Al-Abyad. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats App","pubDate":"2023-01-11 22:05:00","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"The Football Association did not listen to the media’s call when contracting with Arobarina","link":"https://thenewsglory.com/the-football-association-did-not-listen-to-the-medias-call-when-contracting-with-arobarina/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"Athletes and technical analysts said that the National Teams and Technical Affairs Committee of the Football Association did not listen to the opinions of the sports street, critics, and the media from the beginning, which demanded not to contract with the current coach of the Argentine national football team, Arwabarina, who achieved negative results with […]","content":"Athletes and technical analysts said that the National Teams and Technical Affairs Committee of the Football Association did not listen to the opinions of the sports street, critics, and the media from the beginning, which demanded not to contract with the current coach of the Argentine national football team, Arwabarina, who achieved negative results with “Al-Abyad” throughout his career that began. Officially since the Iraq match in the 2022 World Cup qualifiers, last March, and Al-Abyad lost it 1-0. Aruabarina’s contract with the national team extends until the next Asian Cup. Since that match, the national team did not achieve any good results, and was eliminated from the World Cup qualifiers, from the appendix, and then became on the cusp of leaving the “Gulf 25” currently held in the Iraqi city of Basra, after finishing in last place in the second group without points, and became required By defeating Qatar, and waiting for Kuwait to lose from Bahrain in order to pass to the round of four. In total, the national team played five official matches under the leadership of Aruabarrena, winning one, losing four, conceding six goals and scoring three. The loss the day before yesterday from Kuwait in the second round of the group stage in the “Gulf 25” sparked a state of resentment and anger among the fans of the national team, due to the succession of defeats, and the modest level with which it appeared so far. It is noteworthy that the technical committee of the Football Association had justified the contract with Aruabarina by the fact that he had experience in Emirati football, after he had previously trained the Al Wasl and Al Ahly youth teams, although he had never led any team before “Al Abyad”. Athletes said that many options for experienced coaches were on the table before the Football Association, before contracting with the Argentine coach, to succeed Dutchman Marvik. They told Emirates Today that club training is very different from teams, and that Al-Abyad was in need of a coach with experience in leading teams, and that “this matter was evident in the Arab Gulf Cup, as well as during the Asian supplement meeting that qualifies for the World Cup against Australia.” . They were surprised by the coach’s insistence on excluding the top scorer of the national team and the ADNOC Professional League, Ali Mabkhout, from the national team’s list in the Gulf championship, despite the national team’s need for his presence. Responsibility of the Technical Committee The former Chairman of the Board of Directors of the Ittihad Kalba Club, Issa Al-Dhabahi, said: “Everyone now holds the Football Association responsible, but in fact the technical committee is concerned with evaluating the coach, and it is responsible for the selections, not the Football Association.” He asked why the league’s top scorer, Ali Mabkhout, was not with the national team, pointing out that although he is not a supporter of interference in the work of any coach, there are some matters that the coach should discuss, and this is the responsibility of the technical committee. Al-Dhabahi added, “A top scorer like Ali Mabkhout cannot be outside the national team. As for me, I was in charge of a club, and I used to sit with the coach and discuss some matters with him, without interfering in technical details.” future project In turn, a member of the former Football Association Board of Directors and sports analyst, Dr. Salim Al Shamsi, confirmed that they “were very late in evaluating the work of the federation by the sports street and the media, as it should have been given the opportunity during the first year of its session and to evaluate its work, but despite the delay, it can be fixed.” command.” Al Shamsi added, “Arwabarina is not the coach of the stage, but we must not forget the past, and we must start developing a future national project, and this matter requires that the National Teams and Technical Affairs Committee sit with the Federation’s Board of Directors, and begin to develop the project through a specific strategic plan to form teams at the level high”. Regarding the choices of coach Aruabarina, Al Shamsi stressed “the need to provide all the tools for the coach, and give him a space to work, including his choices for the players. The system will not achieve anything. For his part, the former international player and legal advisor, Salem Hadid, said, “The Sports Street has already expressed its opinion, as well as the critics, regarding the contract with the coach, but there is no life for those who call.” And he stressed that there is a big difference between training clubs and teams, especially in light of the surrounding circumstances, whether with players or other teams. He said, “It is very important to choose an experienced coach, because any match played by the national team is considered a championship, and there is no room for compensation.” Salem Hadid added, “The problem lies in not taking the correct opinion, so the confusion has continued since the 1990 World Cup in Italy, and we wasted money and years.” Regarding the choices of coach Aruabarina, Salem Hadid confirmed that he was very surprised that a distinguished striker, the top scorer of the league and the national team, like Ali Mabkhout, was excluded. He said: “It is not convincing that Ali Mabkhout was not chosen with the national team in the Gulf Cup. We have seen that the national team owns the field, presses and attacks, but there is no one to end the attacks. • 5 official matches played by the national team under the leadership of coach Aruabarina, losing in 4 and winning in one. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats App","pubDate":"2023-01-11 22:05:00","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Ex-Brighton star Anthony Knockaert with Huddersfield on loan","link":"https://www.theargus.co.uk/sport/23244867.ex-brighton-star-anthony-knockaert-huddersfield-loan/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Anthony Knockaert is back in English football – with one of his former Albion promotion rivals.","content":null,"pubDate":"2023-01-11 21:58:19","image_url":"https://www.theargus.co.uk/resources/images/16346937/?type=app&htype=0","source_id":"theargus","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Football. Willy Suret quitte la Maladrerie et retourne à Dives","link":"https://actu.fr/normandie/caen_14118/football-willy-suret-quitte-la-maladrerie-et-retourne-a-dives_56534540.html","keywords":null,"creator":null,"video_url":null,"description":"Rarement titulaire avec la Maladrerie en Régional 1, Willy Suret quitte le club de Caen et rejoint Dives-Cabourg à l'étage supérieur. Il y a connu ses meilleures années.","content":null,"pubDate":"2023-01-11 21:56:02","image_url":null,"source_id":"actu","country":["france"],"category":["sports"],"language":"french"},{"title":"McEvoy, Lions patiently awaiting Rourke's decision as QB works out with NFL clubs","link":"https://www.sootoday.com/national-sports/mcevoy-lions-patiently-awaiting-rourkes-decision-as-qb-works-out-with-nfl-clubs-6364872","keywords":null,"creator":["Dan Ralph"," The Canadian Press"],"video_url":null,"description":"Neil McEvoy is of two minds when it comes to the football future of Nathan Rourke. On one hand, he's pleased to see a CFL player get opportunities to prove himself south of the border. But as the B.C.","content":null,"pubDate":"2023-01-11 21:50:00","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/01/20230111160144-63bf2dbe7e2f4cf5ab7f8b43jpeg.jpg;w=960","source_id":"sootoday","country":["canada"],"category":["sports"],"language":"english"}]}