{"newsArray":[{"title":"Barry Robson has landed Aberdeen Euro jackpot but rookie boss told to hit two more Pittodrie objectives","link":"https://www.dailyrecord.co.uk/sport/football/football-news/barry-robson-landed-aberdeen-euro-30179347","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"Barry Nicholson was part of the Dons squad that qualified from the UEFA Cup group stage and faced the mighty Bayern Munich.","content":"Fleetwood manager Scott Brown (R) and coaches Steven Whittaker and Barry Nicholson × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Aberdeen landed the £5million jackpot by finishing third – but Barry Nicholson knows there’s memories money can’t buy ahead in Europe. Dons were left celebrating at the weekend, as Celtic lifted the Scottish Cup and ensured they went into the play-off round of the Europa League. If they get through that they go into the group sections and if they lose they fall into the same stage of the Europa Conference League , guaranteed games until Christmas. Nicholson was part of the last Aberdeen squad that last made the group stages 16 years ago. Jimmy Calderwood’s side not only got through their group but caused Bayern Munich a brief scare in the knockout stage. Nicholson admitted: “It will be amazing. It’s what Aberdeen is all about. They need to be constantly pushing for those European places, cup finals and trophies. I know from being up there, those are the demands. Barry has done absolutely brilliantly to get Aberdeen into this situation. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Dave Cormack in brutal Hearts troll as he bites back at Andrew McKinlay with 'season ticket league' putdown “Going away to some of the places we did on that European run was amazing. The fans had some great trips away and we all really enjoyed it because you are playing against top players and top clubs. Aberdeen need to be playing at this level. Hopefully, they’ll get a draw the fans can really enjoy.” This Aberdeen team got direct entry to the group stage where Nicholson’s team had to battle through a qualifier against Dnipro, where Darren Mackie scored his famous goal. Robson’s side is waiting to see who they could face in the first qualifier with Lugano and the winners of Olympiakos or Slavia Prague amongst the options. Nicholson recalled: “We just had the two ties of Dnipro and if we had lost we would have been out. Aberdeen go into the play-off round and Conference League group stages even if they lose, which is great. “We’ve seen how West Ham have done in that tournament this season. It would be a big thing to get into the group stages of either competition. “There should be some great ties and it will be brilliant for Aberdeen. Fingers crossed, though, they get through the first play-off because the Europa League is the bigger one.” The group stages are where things really lit up for Nicholson and the Dons. They faced the likes of Atletico Madrid, Panathinaikos, Copenhagen and Lokomotiv Moscow. Barry Nicholson (right) in action against Bayern Munich in 2008 (Image: PA Wire) The Fleetwood youth coach claimed: “Panathinaikos game was the first one. We actually played quite well. We got beat 3-0 but we played well. “We had a good chance to make it 1-1 but we never took it. We drew with Lokomotiv Moscow. They had Branislav Ivanovic, who went to Chelsea, and Diniyar Bilyaletdinov, who signed for Everton. “The Atletico Madrid game, Jimmy wanted us to keep the crowd quiet for 20 minutes –they hit the post after 14 seconds! I sat on the bench because I was ill on the flight and then on the hotel. We had to beat Copenhagen at home to qualify, which we did. We managed to qualify with four points because the top three went through.” Dons went into the knockout stage where they drew Bayern. They drew 2-2 at Pittodrie before the Germans brought out the big guns and blasted them away at the Allianz Arena. Nicholson said: “They had some calibre of player. They scored, we got 2-1 ahead, then they levelled. Everybody was shocked that we had drawn the game and given ourselves a chance over there. “They brought Lukas Podolski in from the start and Mark Van Bommell and Oliver Kahn returned for the second leg. We played really well, it was 0-0 after 20 minutes but we quickly found ourselves 2-0 down and that killed the tie. “It was amazing, training and playing at the Allianz. Games like that you never forget. Brilliant nights to play in. When Pittodrie is rocking it really is some place to play READ NEXT: Read More Related Articles Barry Robson reveals Aberdeen transfer strategy and how he will look to cut down loan market reliance Read More Related Articles Aberdeen path Europa League playoff revealed as swerving 2 heavy hitters sets up dream qualifying route Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Aberdeen FC Scottish Premiership Europa Conference League Europa League Barry Robson","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article27572327.ece/ALTERNATES/s615/1_JS272857629.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lee Johnson making Hibs transfer push for Will Fish and CJ Egan-Riley as he aims to 'trim fat' from squad","link":"https://www.dailyrecord.co.uk/sport/football/lee-johnson-making-hibs-transfer-30179245","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Fraser Wilson)"],"video_url":null,"description":"The Hibees boss was impressed by their impacts and wants them back for a tilt in Europe.","content":"Will Fish × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Lee Johnson admits securing new loan deals for Will Fish and CJ Egan-Riley would ease the pressure on Hibs ’ summer shopping. Manchester United defender Fish was a huge success after stepping into the void to replace Ryan Porteous. But the Easter Road club could face competition from Aberdeen to land the 20-year-old, who played 21 games while on loan. Likewise Burnley utility man Egan-Riley added steel to the midfield and backline after joining in January. Neither player had an option to buy inserted in their deal but Johnson is pushing to get both back for the new campaign. The Hibs boss brought in 20 players across two windows in the season just gone but he’ll look to “trim the fat” in this one. Asked if he expects a big turnaround this summer, Johnson said: “A lot of that will be dictated by the loans. I’d love to have Will and CJ back, as an example. They’re not our only loans but while I remember a media report suggesting we had too many loans, with some of these guys we have an option to turn it into a permanent and some we haven’t. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Next Celtic manager hunt LIVE as Kieran McKenna's shared trait with Neil Warnock explained \"That comes into play. I’d like to keep the stability, trim the fat and use the finances well to recruit quality. I’d rather lower the numbers and have higher quality. \"Then obviously if we’ve got good young players to supplement the squad or we can rotate the loans, bring them back and one of them breaks through, we’re all laughing. I’d much rather have a smaller squad because it means there are fewer problems for me! \"I like an environment where everybody feels like they have a carrot at the end of the week.” Johnson came in just over 12 months ago, taking a side that had finished eighth to a fifth – and Europe – this term. He added: “If you remember when I walked through the door, we had seven on the injury bed and a lot were key players. A lot of the understudies, or perceived understudies, were actually starting. “You talk about having your money on the pitch but a lot of those players were injured. That left a slightly over-inflated squad, particularly with the narrative that the season before there maybe wasn’t enough depth. Hibernian's CJ Egan-Riley “We were almost slightly diluted in terms of quality but we had the depth. That’s fine if everyone’s fit but if they’re not, you’re playing the players who ideally are trying to take the place of the ones who are ready-made and that’s where you need a bit of luck. \"Generally when we’ve had that settled 11, we have performed well. And if you look back at when I’ve changed the team and when I haven’t, I’d love to pick a team on day one and hardly have to change it until the end of the season, then build and build and build again. “However, clubs like Hibs have their place in the food chain, so we have to wait or we have to be calm, or we have to convince, or we have to pay more. And all those things come into it to try to achieve these loans again. “In an ideal world I’d love to keep this core strong and then add quality – not numeracy – in and around the key areas where we think we need additions for the first team. “There will be a lot of interest in our players both in terms of the fringe players, or the ones who perhaps haven’t had as many minutes as they might have hoped, but also the stars.” Read More Related Articles Jota pays emotional Celtic tribute to Ange Postecoglou as Tottenham boss leaves 'forever grateful' winger gutted Read More Related Articles Watch West Ham and Fiorentina fans clash in chaotic Europa Conference League final scenes Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Hibernian FC Transfer Talk Scottish Premiership Lee Johnson","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30179292.ece/ALTERNATES/s615/0_JS298917046.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Motherwell hero Tommy McLean 'one of most important figures' in club's history as stand tribute unveiled","link":"https://www.dailyrecord.co.uk/sport/local-sport/motherwell-hero-tommy-mclean-one-30177135","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Andy McGilvray)"],"video_url":null,"description":"The club recently unveiled a lasting tribute to the legendary manager's impact at Fir Park","content":"Ex Motherwell players presented with a picture to mark the official naming of the Tommy McLean stand during a cinch Premiership match between Motherwell and Dundee United at Fir Park, on May 28, 2023, in Motherwell, Scotland. Pictured are (left to right): Brian Martin, Iain Ferguson, Well Society co-chair Douglas Dickie, Cammy Murray (Tommy McLean's representative), Bobby Russell, Chris McCart and Alex Burns. (Photo by Craig Foy / SNS Group) × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Motherwell officially unveiled the Tommy McLean Stand during their final Premiership game of the season. The South Stand was renamed during the 3-2 win over Dundee United, with new signage unveiled as players and staff who worked closely with McLean gathered to mark his significant contribution. Tommy, who famously guided Motherwell to the 1991 Scottish Cup against brother Jim’s Dundee United, couldn’t be in attendance. Read More Related Articles Motherwell to play in NL Cup as Airdrie look to retain pre-season trophy Read More Related Articles Motherwell boss Stuart Kettlewell aims to maintain momentum with short break before pre-season training But Chris McCart and Iain Ferguson of the 1991 Scottish Cup-winning side, and Brian Martin, Alex Burns and Bobby Russell, joined former coach Cammy Murray on the pitch to mark the occasion. Well Society co-chair Douglas Dickie handed over a framed photograph of the Tommy McLean stand to Murray, who worked alongside McLean, and represented him at Fir Park. Murray said: “Tommy made a tremendous contribution to the history of Motherwell FC. Tommy McLean is crowded by Well fans as he holds the cup aloft “He deserves to have his name in the fabric of Fir Park, alongside other great figures in the club’s history. “He couldn’t be here in person, but I know he is humbled at this gesture. “Tommy really is one of a kind. As a coach and being involved with him, I never came across anyone with the knowledge he had. “He had this great ability to change things in the game, and he gave the fans a decade they will never forget.” More sports news from across Lanarkshire Neil: Accies 'a great breeding ground' Glencairn learn Junior Cup final date McRae's grandson goes for rally glory Celts 'as good as Euro final sides' Striker Steve Kirk hailed McLean as the “best coach and manager” he had ever worked under. Well Society members voted to rename the South Stand after McLean in 2021, the same year he was inducted to the club’s Hall of Fame. McLean brought outstanding players like Davie Cooper to Fir Park and worked wonders for the club to benefit financially from deals. Cooper is unveiled alongside Well manager Tommy McLean Douglas Dickie said: “Tommy brokered the record deal for Phil O’Donnell, which allowed the club, at that time, to go forward with the stadium’s South Stand – and it’s absolutely apt that now it Is named in tribute to him. “I am delighted that the club – and the fans – were able to celebrate his impact together at the weekend. “We will share pictures and footage from the day with Tommy, to remind him how much he means to the club.” McLean’s first feat as manager was to steer the club back to top-flight football in 1985. Dickie added: “Tommy is one of the most important figures in Motherwell’s 137-year existence, and certainly the most influential in our recent history.” Read More Related Articles Derby County, Kilmarnock and Clyde hero Craig Bryson lands role with hometown team East Kilbride Read More Related Articles Airdrie announce new chairman as Sir Alex Ferguson's brother steps down from role All the latest sport news in Lanarkshire EK 'sleeping giants' says new boss Rovers staying up would mean the world Gemmell hangs up his boots Retired ref Madden on 'Gers fan' claims Follow Lanarkshire Live Sport on Twitter via @LanLiveSport , like us on Facebook or find us on Instagram for the latest sports news, pictures and video. Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Lanarkshire Sport Motherwell FC Motherwell Facebook Twitter William Hill Scottish Cup Social media","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30177144.ece/ALTERNATES/s615/0_JS301572412.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Enzo Maresca holds Celtic continuity key and big names don't matter if you've got coaching chops - Chris Sutton","link":"https://www.dailyrecord.co.uk/sport/football/football-news/enzo-maresca-holds-celtic-continuity-30177958","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Chris Sutton)"],"video_url":null,"description":"Sutty also ruled out a Brendan Rodgers return and can't see Celtic bumping John Kennedy up to the top job.","content":"Pep Guardiola and Enzo Maresca × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Continuity is key. Celtic have built themselves into a brilliant position and there is no reason to go pulling it apart. What is needed for the manager’s job is not someone to come in and basically start again as Ange Postecoglou had to do. They need someone to continue his good work. Someone who has the same philosophies and ideals, plays the same way and can deal with a mixture of cultures. Celtic went to the City Football Group to get Postecoglou. People scoffed about it. Scoffed about his appointment and they were wrong. So, for my money, it would make a lot of sense to go down the same route. CFG are a footballing power in their own right. Postecoglou went into Celtic and adopted the style of football used by Pep Guardiola with the inverted full-backs, the high press and the fast-paced approach. With that in mind, I can see a lot of reasons why Enzo Maresca would appeal as a viable candidate. He is, after all, Guardiola ’s assistant. Read More Related Articles Dermot Desmond refuses to rush Celtic next manager anointing as Brendan Rodgers also works out next move Read More Related Articles Next Celtic manager hunt LIVE as John Kennedy won't be allowed to follow Ange without a fight Now let’s get the cards on the table right away. I don’t know the guy at all. I’ve no idea whether he could handle the environment in Glasgow, or whether he’s cut out to be a manager in his own right having not done so well in his last attempt at Parma. But the fact Guardiola got him back into the fold to be his assistant after the job in Italy didn’t work out for him suggests he rates him. And let’s face it, if Pep phones you up and says he’s got a guy who’s pretty damn good at coaching players, you are going to listen. I read somewhere that Guardiola said he is going to make an extraordinary manager in his own right like Mikel Arteta. Guardiola got it right with him. He went from being his assistant to making his major mark at Arsenal. No one came closer to taking the Premier League title off this season and that says a lot given the state of the Gunners when he took charge. I’m not standing here saying appoint Maresca. What I am saying is that continuity is important and finding someone who can slot into the system and into the squad of players and their playing style is maybe just all Celtic need at the moment. He might be that. Of course, there are other excellent candidates. Graham Potter has to be under consideration. He had a tough time of it at Chelsea, but that was not an easy situation to go into. Looking back beyond the period at Stamford Bridge and his work with Brighton would mirror in some respects the job Eddie Howe had done just along the south coast at Bournemouth. Better, in fact. It was clear Celtic were attracted to that given the fact they wanted the Newcastle manager before being rejected and they went down the Postecoglou road. Graham Potter Kjetil Knutsen of Bodo/Glimt is, of course, well known to the Celtic fans given the way his team hammered Postecoglou’s outfit in the knockout stages of the Conference League a couple of seasons ago. Now doubt the Norwegian did a spectacular job with that team, but they didn’t win the last title after he lost players. Two men I would be ruling out of running immediately are Brendan Rodgers and John Kennedy. Rodgers is just simply not an option, surely. Brendan was a brilliant Celtic manager, but the way he left was just too much for some fans to stomach and I sense it may create a difficult environment between stands and technical area if he were to come back. I might be wrong, but I can’t see it. Kennedy was another I considered, but I’m not sure that is the route Celtic will go down. He has done the job before, mind you. And he certainly knows every single detail about the cub because he’s worked there, successfully, for so long. One thing I will say about this whole situation is the stuff about a big-name really hacks me off. What the hell is a big name and why does it matter? Spurs fans were miffed when Mauricio Pochettino got the job and said he was an underwhelming appointment. Next time he was a hero having taken them close to a title and a Champions League Final. Those same agitators were falling over themselves when Jose Mourinho and Antonio Conte got the job and ended up bored rigid with their football. Ange Postecoglou Be honest, not many folk who aren’t students of the European game had heard of Roberto De Zerbi when he walked into Brighton and now people have him down as the game’s next gift. Quite right, he’s doing a brilliant job. The name is irrelevant, it’s what he can bring to the table that matters. We could see from day one that Postecoglou had the tools to deliver. He had the coaching credentials and managerial nous in the bag as well. It was just that some people didn’t look hard enough to find it. That’s important and where a Potter, for example, would have far more clout than say a Maresca and be better suited. Postecoglou did a superb job and he’s big boots to fill. It’s a huge honour to manage Celtic, but also a big challenge. You’ll need courage to take it because fans want the next step and that is progress in the Champions League as well as continuing to dominate Rangers. I just feel Celtic has the squad in place. Some will leave, but the nucleus is there and the playing style is proven. Ripping it up is not necessary. It’s finding the individual who can slot seamlessly into what’s already there which is necessary. READ NEXT: Read More Related Articles Callum McGregor tells new Celtic boss there's no time to adapt as captain backed to lead club through uncertain waters Read More Related Articles Ole Gunnar Solskjaer tells Celtic Kieran McKenna comes with 'no bull****' bonus and boss target is defence genius Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Enzo Maresca Pep Guardiola Ange Postecoglou Celtic FC Manchester City FC Tottenham Hotspur FC Champions League Scottish Premiership","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30178014.ece/ALTERNATES/s615/0_GettyImages-1408501620.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Callum McGregor tells new Celtic boss there's no time to adapt as captain backed to lead club through uncertain waters","link":"https://www.dailyrecord.co.uk/sport/football/callum-mcgregor-tells-new-celtic-30178919","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Craig Swan)"],"video_url":null,"description":"The captain said previously that whoever is in charge, there is little time for adaptation.","content":"(Image: PA) × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Callum McGregor faced an enormous challenge two years ago. This summer, it’s threatening to be an even bigger task. Captain McGregor could almost end up being the most important person in the entire football department when Celtic regroup for pre-season. When Ange Postecoglou walked into the club, he had to instill a brand-new philosophy. Any new boss needs his senior players to drive home their messages and keep the group on track. With a clearout coming, McGregor was among the few who were staying. Taking the armband from talisman Scott Brown , he was the new leader. Postecoglou spoke openly about the vital importance of his on-pitch lieutenant during the critical opening stages of his Celtic life as he delivered. McGregor, at least, had the back-up of familiar faces such as No.2 John Kennedy and coach Gavin Strachan. But with Postecoglou having targeted that duo to join him at Tottenham, it could be an entire coaching unit which is changing and not just the top man. If that’s the case, McGregor, with assistance of others such as Joe Hart, will have to rapidly bond it all together. Smooth another transition and infuse a whole new set of ideas into a squad by leading impressively again from the front. Read More Related Articles Next Celtic manager hunt LIVE as Martin O'Neill tells Brendan Rodgers how to win Parkhead fans back Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Postecoglou had the bonus of a club legend in McGregor to help that process. Now the new guy will need him just as much. Maybe even more so. When Postecoglou was still trying to implement his changes results didn’t come instantly but the skipper didn’t flinch. Back then McGregor stated: “A lot of new players are coming together and we have to make that bedding in period as quick as possible. It’s important that we don’t go into our shell and start to panic a little bit. We know where we want to get to. It requires hard work, concentration and bravery. “There is always a panic button moment and everybody jumps on it. We can’t lose focus. The only way we are going to get better and progress is if we stay calm and listen to the manager and continue to build on the performance. “The manager had to adapt. But you don’t get time to adapt at Celtic. You have to win.” McGregor led the process. By the time Postecoglou got on his flight bound for North London, he’d lifted five trophies out of six. Such was the enormity of the rebuild at Celtic two years ago, the Aussie was working mostly with his own signings within only a couple of months. Unlike Postecoglou, though, the next gaffer is not going to have a dressing room which is full of his own men. The Spurs boss has left behind a dressing-room full of individuals ensconced into his playing style. If the new guy wants to change that philosophy he’ll have do it quickly and he’ll need his McGregor to lead it. Paul Lambert has been there. He’s been a Celtic captain. He’s seen big changes. From Wim Jansen, to Dr Jozef Venglos, to John Barnes, to Kenny Dalglish, to Martin O’Neill. Lambert, now 53, knows the responsibility that will sit upon McGregor, 29, when the new boss arrives and is adamant there is no-one better to help facilitate the imminent change. He insisted: “Callum really knows the club inside out and he says all of the right things at the right times. He talks about the club having to win regardless of who is in charge and who is actually playing there. “It seems a good group of guys there now who know the pitfalls of when a manager does well or doesn’t that he’ll move either way. I heard Callum’s interviews after the game last weekend [Scottish Cup Final] and he knows that you don’t get time to enjoy success because, before you know it, it is on you again. “That’s the great thing about Callum, he will know that whatever happens and whoever is in charge, you need to get started quickly. That’s the nature of the game at a big club. (Image: SNS Group) \"The demand is: Well, whoever comes in, we help the new manager and we go and try to win games. You have to grab that really quickly as a Celtic player and the manager will know himself he needs to. “The good thing is the new manager will be going into a club which is really strong structure-wise. Whoever goes in there is not going into somewhere that is in disarray. The club is in a really good place. “Celtic are also in a good position to strengthen their first-team squad, so whoever gets the job, I think they will be grateful due to the size of the club and the players that are already there. “As I said, Callum knows all of that. You don’t get that time to win, so whether you are a manager or a player, it has to happen.” Read More Related Articles Jota pays emotional Celtic tribute to Ange Postecoglou as Tottenham boss leaves 'forever grateful' winger gutted Read More Related Articles Watch West Ham and Fiorentina fans clash in chaotic Europa Conference League final scenes Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Paul Lambert Scott Brown Celtic FC Callum McGregor Scottish Premiership","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30093471.ece/ALTERNATES/s615/0_Celtic-v-Aberdeen-cinch-Premiership-Celtic-Park.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Transferts : Le PSG vise du lourd, il a déjà dit oui à Mbappé","link":"https://le10sport.com/football/mercato/transferts-le-psg-vise-du-lourd-il-a-deja-dit-oui-a-mbappe-648927","keywords":null,"creator":null,"video_url":null,"description":"Après Milan Skriniar, Marco Asensio et Manuel Ugarte, une quatrième recrue pourrait débarquer au PSG dans les prochains jours. Il s'agirait de Marcus Thuram, en fin de contrat avec le…","content":"Après Milan Skriniar, Marco Asensio et Manuel Ugarte, une quatrième recrue pourrait débarquer au PSG dans les prochains jours. Il s'agirait de Marcus Thuram, en fin de contrat avec le Borussia Mönchengladbach. L'international française ne resterait pas insensible à cet intérêt et ne cacherait pas son envie d'évoluer en club aux côtés de Kylian Mbappé. Le PSG frappe fort en ce début du mois de juin. Le mercato estival n'ouvrira ses portes que dans quelques heures, mais trois transferts auraient été bouclés. Marco Asensio et Manuel Ugarte ont déjà passé leur visite médicale et devraient être les premières recrues parisiennes. Ils devraient être accompagnés de Milan Skriniar , qui a signé un pré-contrat avec le PSG en janvier dernier. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY Le Parisien pense connaître l'identité de la quatrième recrue du PSG . Il pourrait s'agir de Marcus Thuram, dont le départ du Borussia Mönchengladbach est acté depuis plusieurs mois. Le buteur français est tenté par un départ dans la capitale française et ne cache pas son envie de jouer avec Kylian Mbappé. Ce dossier pourrait connaître quelques avancées dans les prochains jours. A en croire le journaliste Fabrizio Romano, les deux parties auraient prévu de se rencontrer dans les prochains jours pour finaliser l'opération. A noter que son frère, Khéphren Thuram (OGC Nice) serait aussi dans la short-list du PSG.","pubDate":"2023-06-08 04:45:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225671.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"L’OL racheté par Benzema, un scénario surréaliste est annoncé","link":"https://le10sport.com/football/mercato/lol-rachete-par-benzema-un-scenario-surrealiste-est-annonce-648928","keywords":null,"creator":null,"video_url":null,"description":"Alors qu'il avait envisagé de prendre sa retraite au Real Madrid, Karim Benzema a décidé de filer à Al-Ittihad, en Arabie Saoudite. Le club saoudien lui a fait un pont d'or. L'ancien international…","content":"Alors qu'il avait envisagé de prendre sa retraite au Real Madrid, Karim Benzema a décidé de filer à Al-Ittihad, en Arabie Saoudite. Le club saoudien lui a fait un pont d'or. L'ancien international français, qui a signé pour trois ans, touchera environ 200M€ par an. Un joli pactole, qui pourrait lui donner les moyens de racheter une formation européenne comme l'a souligné Jean-Baptiste Guégan. « J’ai eu la chance d’accomplir des choses extraordinaires dans ma carrière et de réaliser tout ce que je pouvais en Espagne et en Europe. Je pense que le moment est venu de relever un nouveau défi ». C'est fait, Karim Benzema a fait ses adieux au Real Madrid avant de filer à Al-Ittihad. Pour l'attirer, le club saoudien lui a proposé un salaire de 200M€ par an. A défaut de lui promettre un championnat compétitif, l 'Arabie Saoudite peut lui promettre de remplir son compte en banque. Pour Jean-Baptiste Guégan , ces sommes sont ahurissantes. Benzema prend le jackpot et s'enflamme pour son transfert https://t.co/vHpZvfzFE5 pic.twitter.com/kSK6HDsP0m « Quand tu vois les contrats, les joueurs ne vont pas se dire je vais être riche, mais, je vais pouvoir arriver à un niveau d'investissement que je n'aurais jamais pu atteindre, comme David Beckham. Ils pourront ainsi acheter des clubs » a confié le spécialiste et professeur en géopolitique du sport dans les colonnes de L'Equipe . A terme, Benzema pourrait avoir les capacités de racheter une grande équipe européenne, comme l' OL , son club formateur. « Par exemple, Benzema pourrait clairement aller à Lyon et racheter le club à John Textor, ce qu'il n'aurait pas pu faire après 14 saisons au Real. C'est ce qui s'est passé avec David Beckham, quand il est entré dans la MLS avec des fonds qatariens. Il s'offre la possibilité d'entrer dans un groupe très restreint de gens qui peuvent construire une entité sportive et racheter entièrement, et pas se contenter d'un rôle minoritaire. Nous, on ne le voit pas ça » a lâché Guégan .","pubDate":"2023-06-08 04:30:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225873.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"PSG : La femme de Messi a tranché pour son prochain club, c’est une surprise","link":"https://le10sport.com/football/mercato/psg-la-femme-de-messi-a-tranche-pour-son-prochain-club-cest-une-surprise-648925","keywords":null,"creator":null,"video_url":null,"description":"Quelle sera la prochaine équipe de Lionel Messi ? Certainement pas le PSG, qui n'a pas réussi à le prolonger. Trois options sont sur la table de l'international argentin, mais aucune ne ferait…","content":"Quelle sera la prochaine équipe de Lionel Messi ? Certainement pas le PSG, qui n'a pas réussi à le prolonger. Trois options sont sur la table de l'international argentin, mais aucune ne ferait l'unanimité. Sa femme aurait une préférence pour les Etats-Unis, tandis que son père ne verrait pas d'un mauvais œil un départ en Arabie Saoudite. La famille de Lionel Messi se déchire. Les proches du champion du monde n'hésitent pas à le conseiller au sujet de son prochain club. Cela fait bien longtemps que le PSG n'est plus une option. En réalité, trois pistes sont sur la table, et l'une d'entre elles ne cesse de prendre de l'épaisseur. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY A en croire plusieurs médias, l 'Inter Miami aurait fait un percée dans ce dossier. Aujourd'hui, la franchise américaine est en pole position dans ce dossier, bien devant le FC Barcelone. Selon le journaliste Joan Fontes , la femme de Messi pousserait pour rejoindre les Etats-Unis. Ce ne serait pas l'avis de Jorge Messi, le père de l'international argentin. A en croire le journaliste catalan, il verrait, plutôt, d'un bon œil un départ en Arabie Saoudite. Le club d' Al-Hilal lui proposerait un salaire record de 600M€. De quoi faire réfléchir...","pubDate":"2023-06-08 04:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225701.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"How Grimsby Town's squad compares to rest of League Two and key decisions to be made","link":"https://www.grimsbytelegraph.co.uk/sport/football/how-grimsby-towns-squad-compares-8503783","keywords":["Sport"],"creator":["newsdesk@grimsbytelegraph.co.uk (Sam Allen)"],"video_url":null,"description":"Town had one of the younger squads in the division last season","content":"There could be noticeable differences to how Grimsby Town’s squad stacks up to the rest of League Two next season compared to how it did last term as the club develops its recruitment strategy. The term “squad composition” was used frequently by Town’s newest board member Gareth Jennings in a recent interview about his role at the club, which could mean a variety of things in terms of what features of each player it refers to. We are yet to see the Mariners’ recruitment plan spring into action as of yet with plenty of time still to go to recruit players, but looking at the key facts about Town’s squad in the 22/23 season we can analyse the things that may change or stay the same. Paul Hurst used 32 players across the season which put Grimsby in the middle of the road compared to the rest of the league, AFC Wimbledon used the most (38) and interestingly, the eventual champions Leyton Orient used the fewest players (26). In fact, all four teams that were promoted ended up using fewer players than Town, which potentially highlights the benefits of running with a tighter group. On the other hand, other factors have to be considered such as the amount of games the Mariners played in all competitions and the importance of having a deep squad to cope with that. In terms of the average age of those players, Town had one of the younger squads in the division at 25.7 years of age, with only eight clubs running with a more youthful group last season. Clubs like Mansfield Town valued experience more than youth with the stags operating with the oldest squad on average (28.4) and having that experience worked well for the likes of Stevenage who had the third oldest team (27.4). Read more: Cleethorpes Town confirm James McKeown decision as Grimsby Town legend set to play on With age, there is likely greater value in having a even balance of young players with potential for growth and others that have been around longer and have a good understanding of what a team needs to be successful. Hurst has always placed great value on being able to develop young talent as a manager so will continue to place trust in those types of players but they need to be surrounded by experience to help them through. With that in mind, Town’s squad was one of the least experienced in the league in terms of appearances with an average of just under 51 total League Two appearances per player. Stevenage were promoted this term and had the most fourth tier experience in their squad with 119.75 average appearances per player. Hurst often spoke of the value of spreading the goals around the team in place of relying on one primary goalscorer, and that was the way his team operated last term with the joint most individual goalscorers across the year (18). The task now will be to increase the overall goal output of the team, because chase conversion was an issue for the team at points. At the same time, Town outperformed the expectation of the team based on where they placed in League Two for market value of their squad compared to where they actually finished. According to TransferMarkt’s estimations. Grimsby had one of the lower valued squads but finished nine places above where they ranked for the overall estimated price of their team. In the end, if Town can stick to a shrewd approach and still get results then there is no reason to deviate from that path. Read more: Grimsby Town will take holistic approach to signings as Paul Hurst closes in on deals Read more: Grimsby Town pre-season schedule in full including Hull City and Lincoln City games Read more: Niall Maher has shown Paul Hurst the key role he can play for Grimsby Town","pubDate":"2023-06-08 04:00:00","image_url":"https://i2-prod.grimsbytelegraph.co.uk/incoming/article8396243.ece/ALTERNATES/s615/0_Bradford-v-GrimsbySky-Bet-EFL-League-Two.jpg","source_id":"grimsbytetelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Surprise au PSG, Mbappé répond au Real Madrid pour son transfert","link":"https://le10sport.com/football/mercato/surprise-au-psg-mbappe-repond-au-real-madrid-pour-son-transfert-648926","keywords":null,"creator":null,"video_url":null,"description":"A plusieurs reprises ces derniers jours, Kylian Mbappé a assuré qu'il serait un joueur du PSG la saison prochaine. Ce qui n'empêche pas certains journalistes espagnoles de le questionner sur un…","content":"A plusieurs reprises ces derniers jours, Kylian Mbappé a assuré qu'il serait un joueur du PSG la saison prochaine. Ce qui n'empêche pas certains journalistes espagnoles de le questionner sur un possible transfert au Real Madrid. Récemment, l'un d'entre eux, José Alvarez a tenté sa chance et a, finalement, obtenu une réponse de la part de la star française. Lié au PSG jusqu'en 2024, Kylian Mbappé n'a pas l'intention d'aller voir ailleurs. Le joueur français l'avait annoncé dès le mois d'avril au micro de France 3. « Le prochain palier ? Gagner la Ligue des champions, je pense. J’ai déjà fait une finale, demi-finale, quart de finale, huitième de finale… J’ai tout fait sauf gagner (sourire). Il ne me manque que ça. j’espère que ça sera le plus rapidement possible. Où ? Au Paris Saint-Germain. Je suis Parisien et sous contrat. Donc c’est le Paris Saint-Germain » avait lâché Mbappé lors de l'émission Tout le Sport. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY Sacré, depuis, meilleur joueur de la saison en Ligue 1, Kylian Mbappé en a remis une couche lors de la cérémonie des trophées UNFP. « Mon avenir ? L'année prochaine, je jouerai au Paris Saint-Germain, j'ai encore un contrat, je vais honorer mon contrat » a-t-il lâché, après avoir pourtant rembarré un journaliste espagnol, qui l'avait questionné sur un possible transfert au Real Madrid. « Je suis là pour parler du trophée. Le reste ne m’intéresse pas » a lâché le champion du monde 2018 à José Alvarez, travaillant pour l'émission El Chiringuito . Mais la réponse de Mbappé ne l'a pas découragé, bien au contraire. Présent au Grand Prix de Catalogne dimanche dernier, José Alvarez est tombé nez à nez avec Kylian Mbappé, présent lors de cet évènement aux côtés de Neymar. Le journaliste l'a questionné, à nouveau, sur son avenir au PSG . Cette fois-ci, Mbappé ne l'a pas laissé sans réponse. « Le Real Madrid ? Il y a le temps » a-t-il confié selon José Alvarez.","pubDate":"2023-06-08 04:00:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225742.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"Barry Robson has landed Aberdeen Euro jackpot but rookie boss told to hit two more Pittodrie objectives","link":"https://www.dailyrecord.co.uk/sport/football/football-news/barry-robson-landed-aberdeen-euro-30179347","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"Barry Nicholson was part of the Dons squad that qualified from the UEFA Cup group stage and faced the mighty Bayern Munich.","content":"Fleetwood manager Scott Brown (R) and coaches Steven Whittaker and Barry Nicholson × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Aberdeen landed the £5million jackpot by finishing third – but Barry Nicholson knows there’s memories money can’t buy ahead in Europe. Dons were left celebrating at the weekend, as Celtic lifted the Scottish Cup and ensured they went into the play-off round of the Europa League. If they get through that they go into the group sections and if they lose they fall into the same stage of the Europa Conference League , guaranteed games until Christmas. Nicholson was part of the last Aberdeen squad that last made the group stages 16 years ago. Jimmy Calderwood’s side not only got through their group but caused Bayern Munich a brief scare in the knockout stage. Nicholson admitted: “It will be amazing. It’s what Aberdeen is all about. They need to be constantly pushing for those European places, cup finals and trophies. I know from being up there, those are the demands. Barry has done absolutely brilliantly to get Aberdeen into this situation. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Dave Cormack in brutal Hearts troll as he bites back at Andrew McKinlay with 'season ticket league' putdown “Going away to some of the places we did on that European run was amazing. The fans had some great trips away and we all really enjoyed it because you are playing against top players and top clubs. Aberdeen need to be playing at this level. Hopefully, they’ll get a draw the fans can really enjoy.” This Aberdeen team got direct entry to the group stage where Nicholson’s team had to battle through a qualifier against Dnipro, where Darren Mackie scored his famous goal. Robson’s side is waiting to see who they could face in the first qualifier with Lugano and the winners of Olympiakos or Slavia Prague amongst the options. Nicholson recalled: “We just had the two ties of Dnipro and if we had lost we would have been out. Aberdeen go into the play-off round and Conference League group stages even if they lose, which is great. “We’ve seen how West Ham have done in that tournament this season. It would be a big thing to get into the group stages of either competition. “There should be some great ties and it will be brilliant for Aberdeen. Fingers crossed, though, they get through the first play-off because the Europa League is the bigger one.” The group stages are where things really lit up for Nicholson and the Dons. They faced the likes of Atletico Madrid, Panathinaikos, Copenhagen and Lokomotiv Moscow. Barry Nicholson (right) in action against Bayern Munich in 2008 (Image: PA Wire) The Fleetwood youth coach claimed: “Panathinaikos game was the first one. We actually played quite well. We got beat 3-0 but we played well. “We had a good chance to make it 1-1 but we never took it. We drew with Lokomotiv Moscow. They had Branislav Ivanovic, who went to Chelsea, and Diniyar Bilyaletdinov, who signed for Everton. “The Atletico Madrid game, Jimmy wanted us to keep the crowd quiet for 20 minutes –they hit the post after 14 seconds! I sat on the bench because I was ill on the flight and then on the hotel. We had to beat Copenhagen at home to qualify, which we did. We managed to qualify with four points because the top three went through.” Dons went into the knockout stage where they drew Bayern. They drew 2-2 at Pittodrie before the Germans brought out the big guns and blasted them away at the Allianz Arena. Nicholson said: “They had some calibre of player. They scored, we got 2-1 ahead, then they levelled. Everybody was shocked that we had drawn the game and given ourselves a chance over there. “They brought Lukas Podolski in from the start and Mark Van Bommell and Oliver Kahn returned for the second leg. We played really well, it was 0-0 after 20 minutes but we quickly found ourselves 2-0 down and that killed the tie. “It was amazing, training and playing at the Allianz. Games like that you never forget. Brilliant nights to play in. When Pittodrie is rocking it really is some place to play READ NEXT: Read More Related Articles Barry Robson reveals Aberdeen transfer strategy and how he will look to cut down loan market reliance Read More Related Articles Aberdeen path Europa League playoff revealed as swerving 2 heavy hitters sets up dream qualifying route Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Aberdeen FC Scottish Premiership Europa Conference League Europa League Barry Robson","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article27572327.ece/ALTERNATES/s615/1_JS272857629.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lee Johnson making Hibs transfer push for Will Fish and CJ Egan-Riley as he aims to 'trim fat' from squad","link":"https://www.dailyrecord.co.uk/sport/football/lee-johnson-making-hibs-transfer-30179245","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Fraser Wilson)"],"video_url":null,"description":"The Hibees boss was impressed by their impacts and wants them back for a tilt in Europe.","content":"Will Fish × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Lee Johnson admits securing new loan deals for Will Fish and CJ Egan-Riley would ease the pressure on Hibs ’ summer shopping. Manchester United defender Fish was a huge success after stepping into the void to replace Ryan Porteous. But the Easter Road club could face competition from Aberdeen to land the 20-year-old, who played 21 games while on loan. Likewise Burnley utility man Egan-Riley added steel to the midfield and backline after joining in January. Neither player had an option to buy inserted in their deal but Johnson is pushing to get both back for the new campaign. The Hibs boss brought in 20 players across two windows in the season just gone but he’ll look to “trim the fat” in this one. Asked if he expects a big turnaround this summer, Johnson said: “A lot of that will be dictated by the loans. I’d love to have Will and CJ back, as an example. They’re not our only loans but while I remember a media report suggesting we had too many loans, with some of these guys we have an option to turn it into a permanent and some we haven’t. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Next Celtic manager hunt LIVE as Kieran McKenna's shared trait with Neil Warnock explained \"That comes into play. I’d like to keep the stability, trim the fat and use the finances well to recruit quality. I’d rather lower the numbers and have higher quality. \"Then obviously if we’ve got good young players to supplement the squad or we can rotate the loans, bring them back and one of them breaks through, we’re all laughing. I’d much rather have a smaller squad because it means there are fewer problems for me! \"I like an environment where everybody feels like they have a carrot at the end of the week.” Johnson came in just over 12 months ago, taking a side that had finished eighth to a fifth – and Europe – this term. He added: “If you remember when I walked through the door, we had seven on the injury bed and a lot were key players. A lot of the understudies, or perceived understudies, were actually starting. “You talk about having your money on the pitch but a lot of those players were injured. That left a slightly over-inflated squad, particularly with the narrative that the season before there maybe wasn’t enough depth. Hibernian's CJ Egan-Riley “We were almost slightly diluted in terms of quality but we had the depth. That’s fine if everyone’s fit but if they’re not, you’re playing the players who ideally are trying to take the place of the ones who are ready-made and that’s where you need a bit of luck. \"Generally when we’ve had that settled 11, we have performed well. And if you look back at when I’ve changed the team and when I haven’t, I’d love to pick a team on day one and hardly have to change it until the end of the season, then build and build and build again. “However, clubs like Hibs have their place in the food chain, so we have to wait or we have to be calm, or we have to convince, or we have to pay more. And all those things come into it to try to achieve these loans again. “In an ideal world I’d love to keep this core strong and then add quality – not numeracy – in and around the key areas where we think we need additions for the first team. “There will be a lot of interest in our players both in terms of the fringe players, or the ones who perhaps haven’t had as many minutes as they might have hoped, but also the stars.” Read More Related Articles Jota pays emotional Celtic tribute to Ange Postecoglou as Tottenham boss leaves 'forever grateful' winger gutted Read More Related Articles Watch West Ham and Fiorentina fans clash in chaotic Europa Conference League final scenes Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Hibernian FC Transfer Talk Scottish Premiership Lee Johnson","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30179292.ece/ALTERNATES/s615/0_JS298917046.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Motherwell hero Tommy McLean 'one of most important figures' in club's history as stand tribute unveiled","link":"https://www.dailyrecord.co.uk/sport/local-sport/motherwell-hero-tommy-mclean-one-30177135","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Andy McGilvray)"],"video_url":null,"description":"The club recently unveiled a lasting tribute to the legendary manager's impact at Fir Park","content":"Ex Motherwell players presented with a picture to mark the official naming of the Tommy McLean stand during a cinch Premiership match between Motherwell and Dundee United at Fir Park, on May 28, 2023, in Motherwell, Scotland. Pictured are (left to right): Brian Martin, Iain Ferguson, Well Society co-chair Douglas Dickie, Cammy Murray (Tommy McLean's representative), Bobby Russell, Chris McCart and Alex Burns. (Photo by Craig Foy / SNS Group) × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Motherwell officially unveiled the Tommy McLean Stand during their final Premiership game of the season. The South Stand was renamed during the 3-2 win over Dundee United, with new signage unveiled as players and staff who worked closely with McLean gathered to mark his significant contribution. Tommy, who famously guided Motherwell to the 1991 Scottish Cup against brother Jim’s Dundee United, couldn’t be in attendance. Read More Related Articles Motherwell to play in NL Cup as Airdrie look to retain pre-season trophy Read More Related Articles Motherwell boss Stuart Kettlewell aims to maintain momentum with short break before pre-season training But Chris McCart and Iain Ferguson of the 1991 Scottish Cup-winning side, and Brian Martin, Alex Burns and Bobby Russell, joined former coach Cammy Murray on the pitch to mark the occasion. Well Society co-chair Douglas Dickie handed over a framed photograph of the Tommy McLean stand to Murray, who worked alongside McLean, and represented him at Fir Park. Murray said: “Tommy made a tremendous contribution to the history of Motherwell FC. Tommy McLean is crowded by Well fans as he holds the cup aloft “He deserves to have his name in the fabric of Fir Park, alongside other great figures in the club’s history. “He couldn’t be here in person, but I know he is humbled at this gesture. “Tommy really is one of a kind. As a coach and being involved with him, I never came across anyone with the knowledge he had. “He had this great ability to change things in the game, and he gave the fans a decade they will never forget.” More sports news from across Lanarkshire Neil: Accies 'a great breeding ground' Glencairn learn Junior Cup final date McRae's grandson goes for rally glory Celts 'as good as Euro final sides' Striker Steve Kirk hailed McLean as the “best coach and manager” he had ever worked under. Well Society members voted to rename the South Stand after McLean in 2021, the same year he was inducted to the club’s Hall of Fame. McLean brought outstanding players like Davie Cooper to Fir Park and worked wonders for the club to benefit financially from deals. Cooper is unveiled alongside Well manager Tommy McLean Douglas Dickie said: “Tommy brokered the record deal for Phil O’Donnell, which allowed the club, at that time, to go forward with the stadium’s South Stand – and it’s absolutely apt that now it Is named in tribute to him. “I am delighted that the club – and the fans – were able to celebrate his impact together at the weekend. “We will share pictures and footage from the day with Tommy, to remind him how much he means to the club.” McLean’s first feat as manager was to steer the club back to top-flight football in 1985. Dickie added: “Tommy is one of the most important figures in Motherwell’s 137-year existence, and certainly the most influential in our recent history.” Read More Related Articles Derby County, Kilmarnock and Clyde hero Craig Bryson lands role with hometown team East Kilbride Read More Related Articles Airdrie announce new chairman as Sir Alex Ferguson's brother steps down from role All the latest sport news in Lanarkshire EK 'sleeping giants' says new boss Rovers staying up would mean the world Gemmell hangs up his boots Retired ref Madden on 'Gers fan' claims Follow Lanarkshire Live Sport on Twitter via @LanLiveSport , like us on Facebook or find us on Instagram for the latest sports news, pictures and video. Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Lanarkshire Sport Motherwell FC Motherwell Facebook Twitter William Hill Scottish Cup Social media","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30177144.ece/ALTERNATES/s615/0_JS301572412.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Enzo Maresca holds Celtic continuity key and big names don't matter if you've got coaching chops - Chris Sutton","link":"https://www.dailyrecord.co.uk/sport/football/football-news/enzo-maresca-holds-celtic-continuity-30177958","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Chris Sutton)"],"video_url":null,"description":"Sutty also ruled out a Brendan Rodgers return and can't see Celtic bumping John Kennedy up to the top job.","content":"Pep Guardiola and Enzo Maresca × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Continuity is key. Celtic have built themselves into a brilliant position and there is no reason to go pulling it apart. What is needed for the manager’s job is not someone to come in and basically start again as Ange Postecoglou had to do. They need someone to continue his good work. Someone who has the same philosophies and ideals, plays the same way and can deal with a mixture of cultures. Celtic went to the City Football Group to get Postecoglou. People scoffed about it. Scoffed about his appointment and they were wrong. So, for my money, it would make a lot of sense to go down the same route. CFG are a footballing power in their own right. Postecoglou went into Celtic and adopted the style of football used by Pep Guardiola with the inverted full-backs, the high press and the fast-paced approach. With that in mind, I can see a lot of reasons why Enzo Maresca would appeal as a viable candidate. He is, after all, Guardiola ’s assistant. Read More Related Articles Dermot Desmond refuses to rush Celtic next manager anointing as Brendan Rodgers also works out next move Read More Related Articles Next Celtic manager hunt LIVE as John Kennedy won't be allowed to follow Ange without a fight Now let’s get the cards on the table right away. I don’t know the guy at all. I’ve no idea whether he could handle the environment in Glasgow, or whether he’s cut out to be a manager in his own right having not done so well in his last attempt at Parma. But the fact Guardiola got him back into the fold to be his assistant after the job in Italy didn’t work out for him suggests he rates him. And let’s face it, if Pep phones you up and says he’s got a guy who’s pretty damn good at coaching players, you are going to listen. I read somewhere that Guardiola said he is going to make an extraordinary manager in his own right like Mikel Arteta. Guardiola got it right with him. He went from being his assistant to making his major mark at Arsenal. No one came closer to taking the Premier League title off this season and that says a lot given the state of the Gunners when he took charge. I’m not standing here saying appoint Maresca. What I am saying is that continuity is important and finding someone who can slot into the system and into the squad of players and their playing style is maybe just all Celtic need at the moment. He might be that. Of course, there are other excellent candidates. Graham Potter has to be under consideration. He had a tough time of it at Chelsea, but that was not an easy situation to go into. Looking back beyond the period at Stamford Bridge and his work with Brighton would mirror in some respects the job Eddie Howe had done just along the south coast at Bournemouth. Better, in fact. It was clear Celtic were attracted to that given the fact they wanted the Newcastle manager before being rejected and they went down the Postecoglou road. Graham Potter Kjetil Knutsen of Bodo/Glimt is, of course, well known to the Celtic fans given the way his team hammered Postecoglou’s outfit in the knockout stages of the Conference League a couple of seasons ago. Now doubt the Norwegian did a spectacular job with that team, but they didn’t win the last title after he lost players. Two men I would be ruling out of running immediately are Brendan Rodgers and John Kennedy. Rodgers is just simply not an option, surely. Brendan was a brilliant Celtic manager, but the way he left was just too much for some fans to stomach and I sense it may create a difficult environment between stands and technical area if he were to come back. I might be wrong, but I can’t see it. Kennedy was another I considered, but I’m not sure that is the route Celtic will go down. He has done the job before, mind you. And he certainly knows every single detail about the cub because he’s worked there, successfully, for so long. One thing I will say about this whole situation is the stuff about a big-name really hacks me off. What the hell is a big name and why does it matter? Spurs fans were miffed when Mauricio Pochettino got the job and said he was an underwhelming appointment. Next time he was a hero having taken them close to a title and a Champions League Final. Those same agitators were falling over themselves when Jose Mourinho and Antonio Conte got the job and ended up bored rigid with their football. Ange Postecoglou Be honest, not many folk who aren’t students of the European game had heard of Roberto De Zerbi when he walked into Brighton and now people have him down as the game’s next gift. Quite right, he’s doing a brilliant job. The name is irrelevant, it’s what he can bring to the table that matters. We could see from day one that Postecoglou had the tools to deliver. He had the coaching credentials and managerial nous in the bag as well. It was just that some people didn’t look hard enough to find it. That’s important and where a Potter, for example, would have far more clout than say a Maresca and be better suited. Postecoglou did a superb job and he’s big boots to fill. It’s a huge honour to manage Celtic, but also a big challenge. You’ll need courage to take it because fans want the next step and that is progress in the Champions League as well as continuing to dominate Rangers. I just feel Celtic has the squad in place. Some will leave, but the nucleus is there and the playing style is proven. Ripping it up is not necessary. It’s finding the individual who can slot seamlessly into what’s already there which is necessary. READ NEXT: Read More Related Articles Callum McGregor tells new Celtic boss there's no time to adapt as captain backed to lead club through uncertain waters Read More Related Articles Ole Gunnar Solskjaer tells Celtic Kieran McKenna comes with 'no bull****' bonus and boss target is defence genius Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Enzo Maresca Pep Guardiola Ange Postecoglou Celtic FC Manchester City FC Tottenham Hotspur FC Champions League Scottish Premiership","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30178014.ece/ALTERNATES/s615/0_GettyImages-1408501620.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Callum McGregor tells new Celtic boss there's no time to adapt as captain backed to lead club through uncertain waters","link":"https://www.dailyrecord.co.uk/sport/football/callum-mcgregor-tells-new-celtic-30178919","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Craig Swan)"],"video_url":null,"description":"The captain said previously that whoever is in charge, there is little time for adaptation.","content":"(Image: PA) × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Callum McGregor faced an enormous challenge two years ago. This summer, it’s threatening to be an even bigger task. Captain McGregor could almost end up being the most important person in the entire football department when Celtic regroup for pre-season. When Ange Postecoglou walked into the club, he had to instill a brand-new philosophy. Any new boss needs his senior players to drive home their messages and keep the group on track. With a clearout coming, McGregor was among the few who were staying. Taking the armband from talisman Scott Brown , he was the new leader. Postecoglou spoke openly about the vital importance of his on-pitch lieutenant during the critical opening stages of his Celtic life as he delivered. McGregor, at least, had the back-up of familiar faces such as No.2 John Kennedy and coach Gavin Strachan. But with Postecoglou having targeted that duo to join him at Tottenham, it could be an entire coaching unit which is changing and not just the top man. If that’s the case, McGregor, with assistance of others such as Joe Hart, will have to rapidly bond it all together. Smooth another transition and infuse a whole new set of ideas into a squad by leading impressively again from the front. Read More Related Articles Next Celtic manager hunt LIVE as Martin O'Neill tells Brendan Rodgers how to win Parkhead fans back Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Postecoglou had the bonus of a club legend in McGregor to help that process. Now the new guy will need him just as much. Maybe even more so. When Postecoglou was still trying to implement his changes results didn’t come instantly but the skipper didn’t flinch. Back then McGregor stated: “A lot of new players are coming together and we have to make that bedding in period as quick as possible. It’s important that we don’t go into our shell and start to panic a little bit. We know where we want to get to. It requires hard work, concentration and bravery. “There is always a panic button moment and everybody jumps on it. We can’t lose focus. The only way we are going to get better and progress is if we stay calm and listen to the manager and continue to build on the performance. “The manager had to adapt. But you don’t get time to adapt at Celtic. You have to win.” McGregor led the process. By the time Postecoglou got on his flight bound for North London, he’d lifted five trophies out of six. Such was the enormity of the rebuild at Celtic two years ago, the Aussie was working mostly with his own signings within only a couple of months. Unlike Postecoglou, though, the next gaffer is not going to have a dressing room which is full of his own men. The Spurs boss has left behind a dressing-room full of individuals ensconced into his playing style. If the new guy wants to change that philosophy he’ll have do it quickly and he’ll need his McGregor to lead it. Paul Lambert has been there. He’s been a Celtic captain. He’s seen big changes. From Wim Jansen, to Dr Jozef Venglos, to John Barnes, to Kenny Dalglish, to Martin O’Neill. Lambert, now 53, knows the responsibility that will sit upon McGregor, 29, when the new boss arrives and is adamant there is no-one better to help facilitate the imminent change. He insisted: “Callum really knows the club inside out and he says all of the right things at the right times. He talks about the club having to win regardless of who is in charge and who is actually playing there. “It seems a good group of guys there now who know the pitfalls of when a manager does well or doesn’t that he’ll move either way. I heard Callum’s interviews after the game last weekend [Scottish Cup Final] and he knows that you don’t get time to enjoy success because, before you know it, it is on you again. “That’s the great thing about Callum, he will know that whatever happens and whoever is in charge, you need to get started quickly. That’s the nature of the game at a big club. (Image: SNS Group) \"The demand is: Well, whoever comes in, we help the new manager and we go and try to win games. You have to grab that really quickly as a Celtic player and the manager will know himself he needs to. “The good thing is the new manager will be going into a club which is really strong structure-wise. Whoever goes in there is not going into somewhere that is in disarray. The club is in a really good place. “Celtic are also in a good position to strengthen their first-team squad, so whoever gets the job, I think they will be grateful due to the size of the club and the players that are already there. “As I said, Callum knows all of that. You don’t get that time to win, so whether you are a manager or a player, it has to happen.” Read More Related Articles Jota pays emotional Celtic tribute to Ange Postecoglou as Tottenham boss leaves 'forever grateful' winger gutted Read More Related Articles Watch West Ham and Fiorentina fans clash in chaotic Europa Conference League final scenes Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Paul Lambert Scott Brown Celtic FC Callum McGregor Scottish Premiership","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30093471.ece/ALTERNATES/s615/0_Celtic-v-Aberdeen-cinch-Premiership-Celtic-Park.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Transferts : Le PSG vise du lourd, il a déjà dit oui à Mbappé","link":"https://le10sport.com/football/mercato/transferts-le-psg-vise-du-lourd-il-a-deja-dit-oui-a-mbappe-648927","keywords":null,"creator":null,"video_url":null,"description":"Après Milan Skriniar, Marco Asensio et Manuel Ugarte, une quatrième recrue pourrait débarquer au PSG dans les prochains jours. Il s'agirait de Marcus Thuram, en fin de contrat avec le…","content":"Après Milan Skriniar, Marco Asensio et Manuel Ugarte, une quatrième recrue pourrait débarquer au PSG dans les prochains jours. Il s'agirait de Marcus Thuram, en fin de contrat avec le Borussia Mönchengladbach. L'international française ne resterait pas insensible à cet intérêt et ne cacherait pas son envie d'évoluer en club aux côtés de Kylian Mbappé. Le PSG frappe fort en ce début du mois de juin. Le mercato estival n'ouvrira ses portes que dans quelques heures, mais trois transferts auraient été bouclés. Marco Asensio et Manuel Ugarte ont déjà passé leur visite médicale et devraient être les premières recrues parisiennes. Ils devraient être accompagnés de Milan Skriniar , qui a signé un pré-contrat avec le PSG en janvier dernier. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY Le Parisien pense connaître l'identité de la quatrième recrue du PSG . Il pourrait s'agir de Marcus Thuram, dont le départ du Borussia Mönchengladbach est acté depuis plusieurs mois. Le buteur français est tenté par un départ dans la capitale française et ne cache pas son envie de jouer avec Kylian Mbappé. Ce dossier pourrait connaître quelques avancées dans les prochains jours. A en croire le journaliste Fabrizio Romano, les deux parties auraient prévu de se rencontrer dans les prochains jours pour finaliser l'opération. A noter que son frère, Khéphren Thuram (OGC Nice) serait aussi dans la short-list du PSG.","pubDate":"2023-06-08 04:45:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225671.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"L’OL racheté par Benzema, un scénario surréaliste est annoncé","link":"https://le10sport.com/football/mercato/lol-rachete-par-benzema-un-scenario-surrealiste-est-annonce-648928","keywords":null,"creator":null,"video_url":null,"description":"Alors qu'il avait envisagé de prendre sa retraite au Real Madrid, Karim Benzema a décidé de filer à Al-Ittihad, en Arabie Saoudite. Le club saoudien lui a fait un pont d'or. L'ancien international…","content":"Alors qu'il avait envisagé de prendre sa retraite au Real Madrid, Karim Benzema a décidé de filer à Al-Ittihad, en Arabie Saoudite. Le club saoudien lui a fait un pont d'or. L'ancien international français, qui a signé pour trois ans, touchera environ 200M€ par an. Un joli pactole, qui pourrait lui donner les moyens de racheter une formation européenne comme l'a souligné Jean-Baptiste Guégan. « J’ai eu la chance d’accomplir des choses extraordinaires dans ma carrière et de réaliser tout ce que je pouvais en Espagne et en Europe. Je pense que le moment est venu de relever un nouveau défi ». C'est fait, Karim Benzema a fait ses adieux au Real Madrid avant de filer à Al-Ittihad. Pour l'attirer, le club saoudien lui a proposé un salaire de 200M€ par an. A défaut de lui promettre un championnat compétitif, l 'Arabie Saoudite peut lui promettre de remplir son compte en banque. Pour Jean-Baptiste Guégan , ces sommes sont ahurissantes. Benzema prend le jackpot et s'enflamme pour son transfert https://t.co/vHpZvfzFE5 pic.twitter.com/kSK6HDsP0m « Quand tu vois les contrats, les joueurs ne vont pas se dire je vais être riche, mais, je vais pouvoir arriver à un niveau d'investissement que je n'aurais jamais pu atteindre, comme David Beckham. Ils pourront ainsi acheter des clubs » a confié le spécialiste et professeur en géopolitique du sport dans les colonnes de L'Equipe . A terme, Benzema pourrait avoir les capacités de racheter une grande équipe européenne, comme l' OL , son club formateur. « Par exemple, Benzema pourrait clairement aller à Lyon et racheter le club à John Textor, ce qu'il n'aurait pas pu faire après 14 saisons au Real. C'est ce qui s'est passé avec David Beckham, quand il est entré dans la MLS avec des fonds qatariens. Il s'offre la possibilité d'entrer dans un groupe très restreint de gens qui peuvent construire une entité sportive et racheter entièrement, et pas se contenter d'un rôle minoritaire. Nous, on ne le voit pas ça » a lâché Guégan .","pubDate":"2023-06-08 04:30:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225873.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"PSG : La femme de Messi a tranché pour son prochain club, c’est une surprise","link":"https://le10sport.com/football/mercato/psg-la-femme-de-messi-a-tranche-pour-son-prochain-club-cest-une-surprise-648925","keywords":null,"creator":null,"video_url":null,"description":"Quelle sera la prochaine équipe de Lionel Messi ? Certainement pas le PSG, qui n'a pas réussi à le prolonger. Trois options sont sur la table de l'international argentin, mais aucune ne ferait…","content":"Quelle sera la prochaine équipe de Lionel Messi ? Certainement pas le PSG, qui n'a pas réussi à le prolonger. Trois options sont sur la table de l'international argentin, mais aucune ne ferait l'unanimité. Sa femme aurait une préférence pour les Etats-Unis, tandis que son père ne verrait pas d'un mauvais œil un départ en Arabie Saoudite. La famille de Lionel Messi se déchire. Les proches du champion du monde n'hésitent pas à le conseiller au sujet de son prochain club. Cela fait bien longtemps que le PSG n'est plus une option. En réalité, trois pistes sont sur la table, et l'une d'entre elles ne cesse de prendre de l'épaisseur. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY A en croire plusieurs médias, l 'Inter Miami aurait fait un percée dans ce dossier. Aujourd'hui, la franchise américaine est en pole position dans ce dossier, bien devant le FC Barcelone. Selon le journaliste Joan Fontes , la femme de Messi pousserait pour rejoindre les Etats-Unis. Ce ne serait pas l'avis de Jorge Messi, le père de l'international argentin. A en croire le journaliste catalan, il verrait, plutôt, d'un bon œil un départ en Arabie Saoudite. Le club d' Al-Hilal lui proposerait un salaire record de 600M€. De quoi faire réfléchir...","pubDate":"2023-06-08 04:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225701.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"How Grimsby Town's squad compares to rest of League Two and key decisions to be made","link":"https://www.grimsbytelegraph.co.uk/sport/football/how-grimsby-towns-squad-compares-8503783","keywords":["Sport"],"creator":["newsdesk@grimsbytelegraph.co.uk (Sam Allen)"],"video_url":null,"description":"Town had one of the younger squads in the division last season","content":"There could be noticeable differences to how Grimsby Town’s squad stacks up to the rest of League Two next season compared to how it did last term as the club develops its recruitment strategy. The term “squad composition” was used frequently by Town’s newest board member Gareth Jennings in a recent interview about his role at the club, which could mean a variety of things in terms of what features of each player it refers to. We are yet to see the Mariners’ recruitment plan spring into action as of yet with plenty of time still to go to recruit players, but looking at the key facts about Town’s squad in the 22/23 season we can analyse the things that may change or stay the same. Paul Hurst used 32 players across the season which put Grimsby in the middle of the road compared to the rest of the league, AFC Wimbledon used the most (38) and interestingly, the eventual champions Leyton Orient used the fewest players (26). In fact, all four teams that were promoted ended up using fewer players than Town, which potentially highlights the benefits of running with a tighter group. On the other hand, other factors have to be considered such as the amount of games the Mariners played in all competitions and the importance of having a deep squad to cope with that. In terms of the average age of those players, Town had one of the younger squads in the division at 25.7 years of age, with only eight clubs running with a more youthful group last season. Clubs like Mansfield Town valued experience more than youth with the stags operating with the oldest squad on average (28.4) and having that experience worked well for the likes of Stevenage who had the third oldest team (27.4). Read more: Cleethorpes Town confirm James McKeown decision as Grimsby Town legend set to play on With age, there is likely greater value in having a even balance of young players with potential for growth and others that have been around longer and have a good understanding of what a team needs to be successful. Hurst has always placed great value on being able to develop young talent as a manager so will continue to place trust in those types of players but they need to be surrounded by experience to help them through. With that in mind, Town’s squad was one of the least experienced in the league in terms of appearances with an average of just under 51 total League Two appearances per player. Stevenage were promoted this term and had the most fourth tier experience in their squad with 119.75 average appearances per player. Hurst often spoke of the value of spreading the goals around the team in place of relying on one primary goalscorer, and that was the way his team operated last term with the joint most individual goalscorers across the year (18). The task now will be to increase the overall goal output of the team, because chase conversion was an issue for the team at points. At the same time, Town outperformed the expectation of the team based on where they placed in League Two for market value of their squad compared to where they actually finished. According to TransferMarkt’s estimations. Grimsby had one of the lower valued squads but finished nine places above where they ranked for the overall estimated price of their team. In the end, if Town can stick to a shrewd approach and still get results then there is no reason to deviate from that path. Read more: Grimsby Town will take holistic approach to signings as Paul Hurst closes in on deals Read more: Grimsby Town pre-season schedule in full including Hull City and Lincoln City games Read more: Niall Maher has shown Paul Hurst the key role he can play for Grimsby Town","pubDate":"2023-06-08 04:00:00","image_url":"https://i2-prod.grimsbytelegraph.co.uk/incoming/article8396243.ece/ALTERNATES/s615/0_Bradford-v-GrimsbySky-Bet-EFL-League-Two.jpg","source_id":"grimsbytetelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Surprise au PSG, Mbappé répond au Real Madrid pour son transfert","link":"https://le10sport.com/football/mercato/surprise-au-psg-mbappe-repond-au-real-madrid-pour-son-transfert-648926","keywords":null,"creator":null,"video_url":null,"description":"A plusieurs reprises ces derniers jours, Kylian Mbappé a assuré qu'il serait un joueur du PSG la saison prochaine. Ce qui n'empêche pas certains journalistes espagnoles de le questionner sur un…","content":"A plusieurs reprises ces derniers jours, Kylian Mbappé a assuré qu'il serait un joueur du PSG la saison prochaine. Ce qui n'empêche pas certains journalistes espagnoles de le questionner sur un possible transfert au Real Madrid. Récemment, l'un d'entre eux, José Alvarez a tenté sa chance et a, finalement, obtenu une réponse de la part de la star française. Lié au PSG jusqu'en 2024, Kylian Mbappé n'a pas l'intention d'aller voir ailleurs. Le joueur français l'avait annoncé dès le mois d'avril au micro de France 3. « Le prochain palier ? Gagner la Ligue des champions, je pense. J’ai déjà fait une finale, demi-finale, quart de finale, huitième de finale… J’ai tout fait sauf gagner (sourire). Il ne me manque que ça. j’espère que ça sera le plus rapidement possible. Où ? Au Paris Saint-Germain. Je suis Parisien et sous contrat. Donc c’est le Paris Saint-Germain » avait lâché Mbappé lors de l'émission Tout le Sport. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY Sacré, depuis, meilleur joueur de la saison en Ligue 1, Kylian Mbappé en a remis une couche lors de la cérémonie des trophées UNFP. « Mon avenir ? L'année prochaine, je jouerai au Paris Saint-Germain, j'ai encore un contrat, je vais honorer mon contrat » a-t-il lâché, après avoir pourtant rembarré un journaliste espagnol, qui l'avait questionné sur un possible transfert au Real Madrid. « Je suis là pour parler du trophée. Le reste ne m’intéresse pas » a lâché le champion du monde 2018 à José Alvarez, travaillant pour l'émission El Chiringuito . Mais la réponse de Mbappé ne l'a pas découragé, bien au contraire. Présent au Grand Prix de Catalogne dimanche dernier, José Alvarez est tombé nez à nez avec Kylian Mbappé, présent lors de cet évènement aux côtés de Neymar. Le journaliste l'a questionné, à nouveau, sur son avenir au PSG . Cette fois-ci, Mbappé ne l'a pas laissé sans réponse. « Le Real Madrid ? Il y a le temps » a-t-il confié selon José Alvarez.","pubDate":"2023-06-08 04:00:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225742.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"Barry Robson has landed Aberdeen Euro jackpot but rookie boss told to hit two more Pittodrie objectives","link":"https://www.dailyrecord.co.uk/sport/football/football-news/barry-robson-landed-aberdeen-euro-30179347","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"Barry Nicholson was part of the Dons squad that qualified from the UEFA Cup group stage and faced the mighty Bayern Munich.","content":"Fleetwood manager Scott Brown (R) and coaches Steven Whittaker and Barry Nicholson × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Aberdeen landed the £5million jackpot by finishing third – but Barry Nicholson knows there’s memories money can’t buy ahead in Europe. Dons were left celebrating at the weekend, as Celtic lifted the Scottish Cup and ensured they went into the play-off round of the Europa League. If they get through that they go into the group sections and if they lose they fall into the same stage of the Europa Conference League , guaranteed games until Christmas. Nicholson was part of the last Aberdeen squad that last made the group stages 16 years ago. Jimmy Calderwood’s side not only got through their group but caused Bayern Munich a brief scare in the knockout stage. Nicholson admitted: “It will be amazing. It’s what Aberdeen is all about. They need to be constantly pushing for those European places, cup finals and trophies. I know from being up there, those are the demands. Barry has done absolutely brilliantly to get Aberdeen into this situation. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Dave Cormack in brutal Hearts troll as he bites back at Andrew McKinlay with 'season ticket league' putdown “Going away to some of the places we did on that European run was amazing. The fans had some great trips away and we all really enjoyed it because you are playing against top players and top clubs. Aberdeen need to be playing at this level. Hopefully, they’ll get a draw the fans can really enjoy.” This Aberdeen team got direct entry to the group stage where Nicholson’s team had to battle through a qualifier against Dnipro, where Darren Mackie scored his famous goal. Robson’s side is waiting to see who they could face in the first qualifier with Lugano and the winners of Olympiakos or Slavia Prague amongst the options. Nicholson recalled: “We just had the two ties of Dnipro and if we had lost we would have been out. Aberdeen go into the play-off round and Conference League group stages even if they lose, which is great. “We’ve seen how West Ham have done in that tournament this season. It would be a big thing to get into the group stages of either competition. “There should be some great ties and it will be brilliant for Aberdeen. Fingers crossed, though, they get through the first play-off because the Europa League is the bigger one.” The group stages are where things really lit up for Nicholson and the Dons. They faced the likes of Atletico Madrid, Panathinaikos, Copenhagen and Lokomotiv Moscow. Barry Nicholson (right) in action against Bayern Munich in 2008 (Image: PA Wire) The Fleetwood youth coach claimed: “Panathinaikos game was the first one. We actually played quite well. We got beat 3-0 but we played well. “We had a good chance to make it 1-1 but we never took it. We drew with Lokomotiv Moscow. They had Branislav Ivanovic, who went to Chelsea, and Diniyar Bilyaletdinov, who signed for Everton. “The Atletico Madrid game, Jimmy wanted us to keep the crowd quiet for 20 minutes –they hit the post after 14 seconds! I sat on the bench because I was ill on the flight and then on the hotel. We had to beat Copenhagen at home to qualify, which we did. We managed to qualify with four points because the top three went through.” Dons went into the knockout stage where they drew Bayern. They drew 2-2 at Pittodrie before the Germans brought out the big guns and blasted them away at the Allianz Arena. Nicholson said: “They had some calibre of player. They scored, we got 2-1 ahead, then they levelled. Everybody was shocked that we had drawn the game and given ourselves a chance over there. “They brought Lukas Podolski in from the start and Mark Van Bommell and Oliver Kahn returned for the second leg. We played really well, it was 0-0 after 20 minutes but we quickly found ourselves 2-0 down and that killed the tie. “It was amazing, training and playing at the Allianz. Games like that you never forget. Brilliant nights to play in. When Pittodrie is rocking it really is some place to play READ NEXT: Read More Related Articles Barry Robson reveals Aberdeen transfer strategy and how he will look to cut down loan market reliance Read More Related Articles Aberdeen path Europa League playoff revealed as swerving 2 heavy hitters sets up dream qualifying route Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Aberdeen FC Scottish Premiership Europa Conference League Europa League Barry Robson","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article27572327.ece/ALTERNATES/s615/1_JS272857629.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lee Johnson making Hibs transfer push for Will Fish and CJ Egan-Riley as he aims to 'trim fat' from squad","link":"https://www.dailyrecord.co.uk/sport/football/lee-johnson-making-hibs-transfer-30179245","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Fraser Wilson)"],"video_url":null,"description":"The Hibees boss was impressed by their impacts and wants them back for a tilt in Europe.","content":"Will Fish × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Lee Johnson admits securing new loan deals for Will Fish and CJ Egan-Riley would ease the pressure on Hibs ’ summer shopping. Manchester United defender Fish was a huge success after stepping into the void to replace Ryan Porteous. But the Easter Road club could face competition from Aberdeen to land the 20-year-old, who played 21 games while on loan. Likewise Burnley utility man Egan-Riley added steel to the midfield and backline after joining in January. Neither player had an option to buy inserted in their deal but Johnson is pushing to get both back for the new campaign. The Hibs boss brought in 20 players across two windows in the season just gone but he’ll look to “trim the fat” in this one. Asked if he expects a big turnaround this summer, Johnson said: “A lot of that will be dictated by the loans. I’d love to have Will and CJ back, as an example. They’re not our only loans but while I remember a media report suggesting we had too many loans, with some of these guys we have an option to turn it into a permanent and some we haven’t. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Read More Related Articles Next Celtic manager hunt LIVE as Kieran McKenna's shared trait with Neil Warnock explained \"That comes into play. I’d like to keep the stability, trim the fat and use the finances well to recruit quality. I’d rather lower the numbers and have higher quality. \"Then obviously if we’ve got good young players to supplement the squad or we can rotate the loans, bring them back and one of them breaks through, we’re all laughing. I’d much rather have a smaller squad because it means there are fewer problems for me! \"I like an environment where everybody feels like they have a carrot at the end of the week.” Johnson came in just over 12 months ago, taking a side that had finished eighth to a fifth – and Europe – this term. He added: “If you remember when I walked through the door, we had seven on the injury bed and a lot were key players. A lot of the understudies, or perceived understudies, were actually starting. “You talk about having your money on the pitch but a lot of those players were injured. That left a slightly over-inflated squad, particularly with the narrative that the season before there maybe wasn’t enough depth. Hibernian's CJ Egan-Riley “We were almost slightly diluted in terms of quality but we had the depth. That’s fine if everyone’s fit but if they’re not, you’re playing the players who ideally are trying to take the place of the ones who are ready-made and that’s where you need a bit of luck. \"Generally when we’ve had that settled 11, we have performed well. And if you look back at when I’ve changed the team and when I haven’t, I’d love to pick a team on day one and hardly have to change it until the end of the season, then build and build and build again. “However, clubs like Hibs have their place in the food chain, so we have to wait or we have to be calm, or we have to convince, or we have to pay more. And all those things come into it to try to achieve these loans again. “In an ideal world I’d love to keep this core strong and then add quality – not numeracy – in and around the key areas where we think we need additions for the first team. “There will be a lot of interest in our players both in terms of the fringe players, or the ones who perhaps haven’t had as many minutes as they might have hoped, but also the stars.” Read More Related Articles Jota pays emotional Celtic tribute to Ange Postecoglou as Tottenham boss leaves 'forever grateful' winger gutted Read More Related Articles Watch West Ham and Fiorentina fans clash in chaotic Europa Conference League final scenes Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Hibernian FC Transfer Talk Scottish Premiership Lee Johnson","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30179292.ece/ALTERNATES/s615/0_JS298917046.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Motherwell hero Tommy McLean 'one of most important figures' in club's history as stand tribute unveiled","link":"https://www.dailyrecord.co.uk/sport/local-sport/motherwell-hero-tommy-mclean-one-30177135","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Andy McGilvray)"],"video_url":null,"description":"The club recently unveiled a lasting tribute to the legendary manager's impact at Fir Park","content":"Ex Motherwell players presented with a picture to mark the official naming of the Tommy McLean stand during a cinch Premiership match between Motherwell and Dundee United at Fir Park, on May 28, 2023, in Motherwell, Scotland. Pictured are (left to right): Brian Martin, Iain Ferguson, Well Society co-chair Douglas Dickie, Cammy Murray (Tommy McLean's representative), Bobby Russell, Chris McCart and Alex Burns. (Photo by Craig Foy / SNS Group) × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Motherwell officially unveiled the Tommy McLean Stand during their final Premiership game of the season. The South Stand was renamed during the 3-2 win over Dundee United, with new signage unveiled as players and staff who worked closely with McLean gathered to mark his significant contribution. Tommy, who famously guided Motherwell to the 1991 Scottish Cup against brother Jim’s Dundee United, couldn’t be in attendance. Read More Related Articles Motherwell to play in NL Cup as Airdrie look to retain pre-season trophy Read More Related Articles Motherwell boss Stuart Kettlewell aims to maintain momentum with short break before pre-season training But Chris McCart and Iain Ferguson of the 1991 Scottish Cup-winning side, and Brian Martin, Alex Burns and Bobby Russell, joined former coach Cammy Murray on the pitch to mark the occasion. Well Society co-chair Douglas Dickie handed over a framed photograph of the Tommy McLean stand to Murray, who worked alongside McLean, and represented him at Fir Park. Murray said: “Tommy made a tremendous contribution to the history of Motherwell FC. Tommy McLean is crowded by Well fans as he holds the cup aloft “He deserves to have his name in the fabric of Fir Park, alongside other great figures in the club’s history. “He couldn’t be here in person, but I know he is humbled at this gesture. “Tommy really is one of a kind. As a coach and being involved with him, I never came across anyone with the knowledge he had. “He had this great ability to change things in the game, and he gave the fans a decade they will never forget.” More sports news from across Lanarkshire Neil: Accies 'a great breeding ground' Glencairn learn Junior Cup final date McRae's grandson goes for rally glory Celts 'as good as Euro final sides' Striker Steve Kirk hailed McLean as the “best coach and manager” he had ever worked under. Well Society members voted to rename the South Stand after McLean in 2021, the same year he was inducted to the club’s Hall of Fame. McLean brought outstanding players like Davie Cooper to Fir Park and worked wonders for the club to benefit financially from deals. Cooper is unveiled alongside Well manager Tommy McLean Douglas Dickie said: “Tommy brokered the record deal for Phil O’Donnell, which allowed the club, at that time, to go forward with the stadium’s South Stand – and it’s absolutely apt that now it Is named in tribute to him. “I am delighted that the club – and the fans – were able to celebrate his impact together at the weekend. “We will share pictures and footage from the day with Tommy, to remind him how much he means to the club.” McLean’s first feat as manager was to steer the club back to top-flight football in 1985. Dickie added: “Tommy is one of the most important figures in Motherwell’s 137-year existence, and certainly the most influential in our recent history.” Read More Related Articles Derby County, Kilmarnock and Clyde hero Craig Bryson lands role with hometown team East Kilbride Read More Related Articles Airdrie announce new chairman as Sir Alex Ferguson's brother steps down from role All the latest sport news in Lanarkshire EK 'sleeping giants' says new boss Rovers staying up would mean the world Gemmell hangs up his boots Retired ref Madden on 'Gers fan' claims Follow Lanarkshire Live Sport on Twitter via @LanLiveSport , like us on Facebook or find us on Instagram for the latest sports news, pictures and video. Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Lanarkshire Sport Motherwell FC Motherwell Facebook Twitter William Hill Scottish Cup Social media","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30177144.ece/ALTERNATES/s615/0_JS301572412.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Enzo Maresca holds Celtic continuity key and big names don't matter if you've got coaching chops - Chris Sutton","link":"https://www.dailyrecord.co.uk/sport/football/football-news/enzo-maresca-holds-celtic-continuity-30177958","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Chris Sutton)"],"video_url":null,"description":"Sutty also ruled out a Brendan Rodgers return and can't see Celtic bumping John Kennedy up to the top job.","content":"Pep Guardiola and Enzo Maresca × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Continuity is key. Celtic have built themselves into a brilliant position and there is no reason to go pulling it apart. What is needed for the manager’s job is not someone to come in and basically start again as Ange Postecoglou had to do. They need someone to continue his good work. Someone who has the same philosophies and ideals, plays the same way and can deal with a mixture of cultures. Celtic went to the City Football Group to get Postecoglou. People scoffed about it. Scoffed about his appointment and they were wrong. So, for my money, it would make a lot of sense to go down the same route. CFG are a footballing power in their own right. Postecoglou went into Celtic and adopted the style of football used by Pep Guardiola with the inverted full-backs, the high press and the fast-paced approach. With that in mind, I can see a lot of reasons why Enzo Maresca would appeal as a viable candidate. He is, after all, Guardiola ’s assistant. Read More Related Articles Dermot Desmond refuses to rush Celtic next manager anointing as Brendan Rodgers also works out next move Read More Related Articles Next Celtic manager hunt LIVE as John Kennedy won't be allowed to follow Ange without a fight Now let’s get the cards on the table right away. I don’t know the guy at all. I’ve no idea whether he could handle the environment in Glasgow, or whether he’s cut out to be a manager in his own right having not done so well in his last attempt at Parma. But the fact Guardiola got him back into the fold to be his assistant after the job in Italy didn’t work out for him suggests he rates him. And let’s face it, if Pep phones you up and says he’s got a guy who’s pretty damn good at coaching players, you are going to listen. I read somewhere that Guardiola said he is going to make an extraordinary manager in his own right like Mikel Arteta. Guardiola got it right with him. He went from being his assistant to making his major mark at Arsenal. No one came closer to taking the Premier League title off this season and that says a lot given the state of the Gunners when he took charge. I’m not standing here saying appoint Maresca. What I am saying is that continuity is important and finding someone who can slot into the system and into the squad of players and their playing style is maybe just all Celtic need at the moment. He might be that. Of course, there are other excellent candidates. Graham Potter has to be under consideration. He had a tough time of it at Chelsea, but that was not an easy situation to go into. Looking back beyond the period at Stamford Bridge and his work with Brighton would mirror in some respects the job Eddie Howe had done just along the south coast at Bournemouth. Better, in fact. It was clear Celtic were attracted to that given the fact they wanted the Newcastle manager before being rejected and they went down the Postecoglou road. Graham Potter Kjetil Knutsen of Bodo/Glimt is, of course, well known to the Celtic fans given the way his team hammered Postecoglou’s outfit in the knockout stages of the Conference League a couple of seasons ago. Now doubt the Norwegian did a spectacular job with that team, but they didn’t win the last title after he lost players. Two men I would be ruling out of running immediately are Brendan Rodgers and John Kennedy. Rodgers is just simply not an option, surely. Brendan was a brilliant Celtic manager, but the way he left was just too much for some fans to stomach and I sense it may create a difficult environment between stands and technical area if he were to come back. I might be wrong, but I can’t see it. Kennedy was another I considered, but I’m not sure that is the route Celtic will go down. He has done the job before, mind you. And he certainly knows every single detail about the cub because he’s worked there, successfully, for so long. One thing I will say about this whole situation is the stuff about a big-name really hacks me off. What the hell is a big name and why does it matter? Spurs fans were miffed when Mauricio Pochettino got the job and said he was an underwhelming appointment. Next time he was a hero having taken them close to a title and a Champions League Final. Those same agitators were falling over themselves when Jose Mourinho and Antonio Conte got the job and ended up bored rigid with their football. Ange Postecoglou Be honest, not many folk who aren’t students of the European game had heard of Roberto De Zerbi when he walked into Brighton and now people have him down as the game’s next gift. Quite right, he’s doing a brilliant job. The name is irrelevant, it’s what he can bring to the table that matters. We could see from day one that Postecoglou had the tools to deliver. He had the coaching credentials and managerial nous in the bag as well. It was just that some people didn’t look hard enough to find it. That’s important and where a Potter, for example, would have far more clout than say a Maresca and be better suited. Postecoglou did a superb job and he’s big boots to fill. It’s a huge honour to manage Celtic, but also a big challenge. You’ll need courage to take it because fans want the next step and that is progress in the Champions League as well as continuing to dominate Rangers. I just feel Celtic has the squad in place. Some will leave, but the nucleus is there and the playing style is proven. Ripping it up is not necessary. It’s finding the individual who can slot seamlessly into what’s already there which is necessary. READ NEXT: Read More Related Articles Callum McGregor tells new Celtic boss there's no time to adapt as captain backed to lead club through uncertain waters Read More Related Articles Ole Gunnar Solskjaer tells Celtic Kieran McKenna comes with 'no bull****' bonus and boss target is defence genius Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Enzo Maresca Pep Guardiola Ange Postecoglou Celtic FC Manchester City FC Tottenham Hotspur FC Champions League Scottish Premiership","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30178014.ece/ALTERNATES/s615/0_GettyImages-1408501620.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Callum McGregor tells new Celtic boss there's no time to adapt as captain backed to lead club through uncertain waters","link":"https://www.dailyrecord.co.uk/sport/football/callum-mcgregor-tells-new-celtic-30178919","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Craig Swan)"],"video_url":null,"description":"The captain said previously that whoever is in charge, there is little time for adaptation.","content":"(Image: PA) × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Callum McGregor faced an enormous challenge two years ago. This summer, it’s threatening to be an even bigger task. Captain McGregor could almost end up being the most important person in the entire football department when Celtic regroup for pre-season. When Ange Postecoglou walked into the club, he had to instill a brand-new philosophy. Any new boss needs his senior players to drive home their messages and keep the group on track. With a clearout coming, McGregor was among the few who were staying. Taking the armband from talisman Scott Brown , he was the new leader. Postecoglou spoke openly about the vital importance of his on-pitch lieutenant during the critical opening stages of his Celtic life as he delivered. McGregor, at least, had the back-up of familiar faces such as No.2 John Kennedy and coach Gavin Strachan. But with Postecoglou having targeted that duo to join him at Tottenham, it could be an entire coaching unit which is changing and not just the top man. If that’s the case, McGregor, with assistance of others such as Joe Hart, will have to rapidly bond it all together. Smooth another transition and infuse a whole new set of ideas into a squad by leading impressively again from the front. Read More Related Articles Next Celtic manager hunt LIVE as Martin O'Neill tells Brendan Rodgers how to win Parkhead fans back Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen, Hearts and Hibs eye signings Postecoglou had the bonus of a club legend in McGregor to help that process. Now the new guy will need him just as much. Maybe even more so. When Postecoglou was still trying to implement his changes results didn’t come instantly but the skipper didn’t flinch. Back then McGregor stated: “A lot of new players are coming together and we have to make that bedding in period as quick as possible. It’s important that we don’t go into our shell and start to panic a little bit. We know where we want to get to. It requires hard work, concentration and bravery. “There is always a panic button moment and everybody jumps on it. We can’t lose focus. The only way we are going to get better and progress is if we stay calm and listen to the manager and continue to build on the performance. “The manager had to adapt. But you don’t get time to adapt at Celtic. You have to win.” McGregor led the process. By the time Postecoglou got on his flight bound for North London, he’d lifted five trophies out of six. Such was the enormity of the rebuild at Celtic two years ago, the Aussie was working mostly with his own signings within only a couple of months. Unlike Postecoglou, though, the next gaffer is not going to have a dressing room which is full of his own men. The Spurs boss has left behind a dressing-room full of individuals ensconced into his playing style. If the new guy wants to change that philosophy he’ll have do it quickly and he’ll need his McGregor to lead it. Paul Lambert has been there. He’s been a Celtic captain. He’s seen big changes. From Wim Jansen, to Dr Jozef Venglos, to John Barnes, to Kenny Dalglish, to Martin O’Neill. Lambert, now 53, knows the responsibility that will sit upon McGregor, 29, when the new boss arrives and is adamant there is no-one better to help facilitate the imminent change. He insisted: “Callum really knows the club inside out and he says all of the right things at the right times. He talks about the club having to win regardless of who is in charge and who is actually playing there. “It seems a good group of guys there now who know the pitfalls of when a manager does well or doesn’t that he’ll move either way. I heard Callum’s interviews after the game last weekend [Scottish Cup Final] and he knows that you don’t get time to enjoy success because, before you know it, it is on you again. “That’s the great thing about Callum, he will know that whatever happens and whoever is in charge, you need to get started quickly. That’s the nature of the game at a big club. (Image: SNS Group) \"The demand is: Well, whoever comes in, we help the new manager and we go and try to win games. You have to grab that really quickly as a Celtic player and the manager will know himself he needs to. “The good thing is the new manager will be going into a club which is really strong structure-wise. Whoever goes in there is not going into somewhere that is in disarray. The club is in a really good place. “Celtic are also in a good position to strengthen their first-team squad, so whoever gets the job, I think they will be grateful due to the size of the club and the players that are already there. “As I said, Callum knows all of that. You don’t get that time to win, so whether you are a manager or a player, it has to happen.” Read More Related Articles Jota pays emotional Celtic tribute to Ange Postecoglou as Tottenham boss leaves 'forever grateful' winger gutted Read More Related Articles Watch West Ham and Fiorentina fans clash in chaotic Europa Conference League final scenes Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Paul Lambert Scott Brown Celtic FC Callum McGregor Scottish Premiership","pubDate":"2023-06-08 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30093471.ece/ALTERNATES/s615/0_Celtic-v-Aberdeen-cinch-Premiership-Celtic-Park.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Transferts : Le PSG vise du lourd, il a déjà dit oui à Mbappé","link":"https://le10sport.com/football/mercato/transferts-le-psg-vise-du-lourd-il-a-deja-dit-oui-a-mbappe-648927","keywords":null,"creator":null,"video_url":null,"description":"Après Milan Skriniar, Marco Asensio et Manuel Ugarte, une quatrième recrue pourrait débarquer au PSG dans les prochains jours. Il s'agirait de Marcus Thuram, en fin de contrat avec le…","content":"Après Milan Skriniar, Marco Asensio et Manuel Ugarte, une quatrième recrue pourrait débarquer au PSG dans les prochains jours. Il s'agirait de Marcus Thuram, en fin de contrat avec le Borussia Mönchengladbach. L'international française ne resterait pas insensible à cet intérêt et ne cacherait pas son envie d'évoluer en club aux côtés de Kylian Mbappé. Le PSG frappe fort en ce début du mois de juin. Le mercato estival n'ouvrira ses portes que dans quelques heures, mais trois transferts auraient été bouclés. Marco Asensio et Manuel Ugarte ont déjà passé leur visite médicale et devraient être les premières recrues parisiennes. Ils devraient être accompagnés de Milan Skriniar , qui a signé un pré-contrat avec le PSG en janvier dernier. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY Le Parisien pense connaître l'identité de la quatrième recrue du PSG . Il pourrait s'agir de Marcus Thuram, dont le départ du Borussia Mönchengladbach est acté depuis plusieurs mois. Le buteur français est tenté par un départ dans la capitale française et ne cache pas son envie de jouer avec Kylian Mbappé. Ce dossier pourrait connaître quelques avancées dans les prochains jours. A en croire le journaliste Fabrizio Romano, les deux parties auraient prévu de se rencontrer dans les prochains jours pour finaliser l'opération. A noter que son frère, Khéphren Thuram (OGC Nice) serait aussi dans la short-list du PSG.","pubDate":"2023-06-08 04:45:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225671.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"L’OL racheté par Benzema, un scénario surréaliste est annoncé","link":"https://le10sport.com/football/mercato/lol-rachete-par-benzema-un-scenario-surrealiste-est-annonce-648928","keywords":null,"creator":null,"video_url":null,"description":"Alors qu'il avait envisagé de prendre sa retraite au Real Madrid, Karim Benzema a décidé de filer à Al-Ittihad, en Arabie Saoudite. Le club saoudien lui a fait un pont d'or. L'ancien international…","content":"Alors qu'il avait envisagé de prendre sa retraite au Real Madrid, Karim Benzema a décidé de filer à Al-Ittihad, en Arabie Saoudite. Le club saoudien lui a fait un pont d'or. L'ancien international français, qui a signé pour trois ans, touchera environ 200M€ par an. Un joli pactole, qui pourrait lui donner les moyens de racheter une formation européenne comme l'a souligné Jean-Baptiste Guégan. « J’ai eu la chance d’accomplir des choses extraordinaires dans ma carrière et de réaliser tout ce que je pouvais en Espagne et en Europe. Je pense que le moment est venu de relever un nouveau défi ». C'est fait, Karim Benzema a fait ses adieux au Real Madrid avant de filer à Al-Ittihad. Pour l'attirer, le club saoudien lui a proposé un salaire de 200M€ par an. A défaut de lui promettre un championnat compétitif, l 'Arabie Saoudite peut lui promettre de remplir son compte en banque. Pour Jean-Baptiste Guégan , ces sommes sont ahurissantes. Benzema prend le jackpot et s'enflamme pour son transfert https://t.co/vHpZvfzFE5 pic.twitter.com/kSK6HDsP0m « Quand tu vois les contrats, les joueurs ne vont pas se dire je vais être riche, mais, je vais pouvoir arriver à un niveau d'investissement que je n'aurais jamais pu atteindre, comme David Beckham. Ils pourront ainsi acheter des clubs » a confié le spécialiste et professeur en géopolitique du sport dans les colonnes de L'Equipe . A terme, Benzema pourrait avoir les capacités de racheter une grande équipe européenne, comme l' OL , son club formateur. « Par exemple, Benzema pourrait clairement aller à Lyon et racheter le club à John Textor, ce qu'il n'aurait pas pu faire après 14 saisons au Real. C'est ce qui s'est passé avec David Beckham, quand il est entré dans la MLS avec des fonds qatariens. Il s'offre la possibilité d'entrer dans un groupe très restreint de gens qui peuvent construire une entité sportive et racheter entièrement, et pas se contenter d'un rôle minoritaire. Nous, on ne le voit pas ça » a lâché Guégan .","pubDate":"2023-06-08 04:30:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225873.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"PSG : La femme de Messi a tranché pour son prochain club, c’est une surprise","link":"https://le10sport.com/football/mercato/psg-la-femme-de-messi-a-tranche-pour-son-prochain-club-cest-une-surprise-648925","keywords":null,"creator":null,"video_url":null,"description":"Quelle sera la prochaine équipe de Lionel Messi ? Certainement pas le PSG, qui n'a pas réussi à le prolonger. Trois options sont sur la table de l'international argentin, mais aucune ne ferait…","content":"Quelle sera la prochaine équipe de Lionel Messi ? Certainement pas le PSG, qui n'a pas réussi à le prolonger. Trois options sont sur la table de l'international argentin, mais aucune ne ferait l'unanimité. Sa femme aurait une préférence pour les Etats-Unis, tandis que son père ne verrait pas d'un mauvais œil un départ en Arabie Saoudite. La famille de Lionel Messi se déchire. Les proches du champion du monde n'hésitent pas à le conseiller au sujet de son prochain club. Cela fait bien longtemps que le PSG n'est plus une option. En réalité, trois pistes sont sur la table, et l'une d'entre elles ne cesse de prendre de l'épaisseur. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY A en croire plusieurs médias, l 'Inter Miami aurait fait un percée dans ce dossier. Aujourd'hui, la franchise américaine est en pole position dans ce dossier, bien devant le FC Barcelone. Selon le journaliste Joan Fontes , la femme de Messi pousserait pour rejoindre les Etats-Unis. Ce ne serait pas l'avis de Jorge Messi, le père de l'international argentin. A en croire le journaliste catalan, il verrait, plutôt, d'un bon œil un départ en Arabie Saoudite. Le club d' Al-Hilal lui proposerait un salaire record de 600M€. De quoi faire réfléchir...","pubDate":"2023-06-08 04:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225701.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"},{"title":"How Grimsby Town's squad compares to rest of League Two and key decisions to be made","link":"https://www.grimsbytelegraph.co.uk/sport/football/how-grimsby-towns-squad-compares-8503783","keywords":["Sport"],"creator":["newsdesk@grimsbytelegraph.co.uk (Sam Allen)"],"video_url":null,"description":"Town had one of the younger squads in the division last season","content":"There could be noticeable differences to how Grimsby Town’s squad stacks up to the rest of League Two next season compared to how it did last term as the club develops its recruitment strategy. The term “squad composition” was used frequently by Town’s newest board member Gareth Jennings in a recent interview about his role at the club, which could mean a variety of things in terms of what features of each player it refers to. We are yet to see the Mariners’ recruitment plan spring into action as of yet with plenty of time still to go to recruit players, but looking at the key facts about Town’s squad in the 22/23 season we can analyse the things that may change or stay the same. Paul Hurst used 32 players across the season which put Grimsby in the middle of the road compared to the rest of the league, AFC Wimbledon used the most (38) and interestingly, the eventual champions Leyton Orient used the fewest players (26). In fact, all four teams that were promoted ended up using fewer players than Town, which potentially highlights the benefits of running with a tighter group. On the other hand, other factors have to be considered such as the amount of games the Mariners played in all competitions and the importance of having a deep squad to cope with that. In terms of the average age of those players, Town had one of the younger squads in the division at 25.7 years of age, with only eight clubs running with a more youthful group last season. Clubs like Mansfield Town valued experience more than youth with the stags operating with the oldest squad on average (28.4) and having that experience worked well for the likes of Stevenage who had the third oldest team (27.4). Read more: Cleethorpes Town confirm James McKeown decision as Grimsby Town legend set to play on With age, there is likely greater value in having a even balance of young players with potential for growth and others that have been around longer and have a good understanding of what a team needs to be successful. Hurst has always placed great value on being able to develop young talent as a manager so will continue to place trust in those types of players but they need to be surrounded by experience to help them through. With that in mind, Town’s squad was one of the least experienced in the league in terms of appearances with an average of just under 51 total League Two appearances per player. Stevenage were promoted this term and had the most fourth tier experience in their squad with 119.75 average appearances per player. Hurst often spoke of the value of spreading the goals around the team in place of relying on one primary goalscorer, and that was the way his team operated last term with the joint most individual goalscorers across the year (18). The task now will be to increase the overall goal output of the team, because chase conversion was an issue for the team at points. At the same time, Town outperformed the expectation of the team based on where they placed in League Two for market value of their squad compared to where they actually finished. According to TransferMarkt’s estimations. Grimsby had one of the lower valued squads but finished nine places above where they ranked for the overall estimated price of their team. In the end, if Town can stick to a shrewd approach and still get results then there is no reason to deviate from that path. Read more: Grimsby Town will take holistic approach to signings as Paul Hurst closes in on deals Read more: Grimsby Town pre-season schedule in full including Hull City and Lincoln City games Read more: Niall Maher has shown Paul Hurst the key role he can play for Grimsby Town","pubDate":"2023-06-08 04:00:00","image_url":"https://i2-prod.grimsbytelegraph.co.uk/incoming/article8396243.ece/ALTERNATES/s615/0_Bradford-v-GrimsbySky-Bet-EFL-League-Two.jpg","source_id":"grimsbytetelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Surprise au PSG, Mbappé répond au Real Madrid pour son transfert","link":"https://le10sport.com/football/mercato/surprise-au-psg-mbappe-repond-au-real-madrid-pour-son-transfert-648926","keywords":null,"creator":null,"video_url":null,"description":"A plusieurs reprises ces derniers jours, Kylian Mbappé a assuré qu'il serait un joueur du PSG la saison prochaine. Ce qui n'empêche pas certains journalistes espagnoles de le questionner sur un…","content":"A plusieurs reprises ces derniers jours, Kylian Mbappé a assuré qu'il serait un joueur du PSG la saison prochaine. Ce qui n'empêche pas certains journalistes espagnoles de le questionner sur un possible transfert au Real Madrid. Récemment, l'un d'entre eux, José Alvarez a tenté sa chance et a, finalement, obtenu une réponse de la part de la star française. Lié au PSG jusqu'en 2024, Kylian Mbappé n'a pas l'intention d'aller voir ailleurs. Le joueur français l'avait annoncé dès le mois d'avril au micro de France 3. « Le prochain palier ? Gagner la Ligue des champions, je pense. J’ai déjà fait une finale, demi-finale, quart de finale, huitième de finale… J’ai tout fait sauf gagner (sourire). Il ne me manque que ça. j’espère que ça sera le plus rapidement possible. Où ? Au Paris Saint-Germain. Je suis Parisien et sous contrat. Donc c’est le Paris Saint-Germain » avait lâché Mbappé lors de l'émission Tout le Sport. PSG : Transfert légendaire pour Mbappé, il balance en direct https://t.co/ph2p3Mx36r pic.twitter.com/ByoLe1nKhY Sacré, depuis, meilleur joueur de la saison en Ligue 1, Kylian Mbappé en a remis une couche lors de la cérémonie des trophées UNFP. « Mon avenir ? L'année prochaine, je jouerai au Paris Saint-Germain, j'ai encore un contrat, je vais honorer mon contrat » a-t-il lâché, après avoir pourtant rembarré un journaliste espagnol, qui l'avait questionné sur un possible transfert au Real Madrid. « Je suis là pour parler du trophée. Le reste ne m’intéresse pas » a lâché le champion du monde 2018 à José Alvarez, travaillant pour l'émission El Chiringuito . Mais la réponse de Mbappé ne l'a pas découragé, bien au contraire. Présent au Grand Prix de Catalogne dimanche dernier, José Alvarez est tombé nez à nez avec Kylian Mbappé, présent lors de cet évènement aux côtés de Neymar. Le journaliste l'a questionné, à nouveau, sur son avenir au PSG . Cette fois-ci, Mbappé ne l'a pas laissé sans réponse. « Le Real Madrid ? Il y a le temps » a-t-il confié selon José Alvarez.","pubDate":"2023-06-08 04:00:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/225742.jpeg","source_id":"le10sport","category":["sports"],"country":["france"],"language":"french"}]}