{"newsArray":[{"title":"Football. \"Je me suis toujours inspiré de Zizou\" : les penalties de Bouzit offrent la N2 au FCBJ contre La Duchère","link":"https://www.ledauphine.com/sport/2023/06/03/au-bout-du-suspense","keywords":["Sport","Football","Sport national","Bourgoin-Jallieu","Bourgoin-Jallieu-bassin","Edition Bourgoin-Jallieu / Nord-Dauphiné","Fil Web","Isère","Fil Info"],"creator":null,"video_url":null,"description":"Le FC Bourgoin-Jallieu a validé ce samedi sa montée en N2. Un succès 3-0 face à la réserve de La Duchère.","content":"La montée leur tendait les bras depuis des mois. Cette fois-ci, c’est fait ! Les 3 821 supporters berjalliens sont passés par toutes les émotions ce samedi au stade Pierre-Rajon. Frustrés d’abord, lorsque le FCBJ, dominant, a gâché de nombreuses occasions en début de rencontre.... ...pour lire la suite, rejoignez notre communauté d'abonnés et accédez à l'intégralité de nos articles sur le site et l'application mobile à partir de 1 € le 1er mois, sans engagement {'skus': ['ldlswgpremium4']} Google : -50% les 6 premiers mois","pubDate":"2023-06-03 21:48:00","image_url":"https://cdn-s-www.ledauphine.com/images/AEB0D4FE-6259-46FE-8719-853FC6483F4D/NW_listB/bouzit-a-mis-le-fcbj-sur-de-bons-rails-photo-le-dl-h-c-1685830379.jpg","source_id":"ledauphine","category":["sports"],"country":["france"],"language":"french"},{"title":"Erik ten Hag defends David de Gea amid FA Cup criticism with Man Utd future unclear","link":"https://www.mirror.co.uk/sport/football/news/manutd-ten-hag-de-gea-30149356","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"David de Gea came under fire for his performance in the FA Cup final, which Manchester United lost to Manchester City, though the keeper still has the backing of his manager","content":"Erik ten Hag has leapt to the defence of David de Gea after the Manchester United keeper came under fire for his performance in the FA Cup final. De Gea has been Ten Hag's first-choice between the sticks for the entirety of the Dutchman's first season in charge at Old Trafford. But a number of mistakes have plagued his campaign, with a fresh blast coming his way on Saturday . The Spaniard was criticised for his role in Ilkay Gundogan 's second goal, which he could only palm into the bottom corner. That strike proved to be the winner, with United losing their ninth FA Cup final, a new record in the competition. Roy Keane and Jamie Carragher share damning view on David de Gea in FA Cup final Avram Glazer refuses to answer questions on Man Utd takeover after FA Cup final defeat But Ten Hag was not interested in putting any blame on De Gea and instead defended his keeper. He did admit there were \"issues\" to address from United's performance, but he was not focused solely on De Gea. \"In this moment, I don't want to talk about such issues of criticism because we played all a great season - including David De Gea, he played a fantastic season. Say it like this, we are in the right direction,\" Ten Hag said. \"But there are occasions in the game, issues in the game we have to improve, definitely, if we want to make the next step and win trophies. I have only one plan, that is to improve this club and to improve this team. HAVE YOUR SAY! Should Manchester United move on from David de Gea this summer? Comment below . De Gea has come under fire for his performance in the FA Cup final ( Image: Michael Regan - The FA/The FA via Getty Images) \"I have my ideas and I already told the club what we have to do for that but I have to work with my staff, with my players to be better next season. It's not about getting players in and they do well. \"It's about we work all season and day by day to develop the team, progress the team. I'm very proud where we came from in the start of the season.\" Ten Hag's comments come with De Gea's future up in the air, with his contract expiring this summer. He still has not signed fresh terms and United legend Roy Keane has called for Ten Hag to move on from the Spaniard. Ilkay Gundogan scores fastest FA Cup final goal ever after 13 SECONDS vs Man Utd Victor Lindelof hit in face by missile as Man Utd celebrate FA Cup final equaliser \"City have done this set piece before with someone from the edge of the box. He doesn't hit it that cleanly and it goes through bodies but United have to get a new keeper,\" Keane told ITV when analysing Gundogan's second goal. \"They need a world-class striker and a goalkeeper, and other players for strength in depth too. I am sick of saying it. A top goalkeeper saves that. They get you over the line in big games and that could have been the difference today. \"They need a world-class goalkeeper and he isn't. We will keep talking about it. Some of these players aren't good enough for United. They have to spend the money to get the players United deserve.\"","pubDate":"2023-06-03 21:39:40","image_url":"https://i2-prod.mirror.co.uk/incoming/article30149513.ece/ALTERNATES/s615/0_Screenshot-2947.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ligue 1 : défaite du PSG pour la dernière de Messi, Nantes se sauve, l’Europe pour Rennes et Lille","link":"https://www.sudouest.fr/sport/football/ligue1/ligue-1-defaite-du-psg-pour-la-derniere-de-messi-nantes-se-sauve-l-europe-pour-rennes-et-lille-15437857.php","keywords":null,"creator":null,"video_url":null,"description":"Fin du suspense pour l’Europe et le maintien : la dernière journée de Ligue 1, samedi, a sauvé Nantes, envoyé Auxerre en Ligue 2 et offert les deux dernières places européennes à Rennes et Lille. De son","content":"Sacré champion pour la 11e fois - un record - depuis une semaine, le Paris SG a déjà lancé ses grandes manœuvres… au point d’en oublier le terrain. Après celui de Sergio Ramos vendredi, l’officialisation du départ de Lionel Messi est survenue juste avant la rencontre tristement perdue contre Clermont (3-2). Dans une soirée également dédiée au gardien Sergio Rico, blessé gravement dimanche dernier lors d’un accident de cheval, le Parc des princes a aussi manifesté sa colère à l’encontre de l’Argentin, dont les deux saisons à Paris n’ont pas été à la hauteur. La « Pulga » a été sifflée lors de l’annonce de la composition des équipes et n’a pas vraiment pesé, une fois de plus, sur la prestation insipide de son équipe. Paris retiendra seulement le 29e but de Kylian Mbappé, sacré meilleur buteur du Championnat pour la cinquième fois de suite, comme Jean-Pierre Papin entre 1988 et 1992 avec Marseille. Ramos, lui, a fêté son dernier match à Paris avec un but. L’un des rares sourires au PSG, qui ne compte au final qu’un point d’avance sur Lens au classement et a timidement célébré son titre. Les supporters n’osaient même plus y croire, mais c’est arrivé. Après près de quatre mois sans victoire en L1, Nantes a fini par gagner à nouveau, précisément lors du match le plus important de sa saison, contre Angers (1-0). Contre Angers, Ignatius Ganago a fait basculer la Beaujoire dans une ambiance irréelle malgré la fermeture de la tribune de ses supporters ultras : son but a offert aux Canaris un maintien inespéré à la dernière journée. La pelouse a été envahie dès le coup de sifflet final dans la joie et l’effervescence. Les Nantais peuvent aussi remercier Lens, insatiable dauphin qui a joué le jeu pour aller enfoncer Auxerre et l’envoyer en Ligue 2 (3-1). L'AJA, qui avait pourtant son destin en main, retrouve la deuxième division un an après sa montée dans l’élite, aux côtés d’Angers, Ajaccio et Troyes. La catastrophique fin de saison de Monaco s’est confirmée samedi : avec sa défaite contre Toulouse (2-1), la troisième de suite, l’ASM reste à quai au sixième rang et ne jouera pas de Coupe d'Europe la saison prochaine, une situation seulement connue deux fois depuis 2014 par le club du Rocher. Mais la dynamique était bien meilleure du côté de Lille et surtout de Rennes. Les Bretons ont enchaîné une quatrième victoire de suite, à Brest (2-1), et disputeront la Ligue Europa en 2023-24 grâce à leur 4e place. Quant aux Lillois, ils ont stressé mais leur match nul (1-1) à Troyes leur suffit pour obtenir la 5e place, synonyme de barrage de Ligue Europa Conférence. Pour la dernière sortie - sans enjeu - de l’entraîneur croate Igor Tudor, sur le départ, l’OM est reparti avec une nouvelle défaite (1-0) et le match a surtout pris une mesure extrasportive, avec des incidents entre supporters à Ajaccio. Insultes, jets de projectiles, tirs de gaz lacrymogène, cris de singe… Les échauffourées ont commencé vendredi soir et se sont poursuivies samedi, en marge de la rencontre, malgré le regroupement des quelques 600 supporters marseillais dans une fan-zone de dernière minute sur une plage près de l’aéroport. Les images s’ajoutent à celles de vendredi soir en Ligue 2 à Bordeaux, Nîmes ou à un degré moindre Le Havre, divers incidents ayant causé l’interruption temporaire ou définitive des rencontres. La bousculade entre un supporter bordelais et un joueur de Rodez sera étudiée lundi par la Commission de discipline de la Ligue de football professionnel (LFP).","pubDate":"2023-06-03 21:39:22","image_url":null,"source_id":"sudouest","category":["sports"],"country":["france"],"language":"french"},{"title":"Ange Postecoglou refuses to commit future to Celtic after doing treble","link":"https://www.heraldscotland.com/sport/football/23566053.ange-postecoglou-refuses-commit-future-celtic-treble/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"ANGE Postecoglou last night refused to commit his future to Celtic after leading the Parkhead club to a world record eighth domestic treble.","content":"ANGE Postecoglou tonight refused to commit his future to Celtic after leading the Parkhead club to a world record eighth domestic treble. Postecoglou, whose team beat Inverness Caledonian Thistle 3-1 at Hampden today to lift the Scottish Cup, has been strongly linked with a summer move to Spurs in recent days. The Greek-Australian stressed that he was only focused on celebrating the historic success with his players and coaching staff after overseeing a clean sweep of domestic silverware. READ MORE : Celtic 3 Inverness 1: Five talking points as Celtic seal a Treble Asked if he would be at Celtic next season, Postecoglou said: “I anticipate enjoying this moment for the next 24, 48 hours, as long as I can, before somebody drags me away and takes my attention away from enjoying something that has been hard-earned. “The reality of it is there’s probably players in that dressing room who won’t be here next year. That’s the nature of football . “But I want them to enjoy it. I’m going to enjoy it and that’s all I’m going to focus on until somebody grabs me by the collar and tells me that I have to answer certain questions.” Asked if he had a message for Celtic fans who are worried he may leave for North London in the coming days, Postecoglou said: “I would say to them what I would say to the players – let’s enjoy this. “I deserve to enjoy this, the people around me deserve to enjoy this. Whatever other people want to focus on and talk about, I am not going to miss enjoying this moment with this group of people. READ MORE : Celtic's manager search may be brief if Postecoglou hangs up his Spurs “But also I owe it to my family, my friends, those people closest to me. Everyone works hard and makes sacrifices to enjoy these moments. “I understand that other people who aren’t invested in it want to ask these questions, but, for me, right now, the most important thing is that we reflect and just be in the moment of crowning something special. “They (the fans) deserve to enjoy this moment because, irrespective of what happens in the future, why would you not want to enjoy this moment for what it is? It is something historic.”","pubDate":"2023-06-03 21:38:00","image_url":"https://www.heraldscotland.com/resources/images/16850968/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Celtic’s Kyogo Furuhashi wanted by Tottenham Hotspur along with boss Ange Postecoglou","link":"https://www.thescottishsun.co.uk/sport/football/10771361/celtic-kyogo-furuhashi-tottenham-hotspur-ange-postecoglou/","keywords":["Football","Scottish Premiership","Sport","Premier League"],"creator":["Jay Blakeway"],"video_url":null,"description":null,"content":"TOTTENHAM want Ange Postecoglou to bring Japan striker Kyogo Furuhashi with him from Celtic. The prolific marksman, who netted in the Scottish Cup final yesterday, is already on the Spurs list as a partner, cover or even eventual replacement for club talisman Harry Kane . 2 Kyogo is a fan favourite at Parkhead 2 The Japanese international opened the scoring in the Scottish Cup final Credit: Getty And if Postecoglou , 57, agrees to become Tottenham chief this week then that would vastly increase their chances of landing the Japanese ace. Furuhashi , 28, would be ideal for Spurs and they are prepared to pay around £25-30million to make him a major capture. Best known as Kyogo, the Hoops star has been one of the major successes in Postecoglou’s time in Scotland — with 23 goals in 31 league appearances. And, at his age, the chance of the Premier League may also be too good to refuse. READ MORE FOOTBALL STORIES HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife MEGA OFFERS Rangers & Celtic best free bets, bonuses and sign-up offers But there are other clubs in England with Kyogo in their sights because of his finishing, clever running and top attitude. Postecoglou is currently waiting for permission to speak to Spurs supremo Daniel Levy . The Australian enjoys being boss at Celtic but may be open to a new challenge if the job is right. He refused to discuss the role in the aftermath of his Scottish Cup triumph which completed a domestic treble for the Hoops. Asked what his message was to fans worried he was set to leave , Postecoglou said: “I would say to them what I would say to the players – let’s enjoy this. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting “I deserve to enjoy this, the people around me deserve to enjoy this. “Whatever other people want to focus on and talk about, I am not going to miss enjoying this moment with this group of people. “But also I owe it to my family , my friends, those people closest to me. “Everyone works hard and makes sacrifices to enjoy these moments. “I understand that other people who aren’t invested in it want to ask these questions, but for me right now the most important thing is that we reflect and just be in the moment of crowning something special.” Pressed on whether he anticipated being Celtic boss next season, he added: “I anticipate enjoying this moment for the next 24, 48 hours, as long as I can before somebody drags me away and takes my attention away from enjoying something that has been hard-earned.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-06-03 21:37:38","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Calls for ex-Celtic star Anthony Stokes to be extradited to face justice","link":"https://www.thescottishsun.co.uk/sport/football/10771391/calls-ex-celtic-star-anthony-stokes-extradited/","keywords":["Football","Scottish Premiership","Sport","Courts","Crime","Scottish crime"],"creator":["Kevin DUGUID"],"video_url":null,"description":null,"content":"DISGRACED former Celtic striker Anthony Stokes should be extradited to Scotland to face justice after two years on the run, an Elvis impersonator attacked by the thug insisted. Anthony Bradley, 60 — who was headbutted by the ex-Ireland international in a Dublin pub in 2013 — also told how a decade later, Stokes has still not paid him a penny of £195,000 compensation awarded to him in court. 3 Disgraced ex-Celtic striker Anthony Stokes Credit: PA:Press Association 3 Stokes outside Hamilton Sheriff Court in 2020 Credit: Tom Farmer 3 Anthony Bradley was headbutted by Stokes in a Dublin pub Credit: Crispin Rodwell - The Sun Dublin The footballer, 34, was due to be sentenced at Hamilton Sheriff Court in June 2021 for sending offensive texts to the father of his former girlfriend Eilidh Scott. But he failed to show up to face punishment for the crime , which followed a conviction for a seven-month stalking campaign against Eilidh, 31, and a warrant was issued for his arrest. Mr Bradley said he sympathised with Stokes’ victims in Scotland. He added: “They must feel let down. Something should be done now to have him extradited. The system has failed us.” MORE SCOTTISH SUN EXCLUSIVES VICTIMISED Scots journalist among hundreds 'detained and brutally beaten' in Turkey BILLS BATTLE Clutha charity launches legal action after trust 'scammed out of almost £300k' The player is wanted for the breach of a non-harassment order when he sent texts to Eilidh’s dad George. He’d previously admitted hounding Eilidh with more than 100 abusive messages a day. Hours after the warrant was issued he posted a selfie with the caption: “Any bad news?” In July 2022, he was arrested by police in Northern Ireland and placed on a flight from Belfast to Dundee . When Stokes appeared in court via video link, he was given bail. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting Sheriff Scott Pattison asked him if he’d return, and he replied: “Yes, I will be here.” But he did not turn up in August, citing Covid. The same month he shared a rap track online branding police informants as “rats”. Another warrant was issued in September. Mr Bradley said: “To allow him back into Ireland doesn’t make sense given the guy’s history.” He hasn’t received the £25,000 awarded to him in the criminal case before a High Court ruling awarded him another £170,000. The assault victim added: “I’ve had to move on. I cashed in my pension to pay my medical bills.” In 2017, Stokes got a two-year suspended sentence for attacking Mr Bradley, who suffered a broken nose and broken teeth. A Scottish Courts and Tribunals Service spokesman said: “In considering whether or not to grant bail, a sheriff must take into account what is put to the court and the unique facts and circumstances of the case and the accused.” We pay for your stories and videos! Do you have a story or video for The Scottish Sun? Email us at scoop@thesun.co.uk or call 0141 420 5200","pubDate":"2023-06-03 21:20:50","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"River Plate game suspended in distressing scenes as supporter falls to death from stands during match","link":"https://www.thescottishsun.co.uk/sport/football/10771434/river-plate-game-suspended-supporter-falls-death/","keywords":["Football","Sport"],"creator":["Henry Tomlinson"],"video_url":null,"description":null,"content":"A FAN has fallen to their death during River Plate game with Defensa y Justicia in Argentina. The match had to be suspended after 28 minutes due to the tragedy. 5 A supporter fell to their death during the River Plate game against Defensa y Justicia Credit: Getty 5 The game had to be suspended because of the tragedy Credit: AFP 5 The supporter reportedly fell from the upper stand Credit: Getty River Plater confirmed the supporter fell from the upper stand of the Estadio Mas Monumental stadium. A club statement read: \"The Football Safety Committee and Club Atletico River Plate regret to inform that, in this afternoon's match against Defense and Justice, a supporter fell into the void from the Sívori Alta stand and died on the spot. \"The medical service immediately arrived at the area of ​​the incident, as did the police and various security agencies. \"The Sivori Alta grandstand, where the deceased person had his subscription, was at 90 per cent of its capacity. 'At the time of the fall there was no intervention by third parties. It was also verified that there was no situation of violence in the stands or around it. After 30 minutes, the stadium was completely evacuated. \"The security agencies and the specialised fiscal unit for massive events, headed by Dr. Celsa Ramírez, are acting and conducting the pertinent investigations. \"By instruction of the prosecutor, the gallery was closed for 24 hours to obtain evidence.\" Following the incident, there was a commotion on the pitch as referee Fernando Rapallini tried to decide what would happen next. Most read in Football PHIL FALLOUT Holly's true feelings about Phil Schofield revealed after bombshell interview RAGS TO RICHES I was so skint that I had to borrow money for KFC... now I'm worth £2billion 'UTTERLY FAKE' I worked on This Morning but was forced to quit - it was toxic behind scenes GRADE A SURPRISE Watch moment Ally McCoist surprises Rangers-daft actor on his birthday 5 Players from both clubs looked to be in distress Credit: AFP 5 Police, firefighters and forensic experts investigated the scene Credit: AFP The official eventually decided to suspend the match with the score 0-0. A red police tent was then spotted in the ground after it was erected around the supporter. Both sets of players could be seen in distress and upset after the incident while they were still on the pitch. River Plate manager and former Manchester City defender Martin Demichelis went over to clap the home supporters in a show of respect. Club Defensa y Justicia paid respects to the fan that died, as it posted on social media. A statement read: \"Match suspended due to the death of a River fan. \"We send our condolences to the family, the institution and all its supporters.\" Police, firefighters and forensic experts could be seen carrying out work at the site where the supporter fell. Read more on the Scottish Sun THE REAL THING I’m ‘slim thick’ - I look great in pics, men run from my real mom bod MAJOR MAKEOVER I bought an old person’s house & transformed it - but everyone's distracted River Plate went into the game looking to extend their lead to eight points in the Argentine league, while Defensa y Justicia sat in 5th place. The Estadio Mas Monumental was redeveloped in February and now has the biggest capacity in Argentina and can hold 84,567 people.","pubDate":"2023-06-03 21:06:48","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ЧМ-2023 (U20). 1/4 финала. Израиль выбил Бразилию, Италия играет с Колумбией","link":"https://www.sports.ru/football/1115177526-chm-2023-u20-1-4-finala-braziliya-protiv-izrailya-italiya-sygraet-s-ko.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Также в субботу Италия играет с Колумбией.","content":"Сборная Бразилии уступила Израилю (2:3, д.в.) в 1/4 финала молодежного чемпионата мира. Также в субботу Италия играет с Колумбией. В воскресенье Нигерия будет противостоять Южной Корее, а Уругвай сыграет с США. Турнир проходит в Аргентине. ЧМ-2023 (U20) 1/4 финала ПРИМЕЧАНИЕ: время начала матчей – московское. Статистика ЧМ-2023 (U20) Что случится в матче ЦСКА – «Краснодар»? Выберите 6 событий и выиграйте призы","pubDate":"2023-06-03 21:03:00","image_url":null,"source_id":"sports","category":["sports"],"country":["russia"],"language":"russian"},{"title":"Ange Postecoglou’s message to Celtic players after Hampden triumph, what he said about ‘what’s next’ and his fan support","link":"https://www.thescottishsun.co.uk/sport/football/10771230/ange-postecoglou-celtic-hampden-message-youll-never-walk-alone/","keywords":["Football","Scottish Premiership"],"creator":["David Oliver"],"video_url":null,"description":null,"content":"CELTIC fans serenaded him with a rendition of You’ll Never Walk Alone. But Ange Postecoglou still looks set walk away. 7 Ange Postecoglou lapped up the adulation Credit: Kenny Ramsay 7 Fans serenaded the boss and the Hoops players after they completed a Treble Credit: Reuters London’s calling for the Celtic manager after he lifted his fifth trophy in two years. But as the supporters who adore him sang their hearts out after the final whistle, their plea for him to stay looks set to fall on deaf ears. All the signs now are that the Aussie is bound for Tottenham with discussions with Spurs understood to be scheduled for the next 48 hours. Postecoglou was desperate to shut down all talk of his potential exit in his post-match press conference at Hampden. Read More in Football flying away Ange is off... on HOLIDAY as Hoops boss refuses to discuss Spurs job at Hampden Man-BYS Celtic and Inverness player ratings after Hoops clinch Treble with Scottish Cup win But asked about the chants from the stands as they team paraded the trophy, the 57 year-old thanked them for taking him into their hearts. And it seemed like his way of saying goodbye. He said: “I have appreciated the support I’ve had from day one. “Because of the way I came into the football club – without beating about the bush - I was 'a joke'. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting “A lot of people made fun of me – but the supporters for their own reasons put their collective arm around me and said ‘no he’s one of ours’. “It was up to me to repay that faith. The reason they felt so close to this team and so close to me was because while others may have mocked, they stood behind me. “I think they deserve a lot of credit for what has happened because it would have been easy for our supporters to have been just as sceptical given the reaction to my appointment. “That would have made my job a lot tougher, especially in that early period when results weren’t there. “I think they felt part of my journey here and they deserve to feel good about the fact that while a lot of people ridiculed it, they stood by the person who was representing their football club and that’s what makes them special as supporters. “For me, I have tried to repay that in my own way by hopefully producing a team that has brought success and that they are going to be proud of. “But that for me has always been the most important thing.” Postecoglou definitely looked like a man purposely trying to soak up the moment as he paraded the pitch. He added: “I enjoy all of that. You know what it does for people. I’ve said it before, that is the greatest reward you get. As much as you get personal satisfaction to see how it affects others gives you the greatest joy. 7 He savoured the moment with his players Credit: Willie Vass 7 And was drenched in champagne by Joe Hart Credit: Reuters “The supporters, the players, the staff, my family , just seeing what days like today does for them and how it makes them feel, that is the beautiful part. “That gives you great pride . Ultimately everyone is out there with a common purpose to try and be a part of something special. It is in that moment that you get to share it with everybody.” Postecoglou did his best to talk away questions on his future . He tried to make out that it was only people who “weren’t invested in Celtic” who were quizzing him. But that’s not true, is it? It’s the thousands of Celtic supporters who want to know whether or not he’s going. And they’re certainly invested in the club. With this put to him, he added: “Yeah, but, again, they deserve to enjoy this moment because irrespective of what happens in the future why would not want to enjoy this moment for what it is? It is something historic.” Celtic’s players were told the same as the assembled press. Postecoglou gave them no confirmed news either as he urged them to enjoy their moment. He added: “Before you look ahead you have to enjoy it. “Everyone has worked hard for this, it’s been a long season. “Some of our boys have been to a World Cup and they’re still out there putting it in. “It’s been a monumental effort. Kyogo was barely fit today and he’s now got to go and play for his national team. “But his thoughts were just about performing for this club. “They all deserve to enjoy this, it’s not about what’s next for any of them. “I said that to them in the dressing-room. They can celebrate this one a little bit harder because tomorrow there’s a holiday for them. “So I’ve told them to enjoy it and whatever is next will take care of itself.” If Postecoglou does take the offer in the table from Spurs it would be hard to blame him. This is a man who was a relative unknown in the UK just two years ago. No-one in the mainstream media branded him a joke - that’s just not true - but it’s fair to say he was seen as a risky appointment. Now it’s seen as a masterstroke. He’s now the fifth Celtic manager to win a treble with history now showing he was in charge when the club earned its world record eight clean sweep. Callum McGregor has been at the heart of it. 7 Callum McGregor has been a focal point of Postecoglou's plans Credit: Reuters 7 How he arrived... Credit: The Sun 7 ... and how he left Hampden after lifting the Scottish Cup Credit: Getty And he was someone Postecoglou heaped special praise on last night as he got set to celebrate. The skipper has now won FIVE trebles with his trophy haul now standing at 20 medals. Postecoglou added: “It’s mind blowing just to think about it. “I know that they have all come in such a short space of time. Maybe people get complacent and think they are the norm. They’re not, they’re an exception. “Whilst it’s five in a short space of time, when you think about the history of the football club it’s not that common. Read more on the Scottish Sun THE REAL THING I’m ‘slim thick’ - I look great in pics, men run from my real mom bod MAJOR MAKEOVER I bought an old person’s house & transformed it - but everyone's distracted “Look, I’ve said it from the start, he’s been outstanding, an outstanding leader, he’s grown into the role, he’s a fantastic footballer , he’s a fantastic human being and it’s a credit to him and his family that, with many more years to go in his career, that he already stands as one of the GIANTS of this football club. “It’s been great to watch him grow as a person and as a leader in that dressing room . He’s got some good lieutenants in there as well, but it’s a credit to him and no one deserves it more.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-06-03 21:01:38","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Erik ten Hag makes 'only team in the world' claim about Manchester United after FA Cup final","link":"https://www.unitedinfocus.com/match-coverage/erik-ten-hag-makes-only-team-in-the-world-claim-about-manchester-united/","keywords":["Match Coverage","News"],"creator":["Olly Dawes"],"video_url":null,"description":"Manchester United boss Erik ten Hag feels his side are better-placed than anyone to fight back against Manchester City. Ten Hag missed out on a... The post Erik ten Hag makes 'only team in the world' claim about Manchester United after FA Cup final appeared first on United In Focus.","content":"Manchester United boss Erik ten Hag feels his side are better-placed than anyone to fight back against Manchester City. Ten Hag missed out on a domestic cup double on Saturday afternoon, losing 2-1 to Manchester City in the FA Cup final. The Dutchman’s meticulous plans before the game were all but ripped up inside 13 seconds as Ilkay Gundogan smashed City ahead. United didn’t back down though and fought their way back into the game with a Bruno Fernandes penalty. Many will argue whether Jack Grealish’s handball really merited a penalty but it didn’t matter in the end as Gundogan won it for City. Watching your biggest rivals lift a trophy right in front of you is one of those feelings all football fans hope to avoid. That was the sad reality for United supporters on Saturday but Ten Hag was bullish after the final whistle. Ten Hag has done so much to put the confidence and resolve back into this Manchester United squad this season. The United boss wasn’t about to let the heads drop after losing a final and spoke confidently about his players. Speaking to The Independent’s Miguel Delaney , Ten Hag backed his United squad as the only one in the world who can fight back against City. “I think we are the only team in the world capable of fighting back against this City,” said Ten Hag. We’re used to seeing City steamroll teams, especially in recent weeks as they won another Premier League title. Ten Hag has though seen an improvement from United in terms of their displays against City. We don’t need to talk too much about the 6-3 at the Etihad Stadium but the January win was a great display of determination. City took the lead with half an hour to play but United roared back with two goals in four minutes to win 2-1. City again took the lead in the FA Cup final but United didn’t collapse; they stayed in the game and got the equaliser before giving City a scare late on. It wasn’t to be at Wembley but Ten Hag clearly loves the attitude he is seeing from his players against Pep Guardiola’s men – and we now need to see more wins next season.","pubDate":"2023-06-03 21:00:00","image_url":null,"source_id":"unitedinfocus","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Football. \"Je me suis toujours inspiré de Zizou\" : les penalties de Bouzit offrent la N2 au FCBJ contre La Duchère","link":"https://www.ledauphine.com/sport/2023/06/03/au-bout-du-suspense","keywords":["Sport","Football","Sport national","Bourgoin-Jallieu","Bourgoin-Jallieu-bassin","Edition Bourgoin-Jallieu / Nord-Dauphiné","Fil Web","Isère","Fil Info"],"creator":null,"video_url":null,"description":"Le FC Bourgoin-Jallieu a validé ce samedi sa montée en N2. Un succès 3-0 face à la réserve de La Duchère.","content":"La montée leur tendait les bras depuis des mois. Cette fois-ci, c’est fait ! Les 3 821 supporters berjalliens sont passés par toutes les émotions ce samedi au stade Pierre-Rajon. Frustrés d’abord, lorsque le FCBJ, dominant, a gâché de nombreuses occasions en début de rencontre.... ...pour lire la suite, rejoignez notre communauté d'abonnés et accédez à l'intégralité de nos articles sur le site et l'application mobile à partir de 1 € le 1er mois, sans engagement {'skus': ['ldlswgpremium4']} Google : -50% les 6 premiers mois","pubDate":"2023-06-03 21:48:00","image_url":"https://cdn-s-www.ledauphine.com/images/AEB0D4FE-6259-46FE-8719-853FC6483F4D/NW_listB/bouzit-a-mis-le-fcbj-sur-de-bons-rails-photo-le-dl-h-c-1685830379.jpg","source_id":"ledauphine","category":["sports"],"country":["france"],"language":"french"},{"title":"Erik ten Hag defends David de Gea amid FA Cup criticism with Man Utd future unclear","link":"https://www.mirror.co.uk/sport/football/news/manutd-ten-hag-de-gea-30149356","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"David de Gea came under fire for his performance in the FA Cup final, which Manchester United lost to Manchester City, though the keeper still has the backing of his manager","content":"Erik ten Hag has leapt to the defence of David de Gea after the Manchester United keeper came under fire for his performance in the FA Cup final. De Gea has been Ten Hag's first-choice between the sticks for the entirety of the Dutchman's first season in charge at Old Trafford. But a number of mistakes have plagued his campaign, with a fresh blast coming his way on Saturday . The Spaniard was criticised for his role in Ilkay Gundogan 's second goal, which he could only palm into the bottom corner. That strike proved to be the winner, with United losing their ninth FA Cup final, a new record in the competition. Roy Keane and Jamie Carragher share damning view on David de Gea in FA Cup final Avram Glazer refuses to answer questions on Man Utd takeover after FA Cup final defeat But Ten Hag was not interested in putting any blame on De Gea and instead defended his keeper. He did admit there were \"issues\" to address from United's performance, but he was not focused solely on De Gea. \"In this moment, I don't want to talk about such issues of criticism because we played all a great season - including David De Gea, he played a fantastic season. Say it like this, we are in the right direction,\" Ten Hag said. \"But there are occasions in the game, issues in the game we have to improve, definitely, if we want to make the next step and win trophies. I have only one plan, that is to improve this club and to improve this team. HAVE YOUR SAY! Should Manchester United move on from David de Gea this summer? Comment below . De Gea has come under fire for his performance in the FA Cup final ( Image: Michael Regan - The FA/The FA via Getty Images) \"I have my ideas and I already told the club what we have to do for that but I have to work with my staff, with my players to be better next season. It's not about getting players in and they do well. \"It's about we work all season and day by day to develop the team, progress the team. I'm very proud where we came from in the start of the season.\" Ten Hag's comments come with De Gea's future up in the air, with his contract expiring this summer. He still has not signed fresh terms and United legend Roy Keane has called for Ten Hag to move on from the Spaniard. Ilkay Gundogan scores fastest FA Cup final goal ever after 13 SECONDS vs Man Utd Victor Lindelof hit in face by missile as Man Utd celebrate FA Cup final equaliser \"City have done this set piece before with someone from the edge of the box. He doesn't hit it that cleanly and it goes through bodies but United have to get a new keeper,\" Keane told ITV when analysing Gundogan's second goal. \"They need a world-class striker and a goalkeeper, and other players for strength in depth too. I am sick of saying it. A top goalkeeper saves that. They get you over the line in big games and that could have been the difference today. \"They need a world-class goalkeeper and he isn't. We will keep talking about it. Some of these players aren't good enough for United. They have to spend the money to get the players United deserve.\"","pubDate":"2023-06-03 21:39:40","image_url":"https://i2-prod.mirror.co.uk/incoming/article30149513.ece/ALTERNATES/s615/0_Screenshot-2947.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ligue 1 : défaite du PSG pour la dernière de Messi, Nantes se sauve, l’Europe pour Rennes et Lille","link":"https://www.sudouest.fr/sport/football/ligue1/ligue-1-defaite-du-psg-pour-la-derniere-de-messi-nantes-se-sauve-l-europe-pour-rennes-et-lille-15437857.php","keywords":null,"creator":null,"video_url":null,"description":"Fin du suspense pour l’Europe et le maintien : la dernière journée de Ligue 1, samedi, a sauvé Nantes, envoyé Auxerre en Ligue 2 et offert les deux dernières places européennes à Rennes et Lille. De son","content":"Sacré champion pour la 11e fois - un record - depuis une semaine, le Paris SG a déjà lancé ses grandes manœuvres… au point d’en oublier le terrain. Après celui de Sergio Ramos vendredi, l’officialisation du départ de Lionel Messi est survenue juste avant la rencontre tristement perdue contre Clermont (3-2). Dans une soirée également dédiée au gardien Sergio Rico, blessé gravement dimanche dernier lors d’un accident de cheval, le Parc des princes a aussi manifesté sa colère à l’encontre de l’Argentin, dont les deux saisons à Paris n’ont pas été à la hauteur. La « Pulga » a été sifflée lors de l’annonce de la composition des équipes et n’a pas vraiment pesé, une fois de plus, sur la prestation insipide de son équipe. Paris retiendra seulement le 29e but de Kylian Mbappé, sacré meilleur buteur du Championnat pour la cinquième fois de suite, comme Jean-Pierre Papin entre 1988 et 1992 avec Marseille. Ramos, lui, a fêté son dernier match à Paris avec un but. L’un des rares sourires au PSG, qui ne compte au final qu’un point d’avance sur Lens au classement et a timidement célébré son titre. Les supporters n’osaient même plus y croire, mais c’est arrivé. Après près de quatre mois sans victoire en L1, Nantes a fini par gagner à nouveau, précisément lors du match le plus important de sa saison, contre Angers (1-0). Contre Angers, Ignatius Ganago a fait basculer la Beaujoire dans une ambiance irréelle malgré la fermeture de la tribune de ses supporters ultras : son but a offert aux Canaris un maintien inespéré à la dernière journée. La pelouse a été envahie dès le coup de sifflet final dans la joie et l’effervescence. Les Nantais peuvent aussi remercier Lens, insatiable dauphin qui a joué le jeu pour aller enfoncer Auxerre et l’envoyer en Ligue 2 (3-1). L'AJA, qui avait pourtant son destin en main, retrouve la deuxième division un an après sa montée dans l’élite, aux côtés d’Angers, Ajaccio et Troyes. La catastrophique fin de saison de Monaco s’est confirmée samedi : avec sa défaite contre Toulouse (2-1), la troisième de suite, l’ASM reste à quai au sixième rang et ne jouera pas de Coupe d'Europe la saison prochaine, une situation seulement connue deux fois depuis 2014 par le club du Rocher. Mais la dynamique était bien meilleure du côté de Lille et surtout de Rennes. Les Bretons ont enchaîné une quatrième victoire de suite, à Brest (2-1), et disputeront la Ligue Europa en 2023-24 grâce à leur 4e place. Quant aux Lillois, ils ont stressé mais leur match nul (1-1) à Troyes leur suffit pour obtenir la 5e place, synonyme de barrage de Ligue Europa Conférence. Pour la dernière sortie - sans enjeu - de l’entraîneur croate Igor Tudor, sur le départ, l’OM est reparti avec une nouvelle défaite (1-0) et le match a surtout pris une mesure extrasportive, avec des incidents entre supporters à Ajaccio. Insultes, jets de projectiles, tirs de gaz lacrymogène, cris de singe… Les échauffourées ont commencé vendredi soir et se sont poursuivies samedi, en marge de la rencontre, malgré le regroupement des quelques 600 supporters marseillais dans une fan-zone de dernière minute sur une plage près de l’aéroport. Les images s’ajoutent à celles de vendredi soir en Ligue 2 à Bordeaux, Nîmes ou à un degré moindre Le Havre, divers incidents ayant causé l’interruption temporaire ou définitive des rencontres. La bousculade entre un supporter bordelais et un joueur de Rodez sera étudiée lundi par la Commission de discipline de la Ligue de football professionnel (LFP).","pubDate":"2023-06-03 21:39:22","image_url":null,"source_id":"sudouest","category":["sports"],"country":["france"],"language":"french"},{"title":"Ange Postecoglou refuses to commit future to Celtic after doing treble","link":"https://www.heraldscotland.com/sport/football/23566053.ange-postecoglou-refuses-commit-future-celtic-treble/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"ANGE Postecoglou last night refused to commit his future to Celtic after leading the Parkhead club to a world record eighth domestic treble.","content":"ANGE Postecoglou tonight refused to commit his future to Celtic after leading the Parkhead club to a world record eighth domestic treble. Postecoglou, whose team beat Inverness Caledonian Thistle 3-1 at Hampden today to lift the Scottish Cup, has been strongly linked with a summer move to Spurs in recent days. The Greek-Australian stressed that he was only focused on celebrating the historic success with his players and coaching staff after overseeing a clean sweep of domestic silverware. READ MORE : Celtic 3 Inverness 1: Five talking points as Celtic seal a Treble Asked if he would be at Celtic next season, Postecoglou said: “I anticipate enjoying this moment for the next 24, 48 hours, as long as I can, before somebody drags me away and takes my attention away from enjoying something that has been hard-earned. “The reality of it is there’s probably players in that dressing room who won’t be here next year. That’s the nature of football . “But I want them to enjoy it. I’m going to enjoy it and that’s all I’m going to focus on until somebody grabs me by the collar and tells me that I have to answer certain questions.” Asked if he had a message for Celtic fans who are worried he may leave for North London in the coming days, Postecoglou said: “I would say to them what I would say to the players – let’s enjoy this. “I deserve to enjoy this, the people around me deserve to enjoy this. Whatever other people want to focus on and talk about, I am not going to miss enjoying this moment with this group of people. READ MORE : Celtic's manager search may be brief if Postecoglou hangs up his Spurs “But also I owe it to my family, my friends, those people closest to me. Everyone works hard and makes sacrifices to enjoy these moments. “I understand that other people who aren’t invested in it want to ask these questions, but, for me, right now, the most important thing is that we reflect and just be in the moment of crowning something special. “They (the fans) deserve to enjoy this moment because, irrespective of what happens in the future, why would you not want to enjoy this moment for what it is? It is something historic.”","pubDate":"2023-06-03 21:38:00","image_url":"https://www.heraldscotland.com/resources/images/16850968/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Celtic’s Kyogo Furuhashi wanted by Tottenham Hotspur along with boss Ange Postecoglou","link":"https://www.thescottishsun.co.uk/sport/football/10771361/celtic-kyogo-furuhashi-tottenham-hotspur-ange-postecoglou/","keywords":["Football","Scottish Premiership","Sport","Premier League"],"creator":["Jay Blakeway"],"video_url":null,"description":null,"content":"TOTTENHAM want Ange Postecoglou to bring Japan striker Kyogo Furuhashi with him from Celtic. The prolific marksman, who netted in the Scottish Cup final yesterday, is already on the Spurs list as a partner, cover or even eventual replacement for club talisman Harry Kane . 2 Kyogo is a fan favourite at Parkhead 2 The Japanese international opened the scoring in the Scottish Cup final Credit: Getty And if Postecoglou , 57, agrees to become Tottenham chief this week then that would vastly increase their chances of landing the Japanese ace. Furuhashi , 28, would be ideal for Spurs and they are prepared to pay around £25-30million to make him a major capture. Best known as Kyogo, the Hoops star has been one of the major successes in Postecoglou’s time in Scotland — with 23 goals in 31 league appearances. And, at his age, the chance of the Premier League may also be too good to refuse. READ MORE FOOTBALL STORIES HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife MEGA OFFERS Rangers & Celtic best free bets, bonuses and sign-up offers But there are other clubs in England with Kyogo in their sights because of his finishing, clever running and top attitude. Postecoglou is currently waiting for permission to speak to Spurs supremo Daniel Levy . The Australian enjoys being boss at Celtic but may be open to a new challenge if the job is right. He refused to discuss the role in the aftermath of his Scottish Cup triumph which completed a domestic treble for the Hoops. Asked what his message was to fans worried he was set to leave , Postecoglou said: “I would say to them what I would say to the players – let’s enjoy this. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting “I deserve to enjoy this, the people around me deserve to enjoy this. “Whatever other people want to focus on and talk about, I am not going to miss enjoying this moment with this group of people. “But also I owe it to my family , my friends, those people closest to me. “Everyone works hard and makes sacrifices to enjoy these moments. “I understand that other people who aren’t invested in it want to ask these questions, but for me right now the most important thing is that we reflect and just be in the moment of crowning something special.” Pressed on whether he anticipated being Celtic boss next season, he added: “I anticipate enjoying this moment for the next 24, 48 hours, as long as I can before somebody drags me away and takes my attention away from enjoying something that has been hard-earned.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-06-03 21:37:38","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Calls for ex-Celtic star Anthony Stokes to be extradited to face justice","link":"https://www.thescottishsun.co.uk/sport/football/10771391/calls-ex-celtic-star-anthony-stokes-extradited/","keywords":["Football","Scottish Premiership","Sport","Courts","Crime","Scottish crime"],"creator":["Kevin DUGUID"],"video_url":null,"description":null,"content":"DISGRACED former Celtic striker Anthony Stokes should be extradited to Scotland to face justice after two years on the run, an Elvis impersonator attacked by the thug insisted. Anthony Bradley, 60 — who was headbutted by the ex-Ireland international in a Dublin pub in 2013 — also told how a decade later, Stokes has still not paid him a penny of £195,000 compensation awarded to him in court. 3 Disgraced ex-Celtic striker Anthony Stokes Credit: PA:Press Association 3 Stokes outside Hamilton Sheriff Court in 2020 Credit: Tom Farmer 3 Anthony Bradley was headbutted by Stokes in a Dublin pub Credit: Crispin Rodwell - The Sun Dublin The footballer, 34, was due to be sentenced at Hamilton Sheriff Court in June 2021 for sending offensive texts to the father of his former girlfriend Eilidh Scott. But he failed to show up to face punishment for the crime , which followed a conviction for a seven-month stalking campaign against Eilidh, 31, and a warrant was issued for his arrest. Mr Bradley said he sympathised with Stokes’ victims in Scotland. He added: “They must feel let down. Something should be done now to have him extradited. The system has failed us.” MORE SCOTTISH SUN EXCLUSIVES VICTIMISED Scots journalist among hundreds 'detained and brutally beaten' in Turkey BILLS BATTLE Clutha charity launches legal action after trust 'scammed out of almost £300k' The player is wanted for the breach of a non-harassment order when he sent texts to Eilidh’s dad George. He’d previously admitted hounding Eilidh with more than 100 abusive messages a day. Hours after the warrant was issued he posted a selfie with the caption: “Any bad news?” In July 2022, he was arrested by police in Northern Ireland and placed on a flight from Belfast to Dundee . When Stokes appeared in court via video link, he was given bail. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting Sheriff Scott Pattison asked him if he’d return, and he replied: “Yes, I will be here.” But he did not turn up in August, citing Covid. The same month he shared a rap track online branding police informants as “rats”. Another warrant was issued in September. Mr Bradley said: “To allow him back into Ireland doesn’t make sense given the guy’s history.” He hasn’t received the £25,000 awarded to him in the criminal case before a High Court ruling awarded him another £170,000. The assault victim added: “I’ve had to move on. I cashed in my pension to pay my medical bills.” In 2017, Stokes got a two-year suspended sentence for attacking Mr Bradley, who suffered a broken nose and broken teeth. A Scottish Courts and Tribunals Service spokesman said: “In considering whether or not to grant bail, a sheriff must take into account what is put to the court and the unique facts and circumstances of the case and the accused.” We pay for your stories and videos! Do you have a story or video for The Scottish Sun? Email us at scoop@thesun.co.uk or call 0141 420 5200","pubDate":"2023-06-03 21:20:50","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"River Plate game suspended in distressing scenes as supporter falls to death from stands during match","link":"https://www.thescottishsun.co.uk/sport/football/10771434/river-plate-game-suspended-supporter-falls-death/","keywords":["Football","Sport"],"creator":["Henry Tomlinson"],"video_url":null,"description":null,"content":"A FAN has fallen to their death during River Plate game with Defensa y Justicia in Argentina. The match had to be suspended after 28 minutes due to the tragedy. 5 A supporter fell to their death during the River Plate game against Defensa y Justicia Credit: Getty 5 The game had to be suspended because of the tragedy Credit: AFP 5 The supporter reportedly fell from the upper stand Credit: Getty River Plater confirmed the supporter fell from the upper stand of the Estadio Mas Monumental stadium. A club statement read: \"The Football Safety Committee and Club Atletico River Plate regret to inform that, in this afternoon's match against Defense and Justice, a supporter fell into the void from the Sívori Alta stand and died on the spot. \"The medical service immediately arrived at the area of ​​the incident, as did the police and various security agencies. \"The Sivori Alta grandstand, where the deceased person had his subscription, was at 90 per cent of its capacity. 'At the time of the fall there was no intervention by third parties. It was also verified that there was no situation of violence in the stands or around it. After 30 minutes, the stadium was completely evacuated. \"The security agencies and the specialised fiscal unit for massive events, headed by Dr. Celsa Ramírez, are acting and conducting the pertinent investigations. \"By instruction of the prosecutor, the gallery was closed for 24 hours to obtain evidence.\" Following the incident, there was a commotion on the pitch as referee Fernando Rapallini tried to decide what would happen next. Most read in Football PHIL FALLOUT Holly's true feelings about Phil Schofield revealed after bombshell interview RAGS TO RICHES I was so skint that I had to borrow money for KFC... now I'm worth £2billion 'UTTERLY FAKE' I worked on This Morning but was forced to quit - it was toxic behind scenes GRADE A SURPRISE Watch moment Ally McCoist surprises Rangers-daft actor on his birthday 5 Players from both clubs looked to be in distress Credit: AFP 5 Police, firefighters and forensic experts investigated the scene Credit: AFP The official eventually decided to suspend the match with the score 0-0. A red police tent was then spotted in the ground after it was erected around the supporter. Both sets of players could be seen in distress and upset after the incident while they were still on the pitch. River Plate manager and former Manchester City defender Martin Demichelis went over to clap the home supporters in a show of respect. Club Defensa y Justicia paid respects to the fan that died, as it posted on social media. A statement read: \"Match suspended due to the death of a River fan. \"We send our condolences to the family, the institution and all its supporters.\" Police, firefighters and forensic experts could be seen carrying out work at the site where the supporter fell. Read more on the Scottish Sun THE REAL THING I’m ‘slim thick’ - I look great in pics, men run from my real mom bod MAJOR MAKEOVER I bought an old person’s house & transformed it - but everyone's distracted River Plate went into the game looking to extend their lead to eight points in the Argentine league, while Defensa y Justicia sat in 5th place. The Estadio Mas Monumental was redeveloped in February and now has the biggest capacity in Argentina and can hold 84,567 people.","pubDate":"2023-06-03 21:06:48","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ЧМ-2023 (U20). 1/4 финала. Израиль выбил Бразилию, Италия играет с Колумбией","link":"https://www.sports.ru/football/1115177526-chm-2023-u20-1-4-finala-braziliya-protiv-izrailya-italiya-sygraet-s-ko.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Также в субботу Италия играет с Колумбией.","content":"Сборная Бразилии уступила Израилю (2:3, д.в.) в 1/4 финала молодежного чемпионата мира. Также в субботу Италия играет с Колумбией. В воскресенье Нигерия будет противостоять Южной Корее, а Уругвай сыграет с США. Турнир проходит в Аргентине. ЧМ-2023 (U20) 1/4 финала ПРИМЕЧАНИЕ: время начала матчей – московское. Статистика ЧМ-2023 (U20) Что случится в матче ЦСКА – «Краснодар»? Выберите 6 событий и выиграйте призы","pubDate":"2023-06-03 21:03:00","image_url":null,"source_id":"sports","category":["sports"],"country":["russia"],"language":"russian"},{"title":"Ange Postecoglou’s message to Celtic players after Hampden triumph, what he said about ‘what’s next’ and his fan support","link":"https://www.thescottishsun.co.uk/sport/football/10771230/ange-postecoglou-celtic-hampden-message-youll-never-walk-alone/","keywords":["Football","Scottish Premiership"],"creator":["David Oliver"],"video_url":null,"description":null,"content":"CELTIC fans serenaded him with a rendition of You’ll Never Walk Alone. But Ange Postecoglou still looks set walk away. 7 Ange Postecoglou lapped up the adulation Credit: Kenny Ramsay 7 Fans serenaded the boss and the Hoops players after they completed a Treble Credit: Reuters London’s calling for the Celtic manager after he lifted his fifth trophy in two years. But as the supporters who adore him sang their hearts out after the final whistle, their plea for him to stay looks set to fall on deaf ears. All the signs now are that the Aussie is bound for Tottenham with discussions with Spurs understood to be scheduled for the next 48 hours. Postecoglou was desperate to shut down all talk of his potential exit in his post-match press conference at Hampden. Read More in Football flying away Ange is off... on HOLIDAY as Hoops boss refuses to discuss Spurs job at Hampden Man-BYS Celtic and Inverness player ratings after Hoops clinch Treble with Scottish Cup win But asked about the chants from the stands as they team paraded the trophy, the 57 year-old thanked them for taking him into their hearts. And it seemed like his way of saying goodbye. He said: “I have appreciated the support I’ve had from day one. “Because of the way I came into the football club – without beating about the bush - I was 'a joke'. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting “A lot of people made fun of me – but the supporters for their own reasons put their collective arm around me and said ‘no he’s one of ours’. “It was up to me to repay that faith. The reason they felt so close to this team and so close to me was because while others may have mocked, they stood behind me. “I think they deserve a lot of credit for what has happened because it would have been easy for our supporters to have been just as sceptical given the reaction to my appointment. “That would have made my job a lot tougher, especially in that early period when results weren’t there. “I think they felt part of my journey here and they deserve to feel good about the fact that while a lot of people ridiculed it, they stood by the person who was representing their football club and that’s what makes them special as supporters. “For me, I have tried to repay that in my own way by hopefully producing a team that has brought success and that they are going to be proud of. “But that for me has always been the most important thing.” Postecoglou definitely looked like a man purposely trying to soak up the moment as he paraded the pitch. He added: “I enjoy all of that. You know what it does for people. I’ve said it before, that is the greatest reward you get. As much as you get personal satisfaction to see how it affects others gives you the greatest joy. 7 He savoured the moment with his players Credit: Willie Vass 7 And was drenched in champagne by Joe Hart Credit: Reuters “The supporters, the players, the staff, my family , just seeing what days like today does for them and how it makes them feel, that is the beautiful part. “That gives you great pride . Ultimately everyone is out there with a common purpose to try and be a part of something special. It is in that moment that you get to share it with everybody.” Postecoglou did his best to talk away questions on his future . He tried to make out that it was only people who “weren’t invested in Celtic” who were quizzing him. But that’s not true, is it? It’s the thousands of Celtic supporters who want to know whether or not he’s going. And they’re certainly invested in the club. With this put to him, he added: “Yeah, but, again, they deserve to enjoy this moment because irrespective of what happens in the future why would not want to enjoy this moment for what it is? It is something historic.” Celtic’s players were told the same as the assembled press. Postecoglou gave them no confirmed news either as he urged them to enjoy their moment. He added: “Before you look ahead you have to enjoy it. “Everyone has worked hard for this, it’s been a long season. “Some of our boys have been to a World Cup and they’re still out there putting it in. “It’s been a monumental effort. Kyogo was barely fit today and he’s now got to go and play for his national team. “But his thoughts were just about performing for this club. “They all deserve to enjoy this, it’s not about what’s next for any of them. “I said that to them in the dressing-room. They can celebrate this one a little bit harder because tomorrow there’s a holiday for them. “So I’ve told them to enjoy it and whatever is next will take care of itself.” If Postecoglou does take the offer in the table from Spurs it would be hard to blame him. This is a man who was a relative unknown in the UK just two years ago. No-one in the mainstream media branded him a joke - that’s just not true - but it’s fair to say he was seen as a risky appointment. Now it’s seen as a masterstroke. He’s now the fifth Celtic manager to win a treble with history now showing he was in charge when the club earned its world record eight clean sweep. Callum McGregor has been at the heart of it. 7 Callum McGregor has been a focal point of Postecoglou's plans Credit: Reuters 7 How he arrived... Credit: The Sun 7 ... and how he left Hampden after lifting the Scottish Cup Credit: Getty And he was someone Postecoglou heaped special praise on last night as he got set to celebrate. The skipper has now won FIVE trebles with his trophy haul now standing at 20 medals. Postecoglou added: “It’s mind blowing just to think about it. “I know that they have all come in such a short space of time. Maybe people get complacent and think they are the norm. They’re not, they’re an exception. “Whilst it’s five in a short space of time, when you think about the history of the football club it’s not that common. Read more on the Scottish Sun THE REAL THING I’m ‘slim thick’ - I look great in pics, men run from my real mom bod MAJOR MAKEOVER I bought an old person’s house & transformed it - but everyone's distracted “Look, I’ve said it from the start, he’s been outstanding, an outstanding leader, he’s grown into the role, he’s a fantastic footballer , he’s a fantastic human being and it’s a credit to him and his family that, with many more years to go in his career, that he already stands as one of the GIANTS of this football club. “It’s been great to watch him grow as a person and as a leader in that dressing room . He’s got some good lieutenants in there as well, but it’s a credit to him and no one deserves it more.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-06-03 21:01:38","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Erik ten Hag makes 'only team in the world' claim about Manchester United after FA Cup final","link":"https://www.unitedinfocus.com/match-coverage/erik-ten-hag-makes-only-team-in-the-world-claim-about-manchester-united/","keywords":["Match Coverage","News"],"creator":["Olly Dawes"],"video_url":null,"description":"Manchester United boss Erik ten Hag feels his side are better-placed than anyone to fight back against Manchester City. Ten Hag missed out on a... The post Erik ten Hag makes 'only team in the world' claim about Manchester United after FA Cup final appeared first on United In Focus.","content":"Manchester United boss Erik ten Hag feels his side are better-placed than anyone to fight back against Manchester City. Ten Hag missed out on a domestic cup double on Saturday afternoon, losing 2-1 to Manchester City in the FA Cup final. The Dutchman’s meticulous plans before the game were all but ripped up inside 13 seconds as Ilkay Gundogan smashed City ahead. United didn’t back down though and fought their way back into the game with a Bruno Fernandes penalty. Many will argue whether Jack Grealish’s handball really merited a penalty but it didn’t matter in the end as Gundogan won it for City. Watching your biggest rivals lift a trophy right in front of you is one of those feelings all football fans hope to avoid. That was the sad reality for United supporters on Saturday but Ten Hag was bullish after the final whistle. Ten Hag has done so much to put the confidence and resolve back into this Manchester United squad this season. The United boss wasn’t about to let the heads drop after losing a final and spoke confidently about his players. Speaking to The Independent’s Miguel Delaney , Ten Hag backed his United squad as the only one in the world who can fight back against City. “I think we are the only team in the world capable of fighting back against this City,” said Ten Hag. We’re used to seeing City steamroll teams, especially in recent weeks as they won another Premier League title. Ten Hag has though seen an improvement from United in terms of their displays against City. We don’t need to talk too much about the 6-3 at the Etihad Stadium but the January win was a great display of determination. City took the lead with half an hour to play but United roared back with two goals in four minutes to win 2-1. City again took the lead in the FA Cup final but United didn’t collapse; they stayed in the game and got the equaliser before giving City a scare late on. It wasn’t to be at Wembley but Ten Hag clearly loves the attitude he is seeing from his players against Pep Guardiola’s men – and we now need to see more wins next season.","pubDate":"2023-06-03 21:00:00","image_url":null,"source_id":"unitedinfocus","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Football. \"Je me suis toujours inspiré de Zizou\" : les penalties de Bouzit offrent la N2 au FCBJ contre La Duchère","link":"https://www.ledauphine.com/sport/2023/06/03/au-bout-du-suspense","keywords":["Sport","Football","Sport national","Bourgoin-Jallieu","Bourgoin-Jallieu-bassin","Edition Bourgoin-Jallieu / Nord-Dauphiné","Fil Web","Isère","Fil Info"],"creator":null,"video_url":null,"description":"Le FC Bourgoin-Jallieu a validé ce samedi sa montée en N2. Un succès 3-0 face à la réserve de La Duchère.","content":"La montée leur tendait les bras depuis des mois. Cette fois-ci, c’est fait ! Les 3 821 supporters berjalliens sont passés par toutes les émotions ce samedi au stade Pierre-Rajon. Frustrés d’abord, lorsque le FCBJ, dominant, a gâché de nombreuses occasions en début de rencontre.... ...pour lire la suite, rejoignez notre communauté d'abonnés et accédez à l'intégralité de nos articles sur le site et l'application mobile à partir de 1 € le 1er mois, sans engagement {'skus': ['ldlswgpremium4']} Google : -50% les 6 premiers mois","pubDate":"2023-06-03 21:48:00","image_url":"https://cdn-s-www.ledauphine.com/images/AEB0D4FE-6259-46FE-8719-853FC6483F4D/NW_listB/bouzit-a-mis-le-fcbj-sur-de-bons-rails-photo-le-dl-h-c-1685830379.jpg","source_id":"ledauphine","category":["sports"],"country":["france"],"language":"french"},{"title":"Erik ten Hag defends David de Gea amid FA Cup criticism with Man Utd future unclear","link":"https://www.mirror.co.uk/sport/football/news/manutd-ten-hag-de-gea-30149356","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"David de Gea came under fire for his performance in the FA Cup final, which Manchester United lost to Manchester City, though the keeper still has the backing of his manager","content":"Erik ten Hag has leapt to the defence of David de Gea after the Manchester United keeper came under fire for his performance in the FA Cup final. De Gea has been Ten Hag's first-choice between the sticks for the entirety of the Dutchman's first season in charge at Old Trafford. But a number of mistakes have plagued his campaign, with a fresh blast coming his way on Saturday . The Spaniard was criticised for his role in Ilkay Gundogan 's second goal, which he could only palm into the bottom corner. That strike proved to be the winner, with United losing their ninth FA Cup final, a new record in the competition. Roy Keane and Jamie Carragher share damning view on David de Gea in FA Cup final Avram Glazer refuses to answer questions on Man Utd takeover after FA Cup final defeat But Ten Hag was not interested in putting any blame on De Gea and instead defended his keeper. He did admit there were \"issues\" to address from United's performance, but he was not focused solely on De Gea. \"In this moment, I don't want to talk about such issues of criticism because we played all a great season - including David De Gea, he played a fantastic season. Say it like this, we are in the right direction,\" Ten Hag said. \"But there are occasions in the game, issues in the game we have to improve, definitely, if we want to make the next step and win trophies. I have only one plan, that is to improve this club and to improve this team. HAVE YOUR SAY! Should Manchester United move on from David de Gea this summer? Comment below . De Gea has come under fire for his performance in the FA Cup final ( Image: Michael Regan - The FA/The FA via Getty Images) \"I have my ideas and I already told the club what we have to do for that but I have to work with my staff, with my players to be better next season. It's not about getting players in and they do well. \"It's about we work all season and day by day to develop the team, progress the team. I'm very proud where we came from in the start of the season.\" Ten Hag's comments come with De Gea's future up in the air, with his contract expiring this summer. He still has not signed fresh terms and United legend Roy Keane has called for Ten Hag to move on from the Spaniard. Ilkay Gundogan scores fastest FA Cup final goal ever after 13 SECONDS vs Man Utd Victor Lindelof hit in face by missile as Man Utd celebrate FA Cup final equaliser \"City have done this set piece before with someone from the edge of the box. He doesn't hit it that cleanly and it goes through bodies but United have to get a new keeper,\" Keane told ITV when analysing Gundogan's second goal. \"They need a world-class striker and a goalkeeper, and other players for strength in depth too. I am sick of saying it. A top goalkeeper saves that. They get you over the line in big games and that could have been the difference today. \"They need a world-class goalkeeper and he isn't. We will keep talking about it. Some of these players aren't good enough for United. They have to spend the money to get the players United deserve.\"","pubDate":"2023-06-03 21:39:40","image_url":"https://i2-prod.mirror.co.uk/incoming/article30149513.ece/ALTERNATES/s615/0_Screenshot-2947.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ligue 1 : défaite du PSG pour la dernière de Messi, Nantes se sauve, l’Europe pour Rennes et Lille","link":"https://www.sudouest.fr/sport/football/ligue1/ligue-1-defaite-du-psg-pour-la-derniere-de-messi-nantes-se-sauve-l-europe-pour-rennes-et-lille-15437857.php","keywords":null,"creator":null,"video_url":null,"description":"Fin du suspense pour l’Europe et le maintien : la dernière journée de Ligue 1, samedi, a sauvé Nantes, envoyé Auxerre en Ligue 2 et offert les deux dernières places européennes à Rennes et Lille. De son","content":"Sacré champion pour la 11e fois - un record - depuis une semaine, le Paris SG a déjà lancé ses grandes manœuvres… au point d’en oublier le terrain. Après celui de Sergio Ramos vendredi, l’officialisation du départ de Lionel Messi est survenue juste avant la rencontre tristement perdue contre Clermont (3-2). Dans une soirée également dédiée au gardien Sergio Rico, blessé gravement dimanche dernier lors d’un accident de cheval, le Parc des princes a aussi manifesté sa colère à l’encontre de l’Argentin, dont les deux saisons à Paris n’ont pas été à la hauteur. La « Pulga » a été sifflée lors de l’annonce de la composition des équipes et n’a pas vraiment pesé, une fois de plus, sur la prestation insipide de son équipe. Paris retiendra seulement le 29e but de Kylian Mbappé, sacré meilleur buteur du Championnat pour la cinquième fois de suite, comme Jean-Pierre Papin entre 1988 et 1992 avec Marseille. Ramos, lui, a fêté son dernier match à Paris avec un but. L’un des rares sourires au PSG, qui ne compte au final qu’un point d’avance sur Lens au classement et a timidement célébré son titre. Les supporters n’osaient même plus y croire, mais c’est arrivé. Après près de quatre mois sans victoire en L1, Nantes a fini par gagner à nouveau, précisément lors du match le plus important de sa saison, contre Angers (1-0). Contre Angers, Ignatius Ganago a fait basculer la Beaujoire dans une ambiance irréelle malgré la fermeture de la tribune de ses supporters ultras : son but a offert aux Canaris un maintien inespéré à la dernière journée. La pelouse a été envahie dès le coup de sifflet final dans la joie et l’effervescence. Les Nantais peuvent aussi remercier Lens, insatiable dauphin qui a joué le jeu pour aller enfoncer Auxerre et l’envoyer en Ligue 2 (3-1). L'AJA, qui avait pourtant son destin en main, retrouve la deuxième division un an après sa montée dans l’élite, aux côtés d’Angers, Ajaccio et Troyes. La catastrophique fin de saison de Monaco s’est confirmée samedi : avec sa défaite contre Toulouse (2-1), la troisième de suite, l’ASM reste à quai au sixième rang et ne jouera pas de Coupe d'Europe la saison prochaine, une situation seulement connue deux fois depuis 2014 par le club du Rocher. Mais la dynamique était bien meilleure du côté de Lille et surtout de Rennes. Les Bretons ont enchaîné une quatrième victoire de suite, à Brest (2-1), et disputeront la Ligue Europa en 2023-24 grâce à leur 4e place. Quant aux Lillois, ils ont stressé mais leur match nul (1-1) à Troyes leur suffit pour obtenir la 5e place, synonyme de barrage de Ligue Europa Conférence. Pour la dernière sortie - sans enjeu - de l’entraîneur croate Igor Tudor, sur le départ, l’OM est reparti avec une nouvelle défaite (1-0) et le match a surtout pris une mesure extrasportive, avec des incidents entre supporters à Ajaccio. Insultes, jets de projectiles, tirs de gaz lacrymogène, cris de singe… Les échauffourées ont commencé vendredi soir et se sont poursuivies samedi, en marge de la rencontre, malgré le regroupement des quelques 600 supporters marseillais dans une fan-zone de dernière minute sur une plage près de l’aéroport. Les images s’ajoutent à celles de vendredi soir en Ligue 2 à Bordeaux, Nîmes ou à un degré moindre Le Havre, divers incidents ayant causé l’interruption temporaire ou définitive des rencontres. La bousculade entre un supporter bordelais et un joueur de Rodez sera étudiée lundi par la Commission de discipline de la Ligue de football professionnel (LFP).","pubDate":"2023-06-03 21:39:22","image_url":null,"source_id":"sudouest","category":["sports"],"country":["france"],"language":"french"},{"title":"Ange Postecoglou refuses to commit future to Celtic after doing treble","link":"https://www.heraldscotland.com/sport/football/23566053.ange-postecoglou-refuses-commit-future-celtic-treble/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"ANGE Postecoglou last night refused to commit his future to Celtic after leading the Parkhead club to a world record eighth domestic treble.","content":"ANGE Postecoglou tonight refused to commit his future to Celtic after leading the Parkhead club to a world record eighth domestic treble. Postecoglou, whose team beat Inverness Caledonian Thistle 3-1 at Hampden today to lift the Scottish Cup, has been strongly linked with a summer move to Spurs in recent days. The Greek-Australian stressed that he was only focused on celebrating the historic success with his players and coaching staff after overseeing a clean sweep of domestic silverware. READ MORE : Celtic 3 Inverness 1: Five talking points as Celtic seal a Treble Asked if he would be at Celtic next season, Postecoglou said: “I anticipate enjoying this moment for the next 24, 48 hours, as long as I can, before somebody drags me away and takes my attention away from enjoying something that has been hard-earned. “The reality of it is there’s probably players in that dressing room who won’t be here next year. That’s the nature of football . “But I want them to enjoy it. I’m going to enjoy it and that’s all I’m going to focus on until somebody grabs me by the collar and tells me that I have to answer certain questions.” Asked if he had a message for Celtic fans who are worried he may leave for North London in the coming days, Postecoglou said: “I would say to them what I would say to the players – let’s enjoy this. “I deserve to enjoy this, the people around me deserve to enjoy this. Whatever other people want to focus on and talk about, I am not going to miss enjoying this moment with this group of people. READ MORE : Celtic's manager search may be brief if Postecoglou hangs up his Spurs “But also I owe it to my family, my friends, those people closest to me. Everyone works hard and makes sacrifices to enjoy these moments. “I understand that other people who aren’t invested in it want to ask these questions, but, for me, right now, the most important thing is that we reflect and just be in the moment of crowning something special. “They (the fans) deserve to enjoy this moment because, irrespective of what happens in the future, why would you not want to enjoy this moment for what it is? It is something historic.”","pubDate":"2023-06-03 21:38:00","image_url":"https://www.heraldscotland.com/resources/images/16850968/?type=app&htype=0","source_id":"heraldscotland","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Celtic’s Kyogo Furuhashi wanted by Tottenham Hotspur along with boss Ange Postecoglou","link":"https://www.thescottishsun.co.uk/sport/football/10771361/celtic-kyogo-furuhashi-tottenham-hotspur-ange-postecoglou/","keywords":["Football","Scottish Premiership","Sport","Premier League"],"creator":["Jay Blakeway"],"video_url":null,"description":null,"content":"TOTTENHAM want Ange Postecoglou to bring Japan striker Kyogo Furuhashi with him from Celtic. The prolific marksman, who netted in the Scottish Cup final yesterday, is already on the Spurs list as a partner, cover or even eventual replacement for club talisman Harry Kane . 2 Kyogo is a fan favourite at Parkhead 2 The Japanese international opened the scoring in the Scottish Cup final Credit: Getty And if Postecoglou , 57, agrees to become Tottenham chief this week then that would vastly increase their chances of landing the Japanese ace. Furuhashi , 28, would be ideal for Spurs and they are prepared to pay around £25-30million to make him a major capture. Best known as Kyogo, the Hoops star has been one of the major successes in Postecoglou’s time in Scotland — with 23 goals in 31 league appearances. And, at his age, the chance of the Premier League may also be too good to refuse. READ MORE FOOTBALL STORIES HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife MEGA OFFERS Rangers & Celtic best free bets, bonuses and sign-up offers But there are other clubs in England with Kyogo in their sights because of his finishing, clever running and top attitude. Postecoglou is currently waiting for permission to speak to Spurs supremo Daniel Levy . The Australian enjoys being boss at Celtic but may be open to a new challenge if the job is right. He refused to discuss the role in the aftermath of his Scottish Cup triumph which completed a domestic treble for the Hoops. Asked what his message was to fans worried he was set to leave , Postecoglou said: “I would say to them what I would say to the players – let’s enjoy this. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting “I deserve to enjoy this, the people around me deserve to enjoy this. “Whatever other people want to focus on and talk about, I am not going to miss enjoying this moment with this group of people. “But also I owe it to my family , my friends, those people closest to me. “Everyone works hard and makes sacrifices to enjoy these moments. “I understand that other people who aren’t invested in it want to ask these questions, but for me right now the most important thing is that we reflect and just be in the moment of crowning something special.” Pressed on whether he anticipated being Celtic boss next season, he added: “I anticipate enjoying this moment for the next 24, 48 hours, as long as I can before somebody drags me away and takes my attention away from enjoying something that has been hard-earned.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-06-03 21:37:38","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Calls for ex-Celtic star Anthony Stokes to be extradited to face justice","link":"https://www.thescottishsun.co.uk/sport/football/10771391/calls-ex-celtic-star-anthony-stokes-extradited/","keywords":["Football","Scottish Premiership","Sport","Courts","Crime","Scottish crime"],"creator":["Kevin DUGUID"],"video_url":null,"description":null,"content":"DISGRACED former Celtic striker Anthony Stokes should be extradited to Scotland to face justice after two years on the run, an Elvis impersonator attacked by the thug insisted. Anthony Bradley, 60 — who was headbutted by the ex-Ireland international in a Dublin pub in 2013 — also told how a decade later, Stokes has still not paid him a penny of £195,000 compensation awarded to him in court. 3 Disgraced ex-Celtic striker Anthony Stokes Credit: PA:Press Association 3 Stokes outside Hamilton Sheriff Court in 2020 Credit: Tom Farmer 3 Anthony Bradley was headbutted by Stokes in a Dublin pub Credit: Crispin Rodwell - The Sun Dublin The footballer, 34, was due to be sentenced at Hamilton Sheriff Court in June 2021 for sending offensive texts to the father of his former girlfriend Eilidh Scott. But he failed to show up to face punishment for the crime , which followed a conviction for a seven-month stalking campaign against Eilidh, 31, and a warrant was issued for his arrest. Mr Bradley said he sympathised with Stokes’ victims in Scotland. He added: “They must feel let down. Something should be done now to have him extradited. The system has failed us.” MORE SCOTTISH SUN EXCLUSIVES VICTIMISED Scots journalist among hundreds 'detained and brutally beaten' in Turkey BILLS BATTLE Clutha charity launches legal action after trust 'scammed out of almost £300k' The player is wanted for the breach of a non-harassment order when he sent texts to Eilidh’s dad George. He’d previously admitted hounding Eilidh with more than 100 abusive messages a day. Hours after the warrant was issued he posted a selfie with the caption: “Any bad news?” In July 2022, he was arrested by police in Northern Ireland and placed on a flight from Belfast to Dundee . When Stokes appeared in court via video link, he was given bail. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting Sheriff Scott Pattison asked him if he’d return, and he replied: “Yes, I will be here.” But he did not turn up in August, citing Covid. The same month he shared a rap track online branding police informants as “rats”. Another warrant was issued in September. Mr Bradley said: “To allow him back into Ireland doesn’t make sense given the guy’s history.” He hasn’t received the £25,000 awarded to him in the criminal case before a High Court ruling awarded him another £170,000. The assault victim added: “I’ve had to move on. I cashed in my pension to pay my medical bills.” In 2017, Stokes got a two-year suspended sentence for attacking Mr Bradley, who suffered a broken nose and broken teeth. A Scottish Courts and Tribunals Service spokesman said: “In considering whether or not to grant bail, a sheriff must take into account what is put to the court and the unique facts and circumstances of the case and the accused.” We pay for your stories and videos! Do you have a story or video for The Scottish Sun? Email us at scoop@thesun.co.uk or call 0141 420 5200","pubDate":"2023-06-03 21:20:50","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"River Plate game suspended in distressing scenes as supporter falls to death from stands during match","link":"https://www.thescottishsun.co.uk/sport/football/10771434/river-plate-game-suspended-supporter-falls-death/","keywords":["Football","Sport"],"creator":["Henry Tomlinson"],"video_url":null,"description":null,"content":"A FAN has fallen to their death during River Plate game with Defensa y Justicia in Argentina. The match had to be suspended after 28 minutes due to the tragedy. 5 A supporter fell to their death during the River Plate game against Defensa y Justicia Credit: Getty 5 The game had to be suspended because of the tragedy Credit: AFP 5 The supporter reportedly fell from the upper stand Credit: Getty River Plater confirmed the supporter fell from the upper stand of the Estadio Mas Monumental stadium. A club statement read: \"The Football Safety Committee and Club Atletico River Plate regret to inform that, in this afternoon's match against Defense and Justice, a supporter fell into the void from the Sívori Alta stand and died on the spot. \"The medical service immediately arrived at the area of ​​the incident, as did the police and various security agencies. \"The Sivori Alta grandstand, where the deceased person had his subscription, was at 90 per cent of its capacity. 'At the time of the fall there was no intervention by third parties. It was also verified that there was no situation of violence in the stands or around it. After 30 minutes, the stadium was completely evacuated. \"The security agencies and the specialised fiscal unit for massive events, headed by Dr. Celsa Ramírez, are acting and conducting the pertinent investigations. \"By instruction of the prosecutor, the gallery was closed for 24 hours to obtain evidence.\" Following the incident, there was a commotion on the pitch as referee Fernando Rapallini tried to decide what would happen next. Most read in Football PHIL FALLOUT Holly's true feelings about Phil Schofield revealed after bombshell interview RAGS TO RICHES I was so skint that I had to borrow money for KFC... now I'm worth £2billion 'UTTERLY FAKE' I worked on This Morning but was forced to quit - it was toxic behind scenes GRADE A SURPRISE Watch moment Ally McCoist surprises Rangers-daft actor on his birthday 5 Players from both clubs looked to be in distress Credit: AFP 5 Police, firefighters and forensic experts investigated the scene Credit: AFP The official eventually decided to suspend the match with the score 0-0. A red police tent was then spotted in the ground after it was erected around the supporter. Both sets of players could be seen in distress and upset after the incident while they were still on the pitch. River Plate manager and former Manchester City defender Martin Demichelis went over to clap the home supporters in a show of respect. Club Defensa y Justicia paid respects to the fan that died, as it posted on social media. A statement read: \"Match suspended due to the death of a River fan. \"We send our condolences to the family, the institution and all its supporters.\" Police, firefighters and forensic experts could be seen carrying out work at the site where the supporter fell. Read more on the Scottish Sun THE REAL THING I’m ‘slim thick’ - I look great in pics, men run from my real mom bod MAJOR MAKEOVER I bought an old person’s house & transformed it - but everyone's distracted River Plate went into the game looking to extend their lead to eight points in the Argentine league, while Defensa y Justicia sat in 5th place. The Estadio Mas Monumental was redeveloped in February and now has the biggest capacity in Argentina and can hold 84,567 people.","pubDate":"2023-06-03 21:06:48","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ЧМ-2023 (U20). 1/4 финала. Израиль выбил Бразилию, Италия играет с Колумбией","link":"https://www.sports.ru/football/1115177526-chm-2023-u20-1-4-finala-braziliya-protiv-izrailya-italiya-sygraet-s-ko.html","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Также в субботу Италия играет с Колумбией.","content":"Сборная Бразилии уступила Израилю (2:3, д.в.) в 1/4 финала молодежного чемпионата мира. Также в субботу Италия играет с Колумбией. В воскресенье Нигерия будет противостоять Южной Корее, а Уругвай сыграет с США. Турнир проходит в Аргентине. ЧМ-2023 (U20) 1/4 финала ПРИМЕЧАНИЕ: время начала матчей – московское. Статистика ЧМ-2023 (U20) Что случится в матче ЦСКА – «Краснодар»? Выберите 6 событий и выиграйте призы","pubDate":"2023-06-03 21:03:00","image_url":null,"source_id":"sports","category":["sports"],"country":["russia"],"language":"russian"},{"title":"Ange Postecoglou’s message to Celtic players after Hampden triumph, what he said about ‘what’s next’ and his fan support","link":"https://www.thescottishsun.co.uk/sport/football/10771230/ange-postecoglou-celtic-hampden-message-youll-never-walk-alone/","keywords":["Football","Scottish Premiership"],"creator":["David Oliver"],"video_url":null,"description":null,"content":"CELTIC fans serenaded him with a rendition of You’ll Never Walk Alone. But Ange Postecoglou still looks set walk away. 7 Ange Postecoglou lapped up the adulation Credit: Kenny Ramsay 7 Fans serenaded the boss and the Hoops players after they completed a Treble Credit: Reuters London’s calling for the Celtic manager after he lifted his fifth trophy in two years. But as the supporters who adore him sang their hearts out after the final whistle, their plea for him to stay looks set to fall on deaf ears. All the signs now are that the Aussie is bound for Tottenham with discussions with Spurs understood to be scheduled for the next 48 hours. Postecoglou was desperate to shut down all talk of his potential exit in his post-match press conference at Hampden. Read More in Football flying away Ange is off... on HOLIDAY as Hoops boss refuses to discuss Spurs job at Hampden Man-BYS Celtic and Inverness player ratings after Hoops clinch Treble with Scottish Cup win But asked about the chants from the stands as they team paraded the trophy, the 57 year-old thanked them for taking him into their hearts. And it seemed like his way of saying goodbye. He said: “I have appreciated the support I’ve had from day one. “Because of the way I came into the football club – without beating about the bush - I was 'a joke'. Most read in Football HOOPS-DAFT Celebrity Celtic fan spotted at Scottish Cup final v Inverness with wife cro blimey Rangers will cash in as Aberdeen seal future-proof Ross McCrorie deal worth £3m GREEN DAY Celtic fans march to Hampden before Scottish Cup Final 'TIME TO SWITCH' Fans switch to ITV for FA Cup final after realising who is presenting “A lot of people made fun of me – but the supporters for their own reasons put their collective arm around me and said ‘no he’s one of ours’. “It was up to me to repay that faith. The reason they felt so close to this team and so close to me was because while others may have mocked, they stood behind me. “I think they deserve a lot of credit for what has happened because it would have been easy for our supporters to have been just as sceptical given the reaction to my appointment. “That would have made my job a lot tougher, especially in that early period when results weren’t there. “I think they felt part of my journey here and they deserve to feel good about the fact that while a lot of people ridiculed it, they stood by the person who was representing their football club and that’s what makes them special as supporters. “For me, I have tried to repay that in my own way by hopefully producing a team that has brought success and that they are going to be proud of. “But that for me has always been the most important thing.” Postecoglou definitely looked like a man purposely trying to soak up the moment as he paraded the pitch. He added: “I enjoy all of that. You know what it does for people. I’ve said it before, that is the greatest reward you get. As much as you get personal satisfaction to see how it affects others gives you the greatest joy. 7 He savoured the moment with his players Credit: Willie Vass 7 And was drenched in champagne by Joe Hart Credit: Reuters “The supporters, the players, the staff, my family , just seeing what days like today does for them and how it makes them feel, that is the beautiful part. “That gives you great pride . Ultimately everyone is out there with a common purpose to try and be a part of something special. It is in that moment that you get to share it with everybody.” Postecoglou did his best to talk away questions on his future . He tried to make out that it was only people who “weren’t invested in Celtic” who were quizzing him. But that’s not true, is it? It’s the thousands of Celtic supporters who want to know whether or not he’s going. And they’re certainly invested in the club. With this put to him, he added: “Yeah, but, again, they deserve to enjoy this moment because irrespective of what happens in the future why would not want to enjoy this moment for what it is? It is something historic.” Celtic’s players were told the same as the assembled press. Postecoglou gave them no confirmed news either as he urged them to enjoy their moment. He added: “Before you look ahead you have to enjoy it. “Everyone has worked hard for this, it’s been a long season. “Some of our boys have been to a World Cup and they’re still out there putting it in. “It’s been a monumental effort. Kyogo was barely fit today and he’s now got to go and play for his national team. “But his thoughts were just about performing for this club. “They all deserve to enjoy this, it’s not about what’s next for any of them. “I said that to them in the dressing-room. They can celebrate this one a little bit harder because tomorrow there’s a holiday for them. “So I’ve told them to enjoy it and whatever is next will take care of itself.” If Postecoglou does take the offer in the table from Spurs it would be hard to blame him. This is a man who was a relative unknown in the UK just two years ago. No-one in the mainstream media branded him a joke - that’s just not true - but it’s fair to say he was seen as a risky appointment. Now it’s seen as a masterstroke. He’s now the fifth Celtic manager to win a treble with history now showing he was in charge when the club earned its world record eight clean sweep. Callum McGregor has been at the heart of it. 7 Callum McGregor has been a focal point of Postecoglou's plans Credit: Reuters 7 How he arrived... Credit: The Sun 7 ... and how he left Hampden after lifting the Scottish Cup Credit: Getty And he was someone Postecoglou heaped special praise on last night as he got set to celebrate. The skipper has now won FIVE trebles with his trophy haul now standing at 20 medals. Postecoglou added: “It’s mind blowing just to think about it. “I know that they have all come in such a short space of time. Maybe people get complacent and think they are the norm. They’re not, they’re an exception. “Whilst it’s five in a short space of time, when you think about the history of the football club it’s not that common. Read more on the Scottish Sun THE REAL THING I’m ‘slim thick’ - I look great in pics, men run from my real mom bod MAJOR MAKEOVER I bought an old person’s house & transformed it - but everyone's distracted “Look, I’ve said it from the start, he’s been outstanding, an outstanding leader, he’s grown into the role, he’s a fantastic footballer , he’s a fantastic human being and it’s a credit to him and his family that, with many more years to go in his career, that he already stands as one of the GIANTS of this football club. “It’s been great to watch him grow as a person and as a leader in that dressing room . He’s got some good lieutenants in there as well, but it’s a credit to him and no one deserves it more.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-06-03 21:01:38","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Erik ten Hag makes 'only team in the world' claim about Manchester United after FA Cup final","link":"https://www.unitedinfocus.com/match-coverage/erik-ten-hag-makes-only-team-in-the-world-claim-about-manchester-united/","keywords":["Match Coverage","News"],"creator":["Olly Dawes"],"video_url":null,"description":"Manchester United boss Erik ten Hag feels his side are better-placed than anyone to fight back against Manchester City. Ten Hag missed out on a... The post Erik ten Hag makes 'only team in the world' claim about Manchester United after FA Cup final appeared first on United In Focus.","content":"Manchester United boss Erik ten Hag feels his side are better-placed than anyone to fight back against Manchester City. Ten Hag missed out on a domestic cup double on Saturday afternoon, losing 2-1 to Manchester City in the FA Cup final. The Dutchman’s meticulous plans before the game were all but ripped up inside 13 seconds as Ilkay Gundogan smashed City ahead. United didn’t back down though and fought their way back into the game with a Bruno Fernandes penalty. Many will argue whether Jack Grealish’s handball really merited a penalty but it didn’t matter in the end as Gundogan won it for City. Watching your biggest rivals lift a trophy right in front of you is one of those feelings all football fans hope to avoid. That was the sad reality for United supporters on Saturday but Ten Hag was bullish after the final whistle. Ten Hag has done so much to put the confidence and resolve back into this Manchester United squad this season. The United boss wasn’t about to let the heads drop after losing a final and spoke confidently about his players. Speaking to The Independent’s Miguel Delaney , Ten Hag backed his United squad as the only one in the world who can fight back against City. “I think we are the only team in the world capable of fighting back against this City,” said Ten Hag. We’re used to seeing City steamroll teams, especially in recent weeks as they won another Premier League title. Ten Hag has though seen an improvement from United in terms of their displays against City. We don’t need to talk too much about the 6-3 at the Etihad Stadium but the January win was a great display of determination. City took the lead with half an hour to play but United roared back with two goals in four minutes to win 2-1. City again took the lead in the FA Cup final but United didn’t collapse; they stayed in the game and got the equaliser before giving City a scare late on. It wasn’t to be at Wembley but Ten Hag clearly loves the attitude he is seeing from his players against Pep Guardiola’s men – and we now need to see more wins next season.","pubDate":"2023-06-03 21:00:00","image_url":null,"source_id":"unitedinfocus","category":["sports"],"country":["nigeria"],"language":"english"}]}