{"newsArray":[{"title":"FIFA World Cup 2022 | Full Mexico squad and schedule","link":"https://www.thehindu.com/sport/football/fifa-world-cup-2022-full-mexico-squad-and-schedule/article66104796.ece","keywords":null,"creator":["\n         The Hindu Bureau  \n    "],"video_url":null,"description":"Here is the official Mexico national football team squad and their group C stage schedule for the FIFA World Cup 2022","content":null,"pubDate":"2022-11-17 06:09:34","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 | Full Poland squad and schedule","link":"https://www.thehindu.com/sport/football/fifa-world-cup-2022-full-poland-squad-and-schedule/article66104951.ece","keywords":null,"creator":["\n         The Hindu Bureau  \n    "],"video_url":null,"description":"Here is the official Poland national football team squad and their group C stage schedule for the FIFA World Cup 2022","content":null,"pubDate":"2022-11-17 06:05:22","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Lee Gannon focused on football only after breakthrough season with Dublin","link":"https://www.irishmirror.ie/sport/gaa/gaelic-football/gaelic-football-news/lee-gannon-focused-football-only-28509158","keywords":["Sport"],"creator":["news@irishmirror.ie (Pat Nolan)"],"video_url":null,"description":"The Whitehall Colmcilles man's first love when coming through underage ranks was hurling","content":null,"pubDate":"2022-11-17 06:00:00","image_url":"https://i2-prod.irishmirror.ie/sport/gaa/gaelic-football/article28505871.ece/ALTERNATES/s98/0_AIG-5.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 | Full Saudi Arabia squad and schedule","link":"https://www.thehindu.com/sport/football/fifa-world-cup-2022-full-saudi-arabia-squad-and-schedule/article66105018.ece","keywords":null,"creator":["\n         The Hindu Bureau  \n    "],"video_url":null,"description":"Here is the official Saudi Arabia national football team squad and their group C stage schedule for the FIFA World Cup 2022","content":null,"pubDate":"2022-11-17 05:45:23","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 | Full Australia squad and schedule","link":"https://www.thehindu.com/sport/football/fifa-world-cup-2022-full-australia-squad-and-schedule/article66105123.ece","keywords":null,"creator":["\n         The Hindu Bureau  \n    "],"video_url":null,"description":"Here is the official Australia national football team squad and their group D stage schedule for the FIFA World Cup 2022","content":null,"pubDate":"2022-11-17 05:35:19","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Terrible situation’: Crows to honour Heather in prelim","link":"https://www.themercury.com.au/sport/afl/aflw/aflw-all-the-news-out-of-the-crows-ahead-of-preliminary-final/news-story/422e929d5cdebe60b1879c54111c8b3d","keywords":["AFL","AFLW"],"creator":null,"video_url":null,"description":"Adelaide AFLW coach Matthew Clarke says it has been a “terrible week” for him and his side after the death of 2017 premiership-winning Crow Heather Anderson.","content":"But Clarke says they will honour their former teammate when they take on Brisbane at Metricon Stadium on Friday night for a place in the grand final next week.The 2017 premiership player took her own life at just 28-years-old on Sunday in Perth.The Crows side that will take on Brisbane in the preliminary final features a number of Anderson’s former teammates including captain Chelsea Randall, star midfielders Ebony Marinoff and Anne Hatchard and forward Stevie-Lee Thompson.“She is one of our people, and particularly for those players and staff who played alongside her or were at the club with her it was just really tragic and sad,” Clarke said.“We have tried to support those people the best we could but at the end of the day it is a terrible situation.“There will be a couple of moments of reflection, which we will observe. The players will wear black armbands and pink shoelaces.“It has been a terrible week to be honest.”Clarke said the 2017 team got together during the week and was confident that enough support had been provided to players and staff.“We have a great support network in terms of welfare people and psychologists. It is also about being there for each other,” he said.“But clearly whatever you are going through you can’t help but reflect back on the family and what they are going through.“Ultimately there is still a game of footy to be played and while it has been a really challenging week there is also a joy in being a part of a footy team and it is a pretty good place to be at any time but in some periods of challenge it is a great place to be.“So we look forward to being out there together as a team and making the most as an opportunity.”The Crows and Lions again clash in a high stakes AFLW game, which Clarke said had become a feature of the competition.“I think that is one of the exciting things in the AFLW which is still very young,” he said.“Already there are these rivalries developing and it is a massive part of football and why people come to the game.”LIFELINE FACT BOXFor veteran support contact:• Defence All-hours Support Line: 1800 628 036• Defence Member and Family Helpline staffed by social workers and psychologists: 1800 624 608• For out-of-hours or away-from-base assistance: 1800 IMSICK (1800 467 425)• Open Arms – Veterans & Families Counselling (formerly VVCS) provides free and confidential counselling and support for current and former serving ADF members and their families. They can be reached 24 hours a day, seven days a week on 1800 011 046Open Arms also has Safe Zone Support which can be accessed online or on 1800 142 072.• The Department of Veterans’ Affairs (DVA): 1800 838 372","pubDate":"2022-11-17 05:07:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 live streaming: Where to watch, schedule & groups","link":"https://economictimes.indiatimes.com/news/sports/fifa-world-cup-2022-live-streaming-where-to-match-schedule-matches/articleshow/95571334.cms","keywords":null,"creator":null,"video_url":null,"description":"The 2022 FIFA World Cup will be played in Qatar in November as France will be aiming to defend its 2018 title, but it will be a huge task as the other football powerhouses like Brazil, Belgium and Argentina are poised to pose a massive challenge. Here's all the information on FIFA World Cup 2022 live streaming.","content":null,"pubDate":"2022-11-17 05:03:06","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-179288,resizemode-4,msid-95571334/fifa-world-cup-2022-live-streaming-where-to-watch-schedule-groups.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"All-Ireland champions prove in different class to first-time provincial finalists","link":"https://connachttribune.ie/all-ireland-champions-prove-in-different-class-to-first-time-provincial-finalists/","keywords":["Connacht Tribune","Sports","connacht tribune","kilkerrin clonberne v burrishoole","connacht ladies football senior title"],"creator":["Our Reporter"],"video_url":null,"description":"Kilkerrin/Clonberne 1-15 Burrishoole 0-4 Gerard Mulreaney in Charlestown KILKERRIN/Clonberne won a landmark fifth successive Connacht Ladies Football Senior title after a comprehensive 14-point win over Mayo champions Burrishoole in Charlestown on Sunday. Burrishoole, who were competing in their first Connacht final, beat Leitrim’s Glencar-Manorhamilton in the semi-final but were no match for the current All-Ireland […]","content":"Kilkerrin/Clonberne 1-15 Burrishoole 0-4 Gerard Mulreaney in Charlestown KILKERRIN/Clonberne won a landmark fifth successive Connacht Ladies Football Senior title after a comprehensive 14-point win over Mayo champions Burrishoole in Charlestown on Sunday. Burrishoole, who were competing in their first Connacht final, beat Leitrim’s Glencar-Manorhamilton in the semi-final but were no match for the current All-Ireland club champions on a very heavy pitch following a downpour prior to throw-in. Full-forward Ailish Morrissey scored the only goal of the game in the second half, while Eva Noone top scored for Kilkerrin/Clonberne with five points. The Galway champions started off on the front foot, with the opening score of the game coming inside 90 seconds, courtesy of corner-forward Chloe Miskell, after Eva Noone pounced on a short kick-out to send Miskell into score. Willie Ward’s charges, helped by a strong wind in the first half, then opened up a four point advantage after ten minutes with further points from Lynsey Noone and two frees from her sister Eva. Despite the early onslaught, Burrishoole scored two frees from Maria Canon to reduce the deficit to two points. Kilkerrin/Clonberne were defending from the front, with Morrissey, Miskell, Louise Ward and the Noone sisters, Eva and Lynsey, putting pressure on the Burrishoole defence anytime they tried to play out from the back. For more, read this week’s Connacht Tribune. Connacht Tribune Digital Edition App Download the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play. Or purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE . Get the Connacht Tribune Live app The Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.","pubDate":"2022-11-17 05:00:54","image_url":null,"source_id":"connachttribune","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Moycullen hit new heights in terrific provincial debut","link":"https://connachttribune.ie/moycullen-hit-new-heights-in-terrific-provincial-debut/","keywords":["Connacht Tribune","Sports","connacht tribune","moycullen v westport"],"creator":["John McIntyre"],"video_url":null,"description":"Moycullen 3-18 Westport 1-12 John McIntyre at MacHale Park IT was worth waiting for. Moycullen’s belated first experience of provincial senior club football could hardly have gone any better when routing Westport in a lively Connacht quarter-final at MacHale Park on Sunday. The Covid pandemic had denied Moycullen the opportunity of testing their worth outside […]","content":"Moycullen 3-18 Westport 1-12 John McIntyre at MacHale Park IT was worth waiting for. Moycullen’s belated first experience of provincial senior club football could hardly have gone any better when routing Westport in a lively Connacht quarter-final at MacHale Park on Sunday. The Covid pandemic had denied Moycullen the opportunity of testing their worth outside the county in 2020 after an historic Galway triumph, a scenario possibly generating a greater appreciation among Don Connellan’s charges of what they were about to get involved in heading to Castlebar. And they took to the provincial stage like ducks to water. Assembling their highest championship tally of the season, the Galway title holders proved in a different league to the first-time Mayo winners who were a yawning 12-points adrift at the finish. Westport were unable to handle their opponent’s pace, quick transition of possession and hard running which repeatedly opened big holes in their defence. Lee Keegan and company battled honourably to the end, but Moycullen proved a significant jump in standard on the teams they had encountered on their ground-breaking journey through Mayo. Liberated by leaving the familiarity of the Galway campaign behind, Moycullen confirmed the current good health of football in the county with an admirably professional show despite having to field without Peter Cooke – the goal-scoring hero of their dramatic big-day win over Salthill/Knocknacarra – who was ruled out through illness. For more, read this week’s Connacht Tribune. Connacht Tribune Digital Edition App Download the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play. Or purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE . Get the Connacht Tribune Live app The Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.","pubDate":"2022-11-17 05:00:51","image_url":null,"source_id":"connachttribune","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Gibbons hits seven points for Clifden in a narrow win","link":"https://connachttribune.ie/gibbons-hits-seven-points-for-clifden-in-a-narrow-win/","keywords":["Connacht Tribune","Sports","connacht tribune","clifden v carrigallen"],"creator":["Mike Rafferty"],"video_url":null,"description":"Clifden 1-10 Carrigallen 0-10 Mike Rafferty at Pearse Stadium IT is difficult to work out how good or ordinary Clifden are based on this performance at Pearse Stadium on Sunday as they eventually held off the challenge of the Leitrim visitors in this Connacht club junior football championship quarter-final. The game did come to a […]","content":"Clifden 1-10 Carrigallen 0-10 Mike Rafferty at Pearse Stadium IT is difficult to work out how good or ordinary Clifden are based on this performance at Pearse Stadium on Sunday as they eventually held off the challenge of the Leitrim visitors in this Connacht club junior football championship quarter-final. The game did come to a satisfactory and merited conclusion for Ray Hogan’s charges, but after coasting to a seven point advantage early in the second half, they almost let it slip away as Carrigallen closed the gap to a point on 55 minutes. Clifden held their nerve, however, and late points by leading scorer Ger Gibbons sealed the victory, but it should never have come to this. Despite four changes to the starting line up that saw them defeat Athenry in the county final, Clifden were in command from the early exchanges and aided by a John O’Brien goal, they opened up a 1-4 to 0-1 advantage. They looked to be streets ahead of limited opposition as good quality early ball into the inside line was working to their advantage as O’Brien, Emmet Moran and Enda Conneely were making the runs and receiving a proper service. Maybe it was the covering of Carriggallen’s Barry Dolan, Daniel McCann and Gary Reynolds that cut out the supply to the channels, but for some reason the deliveries stalled and, as a result, Clifden’s scoring ratio also dropped considerably, with the Galway champions managing just six points in the last 45 minutes of the game. For more, read this week’s Connacht Tribune. Connacht Tribune Digital Edition App Download the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play. Or purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE . Get the Connacht Tribune Live app The Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.","pubDate":"2022-11-17 05:00:30","image_url":null,"source_id":"connachttribune","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Ex-Portsmouth and Crystal Palace midfielder honoured with major Australian accolade for inspirational human rights work","link":"https://www.portsmouth.co.uk/sport/football/portsmouth-fc/ex-portsmouth-and-crystal-palace-midfielder-honoured-with-major-australian-accolade-for-inspirational-human-rights-work-3921292","keywords":["Portsmouth FC","Football","Sport"],"creator":["Neil Allen"],"video_url":null,"description":"A former Pompey player has been recognised for his achievements outside of football by being named New South Wales’ Australian of the Year.","content":"Craig Foster spent one season at Fratton Park after being recruited by Terry Venables for £300,000 in September 1997. He made 18 appearances and scored four times, yet the following summer was reunited with Venables at Crystal Palace . Since retiring from football, Foster has become a prominent human rights activist and a fierce advocate for anti-racism, working as an ambassador for Amnesty International. Most Popular 1 Verdict: What would need to happen for Newcastle's Matt Ritchie to make emotional Portsmouth return 2 Luton and Cheltenham monitor ex-Portsmouth youngster flourishing as Brett Pitman's Portchester partner-in-crime In 2019, the former Socceroo successfully fought for the release of Bahraini footballer and refugee Hakeem al-Araibi from a Thai prison, earning praise from Australian prime minister Scott Robinson. In recent years he has aided the Afghan women's national football team and other female athletes in fleeing the Taliban, while campaigned for the release of refugees held in offshore detention. In addition, the 53-year-old, who also works as a football commentator, has been praised for finding time to volunteer at the Addison Road community food pantry in Sydney's Inner West. Such has been the impressive nature of his work, Foster was honoured with the NSW Australian of the Year for 2023 during a ceremony at Sydney's Luna Park. Advertisement Hide Ad Craig Foster in action for Pompey against Aston Villa in January 1998 - a match in which he scored twice It follows being crowned Australian Father of the Year for 2022 in September, presented by the Fathering Project. As a footballer, he earned 29 international caps and scored nine times, catching the eye of Australian coach Venables, who was also Pompey’s owner. Subsequently signed from Sydney United for £300,000, Foster netted on his full debut for the Blues in a 3-2 home defeat to West Brom in November 1997. Advertisement Hide Ad In January 1998, the midfielder scored twice to put Pompey 2-0 after 40 minutes in an FA Cup third-round clash with Aston Villa. Ex-Pompey midfielder Craig Foster (right) has become a prominent human rights activist since his playing days ended. Picture: Jonathan DiMaggio/Getty Images However, the Premier League side fought back to level in the Fratton Park encounter, with Simon Grayson equalising two minutes from time to make it 2-2. Having arrived with compatriots Hamilton Thorp, Paul Harries and Robbie Enes, all had their contracts cancelled by new boss Alan Ball in the summer of 1998. Advertisement Hide Ad Yet Foster followed Venables to September 1998, going on to make 54 appearances and score three times in two seasons, before ending his playing days back in Australia with Northern Spirit. Crystal Palace Pompey","pubDate":"2022-11-17 04:55:00","image_url":"https://www.portsmouth.co.uk/webimg/b25lY21zOjNjNGY4NDdlLTNmNTQtNDQxMy1hNmJjLWY1MjIwYmYzYmFiMDo1ZTE2ZDc0OS0xMmU5LTQ1N2UtODMzYy04YjZmNzM3ZmFlYzA=.jpg","source_id":"portsmouth","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"The Socceroos’ $1.3bn Qatar training base is beyond luxurious, but also a symbol of World Cup’s wider issues","link":"https://www.theguardian.com/football/2022/nov/17/the-socceroos-13bn-qatar-training-base-is-beyond-luxurious-but-also-a-symbol-of-world-cups-wider-issues","keywords":["World Cup 2022","Australia","World Cup","Football","Australia sport","Sport"],"creator":["Emma Kemp in Doha"],"video_url":null,"description":"The team’s opulent surroundings give them the best chance of success, but can’t disguise some of the uneasy questions around Qatar’s tournamentAt some point before the Socceroos landed in Doha, somebody – quite possibly a migrant worker – spent a not-insignificant amount of quality time with a pair of high-end hedge shears. By the start of this week, when the team started arriving at their World Cup training base, the maintenance was complete. The shrubbery in question, perfectly spaced and perched upon a neatly cultivated hill separating their two assigned training pitches, was fashioned into letters spelling out “ASPIRE ACADEMY”.In July, when the Socceroos announced they would stay here for the duration of the tournament, a brief public narrative formed that their late qualification had forced Football Australia staff to settle for second-rate dormitory accommodation while their higher-profile counterparts opted for secluded wellness resorts (Germany), uber-rich water parks (Belgium) and hotels resembling palaces (France). Continue reading...","content":null,"pubDate":"2022-11-17 04:32:54","image_url":"https://i.guim.co.uk/img/media/a76f6e31ce6dd9765dc077b98a5b984cdc678da5/0_0_1600_960/master/1600.jpg?width=460&quality=85&auto=format&fit=max&s=38772b51a0314ae9c92f1dce2c623d71","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"Football World Cup highlights…","link":"https://thenewsglory.com/football-world-cup-highlights/","keywords":["Sports","Football","Football World Cup","World Cup"],"creator":["The News Glory"],"video_url":null,"description":"Joined hands…: The 2002 World Cup was the first tournament co-hosted by South Korea and Japan. Initially, both South Korea and Japan claimed to host the tournament separately. And Japan initially rejected the idea of ​​co-hosting the tournament. However, Japan later changed its mind and successfully hosted the tournament alongside South Korea.","content":"Joined hands…: The 2002 World Cup was the first tournament co-hosted by South Korea and Japan. Initially, both South Korea and Japan claimed to host the tournament separately. And Japan initially rejected the idea of ​​co-hosting the tournament. However, Japan later changed its mind and successfully hosted the tournament alongside South Korea.","pubDate":"2022-11-17 03:32:58","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Hawk presidency hopeful channels Obama as war of words rolls on","link":"https://www.themercury.com.au/sport/afl-2022-jeff-kennett-hits-out-at-presidential-challenger-andrew-gowers-and-former-deputy-premier-james-merlino/news-story/c24c0bcb327c7a8350b3d985e9ba408b","keywords":["AFL","Hawthorn","Sport news and galleries"],"creator":null,"video_url":null,"description":"Hawthorn has denied the announcement of a new deal to build its $100 million Dingley headquarters was an election grab as polls open on Friday for an increasingly rancorous election.","content":"The Hawks said on Thursday that ADCO Constructions would build a venue that will have a community oval, elite MCG-sized oval and equal facilities for men and women.The club was adamant on Thursday the club’s move from Waverley to Dingley was no repeat of St Kilda’s disastrous move to Seaford given it was actually closer to the city and had strong player backing.The Herald Sun revealed last month 1991 premiership player Andy Gowers would contest the presidency against vice president Peter Nankivell with former acting premier James Merlino among the contenders for the board.Since then the tone of the discussion has descended into the gutter with a series of claims about who was responsible for the club’s First Nations inquiry and which side was more supportive of the three women vying for the board.But Nankivell, who was in Tasmania for the club’s negotiations with Tasmania’s premier on a new games deal on Tuesday, said the timing of the Kennedy Community Centre announcement was purely coincidental.“If we wanted to be in by mid 2024 we had to literally sign off now and that’s the reason we have signed off. This is unrelated to any election issue. I can understand (the questions). But I should say these decisions have been in process for quite some time. It was at the last meeting with the Hawthorn football club last month that the decision was made to sign the building contract with ADCO. “I am not here to make an election pitch but I have been working on this process from 2013 and this means a huge amount to me personally. I want to stay invested in the Hawthorn football club.”Experienced lawyer Nankivell said he was disappointed with the tone of the conversation around the club’s elections.“It is disappointing. To quote Michelle Obama, when they go low, we stay high.”The club’s build will be set at $100 million with Jeff Kennett’s criticism of the state government seen to have held up $15 million in funding for the venue which has been held in contingency but not yet released.Gowers says another $10 million of funding from wealthy benefactors has been pulled until Kennett leaves, with Hawks chief executive Justin Reeves urging the state government to commit to help maximise the community return.“Our team has been working really closely with the government. They are partners in this project. We hope it gets released in the short term because to deliver 100 per cent of the community facilities we need that money. To deliver 100 per cent of the Hawthorn facilities, we don’t need that money.”Players including young star forward Mitch Lewis have moved into nearby suburbs in anticipation of the 2024 move, with Reeves adamant the entire club was on board with the move.“This site was chosen over years of due diligence and part of it was conversations with players, staff, supporters and members.This site is closer to the CBD than Waverley, it’s close to the bayside suburbs which is a real attraction for players, it’s about half the distance Seaford was from Melbourne. It’s an inner suburban venue and there is huge future growth in this area. We are super excited about what this site holds.”HAWKS HIT JACKPOT WITH GAMING VENUE SALES Jay Clark Hawthorn says it is in the strongest financial position in the club’s history after pocketing $32 million from the sale of its two gaming venues.The Hawks on Wednesday confirmed they had recorded a net operating surplus of $35.1 million after making the big call to sell WestWaters Hotel in Caroline Springs and The Gardens at Waverley Gardens this year.About half of that money will help fund the club’s new training base in Dingley which is on track to be built by early to mid-2024 and provide the Hawks with a world-class headquarters worth $90-100 million.Importantly, the football operations surplus of $752,006 (profit excluding investments) also shows the club is not reliant on gaming machine revenue to make money.Hawthorn has received up to $4 million a year from gaming machines but has made the big call to part ways with the gambling money in-line with some other clubs.Chief executive Justin Reeves said the result showed the club was in “great shape” and was “completely aligned through the football and administration departments” as it prepares to head to the polls from Friday.The Hawks generated $752,006 from traditional football streams such as membership, merchandise and gate receipts despite a tough year on the field finishing 13th.The football surplus was a welcome financial result for the Hawks in the midst of a presidential battle between president elect Peter Nankivell and challenger Andy Gowers.Voting opens on Friday and closes on December 9. The results will be announced at the December 13 annual general meeting.Nankivell said the club was in an excellent financial position as the Hawks put their faith in second-year coach Sam Mitchell and a rebuilt playing list.“We are in the strongest financial position the club has been in in its history. These financial results showcase the commercial strength of the club as well as the unwavering support of loyal members and commercial and community partners,” Nankivell said. “We are delighted to have set a new membership record, with 81,494 members. This committed membership base is integral to the club’s success, and we want to thank every single one of our loyal members. “The club is also extremely appreciative of all our commercial partners for their continued support. In addition, we welcome aboard our newest partners, who we are proud to join forces with. Being able to generate these new commercial partnerships is a direct reflection of the club’s strength as an organisation. “On behalf of the board, I would also like to thank the Hawthorn staff and playing group for their ongoing efforts to ensure this club continues to thrive in the ruthless environment of elite sport.”Reeves said the Hawks were about to “embark upon one of the most significant chapters in our club’s history” with the construction of the Kennedy Community Centre which will provide its men’s and women’s teams with elite facilities.“We pride ourselves on being an independent club which balances a strong members and community first mindset with sound, forward-thinking commercial decisions,” Reeves said.“To show, once again, that our club can operate so strongly off-the-field is something we should all be immensely proud of. “Following a few tough years of instability as a result of COVID-19, we are seeing ongoing growth in all areas across our organisation.“This is a testament to the hardworking administration staff, players, coaches, football department, and our selfless volunteers.“Our club is in great shape, completely aligned through the football and administration departments and well equipped to continue our push towards our first and next premierships in AFL men’s and women’s.” ‘BOYS CLUB’: KENNETT SLAMS HAWKS CHALLENGER, EX-LABOR MINISTERJeff Kennett has hit out at Hawthorn presidential challenger Andrew Gowers, accusing him of wanting to take the Hawks back to being a boys’ club.In an exclusive column for the Herald Sun, Kennett also highlighted how Gowers was football director in some of the years of Hawthorn’s alleged inappropriate actions against Indigenous players and took aim at his running mate, ex-deputy Premier James Merlino, for having no knowledge of club operations.Gowers, a 1991 premiership player, is standing against the board’s nominee, Kennett’s vice-president Peter Nankivell, after getting endorsed by supporter group Hawks 4 Change.Kennett said the group “want to take the club back to being a men’s club only”, having “never nominated a woman for a board position”.The power struggle will come to a head at the Hawks’ annual general meeting on December 13.“(Gowers) was football director at the time of the alleged inappropriate actions found to have been taken against some of our Indigenous players,” Kennett wrote.“Now he wants to preach governance and take the club back to being a boys’ club.“His running mate James Merlino has no knowledge of club operations.“He hasn’t talked to anyone within the club to establish the facts.“He, like Gowers, talks governance when making sadly inaccurate, intemperate comments.”Kennett said his board had unanimously supported the return of female board members Anne-Marie Pellizzer and Katie Hudson, and a third woman, Marie Liu.He claimed Gowers and Merlino, who was aiming for a board seat, had not won support among the Hawks’ football or administrative departments.“Neither will gain electoral support from those they seek to represent but continually attack,” the former Premier wrote.The Drafts podcast Episode 10“Let’s hope the members see through the shallowness of their representations.”Gowers told the ABC on Tuesday he would be voting for Liu after having very productive discussions with her.“Her Hawthorn credentials are very strong and her professional background is excellent,” said Gowers, who played 89 games for the club from 1988-94.Last week, Gowers told News Corp he had no knowledge at the time of any of the accusations against Alastair Clarkson, Chris Fagan or Jason Burt.Gowers was Hawthorn’s football director from 2013-17.“I am shattered like everyone else when we read those stories in the Egan report,” he said.“If I am elected as president I would see it as my responsibility to right any wrongs of the past, this area included.“For that reason I endorse the recommendation that Phil has made of a full-time general manager of Indigenous development, who would report to the CEO.“My view is we need more permanent resources to be best practice and to drive the most rewarding relationships with our First Nations, staff, players and supporters.”Kennett’s column comes on the back of him criticising Merlino on Twitter on Monday night.","pubDate":"2022-11-17 03:10:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Football – Pro League : CFFA remet son titre en jeu","link":"https://midi-madagasikara.mg/2022/11/17/football-pro-league-cffa-remet-son-titre-en-jeu/","keywords":["Sports","CFFA","Football","Madagascar","Pro League;"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"Le championnat de première division de Madagascar débutera ce samedi. Avec 125 rencontres au programme, le duel final est prévu pour le 24 juin 2023. C’est parti pour la quatrième édition de la première division de football à Madagascar. Seize équipes réparties dans deux Conférences se disputeront le titre. La première journée commencera samedi avec […] L’article <strong>Football – Pro League : CFFA remet son titre en jeu</strong> est apparu en premier sur Midi Madagasikara.","content":"Un choc CFFA-Mama FC pour le coup d’envoi de l’OPL, ce samedi au Bypass. Le championnat de première division de Madagascar débutera ce samedi. Avec 125 rencontres au programme, le duel final est prévu pour le 24 juin 2023. C’est parti pour la quatrième édition de la première division de football à Madagascar. Seize équipes réparties dans deux Conférences se disputeront le titre. La première journée commencera samedi avec deux matches au menu. Cela continuera le dimanche avec six autres rencontres. En effet, la phase des Conférences du 19 novembre 2022 au 9 avril 2023 totalise 14 journées et chaque journée sera composée de huit matches. La compétition aura lieu dans 11 sites à savoir le terrain de l’Elgeco Plus Bypass, le stade de Mahitsy, le complexe Vontovorona, le stade d d’Ampasambazaha Fianarantsoa, le stade d’Alarobia, le Stade Barikadimy de Toamasina, le stade de Mahitsy, le stade de Toliara, le stade d’Ambohidratrimo, le stade de Manakara et le stade d’Ambanja. Le stade Rabemananjara Mahajanga ne sera pas disponible cette saison. Les quatre premiers de chaque conférence accéderont aux Playoffs. Cette étape finale se déroulera aux mois d’avril – mai et juin 2023 et la finale est prévue pour le 24 juin 2023. CFFA contre Mama FC En revenant sur cette première journée, la Conférence Sud ouvrira le bal ce samedi. Le CFFA Andoharanofotsy, tenant du titre, se disputera contre Mama FC au Bypass, tandis que Jet Kintana jouera contre Dato Fc à Mahitsy à 14h30. Ce dimanche, 3FB Toliara affrontera Zanakala FC à Fianarantsoa quand Elegeco Plus recevra dans son jardin Disciples FC. Dans la Conférence Nord, un choc d’entrée entre Cosfa et Ajesaia est prévu à Mahitsy. Fosa Juniors pour sa part croisera As Fanalamanga à Vontovorona. Quant aux deux équipes nouvellement promues, ASA Diana affrontera Uscafoot au stade d’Alarobia tandis que Tsaramandroso FC jouera contre Tia Kitra au stade Barikadimy. « Cette saison est particulièrement surchargée avec les calendriers des équipes nationales occupés par la CAN, CHAN, et la Coupe nationale organisée par la FMF. Les clubs et les joueurs auront ainsi un rythme effréné jusqu’à la fin de la saison. Notons enfin qu’étant donné que le début des éliminatoires pour les compétitions interclubs est prévu vers la fin août 2023, la prochaine saison d’OPL pourra probablement commencer vers la mi-août, soit moins de deux mois après la fin de la saison 2022-2023 », peut-on lire dans le communiqué de l’association des Clubs de Football Élite de Madagascar (CFEM). Manjato Razafy L’article <strong>Football – Pro League : CFFA remet son titre en jeu</strong> est apparu en premier sur Midi Madagasikara.","pubDate":"2022-11-17 03:00:00","image_url":null,"source_id":"madagasikara","country":["Madagascar"],"category":["sports"],"language":"french"},{"title":"Football Festival | Messi, Lewandowski waiting to party","link":"https://thenewsglory.com/football-festival-messi-lewandowski-waiting-to-party/","keywords":["Sports","Argentina","Football","Football World Cup","Lionel Messi","Messi","Robert Lewandowski"],"creator":["The News Glory"],"video_url":null,"description":"Argentina, Mexico, Poland and Saudi Arabia are in Group C. Star players like Argentina’s Lionel Messi and Poland’s Robert Lewandowski are waiting to entertain the fans in this category. Argentina: Rank 3; Coach – Lionel Scaloni: Argentina head to Qatar high on confidence after winning the 2021 Copa America series against Brazil and a win […]","content":"Argentina, Mexico, Poland and Saudi Arabia are in Group C. Star players like Argentina’s Lionel Messi and Poland’s Robert Lewandowski are waiting to entertain the fans in this category. Argentina: Rank 3; Coach – Lionel Scaloni: Argentina head to Qatar high on confidence after winning the 2021 Copa America series against Brazil and a win over Italy in the Finalsima Cup (a clash between the European champions and Copa America champions). This could be the last World Cup series for the team’s star player, Lionel Messi. For Messi, who has achieved many achievements in the world of football, the title of world champion has only been an octogenarian. Messi has been in top form for his club Paris Saint-Germain in the French league this season. Appointed as coach on an interim basis, Scaloni has built an efficient and cohesive unit. Argentina are unbeaten in their last 35 matches. In this category, between 2018 and 2021, Italy set a world record of 37 games unbeaten. Argentina need 2 more wins or draws to break this. However, breaking Italy’s record at the World Cup in Qatar will not be Argentina’s priority. Instead, the focus could be on giving Messi a fitting farewell with the title by winning all seven games – league, knockout, quarter-final, semi-final and final. Strength : The Copa America win boosted the team’s confidence. With Rodrigo de Paul strong in midfield, Messi can create space for himself and play with freedom. Messi could play magic between midfield and attack as Lautaro Martinez will be deployed as a striker. Weakness : Injuries to Angel Di Maria and Paulo Dybala dealt a major blow to Argentina’s World Cup preparations. Both are now struggling to regain full fitness. Set-piece defending is seen as a major weakness. Mexico: Rank 13; Coach – Gerardo Martino: Mexico has qualified for the World Cup for the 7th time in a row. The other teams in Group C will be a bit wary of Mexico as they have the potential to beat any team on a given day. In the 2018 World Cup in Russia, Mexico shocked the mighty Germany by beating them. Football fans will never forget this. Led by former Barcelona and Argentina coach Gerardo Martino, Mexico’s defensive approach will certainly frustrate opponents. Strength : Mexico has some experienced players befitting its ranks. This is the 5th World Cup series for captain Andres Cuartado and goalkeeper Guillermo Ochoa. Midfielder Hector Herrera and centre-back Hector Moreno have more than 100 international caps. Weakness : Sevilla’s winger Jesus Corona has not recovered from an ankle injury. Striker Raul Jimenez is yet to return to form after suffering a serious head injury in November 2020. Poland – Rank 26; Coach -Czeslaw Mikniewicz: Poland is playing in the World Cup for the 8th time. The team finished third in the 1974 and 1982 World Cups. In 1986, Poland lost to Brazil in the knockout round. The Polish team did not make it past the league stage in the subsequent series. Polish fans will be hoping that Robert Lewandowski, who won the FIFA Player of the Year award for the 2nd year in a row, will lead their team’s recovery from the front. However, the Polish team qualified for the Qatar World Cup series with a struggle. Only got into the World Cup via the play-offs. Strength : Poland hope Lewandowski will continue his brilliant form in Qatar. Krzysztof Piatek and Arkadiusz Milik, who are capable of attacking and scoring goals, add strength. Weakness : Kamil Glick adds strength to the backline, but lacks quality in midfield. Piotr Zielinski is the only player of note in midfield. Saudi Arabia – Rank 51; Coach: Herve Renard: Saudi Arabia may try to put up a good performance in the upcoming World Cup in neighboring Qatar. In the Asian qualifiers, Saudi Arabia topped the group that included Japan and Australia. Saudi Arabia’s first match is against a strong Argentina. Strength : For Saudi Arabia, playing in Qatar will give the feeling of playing at home. Most of the players in the squad can play for the Al Hilal club here. Thus Saudi Arabia can act without pressure. Weakness : Saudis lack quality strikers. They depend heavily on winger Salim Al-Tawsari to score goals. If he fails to score, Saudi will be in deep trouble.","pubDate":"2022-11-17 02:35:13","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Hannibal Mejbri: the Tunisia midfielder set to square up to the Socceroos | John Duerden","link":"https://www.theguardian.com/football/2022/nov/17/hannibal-mejbri-the-tunisia-midfielder-set-to-square-up-to-the-socceroos","keywords":["World Cup 2022","World Cup","Tunisia football team","Football","Australia sport","Sport"],"creator":["John Duerden"],"video_url":null,"description":"The Manchester United-owned player loves a scrap and shapes as a key obstacle for Australia when the teams meet in World Cup Group DHannibal Mejbri has been doing it on cold, wet and windy nights in Stoke this season, so shining in the warm afternoons and evenings of Qatar should come easily. The Tunisian teenager is one of the rising stars of English football and will relish any physical challenge Australia may bring when the two meet in Al-Wakrah in their second game of the 2022 World Cup. With Denmark and France also in Group D, both Tunisia and the Socceroos know that beating each other offers the best chance of progression. It should be quite a battle and with a Tunisian called Hannibal on the pitch, there is always going to be a chance for something special. Continue reading...","content":null,"pubDate":"2022-11-17 02:26:10","image_url":"https://i.guim.co.uk/img/media/51a8c47b2038dc8fa936404ef3526f95666d7ece/0_175_3618_2171/master/3618.jpg?width=460&quality=85&auto=format&fit=max&s=7f3d043bb8f92b1f5e76b5e4fadcfe70","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"Tag rugby boss apologises after describing women’s teams as ‘elderly ladies’","link":"https://www.newstalkzb.co.nz/news/sport/tag-rugby-boss-apologises-after-describing-women-s-teams-as-elderly-ladies/","keywords":null,"creator":null,"video_url":null,"description":"Players are calling for a public apology after a senior figure in New Zealand’s tag rugby competition described senior women’s grade players as “elderly ladies” during a recent broadcast of a game that featured a number of former Black Fern and Kiwi Fern players. The players ranged in age from 31 to 48. New Zealand Tag Football’s National Development Officer Claude Iusitini made the comments as he called the senior women’s Grand Final game during the International Tag Series event held in Auckland last weekend, which players say “degraded” them. During the broadcast, which was carried live online, Iusitini said the Grand Final gave “the elderly ladies” the “opportunity to play on field one”, correcting himself as he spoke to say the women were at the “masters” and “senior” level, adding that tag rugby was “all about inclusivity and participation”. “So, you know, we thought it would be nice to have the older girls out there, having a go and competing in a Grand Final on field one.” Former NRL referee Bill Harrigan joined Iusitini in his comments, lauding the “skill” and “speed” of younger players featured earlier in the event, before offering faint praise to the older players for “having a dig” despite “some of their skill levels nowhere near the young people”. “They’re mothers, they’re grandmothers, and they’re still playing the game and that’s sensational,” Harrigan said. A senior player spoken to by the Herald said that the players were disappointed by the comments, which she said had embarrassed them in front of their friends and family. “I guess from our perspective we have played NZ Tag for years, a lot of us, we had international and national reps from various different ball sports, so to be referred to as ‘not as skilled’ or as grandmas and mums just having a go just really minimised the amount of training and time and practice we put into the tournament,” the player, speaking on behalf of both teams, told the Herald. “It minimised the skills of some of our elite athletes that are still out there running around,” she said, adding that the players “might not be at international level on the big stage but are still very skilful players.” “It was really disappointing,” she told the Herald, pointing out that many of the players also contributed through coaching and managing other grades. She also told the Herald that the only reason that they played on field one was that organisers needed the timeslot filled, adding that their finals, alongside older Men’s games, were not usually included on the live stream. She said that those decisions left some players feeling that organisers did not value them. The timing of the comments, coming immediately after the Black Ferns World Cup win, was not lost on the players. “To then be degraded like that when we’ve just had that big win for women’s sport was pretty disappointing” In a formal apology sent to some NZTFI members, but not all players, Iusitini said he regretted making the comments, which he described as “insensitive and harmful”. “There is no excuse for this,” he wrote, adding that he took full responsibility for what he said and admitting he “should have understood better the situation and not been so irresponsible and reckless.” “My comments have caused hurt amongst our Senior Women’s grade and all the tag community to which I am truly sorry.” Claude Iusitini released a formal apology via email. Photo / NZTFI He announced he was removing himself from any future broadcasting role and vowed to “better understand and respect the senior women space and its amazing athletes”. But players say that he has not gone far enough and are calling on him to make a public apology. The player spoken to by the Herald said that she and other players believed that a public apology was warranted because the comments were made on livestream. ”We want it acknowledged, more for future generations. If that’s how younger women see us being treated when we’re in our 30s, that’s not going to make them feel valued and want to continue. “We don’t want it swept under the rug. A lot of the outrage comes from our families and friends, it wasn’t just us that was affected by that. It was the embarrassment that I felt when I was so proud to share that link with my friends and then they had to listen to the way we were spoken about.” The Herald has approached Iusitini for comment.","content":"Players are calling for a public apology after a senior figure in New Zealand’s tag rugby competition described senior women’s grade players as “elderly ladies” during a recent broadcast of a game that featured a number of former Black Fern and Kiwi Fern players. The players ranged in age from 31 to 48. New Zealand Tag Football’s National Development Officer Claude Iusitini made the comments as he called the senior women’s Grand Final game during the International Tag Series event held in Auckland last weekend, which players say “degraded” them. During the broadcast, which was carried live online, Iusitini said the Grand Final gave “the elderly ladies” the “opportunity to play on field one”, correcting himself as he spoke to say the women were at the “masters” and “senior” level, adding that tag rugby was “all about inclusivity and participation”. “So, you know, we thought it would be nice to have the older girls out there, having a go and competing in a Grand Final on field one.” Former NRL referee Bill Harrigan joined Iusitini in his comments, lauding the “skill” and “speed” of younger players featured earlier in the event, before offering faint praise to the older players for “having a dig” despite “some of their skill levels nowhere near the young people”. “They’re mothers, they’re grandmothers, and they’re still playing the game and that’s sensational,” Harrigan said. A senior player spoken to by the Herald said that the players were disappointed by the comments, which she said had embarrassed them in front of their friends and family. “I guess from our perspective we have played NZ Tag for years, a lot of us, we had international and national reps from various different ball sports, so to be referred to as ‘not as skilled’ or as grandmas and mums just having a go just really minimised the amount of training and time and practice we put into the tournament,” the player, speaking on behalf of both teams, told the Herald. “It minimised the skills of some of our elite athletes that are still out there running around,” she said, adding that the players “might not be at international level on the big stage but are still very skilful players.” “It was really disappointing,” she told the Herald, pointing out that many of the players also contributed through coaching and managing other grades. She also told the Herald that the only reason that they played on field one was that organisers needed the timeslot filled, adding that their finals, alongside older Men’s games, were not usually included on the live stream. She said that those decisions left some players feeling that organisers did not value them. The timing of the comments, coming immediately after the , was not lost on the players. “To then be degraded like that when we’ve just had that big win for women’s sport was pretty disappointing” In a formal apology sent to some NZTFI members, but not all players, Iusitini said he regretted making the comments, which he described as “insensitive and harmful”. “There is no excuse for this,” he wrote, adding that he took full responsibility for what he said and admitting he “should have understood better the situation and not been so irresponsible and reckless.” “My comments have caused hurt amongst our Senior Women’s grade and all the tag community to which I am truly sorry.” He announced he was removing himself from any future broadcasting role and vowed to “better understand and respect the senior women space and its amazing athletes”. But players say that he has not gone far enough and are calling on him to make a public apology. The player spoken to by the Herald said that she and other players believed that a public apology was warranted because the comments were made on livestream. ”We want it acknowledged, more for future generations. If that’s how younger women see us being treated when we’re in our 30s, that’s not going to make them feel valued and want to continue. “We don’t want it swept under the rug. A lot of the outrage comes from our families and friends, it wasn’t just us that was affected by that. It was the embarrassment that I felt when I was so proud to share that link with my friends and then they had to listen to the way we were spoken about.” The Herald has approached Iusitini for comment.","pubDate":"2022-11-17 02:10:55","image_url":"https://www.newstalkzb.co.nz/media/5kslwnrx/commentators-describe-players-as-elderly-ladies.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Kerr stars in incredible World Cup ad","link":"https://www.watoday.com.au/sport/soccer/kerr-stars-in-incredible-world-cup-ad-20221117-p5bz47.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Matildas star Sam Kerr rubbed shoulders with some of football's biggest names in Nike's latest World Cup ad.","content":null,"pubDate":"2022-11-17 01:49:55","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"World Cup richlist: Most cashed up stars in Qatar?","link":"https://www.couriermail.com.au/sport/football/highestpaid-players-in-world-football-revealed-ahead-of-qatar-world-cup-2022/news-story/5edd87fbac14f8babdacdb079007e9b2","keywords":["Football","Football Exclusive","World Cup"],"creator":null,"video_url":null,"description":"Qatar is the playground for the rich and famous, and when it comes to football they don’t come any richer than this lot.","content":"So there’s no better place to introduce you to the game’s true elite – the stars living in another financial stratosphere.And, incredibly, six of the top 20 earners will not be at the World Cup.This list is headed by nouveau riche French star Kylian Mbappe, the top dog who this year dethroned Argentinian maestro, and Paris St Germain teammate, Lionel Messi as football’s highest earner.It’s a title that didn’t come cheaply for his club team, either.Mbappe’s eye-watering new contract with the French champions is worth 630 million euros (close to $A1 billion) over the next three years alone and instantly makes the xxx-year-old one of the highest paid athletes on the planet.Showcasing the pulling power of the oil-rich Qatar, which owns PSG, two of his teammates – including Messi and Brazilian striker Neymar – feature in this year’s top five.Naturally, Manchester United and Portugal great Cristiano Ronaldo remains among the best-paid players on the planet despite an up-and-down campaign with the English giants – though Ronaldo’s earning potential extends far beyond the pitch.Many of these titans of world football will be showcasing the skills that pay the bills as the World Cup kicks off in Qatar this month – perhaps with the odd bonus in their sights.But there’ll be no place for Egypt’s Mo Salah, or Norway’s Erling Haaland, after their countries failed to qualify – while Spanish quartet David de Gea, Gerard Pique, Sergio Ramos and Andreas Iniesta might still be among the biggest earners on the planet.World football's 20 richest players","pubDate":"2022-11-17 01:09:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Draft intel: Clubs eye next Sicily, son of Pie, Blue rising fast","link":"https://www.couriermail.com.au/sport/afl/draft/afl-draft-2022-all-the-latest-news-and-intel/news-story/3cd766105991c7844e299e858380e696","keywords":["AFL Draft","AFL News"],"creator":null,"video_url":null,"description":"The 2022 AFL National Draft is fast approaching, set to kick off on November 28.","content":"Here’s all the latest draft news from around the country. IS THIS KID THE NEXT JAMES SICILY?He idolises Hawthorn’s James Sicily, hasn’t had a “proper’’ haircut for 10 years and can often be found hanging upside down in his backyard.He also is one of South Australia’s hottest draft prospects.Meet Glenelg’s Jakob Ryan.A self-confessed “happy-go-lucky’’ character, the 18-year-old’s star continues to rise.The athletic, rebounding defender, who models his game on Hawks 2022 club champion Sicily, is skyrocketing up draft boards, with AFL talent ambassador Kevin Sheehan claiming he “could be SA’s second-best prospect’’ behind powerful Eagles midfielder Mattaes Phillipou.SA under-18 coach Tony Bamford said Ryan had this year “done a lot of work to significantly improve his ability to win one-on-one contests, which now complements his offensive impact’’.It is all part of his grand plan to emulate his hero Sicily, who he is even nicknamed after and unexpectedly met (and had a photograph with) at last month’s AFL Draft Combine at Marvel Stadium.“I’ve been a big James Sicily fan for the past four or five years,’’ said Ryan, who has supported Hawthorn since it stunningly upset Geelong in the 2008 grand final.“I love the way he plays, being that intercept type defender, his flair, unique personality and the fact that he is a little bit different on the field.“He plays on the edge, with a bit of spunk and takes the game on and I try to play the same way.“And mum’s always said I look a bit like him.’’Ryan, who is the same height (189cm) as Sicily, shows him so much love that his Glenelg teammates, in particular 2023 top draft prospect Ashton Moir, have nicknamed him “Sis’’.“And I love it,’’ Ryan said.Ryan was floored when he got to meet his idol at the combine, where he was interviewed by 12 clubs.“Sicily was sitting with the Hawthorn recruiting staff, listening in on some interviews, and the Hawks knew I modelled my game on his and introduced us,’’ he said.“They told me to take the opportunity to get my photo with him, which was pretty cool. We only had time for a brief chat but he was super nice.’’BETTS CONNECTION FOR BOMBERS PROSPECTEssendon father-son prospect Alwyn Davey Jnr is living with ex-AFL champion Eddie Betts in the countdown to the AFL national draft later this month. The son of former Bombers forward Alwyn Davey, the 18-year-old had been boarding at Xavier College. However, Davey finished the last of his Year 12 exams last Monday and has since moved in with Betts and his family. Davey hails from Darwin but told News Corp earlier this year that he loved life in Melbourne. “I love to roam around the city and enjoy the city life,” he said.Betts has taken in and mentored other indigenous players in the past, including Geelong premiership player Tyson Stengle. The former Carlton and Adelaide star retired from the top level last year after 350 senior games, before serving as a development coach with Geelong this season. Alwyn and his twin brother Jayden have both nominated Essendon under the AFL’s father-son rules as they seek to follow in the footsteps of their father and pull on the red and black.Alwyn is considered a potential top-20 selection, while Jayden is expected to be picked later in the draft after missing this year with an ACL injury. Essendon is interested in trading pick 22, which would be wiped out if a bid for Alwyn comes before that point. Interested clubs Western Bulldogs (pick 21) and West Coast (pick 20) shape as the main threats to the Bombers.It is believed three clubs are interested in Essendon Next Generation Academy member Anthony Munkara, who the Bombers will be hoping slides past the first 40 picks which are protected from Academy bids being matched. Sides such as Fremantle (30, 43 and 44), Port Adelaide (33) Hawthorn (41) and North Melbourne (40) have picks that are in the danger zone for Essendon.COULD EARLY BID COME FOR CROWS FATHER-SON GUN?It could be a nervous first night of the draft for Adelaide, with a potential early bid for Max Michalanney looming.The Crows have officially nominated Michalanney, the son of Norwood great Jim, who played 211 SANFL games for the Redlegs between 1974 and 1986, as a father-son prospect and will be able to match any rival bid in this month’s national draft.And that could come earlier than in the 25-40 range that many expect, with one club recruiter telling News Corp this week a bid in the teens wouldn’t be a surprise.The Bulldogs are understood to be big fans of the classy, competitive defender, who played three senior games for Norwood this year and was named in the under-18 All-Australian team.They have selections 11 and 21, while Sydney and GWS hold four of the final five selections of the first round.Adelaide gave up pick 5 in a deal with Gold Coast for South Australian young gun Izak Rankine.It also traded pick 23 to North Melbourne for 59 and the Roos’ future second-round selection, in a move to strengthen its hand for 2023 before the value of this year’s hand gets wiped out by matching a Michalanney bid.After a separate trade with Brisbane, the Crows hold picks 46, 56 and 59 – selections which equate to 683 draft points.A 20% discount is applied to any father-son bid in the first round, meaning if a club called Michalanney’s name at pick 17, it would cost Adelaide 820 points (1025 less the discount) to match.The discount on any bid from the second-round onwards is capped at 197, meaning a bid at pick 25 would see the Crows give up 559 points (756 less the discount).Clubs can go into a points deficit, affecting their draft hand the following year, but a bid inside the top 20 would make things interesting inside the Crows’ draft room, especially if it’s on the first night.HOTTON IS HOT PROPERTYThe son of former Collingwood and Carlton player Trent Hotton has emerged as a first-round draft pick this year on the back of a little help from an Essendon legend.Traditionally a midfielder throughout his junior football, Olli Hotton was moved into a new role across half-forward with the Sandringham Dragons in the NAB League at the start of this season. “The first three or four weeks I was pretty average,” Hotton said.“Then I went back to school footy and built my form each week and just got better as I went along”. Hotton completed Year 12 studies at Haileybury this year, where his school football coach was former Bombers forward Matthew Lloyd. “He’s one of the greatest forwards of all time so he helped out a little bit,” Hotton said.“There’s still massive room for improvement. But I definitely developed that game a lot more and worked out the leading patterns and all that sort of thing. “My dad has also helped a bit. He was a small forward. Not so much individually, but just a little bit here and there going over some vision and giving some good advice.”Hotton caught the eye of AFL recruiters playing as a forward through the under-18 national championships, during which he averaged 16.8 disposals and kicked six goals from four matches. He went on to finish equal-fourth in the vertical jump at the AFL draft combine in October, as well as sixth in the 20m sprint test. “He’s still got a bit of work to do but he’s starting at a good base with a good athletic profile,” one recruiter said.Hotton is not eligible to join Collingwood or Carlton under father-son rules, given his dad played only 17 games for the Magpies and 61 matches for the Blues. However, a number of clubs including Sydney (picks 14 and 17) have shown interest in the 18-year-old as a potential top-20 selection. TASSIE’S DRAFT DRY SPELL TO ENDTasmania’s AFL draft dry spell will end this year with up to five prospects in the mix to join AFL clubs in this month’s draft intake. The Apple Isle has produced seven prospects in three years - only two of those draftees remain on AFL lists - in a lean patch for the state where Covid-19 shutdowns have heavily impacted their junior program. Richmond defender/wingman Sam Banks - taken by the Tigers at pick 29 last year - was the only Tasmanian taken in the national draft during that period. Their potential haul this year will be a welcome boost as an announcement on Tasmania’s 19th licence looms, with Tasmania Devils talent manager Jeromey Webberley believing at least three products are likely to be taken, headlined by explosive defender Lachie Cowan. Cowan, a possible first-round prospect, is certain to be the first Tasmanian called out on draft night after a scintilating season where he tied for the Morrish Medal in the NAB League, averaging 27 disposals, eight intercepts and 141 ranking points. TASMANIAN’S DRAFTED SINCE 2019Sydney is among his suitors and will be right in the mix for their two first-round selections slated at 14 and 17.Speedy key defender Tom McCallum will appeal to clubs in the second round, while small forward Seth Campbell has attracted interest from a handful of clubs including Carlton in the back-half of the draft. Crafty 19-year-old forward Brandon Leary, who came second in the NAB League goalkicking with 33 majors - has been linked to reigning premiers Geelong and Hawthorn later in the piece, while developing ruckman Cam Owen is also considered a chance to be taken later on. The Devils also have a promising draft crop next year, boasting three representatives - Colby McKercher, Jack Callinan and Arie Schoenmaker in the Under-17 All Stars game on grand final day. Webberley conceded living up to the expectation of previous decades - where Tasmania consistently punched above its weight in producing talent - has been challenging and expected Tasmania’s draft hauls to continue to fluctuate each year. “It is a very exciting time within Tassie footy, obviously we have got a pending announcement which everyone is sort of on the edge of their seat waiting for,” Webberley told the Herald Sun. Of course we would have liked to have more drafted over the past couple of years but it’s going to ebb and flow a little bit (with our low population) and this year we potentially have three, if we get lucky we may get a couple more so. “We’ve had such a rich history and sometimes when we try to live up to that it can be quite challenging.”‘ANNOYING’ FORWARD WITH LOTS OF FANSLivewire small forward Charlie Clarke has no shortage of suitors as he looms as a near-certain top-25 pick in this month’s national draft. The Sandringham Dragons product — who openly admits he likes to get under the skin of his opponents by being “real annoying” — has been interviewed by 15 AFL clubs. It is understood that clubs including Greater Western Sydney, Hawthorn, North Melbourne and Collingwood have shown significant interest in Clarke. “He’s had a really good season, he brings great energy and he’s a cracking kid,” one recruiter said. The 182cm Clarke averaged 18.6 disposals and 1.9 goals across 15 NAB League games for the Dragons this year, while also featuring in all four matches of the national championships for Vic Metro. Clarke told his story to the Herald Sun last month, which included growing up in Port Melbourne public housing and dropping out of school at the end of Year 9. He was part of St Kilda’s Academy program but was cut from that at age 15. TALENTED TALL FILLS OUT, SON OF GUN A MONSTER Measurements are a minor part of the national draft combine process, but they can show just how much a prospect has shot up - or the work they’ve been doing in the gym. Highly touted key position forward Matthew Jefferson has filled out considerably, adding six kilograms to his lean frame since the beginning of the year. The likely first-round prospect was a stringbean at the beginning of the season, weighing just 78kg at 195cm, and he has more size to add as a stay at home forward. Meanwhile, Mattaes Phillipou - who has been linked to Essendon - appears a big chance to play senior footy next year after putting on six kilograms of size while maintaining his elite fitness, running a 6:27 2km time trial at the draft combine. Dimuntive West Australian Darcy Jones, who has drawn comparisons to Caleb Daniel, was the smallest player and lightest player measured at the draft combine at 174.4 centimetres, just below fellow WA small Jed Hagan (174.6cm).DRAFT DOSSIER: ALL UPDATED MEASUREMENTS AND INTELIt is understood some clubs flagged concerns by his slight weigh-in, despite Jones’ starring role at WAFL senior level late in the year and at the national combine, where he took out the agility and vertical jump tests. Ruckman Max Knobel - the son of Tiger, Saint and Lions ruckman Trent - has grown to a whopping 206.4cm, making him the tallest player of the draft class.The beanpole ruckman, who shapes as a promising project player later in the draft, has added five kilograms to his slender frame as well as growing two centimetres this year. South Australian Harry Barnett, regarded as the top ruck prospect in the pool at 202cm, also put on four kilograms of muscle across the year while managing to run an eye-catching 6:32 2km time trial. SON OF A SWAN STILL WORTH A PUNTA season ruined by injury has seen Luke Teal’s name slide down club draft boards this year. However, his NAB AFL Academy coach Tarkyn Lockyer believes the rebounding half-back is still very much worthy of selection in this month’s national draft. The Oakleigh Charges product sat out the NAB League testing day in March with an ankle injury, had his appendix removed on the eve of Round 1 and then had his collarbone broken in a tackle during a school football match mid-year. The injuries meant that Teal played just four NAB League games for the season and he returned for only Vic Metro’s final match of the national championships. “Unfortunately he’s had a few little bumps in the road, which you don’t like to see for any player,” Lockyer said.“But certainly the way he faced those challenges and worked through them was really impressive. He’s a super proffessional kid who is really driven to get the best out of himself. “He got back towards the end of the year and played a couple of games and was able to show that he’s got some talent.”The Trinity Grammar student is the son of Robert Teal, who played 18 games for Sydney in 1989-90 before a back injury cut his career short. Teal grew up a Hawthorn supporter but has kept a close eye on a Bulldogs backman in recent years. “Bailey Dale’s a big one for me,” Teal said earlier this year when asked who he models his game on. “He’s a half-back and his game’s really attractive to me. I love the way he plays.”","pubDate":"2022-11-17 01:04:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Will Dragons shake-up inspire drama-free season","link":"https://www.couriermail.com.au/sport/nrl/nrl-media-street-latest-news-and-moves-in-nrl-media/news-story/c701c3fdc78599196d5b4a24a250e8e4","keywords":["NRL News","Sport news and galleries"],"creator":null,"video_url":null,"description":"Former NRL.com journalist Chris Kennedy has stepped into the recently vacated media manager position at St George Illawarra.","content":"Kennedy takes over from Jack Brady, who quit his post at the Red-V after six seasons.Brady has taken up a role with Ampol, far away from the drama during his time at the Dragons, which included coach Paul McGregor’s sacking, Paul Vaughan’s BBQ-gate and Jack de Belin’s sexual assault case.There was a sense of symmetry to Brady’s time at the Dragons. On his first day in 2017, he announced the signing of Ben Hunt. On his last day in October, he trumpeted the re-signing of the veteran halfback on a two-year extension.FREAK INJURY CUTS DOWN RABS’ SONIt was the freak injury at Wests Tigers that cut down the son of legendary broadcaster Ray ‘Rabbits’ Warren.Well-known Wests Tigers media and communications manager, Chris Warren, has snapped an Achilles during a club’s activity day playing American football at Concord. And it was Ray who helped his son secure the best possible medical treatment.Chris, 52, who previously worked for 2GB and Fox Sports News, will have plaster removed later this week before being placed in a moon boot for two months.“It’s called Wellness Wednesday – a bonding and team building session once a month at the club with all the office staff. Each department is in charge of arranging an activity. It might be soccer, touch footy and then we have lunch together,” Warren said, a former Wests Magpies and Western Reds player.“Everyone gets involved. ‘Sheensy’ (coach Tim Sheens) was out there for the last one when we played touch footy.“It was the media department who determined we play American footy. I don’t know the rules of Gridiron but I know when the quarterback throws it you have to chase the ball down field and that’s what I tried to do.“The quarterback (club pathways performance coach Ben Musolino) had the ball and I took off straight through the middle and then it snapped and I hit the deck. They all thought it was hilarious until they realised the severity of it. It was a bad one - I knew what I did straight away.“I got an Uber to hospital, I thought it would be quicker than an ambo. I had to get a referral in the back of the Uber so I rang my dad – he’s got most medicos in Australia on speed dial because he’s a hypochondriac.“A couple of days later the club doctor (chief medical officer Peter Lorentzos) operated. I’m still working around the clock from home - I can’t walk or drive at the moment. It’s not ideal.“I’m on crutches with a cast and have got myself a little scooter to get me around the kitchen to bathroom and bedroom. I get out of plaster at the end of this week and then go into a boot for about eight weeks.”Wests Tigers management sent Warren a food pack to help him through. Warren’s mum, Monica, has moved in to help out over the past few weeks.“Ever tired cooking or going to the toilet on one leg?” he asked. “Living life on one leg? “It’s bloody hard work.”vSICK LEAVE FOR WC JOURNOSThe Kangaroos and Samoan players have been keeping their distance from certain members of the travelling Australian media contingent after a number of journalists fell ill over in England.The travelling media group swelled in size at the quarter-final stage of the tournament as news outlets sent over troops to cover the pointy end of the World Cup.But a number of journos have faced everything from stomach bugs to the flu as they’ve failed to cope with the chilly English conditions. Temperatures are expected to reach a high of nine degrees in Manchester on Saturday, local time, for the World Cup final at Old Trafford.","pubDate":"2022-11-17 01:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Head on the chopping block’: How Roo turned from scapegoat to saviour with one perfect strike","link":"https://www.foxsports.com.au/football/socceroos/fifa-world-cup-2022-socceroos-greatest-moments-brett-holman-goal-vs-serbia-south-africa-pim-verbeek-latest-news/news-story/34fa932cdc1af2c628a8379faed378c8","keywords":null,"creator":null,"video_url":null,"description":"In the final days leading up to the 2022 World Cup, foxsports.com.au takes a look at some of the biggest moments in Socceroos history to take place at football’s biggest show.","content":null,"pubDate":"2022-11-17 00:02:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Atlanta Utd 0 Aberdeen 1: Leighton Clarkson’s volley steals show in worthwhile workout for Jim Goodwin’s Dons","link":"https://www.thescottishsun.co.uk/sport/football/9776687/atlanta-united-aberdeen-leighton-clarkson-volley-jim-goodwin/","keywords":["Football","Sport","Scottish Premiership"],"creator":["David Friel"],"video_url":null,"description":null,"content":"LEIGHTON CLARKSON’S stunner secured a Stateside friendly win for Aberdeen. The Liverpool loan star volleyed in from 20 yards after meeting Matty Kennedy’s corner. 1 Clarkson's volley flew into the net and decided the game. Credit: youtube.com / atlanta Utd fc Jim Goodwin used his entire squad for the bounce game during the Dons’ Atlanta training camp, with several kids getting game time. The MLS side started on top but Aberdeen soon came into the match and began to create. Kennedy fired over the bar with a decent effort from long range. Clarkson then had a shot saved by Atlanta keeper Sebastian Guetta. Read More Scottish Football PLANNING AHEAD Celtic have identified 'two key positions' for January transfer business POOR CALL Steve Clarke blasts ref for missing 'clear penalty' for Scotland against Turkey But he was on target in 67 minutes with a spectacular finish from Kennedy’s corner to seal the win at Atlanta’s training ground. The Dons are in America through their link-up with Atlanta - but they won't be joined Stateside by SPFL rivals Rangers . The Gers are still expected to fly abroad during the break - although rumours that they would be based in Florida proved wide of the mark. While further details of their plans will be confirmed, to date the Gers have an Ibrox friendly date with Bayer Leverkusen on Saturday, December 10. Most read in Football Turkey 2 Scotland 1 Super John McGinn scores screamer but Scots can't complete fightback STAR PROBE Toney facing huge ban after being charged with 232 breaches of FA betting rules STRIP OFF Every SPFL club to wear AWAY kits at home games over festive period TURKISH DELIGHT Morelos 'on three-man Fenerbahce shortlist' with ex-Celtic ace Dembele Livingston are set to lock horns with an old friend as they take on Michael Beale's promotion-chasing Queens Park Rangers during the World Cup break. The Lions will travel to London to take on the English Championship side on November 29 prior to a winter training camp in Turkey, seeing them meet up with Scotland man Lyndon Dykes - who was sold for £1.7 million by the Lions two years ago. Then it's on to Turkey with Livi set to play a small sided tournament which is also thought to include Serie A side Salernitana. David Martindale said recently: “We go down on the 28th, play on the 29th, then come back and go to Turkey for a week and have two games there. “Every top-flight league is off so all these teams will be looking for games. They will be against whoever’s in Turkey, we’ll fix them up in the next two weeks. “If I stayed in Scotland I’d be very limited in who I can attract. We’ll get away and get a mini-pre-season into the boys and reset.” Read More on The Sun MAIL FAIL I ordered from Amazon just to ask out hot delivery driver but it was an epic fail LOOKS GOOD I'm a 32G & tried the 'upside down bikini' hack – it's big boobs approved Meanwhile Hearts will return to La Cala Resort on the Costa Del Sol, where they spent time during pre-season in the summer. They are due to fly out on November 30 and will return on December 7. Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-11-16 23:39:09","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Fantasy Football Week 11 Rankings","link":"https://ca.sports.yahoo.com/news/fantasy-football-week-11-rankings-201746004.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-16 23:30:11","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Fantasy Football Week 11: Wide Receiver rankings","link":"https://ca.sports.yahoo.com/news/fantasy-football-week-11-wide-receiver-rankings-220308479.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-16 23:29:40","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Fantasy Football Week 11: Quarterback rankings","link":"https://ca.sports.yahoo.com/news/fantasy-football-week-11-quarterback-rankings-202116089.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-16 23:29:08","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Fantasy Football Week 11: Running Back rankings","link":"https://ca.sports.yahoo.com/news/fantasy-football-week-11-running-back-rankings-210843672.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-16 23:28:32","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Fantasy Football Week 11: Tight End rankings","link":"https://ca.sports.yahoo.com/news/fantasy-football-week-11-tight-end-rankings-202738278.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-16 23:28:19","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Fantasy Football: Week 11 Kicker rankings","link":"https://ca.sports.yahoo.com/news/fantasy-football-week-11-kicker-rankings-214026986.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-16 23:27:56","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"}]}