{"newsArray":[{"article_id":"2136753d7cdc225c0d4e5c89d09d7375","title":"Newcastle condemn racist abuse sent to Bruno Guimaraes and Joe Willock","link":"https://www.southwalesguardian.co.uk/sport/national/23902614.newcastle-condemn-racist-abuse-sent-bruno-guimaraes-joe-willock/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Newcastle beat Arsenal 1-0 at St James’ Park on Saturday.","content":"Newcastle have condemned the racist abuse sent to Bruno Guimaraes and Joe Willock on social media following Saturday’s 1-0 win over Arsenal. Anthony Gordon’s controversial second-half winner ended the Gunners’ unbeaten start to the Premier League season. Willock revealed the abuse he had been sent on Instagram and urged the platform to find those responsible. Newcastle United strongly condemns racist abuse sent to Bruno Guimarães and Joe Willock via social media following yesterday's victory over Arsenal. Our message is clear. There is no room for racism in football or society. — Newcastle United FC (@NUFC) “Newcastle United strongly condemns racist abuse sent to Bruno Guimaraes and Joe Willock via social media following Saturday’s victory over Arsenal,” a Newcastle statement read. “Our message is clear. There is no room for racism in football or society. “We are providing support to Bruno and Joe and will work with relevant authorities and social media platforms to identify those responsible so that they can be held to account.”","pubDate":"2023-11-05 10:37:30","image_url":"https://www.southwalesguardian.co.uk/resources/images/17408879/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c28e0b92c6b43200a09e4e9196edf457","title":"Newcastle condemn racist abuse sent to Bruno Guimaraes and Joe Willock","link":"https://www.northwaleschronicle.co.uk/sport/national/23902614.newcastle-condemn-racist-abuse-sent-bruno-guimaraes-joe-willock/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Newcastle beat Arsenal 1-0 at St James’ Park on Saturday.","content":"Newcastle have condemned the racist abuse sent to Bruno Guimaraes and Joe Willock on social media following Saturday’s 1-0 win over Arsenal. Anthony Gordon’s controversial second-half winner ended the Gunners’ unbeaten start to the Premier League season. Willock revealed the abuse he had been sent on Instagram and urged the platform to find those responsible. Newcastle United strongly condemns racist abuse sent to Bruno Guimarães and Joe Willock via social media following yesterday's victory over Arsenal. Our message is clear. There is no room for racism in football or society. — Newcastle United FC (@NUFC) “Newcastle United strongly condemns racist abuse sent to Bruno Guimaraes and Joe Willock via social media following Saturday’s victory over Arsenal,” a Newcastle statement read. “Our message is clear. There is no room for racism in football or society. “We are providing support to Bruno and Joe and will work with relevant authorities and social media platforms to identify those responsible so that they can be held to account.”","pubDate":"2023-11-05 10:37:30","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17408879/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8b1d54df5474c7ecc0e3bb10d80b553b","title":"Liverpool and Everton could have built crazy 'Siamese stadium' next to each other","link":"https://www.dailystar.co.uk/sport/football/liverpool-everton-crazy-siamese-stadiums-31343941","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool and Everton could have had twin stadium housing if a proposal for a 'Siamese stadium' went through but it was declined by the owners of both clubs","content":"and almost had stadiums built right next to each other that would shared a central spine. The rivals are among the biggest clubs in the world and possess a grand history in English football. Both clubs have played at their respective homes of Anfield and Goodison Park since 1892 in what has been over 125 years of the famed Merseyside derby fixture. Despite the passionate rivalry among both sets of fans, there was once a time when a proposal for a 'Siamese stadium' would have seen Liverpool and Everton's home standing side by side. Back in 2010, the Mersey Stadia-Connex group announced surprising plans for a twin arena housing for the Premier League clubs. The stadiums - which would have been located in Stanley Park - would stand side by side and share one 'central spine'. Images of the proposed stadiums were released over a decade ago with Liverpool's stadium holding a capacity of 60,000 and 50,000 for . The two-sided, ten-level central hub was certainly a unique plan but one that would have saved the clubs between £180million to £220million in production costs and with Liverpool suffering financial issues at the time under then-owners Tom Hicks and George Gillett, there was a possibility it could happen. The proposed construction would have been a 10-story spine with a staggering 300-bed hotel, hospitality facilities, 150 executive boxes and a massive underground car park. Luckily for both sets of fans, the consortium's proposal was declined by both owners. That same year, Liverpool were sold to Fenway Sports Group who transformed the financial standing of the club who were on the verge of entering administration. Since FSG's arrival at Liverpool, Anfield's 45,000 capacity has been increased to 54,000 and is set to expand once again through the £80m Anfield Road Stand expansion that is expected to be completed in 2024. In Everton's case, they'll be saying goodbye to Goodison Park next year as the club are in the midst of building a new ground on Bramley Dock that will cost up to £500m and will hold almost 53,000 fans, a vast improvement on the 39,414 supporters that their current stadium can hold.","pubDate":"2023-11-05 10:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31344755.ece/ALTERNATES/s98/0_Everton-v-Tottenham-Hotspur-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c1d5144f90556e8c3e1efbacc9037741","title":"‘I spent eight hours at Tottenham's training ground – then I left and joined Chelsea’","link":"https://www.dailystar.co.uk/sport/football/willian-tottenham-chelsea-transfer-fulham-31333726","keywords":["Sport"],"creator":null,"video_url":null,"description":"Fulham star Willian delivered one of the biggest transfer snubs of all time when he performed a late U-turn by joining Chelsea over Tottenham","content":"Ten years may have passed but fans still can’t resist poking fun at rivals over one of the biggest hijacks in transfer history. Back in 2013, Willian was on the brink of joining . A deal was so far down the line, the Brazilian midfielder spent eight hours at the club's training ground and a medical had even been booked. But then Chelsea’s mega-rich owner Roman Abramovich got involved, contacting selling club Anzhi Makhachkala of . Willian had been leaning towards joining Chelsea but he was already on Spurs’ territory when his agent, Kia Joorabchian, informed him of the Blues’ interest. Recalling the day of drama during an appearance on Brazilian TV show Resenha in 2018, Willian said not even a threat from Spurs could dissuade him from making a U-turn. Willian, now of Fulham, explained: “I said, ‘So make do, I’ll get back in the van, you’ll make do and I’ll go to Chelsea, I will not sign with Tottenham’. “I stayed there for eight hours in the training centre. Tottenham's director said, ‘I’m going to report you to FIFA, this and that, fans here in England will boo you’, this and that. They made up a lot of things. I got stuck there for eight hours. Then I left and I went straight to meet the Chelsea people to sort the details and sign.” During his time at the club, Chelsea supporters could often be heard singing: “The s*** from Spurs, they booked his flight, but Willian, he saw the light, he got a call from Abramovich, and off he went to Stamford Bridge, he hates Tottenham, he hates Tottenham, he hates Tottenham and he hates Tottenham!” , Chelsea’s manager at the time, also couldn't resist a cheeky dig at Spurs, a club he would later go on to manage. The Portuguese boss quipped: “That's the danger of medicals before contracts.”","pubDate":"2023-11-05 10:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31333626.ece/ALTERNATES/s98/1_GettyImages-611485586.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1e585e3dbc91e5b978be7e6b2e8c0fca","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.northwalespioneer.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.northwalespioneer.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"767a073a14641849e2943be4cc42f97d","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.southwalesguardian.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.southwalesguardian.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"40cad615c20bdf372db8ca5e297eae7a","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.northwaleschronicle.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d1391f5c045f45bf80011c2c0f6f24ce","title":"Football fans think Abu Dhabi TV channel has its own Gary Neville with uncanny lookalike","link":"https://www.dailystar.co.uk/sport/football/gary-neville-lookalike-abu-dhabi-31364599","keywords":["Sport"],"creator":null,"video_url":null,"description":"Supporters on social media were forced to double take after a snap of a Gary Neville lookalike analysing football on TV in the United Arab Emirates emerged","content":"Footy fans think is doing punditry in the Middle East on the sly after spotting his doppelganger on TV in Abu Dhabi. An image of a man, who looks suspiciously similar to the legend, wearing a traditional Arab robe known as a thawb has been doing the rounds on social media, leading to a number of entertaining conspiracy theories. One person suggested that the TV station had cloned Neville in an attempt to up their punditry game, while another reckoned the ex-England defender was leading a secret double life. \"Abu Dhabi Sports have their own Gary Neville and it's the funniest thing I've seen all day,\" one X user wrote. Another named him \"Garab Neville\", while a third joked: \"I wonder if he's blaming the Glazers for everything too.\" A fourth noted: \"It's like if you bought Gary Neville from Wish.\" A fifth wrote: \"Saudi Arabia and Qatar are buying the while the United Arab Emirates are buying a clone of Gary Neville. Sports washing done right haha,\" while another said: \"Love the idea of Neville sneaking off to Abu Dhabi every few days behind his family's back just to get his punditry fix lol.\" In actuality, the doppelganger's name is Hassan Ibrahim. He is a former footballer and technical analyst on Abu Dhabi's chief sports channel, AD Sports. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month Unlike Neville, Ibrahim doesn't actually cover matches. Instead, AD Sports covers games across the Middle East, as well as matches in Italy's Serie A, Australia's A-League, and the USA's MLS.","pubDate":"2023-11-05 10:07:15","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31364687.ece/ALTERNATES/s98/1_Untitled-1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"35c0aa1aa54b0488e1fe2238d7fd634f","title":"Rotting 50,000-seater stadium reclaimed by wildlife has homeless people living in stands","link":"https://www.dailystar.co.uk/sport/football/abandoned-stadium-euros-czech-republic-31333624","keywords":["Sport"],"creator":null,"video_url":null,"description":"Stadion Za Luzankami may be a mouthful, but this shadow of a stadium would have once fed thousands of hungry supporters with the top class football they had come to see","content":"No one likes to see a stadium in disrepair, but this Czech ground really is a forgotten relic. The Za Luzankami was home to Zbrojovka Brno, once champions of the country's first tier, and boasters of the largest audience ever gathered for a top-flight game in the Czech Republic. Brno do still play, but at the far less breathtaking Adax Invest Arena. So what happened to their once grand home, and how did it fall into such a state? Built between 1949 and 1953, the stadium was the largest in its country during the 60s and 70s and hosted international matches and domestic matches alike. Brno featured in the 1965/66 competition of the Europa League's predecessor, the Fair's Cup. The trophy, won by Catalan giants , featured the likes of Leeds United, , and , but in the first round, there was little old Brno. The lucky sides to visit the Za Luzankmai that year? Italian greats and Scottish club who conquered the Czech side 2-0 over both legs. Other notable European sides that took to this once-great pitch include former sides Dinamo Zagreb, Dinamo Moscow and Sparta Prague. The qualifying for Euro 1988 also saw some of its matches grace this stage, with Denmark, and Finland featuring in a group with what was then Czechoslovakia, but only Finland visiting the ground. The likes of Ian Rush, Mark Hughes and Dean Saunders would have faced a Czech side that may still have Za Luzankami's grass on their boots whilst facing off at Racecourse Ground in 1987. Speaking of famous British grounds, the that played host to England's 1966 victory can also be spoken of in the same breath as the Za Luzankami. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Internationally, Poland, Turkey and most notably, , visited the ground throughout its existence. A 1961 clash between La Albiceleste and Czechoslovakia was played out at the stadium, with players such as Antonia Roma, Luis Artime, and Rafael Albrecht featuring. Who are these players, you may ask? All three were beaten at Wembley in the 1966 World Cup quarter-finals, as England squeaked by 1-0 to pencil in that meeting with Eusebio's Portugal. It was Geoff Hurst who nodded the winner home, and has to the Sir Bobby Charlton. Illustrious boots have run on Za Luzankami's pitch, and a club legend looked to have revived the ground in 2015. Petr Svancara, long-time captain of Brno, was upset by the idea that he wouldn't be able to play one last time at the club's home, and so started a campaign to clean up the ground. After the ground eventually reopened to host a friendly in front of 35,000, Svancara described its former state as somewhere \"you could have shot a beautiful horror film.\" The community came together to clean it up, but this was short-lasted, as despite hosting a few concerts and various other events, the ground has fallen back into the horror-film-like state that it was post-2015. It is a shame to see a stadium that still boasts the largest ever Czech league crowd of 44,120 to lay desolate. FIFA and Czech FA stadium criteria are mostly to blame, as it is not up to standard, but this ground is ultimately a product of an era left behind.","pubDate":"2023-11-05 10:00:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31335483.ece/ALTERNATES/s98/0_PAY-Abadoned-Stadion-Za-Luzankami-is-a-currently-inactive-stadium-in-Brno-Czech-Republic-Captured-in-s.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"659a92c67352197fccc92fe74c00175c","title":"Fernando Alonso could barely walk after one of F1's worst crashes in Brazil","link":"https://www.dailystar.co.uk/sport/f1/alonso-crash-brazil-grand-prix-31335269","keywords":["Sport"],"creator":null,"video_url":null,"description":"It's not often that you crash, end up in hospital, but still end up on a podium - but a 21-year-old Fernando Alonso did just that for Renault during the 2003 Brazilian Grand Prix at Interlagos","content":"It's never great when an F1 Grand Prix has ten drivers retire, and so it's safe to say that the 2003 Brazilian Grand Prix can be classified as a chaotic one. In front of roughly 120,000 spectators, a soaked Interlagos played host to a series of crashes, and a race that began with eight safety car laps. The aquaplaning that ensued claimed a few notable names, including Jenson Button, whose topsy-turvy relationship with Interlagos saw him later his his , but also be from qualifying. Michael Schumacher also crashed out, resulting in a non-finish that was, at the time, his first in over two years. The only crash to rival Alonso's however was Mark Webber's. With David Coulthard heading into the pits, Webber took it upon himself to gain ground, but ended up losing control on the main straight and wrecking his to the point where it looked like a wheel-less lump. It was one of Webber's wheels that Alonso didn't see. It was Alonso however who really stole the show, smashing into the tire and then into a tire sidewall, leaving him with a bruised left elbow, knee and thigh and being observed in room 1114 of the Saint Louis Hospital in Sao Paolo. He said: \"I am lucky to have got off so lightly. The impact was massive. It all went too quickly. From the third corner onward, I had seen the yellow flags and the sign telling me that the safety car was coming out.\" \"But, at that moment, there were yellow flags all around the circuit. I was careful, but I didn't expect there to be as much debris. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month \"I couldn't avoid a tire in the middle of the track. I remember hurtling towards the wall. The first impact was very hard. Many people have sent me their best wishes.\" With over three-quarters of the race done, the result was declared, with a young Kimi Raikkonen leading the way. The controversy on the track continued off it, however. Giancarlo Fisichella’s Jordan which was in second place on lap 53, had overheated due to it slowly trudging along behind a safety car, and stunningly burst into flames as it returned to the pits. Raikkonen took the winner’s trophy home but five days later it was successfully argued that the Italian was actually ten seconds into his 56th lap when the red flag came out and therefore the result should be based on the standings after 54 laps, when Fisichella was ahead of Raikkonen by 0.9 of a second. Fisichella was eventually rewarded the win after the result reached court, and despite missing out on the ceremony, he got his hands on the trophy two weeks later at the San Marino Grand Prix saying \"I’m glad to have won at last, but I still feel annoyed that I was prevented from celebrating on the podium.\" The 2003 Brazilian Grand Prix was clearly an exciting one, and here's to hoping this weekends race can be just as riveting.","pubDate":"2023-11-05 10:00:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article19461937.ece/ALTERNATES/s98/0_httpscdnimagesdailystarcoukdynamic122photos792000900x738841792","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2136753d7cdc225c0d4e5c89d09d7375","title":"Newcastle condemn racist abuse sent to Bruno Guimaraes and Joe Willock","link":"https://www.southwalesguardian.co.uk/sport/national/23902614.newcastle-condemn-racist-abuse-sent-bruno-guimaraes-joe-willock/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Newcastle beat Arsenal 1-0 at St James’ Park on Saturday.","content":"Newcastle have condemned the racist abuse sent to Bruno Guimaraes and Joe Willock on social media following Saturday’s 1-0 win over Arsenal. Anthony Gordon’s controversial second-half winner ended the Gunners’ unbeaten start to the Premier League season. Willock revealed the abuse he had been sent on Instagram and urged the platform to find those responsible. Newcastle United strongly condemns racist abuse sent to Bruno Guimarães and Joe Willock via social media following yesterday's victory over Arsenal. Our message is clear. There is no room for racism in football or society. — Newcastle United FC (@NUFC) “Newcastle United strongly condemns racist abuse sent to Bruno Guimaraes and Joe Willock via social media following Saturday’s victory over Arsenal,” a Newcastle statement read. “Our message is clear. There is no room for racism in football or society. “We are providing support to Bruno and Joe and will work with relevant authorities and social media platforms to identify those responsible so that they can be held to account.”","pubDate":"2023-11-05 10:37:30","image_url":"https://www.southwalesguardian.co.uk/resources/images/17408879/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c28e0b92c6b43200a09e4e9196edf457","title":"Newcastle condemn racist abuse sent to Bruno Guimaraes and Joe Willock","link":"https://www.northwaleschronicle.co.uk/sport/national/23902614.newcastle-condemn-racist-abuse-sent-bruno-guimaraes-joe-willock/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Newcastle beat Arsenal 1-0 at St James’ Park on Saturday.","content":"Newcastle have condemned the racist abuse sent to Bruno Guimaraes and Joe Willock on social media following Saturday’s 1-0 win over Arsenal. Anthony Gordon’s controversial second-half winner ended the Gunners’ unbeaten start to the Premier League season. Willock revealed the abuse he had been sent on Instagram and urged the platform to find those responsible. Newcastle United strongly condemns racist abuse sent to Bruno Guimarães and Joe Willock via social media following yesterday's victory over Arsenal. Our message is clear. There is no room for racism in football or society. — Newcastle United FC (@NUFC) “Newcastle United strongly condemns racist abuse sent to Bruno Guimaraes and Joe Willock via social media following Saturday’s victory over Arsenal,” a Newcastle statement read. “Our message is clear. There is no room for racism in football or society. “We are providing support to Bruno and Joe and will work with relevant authorities and social media platforms to identify those responsible so that they can be held to account.”","pubDate":"2023-11-05 10:37:30","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17408879/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8b1d54df5474c7ecc0e3bb10d80b553b","title":"Liverpool and Everton could have built crazy 'Siamese stadium' next to each other","link":"https://www.dailystar.co.uk/sport/football/liverpool-everton-crazy-siamese-stadiums-31343941","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool and Everton could have had twin stadium housing if a proposal for a 'Siamese stadium' went through but it was declined by the owners of both clubs","content":"and almost had stadiums built right next to each other that would shared a central spine. The rivals are among the biggest clubs in the world and possess a grand history in English football. Both clubs have played at their respective homes of Anfield and Goodison Park since 1892 in what has been over 125 years of the famed Merseyside derby fixture. Despite the passionate rivalry among both sets of fans, there was once a time when a proposal for a 'Siamese stadium' would have seen Liverpool and Everton's home standing side by side. Back in 2010, the Mersey Stadia-Connex group announced surprising plans for a twin arena housing for the Premier League clubs. The stadiums - which would have been located in Stanley Park - would stand side by side and share one 'central spine'. Images of the proposed stadiums were released over a decade ago with Liverpool's stadium holding a capacity of 60,000 and 50,000 for . The two-sided, ten-level central hub was certainly a unique plan but one that would have saved the clubs between £180million to £220million in production costs and with Liverpool suffering financial issues at the time under then-owners Tom Hicks and George Gillett, there was a possibility it could happen. The proposed construction would have been a 10-story spine with a staggering 300-bed hotel, hospitality facilities, 150 executive boxes and a massive underground car park. Luckily for both sets of fans, the consortium's proposal was declined by both owners. That same year, Liverpool were sold to Fenway Sports Group who transformed the financial standing of the club who were on the verge of entering administration. Since FSG's arrival at Liverpool, Anfield's 45,000 capacity has been increased to 54,000 and is set to expand once again through the £80m Anfield Road Stand expansion that is expected to be completed in 2024. In Everton's case, they'll be saying goodbye to Goodison Park next year as the club are in the midst of building a new ground on Bramley Dock that will cost up to £500m and will hold almost 53,000 fans, a vast improvement on the 39,414 supporters that their current stadium can hold.","pubDate":"2023-11-05 10:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31344755.ece/ALTERNATES/s98/0_Everton-v-Tottenham-Hotspur-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c1d5144f90556e8c3e1efbacc9037741","title":"‘I spent eight hours at Tottenham's training ground – then I left and joined Chelsea’","link":"https://www.dailystar.co.uk/sport/football/willian-tottenham-chelsea-transfer-fulham-31333726","keywords":["Sport"],"creator":null,"video_url":null,"description":"Fulham star Willian delivered one of the biggest transfer snubs of all time when he performed a late U-turn by joining Chelsea over Tottenham","content":"Ten years may have passed but fans still can’t resist poking fun at rivals over one of the biggest hijacks in transfer history. Back in 2013, Willian was on the brink of joining . A deal was so far down the line, the Brazilian midfielder spent eight hours at the club's training ground and a medical had even been booked. But then Chelsea’s mega-rich owner Roman Abramovich got involved, contacting selling club Anzhi Makhachkala of . Willian had been leaning towards joining Chelsea but he was already on Spurs’ territory when his agent, Kia Joorabchian, informed him of the Blues’ interest. Recalling the day of drama during an appearance on Brazilian TV show Resenha in 2018, Willian said not even a threat from Spurs could dissuade him from making a U-turn. Willian, now of Fulham, explained: “I said, ‘So make do, I’ll get back in the van, you’ll make do and I’ll go to Chelsea, I will not sign with Tottenham’. “I stayed there for eight hours in the training centre. Tottenham's director said, ‘I’m going to report you to FIFA, this and that, fans here in England will boo you’, this and that. They made up a lot of things. I got stuck there for eight hours. Then I left and I went straight to meet the Chelsea people to sort the details and sign.” During his time at the club, Chelsea supporters could often be heard singing: “The s*** from Spurs, they booked his flight, but Willian, he saw the light, he got a call from Abramovich, and off he went to Stamford Bridge, he hates Tottenham, he hates Tottenham, he hates Tottenham and he hates Tottenham!” , Chelsea’s manager at the time, also couldn't resist a cheeky dig at Spurs, a club he would later go on to manage. The Portuguese boss quipped: “That's the danger of medicals before contracts.”","pubDate":"2023-11-05 10:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31333626.ece/ALTERNATES/s98/1_GettyImages-611485586.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1e585e3dbc91e5b978be7e6b2e8c0fca","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.northwalespioneer.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.northwalespioneer.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"767a073a14641849e2943be4cc42f97d","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.southwalesguardian.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.southwalesguardian.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"40cad615c20bdf372db8ca5e297eae7a","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.northwaleschronicle.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d1391f5c045f45bf80011c2c0f6f24ce","title":"Football fans think Abu Dhabi TV channel has its own Gary Neville with uncanny lookalike","link":"https://www.dailystar.co.uk/sport/football/gary-neville-lookalike-abu-dhabi-31364599","keywords":["Sport"],"creator":null,"video_url":null,"description":"Supporters on social media were forced to double take after a snap of a Gary Neville lookalike analysing football on TV in the United Arab Emirates emerged","content":"Footy fans think is doing punditry in the Middle East on the sly after spotting his doppelganger on TV in Abu Dhabi. An image of a man, who looks suspiciously similar to the legend, wearing a traditional Arab robe known as a thawb has been doing the rounds on social media, leading to a number of entertaining conspiracy theories. One person suggested that the TV station had cloned Neville in an attempt to up their punditry game, while another reckoned the ex-England defender was leading a secret double life. \"Abu Dhabi Sports have their own Gary Neville and it's the funniest thing I've seen all day,\" one X user wrote. Another named him \"Garab Neville\", while a third joked: \"I wonder if he's blaming the Glazers for everything too.\" A fourth noted: \"It's like if you bought Gary Neville from Wish.\" A fifth wrote: \"Saudi Arabia and Qatar are buying the while the United Arab Emirates are buying a clone of Gary Neville. Sports washing done right haha,\" while another said: \"Love the idea of Neville sneaking off to Abu Dhabi every few days behind his family's back just to get his punditry fix lol.\" In actuality, the doppelganger's name is Hassan Ibrahim. He is a former footballer and technical analyst on Abu Dhabi's chief sports channel, AD Sports. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month Unlike Neville, Ibrahim doesn't actually cover matches. Instead, AD Sports covers games across the Middle East, as well as matches in Italy's Serie A, Australia's A-League, and the USA's MLS.","pubDate":"2023-11-05 10:07:15","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31364687.ece/ALTERNATES/s98/1_Untitled-1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"35c0aa1aa54b0488e1fe2238d7fd634f","title":"Rotting 50,000-seater stadium reclaimed by wildlife has homeless people living in stands","link":"https://www.dailystar.co.uk/sport/football/abandoned-stadium-euros-czech-republic-31333624","keywords":["Sport"],"creator":null,"video_url":null,"description":"Stadion Za Luzankami may be a mouthful, but this shadow of a stadium would have once fed thousands of hungry supporters with the top class football they had come to see","content":"No one likes to see a stadium in disrepair, but this Czech ground really is a forgotten relic. The Za Luzankami was home to Zbrojovka Brno, once champions of the country's first tier, and boasters of the largest audience ever gathered for a top-flight game in the Czech Republic. Brno do still play, but at the far less breathtaking Adax Invest Arena. So what happened to their once grand home, and how did it fall into such a state? Built between 1949 and 1953, the stadium was the largest in its country during the 60s and 70s and hosted international matches and domestic matches alike. Brno featured in the 1965/66 competition of the Europa League's predecessor, the Fair's Cup. The trophy, won by Catalan giants , featured the likes of Leeds United, , and , but in the first round, there was little old Brno. The lucky sides to visit the Za Luzankmai that year? Italian greats and Scottish club who conquered the Czech side 2-0 over both legs. Other notable European sides that took to this once-great pitch include former sides Dinamo Zagreb, Dinamo Moscow and Sparta Prague. The qualifying for Euro 1988 also saw some of its matches grace this stage, with Denmark, and Finland featuring in a group with what was then Czechoslovakia, but only Finland visiting the ground. The likes of Ian Rush, Mark Hughes and Dean Saunders would have faced a Czech side that may still have Za Luzankami's grass on their boots whilst facing off at Racecourse Ground in 1987. Speaking of famous British grounds, the that played host to England's 1966 victory can also be spoken of in the same breath as the Za Luzankami. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Internationally, Poland, Turkey and most notably, , visited the ground throughout its existence. A 1961 clash between La Albiceleste and Czechoslovakia was played out at the stadium, with players such as Antonia Roma, Luis Artime, and Rafael Albrecht featuring. Who are these players, you may ask? All three were beaten at Wembley in the 1966 World Cup quarter-finals, as England squeaked by 1-0 to pencil in that meeting with Eusebio's Portugal. It was Geoff Hurst who nodded the winner home, and has to the Sir Bobby Charlton. Illustrious boots have run on Za Luzankami's pitch, and a club legend looked to have revived the ground in 2015. Petr Svancara, long-time captain of Brno, was upset by the idea that he wouldn't be able to play one last time at the club's home, and so started a campaign to clean up the ground. After the ground eventually reopened to host a friendly in front of 35,000, Svancara described its former state as somewhere \"you could have shot a beautiful horror film.\" The community came together to clean it up, but this was short-lasted, as despite hosting a few concerts and various other events, the ground has fallen back into the horror-film-like state that it was post-2015. It is a shame to see a stadium that still boasts the largest ever Czech league crowd of 44,120 to lay desolate. FIFA and Czech FA stadium criteria are mostly to blame, as it is not up to standard, but this ground is ultimately a product of an era left behind.","pubDate":"2023-11-05 10:00:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31335483.ece/ALTERNATES/s98/0_PAY-Abadoned-Stadion-Za-Luzankami-is-a-currently-inactive-stadium-in-Brno-Czech-Republic-Captured-in-s.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"659a92c67352197fccc92fe74c00175c","title":"Fernando Alonso could barely walk after one of F1's worst crashes in Brazil","link":"https://www.dailystar.co.uk/sport/f1/alonso-crash-brazil-grand-prix-31335269","keywords":["Sport"],"creator":null,"video_url":null,"description":"It's not often that you crash, end up in hospital, but still end up on a podium - but a 21-year-old Fernando Alonso did just that for Renault during the 2003 Brazilian Grand Prix at Interlagos","content":"It's never great when an F1 Grand Prix has ten drivers retire, and so it's safe to say that the 2003 Brazilian Grand Prix can be classified as a chaotic one. In front of roughly 120,000 spectators, a soaked Interlagos played host to a series of crashes, and a race that began with eight safety car laps. The aquaplaning that ensued claimed a few notable names, including Jenson Button, whose topsy-turvy relationship with Interlagos saw him later his his , but also be from qualifying. Michael Schumacher also crashed out, resulting in a non-finish that was, at the time, his first in over two years. The only crash to rival Alonso's however was Mark Webber's. With David Coulthard heading into the pits, Webber took it upon himself to gain ground, but ended up losing control on the main straight and wrecking his to the point where it looked like a wheel-less lump. It was one of Webber's wheels that Alonso didn't see. It was Alonso however who really stole the show, smashing into the tire and then into a tire sidewall, leaving him with a bruised left elbow, knee and thigh and being observed in room 1114 of the Saint Louis Hospital in Sao Paolo. He said: \"I am lucky to have got off so lightly. The impact was massive. It all went too quickly. From the third corner onward, I had seen the yellow flags and the sign telling me that the safety car was coming out.\" \"But, at that moment, there were yellow flags all around the circuit. I was careful, but I didn't expect there to be as much debris. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month \"I couldn't avoid a tire in the middle of the track. I remember hurtling towards the wall. The first impact was very hard. Many people have sent me their best wishes.\" With over three-quarters of the race done, the result was declared, with a young Kimi Raikkonen leading the way. The controversy on the track continued off it, however. Giancarlo Fisichella’s Jordan which was in second place on lap 53, had overheated due to it slowly trudging along behind a safety car, and stunningly burst into flames as it returned to the pits. Raikkonen took the winner’s trophy home but five days later it was successfully argued that the Italian was actually ten seconds into his 56th lap when the red flag came out and therefore the result should be based on the standings after 54 laps, when Fisichella was ahead of Raikkonen by 0.9 of a second. Fisichella was eventually rewarded the win after the result reached court, and despite missing out on the ceremony, he got his hands on the trophy two weeks later at the San Marino Grand Prix saying \"I’m glad to have won at last, but I still feel annoyed that I was prevented from celebrating on the podium.\" The 2003 Brazilian Grand Prix was clearly an exciting one, and here's to hoping this weekends race can be just as riveting.","pubDate":"2023-11-05 10:00:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article19461937.ece/ALTERNATES/s98/0_httpscdnimagesdailystarcoukdynamic122photos792000900x738841792","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2136753d7cdc225c0d4e5c89d09d7375","title":"Newcastle condemn racist abuse sent to Bruno Guimaraes and Joe Willock","link":"https://www.southwalesguardian.co.uk/sport/national/23902614.newcastle-condemn-racist-abuse-sent-bruno-guimaraes-joe-willock/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Newcastle beat Arsenal 1-0 at St James’ Park on Saturday.","content":"Newcastle have condemned the racist abuse sent to Bruno Guimaraes and Joe Willock on social media following Saturday’s 1-0 win over Arsenal. Anthony Gordon’s controversial second-half winner ended the Gunners’ unbeaten start to the Premier League season. Willock revealed the abuse he had been sent on Instagram and urged the platform to find those responsible. Newcastle United strongly condemns racist abuse sent to Bruno Guimarães and Joe Willock via social media following yesterday's victory over Arsenal. Our message is clear. There is no room for racism in football or society. — Newcastle United FC (@NUFC) “Newcastle United strongly condemns racist abuse sent to Bruno Guimaraes and Joe Willock via social media following Saturday’s victory over Arsenal,” a Newcastle statement read. “Our message is clear. There is no room for racism in football or society. “We are providing support to Bruno and Joe and will work with relevant authorities and social media platforms to identify those responsible so that they can be held to account.”","pubDate":"2023-11-05 10:37:30","image_url":"https://www.southwalesguardian.co.uk/resources/images/17408879/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c28e0b92c6b43200a09e4e9196edf457","title":"Newcastle condemn racist abuse sent to Bruno Guimaraes and Joe Willock","link":"https://www.northwaleschronicle.co.uk/sport/national/23902614.newcastle-condemn-racist-abuse-sent-bruno-guimaraes-joe-willock/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Newcastle beat Arsenal 1-0 at St James’ Park on Saturday.","content":"Newcastle have condemned the racist abuse sent to Bruno Guimaraes and Joe Willock on social media following Saturday’s 1-0 win over Arsenal. Anthony Gordon’s controversial second-half winner ended the Gunners’ unbeaten start to the Premier League season. Willock revealed the abuse he had been sent on Instagram and urged the platform to find those responsible. Newcastle United strongly condemns racist abuse sent to Bruno Guimarães and Joe Willock via social media following yesterday's victory over Arsenal. Our message is clear. There is no room for racism in football or society. — Newcastle United FC (@NUFC) “Newcastle United strongly condemns racist abuse sent to Bruno Guimaraes and Joe Willock via social media following Saturday’s victory over Arsenal,” a Newcastle statement read. “Our message is clear. There is no room for racism in football or society. “We are providing support to Bruno and Joe and will work with relevant authorities and social media platforms to identify those responsible so that they can be held to account.”","pubDate":"2023-11-05 10:37:30","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17408879/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8b1d54df5474c7ecc0e3bb10d80b553b","title":"Liverpool and Everton could have built crazy 'Siamese stadium' next to each other","link":"https://www.dailystar.co.uk/sport/football/liverpool-everton-crazy-siamese-stadiums-31343941","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool and Everton could have had twin stadium housing if a proposal for a 'Siamese stadium' went through but it was declined by the owners of both clubs","content":"and almost had stadiums built right next to each other that would shared a central spine. The rivals are among the biggest clubs in the world and possess a grand history in English football. Both clubs have played at their respective homes of Anfield and Goodison Park since 1892 in what has been over 125 years of the famed Merseyside derby fixture. Despite the passionate rivalry among both sets of fans, there was once a time when a proposal for a 'Siamese stadium' would have seen Liverpool and Everton's home standing side by side. Back in 2010, the Mersey Stadia-Connex group announced surprising plans for a twin arena housing for the Premier League clubs. The stadiums - which would have been located in Stanley Park - would stand side by side and share one 'central spine'. Images of the proposed stadiums were released over a decade ago with Liverpool's stadium holding a capacity of 60,000 and 50,000 for . The two-sided, ten-level central hub was certainly a unique plan but one that would have saved the clubs between £180million to £220million in production costs and with Liverpool suffering financial issues at the time under then-owners Tom Hicks and George Gillett, there was a possibility it could happen. The proposed construction would have been a 10-story spine with a staggering 300-bed hotel, hospitality facilities, 150 executive boxes and a massive underground car park. Luckily for both sets of fans, the consortium's proposal was declined by both owners. That same year, Liverpool were sold to Fenway Sports Group who transformed the financial standing of the club who were on the verge of entering administration. Since FSG's arrival at Liverpool, Anfield's 45,000 capacity has been increased to 54,000 and is set to expand once again through the £80m Anfield Road Stand expansion that is expected to be completed in 2024. In Everton's case, they'll be saying goodbye to Goodison Park next year as the club are in the midst of building a new ground on Bramley Dock that will cost up to £500m and will hold almost 53,000 fans, a vast improvement on the 39,414 supporters that their current stadium can hold.","pubDate":"2023-11-05 10:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31344755.ece/ALTERNATES/s98/0_Everton-v-Tottenham-Hotspur-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c1d5144f90556e8c3e1efbacc9037741","title":"‘I spent eight hours at Tottenham's training ground – then I left and joined Chelsea’","link":"https://www.dailystar.co.uk/sport/football/willian-tottenham-chelsea-transfer-fulham-31333726","keywords":["Sport"],"creator":null,"video_url":null,"description":"Fulham star Willian delivered one of the biggest transfer snubs of all time when he performed a late U-turn by joining Chelsea over Tottenham","content":"Ten years may have passed but fans still can’t resist poking fun at rivals over one of the biggest hijacks in transfer history. Back in 2013, Willian was on the brink of joining . A deal was so far down the line, the Brazilian midfielder spent eight hours at the club's training ground and a medical had even been booked. But then Chelsea’s mega-rich owner Roman Abramovich got involved, contacting selling club Anzhi Makhachkala of . Willian had been leaning towards joining Chelsea but he was already on Spurs’ territory when his agent, Kia Joorabchian, informed him of the Blues’ interest. Recalling the day of drama during an appearance on Brazilian TV show Resenha in 2018, Willian said not even a threat from Spurs could dissuade him from making a U-turn. Willian, now of Fulham, explained: “I said, ‘So make do, I’ll get back in the van, you’ll make do and I’ll go to Chelsea, I will not sign with Tottenham’. “I stayed there for eight hours in the training centre. Tottenham's director said, ‘I’m going to report you to FIFA, this and that, fans here in England will boo you’, this and that. They made up a lot of things. I got stuck there for eight hours. Then I left and I went straight to meet the Chelsea people to sort the details and sign.” During his time at the club, Chelsea supporters could often be heard singing: “The s*** from Spurs, they booked his flight, but Willian, he saw the light, he got a call from Abramovich, and off he went to Stamford Bridge, he hates Tottenham, he hates Tottenham, he hates Tottenham and he hates Tottenham!” , Chelsea’s manager at the time, also couldn't resist a cheeky dig at Spurs, a club he would later go on to manage. The Portuguese boss quipped: “That's the danger of medicals before contracts.”","pubDate":"2023-11-05 10:30:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31333626.ece/ALTERNATES/s98/1_GettyImages-611485586.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1e585e3dbc91e5b978be7e6b2e8c0fca","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.northwalespioneer.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.northwalespioneer.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"767a073a14641849e2943be4cc42f97d","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.southwalesguardian.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.southwalesguardian.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"40cad615c20bdf372db8ca5e297eae7a","title":"Micky Hazard hopes Tottenham fans show ‘class’ as Mauricio Pochettino returns","link":"https://www.northwaleschronicle.co.uk/sport/national/23902585.micky-hazard-hopes-tottenham-fans-show-class-mauricio-pochettino-returns/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Hazard, who also left Spurs and joined rivals Chelsea, hopes Pochettino is applauded on Monday night.","content":"Micky Hazard will applaud former Tottenham manager Mauricio Pochettino when he returns with Chelsea and hopes “class and dignity” will be shown by the club’s supporters. Pochettino will come back to Spurs for the first time since his 2019 dismissal on Monday night, but could be greeted with boos due to a fanbase split over his decision to join bitter rivals Chelsea despite a memorable five years in N17. The climax of Pochettino’s tenure was a remarkable run to the Champions League final, while he also masterminded two ultimately unsuccessful title challenges. \"He delivered one of the greatest nights in the lives of fans\" 🤍 How Mauricio Pochettino will be received upon his return to north London, through the lens of Spurs' fan, Chris Miller ➡️ — Premier League (@premierleague) Ex-midfielder Hazard has walked in Pochettino’s shoes after he left boyhood club Spurs in 1985 to move to Stamford Bridge, but remembers his return 12 months later where he scored twice in a 3-1 win for Chelsea. “When I went back, I would like to think I got applause and cheers because the fans respected the job I did for them,” 1984 UEFA Cup winner Hazard told the PA news agency. “They also respected I had a job to do because I was at another club and it was no slur on Spurs that I scored two goals. And it almost felt like it was two own goals because Spurs is my team. “When Pochettino comes back and while the rivalry is that much greater nowadays, I think it is important as a fanbase we rise above it. “We can show dignity and class by welcoming him back – not giving him a guard of honour as Ange (Postecoglou) says but when his name is read out, to give him a round of applause as acknowledgement and recognition of what he achieved. “Then we go out and try to win the game and Poch is the enemy then, but ultimately we have to respect the job he did. I for one will certainly give him a round of applause when his name is read out.” Pundits had expected Pochettino to hit the ground running at Chelsea and Tottenham to struggle without record scorer Harry Kane. The opposite has occurred, with Postecoglou embarking on a superb 10-game unbeaten start to the Premier League season, and Hazard lauded the impact of summer signing James Maddison. He added: “Look, anyone that loses a player of the stature and quality of Harry Kane is not going to be a better side because of it, but what Ange has managed to do is introduce a style where the players enjoy playing to that style. “Of course James Maddison has come in and been the hub of the team with the creativity. That’s something we haven’t had for a while, that instinctive, creative, flair player that can unlock tight defences, play telling passes and score the odd goal, so he has been a revelation. “It has been a real pleasure for me to see and he has ignited quality elsewhere in the team as well, which is brilliant. “It feels like the players have all been given the freedom of expression within the framework of what Ange wants. There are smiley, happy faces on the pitch and we’re playing smiley, happy football, so they both go hand-in-hand and for me it is a joy to watch.” While Hazard acknowledged there are “bigger tests” to come for Spurs, they pale into insignificance compared to the challenge his family has faced in recent times. Hazard’s nephew Jay took his own life in 2019 but through the darkest of periods Hazard’s sister Michelle joined forces with her brother to set up Legend on the Bench charity. It aims to raise funds to put benches in parks across the UK with telephone numbers on to help with suicide prevention and the first bench in memory of Jay, which will have the numbers of mental health helplines lit up, will be installed on February 28 in Sawbridgeworth. The next fundraising event will occur at Fishers Green Car Park on November 18 with a 10-kilometre trek. For everyone attending the march for Suicide prevention on November 18th your name will be put into a hat and if drawn out you will win a framed 2008 Caribo cup signed shirt Pictured below. See you there X — Micky Hazard525 (@1MickyHazard) “We set the charity up in memory of Jay and we decided to go down the path of fundraising to help people in similar situations because we had no idea Jay was about to do it. He never spoke to anybody,” Hazard reflected. “We named it Legend on the Bench and people sometimes think we mean like former players, but no, it is the name of the telephone numbers because they are the people who are the legends, the people that people will ring and who will save them. “And the message is talk. There is always someone there to listen or to talk to, so if you are sitting there in your moment of need, just give those numbers a call and someone will be ready to talk to and possibly we save a life.”","pubDate":"2023-11-05 10:08:27","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17408847/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d1391f5c045f45bf80011c2c0f6f24ce","title":"Football fans think Abu Dhabi TV channel has its own Gary Neville with uncanny lookalike","link":"https://www.dailystar.co.uk/sport/football/gary-neville-lookalike-abu-dhabi-31364599","keywords":["Sport"],"creator":null,"video_url":null,"description":"Supporters on social media were forced to double take after a snap of a Gary Neville lookalike analysing football on TV in the United Arab Emirates emerged","content":"Footy fans think is doing punditry in the Middle East on the sly after spotting his doppelganger on TV in Abu Dhabi. An image of a man, who looks suspiciously similar to the legend, wearing a traditional Arab robe known as a thawb has been doing the rounds on social media, leading to a number of entertaining conspiracy theories. One person suggested that the TV station had cloned Neville in an attempt to up their punditry game, while another reckoned the ex-England defender was leading a secret double life. \"Abu Dhabi Sports have their own Gary Neville and it's the funniest thing I've seen all day,\" one X user wrote. Another named him \"Garab Neville\", while a third joked: \"I wonder if he's blaming the Glazers for everything too.\" A fourth noted: \"It's like if you bought Gary Neville from Wish.\" A fifth wrote: \"Saudi Arabia and Qatar are buying the while the United Arab Emirates are buying a clone of Gary Neville. Sports washing done right haha,\" while another said: \"Love the idea of Neville sneaking off to Abu Dhabi every few days behind his family's back just to get his punditry fix lol.\" In actuality, the doppelganger's name is Hassan Ibrahim. He is a former footballer and technical analyst on Abu Dhabi's chief sports channel, AD Sports. TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month Unlike Neville, Ibrahim doesn't actually cover matches. Instead, AD Sports covers games across the Middle East, as well as matches in Italy's Serie A, Australia's A-League, and the USA's MLS.","pubDate":"2023-11-05 10:07:15","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31364687.ece/ALTERNATES/s98/1_Untitled-1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"35c0aa1aa54b0488e1fe2238d7fd634f","title":"Rotting 50,000-seater stadium reclaimed by wildlife has homeless people living in stands","link":"https://www.dailystar.co.uk/sport/football/abandoned-stadium-euros-czech-republic-31333624","keywords":["Sport"],"creator":null,"video_url":null,"description":"Stadion Za Luzankami may be a mouthful, but this shadow of a stadium would have once fed thousands of hungry supporters with the top class football they had come to see","content":"No one likes to see a stadium in disrepair, but this Czech ground really is a forgotten relic. The Za Luzankami was home to Zbrojovka Brno, once champions of the country's first tier, and boasters of the largest audience ever gathered for a top-flight game in the Czech Republic. Brno do still play, but at the far less breathtaking Adax Invest Arena. So what happened to their once grand home, and how did it fall into such a state? Built between 1949 and 1953, the stadium was the largest in its country during the 60s and 70s and hosted international matches and domestic matches alike. Brno featured in the 1965/66 competition of the Europa League's predecessor, the Fair's Cup. The trophy, won by Catalan giants , featured the likes of Leeds United, , and , but in the first round, there was little old Brno. The lucky sides to visit the Za Luzankmai that year? Italian greats and Scottish club who conquered the Czech side 2-0 over both legs. Other notable European sides that took to this once-great pitch include former sides Dinamo Zagreb, Dinamo Moscow and Sparta Prague. The qualifying for Euro 1988 also saw some of its matches grace this stage, with Denmark, and Finland featuring in a group with what was then Czechoslovakia, but only Finland visiting the ground. The likes of Ian Rush, Mark Hughes and Dean Saunders would have faced a Czech side that may still have Za Luzankami's grass on their boots whilst facing off at Racecourse Ground in 1987. Speaking of famous British grounds, the that played host to England's 1966 victory can also be spoken of in the same breath as the Za Luzankami. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Internationally, Poland, Turkey and most notably, , visited the ground throughout its existence. A 1961 clash between La Albiceleste and Czechoslovakia was played out at the stadium, with players such as Antonia Roma, Luis Artime, and Rafael Albrecht featuring. Who are these players, you may ask? All three were beaten at Wembley in the 1966 World Cup quarter-finals, as England squeaked by 1-0 to pencil in that meeting with Eusebio's Portugal. It was Geoff Hurst who nodded the winner home, and has to the Sir Bobby Charlton. Illustrious boots have run on Za Luzankami's pitch, and a club legend looked to have revived the ground in 2015. Petr Svancara, long-time captain of Brno, was upset by the idea that he wouldn't be able to play one last time at the club's home, and so started a campaign to clean up the ground. After the ground eventually reopened to host a friendly in front of 35,000, Svancara described its former state as somewhere \"you could have shot a beautiful horror film.\" The community came together to clean it up, but this was short-lasted, as despite hosting a few concerts and various other events, the ground has fallen back into the horror-film-like state that it was post-2015. It is a shame to see a stadium that still boasts the largest ever Czech league crowd of 44,120 to lay desolate. FIFA and Czech FA stadium criteria are mostly to blame, as it is not up to standard, but this ground is ultimately a product of an era left behind.","pubDate":"2023-11-05 10:00:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31335483.ece/ALTERNATES/s98/0_PAY-Abadoned-Stadion-Za-Luzankami-is-a-currently-inactive-stadium-in-Brno-Czech-Republic-Captured-in-s.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"659a92c67352197fccc92fe74c00175c","title":"Fernando Alonso could barely walk after one of F1's worst crashes in Brazil","link":"https://www.dailystar.co.uk/sport/f1/alonso-crash-brazil-grand-prix-31335269","keywords":["Sport"],"creator":null,"video_url":null,"description":"It's not often that you crash, end up in hospital, but still end up on a podium - but a 21-year-old Fernando Alonso did just that for Renault during the 2003 Brazilian Grand Prix at Interlagos","content":"It's never great when an F1 Grand Prix has ten drivers retire, and so it's safe to say that the 2003 Brazilian Grand Prix can be classified as a chaotic one. In front of roughly 120,000 spectators, a soaked Interlagos played host to a series of crashes, and a race that began with eight safety car laps. The aquaplaning that ensued claimed a few notable names, including Jenson Button, whose topsy-turvy relationship with Interlagos saw him later his his , but also be from qualifying. Michael Schumacher also crashed out, resulting in a non-finish that was, at the time, his first in over two years. The only crash to rival Alonso's however was Mark Webber's. With David Coulthard heading into the pits, Webber took it upon himself to gain ground, but ended up losing control on the main straight and wrecking his to the point where it looked like a wheel-less lump. It was one of Webber's wheels that Alonso didn't see. It was Alonso however who really stole the show, smashing into the tire and then into a tire sidewall, leaving him with a bruised left elbow, knee and thigh and being observed in room 1114 of the Saint Louis Hospital in Sao Paolo. He said: \"I am lucky to have got off so lightly. The impact was massive. It all went too quickly. From the third corner onward, I had seen the yellow flags and the sign telling me that the safety car was coming out.\" \"But, at that moment, there were yellow flags all around the circuit. I was careful, but I didn't expect there to be as much debris. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month \"I couldn't avoid a tire in the middle of the track. I remember hurtling towards the wall. The first impact was very hard. Many people have sent me their best wishes.\" With over three-quarters of the race done, the result was declared, with a young Kimi Raikkonen leading the way. The controversy on the track continued off it, however. Giancarlo Fisichella’s Jordan which was in second place on lap 53, had overheated due to it slowly trudging along behind a safety car, and stunningly burst into flames as it returned to the pits. Raikkonen took the winner’s trophy home but five days later it was successfully argued that the Italian was actually ten seconds into his 56th lap when the red flag came out and therefore the result should be based on the standings after 54 laps, when Fisichella was ahead of Raikkonen by 0.9 of a second. Fisichella was eventually rewarded the win after the result reached court, and despite missing out on the ceremony, he got his hands on the trophy two weeks later at the San Marino Grand Prix saying \"I’m glad to have won at last, but I still feel annoyed that I was prevented from celebrating on the podium.\" The 2003 Brazilian Grand Prix was clearly an exciting one, and here's to hoping this weekends race can be just as riveting.","pubDate":"2023-11-05 10:00:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article19461937.ece/ALTERNATES/s98/0_httpscdnimagesdailystarcoukdynamic122photos792000900x738841792","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"}]}