{"newsArray":[{"title":"FIFA World Cup 2022: From Zidane's headbutt to Maradona's Hand of God, 10 controversial moments from past editions","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-from-zidanes-headbutt-to-maradonas-hand-of-god-10-controversial-moments-from-past-editions-11654401.html","keywords":["Sports"],"creator":["FP Trending"],"video_url":null,"description":"FIFA World Cup 2022: From Zidane's headbutt to Maradona's Hand of God, 10 controversial moments from past editions","content":"The FIFA World Cup 2022 is just around the corner. While fans are all set to cheer their teams in the football extravaganza, the rest of the world is also well prepared to enjoy the 90-minute battles among 32 nations. With a population of three million, Qatar, the host of this year, will likely welcome roughly 1.5 million spectators all across the globe for the largest football tournament. The mega event will kick-off with the opening encounter between host Qatar and Ecuador on 20 November at the Al Bayt Stadium in Al Khor.Looking at the history of this action-packed tournament, several infamous scandals have come to light over the years. However, they have failed to restrict the wave of excitement that hits the entire planet once every four years since 1930. Now, ahead of the Qatar World Cup, let’s recall some of those controversies that have rocked the prestigious tournament in the past: World Cup trophy stolen (1966):England hosted the World Cup in 1966. But, ahead of the event, the trophy was stolen from Westminster’s Methodist Central Hall on 20 March 1966. Then came a phone call and a message demanding a £15,000 ransom. The police tracked the suspect and detained Edward Betchley, but they were unable to locate the trophy. On 28 March, David Corbett of Norwood went for a walk with Pickles, his dog. Pickles pointed out a newspaper-wrapped parcel nearby, and Corbett was able to retrieve the prestigious trophy. The 1970 edition saw Brazil win the World Cup. Following their triumphs in 1958 and 1962, they finally acquired possession of the Jules Rimet Trophy permanently. A new trophy was created for succeeding editions.The Football War (1970):Honduras and El Salvador had a contentious relationship for much of the 1960s. But football was indeed the spark that started a war. Ahead of the 1970 World Cup, both nations faced each other in a qualifying match in 1969. When Honduras played El Salvador in Tegucigalpa, local supporters gathered outside the hotel of the visiting footballers played loud music, banged barrels and cans, honked horns and lit off fireworks. Honduras defeated the exhausted visitors 1-0. Following the defeat, an 18-year-old Salvadorian supporter shot herself to death in her house.The Hondurans travelled to San Salvador a week later for the return leg. The Salvadorians filled the hotel rooms of the away footballers with rotten eggs, dead rats, and foul-smelling rags. The Honduran flag was burned before the game began and replaced with a rag. In the game, El Salvador triumphed 3-0. As a consequence, the border between the two countries was shut down soon after the Honduran players left for their country. What followed was a 100-hour war that killed thousands.Hands of God (1986):Argentina’s 2-1 quarterfinal triumph against England in 1986 is one of the most iconic World Cup matches, thanks to Diego Maradona. However, for English fans, it ended up being an unpleasant memory for a different reason. The first goal by Maradona earned the moniker of the ‘Hand of God’ due to his clear use of his hand, rather than his head. But the move went unnoticed by the referee. Three minutes later, he shredded England’s defence by sneaking past five players and goalkeeper Peter Shilton to score his second goal, widely regarded as the “Goal of the Century,” putting the final nail to England’s coffin.Zidane Headbutt (2006):Zinedine Zidane unquestionably made an immense contribution to the development of French football in the 2000s. However, the final of the FIFA World Cup 2006 saw the brutal side of the iconic striker. Despite being instrumental in getting France to the final, Zidane embarrassed himself on the final day when he aggressively headbutted Marco Materazzi, leaving France down a player for the rest of the match. Italy ultimately won the World Cup on penalty shootouts.Suarez bite (2014):Uruguayan striker Louis Suarez is quite infamous for several instances of biting during a football game. But the most notorious one arrived in the 2014 World Cup when Suarez went on to assault Italian defender Giorgio Chiellini in a group-league match. While waiting for an aerial ball, Suarez attacked Chiellini and then collapsed to the ground holding his face. Mexican official Marco Rodriguez refused to call a foul. Following the incident, Uruguay earned a corner through which Diego Godin scored the game’s sole goal.Here are some other notable controversies surrounding FIFA World Cup:In 1994, after testing positive for the prohibited drug ephedrine, Maradona was disqualified from the tournament. His iconic wide-eyed celebration after striking against Greece in the group stages led to questions. After the occurrence, the iconic footballer has never played again for his country.In 1998, Brazilian star Ronaldo was omitted from the team sheet to play France but later showed up just before kickoff. An ankle injury, an unsettled stomach, and poison were some of the rumoured theories behind his sudden disappearance, before he showed up.In 1978, Argentina needed to defeat Peru by four goals to advance into the title game. Despite a strong start, Peru eventually collapsed, allowing the Argentineans to score six goals. There were rumours that the match was rigged.In 2010, a rebellion inside the French squad pitting the players against the supporting staff led the side to finish at the bottom of their Group with just one point.In 2018, after scoring a winning goal against Serbia, Switzerland footballers Granit Xhaka and Xherdan Shaqiri went for a controversial celebration imitating the double-headed eagle present in Albania’s national flag. As a result, both footballers were fined £7,637 each by FIFA.","pubDate":"2022-11-18 13:53:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/FIFA-moments-7.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Belgium vs Egypt Dream11 prediction: Fantasy football tips for BEL vs EGY FIFA World Cup 2022 friendly","link":"https://www.dnaindia.com/sports/report-belgium-vs-egypt-dream11-prediction-fantasy-football-tips-for-belgium-vs-egypt-fifa-world-cup-2022-friendly-3003413","keywords":["Sports"],"creator":["DNA Web Team"],"video_url":null,"description":"BEL vs EGY Dream 11 Team - Check My Dream11 Team, probable playing XI, Best Player's list for Belgium vs Egypt FIFA World Cup 2022 friendly match","content":null,"pubDate":"2022-11-18 13:19:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022: Group C Full Schedule And Squad: All You Need to Know","link":"https://www.news18.com/news/football/fifa-world-cup-2022-group-c-full-schedule-and-squad-all-you-need-to-know-6414073.html","keywords":["sports"],"creator":null,"video_url":null,"description":"The football fiesta will kick off on November 20, as 32 nations collide to emerge as World Champions.","content":null,"pubDate":"2022-11-18 12:58:04","image_url":"https://images.news18.com/ibnlive/uploads/2022/11/collage-maker-18-nov-2022-06.27-pm-16687762463x2.jpg","source_id":"news18","country":["india"],"category":["sports"],"language":"english"},{"title":"'Not containment': Paul Pogba says he really likes £20m Liverpool player","link":"https://www.hitc.com/en-gb/2022/11/18/not-containment-paul-pogba-says-he-really-likes-20m-liverpool-player/?utm_source=rss&utm_medium=rss&utm_campaign=not-containment-paul-pogba-says-he-really-likes-20m-liverpool-player","keywords":["Competitions","Football","Liverpool","Premier League","Teams","paul pogba","Thiago Alcantara"],"creator":["Subhankar Mondal"],"video_url":null,"description":"Paul Pogba has raved about Liverpool midfielder Thiago Alcantara on The Muslim Money Guys podcast. The former Manchester United star has named Liverpool star Thiago among... The post 'Not containment': Paul Pogba says he really likes £20m Liverpool player appeared first on HITC.","content":"Paul Pogba has raved about Liverpool midfielder Thiago Alcantara on The Muslim Money Guys podcast. The former Manchester United star has named Liverpool star Thiago among the midfielders that he likes. The Juventus midfielder has added why he likes the Spanish star so much along with other players such as Toni Kroos. Paul Pogba on Liverpool star Thiago Pogba said, as transcribed by Football Italia: “They are not containment midfielders and they are not number 10s. “They are the box-to-box ones, who make the play, who make assists and who can score – Kroos, Verratti and Thiago Alcantara, but also Pirlo, Scholes and Carrick.” Photo by Mike Hewitt/Getty Images Classy player In our view, Thiago Alcantara is a very classy player who has done well for Liverpool when he has been fit. And that has been the main problem for the former Barcelona star at Liverpool so far. Injuries. Liverpool signed Thiago from Bayern in September 2020 for £20 million (BBC Sport). The 31-year-old has made only 57 appearances in the Premier League so far for the Reds. He has scored two goals and created six big chances. Thiago has made eight appearances in the Premier League for Liverpool so far this season. The Liverpool no. 6 has made three starts and two substitute appearances in the UEFA Champions League for Jurgen Klopp’s side so far this campaign. If Thiago stays fit, then he will be a massive for Liverpool this season, as the Merseyside club aim to finish in the top four of the Premier League table as well as win the UEFA Champions League. The post 'Not containment': Paul Pogba says he really likes £20m Liverpool player appeared first on HITC.","pubDate":"2022-11-18 12:45:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Coup de théâtre: à deux jours du coup d'envoi du Mondial-2022, le Qatar interdit finalement la vente d'alcool autour des stades","link":"https://www.nicematin.com/football/coup-de-theatre-a-deux-jours-du-coup-denvoi-du-mondial-2022-le-qatar-interdit-finalement-la-vente-dalcool-autour-des-stades-808637","keywords":null,"creator":null,"video_url":null,"description":"Les autorités du Qatar et la Fifa sont revenues sur leur décision de vendre de la bière aux supporters autour des stades du Mondial-2022, a annoncé l'instance dirigeante du football dans un communiqué vendredi, à deux jours du coup d'envoi.","content":null,"pubDate":"2022-11-18 12:33:00","image_url":"https://fyooyzbm.filerobot.com/v7/qatar+2022.jpg?vh=061ec4&ci_seal=2e68f5c912&p=medium&v2&gravity=auto","source_id":"nicematin","country":["france"],"category":["sports"],"language":"french"},{"title":"‘Contract offered’: Journalist says Spurs trying to keep youngster, but three clubs want him","link":"https://www.hitc.com/en-gb/2022/11/18/contract-offered-journalist-says-spurs-trying-to-keep-youngster-but-three-clubs-want-him/?utm_source=rss&utm_medium=rss&utm_campaign=contract-offered-journalist-says-spurs-trying-to-keep-youngster-but-three-clubs-want-him","keywords":["Competitions","Football","Premier League","Teams","Tottenham Hotspur"],"creator":["Charles Jones"],"video_url":null,"description":"Speaking on his YouTube channel, Alasdair Gold has been discussing the pathway for academy players to break into the Spurs first team and Nile John.... The post ‘Contract offered’: Journalist says Spurs trying to keep youngster, but three clubs want him appeared first on HITC.","content":"Speaking on his YouTube channel, Alasdair Gold has been discussing the pathway for academy players to break into the Spurs first team and Nile John. Tottenham Hotspur have some of the best facilities in the world when it comes to training and developing players, but for some reason, they’re not producing elite talents at the same rate as some of their closest rivals. Chelsea and Arsenal have been making great use of their academies in recent years, while even the likes of Fulham and West Ham are outshining Spurs when it comes to bringing young players through over the past five or six years. The key problem is that Spurs aren’t handing out chances, and that’s led to them losing some brilliant prospects such as Marcus Edwards and Noni Madueke, and there could soon be another player to add to that list. Indeed, according to Gold, Nile John is wanted by Brighton, Basel and Cercle Brugge, but Spurs are keen to keep hold of the 19-year-old, offering him a new contract. Photo by Marc Atkins/Getty Images John’s future The reporter discussed the teenager’s future. “With Spurs, maybe the managers will say it’s down to the quality coming through, but that hasn’t always been the case. Look at someone like Marcus Edwards, Noni Madueke who is at PSV. Nile John is another one, he has interest from Brighton and a couple of clubs in Europe as well with Basel and Cercle Brugge. His contract is coming to an end, but it’s whether he accepts a new contract or not. I think there has been a contract offered, but he might not because does he get through?” Gold said. Best off leaving As much as staying and earning a spot in the Spurs team is alluring, John may be best off leaving the club at this point. As John enters his 20s, he needs to be playing regular football, and he’s not likely to get that chance at Spurs anytime soon as they look to focus on the here-and-now as they chase a top four spot. Meanwhile, Brighton have been more than happy to bed-in young talents in recent years such as Moises Caicedo and Tariq Lamptey, so perhaps a move to the south coast could be his best bet right now. The post ‘Contract offered’: Journalist says Spurs trying to keep youngster, but three clubs want him appeared first on HITC.","pubDate":"2022-11-18 12:30:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Manchester United ‘to sue Cristiano Ronaldo’","link":"https://www.couriermail.com.au/sport/football/premier-league/teams/manchester-united/manchester-united-to-sue-cristiano-ronaldo-after-he-accused-club-of-betraying-him/news-story/950e4619649ccd0a9366ec7906172252","keywords":["EPL","Football","Manchester United","Sport news and galleries"],"creator":null,"video_url":null,"description":"Manchester United are preparing to take legal action against Cristiano Ronaldo over his bombshell interview with Piers Morgan.","content":"Ronaldo has torn the club to shreds in a two night one-on-one world exclusive that has rocked football.SunSport revealed exclusively this week that the club wanted to rip up his contract.A club statement has now not only seemed to confirm that but left the door open to further action against the player.The statement read: “Manchester United has this morning initiated appropriate steps in response to Cristiano Ronaldo’s recent media interview.“We will not be making further comment until this process reaches its conclusion.”It follows a lengthier statement issued earlier this week in which the club acknowledged the tell-all interview.Ronaldo slammed the club and revealed he does not respect manager Erik ten Hag in the 90-minute sit-down on TalkTV.United chiefs, including Ten Hag, met on Monday to discuss how to respond to Ronaldo’s outburst.In the first half of the interview which aired on Wednesday Ronaldo described his shock at the club’s stagnation since Sir Alex Ferguson’s departure in 2013.He also spoke of his surprise at the club appointing Ralf Rangnick on an interim basis - revealing he had never even heard of the German.Ronaldo went on to criticise the Glazers and accused the American owners of not caring about the club.He said: “The Glazers, they don’t — they don’t care about, about the club. I mean, professional sport.“As you know this, Manchester is a marketing club. They will get its money from the marketing, the sport, it’s … they don’t really care, in my opinion.”Asked: “Do you ever talk to them, the Glazers?”, Ronaldo replied “Never. No. They give all the power to the president, sporting director.”This story was originally published by The Sun and was reproduced with permission","pubDate":"2022-11-18 12:19:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Qui remportera le Mondial-2022? Des figures du foot donnent leurs favoris","link":"https://www.h24info.ma/sport/qui-remportera-le-mondial-2022-des-figures-du-foot-donnent-leurs-favoris/","keywords":["Sport","Argentine","Brésil","france","Les pronostics","Mondial 2022"],"creator":["H24Info.ma avec AFP"],"video_url":null,"description":"Qui remportera le Mondial-2022 au Qatar ? De Erling Haaland à Lionel Messi, de Robert Lewandowski à Gianluigi Buffon, quelques grands noms du football ont livré leur pronostic, avec le Brésil, l’Argentine et la France comme principaux prétendants. « A chaque fois qu’on parle des candidats (au titre), on parle des mêmes équipes. Si je dois [...]","content":null,"pubDate":"2022-11-18 12:15:06","image_url":null,"source_id":"h24info","country":["morocco"],"category":["sports"],"language":"french"},{"title":"Mondial: pas d’alcool pour les supporters autour des stades","link":"https://www.h24info.ma/sport/mondial-pas-dalcool-pour-les-supporters-autour-des-stades/","keywords":["Sport","alcool","FIFA","Mondial 2022","Qatar","stades","Supporters"],"creator":["H24Info.ma avec AFP"],"video_url":null,"description":"Les autorités du Qatar et la Fifa sont revenues sur la décision de vendre de la bière aux supporters autour des stades du Mondial-2022, a annoncé l’instance dirigeante du football dans un communiqué vendredi, à deux jours du coup d’envoi. « A la suite de discussions entre les autorités du pays hôte et la Fifa », il [...]","content":null,"pubDate":"2022-11-18 12:03:27","image_url":null,"source_id":"h24info","country":["morocco"],"category":["sports"],"language":"french"},{"title":"‘Outstanding’: Martin Keown reacts to what Arsenal have announced today","link":"https://www.hitc.com/en-gb/2022/11/18/outstanding-martin-keown-reacts-to-what-arsenal-have-announced-today/?utm_source=rss&utm_medium=rss&utm_campaign=outstanding-martin-keown-reacts-to-what-arsenal-have-announced-today","keywords":["Arsenal","Competitions","Football","Premier League","Teams","arsenal","edu"],"creator":["Subhankar Mondal"],"video_url":null,"description":"Martin Keown has praised Arsenal on talkSPORT (10:54am, November 18, 2022) for promoting Gunners official Edu. Arsenal have announced on their official website today that... The post ‘Outstanding’: Martin Keown reacts to what Arsenal have announced today appeared first on HITC.","content":"Martin Keown has praised Arsenal on talkSPORT (10:54am, November 18, 2022) for promoting Gunners official Edu. Arsenal have announced on their official website today that they have appointed Edu as their first-ever Sporting Director. The former Brazil international was working as the Technical Director. Edu had been in that role since the summer of 2019 when he left the Brazilian FA. And now the former Arsenal star has been promoted to Sporting Director at the Gunners. Edu will now assume ‘over-arching responsibility’ for all of Arsenal’s Academy activities, in addition to his existing responsibilities across men’s and women’s football. Martin Keown on Arsenal promoting Edu Keown said: “Outstanding. He thoroughly deserves that role.” Photo by Stuart MacFarlane/Arsenal FC via Getty Images Deserved promotion In our view, Edu deserves the promotion at Arsenal that he has now got. The Brazilian did a really wonderful job as the Technical Director. Yes, things did not go smoothly in the beginning of his time at the Emirates Stadium, as Arsenal made one or two disappointing signings, but it was a process. It has always been a process. Arsenal are now a club on the up who have recruited good players in recent windows, such as Gabriel Jesus, and are at the top of the Premier League table at the moment. And Edu deserves a lot of credit for that. The post ‘Outstanding’: Martin Keown reacts to what Arsenal have announced today appeared first on HITC.","pubDate":"2022-11-18 12:01:33","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022: Beer sales banned in all eight stadiums in Qatar","link":"https://zeenews.india.com/football/fifa-world-cup-2022-beer-sales-banned-in-all-eight-stadiums-in-qatar-2537179.html","keywords":null,"creator":null,"video_url":null,"description":"In September, the organisers did agree to serve beer to football fans at stadiums and fan zones","content":null,"pubDate":"2022-11-18 12:01:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Messi, £17m Aston Villa star and £42.5m Tottenham ace in best Argentina XI from World Cup squad","link":"https://www.hitc.com/en-gb/2022/11/18/lionel-messi-lisandro-martinez-in-best-argentina-xi-from-world-cup-squad/?utm_source=rss&utm_medium=rss&utm_campaign=lionel-messi-lisandro-martinez-in-best-argentina-xi-from-world-cup-squad","keywords":["Argentina Football Team","Aston Villa","Competitions","FIFA World Cup","Football","Manchester City","Manchester United","Premier League","Teams","Tottenham Hotspur","lionel messi"],"creator":["Kyle Archer"],"video_url":null,"description":"Argentina begin their World Cup with Saudi Arabia on November 22. So, HITC Football has looked at who joins Lionel Messi in their best XI... The post Messi, £17m Aston Villa star and £42.5m Tottenham ace in best Argentina XI from World Cup squad appeared first on HITC.","content":"Argentina begin their World Cup with Saudi Arabia on November 22. So, HITC Football has looked at who joins Lionel Messi in their best XI from Lionel Scaloni’s squad at Qatar 2022. La Albiceleste head for the first of FIFA’s quadrennial tournaments to be held in the Middle East to compete in Group C. Scaloni’s side will meet Saudi Arabia in Lusail first of all before matches with Mexico on the 26th in Lusail and Poland on the 30th at Stadium 974 in Doha. Argentina have not won a World Cup title since the South Americans lifted their second to date in 1986. They won their maiden crown on home soil in 1978, while Qatar 2022 marks an 18th appearance across 22 editions. La Albiceleste have not failed to qualify since 1970. Photo by Ulrik Pedersen/NurPhoto via Getty Images Argentina boss Scaloni named Messi in his fifth World Cup squad with Qatar 2022 Messi has played at four World Cups ahead of Qatar 2022 after games in 2006, 2010, 2014 and 2018. He also captained Argentina to the final at Brazil 2014 after carrying his country out of Group F with four goals. It was the 165-cap icon’s most prolific tournament to date. WORLD CUP: A LOOK AT THE FULL TOURNAMENT RECORD OF ARGENTIA ICON MESSI Scaloni has now named the Rosario native in his fifth World Cup squad as Argentina target glory at Qatar 2022. But injuries forced the Albiceleste boss to make changes with Nicolas Gonzalez (femoral biceps) and Joaquin Correa (Achilles tendon) since forced to withdraw. Photo by Rich Graessle/Icon Sportswire via Getty Images Scaloni tweaks his 26-man World Cup squad as Argentina suffer two injuries The Argentine Football Association (AFA) has shared that Angel Correa replaced Gonzalez and called up Thiago Almada to replace Correa. They join the other 24 players that Scaloni originally announced were in his 26-man Argentina squad for the 2022 World Cup in Qatar. Goalkeepers: Franco Armani (River Plate), Emiliano Martinez (Aston Villa), Geronimo Rulli (Villarreal) Defenders: Lisandro Martinez (Manchester United), Cristian Romero (Tottenham Hotspur), Gonzalo Montiel, Marcos Acuna (Sevilla), German Pezzella (Real Betis), Nicolas Otamendi (Benfica), Nahuel Molina (Atletico Madrid), Juan Foyth (Villarreal), Nicolas Tagliafico (Lyon) Midfielders: Alexis Mac Allister (Brighton & Hove Albion), Alejandro Gomez (Sevilla), Enzo Fernandez (Benfica), Leandro Paredes (Juventus), Guido Rodriquez (Real Betis), Rodrigo De Paul (Atletico Madrid), Exequiel Palacios (Bayer Leverkusen) Forwards: Lionel Messi (Paris Saint-Germain), Paulo Dybala (Roma), Angel Correa (Atletico Madrid), Lautaro Martinez (Inter Milan), Thiago Almada (Atlanta United), Angel Di Maria (Juventus), Julian Alvarez (Manchester City) WORLD CUP: RECALLING ARGENTINA MANAGER SCALONI’S CAREER AT WEST HAM So, with the 2022 World Cup in Qatar about to start, HITC Football has taken a look at who can join Messi in Scaloni’s best possible XI from La Albiceleste’s tweaked 26-man squad… Emiliano Martinez (GK): The Aston Villa star is a mainstay of Argentina’s squad Aston Villa shot-stopper Emiliano Martinez is a mainstay of the Argentina squad before the 2022 World Cup in Qatar. The £17m star has been Scaloni’s number one since his debut in June 2021 for 19 caps. He has also kept 14 clean sheets for his country in all competitions. Nahuel Molina (RB): Scaloni trusts Atletico Madrid’s summer signing from Udinese Scaloni trusts Molina to serve as Argentina’s first-choice option at right-back. He has given the 24-year-old 20 caps since his debut in June 2021. Now, the Embalse native should add World Cup games to his record after joining Atletico Madrid from Udinese in the summer. Cristian Romero (CB): The Tottenham star helped Scaloni win the 2021 Copa America Romero helped Argentina win the Copa America in 2021 just weeks after Scaloni afforded the Tottenham star his Albiceleste debut. The £42.5m defender earned the first of his 12 caps to date in June 2021. One month later, and he started their 1-0 final win over Brazil. Photo by Martin Dokoupil/Getty Images Lisandro Martinez (CB): Scaloni is starting the trust the Manchester United star Scaloni has started to trust Martinez with a greater role in the Argentina squad in view of the World Cup. The £57m Manchester United star made his debut under the Albiceleste boss in March 2019. Yet he has only earned 10 caps to date while six have also come during 2022. Nicolas Tagliafico (LB): The Lyon star will want to avenge their Russia 2018 run Tagliafico is one member of the Argentina squad returning to the World Cup stage in 2022. He started all four of their fixtures at Russia 2018 but could not help coach Jorge Sampaoli avoid a last 16 defeat to France. The 42-cap left-back will now want to avenge their result. Angel Di Maria (RM): Scaloni will hope the fourth time’s the charm in Qatar Argentina boss Scaloni will hope the fourth time’s the charm for Di Maria after naming the 34-year-old in his World Cup squad for Qatar 2022. The 124-cap star featured at the 2010, 2014 and 2018 editions. But Di Maria has only struck two goals and no assists in 13 games. WORLD CUP: A LOOK AT THE TOURNAMENT RECORD OF ARGENTINA ICON MARADONA Leandro Paredes (CM): The Juventus star will anchor Argentina’s plans in Qatar Paredes will likely anchor Argentina’s midfield in Qatar over the Juventus star’s first World Cup. Sampaoli gave the 46-cap ace his debut in 2017 but Paredes struggled to establish his role before Russia 2018. Yet he has been a mainstay of their side since the FIFA event. Rodrigo De Paul (CM): The Atletico Madrid ace is integral to Scaloni’s plans De Paul is an integral player in Scaloni’s plans having amassed 44 caps from 45 games over the 44-year-old’s 50 games in charge. The Atletico Madrid ace made his Argentina debut in October 2018 and has started 39 of his appearances so far for two goals and eight assists. Alejandro Gomez (LM): A first and final World Cup awaits the Sevilla star A first, and likely final, World Cup awaits Gomez in Qatar after making Argentina’s squad at 34 years old. The Sevilla star missed out on a spot for Russia 2018 after making his debut in June 2017. But it was not until June 2021 that the 15-cap winger became a regular option. Photo by RYAN LIM/AFP via Getty Images Lionel Messi (ST): The Argentina icon has confirmed Qatar 2022 is his last World Cup Messi goes into Qatar 2022 knowing he is targeting a World Cup title in his last appearance for Argentina. The Albiceleste icon told Star+, via quotes by TN, in October: “My last World Cup? Yes, surely yes.” He finally lifted an international title in 2021 with the Copa America. WORLD CUP: BEST ARGENTINA XI OF MESSI’S TEAMMATES WITH HIGUAIN AND AGUERO Julian Alvarez (ST): The Manchester City man is making a good partner for Messi Alvarez is making a good partner for Messi with Scaloni shaping his Argentina XI in a 4-4-2. The Manchester City striker has scored three goals over his 12 caps and has started four of his last six. He also heads for Qatar after seven goals in 20 games for the Citizens this term. The post Messi, £17m Aston Villa star and £42.5m Tottenham ace in best Argentina XI from World Cup squad appeared first on HITC.","pubDate":"2022-11-18 12:00:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"‘Conte will not accept that’: Journalist says 23-year-old Spurs target may not be a Conte player","link":"https://www.hitc.com/en-gb/2022/11/18/conte-will-not-accept-that-journalist-says-23-year-old-spurs-target-may-not-be-a-conte-player/?utm_source=rss&utm_medium=rss&utm_campaign=conte-will-not-accept-that-journalist-says-23-year-old-spurs-target-may-not-be-a-conte-player","keywords":["Competitions","Football","Premier League","Teams","Tottenham Hotspur","marcus edwards"],"creator":["Charles Jones"],"video_url":null,"description":"Speaking on his YouTube channel, Alasdair Gold has addressed rumours linking Tottenham Hotspur with a move for Marcus Edwards. Edwards, of course, was a part... The post ‘Conte will not accept that’: Journalist says 23-year-old Spurs target may not be a Conte player appeared first on HITC.","content":"Speaking on his YouTube channel, Alasdair Gold has addressed rumours linking Tottenham Hotspur with a move for Marcus Edwards. Edwards, of course, was a part of the Spurs academy for a long time during his youth, but he left Tottenham to go and play in Portugal as he felt he would get more chances over on the continent. Edwards has since been proven right, establishing himself as a star for Sporting, playing regular Champions League football over in Portugal. Inevitably, Edwards’ good form has led to rumours about a Spurs return, but Gold is led to believe that there isn’t much to these reports, claiming that Edwards doesn’t really strike his as an Antonio Conte player. Photo by Joao Rico/DeFodi Images via Getty Images Not a Conte player Gold spoke about Edwards potentially returning to Spurs. “At this point in time I would be surprised. It would make some sense because of homegrown numbers and he’d be cheaper because Spurs have a sell-on clause with him. He would be cheaper than his value would normally be, but I don’t know if he’s a Conte player,” Gold said. “Listening to his manager at Sporting speaking about what he’s like and that he has to give his all in training, he’s improved hugely and is more professional, but even his manager, Ruben Amorim, is saying he needs to treat training like they’re matches, and if you can’t do that at Sporting, Conte will not accept that. I don’t know if that feels like the right move.” “I wouldn’t rule it out, but it feels unlikely compared to other potential deals out there.” Could still happen Gold says that one stumbling block on this deal is that Edwards isn’t necessarily a player that would suit Antonio Conte’s regime, but that hasn’t stopped Spurs before. Indeed, Djed Spence was famously signed this summer and Conte immediately stated that he was a signing from the club rather than a signing that he personally pursued, so perhaps Spurs will do the same with Edwards here. Would it be wise to make a signing that doesn’t suit your manager? No, but do Spurs always make the right decisions in the transfer market? That’s a rhetorical question that is quite easy to answer. The post ‘Conte will not accept that’: Journalist says 23-year-old Spurs target may not be a Conte player appeared first on HITC.","pubDate":"2022-11-18 12:00:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"\"Big news\": Sky reporter shares World Cup update on £110,000-a-week Newcastle target","link":"https://www.hitc.com/en-gb/2022/11/18/big-news-sky-reporter-shares-world-cup-update-on-110000-a-week-newcastle-target/?utm_source=rss&utm_medium=rss&utm_campaign=big-news-sky-reporter-shares-world-cup-update-on-110000-a-week-newcastle-target","keywords":["Competitions","Football","Newcastle United","Premier League","Teams","james maddison"],"creator":["Billy Meyers"],"video_url":null,"description":"Newcastle target James Maddison has been the focal point of England’s World Cup warmup sessions as he struggles with an injury. The £110,000-a-week man limped... The post \"Big news\": Sky reporter shares World Cup update on £110,000-a-week Newcastle target appeared first on HITC.","content":"Newcastle target James Maddison has been the focal point of England’s World Cup warmup sessions as he struggles with an injury. The £110,000-a-week man limped off in Leicester’s final Premier League game ahead of the tournament, a 2-0 win over West Ham, and is still suffering despite Brendan Rodgers claiming it was simply precautionary to withdraw him. We are now two days into England training in Qatar, and Maddison’s issue is yet to settle. Newcastle target likely to miss England vs Iran Well, Sky Sports were reporting live from Al-Wakra when they shared an update on Maddison, who Ben Jacobs of CBS Sports claimed is wanted by Newcastle. Sky reporters claimed that some “big news” has happened after the Newcastle target was seen leaving yet another session early, as the Leicester No.10 walked out of training while his teammates began some ball work. James Maddison is missing from England training again today pic.twitter.com/7gTwdNVpCu— Football Daily (@footballdaily) November 18, 2022 It means Maddison has now missed two sessions since landing in Qatar, and there are only four sessions in total until Monday’s opening game against Iran. Sky Sports add that this is “hugely significant” for Maddison’s chances of making the starting lineup. Given how hard he worked to impress Gareth Southgate and make the 26-man squad, this will surely be a very frustrating time for the Coventry-born playmaker. Newcastle could benefit from Maddison absence It sounds cruel to say, but selfishly for Eddie Howe, it would make his life easier if Maddison did miss the World Cup. Leicester have already placed a £60m price tag on their talisman’s head – according to 90min – and if he goes on to impress in Qatar, that sum could easily increase to £70m or beyond. Photo by Michael Regan – FIFA/FIFA via Getty Images Maddison is more than capable of becoming a major star of the World Cup with his immense talent, and it would be a genuine shame if he is unable to take part in the tournament. Hopefully, he can shake off his injury as soon as possible, but if he fails to do so, there are definitely positives to that for Newcastle and Howe, as far as a transfer is concerned. The post \"Big news\": Sky reporter shares World Cup update on £110,000-a-week Newcastle target appeared first on HITC.","pubDate":"2022-11-18 12:00:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Six star players to watch at the World Cup","link":"https://www.malaymail.com/news/sports/2022/11/18/six-star-players-to-watch-at-the-world-cup/40518","keywords":["world cup","football","star players"],"creator":null,"video_url":null,"description":"DOHA, Nov 18 — The 2022 World Cup gets underway on Sunday in Qatar, with France hoping to become the first team to succe...","content":"DOHA, Nov 18 — The 2022 World Cup gets underway on Sunday in Qatar, with France hoping to become the first team to successfully defend the title since Brazil 60 years ago. AFP Sport takes a look at six of the world’s best players who will be competing in the tournament: Lionel Messi (ARG) Arguably the greatest player of all time, Messi has yet to emulate past legends Pele and Diego Maradona by winning football’s biggest prize. He did finally win a major international tournament with Argentina when he was the driving force behind their Copa America triumph last year. The 35-year-old has said this will “very likely” be his last World Cup and will be desperate to go one better than 2014, when Argentina lost the final to Germany in extra time. Lionel Scaloni’s side have high hopes of winning a third world title, heading into the tournament on a 36-match unbeaten run. Messi scored his 91st international goal in a 5-0 friendly win over the United Arab Emirates on Wednesday. Cristiano Ronaldo (POR) Messi’s long-time rival for the status of world’s best player, Ronaldo will also surely be appearing at a World Cup for the final time, aged 37. International football’s all-time record scorer recently netted the 700th club goal of his career. Ronaldo won an emotional title at Euro 2016 with Portugal but their best effort with him on a global stage remains a semi-final exit in 2006. He will be expecting to score in a record-breaking fifth straight World Cup, surpassing Pele, Miroslav Klose and Uwe Seeler. Ronaldo will have to put a difficult start to the season with Manchester United behind him, having struggled for form before accusing the club of “betraying” him. Kylian Mbappe (FRA) His France teammate Karim Benzema is the current Ballon d’Or holder but the world champions’ most important player remains Mbappe, more than four years since he starred at the 2018 World Cup. The Paris Saint-Germain forward became the first teenager to score in a World Cup final since Pele with his strike in France’s 4-2 victory over Croatia. Mbappe, now 23, has denied reports he is attempting to leave PSG mid-season just months after signing a lucrative new contract. After winning the best young player trophy in Russia, he will have his eyes set on the senior prize this time around. Neymar (Brazil) Brazil head into the tournament as favourites to win a record-extending sixth World Cup. The strong form of Neymar this season for PSG will be a big plus point for coach Tite after a difficult spell for the 30-year-old. Neymar heads to Qatar just two goals short of equalling Pele’s all-time Brazil scoring record, albeit having already played 29 more matches. The Selecao were beaten by Belgium in the quarter-finals four years ago, leaving Neymar still waiting to make up for 2014, when he missed the humiliating 7-1 semi-final thrashing by Germany on home soil through injury. Edouard Mendy (Senegal) The Chelsea goalkeeper lost his place as first-choice goalkeeper under Graham Potter this season after a string of costly errors but will be crucial to Senegal’s hopes of becoming the first African World Cup semi-finalists. Mendy, a Champions League winner in 2021, saved a penalty as Senegal beat Egypt in a shootout in the Africa Cup of Nations final earlier this year. The 30-year-old did start Chelsea’s last two Premier League games before this tournament after an injury to Kepa Arrizabalaga. Shorn of star forward Sadio Mane due to injury, Senegal will be desperate for Mendy to rediscover the form that saw him named Fifa’s 2021 goalkeeper of the year at the other end of the pitch. Son Heung-min (South Korea) The Tottenham forward is undoubtedly Asian football’s biggest star and he will be carrying South Korea’s hopes in a tight-looking Group H if he can recover from a fractured eye socket. Son shared the Premier League Golden Boot last season with Liverpool’s Salah, despite not taking penalties for Spurs. He has netted 35 times in 104 internationals, including the second goal of the Koreans’ stunning 2018 win over Germany which dumped the reigning champions out in the group stage. — AFP","pubDate":"2022-11-18 11:24:09","image_url":null,"source_id":"malaymail","country":["singapore","malaysia"],"category":["sports"],"language":"english"},{"title":"Cristiano Ronaldo confirms transfer offers as Man Utd star reveals plans to play until he is FORTY","link":"https://www.thescottishsun.co.uk/sport/football/9783737/cristiano-ronaldo-transfer-man-utd-3/","keywords":["Football","Manchester United transfer news","Premier League"],"creator":["Kealan Hughes"],"video_url":null,"description":null,"content":"CRISTIANO RONALDO has revealed he turned down several offers to leave Manchester United. The striker claimed he feels \"comfortable\" at Old Trafford and intends to continue playing until he is 40. 1 Cristiano Ronaldo wants to continue playing until he is 40 Credit: Getty There was plenty of speculation Ronaldo could leave Old Trafford in the summer but a move failed to materialise despite interest from Chelsea, Atletico Madrid and Marseille. Chelsea and Napoli reportedly rejected the chance to sign Ronaldo but the striker claims he also turned down a few clubs. In his blockbuster TalkTV interview with SunSport columnist Piers Morgan Ronaldo said: \"I have many clubs, not many, a few clubs that they want me to sign and I didn't go because I feel comfortable here. This is the truth.\" Saudi Arabian club Ali Hilal offered Ronaldo a lucrative deal which he revealed was very difficult to turn down . READ MORE ON MAN UTD CRISTIANO LIVE Latest on Man Utd star's HUGE talk with Piers Morgan with part 2 OUT NOW The Portuguese could have reportedly earned £3million-a-week in the Middle East but he said no to the offer because he feels he can still perform at the highest level. Speaking about rejecting the move, Ronaldo said: \"It's hard. It's hard. But in the same way, I thought that I was very happy here; that I [am] still capable to score goals and make people happy. \"I still believe that I can score many many goals and help the team because I still believe that I'm still good and capable to help national team - even Manchester United. \"I want to see if some guy of my age maintain the level that I show. You’re not gonna teach me that. Nobody is gonna teach me that.\" Most read in Football record breaker Rangers captain dumped music collection because bands backed Celtic double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH off the field Celtic flop Vasilis Barkas lands bizarre red card for Greece WITHOUT playing top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan PLAY OUR DREAM TEAM WORLD CUP FANTASY FOOTBALL GAME TO WIN A SHARE OF £50k He added: \"I want to play two years more, three years more. So two or three years maximum. I want to finish [at] 40. I think 40 will be a good age. \"But I don't know, I don't know the future. Sometimes you plan one thing for your life and as I told many times, life is dynamic. You never know what's going to happen.\" United have taken action in response to Ronaldo's tell-all interview. A short club statement read: \"Manchester United has this morning initiated appropriate steps in response to Cristiano Ronaldo’s recent media interview. \"We will not be making further comment until this process reaches its conclusion.\" Ronaldo's contract at United expires at the end of the season but it is possible he will leave in January amid interest from Bayern Munich and Newcastle .","pubDate":"2022-11-18 10:54:18","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Man Utd star Cristiano Ronaldo’s stunning Wag Georgina Rodriguez oozes style and flashes legs in criss-cross jeans","link":"https://www.thescottishsun.co.uk/sport/football/9783708/man-utd-cristiano-ronaldo-stunning-georgina-rodriguez/","keywords":["Football","Sport","Instagram","Manchester United transfer news","Premier League"],"creator":["Henry Tomlinson"],"video_url":null,"description":null,"content":"GEORGINA RODRIGUEZ looked stunning as she posed for a picture wearing revealing criss-cross jeans. Cristiano Ronaldo's girlfriend uploaded the picture of her in the barely-there trousers to Instagram and they received a lot of attention with the post getting almost two million likes. View this post on Instagram A post shared by Georgina Rodríguez (@georginagio) 4 Georgina Rodriguez recently attended the Latin Recording Academy's 2022 Person of the Year Gala Credit: Getty 4 She wowed as she wore a light blue dress Credit: Getty Images - Getty The Portuguese ace's model partner has 39.2m followers on the social media site, with plenty of them commenting with fire emojis. She is expected to be seen in Qatar during the World Cup cheering on Ronaldo, in what could be his last international tournament. The Manchester United striker is currently in hot water after his explosive interview with SunSport columnist Piers Morgan , in which he slammed the club for not evolving since he first left. In the interview, the 37-year-old also spoke of his respect for long-term rival Lionel Messi. READ MORE ON WAGS GEORG-IOUS Georgina Rodriguez puts on busty display at plush gala after Ronaldo interview He said: \"Amazing player is magic, top. \"[Excluding Ronaldo] him and Zidane are probably the best players I've ever seen. \"As a person, we share the stage 16 years, imagine, 16 years. We share. So, I have great relationship with him. \"I'm not friend of him in terms of, what I mean friend is the guy who was with you in your house, speaking on the phone, no, but it's like a teammate. Most read in Football record breaker Rangers captain dumped music collection because bands backed Celtic double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH off the field Celtic flop Vasilis Barkas lands bizarre red card for Greece WITHOUT playing top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan PLAY OUR DREAM TEAM WORLD CUP FANTASY FOOTBALL GAME TO WIN A SHARE OF £50k \"He’s a guy that I really respect the way he always speak about me. Even his wife or my wife, my girlfriend, they always respect and they're from Argentina. \"My girlfriend is from Argentina. So good. What I am going to say about Messi? A great guy who does great things for football.” While Ronaldo's interview was airing in the UK, Georgina stunned at the Latin Recording Academy’s 2022 Person of the Year Gala in the US. The 28-year-old model looked sparkling as she showed off her figure in a light blue gown, putting the controversy surrounding Ronaldo to one side. 4 On the second day she wore a brown dress Credit: AFP 4 The dress had a high slit showing off her leg Credit: Getty","pubDate":"2022-11-18 10:50:29","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Celtic strike target Robin Hack leaves door open for January transfer to Parkhead","link":"https://www.thescottishsun.co.uk/sport/football/9783519/celtic-target-robin-hack-january-transfer/","keywords":["Football","Scottish Premiership","Sport","Celtic","Premier League","Transfer News"],"creator":["Stewart Fisher"],"video_url":null,"description":null,"content":"CELTIC target Robin Hack has opened the door for a January move to Parkhead after admitting he would be willing to listen to offers for him. The Arminia Bielefeld striker was linked with a transfer to the Hoops in the summer, with Swiss side FC Basel also reportedly interested in the 24-year-old. 2 Robin Hack of Bielefeld celebrates 2 Robin Hack of Bielefeld scores his teams third goal against Magdeburg Hack opted to stay in Germany and has been a huge success at the Bundesliga II club this season scoring nine goals in 19 games and contributing with six assists too. He previously played for Nurnberg and Hoffenheim. That's led to further speculation in his homeland that the former Germany Under 21s forward will be leaving the club, although he still has two-and-a-half years left of his contract. Hack said: \"Basically, I'm feeling extremely good at the moment and I am enjoying playing with my club. Read More In Football off the field Celtic flop Vasilis Barkas lands bizarre red card for Greece WITHOUT playing BET BONUS Celtic vs Everton free bets: Get £30 bonus to use on Super Cup this week \"Honestly, I don't want to leave yet, there's no reason for that at all. \"But if there was an option that would suit all sides, I would think about it. Most read in Football double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan ANGE-R MANAGEMENT Celtic boss Postecoglou slams TV & screams at stars in foul-mouthed rant FOOTIE TRAGEDY Tributes as ex-Austrian international, 57, dies after being hit by train \"Nevertheless: It's been fun in Bielefeld lately. \"Everyone wants to get the most out of their career and of course I want that too. Read More on The Sun NOT SO SWEET I found a lost cheque worth £4MILLION - but the reward I got left me stunned BLAZE TERROR Shocking moment family car torched by thugs in Scots town \"I want to play in a top league. That can either happen at Arminia Bielefeld or another club. \"In the summer, there were one or two opportunities abroad, so we will see what happens in January.\" Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-11-18 10:49:04","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Anthony Joshua could fight Deontay Wilder for WBC title if belts become vacant after Tyson Fury’s unification with Usyk","link":"https://www.thescottishsun.co.uk/sport/9783683/anthony-joshua-fight-deontay-wilder-tyson-fury-usyk/","keywords":["Boxing","Sport","HEAYWEIGHT BOXING"],"creator":["Jack Figg"],"video_url":null,"description":null,"content":"EDDIE HEARN warned Anthony Joshua could fight Deontay Wilder for the WBC title if the belts become vacant. Champions Tyson Fury and Oleksandr Usyk are lined up for a historic first ever four-belt heavyweight unification next year. GettyEddie Hearn warned Anthony Joshua could fight Deontay Wilder[/caption] Deontay Wilder has been ordered into a WBC final eliminatorGetty But the winner could then be faced with up to FOUR mandatory challengers, making it difficult to hang onto all of the marbles. Wilder, 37, has been ordered into a WBC final eliminator with Andy Ruiz Jr, 33, meaning the winner is guaranteed a shot at Fury’s title. So Joshua’s promoter Hearn is ready to get his man into position to then face the winner of the all-American showdown. And by that time, the title could already be up for grabs if Fury, 34, or Usyk, 35, fail to keep up with their mandatories. READ MORE IN boxing PULL RANK Joshua rises one place in heavyweight rankings despite losing to Usyk again Hearn told Matchroom Boxing: “I think belts are going to become vacant over the next six-12 months. They always are when there’s an undisputed champion. “So now it’s about positioning yourself, Dillian Whyte, AJ of course, into a shot at the world heavyweight title. “AJ could be fighting the winner of Wilder – Ruiz for the WBC world heavyweight title, could be fighting Filip Hrgovic. “Dillian Whyte could be fighting Joe Joyce for the WBO world title. There’s all kinds of eventualities. Most read in Boxing HOSPITAL DASH 7ft boxer Nikolai Valuev rushed to hospital after being drafted by Putin 'BACK IN NO TIME' Logan Paul already back in training despite suffering horror knee injury PAUL FOR IT Tommy Fury's dad wants Jake Paul fight on Tyson's 62,000-seat card NEXT MONTH WILD POTENTIAL Wilder's coach reveals only fighter who can 'test' heavyweight star ONE TO WATCH Fury reveals the 'future of heavyweight division' who helped him KO Wilder AP-PAULING Tommy Fury's promoter slams 'silly and ridiculous' Dubai antics with Jake Paul PLAY OUR DREAM TEAM WORLD CUP FANTASY FOOTBALL GAME TO WIN A SHARE OF £50k “But the pressure will come from the mandatories, that’s just natural when there’s a unified and in this case potentially undisputed champion.” Joshua, 33, is taking time out of the sport following consecutive losses to Usyk. And he could return to face the winner between Whyte, 34, and unbeaten Jermaine Franklin, 29, who fight next weekend. Meanwhile Fury defends his title next in a trilogy bout against Derek Chisora, 38, the man he one-sidedly beat in 2011 and 2014. It comes with Usyk ruling himself out next year for the undisputed decider, which is already in talks for March in Saudi Arabia. AJ could be fighting the winner of Wilder – Ruiz for the WBC world heavyweight title, could be fighting Filip Hrgovic. Eddie Hearn Although a spanner was thrown into the works with the IBF primed to order the Ukrainian into a mandatory defence against Filip Hrgovic, 30. Hearn said: “Obviously Usyk’s team and Fury’s team, particularly Usyk’s team will do everything they can to avoid Filip Hrgovic for now because they’d like to make the big fight with Tyson Fury. “For us it’s difficult because obviously we have a job to do for Filip Hrgovic but we also know the Saudi team very well, who have been working very hard to the undisputed fight. “So I’ve spoken to them, who obviously had their concerns and for boxing, that fight is very important. “But also, Filip Hrgovic is mandatory so I’m sure there will be a resolution. Read More on The Sun SERIAL-SLY? Every iPhone owner urged to check hidden codes in model number JUNGLE LAW I’m A Celeb fans share concerns that star ‘wants out’ after trial ‘fix’ row “Now they’re talking about the chronological situation of perhaps the WBA mandatory as well, which I think is Daniel Dubois. “This is just what happens when there’s unified and undisputed fights. But I’m sure that it will get worked out.” Filip Hrgovic is the IBF mandatory challengerGetty","pubDate":"2022-11-18 10:48:00","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Inside Lionel Messi’s luxury £12million private jet with family names on steps, No 10 on tail, kitchen & two bathrooms","link":"https://www.thescottishsun.co.uk/sport/football/3609644/lionel-messi-argentina-psg-private-plane-pictures/","keywords":["Football","La Liga","Football features","Retime"],"creator":["Anthony Chapman"],"video_url":null,"description":null,"content":"STEP inside Lionel Messi’s private jet. The £12million luxury plane is the perfect means of transport for the Argentine to travel, say, from Qatar to his homeland with the World Cup trophy... 5 Lionel Messi has got a luxury plane Credit: Goal 5 There are names on the steps and a No 10 on the tail Credit: Goal 5 The plane was forced to make an emergency landing in Brussels several years after a technical fault was reported It was made by a company in Argentina and designed for Paris Saint-Germain star Messi as well as his family. It boasts a number of incredible features, including its very own kitchen. There are two bathrooms and enough seats for 16 people. Incredibly, the chairs can also be folded up and turned into eight beds. Unfortunately it had to make an emergency landing in Brussels two years ago due to a technical fault. To top things off, the steps feature the names of Messi and his family – wife Antonella, plus children Thiago, Ciro and Mateo. However, the plane – which also boasts his No10 on the tail – is not owned by the superstar, instead he leases it. But that is sure to not bother Messi in the slightest as he continues his jet-set lifestyle. 5 There are 16 chairs which can be folded into eight beds Credit: Goal 5 The private jet boasts a kitchen and two bathrooms Credit: Goal View this post on Instagram A post shared by Leo Messi (@leomessi) View this post on Instagram A post shared by Leo Messi (@leomessi) most read football stories double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan ANGE-R MANAGEMENT Celtic boss Postecoglou slams TV & screams at stars in foul-mouthed rant FOOTIE TRAGEDY Tributes as ex-Austrian international, 57, dies after being hit by train The ace has rediscovered his form at PSG this season, scoring seven goals and assisting a further 10 in just 13 games. Messi is now in Qatar with Argentina, looking to win his first-ever World Cup. The South Americans are one of the favourites to win the tournament. And Messi will be determined to secure the trophy in what could be his final World Cup ever. At least we know that he has the perfect means of transportation to get the trophy home... View this post on Instagram A post shared by Leo Messi (@leomessi) View this post on Instagram A post shared by Leo Messi (@leomessi)","pubDate":"2022-11-18 10:36:03","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"World Cup sign-up offer: Get £66 in FREE BETS when staking £19 with Bet UK","link":"https://www.thescottishsun.co.uk/sport/football/9783536/world-cup-sign-up-offer-free-bets-bet-uk/","keywords":["Football","Sport","Betting","Betting tips","Free Bets","World Cup 2022"],"creator":["Craig Mahood"],"video_url":null,"description":null,"content":"BET UK have an incredible offer ahead of the start of the Qatar World Cup! With England kicking off their competition on Monday, Bet UK are offering 'Bet £19 Get £66' for new customers to claim right now! 1 Get £66 in FREE BETS when staking £19 with Bet UK Credit: Getty BET UK: GET £66 IN FREE BETS* Bet UK offer Visit the Bet UK website HERE * Register a new account and deposit – No Promo Code required Place a £19 single bet on any sports market at minimum odds of 1.8 Once the qualifying bet settles 4 x £10, 4 x £5 and 1 x £6 free bets will be credited to your account This offer can only be claimed once, and free bet stake is not included in any winnings BET UK: GET £66 IN FREE BETS* New to Bet UK? Then you can claim this sensational deal! Simply open a brand new Bet UK account HERE * , deposit and place a £19 single bet on any sports market at minimum odds of 1.8. Once the qualifying bet settles, you will receive the following; 4 x £10 free bets – to use on bets with four or more selections 1 x £5 free bet – to use on the World Cup Outright winner 1 x £5 free bet – to use on any football match (pre-match only) 1 x £5 free bet – to use on any football match (in-play only) 1 x £5 free bet – to use on any Horse Race 1 x £6 free Bet – to use on any Premier League match BET UK: GET £66 IN FREE BETS* FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playing Only gambles with money they can afford to lose Never chase their losses Doesn’t gamble if they’re upset, angry or depressed Gamcare – www.gamcare.org.uk Gamble Aware – www.begambleaware.org For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites. *New customers only. Stake min amount of £19 (odds of 1.8 or greater) on any sporting event. Promotion available between 14/11/22 – 01/12/22. Max 4 x £10, 4 x £5, 1 x £6 Free Bets credited on qualifying bet settlement on selected events. 1x claim per customer. Void, cashed out, partially cashed out bets do not qualify. Each Way bets, system bets and profit boost are not permitted for qualifying bet. Free bets are non-withdrawable & not returned with winnings. Free bets expire after 7 days of qualifying bet settlement. T&Cs apply 18+ begambleaware.org Most read in Football double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan ANGE-R MANAGEMENT Celtic boss Postecoglou slams TV & screams at stars in foul-mouthed rant FOOTIE TRAGEDY Tributes as ex-Austrian international, 57, dies after being hit by train","pubDate":"2022-11-18 10:35:04","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Racism from my club’s OWN fans forced me out of Hungary reveals ex-Dundee United boss Tam Courts","link":"https://www.thescottishsun.co.uk/sport/football/9783321/racism-fans-hungary-dundee-united-tam-courts/","keywords":["Football","Sport","Dundee"],"creator":["Stewart Fisher"],"video_url":null,"description":null,"content":"FORMER Dundee United boss Tam Courts has been speaking about the sickening racism which forced him out of Hungary. The Scot previously held up a Show Racism the Red Card sign during a match against Ross County after believing ex- United star Jeando Fuchs had been racially abused. 1 Tam Courts was only in Hungary for a short time And he revealed how his time at Budapest Honved was cut short by mutual consent after just four months . His exit came after talks in the wake of sickening scenes during an away match at Zalaegerszegi. Honved fans were accused of making monkey chants towards Zalaegerszegi star Christy Mazinga, a former Motherwell player. That sparked Zalaegerszego boss Ricardo Moniz to march onto the field - then be given his marching orders as he the match was temporarily halted before order was restored. Read More In Football ready-made rival Rangers can 'follow Celtic Oz boss blueprint with ex-star Kevin Muscat' BET BONUS Celtic vs Everton free bets: Get £30 bonus to use on Super Cup this week Now Courts told the Daily Record that it was the moment he knew he was at the wrong club. He said: “It was the second incident I had been involved in and witnessed. \"That was the moment I realised that maybe it’s not the club and place for me to continue. “Because I’ve taken a very public stand in the past it was probably the last thing that knocked the wind out of my stomach and my passion for continuing. Most read in Football double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan ANGE-R MANAGEMENT Celtic boss Postecoglou slams TV & screams at stars in foul-mouthed rant FOOTIE TRAGEDY Tributes as ex-Austrian international, 57, dies after being hit by train “I had already experienced one other incident of racism where one of our players was involved that only came to light in the aftermath. \"The club dealt with that one internally. Even though I never heard this second incident, I couldn’t be a bystander. “We had one player who I trusted deeply and, after the game, I asked him if he heard anything and he said there was monkey chants. \"That’s the moment — travelling back on the bus — I thought it wasn’t the right environment for me. “If it doesn’t make you uncomfortable to be connected to situations like that, then I think it says a lot about your moral compass. Tijdens een competitiewedstrijd krijgt een speler van de Hongaarse club Zalaegerszegi, waar Moniz trainer is, te maken met racisme. Na verschillende oerwoudgeluiden is de maat vol voor de Rotterdammer. pic.twitter.com/JbjvEEGDxx — NOS Sport (@NOSsport) October 24, 2022 “The Hungarian FA actually gave the opposition manager a four match ban. “But they also made Honved play behind closed doors for a game so I suppose that’s a sense of progress. “At least there’s an acknowledgment something happened. “I’d made it known [at the club] about my frustration levels at the incident. That triggered a conversation with the owners.” Courts insists he has no regrets about his decision to leave Dundee United - who he guided to fourth place last season. “There’s no regret - I felt the lure of challenging myself in a very complex environment was what I needed at that stage of my career. Read More on The Sun NOT SO SWEET I found a lost cheque worth £4MILLION - but the reward I got left me stunned BLAZE TERROR Shocking moment family car torched by thugs in Scots town “I wanted to go somewhere and really learn about myself and a different style of football. \"I’m really content with the decision I made. The next thing for me is making sure I choose the right people to work with.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2022-11-18 10:30:11","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Potential Derek Carr Destinations for 2023","link":"https://www.gudstory.com/potential-derek-carr-destinations-for-2023/","keywords":["NFL"],"creator":["Rachel Arninda"],"video_url":null,"description":"The Las Vegas Raiders 2022 regular season has not gone as planned. Las Vegas is currently in last place in the AFC West after making it to the playoffs last season with much more chaos than this. Quarterback Derek Carr seems to have an uncertain future because of head coach Josh McDaniels. The Raiders organization […] The post Potential Derek Carr Destinations for 2023 appeared first on Gud Story.","content":"Home Sports NFL Potential Derek Carr Destinations for 2023 by Rachel Arninda November 18, 2022 in NFL Reading Time: 4 mins read 0 ADVERTISEMENT Share on Facebook Share on Twitter The Las Vegas Raiders 2022 regular season has not gone as planned. Las Vegas is currently in last place in the AFC West after making it to the playoffs last season with much more chaos than this. Quarterback Derek Carr seems to have an uncertain future because of head coach Josh McDaniels. The Raiders organization appears to feel safe with McDaniels as head coach for 2023, which means that quarterback Derek Carr might need a new home. He cried in his press conference after the 25-20 loss at home against the Indianapolis Colts on Sunday, November 13. Some NFL expert picks had the Raiders making the playoffs this season. Where will Derek Carr potentially play in 2023? Table of Contents 1. New York Giants 2. New York Jets 3. Indianapolis Colts 4. Tampa Bay Buccaneers 1. New York Giants The New York Giants might be one of the most polarizing places for Derek Carr to land next season. It will be interesting to see if they keep Daniel Jones around after this season, but that remains the multimillion-dollar question. If the Giants moved off of Jones after this season, it is possible that general manager Joe Schoen would pursue him at the right price. ADVERTISEMENT He would fit the new culture established by head coach Brian Daboll perfectly. Mike Kafka is the offensive coordinator for the New York Giants, and that playbook would be opened up. Having Saquon Barkley in the backfield would help. The only thing New York is missing for Derek Carr is some quality wide receivers. However, this is a friendly offense for both the quarterback and the running back. Carr with the New York media might be a different story if he doesn’t perform well. 2. New York Jets Let’s stick with the New York teams here. The Jets are also another interesting team that could be in play for him. The New York Jets are in playoff contention this season. If the Jets realize the defense got worn down the stretch because of quarterback Zach Wilson, then general manager Joe Douglass and head coach Robert Saleh are going to have to make some interesting decisions this offseason. Douglass has fleeced other teams in trades before. The Jets have Breece Hall in the backfield. He was on his way to winning Offensive Rookie Of the Year before he tore his ACL. Garrett Wilson Jr., Corey Davis, and Elijah Moore are the key wide receivers on this roster. Mike LaFleur is the offensive coordinator for the Jets. New York plays in a tough AFC East, and they wouldn’t have the fourth-best quarterback in the division with Derek Carr if they had him instead of Zach Wilson potentially. 3. Indianapolis Colts The Indianapolis Colts will be in play for another quarterback once again this off-season. Matt Ryan is going to be a one-year thing, and the Colts need something more than a one-year thing at this current point. General Manager Chris Ballard is lucky that he didn’t get fired because Frank Reich was his scapegoat for making the wrong quarterback decisions recently, like Carson Wentz. Sam Ehlinger has also started some games, but he isn’t the answer. Would owner Jim Irsay keep interim head coach Jeff Saturday around for the long term? It remains to be seen. Derek Carr would have Jonathan Taylor in the backfield and rookie wide receiver Alec Pierce and Michael Pittman Jr. to throw to. Carr would maybe become the best quarterback in the AFC South. This is one of the weakest divisions in all of football, and it would be something to watch for. 4. Tampa Bay Buccaneers The Tampa Bay Buccaneers probably don’t expect Tom Brady to come back after this season ends. Brady is 45 years old, and at some point, he needs to turn his focus to other things than football. Tom Brady is showing that father time is catching up to him. He has nothing left to prove in his illustrious NFL career. Derek Carr would be a perfect quarterback to take over in this offense. Todd Bowles as the head coach and Byron Leftwich as the offensive coordinator would be a good thing for Carr. He would have Mike Evans, Chris Godwin, and Julio Jones to throw the football to. The NFC South is also a very weak division, and Derek Carr would also be the best quarterback division right away if he played in this division. Also read: NFL Mock Draft 2022 Rankings: Top 15 Picks Related Posts Zach Green, an Ex NFL Player Who Turned into a Most Entertaining Streamer November 11, 2022 How NFL Betting has Changed Over the Last Few Years October 22, 2022 Cam Newton was Once Sued with $270,000 Lawsuit September 10, 2022 Darnay Holmes Stealing The Show in Training August 11, 2022","pubDate":"2022-11-18 10:26:00","image_url":null,"source_id":"gudstory","country":["india"],"category":["sports"],"language":"english"},{"title":"Arsenal promote Edu to club’s first-ever sporting director in reshuffle after overseeing incredible turnaround","link":"https://www.thescottishsun.co.uk/sport/football/9783475/arsenal-news-edu-sporting-director/","keywords":["Football","Sport","Arsenal transfer news","Premier League"],"creator":["Chisanga Malata"],"video_url":null,"description":null,"content":"ARSENAL have announced the appointment of Edu as their inaugural sporting director. The former Gunners midfielder has served as the club's technical director since July 2019, helping manager Mikel Arteta negotiate transfers. 3 Edu has been promoted from the role of technical director to sporting director Credit: GETTY 3 The former Gunners midfielder has formed a strong bond with manager Mikel Arteta Credit: PA 3 The Brazilian is helping oversee a major turnaround at the Emirates Credit: GETTY And Brazilan's fine work behind the scenes has landed him a major promotion, which will see him take a more hands-on role at the club - including at academy level. Edu said of his new role: “I’m delighted to have this new role which I see as an evolution and consolidation of the way we’ve been working. \"We are making good progress in all areas of our men’s, women’s and academy and we are all excited about what can be achieved. \"I look forward to building on the hard work of so many people and helping all of us grow together and enjoy more success, and am thankful for the trust the club has put in me. READ MORE IN SPORT GUNNERS LIVE Cazorla eyes Gunners return, Mudryk 'upset' by £88.8m price tag \"We move forward together.” Arsenal chief executive Vinai Venkatesham had no issue giving Edu more power at the club following the first team's recent success on the pitch. He said: \"We are delighted that Edu is recommitting his future to the Club that he so clearly loves, after making such a positive and critical contribution to our progress in his time with us so far. \"Edu’s promotion formalises his already growing influence over our Academy operations. Most read in Football record breaker Rangers captain dumped music collection because bands backed Celtic double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH off the field Celtic flop Vasilis Barkas lands bizarre red card for Greece WITHOUT playing top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan PLAY OUR DREAM TEAM WORLD CUP FANTASY FOOTBALL GAME TO WIN A SHARE OF £50k \"And we look forward to Per [Mertesacker] and Edu working together to strengthen the integration between our men’s first-team and Academy yet further.\" Arsenal have undergone an incredible turnaround over the last 18 months. A string of solid signings - in particular Martin Odegaard - have propelled the north Londoners to Premier League title contention. The Gunners are currently on one of their best-ever starts to a season - winning 12, drawing and losing one of their first 14 league matches. That form has put them at the top of the Premier League tree - which they lead by five points. Edu's tenure as technical director was questioned by Gunners fans during the Unai Emery era at the Emirates. Read More on The Sun SERIAL-SLY? Every iPhone owner urged to check hidden codes in model number JUNGLE LAW I’m A Celeb fans share concerns that star ‘wants out’ after trial ‘fix’ row JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) But his recent dealings off the pitch have changed fans' perceptions of him and given them renewed optimism. Arsenal will resume their bid to win the Prem for the first time in 18 years with a Boxing Day clash with West Ham at the Emirates.","pubDate":"2022-11-18 10:24:26","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Qatar Football World Cup: No alcohol sales at stadium sites","link":"https://economictimes.indiatimes.com/news/sports/qatar-football-world-cup-no-alcohol-sales-at-stadium-sites/articleshow/95602566.cms","keywords":null,"creator":null,"video_url":null,"description":"The expected announcement comes two days before the kickoff of the Qatar World Cup, the first to be hosted in a Middle Eastern nation. Major World Cup sponsor Budweiser was to sell alcoholic beer within the ticketed perimeter surrounding each of the eight stadiums three hours before and one hour after each game.","content":null,"pubDate":"2022-11-18 10:12:56","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-49386,resizemode-4,msid-95602566/qatar-football-world-cup-no-alcohol-sales-at-stadium-sites.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Heavyweights go to war over England star","link":"https://www.couriermail.com.au/sport/nrl/wayne-bennett-still-interested-in-stealing-international-broncos-gun/news-story/1efaa453ca4b4cc4f6fea0786a74a3ca","keywords":["Brisbane Broncos","Canterbury Bulldogs","Dolphins","Kayo","NRL News","Sport news and galleries"],"creator":null,"video_url":null,"description":"Dolphins coach Wayne Bennett has revealed he’s “still interested” in pinching Broncos and England international Herbie Farnworth from his old haunt.","content":"But Bennett may have his work cut out for him in a competitive player market after the 22-year-old’s impressive World Cup campaign for England.Watch Australia v Samoa in the Rugby League World Cup Final this Sunday. Plus catch up on all the action with Kayo Minis. New to Kayo? Start your free trial now >Although the Brits were knocked out by Samoa in a World Cup boilover, Farnworth starred for the English, further improving his status as one of the game’s most coveted stars.Much has been said about the Dolphins and the failure to attract a big name star but Farnworth could be an attractive proposition.Farnworth had already turned the Broncos down in May when he signed a one-year deal at Red Hill but is eager to ply his trade as a fullback, rather than a centre.At Brisbane, Reece Walsh and Selwyn Cobbo are expected to battle it out for the fullback role.At the Dolphins, former Cowboys Hamiso Tabuai-Fidow is believed to be the frontrunner for the No. 1, while Jamayne Isaako is also a contender.Regardless, Bennett is eager to try to get his man.“Herbie only signed for one year, so we’re definitely interested,” Bennett said.“I was interested in him last year and our interest is still there.“I’m not going to talk about positions with Herbie, but the bottom line is he is back on the market and we’re still very keen on him.“We had a talk to him last year and he wanted to stay at the Broncos, which he did, that’s fine, but he is a free agent again.“I’m still interested in signing Herbie, so we’d like to have a chat again.”Farnworth has been with the Broncos since he was 15 but with the path to the fullback spot in Brisbane seemingly closed, he could look elsewhere.Broncos recruitment boss Simon Scanlan told NewsCorp there was some salary cap pressure.“I don’t know if we can keep Herbie,” he said.“We’d love to keep him but what other clubs are prepared to pay him, I can’t answer that.”Another club that’s definitely interested is the Bulldogs, as Phil Gould revealed fellow Brit Luke Thompson was leading the charge for his signature.The Bulldogs are expected to try to sign either Farnworth or Panthers back Stephen Crichton, who buried the English and sent Samoa into the World Cup final.Fullback is one position the Bulldogs don’t have nailed down.Bulldogs football boss Phil Gould told NewsCorp: ““Never spoken to him (but) Luke Thompson said he was very impressed with him from the RLWC. That’s all I know,” he wrote in a text exchange.“Luke was particularly keen on Herbie.“I think he manages himself and I’m told he’s sorted elsewhere. I haven’t delved into it and haven’t spoken to Luke since England lost last week.“But yes, Luke was very impressed with several of the UK squad, including Herbie.“Several have indicated they’d like to play in the NRL. There’s plenty of talent there.”Adding a fullback to five-eighth Matt Burton and hooker Reed Mahoney, the Bulldogs are reportedly looking to dip back into the Eels in the hunt for either Mitchell Moses or Dylan Brown to be their No. 7.However, the Broncos also like their chances of keeping Farnworth right where he is.“Herbie is coming into his best footy,” Broncos coach Kevin Walters said.“Herbie has been here a long time. He has been here since he was 15 and his best football is in front of him, whether it’s at centre or fullback.“I’m not sure if he thinks he is a long term fullback but he wants to see if he can handle the position and I am happy to accommodate that.“He has a huge future at the Broncos.”","pubDate":"2022-11-18 10:12:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Gianni Infantino Lone Candidate for FIFA 2023 Presidential Election","link":"https://www.news18.com/news/football/gianni-infantino-lone-candidate-for-fifa-2023-presidential-election-6414565.html","keywords":["sports"],"creator":null,"video_url":null,"description":"The election is set to take place at the 73rd FIFA Congress in Kigali, Rwanda on March 16, 2023, according to FIFA and as it stands the international football governing body has received just one candidature in the form of current president Infantino","content":null,"pubDate":"2022-11-18 10:09:48","image_url":"https://images.news18.com/ibnlive/uploads/2022/05/gianni-infantino-qatar-1-16515720793x2.jpg","source_id":"news18","country":["india"],"category":["sports"],"language":"english"},{"title":"Armando Broja ‘is forced to return to Chelsea’ after being carried off pitch with ankle injury while playing for Albania","link":"https://www.thescottishsun.co.uk/sport/football/9783356/chelsea-news-armando-broja-injury/","keywords":["Football","Sport","Premier League"],"creator":["Chisanga Malata"],"video_url":null,"description":null,"content":"ARMANDO BROJA has become the latest injury headache for Chelsea manager Graham Potter after picking up a knock while on international duty. The Albania striker suffered an ankle injury in the 50th minute of The Eagles' 3-1 defeat to Italy on Wednesday night. 3 Chelsea hitman Armando Broja was on international duty with Albania this week Credit: AFP 3 But the 21-year-old suffered an ankle injury in the 50th minute and had to be stretched off Credit: REUTERS 3 The Albanian in now one of EIGHT first-team Blues players who are crocked Credit: Getty Broja took a heavy knock to his ankle and ended up being carried off the pitch to receive further treatment. Chelsea are reportedly hopeful the injury \"isn’t serious\" but will make their own assessments when the forward returns to the UK. Broja is one EIGHT first-team Blues players currently in the treatment room. Ben Chilwell, N’Golo Kante, Reece James, Ruben Loftus-Cheek, Carney Chukwuemeka, Wesley Fofana and Kepa Arrizabalaga are all crocked. Frenchman Kante, however, is in contention to return to the squad after the World Cup-inforced international break. Broja's unfortunate injury came days after Albania chief Edoardo Reja called on Blues boss Potter to play the forward more. He told TMW: “He has great potential. “He is a strong player, tall, he has technique and great speed, when he starts running you don't catch him. Most read in Football double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan ANGE-R MANAGEMENT Celtic boss Postecoglou slams TV & screams at stars in foul-mouthed rant FOOTIE TRAGEDY Tributes as ex-Austrian international, 57, dies after being hit by train PLAY OUR DREAM TEAM WORLD CUP FANTASY FOOTBALL GAME TO WIN A SHARE OF £50k “He must improve at second balls because when the action is over, he doesn't help much. \"From this point of view, this year he is doing a little better. “But certainly the fact he plays 20 or at most 30 minutes does not help him. Read More on The Sun SERIAL-SLY? Every iPhone owner urged to check hidden codes in model number JUNGLE LAW I’m A Celeb fans share concerns that star ‘wants out’ after trial ‘fix’ row “Especially Napoli wanted him. [Sporting director, Cristiano] Giuntoli was interested, he also spoke to me. \"But he wanted to stay at Chelsea, who then also renewed his contract.”","pubDate":"2022-11-18 10:08:14","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"World Cup winner to be predicted in Haydock horse race as Bryony Frost aims to set England on path to victory in Qatar","link":"https://www.thescottishsun.co.uk/sport/9783247/world-cup-winner-prediction-haydock-horse-race-betfair/","keywords":["Sport","Horse racing","World Cup 2022"],"creator":["Sam Morgan"],"video_url":null,"description":null,"content":"BRYONY FROST will aim to put England on the path to World Cup glory - by winning a unique horse race at Haydock. Bookies Betfair have set up a first-of-its-kind six-horse race to predict the winner in Qatar. 2 Betfair ambassador Frost will aim to put Southgate's side on the path to glory by winning the World Cup Stakes with 'England' at Haydock on Saturday Credit: Getty 2 All the info you need to know for the one-of-a-kind horse race which will attempt to predict the World Cup winner The Race To The World Cup Stakes will see Frost's 'England' horse take on France, Argentina, Brazil, Germany and Spain. Sadly, the Republic of Ireland were late non-runners. The five-furlong contest will take place before Saturday's blockbuster Betfair Chase card and be shown on ITV's coverage. Get £30 in free bets with Betfair - CLAIM HERE Betfair have Gareth Southgate's side 8-1 to win the World Cup behind 7-2 favs Brazil, 11-2 Argentina, 13-2 France and 15-2 Spain. So recent Badger Beer winner Frost - who is set to take on Gold Cup hero A Plus Tard with fan favourite Frodon in the Chase on Saturday - has her work cut out. Champion jumps jockey Brian Hughes will ride 'France', Paddy Brennan is on 'Argentina', Jack Quinlan on 'Germany' and Harry Skelton 'Spain'. Most read in Horse Racing 'KILL HIM' Infamous Breeders' Cup brawl turned racecourse into boxing ring & shamed a sport 'IS SHE ALIVE?' Stunning TikTok and OnlyFans star shocks the internet with disgusting act CHOPPER HORROR Top horse trainer one of five people injured in horrific helicopter accident NEVER IN DOUBT Punters lose £14,000 backing horse they all thought couldn't get beaten 'Brazil' will get a last-minute call-up for the 11.30am race, the winner of which will be presented a trophy by ex-Three Lions boss Glenn Hoddle. Betfair will donate £10,000 to the Injured Jockeys Fund on behalf of the jockeys, owners and trainers who have contributed to making the race possible. Frost, 27, said: \"I'm delighted to be representing England in the Betfair Race to the World Cup Stakes at Haydock this weekend. \"After England’s heart-breaking loss against Italy at the Euros, the success of the Lionesses this summer showed the great strength of English football and hopefully the men’s team can repeat that at the World Cup. \"I’ve been lucky to have some memorable rides with Frodon and there is nothing better than riding a fan favourite. \"Hopefully I can bring football home at Haydock on Saturday.\" FREE BETS GET OVER £2,000 IN SIGN UP OFFERS HERE Commercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playing Only gambles with money they can afford to lose Never chases their losses Doesn’t gamble if they’re upset, angry or depressed Gamcare – www.gamcare.org.uk Gamble Aware – www.begambleaware.org","pubDate":"2022-11-18 09:56:47","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cristiano Ronaldo reveals his son’s brilliant response to his Man Utd suspension after refusing to come on as a sub","link":"https://www.thescottishsun.co.uk/sport/football/9783243/cristiano-ronaldo-son-brilliant-response-man-utd-suspension/","keywords":["Football","Sport","Manchester United transfer news","Premier League"],"creator":["Joshua Mbu"],"video_url":null,"description":null,"content":"CRISTIANO RONALDO has revealed his son's brilliant reaction to his Manchester United suspension after he refused to come on as a sub against Tottenham. Red Devils boss Erik ten Hag called upon Ronaldo, 37, in the dying minutes of their 2-0 win over Spurs, and the five-time Ballon d'Or winner refused to come on . 2 Cristiano Jr questioned why United would punish 'the best player in the world' Credit: Instagram / @cristiano 2 Ronaldo admitted he made a mistake by refusing to come on as a sub Credit: Instagram / @cristiano Ronaldo stormed down the tunnel before full-time and was subsequently left out of the matchday squad for Chelsea the following weekend. And in a sit-down interview with SunSport columnist and TalkTV main man Piers Morgan, in which Ronaldo blasted United as well as past and present figures , the legendary forward revealed his son's reaction to the suspension. He told Piers: “I think it was a strategy from the club for me to react that way. \" I was very, very, very, very disappointed for the communication of Manchester United. READ MORE ON RONALDO HUGE DEAL World Cup 2022 sign up offer: Get £40 in FREE BETS when you stake £10 at Sky Bet CRISTIANO LIVE Latest on Man Utd star's HUGE talk with Piers Morgan with part 2 OUT NOW \"To be honest, I never had a problem with any club, with any coach. And they suspend me three days, which I felt it was a lot – and the level of sport, clubs, I felt a lot. It was a shame, that. “I think it was (humiliating). “But I remember arriving home and Cristiano (Junior) see me and say ‘Daddy do not go to the game?’ I say ‘No, because the club punish me with three days’. \"And he did like *laughs* ‘How they’re going to punish you if you are the best player in the world and you’re not gonna play?’ Most read in Football record breaker Rangers captain dumped music collection because bands backed Celtic double dunt Ryan Jack opens up on moment when Liverpool midfielder gave him WHIPLASH off the field Celtic flop Vasilis Barkas lands bizarre red card for Greece WITHOUT playing top job Ex-Celtic ace loses bid to take on Fifa boss Infantino - but hints at future plan PLAY OUR DREAM TEAM WORLD CUP FANTASY FOOTBALL GAME TO WIN A SHARE OF £50k \"I said ‘No I’m not gonna play because I have not been behave’. And he look at me like, ‘My Daddy not be behave, what?’ “In one way, I was good because I was like, more relaxed, but in the same way, I feel very disappointed because, okay, I regret, I apologise, I’m not perfect, I made a mistake. \"But suspend me three games, for that, I think it’s too much. And then they make fire for the press, which is really disappoint me.” Whether Ronaldo can continue at United past the World Cup is yet to be seen. His contract is up in the summer and he can walk out of Old Trafford on a free transfer. One destination Ronaldo would be open to is Paris Saint-Germain , where he would link up with long-time rival Lionel Messi, who has seven Ballon d'Ors. Ronaldo said on PSG: \"It's... everything is possible in football. \"Why not? For sure. They will sell a lot of shirts.\" And Ronaldo showered Messi with compliments in his interview. He added: \"Amazing. Player is magic - top. \"As a person, we share the stage 16 years, imagine, 16 years. We share. \"I have great relationship with him. I'm not friend of him in terms of what I mean friend is, the guy who was with you in your house. Speaking of phone. No, but he’s like a team-mate. \"It’s a guy that I really respect, the way he always speaks about me. Read More on The Sun SERIAL-SLY? Every iPhone owner urged to check hidden codes in model number JUNGLE LAW I’m A Celeb fans share concerns that star ‘wants out’ after trial ‘fix’ row \"Even his wife or my wife, my girlfriend, they always respect and they're from Argentina. My girlfriend is from Argentina. \"So good. What I am going to say about Messi? Great things. He’s a great guy who does everything for football.\"","pubDate":"2022-11-18 09:56:20","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"}]}