{"newsArray":[{"title":"Arsenal agree deal to signal Brentford goalkeeper David Raya","link":"https://www.businesslend.com/sports/arsenal-agree-deal-to-sign-brentford-goalkeeper-david-raya/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox free of charge Sign as much as Miguel’s Delaney’s free weekly publication Arsenal have agreed a deal to signal Brentford goalkeeper David Raya. The PA information company understands a payment of £30million has been agreed for the 27-year-old Spaniard, who’s [...] The post Arsenal agree deal to signal Brentford goalkeeper David Raya appeared first on BusinessLend.","content":"Arsenal have agreed a deal to signal Brentford goalkeeper David Raya. The PA information company understands a payment of £30million has been agreed for the 27-year-old Spaniard, who’s reported to be signing a five-year contract. Raya will present competitors for established primary Aaron Ramsdale and the England worldwide welcomes it. “Bring it on. Nothing comes easy in football. At the same time you need to move along and adapt as well,” Ramsdale informed ITV Sport. “I’ve done it to other people when I’ve moved clubs so I’m not going to be thinking that it’s never going to happen to me. “If it happens, it happens and then we’ll fight and we’ll make each other the best version of ourselves because that’s what the manager is telling us as well. “And I’m sure whoever plays, me or whoever comes in, the goalkeeping union – people laugh at it but it’s a real thing – (means) your individual disappointment will go away. “You will put the team first and you’ll put that goalkeeper first as well.” Raya’s arrival may also sign the departure of United States goalkeeper Matt Turner to Nottingham Forest in a deal which may very well be price as much as £10m. Bans for racism ought to match these for betting offences – Anton Ferdinand","pubDate":"2023-08-08 17:49:24","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Packers’ AJ Dillon eager to rebound after busy offseason in which he wrote a book and became a dad","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/08/packers-aj-dillon-eager-to-rebound-after-busy-offseason-in-which-he-wrote-a-book-and-became-a-dad","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s […]","content":"GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s book he wrote in the offseason. Read this article for free: Already have an account? To continue reading, please subscribe: * GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s book he wrote in the offseason. “Quadzilla Finds His Footing.” Dillon, nicknamed “Quadzilla” because of his enormous quads that were measured at 34 inches last year, is set to become a free agent after this season if he and the Packers don’t work out an extension. Dillon wants to bounce back after his production took slight dips last season. “I think I just really need to play just a little bit more — it’s hard to put a word on it — but like passionate,” Dillon said. “I think I need to go out there and just play a little bit more reckless, so not trying to play perfect, not trying to play perfect football. Nobody does. Just kind of go out there and for a lack of words, kind of make defenses feel me.” Then he elaborated on what he meant. “Even though we might be running and there’s only 4 yards here to get, make it a hard 4 yards,” Dillon said. “Make sure the next time running the ball, those defenders feel that, they think about it next time, and just kind of deliver the blow a little bit more.” He wants to stay in Green Bay, where he has made a home, started a family and emerged as one of the Packers’ most popular players. He received a key to Wisconsin’s Door County after repeatedly singing the praises of the peninsula along the Lake Michigan shoreline that’s about an hour’s drive from Green Bay. Dillon also is active on social media, which sparked one of his latest ventures. After he suggested that he’d write a children’s book, the positive feedback he received caused him to go ahead and do it. Quadzilla, his book’s protagonist, is a dinosaur who struggles to do some of his monster friends’ favorite activities before eventually succeeding in football. “We kept everything in house,” Dillon said. “We got a Milwaukee publisher, a Milwaukee illustrator and it was all Wisconsin central. It was a lot of fun doing it and putting it together. It was a goal to get it done before camp, and we did that.” Dillon savors the feedback he’s received, both from his own mother and from the children and parents who have read the book. “My mom’s a teacher,” said Dillon, who grew up reading Greek mythology and the novels of Rick Riordan. “She’s now an assistant principal back in Connecticut in my hometown. That’s something that was always big in our household. When I told her I was writing a book and actually went forward with it, she got very emotional. “I didn’t really realize until I did some of these book readings and kind of seeing the kids really listening and hanging on to every single word.” Writing that book was part of a busy offseason for Dillon. Dillon and his wife, Gabrielle, got married last year in Door County. They welcomed a son, Trey, on May 2. That also happened to be Dillon’s 25th birthday. During a year when he was adjusting to fatherhood and making sure his book got finished, Dillon still devoted plenty of time to football. The trade of four-time MVP quarterback Aaron Rodgers means the Packers may have to lean more heavily on the running back tandem of Aaron Jones and Dillon. Dillon rushed for 770 yards, gained 4.1 yards per carry and caught 28 passes for 206 yards last season. A year earlier, he rushed for 803 yards, gained 4.3 yards per carry and caught 34 passes for 313 yards. When he had free time this offseason, Dillon occasionally watched tapes of his highlights at Boston College, where he rushed for 4,382 yards over three seasons. Dillon wants to have the same attitude he had then. “I’m not satisfied with really how I performed last year,” Dillon said. “Let’s look back at when I have been really successful and how I approached the game and, yeah, looking back a little bit, looking back at those highlights, going back to what was my mindset when I was in college when I was dominating the ACC, what was that like and trying to just get to that mindset.” Dillon’s teammates have noticed a change. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. “He’s more focused,” Jones said. “He knows the playbook inside and out, so now he can play fast. But just his mental approach to the game, spending more time studying in that playbook so he can play fast and just homing in on the small details and then just him being confident in everything he does.” That includes being assured enough to write a children’s book and get it published. The benefits of that offseason project are apparent every time parents tell him how much their child enjoyed his book. “The fact that some of those kids are excited to go read, that’s a big deal,” Dillon said. “Coming from an education household, my mom being a teacher, I definitely understand how hard it is to get some kids to read. If we can put something in front of them that they want to read, it’s definitely nice to be able to do my part.” ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-08 17:24:05","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off","link":"https://www.dailymail.co.uk/sport/football/article-12385525/Gary-Neville-Jamie-Carragher-Premier-League-sixes-order-ex-Man-United-man-backs-Arsenal-win-league-warns-former-remain-long-way-off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Gary Neville and Jamie Carragher have come to a disagreement on who they think will win the Premier League title as they named their top sixes for the season.","content":"Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off The Premier League season gets going when Man City play Burnley on Friday Gary Neville has backed Arsenal for the title, though Jamie Carragher disagrees The ex-Man United star though believes his former side remain some way off By Kieran Lynch For Mailonline Updated: 12:04 EDT, 8 August 2023 e-mail 6 View comments Gary Neville and Jamie Carragher have come to a disagreement on who they think will win the Premier League title as they named their top sixes for the season. Manchester City go into the new campaign looking for a fourth consecutive league title, after pipping Arsenal to the trophy by just five points last term. Mikel Arteta's side have strengthened heavily this summer with the additions of Declan Rice, Kai Havertz and Jurrien Timber, as they look to go one better and end a 20-year wait since they last lifted the league title. The likes of Manchester United, Chelsea and Liverpool will also be hoping to close the gap and mount a challenge, with each of the three clubs spending big money this summer. However, Sky Sports pundits Neville and Carragher said on The Overlap that they feel the title is again going to come down to a fight involving City and Arsenal. Gary Neville and Jamie Carragher came to a disagreement on this season's top six Neville believes Arsenal will win the Premier League title, pointing out that no team has won the trophy four seasons in a row which is what Man City will be pushing for this season Jamie Carragher though feels Manchester City will again beat Arsenal to title glory this season Despite earlier in the show stating City would win the title, Neville eventually decided on Arsenal, due to no team in Premier League history winning the trophy in four successive years. He said: 'Just because of the three thing and never winning the fourth I am going to go with Arsenal to win the league. I'm going for Manchester City second, Man United, Liverpool, Chelsea and Aston Villa.' The Manchester United legend then explained to the fans in attendance that he felt Newcastle would slip out because of their Champions League involvement, and didn't know where Tottenham stood due to the uncertainty over Harry Kane amid Bayern Munich's interest. Carragher meanwhile had confidence that City would beat Arsenal to the title once again, and suggested his former side Liverpool would edge out United for third. He said: 'I'm going for Manchester City, then Arsenal, Liverpool, Manchester United, Chelsea and Tottenham.' Arsenal take momentum into the new season after beating Manchester City in Sunday's Community Shield on penalties. Neville claimed that Arsenal couldn't have done any more to close the gap, and given his rivalry with the Gunners as a player, is concerned they will clinch their first league title since the famous 2003-04 Invincibles team. He said: 'I don't think Arsenal could've done any more to close the gap (to Man City). Carragher, unsurprisingly, went with Liverpool to finish ahead of Manchester United in third Neville placed Man United above Liverpool, but felt that both sides and Chelsea would remain some way off in the title fight The most-eye catching pick from either man was perhaps Neville's decision to place Aston Villa in sixth 'They've shown real intent with the signings that they’ve made – my concern is that I look at and think they actually could win the league. They obviously fell short last season, but with the signings they’ve made I think they’re going to be better. 'Chelsea will be better with their new manager – and they couldn’t get any worse! I don’t look at Liverpool at the moment and think they’re going to be challenging for the league – and the same with Manchester United and what they’ve done so far. 'Unless United, Chelsea or Liverpool do something miraculous in the next few months of the transfer window, Arsenal are the only team that could challenge City at this point in time.' Neville meanwhile also argued that City's treble success last season will mean there will be the biggest expectations on them this time around. Arteta's Arsenal side drew first blood on Guardiola this season in the Community Shield He said: 'I went to the FA Cup Final, but after that was over, I thought Manchester City would do it [win the treble]. I thought Inter Milan in the Champions League final did really well, but it doesn’t surprise me with what Pep Guardiola has achieved in his managerial career that he’s gone on and done it. 'It was going to be him, if anyone was going to do it, and they’re an exceptional team – we will see how they react this season. 'We [Manchester United] won the league the year after we won the treble, but there was a dip. There was an expectation that we felt as though we could go and win the Champions League again, and we couldn’t get to those heights again for quite a few years. It’ll be interesting to see how City take on this year. 'The transfer window has been OK for them – but we’ll see what happens and whether they can climb that mountain again this year.' The full video of The Overlap Fan Debate is available to watch on YouTube . Share or comment on this article: Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off e-mail Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-08 15:30:48","image_url":"https://i.dailymail.co.uk/1s/2023/08/08/16/74089023-0-image-a-115_1691508486711.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"EA Sports release update to add hijab to history-making Moroccan star in FIFA 23","link":"https://www.mirror.co.uk/sport/football/news/morocco-benzina-fifa-hijab-update-30657381","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Megan Feringa)"],"video_url":null,"description":"The 25-year-old wrote her name in the history books when she became the first player in history to wear a hijab at a senior-level major tournament during this summer's Women's World Cup","content":"Moroccan star Nouhaila Benzina wrote her name in football's history books during this summer's Women's World Cup, and the defender will now be immortalised for it within football's biggest gaming franchise. The 25-year-old became the first footballer in history to don a hijab at a senior-level major tournament when she started Morocco's second group stage match against Korea Republic. Benzina helped her side to a 1-0 victory that eventually landed Morocco an historic spot in the tournament's knockout stages at the expense of two-time world champions Germany . Morocco's first-ever World Cup victory coincided with the sight of Benzina wearing her hijab in what represented watershed territory for athletes of Muslim faith, who have historically struggled to freely express their faith in competitive sports. FA to appeal to FIFA after Lauren James apologises for Women's World Cup red card Lauren James breaks silence after red card as England star apologises in World Cup vow Indeed, less than three weeks before the start of the summer's showpiece event, France’s top administrative court upheld the French football federation's (FFF) ban on players wearing hijabs during football matches, deeming the regulation “suitable and appropriate.” In 2007, FIFA issued a ban on all hijabs, with the belief that the garment was a “safety risk” to players. Seven years later, the governing body lifted the ban, though numerous countries and federations, most notably the FFF, still exclude hijabi-wearing players from participating in the sport. Benzina's visibility on the world stage, however, has paved the way for major societal shifts through the women's game. And video game behemoth EA Sports has taken up the call and announced a patch update to FIFA 23 that will see Benzina's in-game avatar include her hijab. Previously, Benzina's hijab was not available in the game's World Cup mode, but EA Sports applied an update hours before Morocco's last-16 clash with France. Nouhaila Benzina and Sofia Bouftini of Morocco celebrate advancing to the knock out stage ( Image: Photo by Paul Kane/Getty Images) While the in-game addition is a minor technical alteration, the wider impact is inarguably immense, with an entire demographic of fans and players previously disregarded able to feel represented. It is not the first bout of history making for Benzina, who touts an impressive CV of historic landmarks. The defender helped the Atlas Lions to become the first North African and Arab country to participate in the final of a continental tournament, WAFCON, after defeating African powerhouse and 11-time defending champions Nigeria in the semi-final. The victory secured Morocco the title of the first Middle Eastern and North African region to qualify for the Women’s World Cup. After being drawn into a daunting group with favourites Germany, Columbia and Korea Republic, Benzina and co. shocked the world as they emerged into the knockout stages in lieu of the Euro2022 finalists . And while Morocco were unable to advance through the knockout stages following a 4-0 defeat to France, the legacy left behind by the women's national team and Benzina is nothing short of prodigious.","pubDate":"2023-08-08 15:28:10","image_url":"https://i2-prod.mirror.co.uk/incoming/article30657305.ece/ALTERNATES/s615/0_GettyImages-1589719283.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Livingston unveil Teto but face transfer twist...","link":"https://www.snl24.com/KickOff/SANews/SA-Players-Abroad/livingston-unveil-teto-but-face-transfer-twist-20230808","keywords":null,"creator":null,"video_url":null,"description":"Livingston have officially unveiled local talent Aphelele Teto as their latest signing but a visa issue is set to delay the 20-year-old making his debut in the Scottish Premier League.","content":"Teto completed a dream move to Livingston at the start of July after having impressed head coach David Martindale in December last year in Turkey where both Livingston and TS Galaxy had held their respective mid-season camps. | However, Livingston were unable to secure a work permit for Teto and will have a chance to re-apply in January. This likely means the former TS Galaxy talent could be sent out on loan or back to the DStv Premiership. \"I'm writing this statement with a mixture of emotions - delighted that we have secured the signing of Aphelele Teto, but disappointed we never got the governing body endorsement for the player to receive his work permit,\" Martindale said in a statement released by the club. \"As a club, there are a few avenues we can explore, such as loaning the player back to his previous club, TS Galaxy FC, or another top-tier side in South Africa, or indeed another African country where Teto will be eligible to play. \"For now, though, I'm delighted to secure his signing and, although he is now officially a Livingston FC player, fans are going to have to wait a little while longer before they can see him make his competitive debut for the first team.\" Teto came through the Carlos Academy Youth Development before joining TS Galaxy's DStv Diski Challenge where he was then promoted to the first team in March 2022. The versatile attacker is one of the brightest prospects in South African football. Livingston will take on Rangers in the Scottish Premiership season on Saturday. Kick-off is at 16:00 (SA time).","pubDate":"2023-08-08 15:25:20","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Detroit Lions Announce First Preseason Game Alternate Broadcast With Kiswe","link":"https://www.sportsvideo.org/2023/08/08/detroit-lions-announce-first-preseason-game-alternate-broadcast-with-kiswe/","keywords":["Digital","Detroit Lions","Kiswe","Lions TV Network"],"creator":["SVG Staff"],"video_url":null,"description":"The Detroit Lions announces that they will offer an alternate broadcast of their first preseason game against the New York Giants at Ford Field on August 11, 2023 (kickoff 7 PM; main broadcasts on the Lions TV Network and Lions Radio Network). The alternate broadcast, using Kiswe’s cloud production, will be hosted by Peter Schrager and will include live commentary and interviews from several guests. Fans can watch the alternate broadcast via www.detroitlions.com or on the Detroit Lions Mobile App. \"We are thrilled to produce our first ever Detroit Lions alternate broadcast with Kiswe,\" says Detroit Lions Director of Broadcasting Carl Moll. \"This is a great opportunity to engage fans in a new and exciting way and we can't wait to see the final product as well as the reaction.\" Guests scheduled to appear on the alternate game broadcast are: Brad Holmes – Detroit Lions Executive Vice President and General Manager Chris Spielman – Detroit Lions Special Assistant to the President/CEO and Chairperson Gary Danielson – Detroit Lions QB (1976-84), current lead college football analyst for CBS Sports (Big Ten) Glover Quin – Detroit Lions S (2013-18) Golden Tate – Detroit Lions WR (2014-18) Jalen Rose – 13-year NBA career, former University of Michigan basketball standout and Detroit native Kirk Gibson – Detroit Tigers outfielder (1979-87), Michigan State University football & baseball All-American and Pontiac, Mich. native Darren McCarty - Detroit Red Wings RW (1993-2004, 2007-09) and four-time Stanley Cup Champion Dave Birkett - Detroit Lions beat writer for the Detroit Free Press and Pro Football Hall of Fame voter Stacey Dales - NFL Network reporter and WNBA player (2002-07) \"We are excited to provide the Detroit Lions with our industry leading cloud-based production solution,\" says Kiswe CEO Glenn Booth. \"Our partnership will enable the Detroit Lions to efficiently create alternate broadcasts using remote production and provide fans with engaging viewing experiences.\" Peter Schrager hosts Good Morning Football on NFL Network and is a national reporter for FOX Sports 1, a senior NFL writer for FOXSports.com and an NFL sideline reporter for FOX Sports. Outside of his work in the NFL, Schrager has covered the Olympics and the NBA for FOX and has been a frequent contributor to GQ.","content":"Detroit Lions Announce First Preseason Game Alternate Broadcast With Kiswe","pubDate":"2023-08-08 14:55:16","image_url":null,"source_id":"sportsvideo","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Dynamos sack head coach Herbert Maruwa over ‘inconsistent’ results","link":"https://nehandaradio.com/2023/08/08/dynamos-sack-head-coach-herbert-maruwa-over-inconsistent-results/","keywords":["Featured","Football","News","Sports","Dynamos Football Club","Herbert Maruwa","Murape Murape","Richard Chihoro"],"creator":["Tafadzwa Chigandiwa"],"video_url":null,"description":"After only seven months on the job, Harare giants Dynamos Football Club have reportedly sacked head coach Herbert Maruwa citing what they called 'inconsistent' results. The post Dynamos sack head coach Herbert Maruwa over ‘inconsistent’ results appeared first on Nehanda Radio.","content":"This comes barely a week after reports suggested the ex-Black Rhinos gaffer was handed a five game ultimatum to collect maximum points in all matches. Maruwa was ordered to win all the five matches, starting with Sunday’s game against Hwange Football Club at Barbourfields Stadium in Bulawayo. The Glamour Boys went on to draw 0-0 with Chipangano, after having thumped Yadah FC 5-1 in their previous match. The 0-0 stalemate meant Jompano, as Maruwa is nicknamed, dropped points and failed to meet the required target. It was not the first time that Maruwa was given an ultimatum by the ‘hard to please’ and ‘overzealous’ DeMbare leadership led by Moses Maunganidze who is the club’s chairman. Initially, the youthful coach was given a two match ultimatum by the DeMbare leadership in the winter (June). He survived the chop after defeating ZPC Kariba and Black Rhinos. Jompano who replaced Tonderai Ndiraya in December 2022, leaves Dynamos perched on fourth position. The Glamour Boys are nine points adrift of log leaders and rivals Highlanders after 18 matches. Meanwhile, according to multiple reports, DeMbare have also suspended the club’s legend Murape Murape together with welfare manager Richard Chihoro for alleged ‘indiscipline’. Murape, the former DeMbare skipper was the second assistant to Maruwa.","pubDate":"2023-08-08 14:53:14","image_url":null,"source_id":"nehandaradio","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Georgia fires football staffer who survived fatal crash, less than a month after lawsuit","link":"https://www.nwahomepage.com/news/national-sports/ap-georgia-fires-football-staffer-who-survived-fatal-crash-less-than-a-month-after-lawsuit/","keywords":["National Sports","AP Sports"],"creator":["AP"],"video_url":null,"description":"ATHENS, Ga. (AP) — Georgia has fired the football recruiting staffer who survived a January crash that killed player Devin Willock and another recruiting staffer, less than a month after she filed a lawsuit against the university's athletic association. The school issued a statement saying Victoria “Tori” Bowles was dismissed because she refused to cooperate [...]","content":"by: Posted: Updated: ATHENS, Ga. (AP) — Georgia has fired the football recruiting staffer who survived a January crash that killed player Devin Willock and another recruiting staffer, less than a month after she filed a lawsuit against the university’s athletic association. The school issued a statement saying Victoria “Tori” Bowles was dismissed because she refused to cooperate with an internal investigation into the crash. Her attorneys claim she is being retaliated against for filing the lawsuit, which also names former Georgia player and first-round NFL draft pick Jalen Carter. The Atlanta Journal-Constitution first reported Bowles’ firing. The Jan. 15 crash, which occurred just hours after a parade celebrating Georgia’s second straight national championship, killed the 20-year-old Willock and the driver of the Ford Expedition, 24-year-old Chandler LeCroy. Police said LeCroy had a blood-alcohol level more than twice the legal limit and was racing Carter at about 104 mph when the SUV swerved off the road, struck two utility poles and a tree before slamming into another tree on the driver’s side, where both LeCroy and Willock were sitting. Another Georgia player, Warren McClendon, sustained only minor injuries. But Bowles, who was sitting in the backseat next to Willock, sustained serious injuries including lumbar and rib fractures, a spinal cord injury and lacerations to the kidney and liver, her lawsuit stated. She also sustained a closed head injury with neurological damage and severe eye pain. The lawsuit, which includes LeCroy’s estate as an additional defendant, requests at least $171,595 in general damages along with punitive damages. The suit claims the Georgia athletic association entrusted the rented SUV to LeCroy and was aware that she had at least two “super speeder” violations among four speeding tickets prior to the crash. The athletic association said staff members were authorized to use rental vehicles for recruiting purposes only. “Under no circumstances were recruiting staff authorized to use rental cars to drive at excessive speeds while intoxicated,” it said in a statement. Bowles was on paid medical leave for a couple of months following the crash, before the athletic association placed her on unpaid leave in March, according to records obtained by the Journal-Constitution. Rob Buck, an attorney representing Bowles in her lawsuit, said the university has engaged in a “campaign of intimidation” against his client, whose job paid less than $12,000 a year. “Tory, like all other perceived liabilities to the football program, became expendable to UGA, and despite her loyalty and meager salary, has been steamrolled,” he said. The athletic association said in a statement Monday that while it wished Bowles well in her recovery, it was forced to fire her for lack of cooperation. “Applicable policies require university employees to cooperate with internal investigations,” the statement obtained by the Journal-Constitution said. “Over the course of several months, Ms. Bowles was asked — on numerous occasions — to speak with our investigators and provide information, and through her attorney, she repeatedly refused to cooperate. “As a result, we were ultimately left with no choice but to terminate her employment.” Carter, who was selected ninth overall by the Philadelphia Eagles in the NFL draft, received 12 months’ probation and a $1,000 fine in March after pleading no contest to misdemeanor charges of reckless driving and racing. McClendon was a fifth-round pick by the Los Angeles Rams. ___ AP college football: https://apnews.com/hub/college-football and https://apnews.com/hub/ap-top-25-college-football-poll Copyright 2023 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","pubDate":"2023-08-08 14:42:12","image_url":"https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/08/64d25585308463.86341935.jpeg?w=480","source_id":"nwahomepage","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Max Verstappen advantage in danger as F1 plans major rule change which would hit Red Bull","link":"https://www.mirror.co.uk/sport/formula-1/drs-qualifying-red-bull-verstappen-30657227","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Daniel Moxon)"],"video_url":null,"description":"Red Bull have been a long way ahead of anyone else on the grid this season in terms of car competitiveness, but their qualifying pace could take a hit if a planned change is approved","content":"Formula 1 chiefs could outlaw the use of DRS in qualifying – a move which could curb one of Red Bull's biggest advantages. Currently, drivers are allowed to use their drag reduction systems in the specified zones when on a flying lap. The only exception is when DRS has been disabled by race control such as in wet weather conditions. It's something which gives Red Bull an extra helping hand over their rivals. Their car design makes the DRS more powerful than those on the cars fielded by any of their rivals, providing extra speed on those longer straights where the system is permitted. But that advantage could be set to disappear. German outlet Auto Motor und Sport reports that the sport's bosses could remove the use of DRS in qualifying altogether. Max Verstappen worried F1 will \"become like NASCAR\" and criticises planned rule change F1 Grand Prix chiefs consider major change which would be bad news for UK fans The system was introduced to aid with overtaking and help make the racing action more exciting. Of course, in qualifying, overtaking is not the name of the game and so its primary function is unnecessary in those sessions. The use of DRS has helped Red Bull's qualifying performances this season. As dominants as the RB19s have been in every single race, their rivals have been much closer in terms of one-lap pace with Mercedes and Ferrari both having out-qualified Max Verstappen once each so far this season. That primarily, is because Red Bull prefer to set their cars up with race pace in mind rather than over one-lap. They take the pain of being slowed in qualifying so they can blitz the competition when the points are handed out. Watch the new Premier League season Watch all the action of the 2023/2024 Premier League season The new football season is nearly upon us and with 500 live games to watch, as well access to C ricket, Golf, F1, Boxing, NFL and the NBA across eight dedicated channels, Sky Sports is the only way to watch all the action. Get Sky Sports from £22 a month Sky Get it here Last month's Belgian Grand Prix offered a demonstration of how much the DRS benefits the Red Bulls. They gained around 20kph of speed when the system was enable compared to when it was not during a wetter session, while McLaren and Mercedes founds only an extra 15kph and 13kph respectively. The use of DRS in qualifying has helped them to still secure pole positions at most races this year. If F1 chiefs were to outlaw its use, then Verstappen and Sergio Perez might find they are starting from the front grid slot less often. Not that it really matters for the Dutchman this season. He has already won races from ninth and sixth on the grid in 2023 and has the pace in hand on a Sunday to probably even manage better than that if needed.","pubDate":"2023-08-08 14:37:34","image_url":"https://i2-prod.mirror.co.uk/incoming/article30529774.ece/ALTERNATES/s615/0_Hungary-F1-GP-Auto-Racing-23203559582446.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"FIFPRO to assist Super Falcons get their allowances from NFF","link":"https://guardian.ng/sport/fifpro-to-assist-super-falcons-get-their-allowances-from-nff/","keywords":["Football","Sport","FIFPro","NFF","Nigeria","Super Falcons"],"creator":["Dennis Erezi"],"video_url":null,"description":"The International Federation of Professional Footballers (FIFPRO) has pledged to help the Super Falcons to get all the money they are being owed by the Nigerian Football Federation (NFF). FIFPRO issued a statement to this effect on Tuesday, saying it will swing into action on behalf of Nigeria women's senior national team. \"Following the Nigeria […] The post FIFPRO to assist Super Falcons get their allowances from NFF appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"The International Federation of Professional Footballers (FIFPRO) has pledged to help the Super Falcons to get all the money they are being owed by the Nigerian Football Federation (NFF). FIFPRO issued a statement to this effect on Tuesday, saying it will swing into action on behalf of Nigeria women’s senior national team. “Following the Nigeria women’s national team’s elimination from the 2023 FIFA Women’s World Cup, FIFPRO can confirm it is assisting players in a disagreement with the Nigeria Football Federation concerning bonus payments, camp allowances and expenses, some of which date back to 2021,” it wrote. FIFPRO said that during the ongoing Women’s World Cup in Australia and New Zealand, the Nigerian players expressed the desire to remain focused on their performance without making public statements or facing other distractions. It further stated that the Super Falcons, however, believe that it is now time for the NFF to honour their commitments and pay the outstanding monies. According to FIFPRO, the team is extremely frustrated that they have had to pursue the NFF for these payments before and during the tournament and may have to continue doing so afterwards. “It is regrettable that players needed to challenge their own federation at such an important time in their careers,” FIFPRO added. “FIFPRO will continue to work with the players to ensure their contractual rights are honoured and the outstanding payments are settled.” Meanwhile, Arsenal legend, Ian Wright, in July told the NFF to pay the Super Falcons whatever money is being owed the players. Wright said this following the Super Falcons’ 3-2 win over Australia in their second group match of the FIFA Women’s World Cup. The Super Falcons’ performance was against many odds due to the events that took place before the tournament. Super Falcons coach, Randy Waldrum had a row with the NFF before the tournament with the American gaffer accusing Nigeria’s football governing body of owing him, his staff, and the players a backlog of wages and allowances. Waldrum accused the NFF of interference in his job over the selection of players. He revealed that his backup goalkeeper Tochukwu Oluehi was banned from the team after she demanded payment of the players’ bonus. He said the ban was not lifted until the player was made to write a letter of apology. Waldrum also alleged that the NFF retaliated by asking him not to take his assistant to Australia. But NFF spokesman Ademola Olajire counter-accused the American, alleging the coach wanted the federation to waste its meagre resources. Follow Us","pubDate":"2023-08-08 14:31:31","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Arsenal agree deal to signal Brentford goalkeeper David Raya","link":"https://www.businesslend.com/sports/arsenal-agree-deal-to-sign-brentford-goalkeeper-david-raya/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox free of charge Sign as much as Miguel’s Delaney’s free weekly publication Arsenal have agreed a deal to signal Brentford goalkeeper David Raya. The PA information company understands a payment of £30million has been agreed for the 27-year-old Spaniard, who’s [...] The post Arsenal agree deal to signal Brentford goalkeeper David Raya appeared first on BusinessLend.","content":"Arsenal have agreed a deal to signal Brentford goalkeeper David Raya. The PA information company understands a payment of £30million has been agreed for the 27-year-old Spaniard, who’s reported to be signing a five-year contract. Raya will present competitors for established primary Aaron Ramsdale and the England worldwide welcomes it. “Bring it on. Nothing comes easy in football. At the same time you need to move along and adapt as well,” Ramsdale informed ITV Sport. “I’ve done it to other people when I’ve moved clubs so I’m not going to be thinking that it’s never going to happen to me. “If it happens, it happens and then we’ll fight and we’ll make each other the best version of ourselves because that’s what the manager is telling us as well. “And I’m sure whoever plays, me or whoever comes in, the goalkeeping union – people laugh at it but it’s a real thing – (means) your individual disappointment will go away. “You will put the team first and you’ll put that goalkeeper first as well.” Raya’s arrival may also sign the departure of United States goalkeeper Matt Turner to Nottingham Forest in a deal which may very well be price as much as £10m. Bans for racism ought to match these for betting offences – Anton Ferdinand","pubDate":"2023-08-08 17:49:24","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Packers’ AJ Dillon eager to rebound after busy offseason in which he wrote a book and became a dad","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/08/packers-aj-dillon-eager-to-rebound-after-busy-offseason-in-which-he-wrote-a-book-and-became-a-dad","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s […]","content":"GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s book he wrote in the offseason. Read this article for free: Already have an account? To continue reading, please subscribe: * GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s book he wrote in the offseason. “Quadzilla Finds His Footing.” Dillon, nicknamed “Quadzilla” because of his enormous quads that were measured at 34 inches last year, is set to become a free agent after this season if he and the Packers don’t work out an extension. Dillon wants to bounce back after his production took slight dips last season. “I think I just really need to play just a little bit more — it’s hard to put a word on it — but like passionate,” Dillon said. “I think I need to go out there and just play a little bit more reckless, so not trying to play perfect, not trying to play perfect football. Nobody does. Just kind of go out there and for a lack of words, kind of make defenses feel me.” Then he elaborated on what he meant. “Even though we might be running and there’s only 4 yards here to get, make it a hard 4 yards,” Dillon said. “Make sure the next time running the ball, those defenders feel that, they think about it next time, and just kind of deliver the blow a little bit more.” He wants to stay in Green Bay, where he has made a home, started a family and emerged as one of the Packers’ most popular players. He received a key to Wisconsin’s Door County after repeatedly singing the praises of the peninsula along the Lake Michigan shoreline that’s about an hour’s drive from Green Bay. Dillon also is active on social media, which sparked one of his latest ventures. After he suggested that he’d write a children’s book, the positive feedback he received caused him to go ahead and do it. Quadzilla, his book’s protagonist, is a dinosaur who struggles to do some of his monster friends’ favorite activities before eventually succeeding in football. “We kept everything in house,” Dillon said. “We got a Milwaukee publisher, a Milwaukee illustrator and it was all Wisconsin central. It was a lot of fun doing it and putting it together. It was a goal to get it done before camp, and we did that.” Dillon savors the feedback he’s received, both from his own mother and from the children and parents who have read the book. “My mom’s a teacher,” said Dillon, who grew up reading Greek mythology and the novels of Rick Riordan. “She’s now an assistant principal back in Connecticut in my hometown. That’s something that was always big in our household. When I told her I was writing a book and actually went forward with it, she got very emotional. “I didn’t really realize until I did some of these book readings and kind of seeing the kids really listening and hanging on to every single word.” Writing that book was part of a busy offseason for Dillon. Dillon and his wife, Gabrielle, got married last year in Door County. They welcomed a son, Trey, on May 2. That also happened to be Dillon’s 25th birthday. During a year when he was adjusting to fatherhood and making sure his book got finished, Dillon still devoted plenty of time to football. The trade of four-time MVP quarterback Aaron Rodgers means the Packers may have to lean more heavily on the running back tandem of Aaron Jones and Dillon. Dillon rushed for 770 yards, gained 4.1 yards per carry and caught 28 passes for 206 yards last season. A year earlier, he rushed for 803 yards, gained 4.3 yards per carry and caught 34 passes for 313 yards. When he had free time this offseason, Dillon occasionally watched tapes of his highlights at Boston College, where he rushed for 4,382 yards over three seasons. Dillon wants to have the same attitude he had then. “I’m not satisfied with really how I performed last year,” Dillon said. “Let’s look back at when I have been really successful and how I approached the game and, yeah, looking back a little bit, looking back at those highlights, going back to what was my mindset when I was in college when I was dominating the ACC, what was that like and trying to just get to that mindset.” Dillon’s teammates have noticed a change. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. “He’s more focused,” Jones said. “He knows the playbook inside and out, so now he can play fast. But just his mental approach to the game, spending more time studying in that playbook so he can play fast and just homing in on the small details and then just him being confident in everything he does.” That includes being assured enough to write a children’s book and get it published. The benefits of that offseason project are apparent every time parents tell him how much their child enjoyed his book. “The fact that some of those kids are excited to go read, that’s a big deal,” Dillon said. “Coming from an education household, my mom being a teacher, I definitely understand how hard it is to get some kids to read. If we can put something in front of them that they want to read, it’s definitely nice to be able to do my part.” ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-08 17:24:05","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off","link":"https://www.dailymail.co.uk/sport/football/article-12385525/Gary-Neville-Jamie-Carragher-Premier-League-sixes-order-ex-Man-United-man-backs-Arsenal-win-league-warns-former-remain-long-way-off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Gary Neville and Jamie Carragher have come to a disagreement on who they think will win the Premier League title as they named their top sixes for the season.","content":"Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off The Premier League season gets going when Man City play Burnley on Friday Gary Neville has backed Arsenal for the title, though Jamie Carragher disagrees The ex-Man United star though believes his former side remain some way off By Kieran Lynch For Mailonline Updated: 12:04 EDT, 8 August 2023 e-mail 6 View comments Gary Neville and Jamie Carragher have come to a disagreement on who they think will win the Premier League title as they named their top sixes for the season. Manchester City go into the new campaign looking for a fourth consecutive league title, after pipping Arsenal to the trophy by just five points last term. Mikel Arteta's side have strengthened heavily this summer with the additions of Declan Rice, Kai Havertz and Jurrien Timber, as they look to go one better and end a 20-year wait since they last lifted the league title. The likes of Manchester United, Chelsea and Liverpool will also be hoping to close the gap and mount a challenge, with each of the three clubs spending big money this summer. However, Sky Sports pundits Neville and Carragher said on The Overlap that they feel the title is again going to come down to a fight involving City and Arsenal. Gary Neville and Jamie Carragher came to a disagreement on this season's top six Neville believes Arsenal will win the Premier League title, pointing out that no team has won the trophy four seasons in a row which is what Man City will be pushing for this season Jamie Carragher though feels Manchester City will again beat Arsenal to title glory this season Despite earlier in the show stating City would win the title, Neville eventually decided on Arsenal, due to no team in Premier League history winning the trophy in four successive years. He said: 'Just because of the three thing and never winning the fourth I am going to go with Arsenal to win the league. I'm going for Manchester City second, Man United, Liverpool, Chelsea and Aston Villa.' The Manchester United legend then explained to the fans in attendance that he felt Newcastle would slip out because of their Champions League involvement, and didn't know where Tottenham stood due to the uncertainty over Harry Kane amid Bayern Munich's interest. Carragher meanwhile had confidence that City would beat Arsenal to the title once again, and suggested his former side Liverpool would edge out United for third. He said: 'I'm going for Manchester City, then Arsenal, Liverpool, Manchester United, Chelsea and Tottenham.' Arsenal take momentum into the new season after beating Manchester City in Sunday's Community Shield on penalties. Neville claimed that Arsenal couldn't have done any more to close the gap, and given his rivalry with the Gunners as a player, is concerned they will clinch their first league title since the famous 2003-04 Invincibles team. He said: 'I don't think Arsenal could've done any more to close the gap (to Man City). Carragher, unsurprisingly, went with Liverpool to finish ahead of Manchester United in third Neville placed Man United above Liverpool, but felt that both sides and Chelsea would remain some way off in the title fight The most-eye catching pick from either man was perhaps Neville's decision to place Aston Villa in sixth 'They've shown real intent with the signings that they’ve made – my concern is that I look at and think they actually could win the league. They obviously fell short last season, but with the signings they’ve made I think they’re going to be better. 'Chelsea will be better with their new manager – and they couldn’t get any worse! I don’t look at Liverpool at the moment and think they’re going to be challenging for the league – and the same with Manchester United and what they’ve done so far. 'Unless United, Chelsea or Liverpool do something miraculous in the next few months of the transfer window, Arsenal are the only team that could challenge City at this point in time.' Neville meanwhile also argued that City's treble success last season will mean there will be the biggest expectations on them this time around. Arteta's Arsenal side drew first blood on Guardiola this season in the Community Shield He said: 'I went to the FA Cup Final, but after that was over, I thought Manchester City would do it [win the treble]. I thought Inter Milan in the Champions League final did really well, but it doesn’t surprise me with what Pep Guardiola has achieved in his managerial career that he’s gone on and done it. 'It was going to be him, if anyone was going to do it, and they’re an exceptional team – we will see how they react this season. 'We [Manchester United] won the league the year after we won the treble, but there was a dip. There was an expectation that we felt as though we could go and win the Champions League again, and we couldn’t get to those heights again for quite a few years. It’ll be interesting to see how City take on this year. 'The transfer window has been OK for them – but we’ll see what happens and whether they can climb that mountain again this year.' The full video of The Overlap Fan Debate is available to watch on YouTube . Share or comment on this article: Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off e-mail Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-08 15:30:48","image_url":"https://i.dailymail.co.uk/1s/2023/08/08/16/74089023-0-image-a-115_1691508486711.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"EA Sports release update to add hijab to history-making Moroccan star in FIFA 23","link":"https://www.mirror.co.uk/sport/football/news/morocco-benzina-fifa-hijab-update-30657381","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Megan Feringa)"],"video_url":null,"description":"The 25-year-old wrote her name in the history books when she became the first player in history to wear a hijab at a senior-level major tournament during this summer's Women's World Cup","content":"Moroccan star Nouhaila Benzina wrote her name in football's history books during this summer's Women's World Cup, and the defender will now be immortalised for it within football's biggest gaming franchise. The 25-year-old became the first footballer in history to don a hijab at a senior-level major tournament when she started Morocco's second group stage match against Korea Republic. Benzina helped her side to a 1-0 victory that eventually landed Morocco an historic spot in the tournament's knockout stages at the expense of two-time world champions Germany . Morocco's first-ever World Cup victory coincided with the sight of Benzina wearing her hijab in what represented watershed territory for athletes of Muslim faith, who have historically struggled to freely express their faith in competitive sports. FA to appeal to FIFA after Lauren James apologises for Women's World Cup red card Lauren James breaks silence after red card as England star apologises in World Cup vow Indeed, less than three weeks before the start of the summer's showpiece event, France’s top administrative court upheld the French football federation's (FFF) ban on players wearing hijabs during football matches, deeming the regulation “suitable and appropriate.” In 2007, FIFA issued a ban on all hijabs, with the belief that the garment was a “safety risk” to players. Seven years later, the governing body lifted the ban, though numerous countries and federations, most notably the FFF, still exclude hijabi-wearing players from participating in the sport. Benzina's visibility on the world stage, however, has paved the way for major societal shifts through the women's game. And video game behemoth EA Sports has taken up the call and announced a patch update to FIFA 23 that will see Benzina's in-game avatar include her hijab. Previously, Benzina's hijab was not available in the game's World Cup mode, but EA Sports applied an update hours before Morocco's last-16 clash with France. Nouhaila Benzina and Sofia Bouftini of Morocco celebrate advancing to the knock out stage ( Image: Photo by Paul Kane/Getty Images) While the in-game addition is a minor technical alteration, the wider impact is inarguably immense, with an entire demographic of fans and players previously disregarded able to feel represented. It is not the first bout of history making for Benzina, who touts an impressive CV of historic landmarks. The defender helped the Atlas Lions to become the first North African and Arab country to participate in the final of a continental tournament, WAFCON, after defeating African powerhouse and 11-time defending champions Nigeria in the semi-final. The victory secured Morocco the title of the first Middle Eastern and North African region to qualify for the Women’s World Cup. After being drawn into a daunting group with favourites Germany, Columbia and Korea Republic, Benzina and co. shocked the world as they emerged into the knockout stages in lieu of the Euro2022 finalists . And while Morocco were unable to advance through the knockout stages following a 4-0 defeat to France, the legacy left behind by the women's national team and Benzina is nothing short of prodigious.","pubDate":"2023-08-08 15:28:10","image_url":"https://i2-prod.mirror.co.uk/incoming/article30657305.ece/ALTERNATES/s615/0_GettyImages-1589719283.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Livingston unveil Teto but face transfer twist...","link":"https://www.snl24.com/KickOff/SANews/SA-Players-Abroad/livingston-unveil-teto-but-face-transfer-twist-20230808","keywords":null,"creator":null,"video_url":null,"description":"Livingston have officially unveiled local talent Aphelele Teto as their latest signing but a visa issue is set to delay the 20-year-old making his debut in the Scottish Premier League.","content":"Teto completed a dream move to Livingston at the start of July after having impressed head coach David Martindale in December last year in Turkey where both Livingston and TS Galaxy had held their respective mid-season camps. | However, Livingston were unable to secure a work permit for Teto and will have a chance to re-apply in January. This likely means the former TS Galaxy talent could be sent out on loan or back to the DStv Premiership. \"I'm writing this statement with a mixture of emotions - delighted that we have secured the signing of Aphelele Teto, but disappointed we never got the governing body endorsement for the player to receive his work permit,\" Martindale said in a statement released by the club. \"As a club, there are a few avenues we can explore, such as loaning the player back to his previous club, TS Galaxy FC, or another top-tier side in South Africa, or indeed another African country where Teto will be eligible to play. \"For now, though, I'm delighted to secure his signing and, although he is now officially a Livingston FC player, fans are going to have to wait a little while longer before they can see him make his competitive debut for the first team.\" Teto came through the Carlos Academy Youth Development before joining TS Galaxy's DStv Diski Challenge where he was then promoted to the first team in March 2022. The versatile attacker is one of the brightest prospects in South African football. Livingston will take on Rangers in the Scottish Premiership season on Saturday. Kick-off is at 16:00 (SA time).","pubDate":"2023-08-08 15:25:20","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Detroit Lions Announce First Preseason Game Alternate Broadcast With Kiswe","link":"https://www.sportsvideo.org/2023/08/08/detroit-lions-announce-first-preseason-game-alternate-broadcast-with-kiswe/","keywords":["Digital","Detroit Lions","Kiswe","Lions TV Network"],"creator":["SVG Staff"],"video_url":null,"description":"The Detroit Lions announces that they will offer an alternate broadcast of their first preseason game against the New York Giants at Ford Field on August 11, 2023 (kickoff 7 PM; main broadcasts on the Lions TV Network and Lions Radio Network). The alternate broadcast, using Kiswe’s cloud production, will be hosted by Peter Schrager and will include live commentary and interviews from several guests. Fans can watch the alternate broadcast via www.detroitlions.com or on the Detroit Lions Mobile App. \"We are thrilled to produce our first ever Detroit Lions alternate broadcast with Kiswe,\" says Detroit Lions Director of Broadcasting Carl Moll. \"This is a great opportunity to engage fans in a new and exciting way and we can't wait to see the final product as well as the reaction.\" Guests scheduled to appear on the alternate game broadcast are: Brad Holmes – Detroit Lions Executive Vice President and General Manager Chris Spielman – Detroit Lions Special Assistant to the President/CEO and Chairperson Gary Danielson – Detroit Lions QB (1976-84), current lead college football analyst for CBS Sports (Big Ten) Glover Quin – Detroit Lions S (2013-18) Golden Tate – Detroit Lions WR (2014-18) Jalen Rose – 13-year NBA career, former University of Michigan basketball standout and Detroit native Kirk Gibson – Detroit Tigers outfielder (1979-87), Michigan State University football & baseball All-American and Pontiac, Mich. native Darren McCarty - Detroit Red Wings RW (1993-2004, 2007-09) and four-time Stanley Cup Champion Dave Birkett - Detroit Lions beat writer for the Detroit Free Press and Pro Football Hall of Fame voter Stacey Dales - NFL Network reporter and WNBA player (2002-07) \"We are excited to provide the Detroit Lions with our industry leading cloud-based production solution,\" says Kiswe CEO Glenn Booth. \"Our partnership will enable the Detroit Lions to efficiently create alternate broadcasts using remote production and provide fans with engaging viewing experiences.\" Peter Schrager hosts Good Morning Football on NFL Network and is a national reporter for FOX Sports 1, a senior NFL writer for FOXSports.com and an NFL sideline reporter for FOX Sports. Outside of his work in the NFL, Schrager has covered the Olympics and the NBA for FOX and has been a frequent contributor to GQ.","content":"Detroit Lions Announce First Preseason Game Alternate Broadcast With Kiswe","pubDate":"2023-08-08 14:55:16","image_url":null,"source_id":"sportsvideo","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Dynamos sack head coach Herbert Maruwa over ‘inconsistent’ results","link":"https://nehandaradio.com/2023/08/08/dynamos-sack-head-coach-herbert-maruwa-over-inconsistent-results/","keywords":["Featured","Football","News","Sports","Dynamos Football Club","Herbert Maruwa","Murape Murape","Richard Chihoro"],"creator":["Tafadzwa Chigandiwa"],"video_url":null,"description":"After only seven months on the job, Harare giants Dynamos Football Club have reportedly sacked head coach Herbert Maruwa citing what they called 'inconsistent' results. The post Dynamos sack head coach Herbert Maruwa over ‘inconsistent’ results appeared first on Nehanda Radio.","content":"This comes barely a week after reports suggested the ex-Black Rhinos gaffer was handed a five game ultimatum to collect maximum points in all matches. Maruwa was ordered to win all the five matches, starting with Sunday’s game against Hwange Football Club at Barbourfields Stadium in Bulawayo. The Glamour Boys went on to draw 0-0 with Chipangano, after having thumped Yadah FC 5-1 in their previous match. The 0-0 stalemate meant Jompano, as Maruwa is nicknamed, dropped points and failed to meet the required target. It was not the first time that Maruwa was given an ultimatum by the ‘hard to please’ and ‘overzealous’ DeMbare leadership led by Moses Maunganidze who is the club’s chairman. Initially, the youthful coach was given a two match ultimatum by the DeMbare leadership in the winter (June). He survived the chop after defeating ZPC Kariba and Black Rhinos. Jompano who replaced Tonderai Ndiraya in December 2022, leaves Dynamos perched on fourth position. The Glamour Boys are nine points adrift of log leaders and rivals Highlanders after 18 matches. Meanwhile, according to multiple reports, DeMbare have also suspended the club’s legend Murape Murape together with welfare manager Richard Chihoro for alleged ‘indiscipline’. Murape, the former DeMbare skipper was the second assistant to Maruwa.","pubDate":"2023-08-08 14:53:14","image_url":null,"source_id":"nehandaradio","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Georgia fires football staffer who survived fatal crash, less than a month after lawsuit","link":"https://www.nwahomepage.com/news/national-sports/ap-georgia-fires-football-staffer-who-survived-fatal-crash-less-than-a-month-after-lawsuit/","keywords":["National Sports","AP Sports"],"creator":["AP"],"video_url":null,"description":"ATHENS, Ga. (AP) — Georgia has fired the football recruiting staffer who survived a January crash that killed player Devin Willock and another recruiting staffer, less than a month after she filed a lawsuit against the university's athletic association. The school issued a statement saying Victoria “Tori” Bowles was dismissed because she refused to cooperate [...]","content":"by: Posted: Updated: ATHENS, Ga. (AP) — Georgia has fired the football recruiting staffer who survived a January crash that killed player Devin Willock and another recruiting staffer, less than a month after she filed a lawsuit against the university’s athletic association. The school issued a statement saying Victoria “Tori” Bowles was dismissed because she refused to cooperate with an internal investigation into the crash. Her attorneys claim she is being retaliated against for filing the lawsuit, which also names former Georgia player and first-round NFL draft pick Jalen Carter. The Atlanta Journal-Constitution first reported Bowles’ firing. The Jan. 15 crash, which occurred just hours after a parade celebrating Georgia’s second straight national championship, killed the 20-year-old Willock and the driver of the Ford Expedition, 24-year-old Chandler LeCroy. Police said LeCroy had a blood-alcohol level more than twice the legal limit and was racing Carter at about 104 mph when the SUV swerved off the road, struck two utility poles and a tree before slamming into another tree on the driver’s side, where both LeCroy and Willock were sitting. Another Georgia player, Warren McClendon, sustained only minor injuries. But Bowles, who was sitting in the backseat next to Willock, sustained serious injuries including lumbar and rib fractures, a spinal cord injury and lacerations to the kidney and liver, her lawsuit stated. She also sustained a closed head injury with neurological damage and severe eye pain. The lawsuit, which includes LeCroy’s estate as an additional defendant, requests at least $171,595 in general damages along with punitive damages. The suit claims the Georgia athletic association entrusted the rented SUV to LeCroy and was aware that she had at least two “super speeder” violations among four speeding tickets prior to the crash. The athletic association said staff members were authorized to use rental vehicles for recruiting purposes only. “Under no circumstances were recruiting staff authorized to use rental cars to drive at excessive speeds while intoxicated,” it said in a statement. Bowles was on paid medical leave for a couple of months following the crash, before the athletic association placed her on unpaid leave in March, according to records obtained by the Journal-Constitution. Rob Buck, an attorney representing Bowles in her lawsuit, said the university has engaged in a “campaign of intimidation” against his client, whose job paid less than $12,000 a year. “Tory, like all other perceived liabilities to the football program, became expendable to UGA, and despite her loyalty and meager salary, has been steamrolled,” he said. The athletic association said in a statement Monday that while it wished Bowles well in her recovery, it was forced to fire her for lack of cooperation. “Applicable policies require university employees to cooperate with internal investigations,” the statement obtained by the Journal-Constitution said. “Over the course of several months, Ms. Bowles was asked — on numerous occasions — to speak with our investigators and provide information, and through her attorney, she repeatedly refused to cooperate. “As a result, we were ultimately left with no choice but to terminate her employment.” Carter, who was selected ninth overall by the Philadelphia Eagles in the NFL draft, received 12 months’ probation and a $1,000 fine in March after pleading no contest to misdemeanor charges of reckless driving and racing. McClendon was a fifth-round pick by the Los Angeles Rams. ___ AP college football: https://apnews.com/hub/college-football and https://apnews.com/hub/ap-top-25-college-football-poll Copyright 2023 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","pubDate":"2023-08-08 14:42:12","image_url":"https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/08/64d25585308463.86341935.jpeg?w=480","source_id":"nwahomepage","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Max Verstappen advantage in danger as F1 plans major rule change which would hit Red Bull","link":"https://www.mirror.co.uk/sport/formula-1/drs-qualifying-red-bull-verstappen-30657227","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Daniel Moxon)"],"video_url":null,"description":"Red Bull have been a long way ahead of anyone else on the grid this season in terms of car competitiveness, but their qualifying pace could take a hit if a planned change is approved","content":"Formula 1 chiefs could outlaw the use of DRS in qualifying – a move which could curb one of Red Bull's biggest advantages. Currently, drivers are allowed to use their drag reduction systems in the specified zones when on a flying lap. The only exception is when DRS has been disabled by race control such as in wet weather conditions. It's something which gives Red Bull an extra helping hand over their rivals. Their car design makes the DRS more powerful than those on the cars fielded by any of their rivals, providing extra speed on those longer straights where the system is permitted. But that advantage could be set to disappear. German outlet Auto Motor und Sport reports that the sport's bosses could remove the use of DRS in qualifying altogether. Max Verstappen worried F1 will \"become like NASCAR\" and criticises planned rule change F1 Grand Prix chiefs consider major change which would be bad news for UK fans The system was introduced to aid with overtaking and help make the racing action more exciting. Of course, in qualifying, overtaking is not the name of the game and so its primary function is unnecessary in those sessions. The use of DRS has helped Red Bull's qualifying performances this season. As dominants as the RB19s have been in every single race, their rivals have been much closer in terms of one-lap pace with Mercedes and Ferrari both having out-qualified Max Verstappen once each so far this season. That primarily, is because Red Bull prefer to set their cars up with race pace in mind rather than over one-lap. They take the pain of being slowed in qualifying so they can blitz the competition when the points are handed out. Watch the new Premier League season Watch all the action of the 2023/2024 Premier League season The new football season is nearly upon us and with 500 live games to watch, as well access to C ricket, Golf, F1, Boxing, NFL and the NBA across eight dedicated channels, Sky Sports is the only way to watch all the action. Get Sky Sports from £22 a month Sky Get it here Last month's Belgian Grand Prix offered a demonstration of how much the DRS benefits the Red Bulls. They gained around 20kph of speed when the system was enable compared to when it was not during a wetter session, while McLaren and Mercedes founds only an extra 15kph and 13kph respectively. The use of DRS in qualifying has helped them to still secure pole positions at most races this year. If F1 chiefs were to outlaw its use, then Verstappen and Sergio Perez might find they are starting from the front grid slot less often. Not that it really matters for the Dutchman this season. He has already won races from ninth and sixth on the grid in 2023 and has the pace in hand on a Sunday to probably even manage better than that if needed.","pubDate":"2023-08-08 14:37:34","image_url":"https://i2-prod.mirror.co.uk/incoming/article30529774.ece/ALTERNATES/s615/0_Hungary-F1-GP-Auto-Racing-23203559582446.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"FIFPRO to assist Super Falcons get their allowances from NFF","link":"https://guardian.ng/sport/fifpro-to-assist-super-falcons-get-their-allowances-from-nff/","keywords":["Football","Sport","FIFPro","NFF","Nigeria","Super Falcons"],"creator":["Dennis Erezi"],"video_url":null,"description":"The International Federation of Professional Footballers (FIFPRO) has pledged to help the Super Falcons to get all the money they are being owed by the Nigerian Football Federation (NFF). FIFPRO issued a statement to this effect on Tuesday, saying it will swing into action on behalf of Nigeria women's senior national team. \"Following the Nigeria […] The post FIFPRO to assist Super Falcons get their allowances from NFF appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"The International Federation of Professional Footballers (FIFPRO) has pledged to help the Super Falcons to get all the money they are being owed by the Nigerian Football Federation (NFF). FIFPRO issued a statement to this effect on Tuesday, saying it will swing into action on behalf of Nigeria women’s senior national team. “Following the Nigeria women’s national team’s elimination from the 2023 FIFA Women’s World Cup, FIFPRO can confirm it is assisting players in a disagreement with the Nigeria Football Federation concerning bonus payments, camp allowances and expenses, some of which date back to 2021,” it wrote. FIFPRO said that during the ongoing Women’s World Cup in Australia and New Zealand, the Nigerian players expressed the desire to remain focused on their performance without making public statements or facing other distractions. It further stated that the Super Falcons, however, believe that it is now time for the NFF to honour their commitments and pay the outstanding monies. According to FIFPRO, the team is extremely frustrated that they have had to pursue the NFF for these payments before and during the tournament and may have to continue doing so afterwards. “It is regrettable that players needed to challenge their own federation at such an important time in their careers,” FIFPRO added. “FIFPRO will continue to work with the players to ensure their contractual rights are honoured and the outstanding payments are settled.” Meanwhile, Arsenal legend, Ian Wright, in July told the NFF to pay the Super Falcons whatever money is being owed the players. Wright said this following the Super Falcons’ 3-2 win over Australia in their second group match of the FIFA Women’s World Cup. The Super Falcons’ performance was against many odds due to the events that took place before the tournament. Super Falcons coach, Randy Waldrum had a row with the NFF before the tournament with the American gaffer accusing Nigeria’s football governing body of owing him, his staff, and the players a backlog of wages and allowances. Waldrum accused the NFF of interference in his job over the selection of players. He revealed that his backup goalkeeper Tochukwu Oluehi was banned from the team after she demanded payment of the players’ bonus. He said the ban was not lifted until the player was made to write a letter of apology. Waldrum also alleged that the NFF retaliated by asking him not to take his assistant to Australia. But NFF spokesman Ademola Olajire counter-accused the American, alleging the coach wanted the federation to waste its meagre resources. Follow Us","pubDate":"2023-08-08 14:31:31","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"Arsenal agree deal to signal Brentford goalkeeper David Raya","link":"https://www.businesslend.com/sports/arsenal-agree-deal-to-sign-brentford-goalkeeper-david-raya/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox free of charge Sign as much as Miguel’s Delaney’s free weekly publication Arsenal have agreed a deal to signal Brentford goalkeeper David Raya. The PA information company understands a payment of £30million has been agreed for the 27-year-old Spaniard, who’s [...] The post Arsenal agree deal to signal Brentford goalkeeper David Raya appeared first on BusinessLend.","content":"Arsenal have agreed a deal to signal Brentford goalkeeper David Raya. The PA information company understands a payment of £30million has been agreed for the 27-year-old Spaniard, who’s reported to be signing a five-year contract. Raya will present competitors for established primary Aaron Ramsdale and the England worldwide welcomes it. “Bring it on. Nothing comes easy in football. At the same time you need to move along and adapt as well,” Ramsdale informed ITV Sport. “I’ve done it to other people when I’ve moved clubs so I’m not going to be thinking that it’s never going to happen to me. “If it happens, it happens and then we’ll fight and we’ll make each other the best version of ourselves because that’s what the manager is telling us as well. “And I’m sure whoever plays, me or whoever comes in, the goalkeeping union – people laugh at it but it’s a real thing – (means) your individual disappointment will go away. “You will put the team first and you’ll put that goalkeeper first as well.” Raya’s arrival may also sign the departure of United States goalkeeper Matt Turner to Nottingham Forest in a deal which may very well be price as much as £10m. Bans for racism ought to match these for betting offences – Anton Ferdinand","pubDate":"2023-08-08 17:49:24","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Packers’ AJ Dillon eager to rebound after busy offseason in which he wrote a book and became a dad","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/08/packers-aj-dillon-eager-to-rebound-after-busy-offseason-in-which-he-wrote-a-book-and-became-a-dad","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s […]","content":"GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s book he wrote in the offseason. Read this article for free: Already have an account? To continue reading, please subscribe: * GREEN BAY, Wis. (AP) — Green Bay Packers running back AJ Dillon’s goal as he enters the final year of his contract is evident from the title of the children’s book he wrote in the offseason. “Quadzilla Finds His Footing.” Dillon, nicknamed “Quadzilla” because of his enormous quads that were measured at 34 inches last year, is set to become a free agent after this season if he and the Packers don’t work out an extension. Dillon wants to bounce back after his production took slight dips last season. “I think I just really need to play just a little bit more — it’s hard to put a word on it — but like passionate,” Dillon said. “I think I need to go out there and just play a little bit more reckless, so not trying to play perfect, not trying to play perfect football. Nobody does. Just kind of go out there and for a lack of words, kind of make defenses feel me.” Then he elaborated on what he meant. “Even though we might be running and there’s only 4 yards here to get, make it a hard 4 yards,” Dillon said. “Make sure the next time running the ball, those defenders feel that, they think about it next time, and just kind of deliver the blow a little bit more.” He wants to stay in Green Bay, where he has made a home, started a family and emerged as one of the Packers’ most popular players. He received a key to Wisconsin’s Door County after repeatedly singing the praises of the peninsula along the Lake Michigan shoreline that’s about an hour’s drive from Green Bay. Dillon also is active on social media, which sparked one of his latest ventures. After he suggested that he’d write a children’s book, the positive feedback he received caused him to go ahead and do it. Quadzilla, his book’s protagonist, is a dinosaur who struggles to do some of his monster friends’ favorite activities before eventually succeeding in football. “We kept everything in house,” Dillon said. “We got a Milwaukee publisher, a Milwaukee illustrator and it was all Wisconsin central. It was a lot of fun doing it and putting it together. It was a goal to get it done before camp, and we did that.” Dillon savors the feedback he’s received, both from his own mother and from the children and parents who have read the book. “My mom’s a teacher,” said Dillon, who grew up reading Greek mythology and the novels of Rick Riordan. “She’s now an assistant principal back in Connecticut in my hometown. That’s something that was always big in our household. When I told her I was writing a book and actually went forward with it, she got very emotional. “I didn’t really realize until I did some of these book readings and kind of seeing the kids really listening and hanging on to every single word.” Writing that book was part of a busy offseason for Dillon. Dillon and his wife, Gabrielle, got married last year in Door County. They welcomed a son, Trey, on May 2. That also happened to be Dillon’s 25th birthday. During a year when he was adjusting to fatherhood and making sure his book got finished, Dillon still devoted plenty of time to football. The trade of four-time MVP quarterback Aaron Rodgers means the Packers may have to lean more heavily on the running back tandem of Aaron Jones and Dillon. Dillon rushed for 770 yards, gained 4.1 yards per carry and caught 28 passes for 206 yards last season. A year earlier, he rushed for 803 yards, gained 4.3 yards per carry and caught 34 passes for 313 yards. When he had free time this offseason, Dillon occasionally watched tapes of his highlights at Boston College, where he rushed for 4,382 yards over three seasons. Dillon wants to have the same attitude he had then. “I’m not satisfied with really how I performed last year,” Dillon said. “Let’s look back at when I have been really successful and how I approached the game and, yeah, looking back a little bit, looking back at those highlights, going back to what was my mindset when I was in college when I was dominating the ACC, what was that like and trying to just get to that mindset.” Dillon’s teammates have noticed a change. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. “He’s more focused,” Jones said. “He knows the playbook inside and out, so now he can play fast. But just his mental approach to the game, spending more time studying in that playbook so he can play fast and just homing in on the small details and then just him being confident in everything he does.” That includes being assured enough to write a children’s book and get it published. The benefits of that offseason project are apparent every time parents tell him how much their child enjoyed his book. “The fact that some of those kids are excited to go read, that’s a big deal,” Dillon said. “Coming from an education household, my mom being a teacher, I definitely understand how hard it is to get some kids to read. If we can put something in front of them that they want to read, it’s definitely nice to be able to do my part.” ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-08 17:24:05","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off","link":"https://www.dailymail.co.uk/sport/football/article-12385525/Gary-Neville-Jamie-Carragher-Premier-League-sixes-order-ex-Man-United-man-backs-Arsenal-win-league-warns-former-remain-long-way-off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Gary Neville and Jamie Carragher have come to a disagreement on who they think will win the Premier League title as they named their top sixes for the season.","content":"Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off The Premier League season gets going when Man City play Burnley on Friday Gary Neville has backed Arsenal for the title, though Jamie Carragher disagrees The ex-Man United star though believes his former side remain some way off By Kieran Lynch For Mailonline Updated: 12:04 EDT, 8 August 2023 e-mail 6 View comments Gary Neville and Jamie Carragher have come to a disagreement on who they think will win the Premier League title as they named their top sixes for the season. Manchester City go into the new campaign looking for a fourth consecutive league title, after pipping Arsenal to the trophy by just five points last term. Mikel Arteta's side have strengthened heavily this summer with the additions of Declan Rice, Kai Havertz and Jurrien Timber, as they look to go one better and end a 20-year wait since they last lifted the league title. The likes of Manchester United, Chelsea and Liverpool will also be hoping to close the gap and mount a challenge, with each of the three clubs spending big money this summer. However, Sky Sports pundits Neville and Carragher said on The Overlap that they feel the title is again going to come down to a fight involving City and Arsenal. Gary Neville and Jamie Carragher came to a disagreement on this season's top six Neville believes Arsenal will win the Premier League title, pointing out that no team has won the trophy four seasons in a row which is what Man City will be pushing for this season Jamie Carragher though feels Manchester City will again beat Arsenal to title glory this season Despite earlier in the show stating City would win the title, Neville eventually decided on Arsenal, due to no team in Premier League history winning the trophy in four successive years. He said: 'Just because of the three thing and never winning the fourth I am going to go with Arsenal to win the league. I'm going for Manchester City second, Man United, Liverpool, Chelsea and Aston Villa.' The Manchester United legend then explained to the fans in attendance that he felt Newcastle would slip out because of their Champions League involvement, and didn't know where Tottenham stood due to the uncertainty over Harry Kane amid Bayern Munich's interest. Carragher meanwhile had confidence that City would beat Arsenal to the title once again, and suggested his former side Liverpool would edge out United for third. He said: 'I'm going for Manchester City, then Arsenal, Liverpool, Manchester United, Chelsea and Tottenham.' Arsenal take momentum into the new season after beating Manchester City in Sunday's Community Shield on penalties. Neville claimed that Arsenal couldn't have done any more to close the gap, and given his rivalry with the Gunners as a player, is concerned they will clinch their first league title since the famous 2003-04 Invincibles team. He said: 'I don't think Arsenal could've done any more to close the gap (to Man City). Carragher, unsurprisingly, went with Liverpool to finish ahead of Manchester United in third Neville placed Man United above Liverpool, but felt that both sides and Chelsea would remain some way off in the title fight The most-eye catching pick from either man was perhaps Neville's decision to place Aston Villa in sixth 'They've shown real intent with the signings that they’ve made – my concern is that I look at and think they actually could win the league. They obviously fell short last season, but with the signings they’ve made I think they’re going to be better. 'Chelsea will be better with their new manager – and they couldn’t get any worse! I don’t look at Liverpool at the moment and think they’re going to be challenging for the league – and the same with Manchester United and what they’ve done so far. 'Unless United, Chelsea or Liverpool do something miraculous in the next few months of the transfer window, Arsenal are the only team that could challenge City at this point in time.' Neville meanwhile also argued that City's treble success last season will mean there will be the biggest expectations on them this time around. Arteta's Arsenal side drew first blood on Guardiola this season in the Community Shield He said: 'I went to the FA Cup Final, but after that was over, I thought Manchester City would do it [win the treble]. I thought Inter Milan in the Champions League final did really well, but it doesn’t surprise me with what Pep Guardiola has achieved in his managerial career that he’s gone on and done it. 'It was going to be him, if anyone was going to do it, and they’re an exceptional team – we will see how they react this season. 'We [Manchester United] won the league the year after we won the treble, but there was a dip. There was an expectation that we felt as though we could go and win the Champions League again, and we couldn’t get to those heights again for quite a few years. It’ll be interesting to see how City take on this year. 'The transfer window has been OK for them – but we’ll see what happens and whether they can climb that mountain again this year.' The full video of The Overlap Fan Debate is available to watch on YouTube . Share or comment on this article: Gary Neville and Jamie Carragher name their Premier League top sixes in order... as ex-Man United man backs Arsenal to win the league and warns his former side remain a long way off e-mail Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-08 15:30:48","image_url":"https://i.dailymail.co.uk/1s/2023/08/08/16/74089023-0-image-a-115_1691508486711.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"EA Sports release update to add hijab to history-making Moroccan star in FIFA 23","link":"https://www.mirror.co.uk/sport/football/news/morocco-benzina-fifa-hijab-update-30657381","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Megan Feringa)"],"video_url":null,"description":"The 25-year-old wrote her name in the history books when she became the first player in history to wear a hijab at a senior-level major tournament during this summer's Women's World Cup","content":"Moroccan star Nouhaila Benzina wrote her name in football's history books during this summer's Women's World Cup, and the defender will now be immortalised for it within football's biggest gaming franchise. The 25-year-old became the first footballer in history to don a hijab at a senior-level major tournament when she started Morocco's second group stage match against Korea Republic. Benzina helped her side to a 1-0 victory that eventually landed Morocco an historic spot in the tournament's knockout stages at the expense of two-time world champions Germany . Morocco's first-ever World Cup victory coincided with the sight of Benzina wearing her hijab in what represented watershed territory for athletes of Muslim faith, who have historically struggled to freely express their faith in competitive sports. FA to appeal to FIFA after Lauren James apologises for Women's World Cup red card Lauren James breaks silence after red card as England star apologises in World Cup vow Indeed, less than three weeks before the start of the summer's showpiece event, France’s top administrative court upheld the French football federation's (FFF) ban on players wearing hijabs during football matches, deeming the regulation “suitable and appropriate.” In 2007, FIFA issued a ban on all hijabs, with the belief that the garment was a “safety risk” to players. Seven years later, the governing body lifted the ban, though numerous countries and federations, most notably the FFF, still exclude hijabi-wearing players from participating in the sport. Benzina's visibility on the world stage, however, has paved the way for major societal shifts through the women's game. And video game behemoth EA Sports has taken up the call and announced a patch update to FIFA 23 that will see Benzina's in-game avatar include her hijab. Previously, Benzina's hijab was not available in the game's World Cup mode, but EA Sports applied an update hours before Morocco's last-16 clash with France. Nouhaila Benzina and Sofia Bouftini of Morocco celebrate advancing to the knock out stage ( Image: Photo by Paul Kane/Getty Images) While the in-game addition is a minor technical alteration, the wider impact is inarguably immense, with an entire demographic of fans and players previously disregarded able to feel represented. It is not the first bout of history making for Benzina, who touts an impressive CV of historic landmarks. The defender helped the Atlas Lions to become the first North African and Arab country to participate in the final of a continental tournament, WAFCON, after defeating African powerhouse and 11-time defending champions Nigeria in the semi-final. The victory secured Morocco the title of the first Middle Eastern and North African region to qualify for the Women’s World Cup. After being drawn into a daunting group with favourites Germany, Columbia and Korea Republic, Benzina and co. shocked the world as they emerged into the knockout stages in lieu of the Euro2022 finalists . And while Morocco were unable to advance through the knockout stages following a 4-0 defeat to France, the legacy left behind by the women's national team and Benzina is nothing short of prodigious.","pubDate":"2023-08-08 15:28:10","image_url":"https://i2-prod.mirror.co.uk/incoming/article30657305.ece/ALTERNATES/s615/0_GettyImages-1589719283.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Livingston unveil Teto but face transfer twist...","link":"https://www.snl24.com/KickOff/SANews/SA-Players-Abroad/livingston-unveil-teto-but-face-transfer-twist-20230808","keywords":null,"creator":null,"video_url":null,"description":"Livingston have officially unveiled local talent Aphelele Teto as their latest signing but a visa issue is set to delay the 20-year-old making his debut in the Scottish Premier League.","content":"Teto completed a dream move to Livingston at the start of July after having impressed head coach David Martindale in December last year in Turkey where both Livingston and TS Galaxy had held their respective mid-season camps. | However, Livingston were unable to secure a work permit for Teto and will have a chance to re-apply in January. This likely means the former TS Galaxy talent could be sent out on loan or back to the DStv Premiership. \"I'm writing this statement with a mixture of emotions - delighted that we have secured the signing of Aphelele Teto, but disappointed we never got the governing body endorsement for the player to receive his work permit,\" Martindale said in a statement released by the club. \"As a club, there are a few avenues we can explore, such as loaning the player back to his previous club, TS Galaxy FC, or another top-tier side in South Africa, or indeed another African country where Teto will be eligible to play. \"For now, though, I'm delighted to secure his signing and, although he is now officially a Livingston FC player, fans are going to have to wait a little while longer before they can see him make his competitive debut for the first team.\" Teto came through the Carlos Academy Youth Development before joining TS Galaxy's DStv Diski Challenge where he was then promoted to the first team in March 2022. The versatile attacker is one of the brightest prospects in South African football. Livingston will take on Rangers in the Scottish Premiership season on Saturday. Kick-off is at 16:00 (SA time).","pubDate":"2023-08-08 15:25:20","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Detroit Lions Announce First Preseason Game Alternate Broadcast With Kiswe","link":"https://www.sportsvideo.org/2023/08/08/detroit-lions-announce-first-preseason-game-alternate-broadcast-with-kiswe/","keywords":["Digital","Detroit Lions","Kiswe","Lions TV Network"],"creator":["SVG Staff"],"video_url":null,"description":"The Detroit Lions announces that they will offer an alternate broadcast of their first preseason game against the New York Giants at Ford Field on August 11, 2023 (kickoff 7 PM; main broadcasts on the Lions TV Network and Lions Radio Network). The alternate broadcast, using Kiswe’s cloud production, will be hosted by Peter Schrager and will include live commentary and interviews from several guests. Fans can watch the alternate broadcast via www.detroitlions.com or on the Detroit Lions Mobile App. \"We are thrilled to produce our first ever Detroit Lions alternate broadcast with Kiswe,\" says Detroit Lions Director of Broadcasting Carl Moll. \"This is a great opportunity to engage fans in a new and exciting way and we can't wait to see the final product as well as the reaction.\" Guests scheduled to appear on the alternate game broadcast are: Brad Holmes – Detroit Lions Executive Vice President and General Manager Chris Spielman – Detroit Lions Special Assistant to the President/CEO and Chairperson Gary Danielson – Detroit Lions QB (1976-84), current lead college football analyst for CBS Sports (Big Ten) Glover Quin – Detroit Lions S (2013-18) Golden Tate – Detroit Lions WR (2014-18) Jalen Rose – 13-year NBA career, former University of Michigan basketball standout and Detroit native Kirk Gibson – Detroit Tigers outfielder (1979-87), Michigan State University football & baseball All-American and Pontiac, Mich. native Darren McCarty - Detroit Red Wings RW (1993-2004, 2007-09) and four-time Stanley Cup Champion Dave Birkett - Detroit Lions beat writer for the Detroit Free Press and Pro Football Hall of Fame voter Stacey Dales - NFL Network reporter and WNBA player (2002-07) \"We are excited to provide the Detroit Lions with our industry leading cloud-based production solution,\" says Kiswe CEO Glenn Booth. \"Our partnership will enable the Detroit Lions to efficiently create alternate broadcasts using remote production and provide fans with engaging viewing experiences.\" Peter Schrager hosts Good Morning Football on NFL Network and is a national reporter for FOX Sports 1, a senior NFL writer for FOXSports.com and an NFL sideline reporter for FOX Sports. Outside of his work in the NFL, Schrager has covered the Olympics and the NBA for FOX and has been a frequent contributor to GQ.","content":"Detroit Lions Announce First Preseason Game Alternate Broadcast With Kiswe","pubDate":"2023-08-08 14:55:16","image_url":null,"source_id":"sportsvideo","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Dynamos sack head coach Herbert Maruwa over ‘inconsistent’ results","link":"https://nehandaradio.com/2023/08/08/dynamos-sack-head-coach-herbert-maruwa-over-inconsistent-results/","keywords":["Featured","Football","News","Sports","Dynamos Football Club","Herbert Maruwa","Murape Murape","Richard Chihoro"],"creator":["Tafadzwa Chigandiwa"],"video_url":null,"description":"After only seven months on the job, Harare giants Dynamos Football Club have reportedly sacked head coach Herbert Maruwa citing what they called 'inconsistent' results. The post Dynamos sack head coach Herbert Maruwa over ‘inconsistent’ results appeared first on Nehanda Radio.","content":"This comes barely a week after reports suggested the ex-Black Rhinos gaffer was handed a five game ultimatum to collect maximum points in all matches. Maruwa was ordered to win all the five matches, starting with Sunday’s game against Hwange Football Club at Barbourfields Stadium in Bulawayo. The Glamour Boys went on to draw 0-0 with Chipangano, after having thumped Yadah FC 5-1 in their previous match. The 0-0 stalemate meant Jompano, as Maruwa is nicknamed, dropped points and failed to meet the required target. It was not the first time that Maruwa was given an ultimatum by the ‘hard to please’ and ‘overzealous’ DeMbare leadership led by Moses Maunganidze who is the club’s chairman. Initially, the youthful coach was given a two match ultimatum by the DeMbare leadership in the winter (June). He survived the chop after defeating ZPC Kariba and Black Rhinos. Jompano who replaced Tonderai Ndiraya in December 2022, leaves Dynamos perched on fourth position. The Glamour Boys are nine points adrift of log leaders and rivals Highlanders after 18 matches. Meanwhile, according to multiple reports, DeMbare have also suspended the club’s legend Murape Murape together with welfare manager Richard Chihoro for alleged ‘indiscipline’. Murape, the former DeMbare skipper was the second assistant to Maruwa.","pubDate":"2023-08-08 14:53:14","image_url":null,"source_id":"nehandaradio","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Georgia fires football staffer who survived fatal crash, less than a month after lawsuit","link":"https://www.nwahomepage.com/news/national-sports/ap-georgia-fires-football-staffer-who-survived-fatal-crash-less-than-a-month-after-lawsuit/","keywords":["National Sports","AP Sports"],"creator":["AP"],"video_url":null,"description":"ATHENS, Ga. (AP) — Georgia has fired the football recruiting staffer who survived a January crash that killed player Devin Willock and another recruiting staffer, less than a month after she filed a lawsuit against the university's athletic association. The school issued a statement saying Victoria “Tori” Bowles was dismissed because she refused to cooperate [...]","content":"by: Posted: Updated: ATHENS, Ga. (AP) — Georgia has fired the football recruiting staffer who survived a January crash that killed player Devin Willock and another recruiting staffer, less than a month after she filed a lawsuit against the university’s athletic association. The school issued a statement saying Victoria “Tori” Bowles was dismissed because she refused to cooperate with an internal investigation into the crash. Her attorneys claim she is being retaliated against for filing the lawsuit, which also names former Georgia player and first-round NFL draft pick Jalen Carter. The Atlanta Journal-Constitution first reported Bowles’ firing. The Jan. 15 crash, which occurred just hours after a parade celebrating Georgia’s second straight national championship, killed the 20-year-old Willock and the driver of the Ford Expedition, 24-year-old Chandler LeCroy. Police said LeCroy had a blood-alcohol level more than twice the legal limit and was racing Carter at about 104 mph when the SUV swerved off the road, struck two utility poles and a tree before slamming into another tree on the driver’s side, where both LeCroy and Willock were sitting. Another Georgia player, Warren McClendon, sustained only minor injuries. But Bowles, who was sitting in the backseat next to Willock, sustained serious injuries including lumbar and rib fractures, a spinal cord injury and lacerations to the kidney and liver, her lawsuit stated. She also sustained a closed head injury with neurological damage and severe eye pain. The lawsuit, which includes LeCroy’s estate as an additional defendant, requests at least $171,595 in general damages along with punitive damages. The suit claims the Georgia athletic association entrusted the rented SUV to LeCroy and was aware that she had at least two “super speeder” violations among four speeding tickets prior to the crash. The athletic association said staff members were authorized to use rental vehicles for recruiting purposes only. “Under no circumstances were recruiting staff authorized to use rental cars to drive at excessive speeds while intoxicated,” it said in a statement. Bowles was on paid medical leave for a couple of months following the crash, before the athletic association placed her on unpaid leave in March, according to records obtained by the Journal-Constitution. Rob Buck, an attorney representing Bowles in her lawsuit, said the university has engaged in a “campaign of intimidation” against his client, whose job paid less than $12,000 a year. “Tory, like all other perceived liabilities to the football program, became expendable to UGA, and despite her loyalty and meager salary, has been steamrolled,” he said. The athletic association said in a statement Monday that while it wished Bowles well in her recovery, it was forced to fire her for lack of cooperation. “Applicable policies require university employees to cooperate with internal investigations,” the statement obtained by the Journal-Constitution said. “Over the course of several months, Ms. Bowles was asked — on numerous occasions — to speak with our investigators and provide information, and through her attorney, she repeatedly refused to cooperate. “As a result, we were ultimately left with no choice but to terminate her employment.” Carter, who was selected ninth overall by the Philadelphia Eagles in the NFL draft, received 12 months’ probation and a $1,000 fine in March after pleading no contest to misdemeanor charges of reckless driving and racing. McClendon was a fifth-round pick by the Los Angeles Rams. ___ AP college football: https://apnews.com/hub/college-football and https://apnews.com/hub/ap-top-25-college-football-poll Copyright 2023 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","pubDate":"2023-08-08 14:42:12","image_url":"https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/08/64d25585308463.86341935.jpeg?w=480","source_id":"nwahomepage","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Max Verstappen advantage in danger as F1 plans major rule change which would hit Red Bull","link":"https://www.mirror.co.uk/sport/formula-1/drs-qualifying-red-bull-verstappen-30657227","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Daniel Moxon)"],"video_url":null,"description":"Red Bull have been a long way ahead of anyone else on the grid this season in terms of car competitiveness, but their qualifying pace could take a hit if a planned change is approved","content":"Formula 1 chiefs could outlaw the use of DRS in qualifying – a move which could curb one of Red Bull's biggest advantages. Currently, drivers are allowed to use their drag reduction systems in the specified zones when on a flying lap. The only exception is when DRS has been disabled by race control such as in wet weather conditions. It's something which gives Red Bull an extra helping hand over their rivals. Their car design makes the DRS more powerful than those on the cars fielded by any of their rivals, providing extra speed on those longer straights where the system is permitted. But that advantage could be set to disappear. German outlet Auto Motor und Sport reports that the sport's bosses could remove the use of DRS in qualifying altogether. Max Verstappen worried F1 will \"become like NASCAR\" and criticises planned rule change F1 Grand Prix chiefs consider major change which would be bad news for UK fans The system was introduced to aid with overtaking and help make the racing action more exciting. Of course, in qualifying, overtaking is not the name of the game and so its primary function is unnecessary in those sessions. The use of DRS has helped Red Bull's qualifying performances this season. As dominants as the RB19s have been in every single race, their rivals have been much closer in terms of one-lap pace with Mercedes and Ferrari both having out-qualified Max Verstappen once each so far this season. That primarily, is because Red Bull prefer to set their cars up with race pace in mind rather than over one-lap. They take the pain of being slowed in qualifying so they can blitz the competition when the points are handed out. Watch the new Premier League season Watch all the action of the 2023/2024 Premier League season The new football season is nearly upon us and with 500 live games to watch, as well access to C ricket, Golf, F1, Boxing, NFL and the NBA across eight dedicated channels, Sky Sports is the only way to watch all the action. Get Sky Sports from £22 a month Sky Get it here Last month's Belgian Grand Prix offered a demonstration of how much the DRS benefits the Red Bulls. They gained around 20kph of speed when the system was enable compared to when it was not during a wetter session, while McLaren and Mercedes founds only an extra 15kph and 13kph respectively. The use of DRS in qualifying has helped them to still secure pole positions at most races this year. If F1 chiefs were to outlaw its use, then Verstappen and Sergio Perez might find they are starting from the front grid slot less often. Not that it really matters for the Dutchman this season. He has already won races from ninth and sixth on the grid in 2023 and has the pace in hand on a Sunday to probably even manage better than that if needed.","pubDate":"2023-08-08 14:37:34","image_url":"https://i2-prod.mirror.co.uk/incoming/article30529774.ece/ALTERNATES/s615/0_Hungary-F1-GP-Auto-Racing-23203559582446.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"FIFPRO to assist Super Falcons get their allowances from NFF","link":"https://guardian.ng/sport/fifpro-to-assist-super-falcons-get-their-allowances-from-nff/","keywords":["Football","Sport","FIFPro","NFF","Nigeria","Super Falcons"],"creator":["Dennis Erezi"],"video_url":null,"description":"The International Federation of Professional Footballers (FIFPRO) has pledged to help the Super Falcons to get all the money they are being owed by the Nigerian Football Federation (NFF). FIFPRO issued a statement to this effect on Tuesday, saying it will swing into action on behalf of Nigeria women's senior national team. \"Following the Nigeria […] The post FIFPRO to assist Super Falcons get their allowances from NFF appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"The International Federation of Professional Footballers (FIFPRO) has pledged to help the Super Falcons to get all the money they are being owed by the Nigerian Football Federation (NFF). FIFPRO issued a statement to this effect on Tuesday, saying it will swing into action on behalf of Nigeria women’s senior national team. “Following the Nigeria women’s national team’s elimination from the 2023 FIFA Women’s World Cup, FIFPRO can confirm it is assisting players in a disagreement with the Nigeria Football Federation concerning bonus payments, camp allowances and expenses, some of which date back to 2021,” it wrote. FIFPRO said that during the ongoing Women’s World Cup in Australia and New Zealand, the Nigerian players expressed the desire to remain focused on their performance without making public statements or facing other distractions. It further stated that the Super Falcons, however, believe that it is now time for the NFF to honour their commitments and pay the outstanding monies. According to FIFPRO, the team is extremely frustrated that they have had to pursue the NFF for these payments before and during the tournament and may have to continue doing so afterwards. “It is regrettable that players needed to challenge their own federation at such an important time in their careers,” FIFPRO added. “FIFPRO will continue to work with the players to ensure their contractual rights are honoured and the outstanding payments are settled.” Meanwhile, Arsenal legend, Ian Wright, in July told the NFF to pay the Super Falcons whatever money is being owed the players. Wright said this following the Super Falcons’ 3-2 win over Australia in their second group match of the FIFA Women’s World Cup. The Super Falcons’ performance was against many odds due to the events that took place before the tournament. Super Falcons coach, Randy Waldrum had a row with the NFF before the tournament with the American gaffer accusing Nigeria’s football governing body of owing him, his staff, and the players a backlog of wages and allowances. Waldrum accused the NFF of interference in his job over the selection of players. He revealed that his backup goalkeeper Tochukwu Oluehi was banned from the team after she demanded payment of the players’ bonus. He said the ban was not lifted until the player was made to write a letter of apology. Waldrum also alleged that the NFF retaliated by asking him not to take his assistant to Australia. But NFF spokesman Ademola Olajire counter-accused the American, alleging the coach wanted the federation to waste its meagre resources. Follow Us","pubDate":"2023-08-08 14:31:31","image_url":null,"source_id":"guardian","category":["sports"],"country":["nigeria"],"language":"english"}]}