{"newsArray":[{"article_id":"6fa0b180b8f0c488d95521365f1ee1d8","title":"Wonder jockey produces 'filthy ride' to win from impossible spot as fans say 'different class'","link":"https://www.dailystar.co.uk/sport/horse-racing/wonder-jockey-wins-filthy-race-31415445","keywords":["Sport"],"creator":null,"video_url":null,"description":"Horse racing fans were left in awe after witnessing prodigy jockey Billy Loughnane's stunning ride at Newcastle where he won from an 'impossible spot'","content":"fans were left hailing wonder jockey Billy Loughnane after they watched him ride to an improbably victory at on Friday afternoon. Racing in the 4.45, Loughnane, riding Spangled Mac, looked to have no hope of winning two furlongs out, with the young jockey and his horse at the back of the pack. However, the 17-year-old somehow managed to fly through the field, charging past his competitors to claim an improbably win. The teenager has enjoyed an incredible season, having recently been named as the 2023 Champion Apprentice Jockey on Champions Day at last month. And fans on social media were also left stunned by Loughnane and Spangled Mac's 'filthy ride'. One fan commented on X, formerly Twitter: \"Billy Loughnane that is simply disgusting..! How has he got Spangled Mac up there!\" A second said: \"No Words...Sensational. Billy Loughnane take a bow.\" A third wrote: \"Oh that is filthy.\" A fourth added: \"Never panicked, fantastic talent in the saddle.\" The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . A fifth said: \"A ride that should be shown to every aspiring young rider. Minimal use of the whip and brilliant fitness levels shown to coax Spangled Mac into contention under hands and heels. An incredible ride from an incredible talent.\" And a sixth added: \"He’ll go onto be the best jockey on the planet and I can’t wait for it. He’s already better than the Doyler that’s for sure.\" TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month With Loughnane being tipped to go on to have a huge successful career, it's easy to see just why fans are gravitating to supporting the teenager following his incredible 2023 season. \"It’s been crazy and to have ridden 100 winners in less than a year is pretty unreal,\" said Loughnane when asked about his crazy season. \"There’s been a few highlights, one of which was having my first winner for Godolphin on Sapphire Seas. I just got up to win by a nose which was massive for me.\"","pubDate":"2023-11-11 13:19:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415662.ece/ALTERNATES/s98/2_Spangled-Mac-incredible-win-from-behind.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"56a6bf3e1367dc651e3ba70f5f2f1f71","title":"World Cup team left with just 14 outfield players due to FIFA rule after four are banished","link":"https://www.dailystar.co.uk/sport/football/poland-u17-world-cup-players-31415538","keywords":["Sport"],"creator":null,"video_url":null,"description":"A World Cup team has been left with just 14 outfield players after four of them were sent home in disgrace with FIFA rulings barring any replacements","content":"The U17 has been hit by a serious scandal that has seen four players banished from the national camp. Poland’s preparations for the tournament have been marred after four of their players were banished from the team’s training camp after they were removed due to unsportsmanlike behaviour and violation of the regulations – having been caught with alcohol. And the four departing players - Oskar Tomczyk, Filip Rozga, Jan Labedzki, and Filip Wolski - cannot be replaced due to FIFA ruling – meaning Poland now only have 14 outfield players to select from due to the regulations regarding replacements on the submitted player list. FIFA addressed the situation regarding the axed players, saying: “As per Article 27.3 of the tournament regulations, a player listed on the final list may be replaced by a player from the provisional list only in the event of serious injury or illness up until 24 hours before the kick-off of their team’s first match.” Poland U17 coach Marcin Wlodarski admitted he felt the team's scandal was a ‘personal failure’ of his. He said: \"The players broke the rules and there was no other option but for them to leave the team. I see these boys as family, we spend a lot of time together. So I treat this as a personal failure of mine. \"We cannot let such acts slide. I believe these boys will reflect on this, understand that their actions have consequences and re-join the team one day, just not anytime soon. I've spoken with the parents and everyone is disappointed. \"Everyone worked hard to get here, but we need to condemn this, because these things cannot happen, especially not on the national team. For each of these boys, I would have cut my hand off for them and now I wouldn't have a hand.\" Poland played their opening tournament game on Saturday, falling to a 1-0 defeat against Japan, where they were able to name just six substitutes. They find themselves in one of the toughest groups in the tournament, alongside Senegal and Argentina – where all eyes will be on 15-year-old Senegal sensation .","pubDate":"2023-11-11 13:14:35","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415519.ece/ALTERNATES/s98/0_Japan-v-Poland-Group-D-FIFA-U-17-World-Cup.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1ab99200da5f47974db6e83182bcf619","title":"Erik ten Hag makes Mason Mount feelings clear and explains why he's dropped Man Utd star","link":"https://www.mirror.co.uk/sport/football/news/mason-mount-man-utd-tenhag-31415472","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alan Smith)"],"video_url":null,"description":"The England midfielder is struggling for minutes and form but under fire United boss says his view of a \"very important player\" has not changed","content":"Erik ten Hag has insisted his view of Mason Mount “hasn’t changed at all” despite the £55m midfielder’s struggles since joining Manchester United in the summer. Mount arrived from Chelsea with high expectations as Ten Hag’s first signing of the transfer window but has struggled for form and battled injury. The 24-year-old has also fallen out of the England reckoning and now appears to be restricted to appearances off the bench at Old Trafford - despite the team’s dire form. And Ten Hag, speaking before this afternoon’s visit of Luton Town, said that with other players doing well Mount must be patient before earning his spot back. Every Premier League club affected by new transfer proposal with Man Utd set to join Alejandro Garnacho labelled \"a clown\" by Copenhagen star after trying sneaky tactic again His only start in the past month has come in the EFL Cup hammering against Newcastle United and Sofyan Amrabat was sprung from the bench before him in Wednesday evening’s chaotic Champions League defeat away to Copenhagen. “He had some starts,” Ten Hag said. “Also recently, last week against Newcastle, but there are always reasons and sometimes, like the injury [at the start of the season] and other players doing well, then you have to wait for your time to play.” When Mount arrived at United Ten Hag told him, in front of the club’s media channel, that “I want you to be a very important player for this team.” But his most recent league goal came on December 27 and he last provided an assist in October of last year. Mount has also struggled significantly in the past year with a lingering pelvic issue. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here But Ten Hag is continuing to back him in the long-term and, asked if his first impression is different to his current view, the under-fire Dutchman said: “It hasn’t changed at all. But he started the season, then he got injured, so that is the worst moment for a new player to get injured because it stops the integration process and that was a setback for us all. Now we have to find his place back.” United have lost nine of their opening 17 games in all competitions and in addition to teetering on the brink in Europe they are already nine points off Manchester City in the Premier League table. Ten Hag must also plan for Luton without midfielder Casemiro, who is set to be out until January with a hamstring injury, in addition to defenders Luke Shaw and Lisandro Martinez. He has also reportedly had a row with centre half Raphael Varane, who has spent recent weeks on the substitutes’ bench. Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-11-11 12:30:20","image_url":"https://i2-prod.mirror.co.uk/incoming/article31407071.ece/ALTERNATES/s615/0_GettyImages-1771543629.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"87784e1a3172c7bb12b0d4a05f7c51fa","title":"Wolves v Tottenham: Premier League – live","link":"https://www.theguardian.com/football/live/2023/nov/11/wolves-v-tottenham-premier-league-live","keywords":["Premier League","Football","Wolverhampton Wanderers","Tottenham Hotspur","Sport"],"creator":["Barry Glendenning"],"video_url":null,"description":"Premier League updates from the 12.30pm GMT kick-offFollow Guardian sport on Instagram, Threads and YouTubeRemembering the fallen: Wolves will join the rest of the football world this weekend by paying their respects to those who have served their country. A period of silence will be observed before kick-off and bugler Lesley Jenkins, from the West Midlands Police Band, will play The Last Post, before representatives of the Armed Forces lay a wreath.Referee: Tim RobinsonReferee’s assistants: Timothy Wood and Wade SmithFourth official: Thomas BramallVAR: Paul Tierney Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 24m ago GOAL! Wolves 0-1 Tottenham Hotspur (Johnson 3) 27m ago Wolves v Tottenham Hotspur is go ... 1h ago Wolves v Tottenham Hotspur line-ups 2h ago Early team news 2h ago Premier League: Wolves v Tottenham Hotspur Show key events only Please turn on JavaScript to use this feature 1m ago 12.58 GMT 25 min: A sloppy pass from Emerson Royal gifts Wolves a throw-in near the halfway line and moments later, Pedro Porro is penalised for a foul on Toti. 3m ago 12.56 GMT 24 min: Tottenham’s high defensive line threatens to be their undoing as Wolves play the ball in behind, forcing Ben Davies into a foot race with Hwang. The visitors get away with it on this occasion. 5m ago 12.54 GMT 22 min: Porro receives treatment for what looks like a calf injury and is fit to continue for the time being at least. He’s limping quite heavily and Spurs really can’t afford to lose him. 6m ago 12.53 GMT 20 min: Pedro Porro goes down roaring in pain after being fouled by Joao Gomes. The Wolves midfielder is lucky to avoid a booking for his late challenge on the Tottenham right-back, who had given him the slip. 8m ago 12.51 GMT 19 min: Ait-Nouri gallops through the centre and pings a low ball towards Hwang, who does well to control it under pressure. The South Korean runs into traffic on the edge of the Spurs penalty area before he can pull the trigger. 10m ago 12.49 GMT 18 min: Wolves win two corners in quick succession but are unable to clear the first Tottenham defender with either delivery. 11m ago 12.48 GMT 16 min: Yves Bissouma cedes possession to Lemina in midfield and Wolves surge forward again. Hwang Hee-chan pulls the ball back towards Bellegarde after getting the better of Dier down by the byline, but the Frenchman has his back to goal and is unable to shoot on the turn. 13m ago 12.46 GMT 14 min: Wolves have got a firm foothold in the game after that very early setback and are now giving Tottenham plenty to think about. It’s shaping up to be a good game. 14m ago 12.45 GMT 13 min: There’s a break in play as Mario Lemina receives treatment from the Wolves physios. He seems to be OK. 16m ago 12.43 GMT 10 min: Showing no ill-effects from his blow to the head, Ben Davies does brilliantly to dive in and block a shot on goal from Ait-Nouri after Eric Dier had lost the ball in midfield and Wolves had broken upfield at speed. 18m ago 12.41 GMT 9 min: Jeanricner Bellegarde plays the ball out wide to Joao Gomes, who crosses. Ben Davies goes down after the ball is blasted into the side of his head by Toti Gomes and referee Tim Robinson stops play, provoking the ire of the home crowd. Updated at 12.44 GMT 20m ago 12.40 GMT 7 min: Their confidence buoyed, Tottenham continue to dominate these early stages. Kulusevki takes on and beats Rayan Ait-Nouri on the right flank and sends a cross into the Wolves penalty area. It’s blocked and the home side clear. 21m ago 12.38 GMT 4 min: It’s a wonderful start for Tottenham, their opener orchestrated by excellent work by Pedro Porro. The ball was pinged his way by Dejan Kulusevski and he looked to have slipped but we’re going to give him the benefit of the doubt and say it was a clever dummy. Porro squared the ball for Johnson, who was quickest to react on the edge of the six-yard box and poke home. 24m ago 12.35 GMT GOAL! Wolves 0-1 Tottenham Hotspur (Johnson 3) Tottenham take the lead! Brennan Johnson scores his first goal for Spurs, slotting the ball home from six yards after getting on the end of a squared ball sent his way by Pedro Porro. Brennan Johnson steals in to give Spurs an early lead! Photograph: Jason Cairnduff/Action Images/Reuters Updated at 12.38 GMT 25m ago 12.34 GMT 2 min: Tottenham goalkeeper Guglielmo Vicario gets an early touch and Tottenham play the ball out from the back. 27m ago 12.32 GMT Wolves v Tottenham Hotspur is go ... 1 min: With the last of the perfectly observed pre-match formalities over, Wolves get the ball rolling in what could be a fascinating game. It’s played straight back to goalkeeper Jose Sa. Updated at 12.32 GMT 32m ago 12.27 GMT Not long now: With the monster riffola of Led Zeppelin blaring over the Tannoy, the teams march out on to the Molineux pitch and line up either side of referee Tim Robinson and his team of match officials. Kick-off is just a few minutes away but first there’ll be a moment’s reflection for remembrance day. Updated at 12.30 GMT 42m ago 12.18 GMT Joao Gomes and his Wolves teammates warm up ahead of kick-off. Photograph: Jack Thomas/WWFC/Wolves/Getty Images 54m ago 12.05 GMT In an innovation that seems unlikely to catch on, TNT Sports have kitted Brennan Johnson and Max Kilman out with bodycams for their pre-match warm-ups, so viewers can get an unprecedented insight into what it’s like for a professional footballer to do shuttle runs and keepy-uppies. Photograph: Ryan Browne/Shutterstock Updated at 12.06 GMT 1h ago 12.00 GMT Remembering the fallen: Wolves will join the rest of the football world this weekend by paying their respects to those who have served their country. A period of silence will be observed before kick-off and bugler Lesley Jenkins, from the West Midlands Police Band, will play The Last Post, before representatives of the Armed Forces lay a wreath. 1h ago 11.54 GMT Today’s match officials Referee: Tim Robinson Referee’s assistants: Timothy Wood and Wade Smith Fourth official: Thomas Bramall VAR: Paul Tierney Referee Tim Robinson leads the team of match officials for today’s match at Molineux. Photograph: Jan Kruger/Getty Images 1h ago 11.44 GMT Those teams: Gary O’Neil makes two changes to the side that lost against Sheffield United last time out Jean-Ricner Bellegarde and Joao Gomes come into the side, with Tommy Doyle and Sasa Kalajdzic dropping to the substitutes’ bench. Ange Postecoglou has been forced to make four changes to the side that lost against Chelsea on Monday night. Eric Dier comes in at centre-half and will play alongside Ben Davies or Emerson Royal. Pierre-Emile Hojbjerg also starts alongside Yves Bissouma in midfield. Tottenham’s bench looks a little threadbare but features Oliver Skipp, Giovani Lo Celso and Rodrigo Bentancur, among others. Ange Postecoglou has made four changes to the Tottenham Hotspur side that lost against Chelsea on Monday night. Photograph: Tom Jenkins/The Guardian Updated at 12.24 GMT 1h ago 11.34 GMT Matchday merchandise on sale outside Molineux. Photograph: Ryan Browne/Shutterstock 1h ago 11.33 GMT Wolves v Tottenham Hotspur line-ups Wolves: Sa; Semedo, Dawson, Kilman, Toti; Bellegarde, Lemina, Gomes, Ait-Nouri; Hwang, Cunha. Subs: Bentley, Doherty, Traore, Silva, Bueno, Kalajdzic, Jonny, Doyle, Sarabia. Tottenhamn Hotspur: Vicario; Porro, Royal, Dier, Davies; Sarr, Hojbjerg, Bissouma; Kulusevski, Son, Johnson. Subs: Forster, Skipp, Gil, Lo Celso, Bentancur, Phillips, Veliz, Donley, Dorrington. 2h ago 11.29 GMT ‘A very special game’: South Korea gears up for Hwang v Son showdown Read more 2h ago 11.24 GMT Early team news Tottenham lost James Maddison and Micky van de Ven to injury on Monday night and both hugely influential summer signings are expected to be out until the New Year. They join Manor Solomon, Ivan Perisic, Ryan Sessegnon and Alfie Whiteman in the treatment room, while Richarlison is also set to spend a month or so on the sidelines after undergoing surgery on his groin. Cristian Romero and Destiny Odogie are also absent this afternoon through suspension after getting sent off against Chelsea. In better news for Spurs, Ben Davies is fit after recovering from an ankle injury and is likely to come straight back into the first team. Wolves have far fewer personnel problems but Pedro Neto remains absent. Defensive midfielder Joe Hodge is also out with a shoulder injury but Hugo Bueno is available again after recovering from a hamstring issue. ‘Worse than we thought’: Postecoglou says injured Maddison out till January Read more James Maddison lies on the Tottenham Hotspur Stadium pitch after suffering the ankle injury that will keep him out until the New Year. Photograph: Tony Obrien/Reuters 2h ago 11.24 GMT Premier League: Wolves v Tottenham Hotspur With an international break looming, Wolves host Spurs in the opening Premier League game of the weekend. Following Monday night’s chaotic defeat at the hands of Chelsea, Ange Postecoglou brings a severely depleted squad to Molineux, his options seveely limited by injury and suspension. Wolves lost against Sheffield United last time out but were somewhat unfortunate to do so, going down to a late, late Ollie Norwood penalty that should not have been awarded. Unbeaten in four prior to that defeat, Gary O’Neil’s side will be hopeful of taking all three points at home against their depleted visitors. Kick-off is at 12.30pm (GMT) but stay tuned in the meantime for team news and build-up. Explore more on these topics Premier League Premier League live Wolverhampton Wanderers Tottenham Hotspur Reuse this content","pubDate":"2023-11-11 12:24:50","image_url":"https://i.guim.co.uk/img/media/e327658f635f19e4610d91545dc2366f835bd063/0_206_4425_2655/master/4425.jpg?width=460&quality=85&auto=format&fit=max&s=567e0b906fce511409f79014e6cc14aa","source_id":"theguardian","source_priority":106,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"1c271c2d27392f3e0a14d23d128ef790","title":"Premier League referees' chiefs advertise new VAR job after Mikel Arteta \"disgrace\" rant","link":"https://www.mirror.co.uk/sport/football/news/premier-league-var-arteta-arsenal-31415061","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Nathan Ridley)"],"video_url":null,"description":"The future of VAR in the Premier League continues to make headlines, with the PGMOL still reeling from Arsenal manager Mikel Arteta's furious blast last weekend","content":"The PGMOL are looking to recruit new \"specialist\" VAR officials amid the increasing criticism of its use in the Premier League . VAR once again stole the headlines last weekend after Arsenal suffered a controversial 1-0 defeat away to Newcastle , with Anthony Gordon's winning goal being subject to a lengthy check to decide on three incidents within the build-up. That prompted Arsenal boss Mikel Arteta to furiously label the officiating a \"disgrace,\" and now the PGMOL - the body in charge of the Premier League's referees - are ramping up their efforts to improve VAR. The Sun report that an advert is currently circulating among 75 elite referees in both the men's and women's game for staff who'd work specifically to help video assistant referees. The advert is asking for officials who can \"provide clear communication under pressure\" and are \"capable of self-reflection on how they have performed.\" Erik ten Hag could get unlikely VAR wish after controversial Man Utd incidents Graeme Souness speaks out after Mikel Arteta is slammed following \"embarrassing\" VAR rant It's also stated that they'd need to \"identify when VAR needs to intervene,\" and have the \"ability to focus and have great communication skills.\" Last season, retired on-field referee Mike Dean took up a role dedicated to VAR, following in former colleague Lee Mason's footsteps. However, both Dean and Mason left their respective roles earlier this year amid the intense scrutiny on VAR. This week, in the wake of Arteta's infamous post-match rant, the Premier League's Key Match Incidents panel ruled that Newcastle's goal was indeed correctly awarded. Have your say! Should the Premier League scrap VAR? Let us know your stance in the comments section . Mikel Arteta labelled the officiating during Arsenal's 1-0 defeat to Newcastle a \"disgrace\" ( Image: Stu Forster/Getty Images) When quizzed on the panel's verdict, which also found that Arsenal midfielder Kai Havertz should've been shown a red card for a reckless challenge in the first half, Arteta attempted to move away from the topic. \"I think we had a lot of reactions after that match,\" the Gunners boss said on Friday. \"It's time to move forward, to focus on Burnley and talk about tomorrow's game.\" Nevertheless, Arteta was pressed to discuss VAR and comment on reports that it could take 10 years to iron out its imperfections. \"I will probably be bald in 10 years,\" he joked. \"Life will be very different, maybe we will have other new rules in football, so I don't know. Let's try to do everything that we can, individually and collectively to improve the game in every aspect and that's it.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don't like our community, you can check out any time you like. If you're curious, you can read our Privacy Notice . This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here","pubDate":"2023-11-11 12:15:44","image_url":"https://i2-prod.mirror.co.uk/incoming/article31415220.ece/ALTERNATES/s615/2_GettyImages-1774759662.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"21f060516f4d1ae4b776b66a31a3793a","title":"Soccerladuma | Man Utd 'Planning To Dump' Three Stars In January","link":"https://www.snl24.com/soccerladuma/international/manchester-united/man-utd-planning-to-dump-three-stars-in-january-20231110","keywords":null,"creator":null,"video_url":null,"description":"Manchester United are reportedly planning to offload three of their senior attackers when the January transfer window opens.","content":"Manchester United are reportedly planning to offload three of their senior attackers when the January transfer window opens. The United has been nothing short of disappointing, with Marcus Rashford being the only wide or forward player to score a goal in the Premier League. The Sun have reported that the club are now looking to offload Anthony Martial, Jadon Sancho and Antony as they aim to cut ties on their losses. Sancho has not featured since the loss to Tottenham Hotspur earlier in the season after falling out with manager Erik ten Hag, with the player not expected to feature for the club again. Martial has only scored one goal in all competitions this season but has played second fiddle to Rasmus Hojlund, while £85million signing Antony has failed to impress since joining the club last season. The report adds the moves comes as Sir Jim Ratcliffe is set to take over football matters at the club when he completes a deal to buy 25 per cent of the Red Devils. Antony was linked with a return to Brazil earlier this week, but Flamengo vice president has already ruled out a swap move involving Gabriel Barbosa. Sancho, meanwhile, has been linked with a return to Bundesliga outfit Borussia Dortmund while a couple Premier League are also reportedly said to be keen. You must be to read and post comments","pubDate":"2023-11-11 12:10:51","image_url":"https://cdn.24.co.za/files/Cms/General/d/9824/85e413c7f1c2490fbe65d98d1b7b6c87.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"50496bafc4c1a07c33dd1b84a93e0887","title":"Soccerladuma | Wydad Coach Bemoans Loss of Star Player Ahead Of Downs Clash","link":"https://www.snl24.com/soccerladuma/international/african-football-league/wydad-coach-bemoans-loss-of-star-player-ahead-of-downs-clash-20231110","keywords":null,"creator":null,"video_url":null,"description":"Wydad Casablanca head coach Adil Ramzi says the team remains motivated after losing Yahya Jabrane ahead of the African Football League final against Mamelodi Sundowns.","content":"Wydad Casablanca head coach Adil Ramzi says the team remains motivated after losing Yahya Jabrane ahead of the African Football League final against Mamelodi Sundowns. The midfielder completed the full 90 minutes in Casablanca last weekend but will play no part in the second leg due to suspension after an accumulation of yellow cards. The Wydad tactician says Jabrane is an important player for the team but says he is looking at the entire squad. “Jabrane is a very important player for us and that is why we have carried him to motivate the rest of the squad,\" Ramzi said, as per \"However, for me as a coach iam looking at the whole group and not just one player. “This is a big match and every player is motivated to play. We will do our best to win this trophy,” he concluded. Despite winning the first leg last weekend, Ramzi insists his side cannot take things lightly at Loftus Versfeld. “It is a big game and being the last one, every one wants to win. We won 2-1 in the first leg which was a good result for us. However, it is still 50/50 chance for either team to win,” he added. You must be to read and post comments","pubDate":"2023-11-11 12:10:51","image_url":"https://cdn.24.co.za/files/Cms/General/d/9824/0a78a2b2a4eb48f6947da4d0e184f8fc.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"2773481d98afc45e0f7b7ddf2a1c8ec3","title":"GAA: This weekend’s club championship fixtures","link":"https://kildare-nationalist.ie/2023/11/11/gaa-this-weekends-club-championship-fixtures-3/","keywords":["National Sport"],"creator":["Kildare Nationalist Reporter"],"video_url":null,"description":"Provincial club championships have reached their quarter-final stages across the four provinces. Here are all the football and hurling fixtures taking place this weekend… Ulster Senior Football quarter-finals: Trillick (Tyrone) v Crossmaglen Rangers (Armagh) – Healy Park, Saturday, 7.15pm – Live coverage on RTÉ Two from 7pm Glen (Down) v Cargin (Antrim) – Celtic Park,... Source","content":"Provincial club championships have reached their quarter-final stages across the four provinces. Here are all the football and hurling fixtures taking place this weekend… Ulster Senior Football quarter-finals: Trillick (Tyrone) v Crossmaglen Rangers (Armagh) – Healy Park, Saturday, 7.15pm – Live coverage on RTÉ Two from 7pm Glen (Down) v Cargin (Antrim) – Celtic Park, Sunday, 3pm Kilcoo (Derry) v Scotstown (Monaghan) – Páirc Esler, Sunday, 3.15pm – Live coverage on TG4 from 3.10pm Gowna (Cavan) v Naomh Conaill (Donegal) – Breffni Park, Sunday, 4.30pm It’s a big weekend of #UlsterClub2023 action, with all Senior & Intermediate Football Quarter Finals taking place across Saturday & Sunday, as well as the Junior Hurling Semi Finals 🏐⚾️🏆 All the info for supporters attending the games ➡️ https://t.co/FRXv48pYFt #ClubMeansMore pic.twitter.com/dMLE0slOx1 — Ulster GAA (@UlsterGAA) November 11, 2023 Connacht Senior Football quarter-finals: Ballina Stephenites (Mayo) v Fulham Irish (London) – MacHale Park, Saturday, 6pm St Brigid’s (Roscommon) v Coolera-Strandhill (Sligo) – Dr Hyde Park, Sunday, 2pm Munster Senior Football quarter-finals: Clonmel Commercials (Tipperary) v Newcastle West (Limerick) – Semple Stadium, Sunday, 1.30pm Castlehaven (Cork) v Cratloe (Clare) – Páirc Uí Chaoimh, Sunday, 1.30pm Castlehaven’s Munster Club SFC clash with Cratloe switched to Páirc Uí Chaoimh https://t.co/HZoh5dYqxR — Munster GAA (@MunsterGAA) November 10, 2023 Leinster Senior Hurling quarter-finals: Naomh Eanna (Wexford) v Kilcormac-Killoughey (Offaly) – Wexford Park, Sunday, 1.30pm – Live coverage on TG4 from 1pm Raharney (Westmeath) v Na Fianna (Dublin) – Cusack Park, Sunday, 2pm Camross (Laois) v Naas (Kildare) – O’Moore Park, Sunday, 3pm Mount Leinster Rangers (Carlow) v O’Loughlin Gaels (Kilkenny) – Cullen Park, Sunday, 3.30pm","pubDate":"2023-11-11 12:10:03","image_url":null,"source_id":"kildare-nationalist","source_priority":2606560,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"1d8745f4e0f05668d8bad9e357c56f96","title":"'I tackled everyone I could during Arsenal training – even Arsene Wenger'","link":"https://www.dailystar.co.uk/sport/football/kolo-toure-arsenal-wenger-trial-31415245","keywords":["Football"],"creator":null,"video_url":null,"description":"Kolo Toure told his side of the story about his infamous Arsenal trial which saw him 'trying to tackle everything' – including Arsene Wenger","content":"Kolo Toure admitted he was \"trying to tackle everything\" during his infamous trial that saw him take out . Toure’s first days at Arsenal are well known. And for anyone who watched his career unfold, the story about his trial as a 21-year-old while he was still at ASEC Mimosas in his homeland will come as little surprise. A recording of former Arsenal hero Ray Parlour’s story was played about how Toure smashed into Thierry Henry and Dennis Bergkamp – with Wenger shrieking at him not to go in heavy on the Gunners’ star players. Parlour later told how after making a good interception, Toure followed the ball out before smashing into Wenger and leaving the man he was trying to impress in pain on the deck. Toure listened to the recording with a huge smile on his face before telling his side of the story to former Arsenal team-mate Martin Keown on talkSPORT. He said: “Like Martin said, I was so enthusiastic. “I can’t believe I was training with these guys, coming there and with players that were my idols. When the game started, I wanted to show what I was capable of doing because for me it was a big chance and I didn’t want to miss that at all. I was trying to tackle everything I could, including the manager.” Keown added how Wenger was impressed by Toure’s mentality, immediately wanting to offer the Ivorian a contract, he said: “Do you remember what the manager said? He was getting to his feet and he said ‘we sign him, we sign him, please do it’.” That quip saw both of the former Invincibles burst into laughter. Toure went on to play 326 games in all competitions for Arsenal across seven years in North London – lifting the and FA Cup twice at Arsenal. He later joined in 2009, going on to win a further Premier League title and FA Cup. After leaving the Etihad, Toure played for three years at Liverpool before moving north of the border and playing under Brendan Rodgers at Celtic for a short spell before becoming part of his coaching staff at Parkhead and . Toure most recently took charge of last season but was sacked after going winless in his nine games in charge.","pubDate":"2023-11-11 12:00:58","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415212.ece/ALTERNATES/s98/0_Arsenal-Juventus-Training-Press-Conference.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"23b87a4ee501eb2d59e1484034e649ef","title":"Cole Palmer has nothing to prove to City after winning Pochettino’s trust","link":"https://www.theguardian.com/football/2023/nov/11/cole-palmer-has-nothing-to-prove-manchester-city-chelsea-pochettino","keywords":["Chelsea","Manchester City","Football","Sport"],"creator":["Jacob Steinberg"],"video_url":null,"description":"Chelsea bagged a bargain by signing the former Guardiola fledgling who has seized his chance at Stamford BridgeClubs with a coherent recruitment process do not really do regrets. It is why Manchester City are unlikely to be caught fretting about selling Cole Palmer to Chelsea in the summer. Outsiders may view it as a risk, particularly as Palmer is in excellent form before facing his boyhood club on Sunday afternoon, but City are hardly short of attacking talent and conduct their transfer business in a way that means they do not have to second-guess themselves about letting players go.Still Chelsea are entitled to argue that they got a bargain when they signed Palmer for £40m plus £2.5m in add-ons. Sometimes everyone leaves a negotiation feeling triumphant. In this case City bolstered their financial fair play position by selling a homegrown player who was on the fringes of the first team, Chelsea paid relatively little for a top young talent and Palmer joined a club who, for all their instability, were ready to offer him regular football. Continue reading...","content":"C lubs with a coherent recruitment process do not really do regrets. It is why Manchester City are unlikely to be caught fretting about selling Cole Palmer to Chelsea in the summer. Outsiders may view it as a risk, particularly as Palmer is in excellent form before facing his boyhood club on Sunday afternoon, but City are hardly short of attacking talent and conduct their transfer business in a way that means they do not have to second-guess themselves about letting players go. Still Chelsea are entitled to argue that they got a bargain when they signed Palmer for £40m plus £2.5m in add-ons. Sometimes everyone leaves a negotiation feeling triumphant. In this case City bolstered their financial fair play position by selling a homegrown player who was on the fringes of the first team, Chelsea paid relatively little for a top young talent and Palmer joined a club who, for all their instability, were ready to offer him regular football. Nobody has to feel bitter. Palmer hoped this would be his breakthrough season at City, especially after Riyad Mahrez moved to Saudi Arabia, and there were positive signs at the start of the campaign. The 21-year-old scored a gorgeous goal against Arsenal in the Community Shield and headed in City’s equaliser against Sevilla in the European Super Cup . Was Palmer about to follow in the footsteps of another of City’s academy stars, Phil Foden, and force his way into Pep Guardiola’s plans? Foden is established with City and England, but Guardiola clearly liked Palmer and gave him opportunities last season. Cole Palmer occupies the Sevilla defence during Manchester City’s Super Cup victory in August. Photograph: Raddad Jebarah/NurPhoto/Getty Images When it came to the crunch, though, City could not quite justify keeping Palmer around. European champions tend to be ruthless. Guardiola, who also had Kevin De Bruyne, Jack Grealish, Julián Álvarez, Bernardo Silva and Foden, looked elsewhere. The writing was on the wall for Palmer when City signed Matheus Nunes and Jérémy Doku. It made no sense for Palmer to stay and fight for his place. He played a key role in England winning the European Under-21 Championship in July and could not afford to be sidelined. Other avenues were waiting to be explored. City had rejected Brighton’s £35m bid for Palmer and there was interest from Burnley and West Ham. Drumming up a deal for the attacker was not going to be a problem. Even so it would be wrong to say Palmer was Chelsea’s first choice given they came within a whisker of signing Michael Olise from Crystal Palace. It is true that Joe Shields, the co-director of recruitment and talent, knew Palmer from his time at City’s academy. Shields could vouch for Palmer’s ability and Chelsea spent much of the summer quietly monitoring the situation. skip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Mauricio Pochettino watches Cole Palmer in action for Chelsea. He is a regular starter at his new club. Photograph: Javier García/Shutterstock Yet the move itself was opportunistic. Chelsea were short in attack after losing Christopher Nkunku and Carney Chukwuemeka to injury. Mauricio Pochettino called for reinforcements. Chelsea, notoriously blunt in the final third, needed help. However, eyebrows were raised when Palmer was added to a squad already packed with youth; it seemed odd that Chelsea would sign a right-sided attacker when they had Raheem Sterling, Noni Madueke and Mykhailo Mudryk. There were fears that Palmer would be swallowed up. He is from Wythenshawe, south Manchester, and had only known life at City. He is alone in London, away from his family, and has delivered a few self-deprecating lines about missing his mum’s cooking and learning how to use a washing machine. Do not mistake that for a lack of self-belief, though. Palmer has embraced the challenge and quickly become one of the symbols of Chelsea’s youth-led revolution. Having been eased in by Pochettino, Palmer has not looked back since coming into the starting XI. He announced himself with an assist on his debut in Brighton and excelled on his first league start, making Armando Broja’s goal in Chelsea’s win over Fulham . Pochettino has seen a player seizing responsibility. Palmer has assumed penalty duties, scoring three times from the spot, and captained England Under-21s last month. Chelsea are mid-table and have issues in attack but Palmer is not one of them. Capable of playing on the right, and even impressing as a false 9 against Arsenal last month, he has infused Pochettino’s side with ideas and invention. This is not a luxury player. When he was 16 Palmer was behind others in his age group at City. He was smaller so he focused on developing his footwork. He figured out how to escape tight situations. The growth spurt followed. At 6ft, Palmer is no pushover. He can handle the physical side, even if he still looks slender, and is not easy to dispossess. Along with the clever passing, there is an elegance to Palmer’s movement and the way he unbalances defenders. There was an instructive moment at the start of Chelsea’s wild 4-1 win over Tottenham on Monday. The visitors were under pressure after going 1-0 down and were being pressed by Spurs. But when Palmer picked up possession in his own half and found himself being pushed backwards, he stayed calm, trusted in his technique and bamboozled Destiny Udogie with a sublime Cruyff turn. No wonder Gareth Southgate is keeping an eye on Palmer, who could be drafted into the England squad after James Maddison’s withdrawal through injury. No wonder Chelsea are no longer having to answer questions about selling Mason Mount and Kai Havertz. Palmer has brightened the picture and although City will back their long-term judgment they will not underestimate their former player on Sunday afternoon.","pubDate":"2023-11-11 12:00:34","image_url":"https://i.guim.co.uk/img/media/2814e0ebaca3d78f2a877d1754b19b916c816092/0_0_5000_3000/master/5000.jpg?width=460&quality=85&auto=format&fit=max&s=07dbc0362978a32632088b2ce16e3fd0","source_id":"theguardian","source_priority":106,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"6fa0b180b8f0c488d95521365f1ee1d8","title":"Wonder jockey produces 'filthy ride' to win from impossible spot as fans say 'different class'","link":"https://www.dailystar.co.uk/sport/horse-racing/wonder-jockey-wins-filthy-race-31415445","keywords":["Sport"],"creator":null,"video_url":null,"description":"Horse racing fans were left in awe after witnessing prodigy jockey Billy Loughnane's stunning ride at Newcastle where he won from an 'impossible spot'","content":"fans were left hailing wonder jockey Billy Loughnane after they watched him ride to an improbably victory at on Friday afternoon. Racing in the 4.45, Loughnane, riding Spangled Mac, looked to have no hope of winning two furlongs out, with the young jockey and his horse at the back of the pack. However, the 17-year-old somehow managed to fly through the field, charging past his competitors to claim an improbably win. The teenager has enjoyed an incredible season, having recently been named as the 2023 Champion Apprentice Jockey on Champions Day at last month. And fans on social media were also left stunned by Loughnane and Spangled Mac's 'filthy ride'. One fan commented on X, formerly Twitter: \"Billy Loughnane that is simply disgusting..! How has he got Spangled Mac up there!\" A second said: \"No Words...Sensational. Billy Loughnane take a bow.\" A third wrote: \"Oh that is filthy.\" A fourth added: \"Never panicked, fantastic talent in the saddle.\" The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . A fifth said: \"A ride that should be shown to every aspiring young rider. Minimal use of the whip and brilliant fitness levels shown to coax Spangled Mac into contention under hands and heels. An incredible ride from an incredible talent.\" And a sixth added: \"He’ll go onto be the best jockey on the planet and I can’t wait for it. He’s already better than the Doyler that’s for sure.\" TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month With Loughnane being tipped to go on to have a huge successful career, it's easy to see just why fans are gravitating to supporting the teenager following his incredible 2023 season. \"It’s been crazy and to have ridden 100 winners in less than a year is pretty unreal,\" said Loughnane when asked about his crazy season. \"There’s been a few highlights, one of which was having my first winner for Godolphin on Sapphire Seas. I just got up to win by a nose which was massive for me.\"","pubDate":"2023-11-11 13:19:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415662.ece/ALTERNATES/s98/2_Spangled-Mac-incredible-win-from-behind.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"56a6bf3e1367dc651e3ba70f5f2f1f71","title":"World Cup team left with just 14 outfield players due to FIFA rule after four are banished","link":"https://www.dailystar.co.uk/sport/football/poland-u17-world-cup-players-31415538","keywords":["Sport"],"creator":null,"video_url":null,"description":"A World Cup team has been left with just 14 outfield players after four of them were sent home in disgrace with FIFA rulings barring any replacements","content":"The U17 has been hit by a serious scandal that has seen four players banished from the national camp. Poland’s preparations for the tournament have been marred after four of their players were banished from the team’s training camp after they were removed due to unsportsmanlike behaviour and violation of the regulations – having been caught with alcohol. And the four departing players - Oskar Tomczyk, Filip Rozga, Jan Labedzki, and Filip Wolski - cannot be replaced due to FIFA ruling – meaning Poland now only have 14 outfield players to select from due to the regulations regarding replacements on the submitted player list. FIFA addressed the situation regarding the axed players, saying: “As per Article 27.3 of the tournament regulations, a player listed on the final list may be replaced by a player from the provisional list only in the event of serious injury or illness up until 24 hours before the kick-off of their team’s first match.” Poland U17 coach Marcin Wlodarski admitted he felt the team's scandal was a ‘personal failure’ of his. He said: \"The players broke the rules and there was no other option but for them to leave the team. I see these boys as family, we spend a lot of time together. So I treat this as a personal failure of mine. \"We cannot let such acts slide. I believe these boys will reflect on this, understand that their actions have consequences and re-join the team one day, just not anytime soon. I've spoken with the parents and everyone is disappointed. \"Everyone worked hard to get here, but we need to condemn this, because these things cannot happen, especially not on the national team. For each of these boys, I would have cut my hand off for them and now I wouldn't have a hand.\" Poland played their opening tournament game on Saturday, falling to a 1-0 defeat against Japan, where they were able to name just six substitutes. They find themselves in one of the toughest groups in the tournament, alongside Senegal and Argentina – where all eyes will be on 15-year-old Senegal sensation .","pubDate":"2023-11-11 13:14:35","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415519.ece/ALTERNATES/s98/0_Japan-v-Poland-Group-D-FIFA-U-17-World-Cup.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1ab99200da5f47974db6e83182bcf619","title":"Erik ten Hag makes Mason Mount feelings clear and explains why he's dropped Man Utd star","link":"https://www.mirror.co.uk/sport/football/news/mason-mount-man-utd-tenhag-31415472","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alan Smith)"],"video_url":null,"description":"The England midfielder is struggling for minutes and form but under fire United boss says his view of a \"very important player\" has not changed","content":"Erik ten Hag has insisted his view of Mason Mount “hasn’t changed at all” despite the £55m midfielder’s struggles since joining Manchester United in the summer. Mount arrived from Chelsea with high expectations as Ten Hag’s first signing of the transfer window but has struggled for form and battled injury. The 24-year-old has also fallen out of the England reckoning and now appears to be restricted to appearances off the bench at Old Trafford - despite the team’s dire form. And Ten Hag, speaking before this afternoon’s visit of Luton Town, said that with other players doing well Mount must be patient before earning his spot back. Every Premier League club affected by new transfer proposal with Man Utd set to join Alejandro Garnacho labelled \"a clown\" by Copenhagen star after trying sneaky tactic again His only start in the past month has come in the EFL Cup hammering against Newcastle United and Sofyan Amrabat was sprung from the bench before him in Wednesday evening’s chaotic Champions League defeat away to Copenhagen. “He had some starts,” Ten Hag said. “Also recently, last week against Newcastle, but there are always reasons and sometimes, like the injury [at the start of the season] and other players doing well, then you have to wait for your time to play.” When Mount arrived at United Ten Hag told him, in front of the club’s media channel, that “I want you to be a very important player for this team.” But his most recent league goal came on December 27 and he last provided an assist in October of last year. Mount has also struggled significantly in the past year with a lingering pelvic issue. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here But Ten Hag is continuing to back him in the long-term and, asked if his first impression is different to his current view, the under-fire Dutchman said: “It hasn’t changed at all. But he started the season, then he got injured, so that is the worst moment for a new player to get injured because it stops the integration process and that was a setback for us all. Now we have to find his place back.” United have lost nine of their opening 17 games in all competitions and in addition to teetering on the brink in Europe they are already nine points off Manchester City in the Premier League table. Ten Hag must also plan for Luton without midfielder Casemiro, who is set to be out until January with a hamstring injury, in addition to defenders Luke Shaw and Lisandro Martinez. He has also reportedly had a row with centre half Raphael Varane, who has spent recent weeks on the substitutes’ bench. Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-11-11 12:30:20","image_url":"https://i2-prod.mirror.co.uk/incoming/article31407071.ece/ALTERNATES/s615/0_GettyImages-1771543629.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"87784e1a3172c7bb12b0d4a05f7c51fa","title":"Wolves v Tottenham: Premier League – live","link":"https://www.theguardian.com/football/live/2023/nov/11/wolves-v-tottenham-premier-league-live","keywords":["Premier League","Football","Wolverhampton Wanderers","Tottenham Hotspur","Sport"],"creator":["Barry Glendenning"],"video_url":null,"description":"Premier League updates from the 12.30pm GMT kick-offFollow Guardian sport on Instagram, Threads and YouTubeRemembering the fallen: Wolves will join the rest of the football world this weekend by paying their respects to those who have served their country. A period of silence will be observed before kick-off and bugler Lesley Jenkins, from the West Midlands Police Band, will play The Last Post, before representatives of the Armed Forces lay a wreath.Referee: Tim RobinsonReferee’s assistants: Timothy Wood and Wade SmithFourth official: Thomas BramallVAR: Paul Tierney Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 24m ago GOAL! Wolves 0-1 Tottenham Hotspur (Johnson 3) 27m ago Wolves v Tottenham Hotspur is go ... 1h ago Wolves v Tottenham Hotspur line-ups 2h ago Early team news 2h ago Premier League: Wolves v Tottenham Hotspur Show key events only Please turn on JavaScript to use this feature 1m ago 12.58 GMT 25 min: A sloppy pass from Emerson Royal gifts Wolves a throw-in near the halfway line and moments later, Pedro Porro is penalised for a foul on Toti. 3m ago 12.56 GMT 24 min: Tottenham’s high defensive line threatens to be their undoing as Wolves play the ball in behind, forcing Ben Davies into a foot race with Hwang. The visitors get away with it on this occasion. 5m ago 12.54 GMT 22 min: Porro receives treatment for what looks like a calf injury and is fit to continue for the time being at least. He’s limping quite heavily and Spurs really can’t afford to lose him. 6m ago 12.53 GMT 20 min: Pedro Porro goes down roaring in pain after being fouled by Joao Gomes. The Wolves midfielder is lucky to avoid a booking for his late challenge on the Tottenham right-back, who had given him the slip. 8m ago 12.51 GMT 19 min: Ait-Nouri gallops through the centre and pings a low ball towards Hwang, who does well to control it under pressure. The South Korean runs into traffic on the edge of the Spurs penalty area before he can pull the trigger. 10m ago 12.49 GMT 18 min: Wolves win two corners in quick succession but are unable to clear the first Tottenham defender with either delivery. 11m ago 12.48 GMT 16 min: Yves Bissouma cedes possession to Lemina in midfield and Wolves surge forward again. Hwang Hee-chan pulls the ball back towards Bellegarde after getting the better of Dier down by the byline, but the Frenchman has his back to goal and is unable to shoot on the turn. 13m ago 12.46 GMT 14 min: Wolves have got a firm foothold in the game after that very early setback and are now giving Tottenham plenty to think about. It’s shaping up to be a good game. 14m ago 12.45 GMT 13 min: There’s a break in play as Mario Lemina receives treatment from the Wolves physios. He seems to be OK. 16m ago 12.43 GMT 10 min: Showing no ill-effects from his blow to the head, Ben Davies does brilliantly to dive in and block a shot on goal from Ait-Nouri after Eric Dier had lost the ball in midfield and Wolves had broken upfield at speed. 18m ago 12.41 GMT 9 min: Jeanricner Bellegarde plays the ball out wide to Joao Gomes, who crosses. Ben Davies goes down after the ball is blasted into the side of his head by Toti Gomes and referee Tim Robinson stops play, provoking the ire of the home crowd. Updated at 12.44 GMT 20m ago 12.40 GMT 7 min: Their confidence buoyed, Tottenham continue to dominate these early stages. Kulusevki takes on and beats Rayan Ait-Nouri on the right flank and sends a cross into the Wolves penalty area. It’s blocked and the home side clear. 21m ago 12.38 GMT 4 min: It’s a wonderful start for Tottenham, their opener orchestrated by excellent work by Pedro Porro. The ball was pinged his way by Dejan Kulusevski and he looked to have slipped but we’re going to give him the benefit of the doubt and say it was a clever dummy. Porro squared the ball for Johnson, who was quickest to react on the edge of the six-yard box and poke home. 24m ago 12.35 GMT GOAL! Wolves 0-1 Tottenham Hotspur (Johnson 3) Tottenham take the lead! Brennan Johnson scores his first goal for Spurs, slotting the ball home from six yards after getting on the end of a squared ball sent his way by Pedro Porro. Brennan Johnson steals in to give Spurs an early lead! Photograph: Jason Cairnduff/Action Images/Reuters Updated at 12.38 GMT 25m ago 12.34 GMT 2 min: Tottenham goalkeeper Guglielmo Vicario gets an early touch and Tottenham play the ball out from the back. 27m ago 12.32 GMT Wolves v Tottenham Hotspur is go ... 1 min: With the last of the perfectly observed pre-match formalities over, Wolves get the ball rolling in what could be a fascinating game. It’s played straight back to goalkeeper Jose Sa. Updated at 12.32 GMT 32m ago 12.27 GMT Not long now: With the monster riffola of Led Zeppelin blaring over the Tannoy, the teams march out on to the Molineux pitch and line up either side of referee Tim Robinson and his team of match officials. Kick-off is just a few minutes away but first there’ll be a moment’s reflection for remembrance day. Updated at 12.30 GMT 42m ago 12.18 GMT Joao Gomes and his Wolves teammates warm up ahead of kick-off. Photograph: Jack Thomas/WWFC/Wolves/Getty Images 54m ago 12.05 GMT In an innovation that seems unlikely to catch on, TNT Sports have kitted Brennan Johnson and Max Kilman out with bodycams for their pre-match warm-ups, so viewers can get an unprecedented insight into what it’s like for a professional footballer to do shuttle runs and keepy-uppies. Photograph: Ryan Browne/Shutterstock Updated at 12.06 GMT 1h ago 12.00 GMT Remembering the fallen: Wolves will join the rest of the football world this weekend by paying their respects to those who have served their country. A period of silence will be observed before kick-off and bugler Lesley Jenkins, from the West Midlands Police Band, will play The Last Post, before representatives of the Armed Forces lay a wreath. 1h ago 11.54 GMT Today’s match officials Referee: Tim Robinson Referee’s assistants: Timothy Wood and Wade Smith Fourth official: Thomas Bramall VAR: Paul Tierney Referee Tim Robinson leads the team of match officials for today’s match at Molineux. Photograph: Jan Kruger/Getty Images 1h ago 11.44 GMT Those teams: Gary O’Neil makes two changes to the side that lost against Sheffield United last time out Jean-Ricner Bellegarde and Joao Gomes come into the side, with Tommy Doyle and Sasa Kalajdzic dropping to the substitutes’ bench. Ange Postecoglou has been forced to make four changes to the side that lost against Chelsea on Monday night. Eric Dier comes in at centre-half and will play alongside Ben Davies or Emerson Royal. Pierre-Emile Hojbjerg also starts alongside Yves Bissouma in midfield. Tottenham’s bench looks a little threadbare but features Oliver Skipp, Giovani Lo Celso and Rodrigo Bentancur, among others. Ange Postecoglou has made four changes to the Tottenham Hotspur side that lost against Chelsea on Monday night. Photograph: Tom Jenkins/The Guardian Updated at 12.24 GMT 1h ago 11.34 GMT Matchday merchandise on sale outside Molineux. Photograph: Ryan Browne/Shutterstock 1h ago 11.33 GMT Wolves v Tottenham Hotspur line-ups Wolves: Sa; Semedo, Dawson, Kilman, Toti; Bellegarde, Lemina, Gomes, Ait-Nouri; Hwang, Cunha. Subs: Bentley, Doherty, Traore, Silva, Bueno, Kalajdzic, Jonny, Doyle, Sarabia. Tottenhamn Hotspur: Vicario; Porro, Royal, Dier, Davies; Sarr, Hojbjerg, Bissouma; Kulusevski, Son, Johnson. Subs: Forster, Skipp, Gil, Lo Celso, Bentancur, Phillips, Veliz, Donley, Dorrington. 2h ago 11.29 GMT ‘A very special game’: South Korea gears up for Hwang v Son showdown Read more 2h ago 11.24 GMT Early team news Tottenham lost James Maddison and Micky van de Ven to injury on Monday night and both hugely influential summer signings are expected to be out until the New Year. They join Manor Solomon, Ivan Perisic, Ryan Sessegnon and Alfie Whiteman in the treatment room, while Richarlison is also set to spend a month or so on the sidelines after undergoing surgery on his groin. Cristian Romero and Destiny Odogie are also absent this afternoon through suspension after getting sent off against Chelsea. In better news for Spurs, Ben Davies is fit after recovering from an ankle injury and is likely to come straight back into the first team. Wolves have far fewer personnel problems but Pedro Neto remains absent. Defensive midfielder Joe Hodge is also out with a shoulder injury but Hugo Bueno is available again after recovering from a hamstring issue. ‘Worse than we thought’: Postecoglou says injured Maddison out till January Read more James Maddison lies on the Tottenham Hotspur Stadium pitch after suffering the ankle injury that will keep him out until the New Year. Photograph: Tony Obrien/Reuters 2h ago 11.24 GMT Premier League: Wolves v Tottenham Hotspur With an international break looming, Wolves host Spurs in the opening Premier League game of the weekend. Following Monday night’s chaotic defeat at the hands of Chelsea, Ange Postecoglou brings a severely depleted squad to Molineux, his options seveely limited by injury and suspension. Wolves lost against Sheffield United last time out but were somewhat unfortunate to do so, going down to a late, late Ollie Norwood penalty that should not have been awarded. Unbeaten in four prior to that defeat, Gary O’Neil’s side will be hopeful of taking all three points at home against their depleted visitors. Kick-off is at 12.30pm (GMT) but stay tuned in the meantime for team news and build-up. Explore more on these topics Premier League Premier League live Wolverhampton Wanderers Tottenham Hotspur Reuse this content","pubDate":"2023-11-11 12:24:50","image_url":"https://i.guim.co.uk/img/media/e327658f635f19e4610d91545dc2366f835bd063/0_206_4425_2655/master/4425.jpg?width=460&quality=85&auto=format&fit=max&s=567e0b906fce511409f79014e6cc14aa","source_id":"theguardian","source_priority":106,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"1c271c2d27392f3e0a14d23d128ef790","title":"Premier League referees' chiefs advertise new VAR job after Mikel Arteta \"disgrace\" rant","link":"https://www.mirror.co.uk/sport/football/news/premier-league-var-arteta-arsenal-31415061","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Nathan Ridley)"],"video_url":null,"description":"The future of VAR in the Premier League continues to make headlines, with the PGMOL still reeling from Arsenal manager Mikel Arteta's furious blast last weekend","content":"The PGMOL are looking to recruit new \"specialist\" VAR officials amid the increasing criticism of its use in the Premier League . VAR once again stole the headlines last weekend after Arsenal suffered a controversial 1-0 defeat away to Newcastle , with Anthony Gordon's winning goal being subject to a lengthy check to decide on three incidents within the build-up. That prompted Arsenal boss Mikel Arteta to furiously label the officiating a \"disgrace,\" and now the PGMOL - the body in charge of the Premier League's referees - are ramping up their efforts to improve VAR. The Sun report that an advert is currently circulating among 75 elite referees in both the men's and women's game for staff who'd work specifically to help video assistant referees. The advert is asking for officials who can \"provide clear communication under pressure\" and are \"capable of self-reflection on how they have performed.\" Erik ten Hag could get unlikely VAR wish after controversial Man Utd incidents Graeme Souness speaks out after Mikel Arteta is slammed following \"embarrassing\" VAR rant It's also stated that they'd need to \"identify when VAR needs to intervene,\" and have the \"ability to focus and have great communication skills.\" Last season, retired on-field referee Mike Dean took up a role dedicated to VAR, following in former colleague Lee Mason's footsteps. However, both Dean and Mason left their respective roles earlier this year amid the intense scrutiny on VAR. This week, in the wake of Arteta's infamous post-match rant, the Premier League's Key Match Incidents panel ruled that Newcastle's goal was indeed correctly awarded. Have your say! Should the Premier League scrap VAR? Let us know your stance in the comments section . Mikel Arteta labelled the officiating during Arsenal's 1-0 defeat to Newcastle a \"disgrace\" ( Image: Stu Forster/Getty Images) When quizzed on the panel's verdict, which also found that Arsenal midfielder Kai Havertz should've been shown a red card for a reckless challenge in the first half, Arteta attempted to move away from the topic. \"I think we had a lot of reactions after that match,\" the Gunners boss said on Friday. \"It's time to move forward, to focus on Burnley and talk about tomorrow's game.\" Nevertheless, Arteta was pressed to discuss VAR and comment on reports that it could take 10 years to iron out its imperfections. \"I will probably be bald in 10 years,\" he joked. \"Life will be very different, maybe we will have other new rules in football, so I don't know. Let's try to do everything that we can, individually and collectively to improve the game in every aspect and that's it.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don't like our community, you can check out any time you like. If you're curious, you can read our Privacy Notice . This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here","pubDate":"2023-11-11 12:15:44","image_url":"https://i2-prod.mirror.co.uk/incoming/article31415220.ece/ALTERNATES/s615/2_GettyImages-1774759662.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"21f060516f4d1ae4b776b66a31a3793a","title":"Soccerladuma | Man Utd 'Planning To Dump' Three Stars In January","link":"https://www.snl24.com/soccerladuma/international/manchester-united/man-utd-planning-to-dump-three-stars-in-january-20231110","keywords":null,"creator":null,"video_url":null,"description":"Manchester United are reportedly planning to offload three of their senior attackers when the January transfer window opens.","content":"Manchester United are reportedly planning to offload three of their senior attackers when the January transfer window opens. The United has been nothing short of disappointing, with Marcus Rashford being the only wide or forward player to score a goal in the Premier League. The Sun have reported that the club are now looking to offload Anthony Martial, Jadon Sancho and Antony as they aim to cut ties on their losses. Sancho has not featured since the loss to Tottenham Hotspur earlier in the season after falling out with manager Erik ten Hag, with the player not expected to feature for the club again. Martial has only scored one goal in all competitions this season but has played second fiddle to Rasmus Hojlund, while £85million signing Antony has failed to impress since joining the club last season. The report adds the moves comes as Sir Jim Ratcliffe is set to take over football matters at the club when he completes a deal to buy 25 per cent of the Red Devils. Antony was linked with a return to Brazil earlier this week, but Flamengo vice president has already ruled out a swap move involving Gabriel Barbosa. Sancho, meanwhile, has been linked with a return to Bundesliga outfit Borussia Dortmund while a couple Premier League are also reportedly said to be keen. You must be to read and post comments","pubDate":"2023-11-11 12:10:51","image_url":"https://cdn.24.co.za/files/Cms/General/d/9824/85e413c7f1c2490fbe65d98d1b7b6c87.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"50496bafc4c1a07c33dd1b84a93e0887","title":"Soccerladuma | Wydad Coach Bemoans Loss of Star Player Ahead Of Downs Clash","link":"https://www.snl24.com/soccerladuma/international/african-football-league/wydad-coach-bemoans-loss-of-star-player-ahead-of-downs-clash-20231110","keywords":null,"creator":null,"video_url":null,"description":"Wydad Casablanca head coach Adil Ramzi says the team remains motivated after losing Yahya Jabrane ahead of the African Football League final against Mamelodi Sundowns.","content":"Wydad Casablanca head coach Adil Ramzi says the team remains motivated after losing Yahya Jabrane ahead of the African Football League final against Mamelodi Sundowns. The midfielder completed the full 90 minutes in Casablanca last weekend but will play no part in the second leg due to suspension after an accumulation of yellow cards. The Wydad tactician says Jabrane is an important player for the team but says he is looking at the entire squad. “Jabrane is a very important player for us and that is why we have carried him to motivate the rest of the squad,\" Ramzi said, as per \"However, for me as a coach iam looking at the whole group and not just one player. “This is a big match and every player is motivated to play. We will do our best to win this trophy,” he concluded. Despite winning the first leg last weekend, Ramzi insists his side cannot take things lightly at Loftus Versfeld. “It is a big game and being the last one, every one wants to win. We won 2-1 in the first leg which was a good result for us. However, it is still 50/50 chance for either team to win,” he added. You must be to read and post comments","pubDate":"2023-11-11 12:10:51","image_url":"https://cdn.24.co.za/files/Cms/General/d/9824/0a78a2b2a4eb48f6947da4d0e184f8fc.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"2773481d98afc45e0f7b7ddf2a1c8ec3","title":"GAA: This weekend’s club championship fixtures","link":"https://kildare-nationalist.ie/2023/11/11/gaa-this-weekends-club-championship-fixtures-3/","keywords":["National Sport"],"creator":["Kildare Nationalist Reporter"],"video_url":null,"description":"Provincial club championships have reached their quarter-final stages across the four provinces. Here are all the football and hurling fixtures taking place this weekend… Ulster Senior Football quarter-finals: Trillick (Tyrone) v Crossmaglen Rangers (Armagh) – Healy Park, Saturday, 7.15pm – Live coverage on RTÉ Two from 7pm Glen (Down) v Cargin (Antrim) – Celtic Park,... Source","content":"Provincial club championships have reached their quarter-final stages across the four provinces. Here are all the football and hurling fixtures taking place this weekend… Ulster Senior Football quarter-finals: Trillick (Tyrone) v Crossmaglen Rangers (Armagh) – Healy Park, Saturday, 7.15pm – Live coverage on RTÉ Two from 7pm Glen (Down) v Cargin (Antrim) – Celtic Park, Sunday, 3pm Kilcoo (Derry) v Scotstown (Monaghan) – Páirc Esler, Sunday, 3.15pm – Live coverage on TG4 from 3.10pm Gowna (Cavan) v Naomh Conaill (Donegal) – Breffni Park, Sunday, 4.30pm It’s a big weekend of #UlsterClub2023 action, with all Senior & Intermediate Football Quarter Finals taking place across Saturday & Sunday, as well as the Junior Hurling Semi Finals 🏐⚾️🏆 All the info for supporters attending the games ➡️ https://t.co/FRXv48pYFt #ClubMeansMore pic.twitter.com/dMLE0slOx1 — Ulster GAA (@UlsterGAA) November 11, 2023 Connacht Senior Football quarter-finals: Ballina Stephenites (Mayo) v Fulham Irish (London) – MacHale Park, Saturday, 6pm St Brigid’s (Roscommon) v Coolera-Strandhill (Sligo) – Dr Hyde Park, Sunday, 2pm Munster Senior Football quarter-finals: Clonmel Commercials (Tipperary) v Newcastle West (Limerick) – Semple Stadium, Sunday, 1.30pm Castlehaven (Cork) v Cratloe (Clare) – Páirc Uí Chaoimh, Sunday, 1.30pm Castlehaven’s Munster Club SFC clash with Cratloe switched to Páirc Uí Chaoimh https://t.co/HZoh5dYqxR — Munster GAA (@MunsterGAA) November 10, 2023 Leinster Senior Hurling quarter-finals: Naomh Eanna (Wexford) v Kilcormac-Killoughey (Offaly) – Wexford Park, Sunday, 1.30pm – Live coverage on TG4 from 1pm Raharney (Westmeath) v Na Fianna (Dublin) – Cusack Park, Sunday, 2pm Camross (Laois) v Naas (Kildare) – O’Moore Park, Sunday, 3pm Mount Leinster Rangers (Carlow) v O’Loughlin Gaels (Kilkenny) – Cullen Park, Sunday, 3.30pm","pubDate":"2023-11-11 12:10:03","image_url":null,"source_id":"kildare-nationalist","source_priority":2606560,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"1d8745f4e0f05668d8bad9e357c56f96","title":"'I tackled everyone I could during Arsenal training – even Arsene Wenger'","link":"https://www.dailystar.co.uk/sport/football/kolo-toure-arsenal-wenger-trial-31415245","keywords":["Football"],"creator":null,"video_url":null,"description":"Kolo Toure told his side of the story about his infamous Arsenal trial which saw him 'trying to tackle everything' – including Arsene Wenger","content":"Kolo Toure admitted he was \"trying to tackle everything\" during his infamous trial that saw him take out . Toure’s first days at Arsenal are well known. And for anyone who watched his career unfold, the story about his trial as a 21-year-old while he was still at ASEC Mimosas in his homeland will come as little surprise. A recording of former Arsenal hero Ray Parlour’s story was played about how Toure smashed into Thierry Henry and Dennis Bergkamp – with Wenger shrieking at him not to go in heavy on the Gunners’ star players. Parlour later told how after making a good interception, Toure followed the ball out before smashing into Wenger and leaving the man he was trying to impress in pain on the deck. Toure listened to the recording with a huge smile on his face before telling his side of the story to former Arsenal team-mate Martin Keown on talkSPORT. He said: “Like Martin said, I was so enthusiastic. “I can’t believe I was training with these guys, coming there and with players that were my idols. When the game started, I wanted to show what I was capable of doing because for me it was a big chance and I didn’t want to miss that at all. I was trying to tackle everything I could, including the manager.” Keown added how Wenger was impressed by Toure’s mentality, immediately wanting to offer the Ivorian a contract, he said: “Do you remember what the manager said? He was getting to his feet and he said ‘we sign him, we sign him, please do it’.” That quip saw both of the former Invincibles burst into laughter. Toure went on to play 326 games in all competitions for Arsenal across seven years in North London – lifting the and FA Cup twice at Arsenal. He later joined in 2009, going on to win a further Premier League title and FA Cup. After leaving the Etihad, Toure played for three years at Liverpool before moving north of the border and playing under Brendan Rodgers at Celtic for a short spell before becoming part of his coaching staff at Parkhead and . Toure most recently took charge of last season but was sacked after going winless in his nine games in charge.","pubDate":"2023-11-11 12:00:58","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415212.ece/ALTERNATES/s98/0_Arsenal-Juventus-Training-Press-Conference.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"23b87a4ee501eb2d59e1484034e649ef","title":"Cole Palmer has nothing to prove to City after winning Pochettino’s trust","link":"https://www.theguardian.com/football/2023/nov/11/cole-palmer-has-nothing-to-prove-manchester-city-chelsea-pochettino","keywords":["Chelsea","Manchester City","Football","Sport"],"creator":["Jacob Steinberg"],"video_url":null,"description":"Chelsea bagged a bargain by signing the former Guardiola fledgling who has seized his chance at Stamford BridgeClubs with a coherent recruitment process do not really do regrets. It is why Manchester City are unlikely to be caught fretting about selling Cole Palmer to Chelsea in the summer. Outsiders may view it as a risk, particularly as Palmer is in excellent form before facing his boyhood club on Sunday afternoon, but City are hardly short of attacking talent and conduct their transfer business in a way that means they do not have to second-guess themselves about letting players go.Still Chelsea are entitled to argue that they got a bargain when they signed Palmer for £40m plus £2.5m in add-ons. Sometimes everyone leaves a negotiation feeling triumphant. In this case City bolstered their financial fair play position by selling a homegrown player who was on the fringes of the first team, Chelsea paid relatively little for a top young talent and Palmer joined a club who, for all their instability, were ready to offer him regular football. Continue reading...","content":"C lubs with a coherent recruitment process do not really do regrets. It is why Manchester City are unlikely to be caught fretting about selling Cole Palmer to Chelsea in the summer. Outsiders may view it as a risk, particularly as Palmer is in excellent form before facing his boyhood club on Sunday afternoon, but City are hardly short of attacking talent and conduct their transfer business in a way that means they do not have to second-guess themselves about letting players go. Still Chelsea are entitled to argue that they got a bargain when they signed Palmer for £40m plus £2.5m in add-ons. Sometimes everyone leaves a negotiation feeling triumphant. In this case City bolstered their financial fair play position by selling a homegrown player who was on the fringes of the first team, Chelsea paid relatively little for a top young talent and Palmer joined a club who, for all their instability, were ready to offer him regular football. Nobody has to feel bitter. Palmer hoped this would be his breakthrough season at City, especially after Riyad Mahrez moved to Saudi Arabia, and there were positive signs at the start of the campaign. The 21-year-old scored a gorgeous goal against Arsenal in the Community Shield and headed in City’s equaliser against Sevilla in the European Super Cup . Was Palmer about to follow in the footsteps of another of City’s academy stars, Phil Foden, and force his way into Pep Guardiola’s plans? Foden is established with City and England, but Guardiola clearly liked Palmer and gave him opportunities last season. Cole Palmer occupies the Sevilla defence during Manchester City’s Super Cup victory in August. Photograph: Raddad Jebarah/NurPhoto/Getty Images When it came to the crunch, though, City could not quite justify keeping Palmer around. European champions tend to be ruthless. Guardiola, who also had Kevin De Bruyne, Jack Grealish, Julián Álvarez, Bernardo Silva and Foden, looked elsewhere. The writing was on the wall for Palmer when City signed Matheus Nunes and Jérémy Doku. It made no sense for Palmer to stay and fight for his place. He played a key role in England winning the European Under-21 Championship in July and could not afford to be sidelined. Other avenues were waiting to be explored. City had rejected Brighton’s £35m bid for Palmer and there was interest from Burnley and West Ham. Drumming up a deal for the attacker was not going to be a problem. Even so it would be wrong to say Palmer was Chelsea’s first choice given they came within a whisker of signing Michael Olise from Crystal Palace. It is true that Joe Shields, the co-director of recruitment and talent, knew Palmer from his time at City’s academy. Shields could vouch for Palmer’s ability and Chelsea spent much of the summer quietly monitoring the situation. skip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Mauricio Pochettino watches Cole Palmer in action for Chelsea. He is a regular starter at his new club. Photograph: Javier García/Shutterstock Yet the move itself was opportunistic. Chelsea were short in attack after losing Christopher Nkunku and Carney Chukwuemeka to injury. Mauricio Pochettino called for reinforcements. Chelsea, notoriously blunt in the final third, needed help. However, eyebrows were raised when Palmer was added to a squad already packed with youth; it seemed odd that Chelsea would sign a right-sided attacker when they had Raheem Sterling, Noni Madueke and Mykhailo Mudryk. There were fears that Palmer would be swallowed up. He is from Wythenshawe, south Manchester, and had only known life at City. He is alone in London, away from his family, and has delivered a few self-deprecating lines about missing his mum’s cooking and learning how to use a washing machine. Do not mistake that for a lack of self-belief, though. Palmer has embraced the challenge and quickly become one of the symbols of Chelsea’s youth-led revolution. Having been eased in by Pochettino, Palmer has not looked back since coming into the starting XI. He announced himself with an assist on his debut in Brighton and excelled on his first league start, making Armando Broja’s goal in Chelsea’s win over Fulham . Pochettino has seen a player seizing responsibility. Palmer has assumed penalty duties, scoring three times from the spot, and captained England Under-21s last month. Chelsea are mid-table and have issues in attack but Palmer is not one of them. Capable of playing on the right, and even impressing as a false 9 against Arsenal last month, he has infused Pochettino’s side with ideas and invention. This is not a luxury player. When he was 16 Palmer was behind others in his age group at City. He was smaller so he focused on developing his footwork. He figured out how to escape tight situations. The growth spurt followed. At 6ft, Palmer is no pushover. He can handle the physical side, even if he still looks slender, and is not easy to dispossess. Along with the clever passing, there is an elegance to Palmer’s movement and the way he unbalances defenders. There was an instructive moment at the start of Chelsea’s wild 4-1 win over Tottenham on Monday. The visitors were under pressure after going 1-0 down and were being pressed by Spurs. But when Palmer picked up possession in his own half and found himself being pushed backwards, he stayed calm, trusted in his technique and bamboozled Destiny Udogie with a sublime Cruyff turn. No wonder Gareth Southgate is keeping an eye on Palmer, who could be drafted into the England squad after James Maddison’s withdrawal through injury. No wonder Chelsea are no longer having to answer questions about selling Mason Mount and Kai Havertz. Palmer has brightened the picture and although City will back their long-term judgment they will not underestimate their former player on Sunday afternoon.","pubDate":"2023-11-11 12:00:34","image_url":"https://i.guim.co.uk/img/media/2814e0ebaca3d78f2a877d1754b19b916c816092/0_0_5000_3000/master/5000.jpg?width=460&quality=85&auto=format&fit=max&s=07dbc0362978a32632088b2ce16e3fd0","source_id":"theguardian","source_priority":106,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"6fa0b180b8f0c488d95521365f1ee1d8","title":"Wonder jockey produces 'filthy ride' to win from impossible spot as fans say 'different class'","link":"https://www.dailystar.co.uk/sport/horse-racing/wonder-jockey-wins-filthy-race-31415445","keywords":["Sport"],"creator":null,"video_url":null,"description":"Horse racing fans were left in awe after witnessing prodigy jockey Billy Loughnane's stunning ride at Newcastle where he won from an 'impossible spot'","content":"fans were left hailing wonder jockey Billy Loughnane after they watched him ride to an improbably victory at on Friday afternoon. Racing in the 4.45, Loughnane, riding Spangled Mac, looked to have no hope of winning two furlongs out, with the young jockey and his horse at the back of the pack. However, the 17-year-old somehow managed to fly through the field, charging past his competitors to claim an improbably win. The teenager has enjoyed an incredible season, having recently been named as the 2023 Champion Apprentice Jockey on Champions Day at last month. And fans on social media were also left stunned by Loughnane and Spangled Mac's 'filthy ride'. One fan commented on X, formerly Twitter: \"Billy Loughnane that is simply disgusting..! How has he got Spangled Mac up there!\" A second said: \"No Words...Sensational. Billy Loughnane take a bow.\" A third wrote: \"Oh that is filthy.\" A fourth added: \"Never panicked, fantastic talent in the saddle.\" The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . A fifth said: \"A ride that should be shown to every aspiring young rider. Minimal use of the whip and brilliant fitness levels shown to coax Spangled Mac into contention under hands and heels. An incredible ride from an incredible talent.\" And a sixth added: \"He’ll go onto be the best jockey on the planet and I can’t wait for it. He’s already better than the Doyler that’s for sure.\" TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month With Loughnane being tipped to go on to have a huge successful career, it's easy to see just why fans are gravitating to supporting the teenager following his incredible 2023 season. \"It’s been crazy and to have ridden 100 winners in less than a year is pretty unreal,\" said Loughnane when asked about his crazy season. \"There’s been a few highlights, one of which was having my first winner for Godolphin on Sapphire Seas. I just got up to win by a nose which was massive for me.\"","pubDate":"2023-11-11 13:19:00","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415662.ece/ALTERNATES/s98/2_Spangled-Mac-incredible-win-from-behind.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"56a6bf3e1367dc651e3ba70f5f2f1f71","title":"World Cup team left with just 14 outfield players due to FIFA rule after four are banished","link":"https://www.dailystar.co.uk/sport/football/poland-u17-world-cup-players-31415538","keywords":["Sport"],"creator":null,"video_url":null,"description":"A World Cup team has been left with just 14 outfield players after four of them were sent home in disgrace with FIFA rulings barring any replacements","content":"The U17 has been hit by a serious scandal that has seen four players banished from the national camp. Poland’s preparations for the tournament have been marred after four of their players were banished from the team’s training camp after they were removed due to unsportsmanlike behaviour and violation of the regulations – having been caught with alcohol. And the four departing players - Oskar Tomczyk, Filip Rozga, Jan Labedzki, and Filip Wolski - cannot be replaced due to FIFA ruling – meaning Poland now only have 14 outfield players to select from due to the regulations regarding replacements on the submitted player list. FIFA addressed the situation regarding the axed players, saying: “As per Article 27.3 of the tournament regulations, a player listed on the final list may be replaced by a player from the provisional list only in the event of serious injury or illness up until 24 hours before the kick-off of their team’s first match.” Poland U17 coach Marcin Wlodarski admitted he felt the team's scandal was a ‘personal failure’ of his. He said: \"The players broke the rules and there was no other option but for them to leave the team. I see these boys as family, we spend a lot of time together. So I treat this as a personal failure of mine. \"We cannot let such acts slide. I believe these boys will reflect on this, understand that their actions have consequences and re-join the team one day, just not anytime soon. I've spoken with the parents and everyone is disappointed. \"Everyone worked hard to get here, but we need to condemn this, because these things cannot happen, especially not on the national team. For each of these boys, I would have cut my hand off for them and now I wouldn't have a hand.\" Poland played their opening tournament game on Saturday, falling to a 1-0 defeat against Japan, where they were able to name just six substitutes. They find themselves in one of the toughest groups in the tournament, alongside Senegal and Argentina – where all eyes will be on 15-year-old Senegal sensation .","pubDate":"2023-11-11 13:14:35","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415519.ece/ALTERNATES/s98/0_Japan-v-Poland-Group-D-FIFA-U-17-World-Cup.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1ab99200da5f47974db6e83182bcf619","title":"Erik ten Hag makes Mason Mount feelings clear and explains why he's dropped Man Utd star","link":"https://www.mirror.co.uk/sport/football/news/mason-mount-man-utd-tenhag-31415472","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alan Smith)"],"video_url":null,"description":"The England midfielder is struggling for minutes and form but under fire United boss says his view of a \"very important player\" has not changed","content":"Erik ten Hag has insisted his view of Mason Mount “hasn’t changed at all” despite the £55m midfielder’s struggles since joining Manchester United in the summer. Mount arrived from Chelsea with high expectations as Ten Hag’s first signing of the transfer window but has struggled for form and battled injury. The 24-year-old has also fallen out of the England reckoning and now appears to be restricted to appearances off the bench at Old Trafford - despite the team’s dire form. And Ten Hag, speaking before this afternoon’s visit of Luton Town, said that with other players doing well Mount must be patient before earning his spot back. Every Premier League club affected by new transfer proposal with Man Utd set to join Alejandro Garnacho labelled \"a clown\" by Copenhagen star after trying sneaky tactic again His only start in the past month has come in the EFL Cup hammering against Newcastle United and Sofyan Amrabat was sprung from the bench before him in Wednesday evening’s chaotic Champions League defeat away to Copenhagen. “He had some starts,” Ten Hag said. “Also recently, last week against Newcastle, but there are always reasons and sometimes, like the injury [at the start of the season] and other players doing well, then you have to wait for your time to play.” When Mount arrived at United Ten Hag told him, in front of the club’s media channel, that “I want you to be a very important player for this team.” But his most recent league goal came on December 27 and he last provided an assist in October of last year. Mount has also struggled significantly in the past year with a lingering pelvic issue. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here But Ten Hag is continuing to back him in the long-term and, asked if his first impression is different to his current view, the under-fire Dutchman said: “It hasn’t changed at all. But he started the season, then he got injured, so that is the worst moment for a new player to get injured because it stops the integration process and that was a setback for us all. Now we have to find his place back.” United have lost nine of their opening 17 games in all competitions and in addition to teetering on the brink in Europe they are already nine points off Manchester City in the Premier League table. Ten Hag must also plan for Luton without midfielder Casemiro, who is set to be out until January with a hamstring injury, in addition to defenders Luke Shaw and Lisandro Martinez. He has also reportedly had a row with centre half Raphael Varane, who has spent recent weeks on the substitutes’ bench. Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-11-11 12:30:20","image_url":"https://i2-prod.mirror.co.uk/incoming/article31407071.ece/ALTERNATES/s615/0_GettyImages-1771543629.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"87784e1a3172c7bb12b0d4a05f7c51fa","title":"Wolves v Tottenham: Premier League – live","link":"https://www.theguardian.com/football/live/2023/nov/11/wolves-v-tottenham-premier-league-live","keywords":["Premier League","Football","Wolverhampton Wanderers","Tottenham Hotspur","Sport"],"creator":["Barry Glendenning"],"video_url":null,"description":"Premier League updates from the 12.30pm GMT kick-offFollow Guardian sport on Instagram, Threads and YouTubeRemembering the fallen: Wolves will join the rest of the football world this weekend by paying their respects to those who have served their country. A period of silence will be observed before kick-off and bugler Lesley Jenkins, from the West Midlands Police Band, will play The Last Post, before representatives of the Armed Forces lay a wreath.Referee: Tim RobinsonReferee’s assistants: Timothy Wood and Wade SmithFourth official: Thomas BramallVAR: Paul Tierney Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 24m ago GOAL! Wolves 0-1 Tottenham Hotspur (Johnson 3) 27m ago Wolves v Tottenham Hotspur is go ... 1h ago Wolves v Tottenham Hotspur line-ups 2h ago Early team news 2h ago Premier League: Wolves v Tottenham Hotspur Show key events only Please turn on JavaScript to use this feature 1m ago 12.58 GMT 25 min: A sloppy pass from Emerson Royal gifts Wolves a throw-in near the halfway line and moments later, Pedro Porro is penalised for a foul on Toti. 3m ago 12.56 GMT 24 min: Tottenham’s high defensive line threatens to be their undoing as Wolves play the ball in behind, forcing Ben Davies into a foot race with Hwang. The visitors get away with it on this occasion. 5m ago 12.54 GMT 22 min: Porro receives treatment for what looks like a calf injury and is fit to continue for the time being at least. He’s limping quite heavily and Spurs really can’t afford to lose him. 6m ago 12.53 GMT 20 min: Pedro Porro goes down roaring in pain after being fouled by Joao Gomes. The Wolves midfielder is lucky to avoid a booking for his late challenge on the Tottenham right-back, who had given him the slip. 8m ago 12.51 GMT 19 min: Ait-Nouri gallops through the centre and pings a low ball towards Hwang, who does well to control it under pressure. The South Korean runs into traffic on the edge of the Spurs penalty area before he can pull the trigger. 10m ago 12.49 GMT 18 min: Wolves win two corners in quick succession but are unable to clear the first Tottenham defender with either delivery. 11m ago 12.48 GMT 16 min: Yves Bissouma cedes possession to Lemina in midfield and Wolves surge forward again. Hwang Hee-chan pulls the ball back towards Bellegarde after getting the better of Dier down by the byline, but the Frenchman has his back to goal and is unable to shoot on the turn. 13m ago 12.46 GMT 14 min: Wolves have got a firm foothold in the game after that very early setback and are now giving Tottenham plenty to think about. It’s shaping up to be a good game. 14m ago 12.45 GMT 13 min: There’s a break in play as Mario Lemina receives treatment from the Wolves physios. He seems to be OK. 16m ago 12.43 GMT 10 min: Showing no ill-effects from his blow to the head, Ben Davies does brilliantly to dive in and block a shot on goal from Ait-Nouri after Eric Dier had lost the ball in midfield and Wolves had broken upfield at speed. 18m ago 12.41 GMT 9 min: Jeanricner Bellegarde plays the ball out wide to Joao Gomes, who crosses. Ben Davies goes down after the ball is blasted into the side of his head by Toti Gomes and referee Tim Robinson stops play, provoking the ire of the home crowd. Updated at 12.44 GMT 20m ago 12.40 GMT 7 min: Their confidence buoyed, Tottenham continue to dominate these early stages. Kulusevki takes on and beats Rayan Ait-Nouri on the right flank and sends a cross into the Wolves penalty area. It’s blocked and the home side clear. 21m ago 12.38 GMT 4 min: It’s a wonderful start for Tottenham, their opener orchestrated by excellent work by Pedro Porro. The ball was pinged his way by Dejan Kulusevski and he looked to have slipped but we’re going to give him the benefit of the doubt and say it was a clever dummy. Porro squared the ball for Johnson, who was quickest to react on the edge of the six-yard box and poke home. 24m ago 12.35 GMT GOAL! Wolves 0-1 Tottenham Hotspur (Johnson 3) Tottenham take the lead! Brennan Johnson scores his first goal for Spurs, slotting the ball home from six yards after getting on the end of a squared ball sent his way by Pedro Porro. Brennan Johnson steals in to give Spurs an early lead! Photograph: Jason Cairnduff/Action Images/Reuters Updated at 12.38 GMT 25m ago 12.34 GMT 2 min: Tottenham goalkeeper Guglielmo Vicario gets an early touch and Tottenham play the ball out from the back. 27m ago 12.32 GMT Wolves v Tottenham Hotspur is go ... 1 min: With the last of the perfectly observed pre-match formalities over, Wolves get the ball rolling in what could be a fascinating game. It’s played straight back to goalkeeper Jose Sa. Updated at 12.32 GMT 32m ago 12.27 GMT Not long now: With the monster riffola of Led Zeppelin blaring over the Tannoy, the teams march out on to the Molineux pitch and line up either side of referee Tim Robinson and his team of match officials. Kick-off is just a few minutes away but first there’ll be a moment’s reflection for remembrance day. Updated at 12.30 GMT 42m ago 12.18 GMT Joao Gomes and his Wolves teammates warm up ahead of kick-off. Photograph: Jack Thomas/WWFC/Wolves/Getty Images 54m ago 12.05 GMT In an innovation that seems unlikely to catch on, TNT Sports have kitted Brennan Johnson and Max Kilman out with bodycams for their pre-match warm-ups, so viewers can get an unprecedented insight into what it’s like for a professional footballer to do shuttle runs and keepy-uppies. Photograph: Ryan Browne/Shutterstock Updated at 12.06 GMT 1h ago 12.00 GMT Remembering the fallen: Wolves will join the rest of the football world this weekend by paying their respects to those who have served their country. A period of silence will be observed before kick-off and bugler Lesley Jenkins, from the West Midlands Police Band, will play The Last Post, before representatives of the Armed Forces lay a wreath. 1h ago 11.54 GMT Today’s match officials Referee: Tim Robinson Referee’s assistants: Timothy Wood and Wade Smith Fourth official: Thomas Bramall VAR: Paul Tierney Referee Tim Robinson leads the team of match officials for today’s match at Molineux. Photograph: Jan Kruger/Getty Images 1h ago 11.44 GMT Those teams: Gary O’Neil makes two changes to the side that lost against Sheffield United last time out Jean-Ricner Bellegarde and Joao Gomes come into the side, with Tommy Doyle and Sasa Kalajdzic dropping to the substitutes’ bench. Ange Postecoglou has been forced to make four changes to the side that lost against Chelsea on Monday night. Eric Dier comes in at centre-half and will play alongside Ben Davies or Emerson Royal. Pierre-Emile Hojbjerg also starts alongside Yves Bissouma in midfield. Tottenham’s bench looks a little threadbare but features Oliver Skipp, Giovani Lo Celso and Rodrigo Bentancur, among others. Ange Postecoglou has made four changes to the Tottenham Hotspur side that lost against Chelsea on Monday night. Photograph: Tom Jenkins/The Guardian Updated at 12.24 GMT 1h ago 11.34 GMT Matchday merchandise on sale outside Molineux. Photograph: Ryan Browne/Shutterstock 1h ago 11.33 GMT Wolves v Tottenham Hotspur line-ups Wolves: Sa; Semedo, Dawson, Kilman, Toti; Bellegarde, Lemina, Gomes, Ait-Nouri; Hwang, Cunha. Subs: Bentley, Doherty, Traore, Silva, Bueno, Kalajdzic, Jonny, Doyle, Sarabia. Tottenhamn Hotspur: Vicario; Porro, Royal, Dier, Davies; Sarr, Hojbjerg, Bissouma; Kulusevski, Son, Johnson. Subs: Forster, Skipp, Gil, Lo Celso, Bentancur, Phillips, Veliz, Donley, Dorrington. 2h ago 11.29 GMT ‘A very special game’: South Korea gears up for Hwang v Son showdown Read more 2h ago 11.24 GMT Early team news Tottenham lost James Maddison and Micky van de Ven to injury on Monday night and both hugely influential summer signings are expected to be out until the New Year. They join Manor Solomon, Ivan Perisic, Ryan Sessegnon and Alfie Whiteman in the treatment room, while Richarlison is also set to spend a month or so on the sidelines after undergoing surgery on his groin. Cristian Romero and Destiny Odogie are also absent this afternoon through suspension after getting sent off against Chelsea. In better news for Spurs, Ben Davies is fit after recovering from an ankle injury and is likely to come straight back into the first team. Wolves have far fewer personnel problems but Pedro Neto remains absent. Defensive midfielder Joe Hodge is also out with a shoulder injury but Hugo Bueno is available again after recovering from a hamstring issue. ‘Worse than we thought’: Postecoglou says injured Maddison out till January Read more James Maddison lies on the Tottenham Hotspur Stadium pitch after suffering the ankle injury that will keep him out until the New Year. Photograph: Tony Obrien/Reuters 2h ago 11.24 GMT Premier League: Wolves v Tottenham Hotspur With an international break looming, Wolves host Spurs in the opening Premier League game of the weekend. Following Monday night’s chaotic defeat at the hands of Chelsea, Ange Postecoglou brings a severely depleted squad to Molineux, his options seveely limited by injury and suspension. Wolves lost against Sheffield United last time out but were somewhat unfortunate to do so, going down to a late, late Ollie Norwood penalty that should not have been awarded. Unbeaten in four prior to that defeat, Gary O’Neil’s side will be hopeful of taking all three points at home against their depleted visitors. Kick-off is at 12.30pm (GMT) but stay tuned in the meantime for team news and build-up. Explore more on these topics Premier League Premier League live Wolverhampton Wanderers Tottenham Hotspur Reuse this content","pubDate":"2023-11-11 12:24:50","image_url":"https://i.guim.co.uk/img/media/e327658f635f19e4610d91545dc2366f835bd063/0_206_4425_2655/master/4425.jpg?width=460&quality=85&auto=format&fit=max&s=567e0b906fce511409f79014e6cc14aa","source_id":"theguardian","source_priority":106,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"1c271c2d27392f3e0a14d23d128ef790","title":"Premier League referees' chiefs advertise new VAR job after Mikel Arteta \"disgrace\" rant","link":"https://www.mirror.co.uk/sport/football/news/premier-league-var-arteta-arsenal-31415061","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Nathan Ridley)"],"video_url":null,"description":"The future of VAR in the Premier League continues to make headlines, with the PGMOL still reeling from Arsenal manager Mikel Arteta's furious blast last weekend","content":"The PGMOL are looking to recruit new \"specialist\" VAR officials amid the increasing criticism of its use in the Premier League . VAR once again stole the headlines last weekend after Arsenal suffered a controversial 1-0 defeat away to Newcastle , with Anthony Gordon's winning goal being subject to a lengthy check to decide on three incidents within the build-up. That prompted Arsenal boss Mikel Arteta to furiously label the officiating a \"disgrace,\" and now the PGMOL - the body in charge of the Premier League's referees - are ramping up their efforts to improve VAR. The Sun report that an advert is currently circulating among 75 elite referees in both the men's and women's game for staff who'd work specifically to help video assistant referees. The advert is asking for officials who can \"provide clear communication under pressure\" and are \"capable of self-reflection on how they have performed.\" Erik ten Hag could get unlikely VAR wish after controversial Man Utd incidents Graeme Souness speaks out after Mikel Arteta is slammed following \"embarrassing\" VAR rant It's also stated that they'd need to \"identify when VAR needs to intervene,\" and have the \"ability to focus and have great communication skills.\" Last season, retired on-field referee Mike Dean took up a role dedicated to VAR, following in former colleague Lee Mason's footsteps. However, both Dean and Mason left their respective roles earlier this year amid the intense scrutiny on VAR. This week, in the wake of Arteta's infamous post-match rant, the Premier League's Key Match Incidents panel ruled that Newcastle's goal was indeed correctly awarded. Have your say! Should the Premier League scrap VAR? Let us know your stance in the comments section . Mikel Arteta labelled the officiating during Arsenal's 1-0 defeat to Newcastle a \"disgrace\" ( Image: Stu Forster/Getty Images) When quizzed on the panel's verdict, which also found that Arsenal midfielder Kai Havertz should've been shown a red card for a reckless challenge in the first half, Arteta attempted to move away from the topic. \"I think we had a lot of reactions after that match,\" the Gunners boss said on Friday. \"It's time to move forward, to focus on Burnley and talk about tomorrow's game.\" Nevertheless, Arteta was pressed to discuss VAR and comment on reports that it could take 10 years to iron out its imperfections. \"I will probably be bald in 10 years,\" he joked. \"Life will be very different, maybe we will have other new rules in football, so I don't know. Let's try to do everything that we can, individually and collectively to improve the game in every aspect and that's it.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don't like our community, you can check out any time you like. If you're curious, you can read our Privacy Notice . This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here","pubDate":"2023-11-11 12:15:44","image_url":"https://i2-prod.mirror.co.uk/incoming/article31415220.ece/ALTERNATES/s615/2_GettyImages-1774759662.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"21f060516f4d1ae4b776b66a31a3793a","title":"Soccerladuma | Man Utd 'Planning To Dump' Three Stars In January","link":"https://www.snl24.com/soccerladuma/international/manchester-united/man-utd-planning-to-dump-three-stars-in-january-20231110","keywords":null,"creator":null,"video_url":null,"description":"Manchester United are reportedly planning to offload three of their senior attackers when the January transfer window opens.","content":"Manchester United are reportedly planning to offload three of their senior attackers when the January transfer window opens. The United has been nothing short of disappointing, with Marcus Rashford being the only wide or forward player to score a goal in the Premier League. The Sun have reported that the club are now looking to offload Anthony Martial, Jadon Sancho and Antony as they aim to cut ties on their losses. Sancho has not featured since the loss to Tottenham Hotspur earlier in the season after falling out with manager Erik ten Hag, with the player not expected to feature for the club again. Martial has only scored one goal in all competitions this season but has played second fiddle to Rasmus Hojlund, while £85million signing Antony has failed to impress since joining the club last season. The report adds the moves comes as Sir Jim Ratcliffe is set to take over football matters at the club when he completes a deal to buy 25 per cent of the Red Devils. Antony was linked with a return to Brazil earlier this week, but Flamengo vice president has already ruled out a swap move involving Gabriel Barbosa. Sancho, meanwhile, has been linked with a return to Bundesliga outfit Borussia Dortmund while a couple Premier League are also reportedly said to be keen. You must be to read and post comments","pubDate":"2023-11-11 12:10:51","image_url":"https://cdn.24.co.za/files/Cms/General/d/9824/85e413c7f1c2490fbe65d98d1b7b6c87.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"50496bafc4c1a07c33dd1b84a93e0887","title":"Soccerladuma | Wydad Coach Bemoans Loss of Star Player Ahead Of Downs Clash","link":"https://www.snl24.com/soccerladuma/international/african-football-league/wydad-coach-bemoans-loss-of-star-player-ahead-of-downs-clash-20231110","keywords":null,"creator":null,"video_url":null,"description":"Wydad Casablanca head coach Adil Ramzi says the team remains motivated after losing Yahya Jabrane ahead of the African Football League final against Mamelodi Sundowns.","content":"Wydad Casablanca head coach Adil Ramzi says the team remains motivated after losing Yahya Jabrane ahead of the African Football League final against Mamelodi Sundowns. The midfielder completed the full 90 minutes in Casablanca last weekend but will play no part in the second leg due to suspension after an accumulation of yellow cards. The Wydad tactician says Jabrane is an important player for the team but says he is looking at the entire squad. “Jabrane is a very important player for us and that is why we have carried him to motivate the rest of the squad,\" Ramzi said, as per \"However, for me as a coach iam looking at the whole group and not just one player. “This is a big match and every player is motivated to play. We will do our best to win this trophy,” he concluded. Despite winning the first leg last weekend, Ramzi insists his side cannot take things lightly at Loftus Versfeld. “It is a big game and being the last one, every one wants to win. We won 2-1 in the first leg which was a good result for us. However, it is still 50/50 chance for either team to win,” he added. You must be to read and post comments","pubDate":"2023-11-11 12:10:51","image_url":"https://cdn.24.co.za/files/Cms/General/d/9824/0a78a2b2a4eb48f6947da4d0e184f8fc.jpg","source_id":"soccerladuma","source_priority":103202,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"2773481d98afc45e0f7b7ddf2a1c8ec3","title":"GAA: This weekend’s club championship fixtures","link":"https://kildare-nationalist.ie/2023/11/11/gaa-this-weekends-club-championship-fixtures-3/","keywords":["National Sport"],"creator":["Kildare Nationalist Reporter"],"video_url":null,"description":"Provincial club championships have reached their quarter-final stages across the four provinces. Here are all the football and hurling fixtures taking place this weekend… Ulster Senior Football quarter-finals: Trillick (Tyrone) v Crossmaglen Rangers (Armagh) – Healy Park, Saturday, 7.15pm – Live coverage on RTÉ Two from 7pm Glen (Down) v Cargin (Antrim) – Celtic Park,... Source","content":"Provincial club championships have reached their quarter-final stages across the four provinces. Here are all the football and hurling fixtures taking place this weekend… Ulster Senior Football quarter-finals: Trillick (Tyrone) v Crossmaglen Rangers (Armagh) – Healy Park, Saturday, 7.15pm – Live coverage on RTÉ Two from 7pm Glen (Down) v Cargin (Antrim) – Celtic Park, Sunday, 3pm Kilcoo (Derry) v Scotstown (Monaghan) – Páirc Esler, Sunday, 3.15pm – Live coverage on TG4 from 3.10pm Gowna (Cavan) v Naomh Conaill (Donegal) – Breffni Park, Sunday, 4.30pm It’s a big weekend of #UlsterClub2023 action, with all Senior & Intermediate Football Quarter Finals taking place across Saturday & Sunday, as well as the Junior Hurling Semi Finals 🏐⚾️🏆 All the info for supporters attending the games ➡️ https://t.co/FRXv48pYFt #ClubMeansMore pic.twitter.com/dMLE0slOx1 — Ulster GAA (@UlsterGAA) November 11, 2023 Connacht Senior Football quarter-finals: Ballina Stephenites (Mayo) v Fulham Irish (London) – MacHale Park, Saturday, 6pm St Brigid’s (Roscommon) v Coolera-Strandhill (Sligo) – Dr Hyde Park, Sunday, 2pm Munster Senior Football quarter-finals: Clonmel Commercials (Tipperary) v Newcastle West (Limerick) – Semple Stadium, Sunday, 1.30pm Castlehaven (Cork) v Cratloe (Clare) – Páirc Uí Chaoimh, Sunday, 1.30pm Castlehaven’s Munster Club SFC clash with Cratloe switched to Páirc Uí Chaoimh https://t.co/HZoh5dYqxR — Munster GAA (@MunsterGAA) November 10, 2023 Leinster Senior Hurling quarter-finals: Naomh Eanna (Wexford) v Kilcormac-Killoughey (Offaly) – Wexford Park, Sunday, 1.30pm – Live coverage on TG4 from 1pm Raharney (Westmeath) v Na Fianna (Dublin) – Cusack Park, Sunday, 2pm Camross (Laois) v Naas (Kildare) – O’Moore Park, Sunday, 3pm Mount Leinster Rangers (Carlow) v O’Loughlin Gaels (Kilkenny) – Cullen Park, Sunday, 3.30pm","pubDate":"2023-11-11 12:10:03","image_url":null,"source_id":"kildare-nationalist","source_priority":2606560,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"1d8745f4e0f05668d8bad9e357c56f96","title":"'I tackled everyone I could during Arsenal training – even Arsene Wenger'","link":"https://www.dailystar.co.uk/sport/football/kolo-toure-arsenal-wenger-trial-31415245","keywords":["Football"],"creator":null,"video_url":null,"description":"Kolo Toure told his side of the story about his infamous Arsenal trial which saw him 'trying to tackle everything' – including Arsene Wenger","content":"Kolo Toure admitted he was \"trying to tackle everything\" during his infamous trial that saw him take out . Toure’s first days at Arsenal are well known. And for anyone who watched his career unfold, the story about his trial as a 21-year-old while he was still at ASEC Mimosas in his homeland will come as little surprise. A recording of former Arsenal hero Ray Parlour’s story was played about how Toure smashed into Thierry Henry and Dennis Bergkamp – with Wenger shrieking at him not to go in heavy on the Gunners’ star players. Parlour later told how after making a good interception, Toure followed the ball out before smashing into Wenger and leaving the man he was trying to impress in pain on the deck. Toure listened to the recording with a huge smile on his face before telling his side of the story to former Arsenal team-mate Martin Keown on talkSPORT. He said: “Like Martin said, I was so enthusiastic. “I can’t believe I was training with these guys, coming there and with players that were my idols. When the game started, I wanted to show what I was capable of doing because for me it was a big chance and I didn’t want to miss that at all. I was trying to tackle everything I could, including the manager.” Keown added how Wenger was impressed by Toure’s mentality, immediately wanting to offer the Ivorian a contract, he said: “Do you remember what the manager said? He was getting to his feet and he said ‘we sign him, we sign him, please do it’.” That quip saw both of the former Invincibles burst into laughter. Toure went on to play 326 games in all competitions for Arsenal across seven years in North London – lifting the and FA Cup twice at Arsenal. He later joined in 2009, going on to win a further Premier League title and FA Cup. After leaving the Etihad, Toure played for three years at Liverpool before moving north of the border and playing under Brendan Rodgers at Celtic for a short spell before becoming part of his coaching staff at Parkhead and . Toure most recently took charge of last season but was sacked after going winless in his nine games in charge.","pubDate":"2023-11-11 12:00:58","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31415212.ece/ALTERNATES/s98/0_Arsenal-Juventus-Training-Press-Conference.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"23b87a4ee501eb2d59e1484034e649ef","title":"Cole Palmer has nothing to prove to City after winning Pochettino’s trust","link":"https://www.theguardian.com/football/2023/nov/11/cole-palmer-has-nothing-to-prove-manchester-city-chelsea-pochettino","keywords":["Chelsea","Manchester City","Football","Sport"],"creator":["Jacob Steinberg"],"video_url":null,"description":"Chelsea bagged a bargain by signing the former Guardiola fledgling who has seized his chance at Stamford BridgeClubs with a coherent recruitment process do not really do regrets. It is why Manchester City are unlikely to be caught fretting about selling Cole Palmer to Chelsea in the summer. Outsiders may view it as a risk, particularly as Palmer is in excellent form before facing his boyhood club on Sunday afternoon, but City are hardly short of attacking talent and conduct their transfer business in a way that means they do not have to second-guess themselves about letting players go.Still Chelsea are entitled to argue that they got a bargain when they signed Palmer for £40m plus £2.5m in add-ons. Sometimes everyone leaves a negotiation feeling triumphant. In this case City bolstered their financial fair play position by selling a homegrown player who was on the fringes of the first team, Chelsea paid relatively little for a top young talent and Palmer joined a club who, for all their instability, were ready to offer him regular football. Continue reading...","content":"C lubs with a coherent recruitment process do not really do regrets. It is why Manchester City are unlikely to be caught fretting about selling Cole Palmer to Chelsea in the summer. Outsiders may view it as a risk, particularly as Palmer is in excellent form before facing his boyhood club on Sunday afternoon, but City are hardly short of attacking talent and conduct their transfer business in a way that means they do not have to second-guess themselves about letting players go. Still Chelsea are entitled to argue that they got a bargain when they signed Palmer for £40m plus £2.5m in add-ons. Sometimes everyone leaves a negotiation feeling triumphant. In this case City bolstered their financial fair play position by selling a homegrown player who was on the fringes of the first team, Chelsea paid relatively little for a top young talent and Palmer joined a club who, for all their instability, were ready to offer him regular football. Nobody has to feel bitter. Palmer hoped this would be his breakthrough season at City, especially after Riyad Mahrez moved to Saudi Arabia, and there were positive signs at the start of the campaign. The 21-year-old scored a gorgeous goal against Arsenal in the Community Shield and headed in City’s equaliser against Sevilla in the European Super Cup . Was Palmer about to follow in the footsteps of another of City’s academy stars, Phil Foden, and force his way into Pep Guardiola’s plans? Foden is established with City and England, but Guardiola clearly liked Palmer and gave him opportunities last season. Cole Palmer occupies the Sevilla defence during Manchester City’s Super Cup victory in August. Photograph: Raddad Jebarah/NurPhoto/Getty Images When it came to the crunch, though, City could not quite justify keeping Palmer around. European champions tend to be ruthless. Guardiola, who also had Kevin De Bruyne, Jack Grealish, Julián Álvarez, Bernardo Silva and Foden, looked elsewhere. The writing was on the wall for Palmer when City signed Matheus Nunes and Jérémy Doku. It made no sense for Palmer to stay and fight for his place. He played a key role in England winning the European Under-21 Championship in July and could not afford to be sidelined. Other avenues were waiting to be explored. City had rejected Brighton’s £35m bid for Palmer and there was interest from Burnley and West Ham. Drumming up a deal for the attacker was not going to be a problem. Even so it would be wrong to say Palmer was Chelsea’s first choice given they came within a whisker of signing Michael Olise from Crystal Palace. It is true that Joe Shields, the co-director of recruitment and talent, knew Palmer from his time at City’s academy. Shields could vouch for Palmer’s ability and Chelsea spent much of the summer quietly monitoring the situation. skip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Mauricio Pochettino watches Cole Palmer in action for Chelsea. He is a regular starter at his new club. Photograph: Javier García/Shutterstock Yet the move itself was opportunistic. Chelsea were short in attack after losing Christopher Nkunku and Carney Chukwuemeka to injury. Mauricio Pochettino called for reinforcements. Chelsea, notoriously blunt in the final third, needed help. However, eyebrows were raised when Palmer was added to a squad already packed with youth; it seemed odd that Chelsea would sign a right-sided attacker when they had Raheem Sterling, Noni Madueke and Mykhailo Mudryk. There were fears that Palmer would be swallowed up. He is from Wythenshawe, south Manchester, and had only known life at City. He is alone in London, away from his family, and has delivered a few self-deprecating lines about missing his mum’s cooking and learning how to use a washing machine. Do not mistake that for a lack of self-belief, though. Palmer has embraced the challenge and quickly become one of the symbols of Chelsea’s youth-led revolution. Having been eased in by Pochettino, Palmer has not looked back since coming into the starting XI. He announced himself with an assist on his debut in Brighton and excelled on his first league start, making Armando Broja’s goal in Chelsea’s win over Fulham . Pochettino has seen a player seizing responsibility. Palmer has assumed penalty duties, scoring three times from the spot, and captained England Under-21s last month. Chelsea are mid-table and have issues in attack but Palmer is not one of them. Capable of playing on the right, and even impressing as a false 9 against Arsenal last month, he has infused Pochettino’s side with ideas and invention. This is not a luxury player. When he was 16 Palmer was behind others in his age group at City. He was smaller so he focused on developing his footwork. He figured out how to escape tight situations. The growth spurt followed. At 6ft, Palmer is no pushover. He can handle the physical side, even if he still looks slender, and is not easy to dispossess. Along with the clever passing, there is an elegance to Palmer’s movement and the way he unbalances defenders. There was an instructive moment at the start of Chelsea’s wild 4-1 win over Tottenham on Monday. The visitors were under pressure after going 1-0 down and were being pressed by Spurs. But when Palmer picked up possession in his own half and found himself being pushed backwards, he stayed calm, trusted in his technique and bamboozled Destiny Udogie with a sublime Cruyff turn. No wonder Gareth Southgate is keeping an eye on Palmer, who could be drafted into the England squad after James Maddison’s withdrawal through injury. No wonder Chelsea are no longer having to answer questions about selling Mason Mount and Kai Havertz. Palmer has brightened the picture and although City will back their long-term judgment they will not underestimate their former player on Sunday afternoon.","pubDate":"2023-11-11 12:00:34","image_url":"https://i.guim.co.uk/img/media/2814e0ebaca3d78f2a877d1754b19b916c816092/0_0_5000_3000/master/5000.jpg?width=460&quality=85&auto=format&fit=max&s=07dbc0362978a32632088b2ce16e3fd0","source_id":"theguardian","source_priority":106,"country":["united states of america"],"category":["sports"],"language":"english"}]}