{"newsArray":[{"article_id":"1bd0a622bdab251deaf67feef7785ad4","title":"May day: Can the Magpies pull the right lever to dismantle Melbourne?","link":"https://www.brisbanetimes.com.au/sport/afl/may-day-can-the-magpies-pull-the-right-lever-to-dismantle-melbourne-20230905-p5e20r.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Collingwood’s Jack Crisp says his team needs to play smart on Thursday night to avoid the Demons’ intercept kings Steven May and Jake Lever, and the stats back him up.","content":"Collingwood running machine Jack Crisp says the Magpies must find a way to hinder Demons defenders Steven May and Jake Lever in Thursday night’s qualifying final – and the statistics emphasise his point. The Magpies experienced first hand how lethal May’s intercept-marking can be in their sole match against the Demons this season; a King’s Birthday weekend clash that ended their eight-game winning streak. Melbourne backmen Steven May and Jake Lever are important rebounding defenders for their team. Credit: Getty May had four intercept marks that afternoon, the equal most of any Demon, while blanketing Brody Mihocek. His team combined for 23 intercept marks, their equal most for the season. The Magpies too often chose poor options when heading inside their forward 50 metres, meaning their forward line, already without Jamie Elliott, Daniel McStay and Jack Ginnivan, did not have its typical potency. Heading into a week-one finals blockbuster, Crisp says the Magpies will be ready for a physical start, but then must be clever when heading into attacking 50, for May and fellow intercepting master Lever will again be ready to pounce. Jake Lever and Steven May are one of the AFL’s most formidable key defensive duos. Credit: Getty Images “Finals is a different type of football. It’s going to be high-octane early; a lot of bodies flying everywhere, a lot of hard hits. But we feel like we will be ready for that from Melbourne,” Crisp said. “We have a few big boys in there as well that can throw their weight around. We will be ready to brace for that, then send the ball flying our way forward. “Hopefully, we can take out May and Lever, [their] intercepting players, and, hopefully, hold a lot of territory and put some scoreboard pressure on them.” Half-back Christian Salem was also instrumental in the King’s Birthday, amassing nine intercept possessions. Loading May was an All-Australian defender in 2021 and 2022 , but was overlooked this year. A deeper dive of the statistics shows the Demons have won 10 of the 11 games this year when he has taken at least three intercept marks. The anomaly was against Greater Western Sydney in round 16. In the 10 games May has taken two or fewer intercept marks, the Demons are 5-5. The Demons also boast a strong record when Lever – who was also chosen as an All-Australian in Melbourne’s 2021 premiership year – has a major influence. They have won nine of 12 games in which he has taken at least three intercept marks. “Me and Steve love playing with each other and the other backline players,” Lever said. Game plan: Jack Crisp says the Magpies cannot allow Demons Steven may and Jake Lever to flourish. Credit: Getty Images The May-Lever partnership is pivotal to the Demons boasting a defence that fits the profile of the past 10 premiership teams. In this period, the winning side has been ranked in the top six for points conceded, and points conceded from turnovers. The Demons this year boast the second-best defence, conceding just 72.2 points per game – only St Kilda (71.6) has been more frugal. Melbourne has also conceded the least number of points from turnovers (41.1), shading Brisbane (41.2) and Collingwood (41.4). May and Lever are central to this, for they are strong one-on-one defenders, are prepared to step across and help teammates, and, just as importantly, organise their team’s positioning behind the ball. Lever said the Magpies, now with McStay, Elliott and Ginnivan in the line-up, will be a major test. “We love that sort of challenge as a backline group. As a group of seven ... we really pride ourselves that, in the big moments in big games, we, hopefully, can stand up,” Lever said. “We have proven a couple of times this year that we have been able to do that, but that doesn’t mean it is going to get handed to us. Loading “The message for the Magpies is clear. Whoever lines up on May and Lever not only have the job of being offensive threats, but must take the ball to ground as often as possible, thereby hindering May and Lever’s influence, and slowing the Demons’ counter-attack. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Collingwood Magpies Melbourne Demons Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-05 01:55:51","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"bb5844975c5a87fdda22289f97dde04e","title":"What to look out for in Euro 2024 qualifying","link":"https://www.straitstimes.com/sport/football/what-to-look-out-for-in-euro-2024-qualifying-0","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 9:55 AMThe road to Germany resumes this week with key games for the continent’s heavyweights.","content":"PARIS – The road to Germany resumes this week as Euro 2024 qualifying kicks back into action with key games for the continent’s heavyweights. AFP Sport picks out some of the highlights with two rounds of matches spread over six days from September 7 to 12. Reigning European champions Italy have a new coach after Roberto Mancini’s resignation, with Luciano Spalletti hired as his replacement. Mancini resigned in mid-August, saying his decision had “nothing to do” with a possible move to Saudi Arabia. Two weeks later he was named as the new Saudi coach on a four-year deal. Spalletti, who left Napoli after leading them to the Serie A title last season, takes over a team who are third in qualifying Group C, with three points from two games. Italy go to Skopje on Saturday to face North Macedonia, the team that knocked them out in a World Cup qualifying play-off last year. They then host Ukraine in Milan in a potentially vital encounter. Spain coach Luis de la Fuente will hope to turn the focus back to football after he faced criticism for applauding a controversial speech by the country’s federation president Luis Rubiales last month. Rubiales sparked worldwide outrage when he forcibly kissed Jenni Hermoso after Spain beat England in the Women’s World Cup final in Sydney on August 20. He provoked further ire with a defiant speech at an emergency meeting in which he refused to resign despite mounting pressure and instead railed against “false feminism”, as De la Fuente applauded. De la Fuente was an eyebrow-raising appointment when he replaced Luis Enrique after the World Cup. La Roja began Euro qualifying in stuttering fashion and lost to Scotland in March. However, they won the Uefa Nations League in June, beating Croatia on penalties in the final. They will now be expected to beat Georgia in Tbilisi and Cyprus in Granada, and De la Fuente could hand a debut to 16-year-old Barcelona starlet Lamine Yamal. Moving to the Saudi Pro League does not appear to have jeopardised the international prospects of European stars, not yet anyway. Cristiano Ronaldo continues to be called up by Portugal at the age of 38 and having joined Al-Nassr in January. He has been joined in Roberto Martinez’s latest Portuguese squad by two new arrivals to the Saudi league in Ruben Neves and Otavio. “We will see what state the players coming from the Saudi league are in,” Martinez told Portuguese media. “It is a different situation, but that doesn’t mean it has to be negative. We need to adapt to these new circumstances in football without making a big deal out of it.” Jordan Henderson is in the England squad despite joining Al-Ettifaq, while there are plenty of other examples, including Al-Nassr’s Aymeric Laporte featuring for Spain. France coach Didier Deschamps opted not to call up N’Golo Kante, now playing for Al-Ittihad, but did insist he was “available” for selection. Portugal are one of four teams with a maximum 12 points from four games, along with Scotland, France and England. But the Euro 2016 winners are the only ones among that quartet to have two qualifying matches this month and they can close in on securing a spot at the finals in Germany. Roberto Martinez’s team face Slovakia in Bratislava and Luxembourg in Faro in Group J. Two wins would leave them on the brink of qualification given that the top two progress from a group also containing Bosnia and Herzegovina, Iceland and Liechtenstein. Expanding the Euros to 24 teams offers a greater chance for some of the continent’s lesser lights to qualify and Kazakhstan have emerged as surprise contenders to do just that. The vast nation of 19 million people is situated mainly in Central Asia but joined Uefa in 2002. They have never qualified for a Euro or World Cup, and have never really come close – they failed to win a game in qualifying for the 2022 World Cup. However, three straight wins in Group H, including at home to Denmark and away to Northern Ireland, have propelled them up to second place. They are behind only Finland, who they host on Thursday in Astana before then hosting Northern Ireland. Two more victories and the dream really will be alive for a team ranked 104th in the world and whose players are almost all based domestically. AFP","pubDate":"2023-09-05 01:55:48","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"340ebb3e63803fdcea09df33b4a5bbbd","title":"Ndombele, Sanchez join Galatasaray from Spurs","link":"https://www.straitstimes.com/sport/football/ndombele-sanchez-join-galatasaray-from-spurs","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 9:48 AMTurkish champions Galatasaray have signed midfielder Tanguy Ndombele and defender Davinson Sanchez from Tottenham Hotspur, the Premier League club said on Monday.","content":"Turkish champions Galatasaray have signed midfielder Tanguy Ndombele and defender Davinson Sanchez from Tottenham Hotspur, the Premier League club said on Monday. Ndombele has joined on a season-long loan with an option to buy for 12.8 million pounds ($16.16 million), according to British media reports. The 26-year-old scored 10 goals in 91 appearances in all competitions for Spurs after joining from Olympique Lyonnais in 2019. The France international has previously had loan spells at former club Lyon and with Serie A champions Napoli. Sanchez, 27, has signed a four-year deal, with an option to extend for a further year, after Galatasaray paid a reported 8.1 million pounds for the Colombian international centre back. He leaves Spurs after making 207 appearances in six seasons, having joined the team in 2017 from Ajax Amsterdam. REUTERS","pubDate":"2023-09-05 01:48:41","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"f167d4af289bbb24ba61579cf4c29716","title":"Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC","link":"https://www.dailymail.co.uk/sport/football/article-12480445/Prince-Harry-offers-Lionel-Messi-words-advice-watching-fail-score-Inter-Miami-vs-LAFC.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"A bullish Prince Harry had some clear and concise advice for Lionel Messi after watching him play for Inter Miami on Sunday, telling him to 'put it in the net' after he failed to score against LAFC.","content":"Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC Prince Harry was in attendance to watch Lionel Messi's Inter Miami beat LAFC Messi didn't score, and Harry was quick to give the superstar a message DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Updated: 02:44, 5 September 2023 e-mail 29 shares 1 View comments A bullish Prince Harry had some clear and concise advice for Lionel Messi after watching him play for Inter Miami on Sunday, telling him to 'put it in the net' after he failed to score against LAFC. The former royal was among a star-studded crowd in Los Angeles watching the world's greatest soccer player help his team to a 3-1 win - but there was some disappointment that the man himself didn't get on the scoresheet again. Despite his two assists, it appears Harry wasn't overly impressed at the lack of a goal, responding quickly to a fan who asked him for 'one message to Messi'. Turning to the camera while flanked by his security, the Brit can be heard shouting 'one message for Messi? Put it in the net' before laughing and walking away. The Duke of Sussex, 38, was without Meghan Markle for his trip to LAFC's stadium on Sunday night, where he sat in the $9,000 VIP suite for the game. Prince Harry saved some words of advice for Lionel Messi after watching him fail to score Harry (pictured) was sat in a luxury VIP box in LA for the game, which Inter Miami won 3-1 Prince Harry with some advice for Lionel Messi 😅 (via @ESPNFutbolArg ) pic.twitter.com/0TsVTUEoUD — ESPN UK (@ESPNUK) September 4, 2023 While in the box, he sat alongside the team's board member Larry Berg, as well as actress and LAFC super-fan Connie Britton , the 56-year-old star of Spin City, Friday Night Lights and most recently White Lotus . It is understood the clip of Harry speaking to a fan in the bowels of the stadium came just seconds before he was invited into the dressing room to meet Messi - where he may even have passed on his words of advice to the man himself. Harry was joined at the game by Hollywood icons such as Leonardo DiCaprio and Will Ferrell , as well as sporting legends including basketball’s Magic Johnson and LeBron James . Messi had two assists, but couldn't find the back of the net for the second straight game Harry sat with LAFC executives and an array of stars in the BMO Stadium last night from a box costing up to $9,000 There was a remarkable list of VIP attendees for the game in Los Angeles on Sunday night Messi fever has well and truly hit the United States, with the legendary player impressing in his first few months in MLS. He scored nine goals in seven games in the Leagues Cup to help Inter Miami to its first ever trophy last month, before going on to net in his MLS debut against New York Red Bulls just days later. Messi is goalless in his last two - much to the dismay of those in attendance in LA on Sunday night - but he remains unbeaten throughout the entirety of his 11 games since joining Miami. Next up is the visit of Sporting Kansas City to Fort Lauderdale on Saturday night, before Messi heads to Atlanta to play in the biggest stadium yet since his arrival on American soil. Share or comment on this article: Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC e-mail 29 shares Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-05 01:44:16","image_url":"https://i.dailymail.co.uk/1s/2023/09/05/00/75058459-0-image-a-24_1693869511549.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a34d2563e6fa2ca25c9a8b92fa46f325","title":"Pick the play: Are you smart enough to be an NRL playmaker?","link":"https://www.brisbanetimes.com.au/sport/nrl/pick-the-play-are-you-smart-enough-to-be-an-nrl-playmaker-20230809-p5dv6e.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Nathanael Scott and Dan Walsh"],"video_url":null,"description":"Can you predict what plays these players are going to make? You’ve got three choices to make the first-grade team.","content":"Seven-figure salaries. Pressure. Praise. Hype and hysteria – all that and more is often your lot in life as an NRL playmaker. Not least this weekend, when seasons go on the line in the first week of the finals. Or, in the case of South Sydney, when a campaign that fell off a cliff is analysed from every possible angle. So take a walk in the shoes of Nathan Cleary, step into Adam Reynolds’ No.7 jumper, and try your hand at Cody Walker’s ball-playing caper. See if you can predict which option they take in these plays. Adam Reynolds, who is getting quicker between the ears every year even as his little legs trend in the opposite direction, had plenty of time to work his magic with this midfield play against the Warriors. So, what option does he take? Then against the Dragons in good-ball territory, the veteran half is pushing Brisbane’s attack right and towards the 20-metre line. The , giving Reynolds several teammates to work with. What’s the play? Like most of his South Sydney teammates, emerging half Lachlan Ilias was under the microscope during the back half of the season, to the point Earlier in the year though, in significantly happier times, he was pressing a sliding Broncos edge defence with space, time and options aplenty. What does the youngster do next? At his best, no one does this better than Cody Walker. A Storm defence that surges, slides and then shuffles back is all the Rabbitohs veteran needs to cause havoc – how does he do it? For Nathan Cleary and that mesmerising, metronomic Panthers system, a set-piece to start. And one of the NRL’s better rule changes of recent years (there have been but a few) is the ability to shift a scrum to multiple points on the field. Against Canberra earlier this year, Penrith set up one such restart 10 metres out from the Raiders line, just to the right of the uprights. Brian To’o feeds the scrum (who says wingers just hang around footballers?), Tyrone Peachey collects the ball off the deck at lock, and Cleary swings into action. What happens next? Now to the NSW, Australia and Panthers No.7 in an almost identical position against the Roosters. Cleary is taking the ball at first receiver again, this time from a play-the-ball, 20 metres out from the Roosters line. Notice champion fullback James Tedesco on red alert at the back, with good reason. What happens next?","pubDate":"2023-09-05 01:44:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"70afd5d0c0fe47cac12fb64461ab392c","title":"Pick the play: Are you smart enough to be an NRL playmaker?","link":"https://www.smh.com.au/sport/nrl/pick-the-play-are-you-smart-enough-to-be-an-nrl-playmaker-20230809-p5dv6e.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Nathanael Scott and Dan Walsh"],"video_url":null,"description":"Can you predict what plays these players are going to make? You’ve got three choices to make the first-grade team.","content":"Add articles to your saved list and come back to them any time. Seven-figure salaries. Pressure. Praise. Hype and hysteria – all that and more is often your lot in life as an NRL playmaker. Not least this weekend, when seasons go on the line in the first week of the finals. Or, in the case of South Sydney, when a campaign that fell off a cliff is analysed from every possible angle. So take a walk in the shoes of Nathan Cleary, step into Adam Reynolds’ No.7 jumper, and try your hand at Cody Walker’s ball-playing caper. See if you can predict which option they take in these plays. The little master Adam Reynolds, who is getting quicker between the ears every year even as his little legs trend in the opposite direction, had plenty of time to work his magic with this midfield play against the Warriors. So, what option does he take? Then against the Dragons in good-ball territory, the veteran half is pushing Brisbane’s attack right and towards the 20-metre line. The Broncos have emphasised players in motion all year , giving Reynolds several teammates to work with. What’s the play? The young gun under the pump Like most of his South Sydney teammates, emerging half Lachlan Ilias was under the microscope during the back half of the season, to the point Reynolds has questioned whether Souths’ game plan suits his successor. Earlier in the year though, in significantly happier times, he was pressing a sliding Broncos edge defence with space, time and options aplenty. What does the youngster do next? The magic touch At his best, no one does this better than Cody Walker. A Storm defence that surges, slides and then shuffles back is all the Rabbitohs veteran needs to cause havoc – how does he do it? Panthers precision For Nathan Cleary and that mesmerising, metronomic Panthers system, a set-piece to start. And one of the NRL’s better rule changes of recent years (there have been but a few) is the ability to shift a scrum to multiple points on the field. Against Canberra earlier this year, Penrith set up one such restart 10 metres out from the Raiders line, just to the right of the uprights. Brian To’o feeds the scrum (who says wingers just hang around footballers?), Tyrone Peachey collects the ball off the deck at lock, and Cleary swings into action. What happens next? Pulling the Chooks to pieces Now to the NSW, Australia and Panthers No.7 in an almost identical position against the Roosters. Cleary is taking the ball at first receiver again, this time from a play-the-ball, 20 metres out from the Roosters line. Notice champion fullback James Tedesco on red alert at the back, with good reason. What happens next? Stream the NRL Premiership 2023 live and free on 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-09-05 01:44:00","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"77a1235bfbf7b9190a0ceaab56e3d436","title":"Sean Payton discusses Raiders rivalry ahead of Week 1 game","link":"https://www.9news.com/article/sports/nfl/denver-broncos/sean-payton-rivalries/73-a1d4e754-c00d-4d86-b920-9d6a743276a8","keywords":["denver-broncos","sports","nfl","mike-klis","local","news","home"],"creator":null,"video_url":null,"description":"The Raiders' Josh Jacobs and Maxx Crosby will get the Broncos' full attention this week as it's Raiders-Broncos in Week 1.","content":"ENGLEWOOD, Colo — Grrr! Raiders Week! Or as Sean Payton considers it, AFC West Opponent Week. “We look at them as divisional games,’’ Payton said in a video-less, Zoom conference call Monday morning with reporters. “I think the rivalries are in college football, and then arch rivalries. I was asked that question a lot (when he with New Orleans in the NFC South), relative to Atlanta, New Orleans. I mean, look, divisional games are important. First goal is to find a way to win your division. You play your divisional opponents twice.” The Denver Broncos open their regular season Sunday afternoon against an AFC West opponent in the Las Vegas Raiders. There was a time when the Raiders where the most hated rival of Broncos Country. Maybe that still exists with the Denver fan base but in the modern-era of free agency, player movement, and opposing players exchanging signed jerseys immediately after the game, hostility between opponents sometimes has to be manufactured. It's not like the NFL of the 1960s, 70s and 80s. “I can’t speak for rivalries,’’ Payton said. “I just think that exists a little bit more in the collegiate game. I think division games are important, yes.” Rivalry or not, tThe Raiders are a great test for the newly Payton-led Broncos as the Black and Silver have won six consecutive games in this divisional matchup. One reason is running back Josh Jacobs. In the seven games he has played against the Broncos since he was a first-round draft choice in 2019, the Raiders have won all of them as he’s averaged 103 rushing yards per game. Credit: AP Photo/Jack Dempsey Denver Broncos head coach Sean Payton watches during the first half of an NFL preseason football game against the Los Angeles Rams Aug. 26, 2023. His recent return from a lengthy contract holdout won’t affect how the Denver defense builds its strategy against him. “Our plan defensively is, here are the key players,’’ Payton said. “He certainly is one of the more dominant running backs in the NFL so that’s how we’ll approach the game.” The other Raider who has taken over the rivalry, err, divisional matchup, is edge player Maxx Crosby. He has at least one sack in seven consecutive games against the Broncos, 11.5 total in that span. “He’s real flexible,’’ Payton said. “He’s a tremendous worker. Athletic. He’s got one of those motors that doesn’t stop and he can get to your edge quick. But his ability to bend and then his stamina are things that stand out.” Following a three-day weekend off, the Broncos will resume practice at 11:30 Monday morning. Related Articles When to watch Broncos coverage on 9NEWS Meet Nate Adkins, the guy who beat out Okwuegbunam Bronco notes: Besides special teams, eight rookies help balance payroll SUGGESTED VIDEOS: Sports MORE WAYS TO GET 9NEWS Subscribe to our daily 9NEWSLETTER Download the 9NEWS APP iTunes: http://on9news.tv/itunes Google Play: http://on9news.tv/1lWnC5n HOW TO ADD THE 9NEWS APP TO YOUR STREAMING DEVICE ROKU: add the channel from the ROKU store or by searching for KUSA. For both Apple TV and Fire TV, search for \"9news\" to find the free app to add to your account. Another option for Fire TV is to have the app delivered directly to your Fire TV through Amazon. Related Articles When to watch Broncos coverage on 9NEWS Breckenridge Distillery releases 2 Broncos bourbon blends Bronco notes: Besides special teams, eight rookies help balance payroll","pubDate":"2023-09-05 01:36:14","image_url":"https://media.tegna-media.com/assets/KUSA/images/f6db0b97-1205-421b-b25e-57a7ac371125/f6db0b97-1205-421b-b25e-57a7ac371125_750x422.jpg","source_id":"9news","source_priority":2657,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"6e1d2b1d81996f770478910b8187249e","title":"Bronco notes: Payton's offensive history excites Sutton","link":"https://www.9news.com/article/sports/nfl/denver-broncos/mike-klis/sean-paytons-offensive-history-excites-courtland-sutton/73-06e5258d-e955-4b60-ad38-a296eb663782","keywords":["mike-klis","sports","nfl","denver-broncos","football","local-sports"],"creator":null,"video_url":null,"description":"Jeudy, Moss making progress from injuries. Numerous jersey number switches, including rookie Mims from 83 to 19.","content":"ENGLEWOOD, Colo. — Hope comes not only from Sean Payton’ s head coaching record that averages better than 10 wins a year over 15 seasons. There is also excitement in Payton as an offensive game planner and play caller whose teams have ranked in the top 9 in total offense (yards per game) in 13 of his 15 seasons as the Saints’ head coach. And in six of those years they ranked No. 1. His New Orleans’ teams also ranked in the top 10 in points scored in 10 of his 15 seasons. And three times they led the NFL in scoring. Anyone who has watched the Broncos’ desultory offense the past seven or eight years knows that win or lose, Payton’s offensive acumen that is much needed. “Man, it’s going to be fun,’’ Courtland Sutton, the Broncos’ expected top receiver for their week 1 matchup against the Las Vegas Raiders on Sunday afternoon at Empower Field at Mile High. “Even with this extra day (of practice Monday) that we got, you were able to see the early bits of his game plan and what his idea is. I think it’s going to be a lot of fun to watch it come to fruition out there on Sunday.” Through the first five seasons of his NFL career, Sutton has been one of the better players for a perennially bottom-rung Broncos’ offense. He plans on being a top receiver for what should be an above-average Broncos’ offense in 2023. “I would hope defenses have seen and understand what I’m able to bring to the table,’’ Sutton said. “They understand they have to account for me while I’m on the field. It’s a fun thing to be a part of because … I’m going to leave it at that.” Credit: AP Photo/Paul Sancya New Orleans Saints quarterback Drew Brees with coach Sean Payton after Super Bowl XLIV against the Indianapolis Colts in Miami, Sunday, Feb. 7, 2010. Jeudy, Moss update Payton would not go through injuries during his Monday morning video-less Zoom conference call with reporters mostly because he didn’t have to. There are two players on the Broncos’ active, 53-man roster who are coming back from injuries, receiver Jerry Jeudy and rookie cornerback Riley Moss. Jeudy suffered a hamstring injury so severe on Aug. 24, he had to be helped onto a cart and then rolled to the doors leading to the training room. Less than two weeks later, he was stretching with the team Monday and conditioning on a side field, a positive sign. It would still be a surprise if Jeudy plays in the opener Sunday against the Raiders, but his availability is looking better for week 2 against Washington. Moss has been out since the first week of training camp with a core-muscle injury that required surgery. He returned to practice on a limited basis Monday for the first time since his surgery. “Kinda-ish,’’ Moss said about his return. “It feels good to be doing some football stuff.” It would figure that Moss would get a couple weeks of practice before he is cleared for a game but he is progressing. “I’ve been chomping at the bit,’’ he said. “I’ve got a lot of energy but the nice thing is I’ll have fresh legs for the season.’’ There is no exact timetable for his return. “Day by day,’’ he said. “Today was good. It’s not where I want to be yet but it’s a stepping stone to where I’m going to be heading.’’ Moss participated fully in the first three training camp practices in late-July. But after the players had a day off, Sunday, July 30, Moss wasn’t at practice Monday, July 31. On Tuesday, Aug. 1, he was undergoing core-muscle surgery in Philadelphia “Over time I could feel it but it wasn’t anything I was nervous about, I could play through it fine,’’ said Moss, a third-round draft pick out of Iowa. “But as I kind of kept going I felt it kind of shoot up and it swelled a little bit so they flew me out to Philadelphia and had the surgery done.” As he visited Dr. William C. Meyers, a noted core muscle specialist, Moss was still hoping for a consultation, a rehab program and return to the practice field. That’s not how it happened. “No, they had me go out to him,’’ Moss said. “The guy (Dr. Meyers) has done a lot of the guys in the league. But I had taken an MRI here and he looked at it and he said might as well get it done.” Credit: AP Photo/Godofredo A. Vásquez Denver Broncos wide receiver Jerry Jeudy catches a ball before an NFL preseason football game, Saturday, Aug. 19, 2023, in Santa Clara, Calif. Number switches Several Broncos players switched numbers from what they were given in training camp and the preseason: Cornerback Tremon Smith went from No. 23 to No. 1. Punter Riley Dixon from 19 to 9. Rookie receiver Marvin Mims Jr. from 83 to 19 (which should be a decent seller once they reach Broncos’ Team Stores). Cornerback Fabian Moreau from 36 to 23. Cornerback Ja’Quan McMillian from 35 to 29. On the practice squad, quarterback Ben DiNucci switched from No. 6 to 11 and safety Devon Key from 38 to 26. Newcomer linebacker Ben Niemann is wearing No. 57. Bronco Bits David Sills, a 6-foot-3, receiver who played some quarterback in college, was cut by the New York Giants last week and joined the Broncos’ practice squad even though he was offered a chance to return to the Giants’ practice squad. “I was, but I had been there four years and felt like I needed a new start,’’ Sills said. With the Giants, he had 13 catches for 123 yards in his last two years there. … Practice squad offensive tackle Demontrey Jacobs was back practicing Monday. He had suffered minor knee and ankle sprains in the final preseason game, Aug. 26. ... The Broncos reached an injury settlement with outside linebacker Christopher Allen and he was waived from their injured reserve list. Allen suffered a minor injury in the final preseason game. Related Articles When to watch Broncos coverage on 9NEWS Sean Payton discusses Raiders rivalry ahead of Week 1 game Broncos giving away car stencils Tuesday SUGGESTED VIDEOS: Sports","pubDate":"2023-09-05 01:10:29","image_url":"https://media.tegna-media.com/assets/KUSA/images/bab423c5-41ea-4f0c-ba4e-66d028ff30c0/bab423c5-41ea-4f0c-ba4e-66d028ff30c0_750x422.jpg","source_id":"9news","source_priority":2657,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"39f532bc42722c4c2528888eceffc604","title":"Словаччина - Португалія: де і коли дивитися онлайн матч кваліфікації Євро-2024 08.09.2023","link":"https://champion.com.ua/football/2023/09/05/938061/slovachchyna-portuhaliya-de-dyvytysya-match-kvalifikatsiyi-yevro-2024","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі 5-го туру кваліфікації чемпіонату Європи-2024 з футболу збірна Словаччини зіграє з Португалією.Підключитися до МегогоМатч відбудеться у п'ятницю, 8 вересня. Початок матчу о 21:45 за київським часом. Актуально:Кваліфікація Євро-2024: формат, р...","content":"Джерело - Чемпіон . У матчі 5-го туру кваліфікації чемпіонату Європи-2024 з футболу збірна Словаччини зіграє з Португалією. Підключитися до Мегого Матч відбудеться у п'ятницю, 8 вересня . Початок матчу о 21:45 за київським часом. Актуально: Кваліфікація Євро-2024: формат, регламент змагань та склад усіх груп Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-09-05 01:00:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"b1dd15e7dbcbfd56eff4066c79c043ba","title":"Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou","link":"https://www.dailymail.co.uk/sport/nrl/article-12480465/Souths-Latrell-Mitchell-switch-rumour-plan-Sam-Burgess-head-coach.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An internal review at South Sydney could result in massive changes including a huge switch for Latrell Mitchell, while rumours continue to swirl that Sam Burgess could return.","content":"Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou Souths crashed out of finals contention Mitchell and Demetriou under pressure READ MORE: Fears for Mitchell over controversy By Josh Alston For Daily Mail Australia Updated: 01:57 BST, 5 September 2023 e-mail View comments An internal review at South Sydney could result in massive changes at Redfern including moving Latrell Mitchell out of the fullback position - while rumours continue to swirl that Sam Burgess could return to coach the Bunnies. Mitchell is firmly under the pump at Souths following an injury-disrupted year that saw the son of NRL legend Clive Churchill label him a ' cancer ' on the team in a message to club chairman Nick Pappas . The representative star has become the face of Souths annus horribilis that saw the Bunnies crash from being raging competition favourites to missing the finals altogether. It could result in Mitchell being dumped from the fullback position for incoming superstar Jack Wighton as Souths conduct a review on every element of the football department. Meanwhile, Souths have been forced to hose down speculation that a trade deal could see Souths coach Jason Demetriou go to the Super League, and Burgess stay in Australia. Souths officials told the Sydney Morning Herald they weren't trying to get rid of Demetriou after an official at Warrington, where Burgess will take over as head coach, said the club had been told a high-ranking Bunnies staffer wanted the Englishman to consider returning as head coach. Burgess declined to comment. Mitchell had another injury-disrupted season and came under fire for his efforts when he returned to play for the Bunnies Mitchell and Jack Wighton wrestle at New South Wales Blues training. They will be teammates in 2024 and Wighton will reportedly be considered for the fullback role After leading the competition at the conclusion of round 11, Souths spectacularly flamed out with a 26-12 loss to bitter rivals Sydney Roosters in the final round consigning them to ninth place on the NRL ladder. As the pressure intensified, internal rifts became public knowledge with Burgess walking out on his job as assistant coach of the club he famously won a premiership with in 2014. Burgess had clashed with Jason Demetriou, accusing the coach of giving Mitchell and star playmaker Cody Walker preferential treatment. Other cracks were leaked as well, with reports of Walker storming out of a training session and Cam Murray allegedly snapping at Mitchell during a video session. A Souths official told the publication that Demetriou will be asked to consider moving Mitchell out of fullback, which could cause further rifts within the club, as the coach believes he can still unlock his star in the No.1 jersey. Phil Gould believes the decision on where Mitchell plays should be made by Jason Demetriou and not other influences Paul Gallen defended Mitchell and said he can do things on the footy field no other player is capable of Former New South Wales captain Paul Gallen gave an impassioned defence of Mitchell on Channel Nine's 100% Footy , saying he had an x-factor that elevated him over all other players. 'I don't understand where this talk about Latrell at fullback has come from. Latrell as a fullback has never changed the way he plays, he's always been able to do things other people just can't do on the football field, we know that,' he said. 'He's never been an effort player, he's never been the player backing up the middle, he's never been the player making 20 runs a game for 200 metres, he's never been that Dylan Edwards, James Tedesco type player. He's always just had that x-factor, and can do things other players can't do Paul Gallen 'He's always just had that x-factor, and can do things other players can't do.' Bulldogs boss and former New South Wales coach Phil Gould said the decision on where to play should rest solely on the shoulders of Demetriou. 'I don't think it's anyone's business bar the coach, I don't know who in the club would be questioning where the coach plays him or why suddenly after this game [against the Roosters],' he said. 'I mean, they lost on the weekend because Latrell didn't play, had he played it could've been a very different story. But arguing right now about where Latrell plays next year I don't think is a major part of the review whatsoever. 'Certainly there are other factors there that a far more important for South Sydney and why it fell away the way it did, without questioning where Latrell plays next year. That's not the solution to their issues.' South Sydney coach Jason Demetriou signed a massive three-year deal this season but that could come under review if the results don't follow Burgess worked as an assistant coach at Souths this season before he clashed with Demetriou over the treatment of Mitchell and Cody Walker Burgess and fiancé Lucy Graham are expecting their first child together which played a role in the former Souths enforcer wanting to return to England Demetriou will be under enormous pressure in 2024 with reports that Burgess is being considered for the head coaching role n the future. Burgess has committed to English Super League side Warrington for the 2024 season, but could be an option for 2025 if Souths can't turn their fortunes around. A Warrington official told the Sydney Morning Herald that a senior Souths official had already floated the idea of a swap deal, sending Demetriou to the UK with Burgess to return to the Rabbitohs. Demetriou signed a three-year extension midway through the 2023 season on a huge $2.5million deal, but that deal will come under review if he can't get results next season. Burgess has replaced former Warrington coach Daryl Powell after the club's lean run of form this year. He does not currently have the coaching credentials for that level, but Super League made an exemption to allow him to take the post at Warrington. Share or comment on this article: Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-05 00:57:19","image_url":"https://i.dailymail.co.uk/1s/2023/09/05/00/75058453-0-image-a-10_1693870758962.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1bd0a622bdab251deaf67feef7785ad4","title":"May day: Can the Magpies pull the right lever to dismantle Melbourne?","link":"https://www.brisbanetimes.com.au/sport/afl/may-day-can-the-magpies-pull-the-right-lever-to-dismantle-melbourne-20230905-p5e20r.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Collingwood’s Jack Crisp says his team needs to play smart on Thursday night to avoid the Demons’ intercept kings Steven May and Jake Lever, and the stats back him up.","content":"Collingwood running machine Jack Crisp says the Magpies must find a way to hinder Demons defenders Steven May and Jake Lever in Thursday night’s qualifying final – and the statistics emphasise his point. The Magpies experienced first hand how lethal May’s intercept-marking can be in their sole match against the Demons this season; a King’s Birthday weekend clash that ended their eight-game winning streak. Melbourne backmen Steven May and Jake Lever are important rebounding defenders for their team. Credit: Getty May had four intercept marks that afternoon, the equal most of any Demon, while blanketing Brody Mihocek. His team combined for 23 intercept marks, their equal most for the season. The Magpies too often chose poor options when heading inside their forward 50 metres, meaning their forward line, already without Jamie Elliott, Daniel McStay and Jack Ginnivan, did not have its typical potency. Heading into a week-one finals blockbuster, Crisp says the Magpies will be ready for a physical start, but then must be clever when heading into attacking 50, for May and fellow intercepting master Lever will again be ready to pounce. Jake Lever and Steven May are one of the AFL’s most formidable key defensive duos. Credit: Getty Images “Finals is a different type of football. It’s going to be high-octane early; a lot of bodies flying everywhere, a lot of hard hits. But we feel like we will be ready for that from Melbourne,” Crisp said. “We have a few big boys in there as well that can throw their weight around. We will be ready to brace for that, then send the ball flying our way forward. “Hopefully, we can take out May and Lever, [their] intercepting players, and, hopefully, hold a lot of territory and put some scoreboard pressure on them.” Half-back Christian Salem was also instrumental in the King’s Birthday, amassing nine intercept possessions. Loading May was an All-Australian defender in 2021 and 2022 , but was overlooked this year. A deeper dive of the statistics shows the Demons have won 10 of the 11 games this year when he has taken at least three intercept marks. The anomaly was against Greater Western Sydney in round 16. In the 10 games May has taken two or fewer intercept marks, the Demons are 5-5. The Demons also boast a strong record when Lever – who was also chosen as an All-Australian in Melbourne’s 2021 premiership year – has a major influence. They have won nine of 12 games in which he has taken at least three intercept marks. “Me and Steve love playing with each other and the other backline players,” Lever said. Game plan: Jack Crisp says the Magpies cannot allow Demons Steven may and Jake Lever to flourish. Credit: Getty Images The May-Lever partnership is pivotal to the Demons boasting a defence that fits the profile of the past 10 premiership teams. In this period, the winning side has been ranked in the top six for points conceded, and points conceded from turnovers. The Demons this year boast the second-best defence, conceding just 72.2 points per game – only St Kilda (71.6) has been more frugal. Melbourne has also conceded the least number of points from turnovers (41.1), shading Brisbane (41.2) and Collingwood (41.4). May and Lever are central to this, for they are strong one-on-one defenders, are prepared to step across and help teammates, and, just as importantly, organise their team’s positioning behind the ball. Lever said the Magpies, now with McStay, Elliott and Ginnivan in the line-up, will be a major test. “We love that sort of challenge as a backline group. As a group of seven ... we really pride ourselves that, in the big moments in big games, we, hopefully, can stand up,” Lever said. “We have proven a couple of times this year that we have been able to do that, but that doesn’t mean it is going to get handed to us. Loading “The message for the Magpies is clear. Whoever lines up on May and Lever not only have the job of being offensive threats, but must take the ball to ground as often as possible, thereby hindering May and Lever’s influence, and slowing the Demons’ counter-attack. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Collingwood Magpies Melbourne Demons Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-05 01:55:51","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"bb5844975c5a87fdda22289f97dde04e","title":"What to look out for in Euro 2024 qualifying","link":"https://www.straitstimes.com/sport/football/what-to-look-out-for-in-euro-2024-qualifying-0","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 9:55 AMThe road to Germany resumes this week with key games for the continent’s heavyweights.","content":"PARIS – The road to Germany resumes this week as Euro 2024 qualifying kicks back into action with key games for the continent’s heavyweights. AFP Sport picks out some of the highlights with two rounds of matches spread over six days from September 7 to 12. Reigning European champions Italy have a new coach after Roberto Mancini’s resignation, with Luciano Spalletti hired as his replacement. Mancini resigned in mid-August, saying his decision had “nothing to do” with a possible move to Saudi Arabia. Two weeks later he was named as the new Saudi coach on a four-year deal. Spalletti, who left Napoli after leading them to the Serie A title last season, takes over a team who are third in qualifying Group C, with three points from two games. Italy go to Skopje on Saturday to face North Macedonia, the team that knocked them out in a World Cup qualifying play-off last year. They then host Ukraine in Milan in a potentially vital encounter. Spain coach Luis de la Fuente will hope to turn the focus back to football after he faced criticism for applauding a controversial speech by the country’s federation president Luis Rubiales last month. Rubiales sparked worldwide outrage when he forcibly kissed Jenni Hermoso after Spain beat England in the Women’s World Cup final in Sydney on August 20. He provoked further ire with a defiant speech at an emergency meeting in which he refused to resign despite mounting pressure and instead railed against “false feminism”, as De la Fuente applauded. De la Fuente was an eyebrow-raising appointment when he replaced Luis Enrique after the World Cup. La Roja began Euro qualifying in stuttering fashion and lost to Scotland in March. However, they won the Uefa Nations League in June, beating Croatia on penalties in the final. They will now be expected to beat Georgia in Tbilisi and Cyprus in Granada, and De la Fuente could hand a debut to 16-year-old Barcelona starlet Lamine Yamal. Moving to the Saudi Pro League does not appear to have jeopardised the international prospects of European stars, not yet anyway. Cristiano Ronaldo continues to be called up by Portugal at the age of 38 and having joined Al-Nassr in January. He has been joined in Roberto Martinez’s latest Portuguese squad by two new arrivals to the Saudi league in Ruben Neves and Otavio. “We will see what state the players coming from the Saudi league are in,” Martinez told Portuguese media. “It is a different situation, but that doesn’t mean it has to be negative. We need to adapt to these new circumstances in football without making a big deal out of it.” Jordan Henderson is in the England squad despite joining Al-Ettifaq, while there are plenty of other examples, including Al-Nassr’s Aymeric Laporte featuring for Spain. France coach Didier Deschamps opted not to call up N’Golo Kante, now playing for Al-Ittihad, but did insist he was “available” for selection. Portugal are one of four teams with a maximum 12 points from four games, along with Scotland, France and England. But the Euro 2016 winners are the only ones among that quartet to have two qualifying matches this month and they can close in on securing a spot at the finals in Germany. Roberto Martinez’s team face Slovakia in Bratislava and Luxembourg in Faro in Group J. Two wins would leave them on the brink of qualification given that the top two progress from a group also containing Bosnia and Herzegovina, Iceland and Liechtenstein. Expanding the Euros to 24 teams offers a greater chance for some of the continent’s lesser lights to qualify and Kazakhstan have emerged as surprise contenders to do just that. The vast nation of 19 million people is situated mainly in Central Asia but joined Uefa in 2002. They have never qualified for a Euro or World Cup, and have never really come close – they failed to win a game in qualifying for the 2022 World Cup. However, three straight wins in Group H, including at home to Denmark and away to Northern Ireland, have propelled them up to second place. They are behind only Finland, who they host on Thursday in Astana before then hosting Northern Ireland. Two more victories and the dream really will be alive for a team ranked 104th in the world and whose players are almost all based domestically. AFP","pubDate":"2023-09-05 01:55:48","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"340ebb3e63803fdcea09df33b4a5bbbd","title":"Ndombele, Sanchez join Galatasaray from Spurs","link":"https://www.straitstimes.com/sport/football/ndombele-sanchez-join-galatasaray-from-spurs","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 9:48 AMTurkish champions Galatasaray have signed midfielder Tanguy Ndombele and defender Davinson Sanchez from Tottenham Hotspur, the Premier League club said on Monday.","content":"Turkish champions Galatasaray have signed midfielder Tanguy Ndombele and defender Davinson Sanchez from Tottenham Hotspur, the Premier League club said on Monday. Ndombele has joined on a season-long loan with an option to buy for 12.8 million pounds ($16.16 million), according to British media reports. The 26-year-old scored 10 goals in 91 appearances in all competitions for Spurs after joining from Olympique Lyonnais in 2019. The France international has previously had loan spells at former club Lyon and with Serie A champions Napoli. Sanchez, 27, has signed a four-year deal, with an option to extend for a further year, after Galatasaray paid a reported 8.1 million pounds for the Colombian international centre back. He leaves Spurs after making 207 appearances in six seasons, having joined the team in 2017 from Ajax Amsterdam. REUTERS","pubDate":"2023-09-05 01:48:41","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"f167d4af289bbb24ba61579cf4c29716","title":"Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC","link":"https://www.dailymail.co.uk/sport/football/article-12480445/Prince-Harry-offers-Lionel-Messi-words-advice-watching-fail-score-Inter-Miami-vs-LAFC.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"A bullish Prince Harry had some clear and concise advice for Lionel Messi after watching him play for Inter Miami on Sunday, telling him to 'put it in the net' after he failed to score against LAFC.","content":"Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC Prince Harry was in attendance to watch Lionel Messi's Inter Miami beat LAFC Messi didn't score, and Harry was quick to give the superstar a message DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Updated: 02:44, 5 September 2023 e-mail 29 shares 1 View comments A bullish Prince Harry had some clear and concise advice for Lionel Messi after watching him play for Inter Miami on Sunday, telling him to 'put it in the net' after he failed to score against LAFC. The former royal was among a star-studded crowd in Los Angeles watching the world's greatest soccer player help his team to a 3-1 win - but there was some disappointment that the man himself didn't get on the scoresheet again. Despite his two assists, it appears Harry wasn't overly impressed at the lack of a goal, responding quickly to a fan who asked him for 'one message to Messi'. Turning to the camera while flanked by his security, the Brit can be heard shouting 'one message for Messi? Put it in the net' before laughing and walking away. The Duke of Sussex, 38, was without Meghan Markle for his trip to LAFC's stadium on Sunday night, where he sat in the $9,000 VIP suite for the game. Prince Harry saved some words of advice for Lionel Messi after watching him fail to score Harry (pictured) was sat in a luxury VIP box in LA for the game, which Inter Miami won 3-1 Prince Harry with some advice for Lionel Messi 😅 (via @ESPNFutbolArg ) pic.twitter.com/0TsVTUEoUD — ESPN UK (@ESPNUK) September 4, 2023 While in the box, he sat alongside the team's board member Larry Berg, as well as actress and LAFC super-fan Connie Britton , the 56-year-old star of Spin City, Friday Night Lights and most recently White Lotus . It is understood the clip of Harry speaking to a fan in the bowels of the stadium came just seconds before he was invited into the dressing room to meet Messi - where he may even have passed on his words of advice to the man himself. Harry was joined at the game by Hollywood icons such as Leonardo DiCaprio and Will Ferrell , as well as sporting legends including basketball’s Magic Johnson and LeBron James . Messi had two assists, but couldn't find the back of the net for the second straight game Harry sat with LAFC executives and an array of stars in the BMO Stadium last night from a box costing up to $9,000 There was a remarkable list of VIP attendees for the game in Los Angeles on Sunday night Messi fever has well and truly hit the United States, with the legendary player impressing in his first few months in MLS. He scored nine goals in seven games in the Leagues Cup to help Inter Miami to its first ever trophy last month, before going on to net in his MLS debut against New York Red Bulls just days later. Messi is goalless in his last two - much to the dismay of those in attendance in LA on Sunday night - but he remains unbeaten throughout the entirety of his 11 games since joining Miami. Next up is the visit of Sporting Kansas City to Fort Lauderdale on Saturday night, before Messi heads to Atlanta to play in the biggest stadium yet since his arrival on American soil. Share or comment on this article: Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC e-mail 29 shares Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-05 01:44:16","image_url":"https://i.dailymail.co.uk/1s/2023/09/05/00/75058459-0-image-a-24_1693869511549.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a34d2563e6fa2ca25c9a8b92fa46f325","title":"Pick the play: Are you smart enough to be an NRL playmaker?","link":"https://www.brisbanetimes.com.au/sport/nrl/pick-the-play-are-you-smart-enough-to-be-an-nrl-playmaker-20230809-p5dv6e.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Nathanael Scott and Dan Walsh"],"video_url":null,"description":"Can you predict what plays these players are going to make? You’ve got three choices to make the first-grade team.","content":"Seven-figure salaries. Pressure. Praise. Hype and hysteria – all that and more is often your lot in life as an NRL playmaker. Not least this weekend, when seasons go on the line in the first week of the finals. Or, in the case of South Sydney, when a campaign that fell off a cliff is analysed from every possible angle. So take a walk in the shoes of Nathan Cleary, step into Adam Reynolds’ No.7 jumper, and try your hand at Cody Walker’s ball-playing caper. See if you can predict which option they take in these plays. Adam Reynolds, who is getting quicker between the ears every year even as his little legs trend in the opposite direction, had plenty of time to work his magic with this midfield play against the Warriors. So, what option does he take? Then against the Dragons in good-ball territory, the veteran half is pushing Brisbane’s attack right and towards the 20-metre line. The , giving Reynolds several teammates to work with. What’s the play? Like most of his South Sydney teammates, emerging half Lachlan Ilias was under the microscope during the back half of the season, to the point Earlier in the year though, in significantly happier times, he was pressing a sliding Broncos edge defence with space, time and options aplenty. What does the youngster do next? At his best, no one does this better than Cody Walker. A Storm defence that surges, slides and then shuffles back is all the Rabbitohs veteran needs to cause havoc – how does he do it? For Nathan Cleary and that mesmerising, metronomic Panthers system, a set-piece to start. And one of the NRL’s better rule changes of recent years (there have been but a few) is the ability to shift a scrum to multiple points on the field. Against Canberra earlier this year, Penrith set up one such restart 10 metres out from the Raiders line, just to the right of the uprights. Brian To’o feeds the scrum (who says wingers just hang around footballers?), Tyrone Peachey collects the ball off the deck at lock, and Cleary swings into action. What happens next? Now to the NSW, Australia and Panthers No.7 in an almost identical position against the Roosters. Cleary is taking the ball at first receiver again, this time from a play-the-ball, 20 metres out from the Roosters line. Notice champion fullback James Tedesco on red alert at the back, with good reason. What happens next?","pubDate":"2023-09-05 01:44:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"70afd5d0c0fe47cac12fb64461ab392c","title":"Pick the play: Are you smart enough to be an NRL playmaker?","link":"https://www.smh.com.au/sport/nrl/pick-the-play-are-you-smart-enough-to-be-an-nrl-playmaker-20230809-p5dv6e.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Nathanael Scott and Dan Walsh"],"video_url":null,"description":"Can you predict what plays these players are going to make? You’ve got three choices to make the first-grade team.","content":"Add articles to your saved list and come back to them any time. Seven-figure salaries. Pressure. Praise. Hype and hysteria – all that and more is often your lot in life as an NRL playmaker. Not least this weekend, when seasons go on the line in the first week of the finals. Or, in the case of South Sydney, when a campaign that fell off a cliff is analysed from every possible angle. So take a walk in the shoes of Nathan Cleary, step into Adam Reynolds’ No.7 jumper, and try your hand at Cody Walker’s ball-playing caper. See if you can predict which option they take in these plays. The little master Adam Reynolds, who is getting quicker between the ears every year even as his little legs trend in the opposite direction, had plenty of time to work his magic with this midfield play against the Warriors. So, what option does he take? Then against the Dragons in good-ball territory, the veteran half is pushing Brisbane’s attack right and towards the 20-metre line. The Broncos have emphasised players in motion all year , giving Reynolds several teammates to work with. What’s the play? The young gun under the pump Like most of his South Sydney teammates, emerging half Lachlan Ilias was under the microscope during the back half of the season, to the point Reynolds has questioned whether Souths’ game plan suits his successor. Earlier in the year though, in significantly happier times, he was pressing a sliding Broncos edge defence with space, time and options aplenty. What does the youngster do next? The magic touch At his best, no one does this better than Cody Walker. A Storm defence that surges, slides and then shuffles back is all the Rabbitohs veteran needs to cause havoc – how does he do it? Panthers precision For Nathan Cleary and that mesmerising, metronomic Panthers system, a set-piece to start. And one of the NRL’s better rule changes of recent years (there have been but a few) is the ability to shift a scrum to multiple points on the field. Against Canberra earlier this year, Penrith set up one such restart 10 metres out from the Raiders line, just to the right of the uprights. Brian To’o feeds the scrum (who says wingers just hang around footballers?), Tyrone Peachey collects the ball off the deck at lock, and Cleary swings into action. What happens next? Pulling the Chooks to pieces Now to the NSW, Australia and Panthers No.7 in an almost identical position against the Roosters. Cleary is taking the ball at first receiver again, this time from a play-the-ball, 20 metres out from the Roosters line. Notice champion fullback James Tedesco on red alert at the back, with good reason. What happens next? Stream the NRL Premiership 2023 live and free on 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-09-05 01:44:00","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"77a1235bfbf7b9190a0ceaab56e3d436","title":"Sean Payton discusses Raiders rivalry ahead of Week 1 game","link":"https://www.9news.com/article/sports/nfl/denver-broncos/sean-payton-rivalries/73-a1d4e754-c00d-4d86-b920-9d6a743276a8","keywords":["denver-broncos","sports","nfl","mike-klis","local","news","home"],"creator":null,"video_url":null,"description":"The Raiders' Josh Jacobs and Maxx Crosby will get the Broncos' full attention this week as it's Raiders-Broncos in Week 1.","content":"ENGLEWOOD, Colo — Grrr! Raiders Week! Or as Sean Payton considers it, AFC West Opponent Week. “We look at them as divisional games,’’ Payton said in a video-less, Zoom conference call Monday morning with reporters. “I think the rivalries are in college football, and then arch rivalries. I was asked that question a lot (when he with New Orleans in the NFC South), relative to Atlanta, New Orleans. I mean, look, divisional games are important. First goal is to find a way to win your division. You play your divisional opponents twice.” The Denver Broncos open their regular season Sunday afternoon against an AFC West opponent in the Las Vegas Raiders. There was a time when the Raiders where the most hated rival of Broncos Country. Maybe that still exists with the Denver fan base but in the modern-era of free agency, player movement, and opposing players exchanging signed jerseys immediately after the game, hostility between opponents sometimes has to be manufactured. It's not like the NFL of the 1960s, 70s and 80s. “I can’t speak for rivalries,’’ Payton said. “I just think that exists a little bit more in the collegiate game. I think division games are important, yes.” Rivalry or not, tThe Raiders are a great test for the newly Payton-led Broncos as the Black and Silver have won six consecutive games in this divisional matchup. One reason is running back Josh Jacobs. In the seven games he has played against the Broncos since he was a first-round draft choice in 2019, the Raiders have won all of them as he’s averaged 103 rushing yards per game. Credit: AP Photo/Jack Dempsey Denver Broncos head coach Sean Payton watches during the first half of an NFL preseason football game against the Los Angeles Rams Aug. 26, 2023. His recent return from a lengthy contract holdout won’t affect how the Denver defense builds its strategy against him. “Our plan defensively is, here are the key players,’’ Payton said. “He certainly is one of the more dominant running backs in the NFL so that’s how we’ll approach the game.” The other Raider who has taken over the rivalry, err, divisional matchup, is edge player Maxx Crosby. He has at least one sack in seven consecutive games against the Broncos, 11.5 total in that span. “He’s real flexible,’’ Payton said. “He’s a tremendous worker. Athletic. He’s got one of those motors that doesn’t stop and he can get to your edge quick. But his ability to bend and then his stamina are things that stand out.” Following a three-day weekend off, the Broncos will resume practice at 11:30 Monday morning. Related Articles When to watch Broncos coverage on 9NEWS Meet Nate Adkins, the guy who beat out Okwuegbunam Bronco notes: Besides special teams, eight rookies help balance payroll SUGGESTED VIDEOS: Sports MORE WAYS TO GET 9NEWS Subscribe to our daily 9NEWSLETTER Download the 9NEWS APP iTunes: http://on9news.tv/itunes Google Play: http://on9news.tv/1lWnC5n HOW TO ADD THE 9NEWS APP TO YOUR STREAMING DEVICE ROKU: add the channel from the ROKU store or by searching for KUSA. For both Apple TV and Fire TV, search for \"9news\" to find the free app to add to your account. Another option for Fire TV is to have the app delivered directly to your Fire TV through Amazon. Related Articles When to watch Broncos coverage on 9NEWS Breckenridge Distillery releases 2 Broncos bourbon blends Bronco notes: Besides special teams, eight rookies help balance payroll","pubDate":"2023-09-05 01:36:14","image_url":"https://media.tegna-media.com/assets/KUSA/images/f6db0b97-1205-421b-b25e-57a7ac371125/f6db0b97-1205-421b-b25e-57a7ac371125_750x422.jpg","source_id":"9news","source_priority":2657,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"6e1d2b1d81996f770478910b8187249e","title":"Bronco notes: Payton's offensive history excites Sutton","link":"https://www.9news.com/article/sports/nfl/denver-broncos/mike-klis/sean-paytons-offensive-history-excites-courtland-sutton/73-06e5258d-e955-4b60-ad38-a296eb663782","keywords":["mike-klis","sports","nfl","denver-broncos","football","local-sports"],"creator":null,"video_url":null,"description":"Jeudy, Moss making progress from injuries. Numerous jersey number switches, including rookie Mims from 83 to 19.","content":"ENGLEWOOD, Colo. — Hope comes not only from Sean Payton’ s head coaching record that averages better than 10 wins a year over 15 seasons. There is also excitement in Payton as an offensive game planner and play caller whose teams have ranked in the top 9 in total offense (yards per game) in 13 of his 15 seasons as the Saints’ head coach. And in six of those years they ranked No. 1. His New Orleans’ teams also ranked in the top 10 in points scored in 10 of his 15 seasons. And three times they led the NFL in scoring. Anyone who has watched the Broncos’ desultory offense the past seven or eight years knows that win or lose, Payton’s offensive acumen that is much needed. “Man, it’s going to be fun,’’ Courtland Sutton, the Broncos’ expected top receiver for their week 1 matchup against the Las Vegas Raiders on Sunday afternoon at Empower Field at Mile High. “Even with this extra day (of practice Monday) that we got, you were able to see the early bits of his game plan and what his idea is. I think it’s going to be a lot of fun to watch it come to fruition out there on Sunday.” Through the first five seasons of his NFL career, Sutton has been one of the better players for a perennially bottom-rung Broncos’ offense. He plans on being a top receiver for what should be an above-average Broncos’ offense in 2023. “I would hope defenses have seen and understand what I’m able to bring to the table,’’ Sutton said. “They understand they have to account for me while I’m on the field. It’s a fun thing to be a part of because … I’m going to leave it at that.” Credit: AP Photo/Paul Sancya New Orleans Saints quarterback Drew Brees with coach Sean Payton after Super Bowl XLIV against the Indianapolis Colts in Miami, Sunday, Feb. 7, 2010. Jeudy, Moss update Payton would not go through injuries during his Monday morning video-less Zoom conference call with reporters mostly because he didn’t have to. There are two players on the Broncos’ active, 53-man roster who are coming back from injuries, receiver Jerry Jeudy and rookie cornerback Riley Moss. Jeudy suffered a hamstring injury so severe on Aug. 24, he had to be helped onto a cart and then rolled to the doors leading to the training room. Less than two weeks later, he was stretching with the team Monday and conditioning on a side field, a positive sign. It would still be a surprise if Jeudy plays in the opener Sunday against the Raiders, but his availability is looking better for week 2 against Washington. Moss has been out since the first week of training camp with a core-muscle injury that required surgery. He returned to practice on a limited basis Monday for the first time since his surgery. “Kinda-ish,’’ Moss said about his return. “It feels good to be doing some football stuff.” It would figure that Moss would get a couple weeks of practice before he is cleared for a game but he is progressing. “I’ve been chomping at the bit,’’ he said. “I’ve got a lot of energy but the nice thing is I’ll have fresh legs for the season.’’ There is no exact timetable for his return. “Day by day,’’ he said. “Today was good. It’s not where I want to be yet but it’s a stepping stone to where I’m going to be heading.’’ Moss participated fully in the first three training camp practices in late-July. But after the players had a day off, Sunday, July 30, Moss wasn’t at practice Monday, July 31. On Tuesday, Aug. 1, he was undergoing core-muscle surgery in Philadelphia “Over time I could feel it but it wasn’t anything I was nervous about, I could play through it fine,’’ said Moss, a third-round draft pick out of Iowa. “But as I kind of kept going I felt it kind of shoot up and it swelled a little bit so they flew me out to Philadelphia and had the surgery done.” As he visited Dr. William C. Meyers, a noted core muscle specialist, Moss was still hoping for a consultation, a rehab program and return to the practice field. That’s not how it happened. “No, they had me go out to him,’’ Moss said. “The guy (Dr. Meyers) has done a lot of the guys in the league. But I had taken an MRI here and he looked at it and he said might as well get it done.” Credit: AP Photo/Godofredo A. Vásquez Denver Broncos wide receiver Jerry Jeudy catches a ball before an NFL preseason football game, Saturday, Aug. 19, 2023, in Santa Clara, Calif. Number switches Several Broncos players switched numbers from what they were given in training camp and the preseason: Cornerback Tremon Smith went from No. 23 to No. 1. Punter Riley Dixon from 19 to 9. Rookie receiver Marvin Mims Jr. from 83 to 19 (which should be a decent seller once they reach Broncos’ Team Stores). Cornerback Fabian Moreau from 36 to 23. Cornerback Ja’Quan McMillian from 35 to 29. On the practice squad, quarterback Ben DiNucci switched from No. 6 to 11 and safety Devon Key from 38 to 26. Newcomer linebacker Ben Niemann is wearing No. 57. Bronco Bits David Sills, a 6-foot-3, receiver who played some quarterback in college, was cut by the New York Giants last week and joined the Broncos’ practice squad even though he was offered a chance to return to the Giants’ practice squad. “I was, but I had been there four years and felt like I needed a new start,’’ Sills said. With the Giants, he had 13 catches for 123 yards in his last two years there. … Practice squad offensive tackle Demontrey Jacobs was back practicing Monday. He had suffered minor knee and ankle sprains in the final preseason game, Aug. 26. ... The Broncos reached an injury settlement with outside linebacker Christopher Allen and he was waived from their injured reserve list. Allen suffered a minor injury in the final preseason game. Related Articles When to watch Broncos coverage on 9NEWS Sean Payton discusses Raiders rivalry ahead of Week 1 game Broncos giving away car stencils Tuesday SUGGESTED VIDEOS: Sports","pubDate":"2023-09-05 01:10:29","image_url":"https://media.tegna-media.com/assets/KUSA/images/bab423c5-41ea-4f0c-ba4e-66d028ff30c0/bab423c5-41ea-4f0c-ba4e-66d028ff30c0_750x422.jpg","source_id":"9news","source_priority":2657,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"39f532bc42722c4c2528888eceffc604","title":"Словаччина - Португалія: де і коли дивитися онлайн матч кваліфікації Євро-2024 08.09.2023","link":"https://champion.com.ua/football/2023/09/05/938061/slovachchyna-portuhaliya-de-dyvytysya-match-kvalifikatsiyi-yevro-2024","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі 5-го туру кваліфікації чемпіонату Європи-2024 з футболу збірна Словаччини зіграє з Португалією.Підключитися до МегогоМатч відбудеться у п'ятницю, 8 вересня. Початок матчу о 21:45 за київським часом. Актуально:Кваліфікація Євро-2024: формат, р...","content":"Джерело - Чемпіон . У матчі 5-го туру кваліфікації чемпіонату Європи-2024 з футболу збірна Словаччини зіграє з Португалією. Підключитися до Мегого Матч відбудеться у п'ятницю, 8 вересня . Початок матчу о 21:45 за київським часом. Актуально: Кваліфікація Євро-2024: формат, регламент змагань та склад усіх груп Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-09-05 01:00:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"b1dd15e7dbcbfd56eff4066c79c043ba","title":"Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou","link":"https://www.dailymail.co.uk/sport/nrl/article-12480465/Souths-Latrell-Mitchell-switch-rumour-plan-Sam-Burgess-head-coach.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An internal review at South Sydney could result in massive changes including a huge switch for Latrell Mitchell, while rumours continue to swirl that Sam Burgess could return.","content":"Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou Souths crashed out of finals contention Mitchell and Demetriou under pressure READ MORE: Fears for Mitchell over controversy By Josh Alston For Daily Mail Australia Updated: 01:57 BST, 5 September 2023 e-mail View comments An internal review at South Sydney could result in massive changes at Redfern including moving Latrell Mitchell out of the fullback position - while rumours continue to swirl that Sam Burgess could return to coach the Bunnies. Mitchell is firmly under the pump at Souths following an injury-disrupted year that saw the son of NRL legend Clive Churchill label him a ' cancer ' on the team in a message to club chairman Nick Pappas . The representative star has become the face of Souths annus horribilis that saw the Bunnies crash from being raging competition favourites to missing the finals altogether. It could result in Mitchell being dumped from the fullback position for incoming superstar Jack Wighton as Souths conduct a review on every element of the football department. Meanwhile, Souths have been forced to hose down speculation that a trade deal could see Souths coach Jason Demetriou go to the Super League, and Burgess stay in Australia. Souths officials told the Sydney Morning Herald they weren't trying to get rid of Demetriou after an official at Warrington, where Burgess will take over as head coach, said the club had been told a high-ranking Bunnies staffer wanted the Englishman to consider returning as head coach. Burgess declined to comment. Mitchell had another injury-disrupted season and came under fire for his efforts when he returned to play for the Bunnies Mitchell and Jack Wighton wrestle at New South Wales Blues training. They will be teammates in 2024 and Wighton will reportedly be considered for the fullback role After leading the competition at the conclusion of round 11, Souths spectacularly flamed out with a 26-12 loss to bitter rivals Sydney Roosters in the final round consigning them to ninth place on the NRL ladder. As the pressure intensified, internal rifts became public knowledge with Burgess walking out on his job as assistant coach of the club he famously won a premiership with in 2014. Burgess had clashed with Jason Demetriou, accusing the coach of giving Mitchell and star playmaker Cody Walker preferential treatment. Other cracks were leaked as well, with reports of Walker storming out of a training session and Cam Murray allegedly snapping at Mitchell during a video session. A Souths official told the publication that Demetriou will be asked to consider moving Mitchell out of fullback, which could cause further rifts within the club, as the coach believes he can still unlock his star in the No.1 jersey. Phil Gould believes the decision on where Mitchell plays should be made by Jason Demetriou and not other influences Paul Gallen defended Mitchell and said he can do things on the footy field no other player is capable of Former New South Wales captain Paul Gallen gave an impassioned defence of Mitchell on Channel Nine's 100% Footy , saying he had an x-factor that elevated him over all other players. 'I don't understand where this talk about Latrell at fullback has come from. Latrell as a fullback has never changed the way he plays, he's always been able to do things other people just can't do on the football field, we know that,' he said. 'He's never been an effort player, he's never been the player backing up the middle, he's never been the player making 20 runs a game for 200 metres, he's never been that Dylan Edwards, James Tedesco type player. He's always just had that x-factor, and can do things other players can't do Paul Gallen 'He's always just had that x-factor, and can do things other players can't do.' Bulldogs boss and former New South Wales coach Phil Gould said the decision on where to play should rest solely on the shoulders of Demetriou. 'I don't think it's anyone's business bar the coach, I don't know who in the club would be questioning where the coach plays him or why suddenly after this game [against the Roosters],' he said. 'I mean, they lost on the weekend because Latrell didn't play, had he played it could've been a very different story. But arguing right now about where Latrell plays next year I don't think is a major part of the review whatsoever. 'Certainly there are other factors there that a far more important for South Sydney and why it fell away the way it did, without questioning where Latrell plays next year. That's not the solution to their issues.' South Sydney coach Jason Demetriou signed a massive three-year deal this season but that could come under review if the results don't follow Burgess worked as an assistant coach at Souths this season before he clashed with Demetriou over the treatment of Mitchell and Cody Walker Burgess and fiancé Lucy Graham are expecting their first child together which played a role in the former Souths enforcer wanting to return to England Demetriou will be under enormous pressure in 2024 with reports that Burgess is being considered for the head coaching role n the future. Burgess has committed to English Super League side Warrington for the 2024 season, but could be an option for 2025 if Souths can't turn their fortunes around. A Warrington official told the Sydney Morning Herald that a senior Souths official had already floated the idea of a swap deal, sending Demetriou to the UK with Burgess to return to the Rabbitohs. Demetriou signed a three-year extension midway through the 2023 season on a huge $2.5million deal, but that deal will come under review if he can't get results next season. Burgess has replaced former Warrington coach Daryl Powell after the club's lean run of form this year. He does not currently have the coaching credentials for that level, but Super League made an exemption to allow him to take the post at Warrington. Share or comment on this article: Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-05 00:57:19","image_url":"https://i.dailymail.co.uk/1s/2023/09/05/00/75058453-0-image-a-10_1693870758962.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1bd0a622bdab251deaf67feef7785ad4","title":"May day: Can the Magpies pull the right lever to dismantle Melbourne?","link":"https://www.brisbanetimes.com.au/sport/afl/may-day-can-the-magpies-pull-the-right-lever-to-dismantle-melbourne-20230905-p5e20r.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Collingwood’s Jack Crisp says his team needs to play smart on Thursday night to avoid the Demons’ intercept kings Steven May and Jake Lever, and the stats back him up.","content":"Collingwood running machine Jack Crisp says the Magpies must find a way to hinder Demons defenders Steven May and Jake Lever in Thursday night’s qualifying final – and the statistics emphasise his point. The Magpies experienced first hand how lethal May’s intercept-marking can be in their sole match against the Demons this season; a King’s Birthday weekend clash that ended their eight-game winning streak. Melbourne backmen Steven May and Jake Lever are important rebounding defenders for their team. Credit: Getty May had four intercept marks that afternoon, the equal most of any Demon, while blanketing Brody Mihocek. His team combined for 23 intercept marks, their equal most for the season. The Magpies too often chose poor options when heading inside their forward 50 metres, meaning their forward line, already without Jamie Elliott, Daniel McStay and Jack Ginnivan, did not have its typical potency. Heading into a week-one finals blockbuster, Crisp says the Magpies will be ready for a physical start, but then must be clever when heading into attacking 50, for May and fellow intercepting master Lever will again be ready to pounce. Jake Lever and Steven May are one of the AFL’s most formidable key defensive duos. Credit: Getty Images “Finals is a different type of football. It’s going to be high-octane early; a lot of bodies flying everywhere, a lot of hard hits. But we feel like we will be ready for that from Melbourne,” Crisp said. “We have a few big boys in there as well that can throw their weight around. We will be ready to brace for that, then send the ball flying our way forward. “Hopefully, we can take out May and Lever, [their] intercepting players, and, hopefully, hold a lot of territory and put some scoreboard pressure on them.” Half-back Christian Salem was also instrumental in the King’s Birthday, amassing nine intercept possessions. Loading May was an All-Australian defender in 2021 and 2022 , but was overlooked this year. A deeper dive of the statistics shows the Demons have won 10 of the 11 games this year when he has taken at least three intercept marks. The anomaly was against Greater Western Sydney in round 16. In the 10 games May has taken two or fewer intercept marks, the Demons are 5-5. The Demons also boast a strong record when Lever – who was also chosen as an All-Australian in Melbourne’s 2021 premiership year – has a major influence. They have won nine of 12 games in which he has taken at least three intercept marks. “Me and Steve love playing with each other and the other backline players,” Lever said. Game plan: Jack Crisp says the Magpies cannot allow Demons Steven may and Jake Lever to flourish. Credit: Getty Images The May-Lever partnership is pivotal to the Demons boasting a defence that fits the profile of the past 10 premiership teams. In this period, the winning side has been ranked in the top six for points conceded, and points conceded from turnovers. The Demons this year boast the second-best defence, conceding just 72.2 points per game – only St Kilda (71.6) has been more frugal. Melbourne has also conceded the least number of points from turnovers (41.1), shading Brisbane (41.2) and Collingwood (41.4). May and Lever are central to this, for they are strong one-on-one defenders, are prepared to step across and help teammates, and, just as importantly, organise their team’s positioning behind the ball. Lever said the Magpies, now with McStay, Elliott and Ginnivan in the line-up, will be a major test. “We love that sort of challenge as a backline group. As a group of seven ... we really pride ourselves that, in the big moments in big games, we, hopefully, can stand up,” Lever said. “We have proven a couple of times this year that we have been able to do that, but that doesn’t mean it is going to get handed to us. Loading “The message for the Magpies is clear. Whoever lines up on May and Lever not only have the job of being offensive threats, but must take the ball to ground as often as possible, thereby hindering May and Lever’s influence, and slowing the Demons’ counter-attack. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Collingwood Magpies Melbourne Demons Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-09-05 01:55:51","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"bb5844975c5a87fdda22289f97dde04e","title":"What to look out for in Euro 2024 qualifying","link":"https://www.straitstimes.com/sport/football/what-to-look-out-for-in-euro-2024-qualifying-0","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 9:55 AMThe road to Germany resumes this week with key games for the continent’s heavyweights.","content":"PARIS – The road to Germany resumes this week as Euro 2024 qualifying kicks back into action with key games for the continent’s heavyweights. AFP Sport picks out some of the highlights with two rounds of matches spread over six days from September 7 to 12. Reigning European champions Italy have a new coach after Roberto Mancini’s resignation, with Luciano Spalletti hired as his replacement. Mancini resigned in mid-August, saying his decision had “nothing to do” with a possible move to Saudi Arabia. Two weeks later he was named as the new Saudi coach on a four-year deal. Spalletti, who left Napoli after leading them to the Serie A title last season, takes over a team who are third in qualifying Group C, with three points from two games. Italy go to Skopje on Saturday to face North Macedonia, the team that knocked them out in a World Cup qualifying play-off last year. They then host Ukraine in Milan in a potentially vital encounter. Spain coach Luis de la Fuente will hope to turn the focus back to football after he faced criticism for applauding a controversial speech by the country’s federation president Luis Rubiales last month. Rubiales sparked worldwide outrage when he forcibly kissed Jenni Hermoso after Spain beat England in the Women’s World Cup final in Sydney on August 20. He provoked further ire with a defiant speech at an emergency meeting in which he refused to resign despite mounting pressure and instead railed against “false feminism”, as De la Fuente applauded. De la Fuente was an eyebrow-raising appointment when he replaced Luis Enrique after the World Cup. La Roja began Euro qualifying in stuttering fashion and lost to Scotland in March. However, they won the Uefa Nations League in June, beating Croatia on penalties in the final. They will now be expected to beat Georgia in Tbilisi and Cyprus in Granada, and De la Fuente could hand a debut to 16-year-old Barcelona starlet Lamine Yamal. Moving to the Saudi Pro League does not appear to have jeopardised the international prospects of European stars, not yet anyway. Cristiano Ronaldo continues to be called up by Portugal at the age of 38 and having joined Al-Nassr in January. He has been joined in Roberto Martinez’s latest Portuguese squad by two new arrivals to the Saudi league in Ruben Neves and Otavio. “We will see what state the players coming from the Saudi league are in,” Martinez told Portuguese media. “It is a different situation, but that doesn’t mean it has to be negative. We need to adapt to these new circumstances in football without making a big deal out of it.” Jordan Henderson is in the England squad despite joining Al-Ettifaq, while there are plenty of other examples, including Al-Nassr’s Aymeric Laporte featuring for Spain. France coach Didier Deschamps opted not to call up N’Golo Kante, now playing for Al-Ittihad, but did insist he was “available” for selection. Portugal are one of four teams with a maximum 12 points from four games, along with Scotland, France and England. But the Euro 2016 winners are the only ones among that quartet to have two qualifying matches this month and they can close in on securing a spot at the finals in Germany. Roberto Martinez’s team face Slovakia in Bratislava and Luxembourg in Faro in Group J. Two wins would leave them on the brink of qualification given that the top two progress from a group also containing Bosnia and Herzegovina, Iceland and Liechtenstein. Expanding the Euros to 24 teams offers a greater chance for some of the continent’s lesser lights to qualify and Kazakhstan have emerged as surprise contenders to do just that. The vast nation of 19 million people is situated mainly in Central Asia but joined Uefa in 2002. They have never qualified for a Euro or World Cup, and have never really come close – they failed to win a game in qualifying for the 2022 World Cup. However, three straight wins in Group H, including at home to Denmark and away to Northern Ireland, have propelled them up to second place. They are behind only Finland, who they host on Thursday in Astana before then hosting Northern Ireland. Two more victories and the dream really will be alive for a team ranked 104th in the world and whose players are almost all based domestically. AFP","pubDate":"2023-09-05 01:55:48","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"340ebb3e63803fdcea09df33b4a5bbbd","title":"Ndombele, Sanchez join Galatasaray from Spurs","link":"https://www.straitstimes.com/sport/football/ndombele-sanchez-join-galatasaray-from-spurs","keywords":null,"creator":null,"video_url":null,"description":"September 05, 2023 9:48 AMTurkish champions Galatasaray have signed midfielder Tanguy Ndombele and defender Davinson Sanchez from Tottenham Hotspur, the Premier League club said on Monday.","content":"Turkish champions Galatasaray have signed midfielder Tanguy Ndombele and defender Davinson Sanchez from Tottenham Hotspur, the Premier League club said on Monday. Ndombele has joined on a season-long loan with an option to buy for 12.8 million pounds ($16.16 million), according to British media reports. The 26-year-old scored 10 goals in 91 appearances in all competitions for Spurs after joining from Olympique Lyonnais in 2019. The France international has previously had loan spells at former club Lyon and with Serie A champions Napoli. Sanchez, 27, has signed a four-year deal, with an option to extend for a further year, after Galatasaray paid a reported 8.1 million pounds for the Colombian international centre back. He leaves Spurs after making 207 appearances in six seasons, having joined the team in 2017 from Ajax Amsterdam. REUTERS","pubDate":"2023-09-05 01:48:41","image_url":null,"source_id":"straitstimes","source_priority":28566,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"f167d4af289bbb24ba61579cf4c29716","title":"Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC","link":"https://www.dailymail.co.uk/sport/football/article-12480445/Prince-Harry-offers-Lionel-Messi-words-advice-watching-fail-score-Inter-Miami-vs-LAFC.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"A bullish Prince Harry had some clear and concise advice for Lionel Messi after watching him play for Inter Miami on Sunday, telling him to 'put it in the net' after he failed to score against LAFC.","content":"Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC Prince Harry was in attendance to watch Lionel Messi's Inter Miami beat LAFC Messi didn't score, and Harry was quick to give the superstar a message DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Updated: 02:44, 5 September 2023 e-mail 29 shares 1 View comments A bullish Prince Harry had some clear and concise advice for Lionel Messi after watching him play for Inter Miami on Sunday, telling him to 'put it in the net' after he failed to score against LAFC. The former royal was among a star-studded crowd in Los Angeles watching the world's greatest soccer player help his team to a 3-1 win - but there was some disappointment that the man himself didn't get on the scoresheet again. Despite his two assists, it appears Harry wasn't overly impressed at the lack of a goal, responding quickly to a fan who asked him for 'one message to Messi'. Turning to the camera while flanked by his security, the Brit can be heard shouting 'one message for Messi? Put it in the net' before laughing and walking away. The Duke of Sussex, 38, was without Meghan Markle for his trip to LAFC's stadium on Sunday night, where he sat in the $9,000 VIP suite for the game. Prince Harry saved some words of advice for Lionel Messi after watching him fail to score Harry (pictured) was sat in a luxury VIP box in LA for the game, which Inter Miami won 3-1 Prince Harry with some advice for Lionel Messi 😅 (via @ESPNFutbolArg ) pic.twitter.com/0TsVTUEoUD — ESPN UK (@ESPNUK) September 4, 2023 While in the box, he sat alongside the team's board member Larry Berg, as well as actress and LAFC super-fan Connie Britton , the 56-year-old star of Spin City, Friday Night Lights and most recently White Lotus . It is understood the clip of Harry speaking to a fan in the bowels of the stadium came just seconds before he was invited into the dressing room to meet Messi - where he may even have passed on his words of advice to the man himself. Harry was joined at the game by Hollywood icons such as Leonardo DiCaprio and Will Ferrell , as well as sporting legends including basketball’s Magic Johnson and LeBron James . Messi had two assists, but couldn't find the back of the net for the second straight game Harry sat with LAFC executives and an array of stars in the BMO Stadium last night from a box costing up to $9,000 There was a remarkable list of VIP attendees for the game in Los Angeles on Sunday night Messi fever has well and truly hit the United States, with the legendary player impressing in his first few months in MLS. He scored nine goals in seven games in the Leagues Cup to help Inter Miami to its first ever trophy last month, before going on to net in his MLS debut against New York Red Bulls just days later. Messi is goalless in his last two - much to the dismay of those in attendance in LA on Sunday night - but he remains unbeaten throughout the entirety of his 11 games since joining Miami. Next up is the visit of Sporting Kansas City to Fort Lauderdale on Saturday night, before Messi heads to Atlanta to play in the biggest stadium yet since his arrival on American soil. Share or comment on this article: Prince Harry offers Lionel Messi some words of advice after watching him fail to score for Inter Miami vs LAFC e-mail 29 shares Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-05 01:44:16","image_url":"https://i.dailymail.co.uk/1s/2023/09/05/00/75058459-0-image-a-24_1693869511549.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a34d2563e6fa2ca25c9a8b92fa46f325","title":"Pick the play: Are you smart enough to be an NRL playmaker?","link":"https://www.brisbanetimes.com.au/sport/nrl/pick-the-play-are-you-smart-enough-to-be-an-nrl-playmaker-20230809-p5dv6e.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Nathanael Scott and Dan Walsh"],"video_url":null,"description":"Can you predict what plays these players are going to make? You’ve got three choices to make the first-grade team.","content":"Seven-figure salaries. Pressure. Praise. Hype and hysteria – all that and more is often your lot in life as an NRL playmaker. Not least this weekend, when seasons go on the line in the first week of the finals. Or, in the case of South Sydney, when a campaign that fell off a cliff is analysed from every possible angle. So take a walk in the shoes of Nathan Cleary, step into Adam Reynolds’ No.7 jumper, and try your hand at Cody Walker’s ball-playing caper. See if you can predict which option they take in these plays. Adam Reynolds, who is getting quicker between the ears every year even as his little legs trend in the opposite direction, had plenty of time to work his magic with this midfield play against the Warriors. So, what option does he take? Then against the Dragons in good-ball territory, the veteran half is pushing Brisbane’s attack right and towards the 20-metre line. The , giving Reynolds several teammates to work with. What’s the play? Like most of his South Sydney teammates, emerging half Lachlan Ilias was under the microscope during the back half of the season, to the point Earlier in the year though, in significantly happier times, he was pressing a sliding Broncos edge defence with space, time and options aplenty. What does the youngster do next? At his best, no one does this better than Cody Walker. A Storm defence that surges, slides and then shuffles back is all the Rabbitohs veteran needs to cause havoc – how does he do it? For Nathan Cleary and that mesmerising, metronomic Panthers system, a set-piece to start. And one of the NRL’s better rule changes of recent years (there have been but a few) is the ability to shift a scrum to multiple points on the field. Against Canberra earlier this year, Penrith set up one such restart 10 metres out from the Raiders line, just to the right of the uprights. Brian To’o feeds the scrum (who says wingers just hang around footballers?), Tyrone Peachey collects the ball off the deck at lock, and Cleary swings into action. What happens next? Now to the NSW, Australia and Panthers No.7 in an almost identical position against the Roosters. Cleary is taking the ball at first receiver again, this time from a play-the-ball, 20 metres out from the Roosters line. Notice champion fullback James Tedesco on red alert at the back, with good reason. What happens next?","pubDate":"2023-09-05 01:44:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"70afd5d0c0fe47cac12fb64461ab392c","title":"Pick the play: Are you smart enough to be an NRL playmaker?","link":"https://www.smh.com.au/sport/nrl/pick-the-play-are-you-smart-enough-to-be-an-nrl-playmaker-20230809-p5dv6e.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Nathanael Scott and Dan Walsh"],"video_url":null,"description":"Can you predict what plays these players are going to make? You’ve got three choices to make the first-grade team.","content":"Add articles to your saved list and come back to them any time. Seven-figure salaries. Pressure. Praise. Hype and hysteria – all that and more is often your lot in life as an NRL playmaker. Not least this weekend, when seasons go on the line in the first week of the finals. Or, in the case of South Sydney, when a campaign that fell off a cliff is analysed from every possible angle. So take a walk in the shoes of Nathan Cleary, step into Adam Reynolds’ No.7 jumper, and try your hand at Cody Walker’s ball-playing caper. See if you can predict which option they take in these plays. The little master Adam Reynolds, who is getting quicker between the ears every year even as his little legs trend in the opposite direction, had plenty of time to work his magic with this midfield play against the Warriors. So, what option does he take? Then against the Dragons in good-ball territory, the veteran half is pushing Brisbane’s attack right and towards the 20-metre line. The Broncos have emphasised players in motion all year , giving Reynolds several teammates to work with. What’s the play? The young gun under the pump Like most of his South Sydney teammates, emerging half Lachlan Ilias was under the microscope during the back half of the season, to the point Reynolds has questioned whether Souths’ game plan suits his successor. Earlier in the year though, in significantly happier times, he was pressing a sliding Broncos edge defence with space, time and options aplenty. What does the youngster do next? The magic touch At his best, no one does this better than Cody Walker. A Storm defence that surges, slides and then shuffles back is all the Rabbitohs veteran needs to cause havoc – how does he do it? Panthers precision For Nathan Cleary and that mesmerising, metronomic Panthers system, a set-piece to start. And one of the NRL’s better rule changes of recent years (there have been but a few) is the ability to shift a scrum to multiple points on the field. Against Canberra earlier this year, Penrith set up one such restart 10 metres out from the Raiders line, just to the right of the uprights. Brian To’o feeds the scrum (who says wingers just hang around footballers?), Tyrone Peachey collects the ball off the deck at lock, and Cleary swings into action. What happens next? Pulling the Chooks to pieces Now to the NSW, Australia and Panthers No.7 in an almost identical position against the Roosters. Cleary is taking the ball at first receiver again, this time from a play-the-ball, 20 metres out from the Roosters line. Notice champion fullback James Tedesco on red alert at the back, with good reason. What happens next? Stream the NRL Premiership 2023 live and free on 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-09-05 01:44:00","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"77a1235bfbf7b9190a0ceaab56e3d436","title":"Sean Payton discusses Raiders rivalry ahead of Week 1 game","link":"https://www.9news.com/article/sports/nfl/denver-broncos/sean-payton-rivalries/73-a1d4e754-c00d-4d86-b920-9d6a743276a8","keywords":["denver-broncos","sports","nfl","mike-klis","local","news","home"],"creator":null,"video_url":null,"description":"The Raiders' Josh Jacobs and Maxx Crosby will get the Broncos' full attention this week as it's Raiders-Broncos in Week 1.","content":"ENGLEWOOD, Colo — Grrr! Raiders Week! Or as Sean Payton considers it, AFC West Opponent Week. “We look at them as divisional games,’’ Payton said in a video-less, Zoom conference call Monday morning with reporters. “I think the rivalries are in college football, and then arch rivalries. I was asked that question a lot (when he with New Orleans in the NFC South), relative to Atlanta, New Orleans. I mean, look, divisional games are important. First goal is to find a way to win your division. You play your divisional opponents twice.” The Denver Broncos open their regular season Sunday afternoon against an AFC West opponent in the Las Vegas Raiders. There was a time when the Raiders where the most hated rival of Broncos Country. Maybe that still exists with the Denver fan base but in the modern-era of free agency, player movement, and opposing players exchanging signed jerseys immediately after the game, hostility between opponents sometimes has to be manufactured. It's not like the NFL of the 1960s, 70s and 80s. “I can’t speak for rivalries,’’ Payton said. “I just think that exists a little bit more in the collegiate game. I think division games are important, yes.” Rivalry or not, tThe Raiders are a great test for the newly Payton-led Broncos as the Black and Silver have won six consecutive games in this divisional matchup. One reason is running back Josh Jacobs. In the seven games he has played against the Broncos since he was a first-round draft choice in 2019, the Raiders have won all of them as he’s averaged 103 rushing yards per game. Credit: AP Photo/Jack Dempsey Denver Broncos head coach Sean Payton watches during the first half of an NFL preseason football game against the Los Angeles Rams Aug. 26, 2023. His recent return from a lengthy contract holdout won’t affect how the Denver defense builds its strategy against him. “Our plan defensively is, here are the key players,’’ Payton said. “He certainly is one of the more dominant running backs in the NFL so that’s how we’ll approach the game.” The other Raider who has taken over the rivalry, err, divisional matchup, is edge player Maxx Crosby. He has at least one sack in seven consecutive games against the Broncos, 11.5 total in that span. “He’s real flexible,’’ Payton said. “He’s a tremendous worker. Athletic. He’s got one of those motors that doesn’t stop and he can get to your edge quick. But his ability to bend and then his stamina are things that stand out.” Following a three-day weekend off, the Broncos will resume practice at 11:30 Monday morning. Related Articles When to watch Broncos coverage on 9NEWS Meet Nate Adkins, the guy who beat out Okwuegbunam Bronco notes: Besides special teams, eight rookies help balance payroll SUGGESTED VIDEOS: Sports MORE WAYS TO GET 9NEWS Subscribe to our daily 9NEWSLETTER Download the 9NEWS APP iTunes: http://on9news.tv/itunes Google Play: http://on9news.tv/1lWnC5n HOW TO ADD THE 9NEWS APP TO YOUR STREAMING DEVICE ROKU: add the channel from the ROKU store or by searching for KUSA. For both Apple TV and Fire TV, search for \"9news\" to find the free app to add to your account. Another option for Fire TV is to have the app delivered directly to your Fire TV through Amazon. Related Articles When to watch Broncos coverage on 9NEWS Breckenridge Distillery releases 2 Broncos bourbon blends Bronco notes: Besides special teams, eight rookies help balance payroll","pubDate":"2023-09-05 01:36:14","image_url":"https://media.tegna-media.com/assets/KUSA/images/f6db0b97-1205-421b-b25e-57a7ac371125/f6db0b97-1205-421b-b25e-57a7ac371125_750x422.jpg","source_id":"9news","source_priority":2657,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"6e1d2b1d81996f770478910b8187249e","title":"Bronco notes: Payton's offensive history excites Sutton","link":"https://www.9news.com/article/sports/nfl/denver-broncos/mike-klis/sean-paytons-offensive-history-excites-courtland-sutton/73-06e5258d-e955-4b60-ad38-a296eb663782","keywords":["mike-klis","sports","nfl","denver-broncos","football","local-sports"],"creator":null,"video_url":null,"description":"Jeudy, Moss making progress from injuries. Numerous jersey number switches, including rookie Mims from 83 to 19.","content":"ENGLEWOOD, Colo. — Hope comes not only from Sean Payton’ s head coaching record that averages better than 10 wins a year over 15 seasons. There is also excitement in Payton as an offensive game planner and play caller whose teams have ranked in the top 9 in total offense (yards per game) in 13 of his 15 seasons as the Saints’ head coach. And in six of those years they ranked No. 1. His New Orleans’ teams also ranked in the top 10 in points scored in 10 of his 15 seasons. And three times they led the NFL in scoring. Anyone who has watched the Broncos’ desultory offense the past seven or eight years knows that win or lose, Payton’s offensive acumen that is much needed. “Man, it’s going to be fun,’’ Courtland Sutton, the Broncos’ expected top receiver for their week 1 matchup against the Las Vegas Raiders on Sunday afternoon at Empower Field at Mile High. “Even with this extra day (of practice Monday) that we got, you were able to see the early bits of his game plan and what his idea is. I think it’s going to be a lot of fun to watch it come to fruition out there on Sunday.” Through the first five seasons of his NFL career, Sutton has been one of the better players for a perennially bottom-rung Broncos’ offense. He plans on being a top receiver for what should be an above-average Broncos’ offense in 2023. “I would hope defenses have seen and understand what I’m able to bring to the table,’’ Sutton said. “They understand they have to account for me while I’m on the field. It’s a fun thing to be a part of because … I’m going to leave it at that.” Credit: AP Photo/Paul Sancya New Orleans Saints quarterback Drew Brees with coach Sean Payton after Super Bowl XLIV against the Indianapolis Colts in Miami, Sunday, Feb. 7, 2010. Jeudy, Moss update Payton would not go through injuries during his Monday morning video-less Zoom conference call with reporters mostly because he didn’t have to. There are two players on the Broncos’ active, 53-man roster who are coming back from injuries, receiver Jerry Jeudy and rookie cornerback Riley Moss. Jeudy suffered a hamstring injury so severe on Aug. 24, he had to be helped onto a cart and then rolled to the doors leading to the training room. Less than two weeks later, he was stretching with the team Monday and conditioning on a side field, a positive sign. It would still be a surprise if Jeudy plays in the opener Sunday against the Raiders, but his availability is looking better for week 2 against Washington. Moss has been out since the first week of training camp with a core-muscle injury that required surgery. He returned to practice on a limited basis Monday for the first time since his surgery. “Kinda-ish,’’ Moss said about his return. “It feels good to be doing some football stuff.” It would figure that Moss would get a couple weeks of practice before he is cleared for a game but he is progressing. “I’ve been chomping at the bit,’’ he said. “I’ve got a lot of energy but the nice thing is I’ll have fresh legs for the season.’’ There is no exact timetable for his return. “Day by day,’’ he said. “Today was good. It’s not where I want to be yet but it’s a stepping stone to where I’m going to be heading.’’ Moss participated fully in the first three training camp practices in late-July. But after the players had a day off, Sunday, July 30, Moss wasn’t at practice Monday, July 31. On Tuesday, Aug. 1, he was undergoing core-muscle surgery in Philadelphia “Over time I could feel it but it wasn’t anything I was nervous about, I could play through it fine,’’ said Moss, a third-round draft pick out of Iowa. “But as I kind of kept going I felt it kind of shoot up and it swelled a little bit so they flew me out to Philadelphia and had the surgery done.” As he visited Dr. William C. Meyers, a noted core muscle specialist, Moss was still hoping for a consultation, a rehab program and return to the practice field. That’s not how it happened. “No, they had me go out to him,’’ Moss said. “The guy (Dr. Meyers) has done a lot of the guys in the league. But I had taken an MRI here and he looked at it and he said might as well get it done.” Credit: AP Photo/Godofredo A. Vásquez Denver Broncos wide receiver Jerry Jeudy catches a ball before an NFL preseason football game, Saturday, Aug. 19, 2023, in Santa Clara, Calif. Number switches Several Broncos players switched numbers from what they were given in training camp and the preseason: Cornerback Tremon Smith went from No. 23 to No. 1. Punter Riley Dixon from 19 to 9. Rookie receiver Marvin Mims Jr. from 83 to 19 (which should be a decent seller once they reach Broncos’ Team Stores). Cornerback Fabian Moreau from 36 to 23. Cornerback Ja’Quan McMillian from 35 to 29. On the practice squad, quarterback Ben DiNucci switched from No. 6 to 11 and safety Devon Key from 38 to 26. Newcomer linebacker Ben Niemann is wearing No. 57. Bronco Bits David Sills, a 6-foot-3, receiver who played some quarterback in college, was cut by the New York Giants last week and joined the Broncos’ practice squad even though he was offered a chance to return to the Giants’ practice squad. “I was, but I had been there four years and felt like I needed a new start,’’ Sills said. With the Giants, he had 13 catches for 123 yards in his last two years there. … Practice squad offensive tackle Demontrey Jacobs was back practicing Monday. He had suffered minor knee and ankle sprains in the final preseason game, Aug. 26. ... The Broncos reached an injury settlement with outside linebacker Christopher Allen and he was waived from their injured reserve list. Allen suffered a minor injury in the final preseason game. Related Articles When to watch Broncos coverage on 9NEWS Sean Payton discusses Raiders rivalry ahead of Week 1 game Broncos giving away car stencils Tuesday SUGGESTED VIDEOS: Sports","pubDate":"2023-09-05 01:10:29","image_url":"https://media.tegna-media.com/assets/KUSA/images/bab423c5-41ea-4f0c-ba4e-66d028ff30c0/bab423c5-41ea-4f0c-ba4e-66d028ff30c0_750x422.jpg","source_id":"9news","source_priority":2657,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"39f532bc42722c4c2528888eceffc604","title":"Словаччина - Португалія: де і коли дивитися онлайн матч кваліфікації Євро-2024 08.09.2023","link":"https://champion.com.ua/football/2023/09/05/938061/slovachchyna-portuhaliya-de-dyvytysya-match-kvalifikatsiyi-yevro-2024","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі 5-го туру кваліфікації чемпіонату Європи-2024 з футболу збірна Словаччини зіграє з Португалією.Підключитися до МегогоМатч відбудеться у п'ятницю, 8 вересня. Початок матчу о 21:45 за київським часом. Актуально:Кваліфікація Євро-2024: формат, р...","content":"Джерело - Чемпіон . У матчі 5-го туру кваліфікації чемпіонату Європи-2024 з футболу збірна Словаччини зіграє з Португалією. Підключитися до Мегого Матч відбудеться у п'ятницю, 8 вересня . Початок матчу о 21:45 за київським часом. Актуально: Кваліфікація Євро-2024: формат, регламент змагань та склад усіх груп Дивитися поєдинок можна на медіасервісі Megogo.","pubDate":"2023-09-05 01:00:00","image_url":null,"source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"b1dd15e7dbcbfd56eff4066c79c043ba","title":"Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou","link":"https://www.dailymail.co.uk/sport/nrl/article-12480465/Souths-Latrell-Mitchell-switch-rumour-plan-Sam-Burgess-head-coach.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"An internal review at South Sydney could result in massive changes including a huge switch for Latrell Mitchell, while rumours continue to swirl that Sam Burgess could return.","content":"Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou Souths crashed out of finals contention Mitchell and Demetriou under pressure READ MORE: Fears for Mitchell over controversy By Josh Alston For Daily Mail Australia Updated: 01:57 BST, 5 September 2023 e-mail View comments An internal review at South Sydney could result in massive changes at Redfern including moving Latrell Mitchell out of the fullback position - while rumours continue to swirl that Sam Burgess could return to coach the Bunnies. Mitchell is firmly under the pump at Souths following an injury-disrupted year that saw the son of NRL legend Clive Churchill label him a ' cancer ' on the team in a message to club chairman Nick Pappas . The representative star has become the face of Souths annus horribilis that saw the Bunnies crash from being raging competition favourites to missing the finals altogether. It could result in Mitchell being dumped from the fullback position for incoming superstar Jack Wighton as Souths conduct a review on every element of the football department. Meanwhile, Souths have been forced to hose down speculation that a trade deal could see Souths coach Jason Demetriou go to the Super League, and Burgess stay in Australia. Souths officials told the Sydney Morning Herald they weren't trying to get rid of Demetriou after an official at Warrington, where Burgess will take over as head coach, said the club had been told a high-ranking Bunnies staffer wanted the Englishman to consider returning as head coach. Burgess declined to comment. Mitchell had another injury-disrupted season and came under fire for his efforts when he returned to play for the Bunnies Mitchell and Jack Wighton wrestle at New South Wales Blues training. They will be teammates in 2024 and Wighton will reportedly be considered for the fullback role After leading the competition at the conclusion of round 11, Souths spectacularly flamed out with a 26-12 loss to bitter rivals Sydney Roosters in the final round consigning them to ninth place on the NRL ladder. As the pressure intensified, internal rifts became public knowledge with Burgess walking out on his job as assistant coach of the club he famously won a premiership with in 2014. Burgess had clashed with Jason Demetriou, accusing the coach of giving Mitchell and star playmaker Cody Walker preferential treatment. Other cracks were leaked as well, with reports of Walker storming out of a training session and Cam Murray allegedly snapping at Mitchell during a video session. A Souths official told the publication that Demetriou will be asked to consider moving Mitchell out of fullback, which could cause further rifts within the club, as the coach believes he can still unlock his star in the No.1 jersey. Phil Gould believes the decision on where Mitchell plays should be made by Jason Demetriou and not other influences Paul Gallen defended Mitchell and said he can do things on the footy field no other player is capable of Former New South Wales captain Paul Gallen gave an impassioned defence of Mitchell on Channel Nine's 100% Footy , saying he had an x-factor that elevated him over all other players. 'I don't understand where this talk about Latrell at fullback has come from. Latrell as a fullback has never changed the way he plays, he's always been able to do things other people just can't do on the football field, we know that,' he said. 'He's never been an effort player, he's never been the player backing up the middle, he's never been the player making 20 runs a game for 200 metres, he's never been that Dylan Edwards, James Tedesco type player. He's always just had that x-factor, and can do things other players can't do Paul Gallen 'He's always just had that x-factor, and can do things other players can't do.' Bulldogs boss and former New South Wales coach Phil Gould said the decision on where to play should rest solely on the shoulders of Demetriou. 'I don't think it's anyone's business bar the coach, I don't know who in the club would be questioning where the coach plays him or why suddenly after this game [against the Roosters],' he said. 'I mean, they lost on the weekend because Latrell didn't play, had he played it could've been a very different story. But arguing right now about where Latrell plays next year I don't think is a major part of the review whatsoever. 'Certainly there are other factors there that a far more important for South Sydney and why it fell away the way it did, without questioning where Latrell plays next year. That's not the solution to their issues.' South Sydney coach Jason Demetriou signed a massive three-year deal this season but that could come under review if the results don't follow Burgess worked as an assistant coach at Souths this season before he clashed with Demetriou over the treatment of Mitchell and Cody Walker Burgess and fiancé Lucy Graham are expecting their first child together which played a role in the former Souths enforcer wanting to return to England Demetriou will be under enormous pressure in 2024 with reports that Burgess is being considered for the head coaching role n the future. Burgess has committed to English Super League side Warrington for the 2024 season, but could be an option for 2025 if Souths can't turn their fortunes around. A Warrington official told the Sydney Morning Herald that a senior Souths official had already floated the idea of a swap deal, sending Demetriou to the UK with Burgess to return to the Rabbitohs. Demetriou signed a three-year extension midway through the 2023 season on a huge $2.5million deal, but that deal will come under review if he can't get results next season. Burgess has replaced former Warrington coach Daryl Powell after the club's lean run of form this year. He does not currently have the coaching credentials for that level, but Super League made an exemption to allow him to take the post at Warrington. Share or comment on this article: Souths 'could force Latrell Mitchell into a major move' - as Bunnies speak out on rumoured plan to get Sam Burgess back as head coach to replace Jason Demetriou e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-05 00:57:19","image_url":"https://i.dailymail.co.uk/1s/2023/09/05/00/75058453-0-image-a-10_1693870758962.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"}]}