{"newsArray":[{"title":"Thiago update, Darwin Nunez boost and three other things spotted in first day of Liverpool pre-season training","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/gallery/thiago-update-darwin-nunez-boost-27283736","keywords":["Sport"],"creator":null,"video_url":null,"description":"Things we spotted from Liverpool's first training session of the season as Jurgen Klopp's men reported back for pre-season training","content":"Liverpool reported back to the AXA Training Centre for the start of pre-season training on Saturday, with eight senior players the first of Jurgen Klopp’s ranks to return. The club had already confirmed that Adrian, Stefan Bajcetic, Fabinho, Joe Gomez, Joel Matip, Darwin Nunez, Nathaniel Phillips and Thiago Alcantara would all report for duty this weekend, with the Reds’ internationals then getting their own schedules underway on Tuesday. Meanwhile, Curtis Jones and Harvey Elliott are due back later this summer after helping England reach the final of the Under-21s European Championships. As a result, summer signings Alexis Mac Allister and Dominik Szoboszlai will have to wait a little while longer to meet their new team-mates, courtesy of their summer international excursions with Argentina and Hungary respectively. But as the first players reported back for pre-season, here’s what we spotted in the first training pictures of the summer… While Thiago might have been on the eight-man list said to be reporting for pre-season training on Monday, the Spaniard was absent from Liverpool’s initial released training pictures amid speculation about his future. Although not pictured, it’s understood that the Reds’ players aren’t all in at the AXA Training Centre at the same time, with the Spaniard expected later today. While the 32-year-old wasn’t yet pictured, his seven other senior team-mates due back for pre-season on Saturday were. The midfielder has been subject of interest from Saudi Arabia and Turkey, but no clubs have approached the Reds as things stand. Meanwhile, Thiago missed the end of last season after undergoing surgery on a hip injury. As a result, it’s possible that was the reason behind him not being in at the same time as his team-mates. However, with speculation ongoing regarding his future, tongues are certain to be set wagging. While Thiago was absent, the other seven senior players scheduled to return were all pictured at the AXA Training Centre. As a result, Stefan Bajcetic made his own return from injury after missing the end of last season. The Spaniard enjoyed an impressive breakthrough campaign for Liverpool, making 19 appearances before an abductor injury curtailed his progress and ended his season prematurely back in March. But the 18-year-old was pictured lifting weights in the gym and kicking a ball around on the grass, suggesting he’s ready to hit the ground running this summer as he looks to make up for lost time. There was an extra senior player pictured in training on Saturday, with Calvin Ramay back at the AXA Training Centre despite it being confirmed he is spending the season out on loan. The Scotland international was confirmed to be joining Preston North End for the season last month, though the teenager isn’t set to link up with the Championship side until July 15. As a result, he’s starting pre-season with Liverpool. And having missed the end of last season with a knee injury which forced him to undergo surgery, the 19-year-old was spotted working hard in the gym and with a ball out on the pitch as, like Bajcetic, he looked to make up for lost time. Elsewhere, Academy goalkeeper Jakub Ojrzynski was also pictured in training after spending last season on loan with Radomiak Radom in his native Poland. Jurgen Klopp admitted Darwin Nunez hadn’t quite got the grasp of English on more than one occasion last season, but the Uruguayan was spotted on camera having a conversation with his manager, and pictured laughing and joking with the German. While just basic greetings, it would seem the striker has been working on his English over the summer. Nunez would also be pictured with Ramsay in the gym as the two exchanged greetings. Steady on, Darwin. Learning English is one thing, but you might not be ready for the young Scot’s broad Aberdeen accent just yet! It's been a long summer for the Liverpool squad, with 41 days passing since the Reds finished the season with a 4-4 draw away at Southampton. As a result, the players who reported back on Saturday were delighted to see each other. Joe Gomez was spotted giving both Klopp and Ramsay a big hug, (though he might not have had much say in the former!), while Fabinho and Adrian shared an embrace. Meanwhile, Joel Matip was spotted hugging assistant fitness coach Jordan Fairclough. Cute!","pubDate":"2023-07-08 14:02:40","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27283754.ece/ALTERNATES/s98/0_GettyImages-1525238575.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David de Gea confirms Manchester United departure","link":"https://www.watfordobserver.co.uk/sport/national/23642806.david-de-gea-confirms-manchester-united-departure/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The 32-year-old’s contract with United expired at the end of June.","content":"The 32-year-old’s contract with United expired at the end of June, with no new deal agreed despite talks that took place throughout the season. In a message on social media, De Gea thanked United fans for their support, but said: “Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings.” When De Gea’s contract expired last Friday, United said they remained in talks with the Spain goalkeeper. I just wanted to send this farewell message to all Manchester United supporters. I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. I took incredible… — David de Gea (@D_DeGea) That followed reports that De Gea had signed a contract extension only for the club to withdraw that offer and come back with reduced terms. De Gea wrote: “I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. “I took incredible pride every time I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. “It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. “Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.” United boss Erik ten Hag has reportedly been pushing to sign a new goalkeeper in this transfer window, with a deal for Inter Milan’s Andre Onana said to be close. The Dutchman paid tribute to the departing De Gea, who won the Premier League’s golden glove last season. Ten Hag said: “It takes great quality and character to reach the level of even playing one game for Manchester United. “To do it 545 times over 12 years is a special achievement, particularly in the goalkeeping position where every game puts you in the spotlight. Forever a United legend. Thank you for everything, ❤️ — Manchester United (@ManUtd) “To have won Player of the Year awards from both the fans and his team-mates, each on four occasions, shows the level of his performance and he will always be remembered as one of the very best goalkeepers in the history of the club. “I am personally grateful for the 25 clean sheets he helped provide last season and his overall contribution on the pitch during my first year at the club. “All the players and staff send him our very best wishes for the next phase of his outstanding career.”","pubDate":"2023-07-08 14:01:37","image_url":"https://www.watfordobserver.co.uk/resources/images/16950600/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David de Gea departs Manchester United as Red Devils confirm goalkeeper's exit","link":"https://www.dailymail.co.uk/sport/football/article-12277977/David-Gea-departs-Manchester-United-Red-Devils-confirm-goalkeepers-exit.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"De Gea posted a circus emoji on Twitter this week , displaying in no uncertain terms his unhappiness with the club's actions, and now United have confirmed that his career at Old Trafford is over.","content":"David de Gea confirms he is leaving Man United to 'seek a new challenge' after 12 years... as Erik ten Hag sends best wishes despite U-turn on a new contract that led to messy exit Manchester United have confirmed David de Gea's exit from the club The Red Devils performed a U-turn on a new contract for the goalkeeper Follow MailSport on Threads here: https://www.threads.net/@mailsport By Ollie Lewis For Daily Mail Australia Published: 14:43 BST, 8 July 2023 | Updated: 15:27 BST, 8 July 2023 e-mail 33 shares 57 View comments David de Gea's 12-year stint at Manchester United is over after the Red Devils confirmed his exit on Saturday. The 32-year-old’s contract at Old Trafford expired at the end of June, with Mail Sport revealing last month that the framework for a new contract aimed at reducing De Gea's £375,000-a-week wage had initially been agreed between the player and the club. However, manager Erik Ten Hag's reservations over keeping his No 1 had put the deal in jeopardy, with the club backing out of the tabled offer. De Gea posted a circus emoji on Twitter this week , displaying in no uncertain terms his unhappiness with the club's actions, and now United have confirmed that the Spaniard's career at Old Trafford is over. Following an official statement from the club in which De Ge was thanked for his service, the 32-year-old posted his own statement on Twitter. He insists that he is 'seeking a new challenge', despite being blindsided by the contract withdrawal. Follow MailSport on Threads here: https://www.threads.net/@mailsport Manchester United have confirmed the exit of David de Gea from the football club De Gea has departed after manager Erik ten Hag (R) had reservations over a new contract The Spaniard took to Twitter to confirm his exit after a rollercoaster 12 years 'I just wanted to send this farewell message to all Manchester United supporters,' he posted. 'I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. 'I took incredible pride everytime I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. 'It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. 'Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings. Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.' Ten Hag sent the goalkeeper his best wishes, despite having cold feet over the new contract. He said via the club's official website : 'It takes great quality and character to reach the level of even playing one game for Manchester United. To do it 545 times over 12 years is a special achievement, particularly in the goalkeeping position where every game puts you in the spotlight. De Gea was brought to the club by legendary former coach Sir Alex Ferguson in 2011 He won eight trophies during his time in Manchester, including the 2015-16 FA Cup (above) 'To have won Player of the Year awards from both the fans and his team-mates, each on four occasions, shows the level of his performance and he will always be remembered as one of the very best goalkeepers in the history of the club. 'I am personally grateful for the 25 clean sheets he helped provide last season and his overall contribution on the pitch during my first year at the club. All the players and staff send him our very best wishes for the next phase of his outstanding career.' De Gea's circus message was the latest in a series of snappy social media posts in recent weeks. At the end of June he posted a yawning emoji in what seemed to be another reference to his long-running contract saga. The Spaniard made 545 appearances for the Red Devils, keeping 190 clean sheets. He lifted eight trophies during his time at Old Trafford - including the Premier League, FA Cup and Europa League. United are now on the lookout for a new No 1 goalkeeper, with Ten Hag keen to land his former Ajax stopper Andre Onana in a £43million deal. Follow MailSport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: David de Gea departs Manchester United as Red Devils confirm goalkeeper's exit e-mail 33 shares Add comment Comments 80 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 13:56:59","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/14/72993823-0-image-a-66_1688824299342.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David De Gea transfer decision confirmed amid Jordan Pickford and Everton rumours","link":"https://www.liverpoolecho.co.uk/sport/football/transfer-news/david-de-gea-transfer-decision-27283785","keywords":["Sport"],"creator":null,"video_url":null,"description":"David de Gea has bid farewell to Manchester United fans following the expiry of his contract","content":"David de Gea has confirmed he will not be extending his stay at Manchester United amid claims the Red Devils are targeting Everton's Jordan Pickford. The Spaniard's 12-year association with the Old Trafford club comes to an end after his contract expired at the end of July. It was claimed that United were looking to continue dialogue with the goalkeeper following the end of his deal with a view to extending on reduced terms. However, the shot-stopper has confirmed that he is now a free agent. In recent days, the 32-year-old has posted a series of tweets which appear cryptic to describe the situation that is unravelling in Manchester. The Manchester Evening News reported previously in May that there were with . In a post on Twitter, De Gea confirmed his exit, writing: \"I just wanted to send this farewell message to all Manchester United supporters. \"I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. I took incredible pride everytime I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. \"It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. \"Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings. Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.\" With speculation surrounding their next goalkeeper, 's was subject to reported interest from the Red Devils. In recent months, the attention of Erik ten Hag has turned to Inter Milan's Andre Onana - after the pair's time together at Ajax. Talks have also been held with the agent of Urawa Red Diamonds and Japan Under-21 goalie Zion Suzuki over a possible second addition between the sticks.","pubDate":"2023-07-08 13:53:53","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article26403930.ece/ALTERNATES/s98/0_GettyImages-1471523680.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Kylian Mbappe 'has angered PSG team-mates' after branding club 'divisive' in controversial interview","link":"https://www.dailymail.co.uk/sport/football/article-12277937/Kylian-Mbappe-angered-PSG-team-mates-branding-club-divisive-controversial-interview.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"According to Sky Sports , two of the six are players that have joined this summer. Mbappe spoke to the publication on June 12 but the article has only just been published.","content":"Kylian Mbappe slams 'divisive' PSG and questions their signings in explosive interview... as 'six of the club's angry players complain to president Nasser Al-Khelaifi about the French star's comments' Six PSG players have complained about Kylian Mbappe's controversial interview Mbappe claims his performances are criticised due to the divisive nature of PSG Follow MailSport on Threads here: https://www.threads.net/@mailsport By George Glinski For Mailonline Published: 14:33 BST, 8 July 2023 | Updated: 15:03 BST, 8 July 2023 e-mail 27 View comments Six PSG players have contacted club president Nasser Al-Khelaifi to complain about comment's made by Kylian Mbappe during a recent interview with France Football Magazine. According to Sky Sports , two of the six are players that have joined this summer. Mbappe spoke to the publication on June 12 but the article has only just been published. During the sit down, he branded PSG as a 'divisive' club and stated that his performances are unjustly criticised because it is much harder to impress while playing in France. 'Are people trivializing my performances?' he told France Football. 'Yes, but at the same time, I don't blame them, he says. In France, they saw me grow up, they see me all the time, at PSG every weekends or in selection. Kylian Mbappe slammed PSG and Ligue 1 during a controversial interview with France Football Mbappe's contract runs out at PSG in June 2024 and he looks set to leave the club this summer Naseer Al-Khelaifi has received six complaints from PSG players about Mbappe's interview 'And I've been scoring a lot for years. So, for people, it's becoming normal. I've never complained that my performances are trivialized. 'I'm young and I've had the chance to It was not that long ago to be an observer, before being an actor. 'And myself, I trivialized what Messi was doing, what Cristiano Ronaldo was doing, what the great players were doing. We are in a consumer society, where \"it's good, but do again\". 'And the fact that I'm right next door, in Paris... I think playing at Paris-SG doesn't help much because it's a divisive team, a divisive club. 'So, of course it attracts gossip but it doesn't bother me because I know what I'm doing and how I do it.' Mbappe recently sent a letter to PSG affirming that he has no intention of extending his contract with the club by a further year, which expires in 2024, but it is unclear whether he is aiming to see out his deal at Princes Park or move elsewhere this summer. The French giants are keen to cash in on their star man if he chooses to leave and have given him a deadline of July 31 to make a decision about his future. Share or comment on this article: Kylian Mbappe 'has angered PSG team-mates' after branding club 'divisive' in controversial interview e-mail Add comment Comments 29 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 13:49:02","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/14/72993427-0-image-a-9_1688822697181.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘One of the greatest strikers in the world’: Pochettino praises Chelsea transfer target and it’s not Mbappe or Haaland","link":"https://www.hindustantimes.com/sports/football/one-of-the-greatest-strikers-in-the-world-pochettino-praises-chelsea-transfer-target-and-it-s-not-mbappe-or-haaland-101688810947721.html","keywords":null,"creator":null,"video_url":null,"description":"Mauricio Pochettino hailed a Chelsea transfer target, but played down talks of the club signing the forward.","content":"Mauricio Pochettino was unveiled as the new head coach for Chelsea on Friday, and spoke to the press about what his ambitions are for the summer transfer window and the season that lies ahead. Pochettino joins a Chelsea team which experienced a very poor 2022/23 season, finishing in 12th place in the Premier League, despite upwards of 600 million pounds spent by new owner Todd Boehly and his consortium. Newly-appointed Chelsea manager Mauricio Pochettino addresses the media during a press conference.(AP) Pochettino has been without a club since his departure from PSG, but returns to the city where he earned his name as one of the finest young managers in European football. Formerly having been head coach at Tottenham Hotspur, the Argentinian oversaw their most successful years of the 21st century. He took them to numerous top 3 finishes and a Champions League final, but perhaps most importantly oversaw the development of Harry Kane. Also Read | Inter Miami announce 'The Unveil' ahead of Messi arrival With Kane’s contract entering its final year and the English striker seeking a new club, there have been rumours linking him to a reunion with his former boss, heading across London to play at Stamford Bridge. However, Pochettino held his cards close to his chest regarding a potential transfer for one of the PL’s highest ever scorers. “You are talking about one of the greatest strikers in the world,” said Pochettino in his first interview as Chelsea manager. “I think it’s too unfair to talk (about a player at another club).” Kane overtook Wayne Rooney in the list of the Premier League’s all-time top-scorers, and now sits behind only Alan Shearer. He was heavily linked with Manchester United earlier this window, but the Red Devils have reportedly pulled out of the pursuit. “They know my relationship with him was always amazing. I saw him when he was young and grow up and achieve all that he was achieving. We have a great relationship,” said Pochettino of his bond with Kane. Kane came through at Spurs under Pochettino and twice won the golden boot under him. He scored 29 goals in 30 appearances in the 2016/17 season, the closest Kane and Pochettino came to winning the league, falling narrowly short of Pochettino’s new employers that season. Kane is also heavily being linked with Bayern Munich, but might potentially want to stay in England. He sits 47 goals short of Shearer’s record, and still only 29 years old, could establish himself as the Premier League’s most prolific striker in due time. His stellar season this year paled in comparison to Erling Haaland’s incredible numbers, but 30 goals for 8th-place Tottenham is nonetheless a remarkable feat. Chelsea are going through significant changes this window, offloading some of their old guard in favour of fresh faces. Kai Havertz, Mason Mount, Matteo Kovacic, Ngolo Kante, and Hakim Ziyech have all left the club. Meanwhile, Christopher Nkunku and Nicolas Jackson join from RB Leipzig and Villareal respectively. Chelsea are still looking to add firepower to a team which scored only 38 goals last season: only four teams in the Premier League scored fewer. “At the moment, we are thinking (in the transfer market) in a different way. We are not thinking that. We’re working hard to try to provide the squad with good quality. We are working on that and still we have time to work. For sure we are going to add players that can score and we are going to find the best way to play,” concluded Pochettino. Pochettino and Chelsea begin their preseason preparations in the United States, starting with a friendly against the Ryan Reynolds and Rob McElhenney-owned Wrexham. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Mauricio Pochettino Chelsea Fc Harry Kane","pubDate":"2023-07-08 13:21:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/07/08/1600x900/AP07-07-2023-000358A-0_1688811006713_1688811037496.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"El PSG es un 'polvorín': seis jugadores se quejan de Mbappé","link":"https://www.marca.com/futbol/real-madrid/2023/07/08/64a95bd222601d2f7a8b456c.html","keywords":["Real Madrid","Mbappé","PSG"],"creator":["RICARDO FERNÁNDEZ"],"video_url":null,"description":null,"content":"Esto es un \". Son algunas de las palabras que han llegado a proferir los sobre las declaraciones de Mbappé en France Football. La revista entregaba ayer viernes el premio a mejor jugador francés al delantero nacido en Bondy. A la entrega del galardón le ha acompañado una entrevista en la que Mbappé afirmaba que \" , además de ser un club divisor\". Esto no ha caído del todo bien en el vestuario, según asegura RMC. de la plantilla parisina, , se han quejado a la dirección del club de las palabras de Kylian, las cuales para alguno de ellos suponen un insulto al equipo. también está bastante disgustado. \"Si eso es lo que piensa, \", comentaba el presidente según RMC. Luis Campos, entre la espada y la pared El medio de Montecarlo señala también la , que se encuentra en medio de esta batalla comunicativa entre el club y el clan Mbappé. Este último ha dicho públicamente, por activa y por pasiva, que su intención es el año que viene. Acto que el PSG, afirma, . De ahí que Campos, se encuentre entre la y sin posibilidad de solucionar el conflicto y planeando ya alternativas al delantero francés. Por otro lado, RMC asegura que siguen intentando negociar una renovación para que en París. Veremos como acaba este culebrón que en los últimos días se está poniendo .","pubDate":"2023-07-08 12:51:53","image_url":"https://phantom-marca.unidadeditorial.es/7ae5f29d2bfb0e22f910d166357bda87/crop/366x0/1684x1318/resize/1318/assets/multimedia/imagenes/2023/07/08/16888205991264.jpg","source_id":"marca","category":["sports"],"country":["colombia"],"language":"spanish"},{"title":"Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract","link":"https://www.dailymail.co.uk/sport/football/article-12277833/Kyle-Walker-undecided-Man-City-future-despite-offered-new-contract.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Kyle Walker will make a decision on his future 'very soon' amid speculation over his role at Man City next season.","content":"Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract, with Bayern Munich boss Thomas Tuchel 'pushing to sign him this summer' England's Kyle Walker has enjoyed an illustrious six years at Manchester City He 'remains undecided on his future' amid interest from Bayern Munich Follow MailSport on Threads here: https://www.threads.net/@mailsport By Michael Rudling For Mailonlne Published: 08:38 EDT, 8 July 2023 | Updated: 09:10 EDT, 8 July 2023 e-mail View comments Kyle Walker will make a decision on his future 'very soon' amid speculation over his role at Man City next season. The 33-year-old has enjoyed an extraordinary six seasons at the Etihad, winning five Premier League titles and the Champions League. He played 39 games for City as they secured a historic treble in 2022/23 but was occasionally dropped for big games, including the the UCL final. Walker later admitted the decision left him 'gutted'. The England fullback remains undecided on where he will play his football next season, with Fabrizio Romano reporting that he has not yet accepted a new contract offered by Man City. He also claims that Bayern remain keen on Walker, with manager Thomas Tuchel a big admirer. Manchester City and England fullback Kyle Walker 'remains undecided on his future' Man City have offered him a new deal, but Bayern Munich remain interested Follow MailSport on Threads here: https://www.threads.net/@mailsport Mail Sport also previously reported that Sheffield United were keen on bringing Walker to Yorkshire , though a move to Munich would allow him to keep playing Champions League football next season. The Blades are Walker's hometown club, and would be willing to welcome him back following his exit in 2009, as they adjust to their first season back in the Premier League. Wherever he ends up playing, the Man City man will be in good shape after he was pictured out for a run near his home in Cheshire just two weeks after playing his final game of the season with England. He was pictured with former Spurs, Sheffield United and City midfielder Michael Brown as they pounded around the streets. City have already been active elsewhere in the transfer market, with Mateo Kovacic arriving from Chelsea for £25 million. The former Real Madrid man will fill the gap left by Ilkay Gundogan, who has joined Barcelona on a free transfer. They had also been heavily linked with Declan Rice, but pulled out of negotiations for the midfielder. He is expected to join Arsenal for £105m in the coming days. Follow MailSport on Threads here: https://www.threads.net/@mailsport He was recently spotted staying in shape with former Man City man Michael Brown Man City have already brought in Mateo Kovacic this summer after Ilkay Gundogan left for Barcelona on a free transfer Share or comment on this article: Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 12:38:20","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/13/72992367-0-image-a-12_1688819746216.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub","link":"https://www.dailymail.co.uk/sport/football/article-12277851/Jack-Grealish-looks-worse-wear-Man-City-party-boy-led-Ibiza-nightclub.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Manchester City midfielder has travelled to the Spanish island after other trips abroad to enjoy his time of before returning to training with the Premier League champions later this month.","content":"Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub at just 11PM a £1,500 Gucci outfit... as he continues to live it up on the Spanish island Grealish has partied in Ibiza for three days and was seen with Wayne Lineker He has also enjoyed trips to Las Vegas and the French Riviera this summer He is due back in pre-season training for Manchester City later this month Follow MailSport on Threads here: https://www.threads.net/@mailsport By Lewis Browning For Mailonline Published: 13:09, 8 July 2023 | Updated: 13:52, 8 July 2023 e-mail 143 View comments Jack Grealish is continuing his off-season celebrations in Ibiza and he was spotted leaving an Ibiza nightclub on Saturday morning. The Manchester City midfielder has travelled to the Spanish island to enjoy his time of before returning to training with the Premier League champions later this month. He has plenty to celebrate after helping lead his side to an historic Treble this season , with City winning the league, FA Cup and their maiden Champions League title under Pep Guardiola. On Friday, he was seen enjoying the scenes at Ocean Beach as he posed for a photo with Wayne Lineker , and the partying didn't stop there as he headed into the night. He was spotted being led out of a nightclub by friends in the early hours on Saturday, donning a £1,500 Gucci outfit. Jack Grealish has been spotted looking worse for wear in Ibiza as he enjoys time off The Manchester City and England star was led out of a nightclub and into a van on the early hours of Saturday morning He donned a bucket hat and socks and sliders as he walked down the road on the island Grealish was surrounded by friends as he left the Ushuaia Ibiza Club on Saturday Follow MailSport on Threads here: https://www.threads.net/@mailsport The 27-year-old has become synonymous with partying during time off, and that showed no sign of slowing down before he meets up with his teammates at City. Images showed the England star firstly being led out of Ibiza hotspot Ushuaia club with friends after three days of partying on the Spanish island. Followed by what appears to be a bouncer, he then leaned on cars around him to get into a van to leave the scene. Images also showed Grealish in a bucket hat walking down a road. He also gifted Yann Pissenem, the club owner, a signed shirt, with the image shared on his Instagram. Grealish drew attention when he partied after City's Treble win at the end of last season, and was spotted enjoying the boozy celebrations with his teammates on a bus parade of Manchester. He admitted he was in a 'world of pain' after the partying died down and he had to join up with Gareth Southgate's England squad ahead of European qualifiers against Malta and North Macedonia in June. He came on as a substitute in the second game after joining up with the squad, but has now gone onto enjoy his off-season. Grealish has partied for three days in Ibiza after trips to Las Vegas and the French Riviera Grealish looked worse for wear as he was led out of a nightclub, but was all smiles as he enjoyed his well-earned time of Meanwhile, Grealish's girlfriend Sasha Atwood showed off her incredible body in France Sasha appeared to be spending the summer on separate holidays from boyfriend Jack Following his side's historic Treble, Grealish has been making the most of his time off the pitch by indulging in breaks to Las Vegas , the French Riviera and now Ibiza. Meanwhile. Grealish's girlfriend Sasha Attwood displayed her jaw dropping figure in a navy bikini as she posed for stunning snaps in front of a sunset at the beach on Instagram on Friday. The model, 27, looked incredible in the two piece from Tesco 's brand F and F which boasted gold detailing and a halter neckline as she spent time on the continent. The girlfriend of Man City footballer Jack Grealish draped an oversized white sheer shirt off her shoulders while showing off her bronzed tan. She styled her long blonde tresses in luxurious waves as they cascaded down past her shoulders from a centre parting. Sasha applied a radiant palette of makeup to accentuate her beauty and accessorised with a pair of small gold hoop earrings. She penned: 'Golden hour'. It comes as Sasha appeared to be spending the summer on separate holidays from boyfriend Jack . Follow MailSport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub e-mail Add comment Comments 157 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 12:34:41","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/12/72992231-0-image-a-56_1688816397809.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Liverpool full pre-season fixture schedule and how to watch every game","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-full-pre-season-fixture-27278091","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpoool will be heading to Germany and Singapore this summer and you can watch all the pre-season action","content":"Liverpool's pre-season is underway as Jurgen Klopp gets ready to welcome back a host of first teamers to Kirkby. It's been an exciting off season so far for the Reds with the acquisitions of and but now all attention will be on getting Liverpool into top condition as they look to break back into the top four next season. Klopp's men now have five matches announced as they make their bid for full fitness. Eight members of Klopp’s senior squad are set to return for day one of pre-season including Adrian, Stefan Bajcetic, Fabinho, Joe Gomez, Joel Matip, Darwin Nunez, Nathaniel Phillips and Thiago Alcantara. Harvey Elliott and Curtis Jones will join up at a later date following their successful stint with England in the . First up are games against Karlsruher SC and Greuther Furth in Germany. They will then entertain Leicester City and Bayern Munich as part of their Singapore tour, before returning to the UK to meet SV Darmstadt 98 at Preston North End's Deepdale stadium. The games are expected to feature a number of senior players with the Liverpool players who have been on international duty during the summer set to get their schedule under way on Tuesday, July 11. You'll be able to watch all five of the Reds' fixtures live and on demand this summer with LFCTV GO, including the games in Germany and Singapore, as well as the Darmstadt game at Deepdale. Karlsruher SC v Liverpool - 5.30pm Greuther Furth v Liverpool - 12pm Liverpool v Leicester City - 10am Liverpool v Bayern Munich - 12.30pm Liverpool v SV Darmstadt 98 - 7pm .","pubDate":"2023-07-08 12:34:32","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27254606.ece/ALTERNATES/s98/0_GettyImages-1421280423.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Thiago update, Darwin Nunez boost and three other things spotted in first day of Liverpool pre-season training","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/gallery/thiago-update-darwin-nunez-boost-27283736","keywords":["Sport"],"creator":null,"video_url":null,"description":"Things we spotted from Liverpool's first training session of the season as Jurgen Klopp's men reported back for pre-season training","content":"Liverpool reported back to the AXA Training Centre for the start of pre-season training on Saturday, with eight senior players the first of Jurgen Klopp’s ranks to return. The club had already confirmed that Adrian, Stefan Bajcetic, Fabinho, Joe Gomez, Joel Matip, Darwin Nunez, Nathaniel Phillips and Thiago Alcantara would all report for duty this weekend, with the Reds’ internationals then getting their own schedules underway on Tuesday. Meanwhile, Curtis Jones and Harvey Elliott are due back later this summer after helping England reach the final of the Under-21s European Championships. As a result, summer signings Alexis Mac Allister and Dominik Szoboszlai will have to wait a little while longer to meet their new team-mates, courtesy of their summer international excursions with Argentina and Hungary respectively. But as the first players reported back for pre-season, here’s what we spotted in the first training pictures of the summer… While Thiago might have been on the eight-man list said to be reporting for pre-season training on Monday, the Spaniard was absent from Liverpool’s initial released training pictures amid speculation about his future. Although not pictured, it’s understood that the Reds’ players aren’t all in at the AXA Training Centre at the same time, with the Spaniard expected later today. While the 32-year-old wasn’t yet pictured, his seven other senior team-mates due back for pre-season on Saturday were. The midfielder has been subject of interest from Saudi Arabia and Turkey, but no clubs have approached the Reds as things stand. Meanwhile, Thiago missed the end of last season after undergoing surgery on a hip injury. As a result, it’s possible that was the reason behind him not being in at the same time as his team-mates. However, with speculation ongoing regarding his future, tongues are certain to be set wagging. While Thiago was absent, the other seven senior players scheduled to return were all pictured at the AXA Training Centre. As a result, Stefan Bajcetic made his own return from injury after missing the end of last season. The Spaniard enjoyed an impressive breakthrough campaign for Liverpool, making 19 appearances before an abductor injury curtailed his progress and ended his season prematurely back in March. But the 18-year-old was pictured lifting weights in the gym and kicking a ball around on the grass, suggesting he’s ready to hit the ground running this summer as he looks to make up for lost time. There was an extra senior player pictured in training on Saturday, with Calvin Ramay back at the AXA Training Centre despite it being confirmed he is spending the season out on loan. The Scotland international was confirmed to be joining Preston North End for the season last month, though the teenager isn’t set to link up with the Championship side until July 15. As a result, he’s starting pre-season with Liverpool. And having missed the end of last season with a knee injury which forced him to undergo surgery, the 19-year-old was spotted working hard in the gym and with a ball out on the pitch as, like Bajcetic, he looked to make up for lost time. Elsewhere, Academy goalkeeper Jakub Ojrzynski was also pictured in training after spending last season on loan with Radomiak Radom in his native Poland. Jurgen Klopp admitted Darwin Nunez hadn’t quite got the grasp of English on more than one occasion last season, but the Uruguayan was spotted on camera having a conversation with his manager, and pictured laughing and joking with the German. While just basic greetings, it would seem the striker has been working on his English over the summer. Nunez would also be pictured with Ramsay in the gym as the two exchanged greetings. Steady on, Darwin. Learning English is one thing, but you might not be ready for the young Scot’s broad Aberdeen accent just yet! It's been a long summer for the Liverpool squad, with 41 days passing since the Reds finished the season with a 4-4 draw away at Southampton. As a result, the players who reported back on Saturday were delighted to see each other. Joe Gomez was spotted giving both Klopp and Ramsay a big hug, (though he might not have had much say in the former!), while Fabinho and Adrian shared an embrace. Meanwhile, Joel Matip was spotted hugging assistant fitness coach Jordan Fairclough. Cute!","pubDate":"2023-07-08 14:02:40","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27283754.ece/ALTERNATES/s98/0_GettyImages-1525238575.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David de Gea confirms Manchester United departure","link":"https://www.watfordobserver.co.uk/sport/national/23642806.david-de-gea-confirms-manchester-united-departure/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The 32-year-old’s contract with United expired at the end of June.","content":"The 32-year-old’s contract with United expired at the end of June, with no new deal agreed despite talks that took place throughout the season. In a message on social media, De Gea thanked United fans for their support, but said: “Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings.” When De Gea’s contract expired last Friday, United said they remained in talks with the Spain goalkeeper. I just wanted to send this farewell message to all Manchester United supporters. I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. I took incredible… — David de Gea (@D_DeGea) That followed reports that De Gea had signed a contract extension only for the club to withdraw that offer and come back with reduced terms. De Gea wrote: “I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. “I took incredible pride every time I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. “It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. “Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.” United boss Erik ten Hag has reportedly been pushing to sign a new goalkeeper in this transfer window, with a deal for Inter Milan’s Andre Onana said to be close. The Dutchman paid tribute to the departing De Gea, who won the Premier League’s golden glove last season. Ten Hag said: “It takes great quality and character to reach the level of even playing one game for Manchester United. “To do it 545 times over 12 years is a special achievement, particularly in the goalkeeping position where every game puts you in the spotlight. Forever a United legend. Thank you for everything, ❤️ — Manchester United (@ManUtd) “To have won Player of the Year awards from both the fans and his team-mates, each on four occasions, shows the level of his performance and he will always be remembered as one of the very best goalkeepers in the history of the club. “I am personally grateful for the 25 clean sheets he helped provide last season and his overall contribution on the pitch during my first year at the club. “All the players and staff send him our very best wishes for the next phase of his outstanding career.”","pubDate":"2023-07-08 14:01:37","image_url":"https://www.watfordobserver.co.uk/resources/images/16950600/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David de Gea departs Manchester United as Red Devils confirm goalkeeper's exit","link":"https://www.dailymail.co.uk/sport/football/article-12277977/David-Gea-departs-Manchester-United-Red-Devils-confirm-goalkeepers-exit.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"De Gea posted a circus emoji on Twitter this week , displaying in no uncertain terms his unhappiness with the club's actions, and now United have confirmed that his career at Old Trafford is over.","content":"David de Gea confirms he is leaving Man United to 'seek a new challenge' after 12 years... as Erik ten Hag sends best wishes despite U-turn on a new contract that led to messy exit Manchester United have confirmed David de Gea's exit from the club The Red Devils performed a U-turn on a new contract for the goalkeeper Follow MailSport on Threads here: https://www.threads.net/@mailsport By Ollie Lewis For Daily Mail Australia Published: 14:43 BST, 8 July 2023 | Updated: 15:27 BST, 8 July 2023 e-mail 33 shares 57 View comments David de Gea's 12-year stint at Manchester United is over after the Red Devils confirmed his exit on Saturday. The 32-year-old’s contract at Old Trafford expired at the end of June, with Mail Sport revealing last month that the framework for a new contract aimed at reducing De Gea's £375,000-a-week wage had initially been agreed between the player and the club. However, manager Erik Ten Hag's reservations over keeping his No 1 had put the deal in jeopardy, with the club backing out of the tabled offer. De Gea posted a circus emoji on Twitter this week , displaying in no uncertain terms his unhappiness with the club's actions, and now United have confirmed that the Spaniard's career at Old Trafford is over. Following an official statement from the club in which De Ge was thanked for his service, the 32-year-old posted his own statement on Twitter. He insists that he is 'seeking a new challenge', despite being blindsided by the contract withdrawal. Follow MailSport on Threads here: https://www.threads.net/@mailsport Manchester United have confirmed the exit of David de Gea from the football club De Gea has departed after manager Erik ten Hag (R) had reservations over a new contract The Spaniard took to Twitter to confirm his exit after a rollercoaster 12 years 'I just wanted to send this farewell message to all Manchester United supporters,' he posted. 'I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. 'I took incredible pride everytime I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. 'It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. 'Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings. Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.' Ten Hag sent the goalkeeper his best wishes, despite having cold feet over the new contract. He said via the club's official website : 'It takes great quality and character to reach the level of even playing one game for Manchester United. To do it 545 times over 12 years is a special achievement, particularly in the goalkeeping position where every game puts you in the spotlight. De Gea was brought to the club by legendary former coach Sir Alex Ferguson in 2011 He won eight trophies during his time in Manchester, including the 2015-16 FA Cup (above) 'To have won Player of the Year awards from both the fans and his team-mates, each on four occasions, shows the level of his performance and he will always be remembered as one of the very best goalkeepers in the history of the club. 'I am personally grateful for the 25 clean sheets he helped provide last season and his overall contribution on the pitch during my first year at the club. All the players and staff send him our very best wishes for the next phase of his outstanding career.' De Gea's circus message was the latest in a series of snappy social media posts in recent weeks. At the end of June he posted a yawning emoji in what seemed to be another reference to his long-running contract saga. The Spaniard made 545 appearances for the Red Devils, keeping 190 clean sheets. He lifted eight trophies during his time at Old Trafford - including the Premier League, FA Cup and Europa League. United are now on the lookout for a new No 1 goalkeeper, with Ten Hag keen to land his former Ajax stopper Andre Onana in a £43million deal. Follow MailSport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: David de Gea departs Manchester United as Red Devils confirm goalkeeper's exit e-mail 33 shares Add comment Comments 80 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 13:56:59","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/14/72993823-0-image-a-66_1688824299342.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David De Gea transfer decision confirmed amid Jordan Pickford and Everton rumours","link":"https://www.liverpoolecho.co.uk/sport/football/transfer-news/david-de-gea-transfer-decision-27283785","keywords":["Sport"],"creator":null,"video_url":null,"description":"David de Gea has bid farewell to Manchester United fans following the expiry of his contract","content":"David de Gea has confirmed he will not be extending his stay at Manchester United amid claims the Red Devils are targeting Everton's Jordan Pickford. The Spaniard's 12-year association with the Old Trafford club comes to an end after his contract expired at the end of July. It was claimed that United were looking to continue dialogue with the goalkeeper following the end of his deal with a view to extending on reduced terms. However, the shot-stopper has confirmed that he is now a free agent. In recent days, the 32-year-old has posted a series of tweets which appear cryptic to describe the situation that is unravelling in Manchester. The Manchester Evening News reported previously in May that there were with . In a post on Twitter, De Gea confirmed his exit, writing: \"I just wanted to send this farewell message to all Manchester United supporters. \"I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. I took incredible pride everytime I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. \"It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. \"Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings. Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.\" With speculation surrounding their next goalkeeper, 's was subject to reported interest from the Red Devils. In recent months, the attention of Erik ten Hag has turned to Inter Milan's Andre Onana - after the pair's time together at Ajax. Talks have also been held with the agent of Urawa Red Diamonds and Japan Under-21 goalie Zion Suzuki over a possible second addition between the sticks.","pubDate":"2023-07-08 13:53:53","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article26403930.ece/ALTERNATES/s98/0_GettyImages-1471523680.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Kylian Mbappe 'has angered PSG team-mates' after branding club 'divisive' in controversial interview","link":"https://www.dailymail.co.uk/sport/football/article-12277937/Kylian-Mbappe-angered-PSG-team-mates-branding-club-divisive-controversial-interview.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"According to Sky Sports , two of the six are players that have joined this summer. Mbappe spoke to the publication on June 12 but the article has only just been published.","content":"Kylian Mbappe slams 'divisive' PSG and questions their signings in explosive interview... as 'six of the club's angry players complain to president Nasser Al-Khelaifi about the French star's comments' Six PSG players have complained about Kylian Mbappe's controversial interview Mbappe claims his performances are criticised due to the divisive nature of PSG Follow MailSport on Threads here: https://www.threads.net/@mailsport By George Glinski For Mailonline Published: 14:33 BST, 8 July 2023 | Updated: 15:03 BST, 8 July 2023 e-mail 27 View comments Six PSG players have contacted club president Nasser Al-Khelaifi to complain about comment's made by Kylian Mbappe during a recent interview with France Football Magazine. According to Sky Sports , two of the six are players that have joined this summer. Mbappe spoke to the publication on June 12 but the article has only just been published. During the sit down, he branded PSG as a 'divisive' club and stated that his performances are unjustly criticised because it is much harder to impress while playing in France. 'Are people trivializing my performances?' he told France Football. 'Yes, but at the same time, I don't blame them, he says. In France, they saw me grow up, they see me all the time, at PSG every weekends or in selection. Kylian Mbappe slammed PSG and Ligue 1 during a controversial interview with France Football Mbappe's contract runs out at PSG in June 2024 and he looks set to leave the club this summer Naseer Al-Khelaifi has received six complaints from PSG players about Mbappe's interview 'And I've been scoring a lot for years. So, for people, it's becoming normal. I've never complained that my performances are trivialized. 'I'm young and I've had the chance to It was not that long ago to be an observer, before being an actor. 'And myself, I trivialized what Messi was doing, what Cristiano Ronaldo was doing, what the great players were doing. We are in a consumer society, where \"it's good, but do again\". 'And the fact that I'm right next door, in Paris... I think playing at Paris-SG doesn't help much because it's a divisive team, a divisive club. 'So, of course it attracts gossip but it doesn't bother me because I know what I'm doing and how I do it.' Mbappe recently sent a letter to PSG affirming that he has no intention of extending his contract with the club by a further year, which expires in 2024, but it is unclear whether he is aiming to see out his deal at Princes Park or move elsewhere this summer. The French giants are keen to cash in on their star man if he chooses to leave and have given him a deadline of July 31 to make a decision about his future. Share or comment on this article: Kylian Mbappe 'has angered PSG team-mates' after branding club 'divisive' in controversial interview e-mail Add comment Comments 29 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 13:49:02","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/14/72993427-0-image-a-9_1688822697181.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘One of the greatest strikers in the world’: Pochettino praises Chelsea transfer target and it’s not Mbappe or Haaland","link":"https://www.hindustantimes.com/sports/football/one-of-the-greatest-strikers-in-the-world-pochettino-praises-chelsea-transfer-target-and-it-s-not-mbappe-or-haaland-101688810947721.html","keywords":null,"creator":null,"video_url":null,"description":"Mauricio Pochettino hailed a Chelsea transfer target, but played down talks of the club signing the forward.","content":"Mauricio Pochettino was unveiled as the new head coach for Chelsea on Friday, and spoke to the press about what his ambitions are for the summer transfer window and the season that lies ahead. Pochettino joins a Chelsea team which experienced a very poor 2022/23 season, finishing in 12th place in the Premier League, despite upwards of 600 million pounds spent by new owner Todd Boehly and his consortium. Newly-appointed Chelsea manager Mauricio Pochettino addresses the media during a press conference.(AP) Pochettino has been without a club since his departure from PSG, but returns to the city where he earned his name as one of the finest young managers in European football. Formerly having been head coach at Tottenham Hotspur, the Argentinian oversaw their most successful years of the 21st century. He took them to numerous top 3 finishes and a Champions League final, but perhaps most importantly oversaw the development of Harry Kane. Also Read | Inter Miami announce 'The Unveil' ahead of Messi arrival With Kane’s contract entering its final year and the English striker seeking a new club, there have been rumours linking him to a reunion with his former boss, heading across London to play at Stamford Bridge. However, Pochettino held his cards close to his chest regarding a potential transfer for one of the PL’s highest ever scorers. “You are talking about one of the greatest strikers in the world,” said Pochettino in his first interview as Chelsea manager. “I think it’s too unfair to talk (about a player at another club).” Kane overtook Wayne Rooney in the list of the Premier League’s all-time top-scorers, and now sits behind only Alan Shearer. He was heavily linked with Manchester United earlier this window, but the Red Devils have reportedly pulled out of the pursuit. “They know my relationship with him was always amazing. I saw him when he was young and grow up and achieve all that he was achieving. We have a great relationship,” said Pochettino of his bond with Kane. Kane came through at Spurs under Pochettino and twice won the golden boot under him. He scored 29 goals in 30 appearances in the 2016/17 season, the closest Kane and Pochettino came to winning the league, falling narrowly short of Pochettino’s new employers that season. Kane is also heavily being linked with Bayern Munich, but might potentially want to stay in England. He sits 47 goals short of Shearer’s record, and still only 29 years old, could establish himself as the Premier League’s most prolific striker in due time. His stellar season this year paled in comparison to Erling Haaland’s incredible numbers, but 30 goals for 8th-place Tottenham is nonetheless a remarkable feat. Chelsea are going through significant changes this window, offloading some of their old guard in favour of fresh faces. Kai Havertz, Mason Mount, Matteo Kovacic, Ngolo Kante, and Hakim Ziyech have all left the club. Meanwhile, Christopher Nkunku and Nicolas Jackson join from RB Leipzig and Villareal respectively. Chelsea are still looking to add firepower to a team which scored only 38 goals last season: only four teams in the Premier League scored fewer. “At the moment, we are thinking (in the transfer market) in a different way. We are not thinking that. We’re working hard to try to provide the squad with good quality. We are working on that and still we have time to work. For sure we are going to add players that can score and we are going to find the best way to play,” concluded Pochettino. Pochettino and Chelsea begin their preseason preparations in the United States, starting with a friendly against the Ryan Reynolds and Rob McElhenney-owned Wrexham. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Mauricio Pochettino Chelsea Fc Harry Kane","pubDate":"2023-07-08 13:21:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/07/08/1600x900/AP07-07-2023-000358A-0_1688811006713_1688811037496.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"El PSG es un 'polvorín': seis jugadores se quejan de Mbappé","link":"https://www.marca.com/futbol/real-madrid/2023/07/08/64a95bd222601d2f7a8b456c.html","keywords":["Real Madrid","Mbappé","PSG"],"creator":["RICARDO FERNÁNDEZ"],"video_url":null,"description":null,"content":"Esto es un \". Son algunas de las palabras que han llegado a proferir los sobre las declaraciones de Mbappé en France Football. La revista entregaba ayer viernes el premio a mejor jugador francés al delantero nacido en Bondy. A la entrega del galardón le ha acompañado una entrevista en la que Mbappé afirmaba que \" , además de ser un club divisor\". Esto no ha caído del todo bien en el vestuario, según asegura RMC. de la plantilla parisina, , se han quejado a la dirección del club de las palabras de Kylian, las cuales para alguno de ellos suponen un insulto al equipo. también está bastante disgustado. \"Si eso es lo que piensa, \", comentaba el presidente según RMC. Luis Campos, entre la espada y la pared El medio de Montecarlo señala también la , que se encuentra en medio de esta batalla comunicativa entre el club y el clan Mbappé. Este último ha dicho públicamente, por activa y por pasiva, que su intención es el año que viene. Acto que el PSG, afirma, . De ahí que Campos, se encuentre entre la y sin posibilidad de solucionar el conflicto y planeando ya alternativas al delantero francés. Por otro lado, RMC asegura que siguen intentando negociar una renovación para que en París. Veremos como acaba este culebrón que en los últimos días se está poniendo .","pubDate":"2023-07-08 12:51:53","image_url":"https://phantom-marca.unidadeditorial.es/7ae5f29d2bfb0e22f910d166357bda87/crop/366x0/1684x1318/resize/1318/assets/multimedia/imagenes/2023/07/08/16888205991264.jpg","source_id":"marca","category":["sports"],"country":["colombia"],"language":"spanish"},{"title":"Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract","link":"https://www.dailymail.co.uk/sport/football/article-12277833/Kyle-Walker-undecided-Man-City-future-despite-offered-new-contract.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Kyle Walker will make a decision on his future 'very soon' amid speculation over his role at Man City next season.","content":"Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract, with Bayern Munich boss Thomas Tuchel 'pushing to sign him this summer' England's Kyle Walker has enjoyed an illustrious six years at Manchester City He 'remains undecided on his future' amid interest from Bayern Munich Follow MailSport on Threads here: https://www.threads.net/@mailsport By Michael Rudling For Mailonlne Published: 08:38 EDT, 8 July 2023 | Updated: 09:10 EDT, 8 July 2023 e-mail View comments Kyle Walker will make a decision on his future 'very soon' amid speculation over his role at Man City next season. The 33-year-old has enjoyed an extraordinary six seasons at the Etihad, winning five Premier League titles and the Champions League. He played 39 games for City as they secured a historic treble in 2022/23 but was occasionally dropped for big games, including the the UCL final. Walker later admitted the decision left him 'gutted'. The England fullback remains undecided on where he will play his football next season, with Fabrizio Romano reporting that he has not yet accepted a new contract offered by Man City. He also claims that Bayern remain keen on Walker, with manager Thomas Tuchel a big admirer. Manchester City and England fullback Kyle Walker 'remains undecided on his future' Man City have offered him a new deal, but Bayern Munich remain interested Follow MailSport on Threads here: https://www.threads.net/@mailsport Mail Sport also previously reported that Sheffield United were keen on bringing Walker to Yorkshire , though a move to Munich would allow him to keep playing Champions League football next season. The Blades are Walker's hometown club, and would be willing to welcome him back following his exit in 2009, as they adjust to their first season back in the Premier League. Wherever he ends up playing, the Man City man will be in good shape after he was pictured out for a run near his home in Cheshire just two weeks after playing his final game of the season with England. He was pictured with former Spurs, Sheffield United and City midfielder Michael Brown as they pounded around the streets. City have already been active elsewhere in the transfer market, with Mateo Kovacic arriving from Chelsea for £25 million. The former Real Madrid man will fill the gap left by Ilkay Gundogan, who has joined Barcelona on a free transfer. They had also been heavily linked with Declan Rice, but pulled out of negotiations for the midfielder. He is expected to join Arsenal for £105m in the coming days. Follow MailSport on Threads here: https://www.threads.net/@mailsport He was recently spotted staying in shape with former Man City man Michael Brown Man City have already brought in Mateo Kovacic this summer after Ilkay Gundogan left for Barcelona on a free transfer Share or comment on this article: Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 12:38:20","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/13/72992367-0-image-a-12_1688819746216.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub","link":"https://www.dailymail.co.uk/sport/football/article-12277851/Jack-Grealish-looks-worse-wear-Man-City-party-boy-led-Ibiza-nightclub.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Manchester City midfielder has travelled to the Spanish island after other trips abroad to enjoy his time of before returning to training with the Premier League champions later this month.","content":"Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub at just 11PM a £1,500 Gucci outfit... as he continues to live it up on the Spanish island Grealish has partied in Ibiza for three days and was seen with Wayne Lineker He has also enjoyed trips to Las Vegas and the French Riviera this summer He is due back in pre-season training for Manchester City later this month Follow MailSport on Threads here: https://www.threads.net/@mailsport By Lewis Browning For Mailonline Published: 13:09, 8 July 2023 | Updated: 13:52, 8 July 2023 e-mail 143 View comments Jack Grealish is continuing his off-season celebrations in Ibiza and he was spotted leaving an Ibiza nightclub on Saturday morning. The Manchester City midfielder has travelled to the Spanish island to enjoy his time of before returning to training with the Premier League champions later this month. He has plenty to celebrate after helping lead his side to an historic Treble this season , with City winning the league, FA Cup and their maiden Champions League title under Pep Guardiola. On Friday, he was seen enjoying the scenes at Ocean Beach as he posed for a photo with Wayne Lineker , and the partying didn't stop there as he headed into the night. He was spotted being led out of a nightclub by friends in the early hours on Saturday, donning a £1,500 Gucci outfit. Jack Grealish has been spotted looking worse for wear in Ibiza as he enjoys time off The Manchester City and England star was led out of a nightclub and into a van on the early hours of Saturday morning He donned a bucket hat and socks and sliders as he walked down the road on the island Grealish was surrounded by friends as he left the Ushuaia Ibiza Club on Saturday Follow MailSport on Threads here: https://www.threads.net/@mailsport The 27-year-old has become synonymous with partying during time off, and that showed no sign of slowing down before he meets up with his teammates at City. Images showed the England star firstly being led out of Ibiza hotspot Ushuaia club with friends after three days of partying on the Spanish island. Followed by what appears to be a bouncer, he then leaned on cars around him to get into a van to leave the scene. Images also showed Grealish in a bucket hat walking down a road. He also gifted Yann Pissenem, the club owner, a signed shirt, with the image shared on his Instagram. Grealish drew attention when he partied after City's Treble win at the end of last season, and was spotted enjoying the boozy celebrations with his teammates on a bus parade of Manchester. He admitted he was in a 'world of pain' after the partying died down and he had to join up with Gareth Southgate's England squad ahead of European qualifiers against Malta and North Macedonia in June. He came on as a substitute in the second game after joining up with the squad, but has now gone onto enjoy his off-season. Grealish has partied for three days in Ibiza after trips to Las Vegas and the French Riviera Grealish looked worse for wear as he was led out of a nightclub, but was all smiles as he enjoyed his well-earned time of Meanwhile, Grealish's girlfriend Sasha Atwood showed off her incredible body in France Sasha appeared to be spending the summer on separate holidays from boyfriend Jack Following his side's historic Treble, Grealish has been making the most of his time off the pitch by indulging in breaks to Las Vegas , the French Riviera and now Ibiza. Meanwhile. Grealish's girlfriend Sasha Attwood displayed her jaw dropping figure in a navy bikini as she posed for stunning snaps in front of a sunset at the beach on Instagram on Friday. The model, 27, looked incredible in the two piece from Tesco 's brand F and F which boasted gold detailing and a halter neckline as she spent time on the continent. The girlfriend of Man City footballer Jack Grealish draped an oversized white sheer shirt off her shoulders while showing off her bronzed tan. She styled her long blonde tresses in luxurious waves as they cascaded down past her shoulders from a centre parting. Sasha applied a radiant palette of makeup to accentuate her beauty and accessorised with a pair of small gold hoop earrings. She penned: 'Golden hour'. It comes as Sasha appeared to be spending the summer on separate holidays from boyfriend Jack . Follow MailSport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub e-mail Add comment Comments 157 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 12:34:41","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/12/72992231-0-image-a-56_1688816397809.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Liverpool full pre-season fixture schedule and how to watch every game","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-full-pre-season-fixture-27278091","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpoool will be heading to Germany and Singapore this summer and you can watch all the pre-season action","content":"Liverpool's pre-season is underway as Jurgen Klopp gets ready to welcome back a host of first teamers to Kirkby. It's been an exciting off season so far for the Reds with the acquisitions of and but now all attention will be on getting Liverpool into top condition as they look to break back into the top four next season. Klopp's men now have five matches announced as they make their bid for full fitness. Eight members of Klopp’s senior squad are set to return for day one of pre-season including Adrian, Stefan Bajcetic, Fabinho, Joe Gomez, Joel Matip, Darwin Nunez, Nathaniel Phillips and Thiago Alcantara. Harvey Elliott and Curtis Jones will join up at a later date following their successful stint with England in the . First up are games against Karlsruher SC and Greuther Furth in Germany. They will then entertain Leicester City and Bayern Munich as part of their Singapore tour, before returning to the UK to meet SV Darmstadt 98 at Preston North End's Deepdale stadium. The games are expected to feature a number of senior players with the Liverpool players who have been on international duty during the summer set to get their schedule under way on Tuesday, July 11. You'll be able to watch all five of the Reds' fixtures live and on demand this summer with LFCTV GO, including the games in Germany and Singapore, as well as the Darmstadt game at Deepdale. Karlsruher SC v Liverpool - 5.30pm Greuther Furth v Liverpool - 12pm Liverpool v Leicester City - 10am Liverpool v Bayern Munich - 12.30pm Liverpool v SV Darmstadt 98 - 7pm .","pubDate":"2023-07-08 12:34:32","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27254606.ece/ALTERNATES/s98/0_GettyImages-1421280423.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Thiago update, Darwin Nunez boost and three other things spotted in first day of Liverpool pre-season training","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/gallery/thiago-update-darwin-nunez-boost-27283736","keywords":["Sport"],"creator":null,"video_url":null,"description":"Things we spotted from Liverpool's first training session of the season as Jurgen Klopp's men reported back for pre-season training","content":"Liverpool reported back to the AXA Training Centre for the start of pre-season training on Saturday, with eight senior players the first of Jurgen Klopp’s ranks to return. The club had already confirmed that Adrian, Stefan Bajcetic, Fabinho, Joe Gomez, Joel Matip, Darwin Nunez, Nathaniel Phillips and Thiago Alcantara would all report for duty this weekend, with the Reds’ internationals then getting their own schedules underway on Tuesday. Meanwhile, Curtis Jones and Harvey Elliott are due back later this summer after helping England reach the final of the Under-21s European Championships. As a result, summer signings Alexis Mac Allister and Dominik Szoboszlai will have to wait a little while longer to meet their new team-mates, courtesy of their summer international excursions with Argentina and Hungary respectively. But as the first players reported back for pre-season, here’s what we spotted in the first training pictures of the summer… While Thiago might have been on the eight-man list said to be reporting for pre-season training on Monday, the Spaniard was absent from Liverpool’s initial released training pictures amid speculation about his future. Although not pictured, it’s understood that the Reds’ players aren’t all in at the AXA Training Centre at the same time, with the Spaniard expected later today. While the 32-year-old wasn’t yet pictured, his seven other senior team-mates due back for pre-season on Saturday were. The midfielder has been subject of interest from Saudi Arabia and Turkey, but no clubs have approached the Reds as things stand. Meanwhile, Thiago missed the end of last season after undergoing surgery on a hip injury. As a result, it’s possible that was the reason behind him not being in at the same time as his team-mates. However, with speculation ongoing regarding his future, tongues are certain to be set wagging. While Thiago was absent, the other seven senior players scheduled to return were all pictured at the AXA Training Centre. As a result, Stefan Bajcetic made his own return from injury after missing the end of last season. The Spaniard enjoyed an impressive breakthrough campaign for Liverpool, making 19 appearances before an abductor injury curtailed his progress and ended his season prematurely back in March. But the 18-year-old was pictured lifting weights in the gym and kicking a ball around on the grass, suggesting he’s ready to hit the ground running this summer as he looks to make up for lost time. There was an extra senior player pictured in training on Saturday, with Calvin Ramay back at the AXA Training Centre despite it being confirmed he is spending the season out on loan. The Scotland international was confirmed to be joining Preston North End for the season last month, though the teenager isn’t set to link up with the Championship side until July 15. As a result, he’s starting pre-season with Liverpool. And having missed the end of last season with a knee injury which forced him to undergo surgery, the 19-year-old was spotted working hard in the gym and with a ball out on the pitch as, like Bajcetic, he looked to make up for lost time. Elsewhere, Academy goalkeeper Jakub Ojrzynski was also pictured in training after spending last season on loan with Radomiak Radom in his native Poland. Jurgen Klopp admitted Darwin Nunez hadn’t quite got the grasp of English on more than one occasion last season, but the Uruguayan was spotted on camera having a conversation with his manager, and pictured laughing and joking with the German. While just basic greetings, it would seem the striker has been working on his English over the summer. Nunez would also be pictured with Ramsay in the gym as the two exchanged greetings. Steady on, Darwin. Learning English is one thing, but you might not be ready for the young Scot’s broad Aberdeen accent just yet! It's been a long summer for the Liverpool squad, with 41 days passing since the Reds finished the season with a 4-4 draw away at Southampton. As a result, the players who reported back on Saturday were delighted to see each other. Joe Gomez was spotted giving both Klopp and Ramsay a big hug, (though he might not have had much say in the former!), while Fabinho and Adrian shared an embrace. Meanwhile, Joel Matip was spotted hugging assistant fitness coach Jordan Fairclough. Cute!","pubDate":"2023-07-08 14:02:40","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27283754.ece/ALTERNATES/s98/0_GettyImages-1525238575.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David de Gea confirms Manchester United departure","link":"https://www.watfordobserver.co.uk/sport/national/23642806.david-de-gea-confirms-manchester-united-departure/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The 32-year-old’s contract with United expired at the end of June.","content":"The 32-year-old’s contract with United expired at the end of June, with no new deal agreed despite talks that took place throughout the season. In a message on social media, De Gea thanked United fans for their support, but said: “Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings.” When De Gea’s contract expired last Friday, United said they remained in talks with the Spain goalkeeper. I just wanted to send this farewell message to all Manchester United supporters. I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. I took incredible… — David de Gea (@D_DeGea) That followed reports that De Gea had signed a contract extension only for the club to withdraw that offer and come back with reduced terms. De Gea wrote: “I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. “I took incredible pride every time I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. “It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. “Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.” United boss Erik ten Hag has reportedly been pushing to sign a new goalkeeper in this transfer window, with a deal for Inter Milan’s Andre Onana said to be close. The Dutchman paid tribute to the departing De Gea, who won the Premier League’s golden glove last season. Ten Hag said: “It takes great quality and character to reach the level of even playing one game for Manchester United. “To do it 545 times over 12 years is a special achievement, particularly in the goalkeeping position where every game puts you in the spotlight. Forever a United legend. Thank you for everything, ❤️ — Manchester United (@ManUtd) “To have won Player of the Year awards from both the fans and his team-mates, each on four occasions, shows the level of his performance and he will always be remembered as one of the very best goalkeepers in the history of the club. “I am personally grateful for the 25 clean sheets he helped provide last season and his overall contribution on the pitch during my first year at the club. “All the players and staff send him our very best wishes for the next phase of his outstanding career.”","pubDate":"2023-07-08 14:01:37","image_url":"https://www.watfordobserver.co.uk/resources/images/16950600/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David de Gea departs Manchester United as Red Devils confirm goalkeeper's exit","link":"https://www.dailymail.co.uk/sport/football/article-12277977/David-Gea-departs-Manchester-United-Red-Devils-confirm-goalkeepers-exit.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"De Gea posted a circus emoji on Twitter this week , displaying in no uncertain terms his unhappiness with the club's actions, and now United have confirmed that his career at Old Trafford is over.","content":"David de Gea confirms he is leaving Man United to 'seek a new challenge' after 12 years... as Erik ten Hag sends best wishes despite U-turn on a new contract that led to messy exit Manchester United have confirmed David de Gea's exit from the club The Red Devils performed a U-turn on a new contract for the goalkeeper Follow MailSport on Threads here: https://www.threads.net/@mailsport By Ollie Lewis For Daily Mail Australia Published: 14:43 BST, 8 July 2023 | Updated: 15:27 BST, 8 July 2023 e-mail 33 shares 57 View comments David de Gea's 12-year stint at Manchester United is over after the Red Devils confirmed his exit on Saturday. The 32-year-old’s contract at Old Trafford expired at the end of June, with Mail Sport revealing last month that the framework for a new contract aimed at reducing De Gea's £375,000-a-week wage had initially been agreed between the player and the club. However, manager Erik Ten Hag's reservations over keeping his No 1 had put the deal in jeopardy, with the club backing out of the tabled offer. De Gea posted a circus emoji on Twitter this week , displaying in no uncertain terms his unhappiness with the club's actions, and now United have confirmed that the Spaniard's career at Old Trafford is over. Following an official statement from the club in which De Ge was thanked for his service, the 32-year-old posted his own statement on Twitter. He insists that he is 'seeking a new challenge', despite being blindsided by the contract withdrawal. Follow MailSport on Threads here: https://www.threads.net/@mailsport Manchester United have confirmed the exit of David de Gea from the football club De Gea has departed after manager Erik ten Hag (R) had reservations over a new contract The Spaniard took to Twitter to confirm his exit after a rollercoaster 12 years 'I just wanted to send this farewell message to all Manchester United supporters,' he posted. 'I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. 'I took incredible pride everytime I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. 'It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. 'Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings. Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.' Ten Hag sent the goalkeeper his best wishes, despite having cold feet over the new contract. He said via the club's official website : 'It takes great quality and character to reach the level of even playing one game for Manchester United. To do it 545 times over 12 years is a special achievement, particularly in the goalkeeping position where every game puts you in the spotlight. De Gea was brought to the club by legendary former coach Sir Alex Ferguson in 2011 He won eight trophies during his time in Manchester, including the 2015-16 FA Cup (above) 'To have won Player of the Year awards from both the fans and his team-mates, each on four occasions, shows the level of his performance and he will always be remembered as one of the very best goalkeepers in the history of the club. 'I am personally grateful for the 25 clean sheets he helped provide last season and his overall contribution on the pitch during my first year at the club. All the players and staff send him our very best wishes for the next phase of his outstanding career.' De Gea's circus message was the latest in a series of snappy social media posts in recent weeks. At the end of June he posted a yawning emoji in what seemed to be another reference to his long-running contract saga. The Spaniard made 545 appearances for the Red Devils, keeping 190 clean sheets. He lifted eight trophies during his time at Old Trafford - including the Premier League, FA Cup and Europa League. United are now on the lookout for a new No 1 goalkeeper, with Ten Hag keen to land his former Ajax stopper Andre Onana in a £43million deal. Follow MailSport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: David de Gea departs Manchester United as Red Devils confirm goalkeeper's exit e-mail 33 shares Add comment Comments 80 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 13:56:59","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/14/72993823-0-image-a-66_1688824299342.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David De Gea transfer decision confirmed amid Jordan Pickford and Everton rumours","link":"https://www.liverpoolecho.co.uk/sport/football/transfer-news/david-de-gea-transfer-decision-27283785","keywords":["Sport"],"creator":null,"video_url":null,"description":"David de Gea has bid farewell to Manchester United fans following the expiry of his contract","content":"David de Gea has confirmed he will not be extending his stay at Manchester United amid claims the Red Devils are targeting Everton's Jordan Pickford. The Spaniard's 12-year association with the Old Trafford club comes to an end after his contract expired at the end of July. It was claimed that United were looking to continue dialogue with the goalkeeper following the end of his deal with a view to extending on reduced terms. However, the shot-stopper has confirmed that he is now a free agent. In recent days, the 32-year-old has posted a series of tweets which appear cryptic to describe the situation that is unravelling in Manchester. The Manchester Evening News reported previously in May that there were with . In a post on Twitter, De Gea confirmed his exit, writing: \"I just wanted to send this farewell message to all Manchester United supporters. \"I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. I took incredible pride everytime I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestows upon a few lucky footballers. \"It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together. \"Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings. Manchester will always be in my heart, Manchester has shaped me and will never leave me. We’ve seen it all.\" With speculation surrounding their next goalkeeper, 's was subject to reported interest from the Red Devils. In recent months, the attention of Erik ten Hag has turned to Inter Milan's Andre Onana - after the pair's time together at Ajax. Talks have also been held with the agent of Urawa Red Diamonds and Japan Under-21 goalie Zion Suzuki over a possible second addition between the sticks.","pubDate":"2023-07-08 13:53:53","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article26403930.ece/ALTERNATES/s98/0_GettyImages-1471523680.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Kylian Mbappe 'has angered PSG team-mates' after branding club 'divisive' in controversial interview","link":"https://www.dailymail.co.uk/sport/football/article-12277937/Kylian-Mbappe-angered-PSG-team-mates-branding-club-divisive-controversial-interview.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"According to Sky Sports , two of the six are players that have joined this summer. Mbappe spoke to the publication on June 12 but the article has only just been published.","content":"Kylian Mbappe slams 'divisive' PSG and questions their signings in explosive interview... as 'six of the club's angry players complain to president Nasser Al-Khelaifi about the French star's comments' Six PSG players have complained about Kylian Mbappe's controversial interview Mbappe claims his performances are criticised due to the divisive nature of PSG Follow MailSport on Threads here: https://www.threads.net/@mailsport By George Glinski For Mailonline Published: 14:33 BST, 8 July 2023 | Updated: 15:03 BST, 8 July 2023 e-mail 27 View comments Six PSG players have contacted club president Nasser Al-Khelaifi to complain about comment's made by Kylian Mbappe during a recent interview with France Football Magazine. According to Sky Sports , two of the six are players that have joined this summer. Mbappe spoke to the publication on June 12 but the article has only just been published. During the sit down, he branded PSG as a 'divisive' club and stated that his performances are unjustly criticised because it is much harder to impress while playing in France. 'Are people trivializing my performances?' he told France Football. 'Yes, but at the same time, I don't blame them, he says. In France, they saw me grow up, they see me all the time, at PSG every weekends or in selection. Kylian Mbappe slammed PSG and Ligue 1 during a controversial interview with France Football Mbappe's contract runs out at PSG in June 2024 and he looks set to leave the club this summer Naseer Al-Khelaifi has received six complaints from PSG players about Mbappe's interview 'And I've been scoring a lot for years. So, for people, it's becoming normal. I've never complained that my performances are trivialized. 'I'm young and I've had the chance to It was not that long ago to be an observer, before being an actor. 'And myself, I trivialized what Messi was doing, what Cristiano Ronaldo was doing, what the great players were doing. We are in a consumer society, where \"it's good, but do again\". 'And the fact that I'm right next door, in Paris... I think playing at Paris-SG doesn't help much because it's a divisive team, a divisive club. 'So, of course it attracts gossip but it doesn't bother me because I know what I'm doing and how I do it.' Mbappe recently sent a letter to PSG affirming that he has no intention of extending his contract with the club by a further year, which expires in 2024, but it is unclear whether he is aiming to see out his deal at Princes Park or move elsewhere this summer. The French giants are keen to cash in on their star man if he chooses to leave and have given him a deadline of July 31 to make a decision about his future. Share or comment on this article: Kylian Mbappe 'has angered PSG team-mates' after branding club 'divisive' in controversial interview e-mail Add comment Comments 29 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 13:49:02","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/14/72993427-0-image-a-9_1688822697181.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘One of the greatest strikers in the world’: Pochettino praises Chelsea transfer target and it’s not Mbappe or Haaland","link":"https://www.hindustantimes.com/sports/football/one-of-the-greatest-strikers-in-the-world-pochettino-praises-chelsea-transfer-target-and-it-s-not-mbappe-or-haaland-101688810947721.html","keywords":null,"creator":null,"video_url":null,"description":"Mauricio Pochettino hailed a Chelsea transfer target, but played down talks of the club signing the forward.","content":"Mauricio Pochettino was unveiled as the new head coach for Chelsea on Friday, and spoke to the press about what his ambitions are for the summer transfer window and the season that lies ahead. Pochettino joins a Chelsea team which experienced a very poor 2022/23 season, finishing in 12th place in the Premier League, despite upwards of 600 million pounds spent by new owner Todd Boehly and his consortium. Newly-appointed Chelsea manager Mauricio Pochettino addresses the media during a press conference.(AP) Pochettino has been without a club since his departure from PSG, but returns to the city where he earned his name as one of the finest young managers in European football. Formerly having been head coach at Tottenham Hotspur, the Argentinian oversaw their most successful years of the 21st century. He took them to numerous top 3 finishes and a Champions League final, but perhaps most importantly oversaw the development of Harry Kane. Also Read | Inter Miami announce 'The Unveil' ahead of Messi arrival With Kane’s contract entering its final year and the English striker seeking a new club, there have been rumours linking him to a reunion with his former boss, heading across London to play at Stamford Bridge. However, Pochettino held his cards close to his chest regarding a potential transfer for one of the PL’s highest ever scorers. “You are talking about one of the greatest strikers in the world,” said Pochettino in his first interview as Chelsea manager. “I think it’s too unfair to talk (about a player at another club).” Kane overtook Wayne Rooney in the list of the Premier League’s all-time top-scorers, and now sits behind only Alan Shearer. He was heavily linked with Manchester United earlier this window, but the Red Devils have reportedly pulled out of the pursuit. “They know my relationship with him was always amazing. I saw him when he was young and grow up and achieve all that he was achieving. We have a great relationship,” said Pochettino of his bond with Kane. Kane came through at Spurs under Pochettino and twice won the golden boot under him. He scored 29 goals in 30 appearances in the 2016/17 season, the closest Kane and Pochettino came to winning the league, falling narrowly short of Pochettino’s new employers that season. Kane is also heavily being linked with Bayern Munich, but might potentially want to stay in England. He sits 47 goals short of Shearer’s record, and still only 29 years old, could establish himself as the Premier League’s most prolific striker in due time. His stellar season this year paled in comparison to Erling Haaland’s incredible numbers, but 30 goals for 8th-place Tottenham is nonetheless a remarkable feat. Chelsea are going through significant changes this window, offloading some of their old guard in favour of fresh faces. Kai Havertz, Mason Mount, Matteo Kovacic, Ngolo Kante, and Hakim Ziyech have all left the club. Meanwhile, Christopher Nkunku and Nicolas Jackson join from RB Leipzig and Villareal respectively. Chelsea are still looking to add firepower to a team which scored only 38 goals last season: only four teams in the Premier League scored fewer. “At the moment, we are thinking (in the transfer market) in a different way. We are not thinking that. We’re working hard to try to provide the squad with good quality. We are working on that and still we have time to work. For sure we are going to add players that can score and we are going to find the best way to play,” concluded Pochettino. Pochettino and Chelsea begin their preseason preparations in the United States, starting with a friendly against the Ryan Reynolds and Rob McElhenney-owned Wrexham. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Mauricio Pochettino Chelsea Fc Harry Kane","pubDate":"2023-07-08 13:21:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/07/08/1600x900/AP07-07-2023-000358A-0_1688811006713_1688811037496.jpg","source_id":"hindustantimes","category":["sports"],"country":["india"],"language":"english"},{"title":"El PSG es un 'polvorín': seis jugadores se quejan de Mbappé","link":"https://www.marca.com/futbol/real-madrid/2023/07/08/64a95bd222601d2f7a8b456c.html","keywords":["Real Madrid","Mbappé","PSG"],"creator":["RICARDO FERNÁNDEZ"],"video_url":null,"description":null,"content":"Esto es un \". Son algunas de las palabras que han llegado a proferir los sobre las declaraciones de Mbappé en France Football. La revista entregaba ayer viernes el premio a mejor jugador francés al delantero nacido en Bondy. A la entrega del galardón le ha acompañado una entrevista en la que Mbappé afirmaba que \" , además de ser un club divisor\". Esto no ha caído del todo bien en el vestuario, según asegura RMC. de la plantilla parisina, , se han quejado a la dirección del club de las palabras de Kylian, las cuales para alguno de ellos suponen un insulto al equipo. también está bastante disgustado. \"Si eso es lo que piensa, \", comentaba el presidente según RMC. Luis Campos, entre la espada y la pared El medio de Montecarlo señala también la , que se encuentra en medio de esta batalla comunicativa entre el club y el clan Mbappé. Este último ha dicho públicamente, por activa y por pasiva, que su intención es el año que viene. Acto que el PSG, afirma, . De ahí que Campos, se encuentre entre la y sin posibilidad de solucionar el conflicto y planeando ya alternativas al delantero francés. Por otro lado, RMC asegura que siguen intentando negociar una renovación para que en París. Veremos como acaba este culebrón que en los últimos días se está poniendo .","pubDate":"2023-07-08 12:51:53","image_url":"https://phantom-marca.unidadeditorial.es/7ae5f29d2bfb0e22f910d166357bda87/crop/366x0/1684x1318/resize/1318/assets/multimedia/imagenes/2023/07/08/16888205991264.jpg","source_id":"marca","category":["sports"],"country":["colombia"],"language":"spanish"},{"title":"Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract","link":"https://www.dailymail.co.uk/sport/football/article-12277833/Kyle-Walker-undecided-Man-City-future-despite-offered-new-contract.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Kyle Walker will make a decision on his future 'very soon' amid speculation over his role at Man City next season.","content":"Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract, with Bayern Munich boss Thomas Tuchel 'pushing to sign him this summer' England's Kyle Walker has enjoyed an illustrious six years at Manchester City He 'remains undecided on his future' amid interest from Bayern Munich Follow MailSport on Threads here: https://www.threads.net/@mailsport By Michael Rudling For Mailonlne Published: 08:38 EDT, 8 July 2023 | Updated: 09:10 EDT, 8 July 2023 e-mail View comments Kyle Walker will make a decision on his future 'very soon' amid speculation over his role at Man City next season. The 33-year-old has enjoyed an extraordinary six seasons at the Etihad, winning five Premier League titles and the Champions League. He played 39 games for City as they secured a historic treble in 2022/23 but was occasionally dropped for big games, including the the UCL final. Walker later admitted the decision left him 'gutted'. The England fullback remains undecided on where he will play his football next season, with Fabrizio Romano reporting that he has not yet accepted a new contract offered by Man City. He also claims that Bayern remain keen on Walker, with manager Thomas Tuchel a big admirer. Manchester City and England fullback Kyle Walker 'remains undecided on his future' Man City have offered him a new deal, but Bayern Munich remain interested Follow MailSport on Threads here: https://www.threads.net/@mailsport Mail Sport also previously reported that Sheffield United were keen on bringing Walker to Yorkshire , though a move to Munich would allow him to keep playing Champions League football next season. The Blades are Walker's hometown club, and would be willing to welcome him back following his exit in 2009, as they adjust to their first season back in the Premier League. Wherever he ends up playing, the Man City man will be in good shape after he was pictured out for a run near his home in Cheshire just two weeks after playing his final game of the season with England. He was pictured with former Spurs, Sheffield United and City midfielder Michael Brown as they pounded around the streets. City have already been active elsewhere in the transfer market, with Mateo Kovacic arriving from Chelsea for £25 million. The former Real Madrid man will fill the gap left by Ilkay Gundogan, who has joined Barcelona on a free transfer. They had also been heavily linked with Declan Rice, but pulled out of negotiations for the midfielder. He is expected to join Arsenal for £105m in the coming days. Follow MailSport on Threads here: https://www.threads.net/@mailsport He was recently spotted staying in shape with former Man City man Michael Brown Man City have already brought in Mateo Kovacic this summer after Ilkay Gundogan left for Barcelona on a free transfer Share or comment on this article: Kyle Walker 'is still undecided on his Man City future' despite being offered a new contract e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 12:38:20","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/13/72992367-0-image-a-12_1688819746216.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub","link":"https://www.dailymail.co.uk/sport/football/article-12277851/Jack-Grealish-looks-worse-wear-Man-City-party-boy-led-Ibiza-nightclub.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Manchester City midfielder has travelled to the Spanish island after other trips abroad to enjoy his time of before returning to training with the Premier League champions later this month.","content":"Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub at just 11PM a £1,500 Gucci outfit... as he continues to live it up on the Spanish island Grealish has partied in Ibiza for three days and was seen with Wayne Lineker He has also enjoyed trips to Las Vegas and the French Riviera this summer He is due back in pre-season training for Manchester City later this month Follow MailSport on Threads here: https://www.threads.net/@mailsport By Lewis Browning For Mailonline Published: 13:09, 8 July 2023 | Updated: 13:52, 8 July 2023 e-mail 143 View comments Jack Grealish is continuing his off-season celebrations in Ibiza and he was spotted leaving an Ibiza nightclub on Saturday morning. The Manchester City midfielder has travelled to the Spanish island to enjoy his time of before returning to training with the Premier League champions later this month. He has plenty to celebrate after helping lead his side to an historic Treble this season , with City winning the league, FA Cup and their maiden Champions League title under Pep Guardiola. On Friday, he was seen enjoying the scenes at Ocean Beach as he posed for a photo with Wayne Lineker , and the partying didn't stop there as he headed into the night. He was spotted being led out of a nightclub by friends in the early hours on Saturday, donning a £1,500 Gucci outfit. Jack Grealish has been spotted looking worse for wear in Ibiza as he enjoys time off The Manchester City and England star was led out of a nightclub and into a van on the early hours of Saturday morning He donned a bucket hat and socks and sliders as he walked down the road on the island Grealish was surrounded by friends as he left the Ushuaia Ibiza Club on Saturday Follow MailSport on Threads here: https://www.threads.net/@mailsport The 27-year-old has become synonymous with partying during time off, and that showed no sign of slowing down before he meets up with his teammates at City. Images showed the England star firstly being led out of Ibiza hotspot Ushuaia club with friends after three days of partying on the Spanish island. Followed by what appears to be a bouncer, he then leaned on cars around him to get into a van to leave the scene. Images also showed Grealish in a bucket hat walking down a road. He also gifted Yann Pissenem, the club owner, a signed shirt, with the image shared on his Instagram. Grealish drew attention when he partied after City's Treble win at the end of last season, and was spotted enjoying the boozy celebrations with his teammates on a bus parade of Manchester. He admitted he was in a 'world of pain' after the partying died down and he had to join up with Gareth Southgate's England squad ahead of European qualifiers against Malta and North Macedonia in June. He came on as a substitute in the second game after joining up with the squad, but has now gone onto enjoy his off-season. Grealish has partied for three days in Ibiza after trips to Las Vegas and the French Riviera Grealish looked worse for wear as he was led out of a nightclub, but was all smiles as he enjoyed his well-earned time of Meanwhile, Grealish's girlfriend Sasha Atwood showed off her incredible body in France Sasha appeared to be spending the summer on separate holidays from boyfriend Jack Following his side's historic Treble, Grealish has been making the most of his time off the pitch by indulging in breaks to Las Vegas , the French Riviera and now Ibiza. Meanwhile. Grealish's girlfriend Sasha Attwood displayed her jaw dropping figure in a navy bikini as she posed for stunning snaps in front of a sunset at the beach on Instagram on Friday. The model, 27, looked incredible in the two piece from Tesco 's brand F and F which boasted gold detailing and a halter neckline as she spent time on the continent. The girlfriend of Man City footballer Jack Grealish draped an oversized white sheer shirt off her shoulders while showing off her bronzed tan. She styled her long blonde tresses in luxurious waves as they cascaded down past her shoulders from a centre parting. Sasha applied a radiant palette of makeup to accentuate her beauty and accessorised with a pair of small gold hoop earrings. She penned: 'Golden hour'. It comes as Sasha appeared to be spending the summer on separate holidays from boyfriend Jack . Follow MailSport on Threads here: https://www.threads.net/@mailsport Share or comment on this article: Jack Grealish looks worse for wear as the Man City party boy is led out of an Ibiza nightclub e-mail Add comment Comments 157 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-08 12:34:41","image_url":"https://i.dailymail.co.uk/1s/2023/07/08/12/72992231-0-image-a-56_1688816397809.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Liverpool full pre-season fixture schedule and how to watch every game","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-full-pre-season-fixture-27278091","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpoool will be heading to Germany and Singapore this summer and you can watch all the pre-season action","content":"Liverpool's pre-season is underway as Jurgen Klopp gets ready to welcome back a host of first teamers to Kirkby. It's been an exciting off season so far for the Reds with the acquisitions of and but now all attention will be on getting Liverpool into top condition as they look to break back into the top four next season. Klopp's men now have five matches announced as they make their bid for full fitness. Eight members of Klopp’s senior squad are set to return for day one of pre-season including Adrian, Stefan Bajcetic, Fabinho, Joe Gomez, Joel Matip, Darwin Nunez, Nathaniel Phillips and Thiago Alcantara. Harvey Elliott and Curtis Jones will join up at a later date following their successful stint with England in the . First up are games against Karlsruher SC and Greuther Furth in Germany. They will then entertain Leicester City and Bayern Munich as part of their Singapore tour, before returning to the UK to meet SV Darmstadt 98 at Preston North End's Deepdale stadium. The games are expected to feature a number of senior players with the Liverpool players who have been on international duty during the summer set to get their schedule under way on Tuesday, July 11. You'll be able to watch all five of the Reds' fixtures live and on demand this summer with LFCTV GO, including the games in Germany and Singapore, as well as the Darmstadt game at Deepdale. Karlsruher SC v Liverpool - 5.30pm Greuther Furth v Liverpool - 12pm Liverpool v Leicester City - 10am Liverpool v Bayern Munich - 12.30pm Liverpool v SV Darmstadt 98 - 7pm .","pubDate":"2023-07-08 12:34:32","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27254606.ece/ALTERNATES/s98/0_GettyImages-1421280423.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"}]}