{"newsArray":[{"title":"Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international","link":"https://www.dailymail.co.uk/sport/football/article-12376853/Brighton-agree-35m-fee-wantaway-Ajax-star-Mohammed-Kudus-Seagulls-set-beat-Chelsea-Arsenal-signing-Ghana-international.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: Talks are ongoing for the Ghana international who has been a target for Brighton all summer but has also had interest from Chelsea and Arsenal.","content":"Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international The Seagulls have agreed a £35million fee for the Ajax attacking midfielder Talks are ongoing between the two clubs as Brighton look to bolster their attack The Ghana star had previously been closely linked with a move to Chelsea By Simon Jones for MailOnline Updated: 20:49, 5 August 2023 e-mail View comments Brighton have agreed a £35million fee with Ajax for Mohammed Kudus. Talks are ongoing for the Ghana international who has been a target for Brighton all summer but has also had interest from Chelsea and Arsenal . The 23-year old, who can play behind the striker or as a winger, had told Ajax he did not wish to sign a new contract and decided a move this summer would be best for all parties. Brighton hope to finalise details over the coming days. Kudus, who started his career with Danish side Nordsjælland before moving to Ajax, had an impressive return of 11 goals and three assists in the Eredivise last year. More to follow... Share or comment on this article: Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-05 19:49:57","image_url":"https://i.dailymail.co.uk/1s/2023/08/05/20/74001567-0-image-a-20_1691264845405.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Μπράιτον μεταγραφές: Πάει για «μπαμ» με Κούντους, συμφώνησε με Άγιαξ στα 40 εκατ. ευρώ!","link":"https://www.gazzetta.gr/football/premier-league/2244304/mpraiton-metagrafes-paei-gia-mpam-me-koyntoys-symfonise-me-agiax","keywords":["Ποδόσφαιρο","Premier League","Μπράιτον","Αγιαξ","Μεταγραφές","Ιάσονας Θεριός"],"creator":null,"video_url":null,"description":"Τη σπουδαιότερη μεταγραφή της ιστορίας της είναι έτοιμη να ολοκληρώσει η Μπράιτον, η οποία έδωσε τα χέρια με τον Άγιαξ για τον Γκανέζο μεσοεπιθετικό, Μοχάμεντ Κούντους.","content":"Μια ανάσα από το «μπαμ» η Μπράιτον ! Οι Γλάροι, σύμφωνα με το Athletic, συμφώνησαν με τον Άγιαξ για τον Μοχάμεντ Κούντους και είναι έτοιμοι να τελειώσουν τη μεταγραφή του Γκανέζου μεσοεπιθετικού έναντι 40 εκατομμυρίων ευρώ . Σε περίπτωση που αυτό συμβεί, ο 23χρονος θα γίνει ο πιο ακριβός παίκτης της ιστορίας τους. Αξίζει να σημειωθεί πως η Μπράιτον ήδη είχε σπάσει το σχετικό της ρεκόρ τον Ιούνιο με τη μεταγραφή του Ζοάο Πέδρο (35 εκατομμύρια από τη Γουότφορντ). Με βάση το ίδιο δημοσίευμα, ο σύλλογος από τον αγγλικό Νότο βρίσκεται πολύ κοντά και στη συμφωνία με τον ίδιο τον παίκτη για τους προσωπικούς όρους του συμβολαίου του. Για τον ταλαντούχο μεσοεπιθετικό, που μπορεί να αγωνιστεί ουσιαστικά σε κάθε θέση από τη μέση και μπροστά, είχαν ενδιαφερθεί και η Τσέλσι και η Άρσεναλ , ωστόσο, όπως όλα δείχνουν, αυτός θα καταλήξει στην Μπράιτον . Τη σεζόν που ολοκληρώθηκε ο Κούντους μέτρησε 18 γκολ και 7 ασίστ σε 42 εμφανίσεις και ενττυπωσίασε με την Γκάνα στο Μουντιάλ.","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"ΠΑΟΚ: Επιστροφή στις προπονήσεις για Σάστρε","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244309/paok-epistrofi-stis-proponiseis-gia-sastre","keywords":["Ποδόσφαιρο","Stoiximan Superleague","ΠΑΟΚ","Newsroom"],"creator":null,"video_url":null,"description":"Ξεκίνησε η προετοιμασία για το παιχνίδι του ΠΑΟΚ με την Χάιντουκ Σπλιτ και ο Ζοάν Σάστρε επέστρεψε στις προπονήσεις.","content":"Μετά την πρόκριση επί της Μπεϊτάρ , ο ΠΑΟΚ κοιτάζει πλέον το επόμενο ματς για το Conference League που είναι απέναντι στην Χάιντουκ Σπλιτ του Λιβάγια. Ο Δικέφαλος ξεκίνησε την προετοιμασία του για το συγκεκριμένο ματς και ο Ραζβάν Λουτσέσκου είδε τον Ζοάν Σάστρε να επανέρχεται σε κανονικούς ρυθμούς μετά τον τραυματισμό του. Αναλυτικά η ανακοίνωση: «Ο στόχος κόντρα στην Μπεϊτάρ Ιερουσαλήμ επετεύχθη, η επόμενη πρόκληση για τον ΠΑΟΚ είναι τα παιχνίδια με την Χάιντουκ Σπλιτ αρχής γενομένης με αυτό στην Κροατία. Η προετοιμασία της ομάδας ξεκίνησε το απόγευμα του Σαββάτου (05.08) στη Νέα Μεσημβρία. Η προπόνηση διεξήχθη σε δύο γκρουπ, όσοι βρέθηκαν στο αρχικό σχήμα στο παιχνίδι στην Ιερουσαλήμ έκαναν ένα πρόγραμμα αποκατάστασης και αποθεραπείας στο γήπεδο, στο γυμναστήριο και στην πισίνα, ενώ οι υπόλοιποι δούλεψαν στο κομμάτι της τακτικής και έκλεισαν το πρόγραμμα τους με δίτερμα. Ο Ζοάν Σάστρε ξεκίνησε να προπονείτε κανονικά με την ομάδα, οπότε το ιατρικό δελτίο είναι πλέον κενό. Την Κυριακή (06.08) η ομάδα θα προπονηθεί στις 18:45 στη Νέα Μεσημβρία».","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"«Ο Φούντας θα αποχωρήσει από την DC United, παρότι πέρασε με επιτυχία τον ανιχνευτή ψεύδους»","link":"https://www.gazzetta.gr/football/mls/2244310/o-foyntas-tha-apohorisei-apo-tin-dc-united-paroti-perase-me-epityhia-ton","keywords":["Ποδόσφαιρο","Newsroom","Ταξιάρχης Φούντας","MLS","DC United","Έλληνες του εξωτερικού"],"creator":null,"video_url":null,"description":"Το «Athletic» μετέδωσε πως ο Ταξιαρχής Φούντας δεν αναμένεται να συνεχίσει στην DC United, με αφορμή τα όσα του καταλογίζει ο συμπαίκτης του Νάιτζελ Ρομπέρτα.","content":"Παρελθόν από την DC United αναμένεται να αποτελέσει ο Ταξιαρχής Φούντας σύμφωνα με το «Athletic» και με αφορμή την πρόσφατη καταγγελία του συμπαίκτη του Νάιτζελ Ρομπέρτα πως χειροδίκησε και καταφέρθηκε εναντίον του με ρατσιστικούς χαρακτηρισμούς, κάτι που οδήγησε τόσο την ομάδα του όσο και τη διοργανώτρια αρχή του MLS να ξεκινήσουν σχετικές έρευνες. Το σχετικό δημοσίευμα παραθέτει λεπτομέρειες, σύμφωνα με το ρεπορτάζ του, των όσων έχουν συμβεί από τις 22 Ιουλίου που βγήκε η υπόθεση στο φως της δημοσιότητας και μάλιστα στέκεται στο ότι με πρωτοβουλία του Ελληνα μεσοεπιθετικού εξετάστηκε από ανιχνευτή ψεύδους, ο οποίος έδειξε πως λέει την αλήθεια όταν ισχυρίζεται πως δεν είπε κάτι το μεμπτό. Ωστόσο η παραπάνω εξέταση δεν λαμβάνεται υπ' όψιν επειδή, όπως μεταδόθηκε σχετικά, το ποσοστό ακρίβειάς της κυμαίνεται από 60% ως 90% και όχι 100%, για αυτό και άλλωστε δεν ζητήθηκε από τον ποδοσφαιριστή να υποβληθεί σε αυτή αλλά το έπραξε μόνος του και μετά κατέθεσε τα αποτελέσματα στις αρμόδιες αρχές. Πάντως όπως μεταδόθηκε δεν υπάρχουν αποδείξεις αφού μεταξύ άλλων σχολιάζεται πως παρατηρούνται μόνο «μου είπε, του είπα, άκουσα», τα όσα δηλαδή υποστήριξαν οι παίκτες στην απολογία τους, ωστόσο το «Athletic» σχολίασε ότι και πριν από περίπου ένα χρόνο, τον Σεπτέμβριο του 2022, υπήρξε άλλη αντίστοιχη καταγγελία εναντίον του και ναι μεν δεν αποδείχθηκε εκ νέου κάτι, ο Φούντας έγινε πλέον ο πρώτος ποδοσφαιριστής στη σύγχρονη ιστορία του MLS για τον οποίο διεξάγονται δύο σχετικές έρευνες. Λόγω αυτού η πλειοψηφία των φίλων της ομάδας ζητά την αποπομπή του και ασκείται πίεση στη διοίκηση.","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Άρης: Η πρώτη ανάρτηση του «κομμένου» Γκρέι","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244300/aris-i-proti-anartisi-toy-kommenoy-gkrei","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Άρης","Newsroom","Αντρέ Γκρέι"],"creator":null,"video_url":null,"description":"Το πρώτο του μήνυμα μετά τη γνωστοποίηση πως είναι εκτός πλάνων στον Άρη έστειλε μέσω post στο Instagram ο Αντρέ Γκρέι.","content":"Ο Άρης γνωστοποίησε στον Αντρέ Γκρέι πως πλέον βρίσκεται εκτός ομάδας και θα προπονείται μόνος του, με τους Θεσσαλονικείς να ψάχνουν τον τρόπο να λύσουν τη συνεργασία τους μαζί του. Από την πλευρά του πάντως, ο Τζαμαϊκανός φορ με ανάρτησή του στο Instagram έστειλε μήνυμα προσωπικής ανάκαμψης. « Βάζω τα γόνατα στο στήθος και σηκώνομαι ξανά» , έγραψε χαρακτηριστικά, με τον άλλοτε συμπαίκτη του στους «κίτρινους», Μπράιαν Νταμπό να σχολιάζει: «Το κεφάλι ψηλά πάντα».","pubDate":"2023-08-05 18:47:21","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Ατρόμητος-ΟΦΗ 2-2: Από ένα ημίχρονο με γκολ και θέαμα","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244298/atromitos-ofi-2-2-apo-ena-imihrono-me-gkol-kai-theama","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ατρόμητος Αθηνών","ΟΦΗ","Νότης Χάλαρης"],"creator":null,"video_url":null,"description":"Ατρόμητος και ΟΦΗ αναμετρήθηκαν στο Ελ Πάσο της Καλλιθέας σε φιλική αναμέτρηση, όπου οι Περιστεριώτες προηγήθηκαν με 2-0 αλλά οι Κρητικοί ανέτρεψαν το σκορ στο τελικό 2-2.","content":"Αν και ο Ατρόμητος αιφνιδίασε τον ΟΦΗ στα πρώτα 15 λεπτά, οι Κρητικοί βρήκαν τον τρόπο να γυρίσουν το ματς στο τελικό 2-2. Στο γήπεδο βρέθηκε και ο πρόεδρος του ΟΦΗ, Μιχάλης Μπούσης . Αμφότερες οι δύο ομάδες μπήκαν δυναμικά στο παιχνίδι, με τον ΟΦΗ να έχει την πρώτη καλή στιγμή στο 3ο λεπτό, όταν ο Φελίπε πήρε την κεφαλιά αλλά η μπάλα πήγε άουτ. Η απάντηση του Ατρομήτου ήταν ένα σουτ του Ντε Μποκ που πήγε άουτ δύο λεπτά αργότερα όμως από το 10' και μετά, οι Περιστεριώτες αιφνιδίασαν τους Κρητικούς. Στο 14' ο Γιουμπιτάνα βρήκε χώρο, έφερε την μπάλα στο αριστερό και με σουτ νίκησε τον Χριστογεώργο για το 1-0 του Ατρομήτου. Η αυτοπεποίηθηση από το γκολ φάνηκε λίγα δευτερόλεπτα μετά, όταν ο Ρομπάιγ βγήκε τετ-α-τετ με τον Έλληνα πορτιέρε και με πλασέ έκανε το 2-0 για τους Περιστεριώτες. Όπως ήταν λογικό, ο ΟΦΗ άργησε να αντιδράση σε αυτά τα δύο γρήγορα γκολ όμως βρήκε τον δρόμο για μείωση του σκορ στο 41' όταν ο Μπάκιτς έκλεψε την μπάλα, έδωσε στον Μπιφουμά και αυτός με εξαιρετικό τελείωμα έκανε το 2-1 που ήταν και το τελικό σκορ του πρώτου μέρους. Στο δεύτερο 45λεπτο οι δύο ομάδες δεν κλείστηκαν στην άμυνα τους και προσπάθησαν να βρουν το γκολ έχοντας αμφότερες σημαντικές φάσεις για να το καταφέρουν. Ο Έρλινγκμαρκ στο 51' βρέθηκε σε καλή θέση στην περιοχή αλλά το σουτ πήγε άουτ ενώ ο Φελίπε προσπάθησε να απειλήσει με σουτ στη συνέχεια για τον ΟΦΗ αλλά η μπάλα κόντραρε στα σώματα. Οι μαζεμένες αλλαγές στο 59' και από τις δύο ομάδες έριξαν λίγο τον ρυθμό αλλά οι φάσεις συνεχίστηκαν. Τελικά οι Κρητικοί ήταν εκείνοι που βρήκαν τον δρόμο προς την ισοφάριση, όταν έφυγαν στην αντεπίθεση και ο Νέιρα με εξαιρετικό πλασέ νίκησε τον αντίπαλο πορτιέρε στο 79' για το 2-2. Στο 87' ο Αποστολάκης είχε μεγάλη στιγμή για να ολοκληρώσει την ανατροπή του ΟΦΗ μετά τη σέντρα του Θοράρινσον αλλά το πλασέ του πήγε πάνω από τα δοκάρια. Εν τέλει το σκορ δεν άλλαξε με τις δύο ομάδες να προσφέρουν γκολ, θέαμα και υποσχέσεις ενόψει της σεζόν. ΟΦΗ : Χριστογεώργος, Πασαλίδης (Βούρος 63'), Λαμπρόπουλος (Καρώ 63'), Αμπάντα (Θοράρινσον 63'), Λάρσον (Γκρόνινγκ 77'), Μεγιάδο (Νέιρα 70'), Μπάκιτς (Γιαννούλης 63'), Τοράλ (Αποστολάκης 63'), Ριέρα (Νέιρα 70'), Μπιφουμά (Μοσκέρα 63'), Φελίπε (Ντίκο 63') Ατρόμητος : Τσιντώτας, Κεσχρίντα, Ντε Μποκ, Τσακμάκης, Ασεβέδο, Έρλινγκμαρκ (Καραμάνος 70'), Γκονζάλες, Φριτζόνσον, Ρομπάιγ, Βέργος, Γιουμπιτάνα (Ντιρκς 52')","pubDate":"2023-08-05 18:40:53","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability","link":"https://www.dailymail.co.uk/sport/football/article-12374249/Jurgen-Klopp-learned-summers-unbalanced-preseason-Liverpool-look-fitter-sharper-HAPPIER-result-Reds-ready-new-campaign-despite-showing-occasional-vulnerability.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LEWIS STEELE IN SINGAPORE: It was in this south-eastern corner of Asia a year ago that Jurgen Klopp started to realise things weren't right at Liverpool after being thrashed by Man United.","content":"Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability Liverpool are almost ready for the start of the new Premier League season Management have learned their lessons from a torrid pre-season last year Boss Jurgen Klopp has transformed his team into a happier and fitter side By Lewis Steele For Mailonline Updated: 14:37 EDT, 5 August 2023 e-mail View comments It was in this south-eastern corner of Asia a year ago that Jurgen Klopp started to realise things weren't all right at Liverpool . Having been thrashed 4-0 by Manchester United in Bangkok, the Reds then jetted to Singapore for a quick jaunt that ended with injuries to several key men. Though they beat Crystal Palace there, Klopp struggled to find a balance between giving players significant rest after a gruelling 63-game 2021-22 season and giving them ample match time to get up to speed ahead of the new campaign. Liverpool did not find that balance. And so by the time the Reds were home the 14,000-mile round trip to Asia, they were left underprepared after a truncated pre-season. They then went to Austria for an intensive fitness camp but it always felt like they were playing catch-up. They never did catch up. 'Would I do anything differently in pre-season? I wouldn't spend the first week (of pre-season) in Asia,' said Klopp in January. The German and his management team blamed the hectic summer camps for a dreadful start to the season that saw them win just four of the first 10 games. But Klopp has learned lessons from last summer, and this pre-season has looked a lot different. Though Liverpool showed tactical and defensive vulnerabilities against Leicester and Bayern Munich here, the squad looks sharper, more focused and generally happier. Jurgen Klopp has been busy getting his Liverpool stars ready for the new campaign on their pre-season tour of Singapore Liverpool look a happier and fitter team to the side that struggled in pre-season last year Liverpool have only played in Singapore as opposed to travelling around Asia like they did last year Instead of a two-leg tour of Asia including a trip to Thailand, Liverpool jetted to just one destination this time around. To quash fears of tiredness and jet lag in Singapore, Klopp instructed his players and staff to follow a fake timezone. Though Singapore is seven hours ahead of the UK, Liverpool set their watches to just three hours ahead. One afternoon when arriving at the plush Ritz Carlton hotel where the Reds stayed, Mail Sport noticed one Liverpool player's phone displayed the time of 8.25am when it was actually 12.25pm. It meant Liverpool often sat down for team meals past midnight local time. Though the hotel was crawling with local autograph-hunters and kids trying for selfies - or wefies as they are called in these parts - Liverpool commandeered the 17th floor, with breathtaking views of the Singapore skyline, the futuristic Marina Bay Sands and Formula One track. Karaoke and table tennis tournaments were commonplace in the hotel. Mo Salah is the king of ping-pong and has a backhand nearly as good as his left foot on the football pitch. Defenders Ibou Konate and Andy Robertson are the class clowns. Robertson and his 'co-host' Salah conducted a series of fun assignments during down time, with them setting each other a series of undercover tasks. The pair frequently gatecrashed other players' commercial or media duties, while the Scotsman told a series of 'crap jokes'. 'What did the drummer call his twin daughters?' asked Robertson. 'Anna one, Anna two!' Trent Alexander-Arnold lamented Robertson's gag as awful but came to his rescue later to help his sidekick complete the challenge of winning a point off Salah at table tennis. Konate polled the team's favourite song, which ranged from many hip-hop beats such as Travis Scott and Drake, to Alexis Mac Allister's love for Latin American tunes, to Ayrshire starlet Ben Doak's favourite Gerry Cinnamon anthem, Belter. To quash fears of tiredness and jet lag in Singapore, Klopp (middle right) instructed his players and staff to follow a fake timezone Newly-appointed vice-captain Trent Alexander-Arnold (pictured) has played a key role in Liverpool's pre-season plans Liverpool have been undergoing a series of team-building activities during their time in Singapore These team-building activities are crucial to Klopp, though it wasn't all fun and games. Liverpool trained three times a day and striker Cody Gakpo told Mail Sport earlier this week that the non-matchday routine was, 'wake up, train, eat food, train, rest a bit, train'. Liverpool also flew out a group of club legends to Singapore, with the main aim of easing the burden on the players to fulfil media and commercial obligations. Instead, the likes of Lucas Leiva, Gary McAllister, John Barnes, John Aldridge and Ian Rush took the strain. New captain Virgil van Dijk has been crucial to helping new signings settle in Players such as Mohamed Salah (right) have been mobbed by fans wanting pictures and autographs in Singapore New boys Mac Allister and Dominik Szoboszlai have settled in nicely, with new captain Virgil Van Dijk crucial to that amid the unplanned exit of Jordan Henderson. It was also a solid tour for Diogo Jota and Luis Diaz, both of whom missed large chunks of last season injured. Gerry Cinnamon fan Doak is, to use the lyrics of his favourite song, different from the rest. The 17-year-old, who signed from Celtic for £600,000 last year, has experienced a meteoric rise and the speedy, direct winger has done his first-team chances no harm on this tour. Doak's agent is former Celtic legend Jackie McNamara, and the former Ayr United kid is said to have shown an innate desire to win from a young age while he treats every match the same, be it a kick-about back north of the border or playing alongside Liverpool's heavyweights. Liverpool will play in the Europa League this season and it could be a blessing in disguise The fact that Liverpool will play in the Europa League this season could be a blessing in disguise for some youngsters. It is hard to see Klopp risking Salah, Alexander-Arnold and Van Dijk in deepest, darkest eastern Europe on a Thursday night, so some openings might occur. Young box-to-box midfielder Bobby Clark has big admirers at Anfield, while James McConnell played well in the No 6 role in Singapore. Jarell Quansah could get some minutes as a back-up defender, while right-back Conor Bradley is well liked despite a recent injury. All of this means Klopp and Co boarded the long-haul flight back to Merseyside in much better shape than this time last year. Liverpool had an extra 14 days of pre-season this year compared to last, with no international tournament or Community Shield to play. Assistant manager Pep Ljinders refers to pre-season as a 'trampoline' for a good campaign in his diary book Intensity and, though this was hardly a bungee jump start, Liverpool can take plenty of positives from the trip to Singapore as a springboard for success in the new season. Share or comment on this article: Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-05 18:37:10","image_url":"https://i.dailymail.co.uk/1s/2023/08/04/19/73977507-0-image-a-2_1691173654779.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bears sign 39-year-old tight end Marcedes Lewis to 1-year contract","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/05/bears-sign-39-year-old-tight-end-mercedes-lewis-to-1-year-contract","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. The 39-year-old Lewis — entering his 18th season — gives […]","content":"LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. Read this article for free: Already have an account? To continue reading, please subscribe: * LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. The 39-year-old Lewis — entering his 18th season — gives the Bears a blocking tight end to complement Cole Kmet and help protect quarterback Justin Fields. He spent the past five years with Green Bay after playing his first 12 with Jacksonville. The 6-foot-6, 267-pound Lewis has 432 receptions for 5,084 yards and 39 touchdowns over 251 games and 221 starts. He is one of three tight ends, along with Tony Gonzalez and Jason Witten, with at least 200 regular-season starts and 400 receptions. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-05 18:35:50","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"Παναιτωλικός: Ο Μπαλντασάρα μπήκε στο αεροπλάνο για την Ελλάδα (vid)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244297/panaitolikos-o-mpalntasara-mpike-sto-aeroplano-gia-tin","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναιτωλικός","Newsroom"],"creator":null,"video_url":null,"description":"Ο Φράνκο Μπαλντασάρα που θα συνεχίσει στον Παναιτωλικό ξεκίνησε το ταξίδι του για την Ελλάδα, με σκοπό να ενσωματωθεί στα «καναρίνια».","content":"Αντίστροφα μετρά πλέον ο χρόνος ώστε ο Φράνκο Μπαλντασάρα να γίνει παίκτης επίσημα παίκτης του Παναιτωλικού , καθώς ο Αργεντινός χαφ έχει συμφωνήσει με τα «καναρίνια» και θα αποκτηθεί ως δανεικός από την Πλατένσε (στο Αγρίνιο θα διατηρούν buy in για το 50% των δικαιωμάτων του). Ο 25χρονος μπήκε πριν από λίγο στο αεροπλάνο για προορισμό την Ελλάδα και τις επόμενες ώρες θα ενσωματωθεί στα «καναρίνια».","pubDate":"2023-08-05 18:35:05","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Brad Lyons rocks Rangers as Michael Beale already playing Celtic catch up after opening day shocker - 3 talking points","link":"https://www.dailyrecord.co.uk/sport/football/football-match-reports/brad-lyons-rocks-rangers-michael-30636886","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (David McCarthy)"],"video_url":null,"description":"There was so much hype around the new-look Light Blues but it went horribly wrong in Ayrshire.","content":"Brad Lyons celebrates making it 1-0 Kilmarnock (Image: SNS Group) Get the latest Rangers news from Record Sport with our daily newsletter. More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Rangers news from Record Sport with our daily newsletter. Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Rangers are playing catch-up on Celtic after only 90 minutes as Kilmarnock deservedly took all three points at Rugby Park. Derek McInnes’ men outfought a lacklustre Gers outfit, who had five summer signings in their starting X1 and never looked comfortable against combative Killie, who snatched the winner through Brad Lyons midway through the second half after a John Souttar blunder. Michael Beale brought Connor Goldson straight back into the fold despite not playing any part in the pre-season build-up but there was a surprise further forward with Todd Cantwell starting on the bench alongside latest arrivals Danilo and Jose Cifuentes. As expected, the visitors had plenty of possession in the early stages, but little penetration and a couple of Borna Barisic crosses were pulled out of the air confidently by Will Dennis in the Killie goal. McInnes’ men began to impose themselves and were enjoying a spell on top when Abdallah Sima sprung the previously anonymous Cyriel Dessers on the counter attack, Ex-Gers kid Lewis Mayo got back to make a great challenge and wasn’t to know a late flag had gone up for offside against the Nigeria international. Read More Related Articles Kilmarnock 1 Rangers 0 LIVE reaction as Michael Beale stunned by Brad Lyons Rugby Park winner Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings It took Rangers 37 minutes to force Dennis into proper action, the keeper doing well to dive at Dessers’ feet to prevent him stabbing home a James Tavernier corner. The Killie keeper came out on top against the same player five minutes from the break, diving to smother his left foot drive after a Sima cutback had opened up the space. The second period followed the same pattern, only coming to life on the hour mark when Dowell saw a shot deflected on the roof of the net. It was the Englishman’s last contribution as he and Dessers were switched for Cantwell and debutant Danilo. Cyriel Dessers tries to get a shot away during a cinch Premiership match between Kilmarnock and Rangers (Image: SNS Group) But before either had broken sweat, their team was a goal behind as Killie struck through Lyons. A throw into the box from David Watson landed between John Souttar’s legs and as he dallied, the midfielder pounced to lash past Butland from eight yards. Butland kept his side in it with a fine save from Kyle Magennis’ long range effort in the 69th minute as Killie went for the jugular. Rangers huffed and puffed in the closing stages but never looked like rescuing even a point. Here's three talking points from Rugby Park. Del's boys go in for the Kil First things first, Killie deserved it. They were hungrier, brighter and in spells played very good football. Their fans can look forward to the season with genuine optimism after this display. Kilmarnock Manager Derek McInnes (Image: SNS Group) Solid at the back, industrious in midfield and in Kennedy and Armstrong have two aggressive, mobile attackers who will work around Watkins or Vassell. New boys must get up to speed - and fast Players like Sam Lammers, and Cyriel Dessers will now know far more about Scottish football and if they are smart they won’t produce many more lifeless, insipid displays like this one. Kieran Dowell might well have been the least heralded of Rangers’ new arrivals but he was the most impressive with a decent display for the hour he was on the pitch. Heat is on Gers already It’s only day one but Rangers will have to improve and pronto. They played like a team still getting to know each other and for most of the game lacked the urgency needed to get results at away grounds in the Premiership. Their next two league games against Livingston and Ross County must be won before they face Celtic on September 3. Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Rangers FC Scottish Premiership Kilmarnock FC Derek McInnes Michael Beale John Lundstram","pubDate":"2023-08-05 18:20:07","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30637614.ece/ALTERNATES/s615/0_Kilmarnock-v-Rangers-Cinch-Premiership.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international","link":"https://www.dailymail.co.uk/sport/football/article-12376853/Brighton-agree-35m-fee-wantaway-Ajax-star-Mohammed-Kudus-Seagulls-set-beat-Chelsea-Arsenal-signing-Ghana-international.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: Talks are ongoing for the Ghana international who has been a target for Brighton all summer but has also had interest from Chelsea and Arsenal.","content":"Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international The Seagulls have agreed a £35million fee for the Ajax attacking midfielder Talks are ongoing between the two clubs as Brighton look to bolster their attack The Ghana star had previously been closely linked with a move to Chelsea By Simon Jones for MailOnline Updated: 20:49, 5 August 2023 e-mail View comments Brighton have agreed a £35million fee with Ajax for Mohammed Kudus. Talks are ongoing for the Ghana international who has been a target for Brighton all summer but has also had interest from Chelsea and Arsenal . The 23-year old, who can play behind the striker or as a winger, had told Ajax he did not wish to sign a new contract and decided a move this summer would be best for all parties. Brighton hope to finalise details over the coming days. Kudus, who started his career with Danish side Nordsjælland before moving to Ajax, had an impressive return of 11 goals and three assists in the Eredivise last year. More to follow... Share or comment on this article: Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-05 19:49:57","image_url":"https://i.dailymail.co.uk/1s/2023/08/05/20/74001567-0-image-a-20_1691264845405.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Μπράιτον μεταγραφές: Πάει για «μπαμ» με Κούντους, συμφώνησε με Άγιαξ στα 40 εκατ. ευρώ!","link":"https://www.gazzetta.gr/football/premier-league/2244304/mpraiton-metagrafes-paei-gia-mpam-me-koyntoys-symfonise-me-agiax","keywords":["Ποδόσφαιρο","Premier League","Μπράιτον","Αγιαξ","Μεταγραφές","Ιάσονας Θεριός"],"creator":null,"video_url":null,"description":"Τη σπουδαιότερη μεταγραφή της ιστορίας της είναι έτοιμη να ολοκληρώσει η Μπράιτον, η οποία έδωσε τα χέρια με τον Άγιαξ για τον Γκανέζο μεσοεπιθετικό, Μοχάμεντ Κούντους.","content":"Μια ανάσα από το «μπαμ» η Μπράιτον ! Οι Γλάροι, σύμφωνα με το Athletic, συμφώνησαν με τον Άγιαξ για τον Μοχάμεντ Κούντους και είναι έτοιμοι να τελειώσουν τη μεταγραφή του Γκανέζου μεσοεπιθετικού έναντι 40 εκατομμυρίων ευρώ . Σε περίπτωση που αυτό συμβεί, ο 23χρονος θα γίνει ο πιο ακριβός παίκτης της ιστορίας τους. Αξίζει να σημειωθεί πως η Μπράιτον ήδη είχε σπάσει το σχετικό της ρεκόρ τον Ιούνιο με τη μεταγραφή του Ζοάο Πέδρο (35 εκατομμύρια από τη Γουότφορντ). Με βάση το ίδιο δημοσίευμα, ο σύλλογος από τον αγγλικό Νότο βρίσκεται πολύ κοντά και στη συμφωνία με τον ίδιο τον παίκτη για τους προσωπικούς όρους του συμβολαίου του. Για τον ταλαντούχο μεσοεπιθετικό, που μπορεί να αγωνιστεί ουσιαστικά σε κάθε θέση από τη μέση και μπροστά, είχαν ενδιαφερθεί και η Τσέλσι και η Άρσεναλ , ωστόσο, όπως όλα δείχνουν, αυτός θα καταλήξει στην Μπράιτον . Τη σεζόν που ολοκληρώθηκε ο Κούντους μέτρησε 18 γκολ και 7 ασίστ σε 42 εμφανίσεις και ενττυπωσίασε με την Γκάνα στο Μουντιάλ.","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"ΠΑΟΚ: Επιστροφή στις προπονήσεις για Σάστρε","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244309/paok-epistrofi-stis-proponiseis-gia-sastre","keywords":["Ποδόσφαιρο","Stoiximan Superleague","ΠΑΟΚ","Newsroom"],"creator":null,"video_url":null,"description":"Ξεκίνησε η προετοιμασία για το παιχνίδι του ΠΑΟΚ με την Χάιντουκ Σπλιτ και ο Ζοάν Σάστρε επέστρεψε στις προπονήσεις.","content":"Μετά την πρόκριση επί της Μπεϊτάρ , ο ΠΑΟΚ κοιτάζει πλέον το επόμενο ματς για το Conference League που είναι απέναντι στην Χάιντουκ Σπλιτ του Λιβάγια. Ο Δικέφαλος ξεκίνησε την προετοιμασία του για το συγκεκριμένο ματς και ο Ραζβάν Λουτσέσκου είδε τον Ζοάν Σάστρε να επανέρχεται σε κανονικούς ρυθμούς μετά τον τραυματισμό του. Αναλυτικά η ανακοίνωση: «Ο στόχος κόντρα στην Μπεϊτάρ Ιερουσαλήμ επετεύχθη, η επόμενη πρόκληση για τον ΠΑΟΚ είναι τα παιχνίδια με την Χάιντουκ Σπλιτ αρχής γενομένης με αυτό στην Κροατία. Η προετοιμασία της ομάδας ξεκίνησε το απόγευμα του Σαββάτου (05.08) στη Νέα Μεσημβρία. Η προπόνηση διεξήχθη σε δύο γκρουπ, όσοι βρέθηκαν στο αρχικό σχήμα στο παιχνίδι στην Ιερουσαλήμ έκαναν ένα πρόγραμμα αποκατάστασης και αποθεραπείας στο γήπεδο, στο γυμναστήριο και στην πισίνα, ενώ οι υπόλοιποι δούλεψαν στο κομμάτι της τακτικής και έκλεισαν το πρόγραμμα τους με δίτερμα. Ο Ζοάν Σάστρε ξεκίνησε να προπονείτε κανονικά με την ομάδα, οπότε το ιατρικό δελτίο είναι πλέον κενό. Την Κυριακή (06.08) η ομάδα θα προπονηθεί στις 18:45 στη Νέα Μεσημβρία».","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"«Ο Φούντας θα αποχωρήσει από την DC United, παρότι πέρασε με επιτυχία τον ανιχνευτή ψεύδους»","link":"https://www.gazzetta.gr/football/mls/2244310/o-foyntas-tha-apohorisei-apo-tin-dc-united-paroti-perase-me-epityhia-ton","keywords":["Ποδόσφαιρο","Newsroom","Ταξιάρχης Φούντας","MLS","DC United","Έλληνες του εξωτερικού"],"creator":null,"video_url":null,"description":"Το «Athletic» μετέδωσε πως ο Ταξιαρχής Φούντας δεν αναμένεται να συνεχίσει στην DC United, με αφορμή τα όσα του καταλογίζει ο συμπαίκτης του Νάιτζελ Ρομπέρτα.","content":"Παρελθόν από την DC United αναμένεται να αποτελέσει ο Ταξιαρχής Φούντας σύμφωνα με το «Athletic» και με αφορμή την πρόσφατη καταγγελία του συμπαίκτη του Νάιτζελ Ρομπέρτα πως χειροδίκησε και καταφέρθηκε εναντίον του με ρατσιστικούς χαρακτηρισμούς, κάτι που οδήγησε τόσο την ομάδα του όσο και τη διοργανώτρια αρχή του MLS να ξεκινήσουν σχετικές έρευνες. Το σχετικό δημοσίευμα παραθέτει λεπτομέρειες, σύμφωνα με το ρεπορτάζ του, των όσων έχουν συμβεί από τις 22 Ιουλίου που βγήκε η υπόθεση στο φως της δημοσιότητας και μάλιστα στέκεται στο ότι με πρωτοβουλία του Ελληνα μεσοεπιθετικού εξετάστηκε από ανιχνευτή ψεύδους, ο οποίος έδειξε πως λέει την αλήθεια όταν ισχυρίζεται πως δεν είπε κάτι το μεμπτό. Ωστόσο η παραπάνω εξέταση δεν λαμβάνεται υπ' όψιν επειδή, όπως μεταδόθηκε σχετικά, το ποσοστό ακρίβειάς της κυμαίνεται από 60% ως 90% και όχι 100%, για αυτό και άλλωστε δεν ζητήθηκε από τον ποδοσφαιριστή να υποβληθεί σε αυτή αλλά το έπραξε μόνος του και μετά κατέθεσε τα αποτελέσματα στις αρμόδιες αρχές. Πάντως όπως μεταδόθηκε δεν υπάρχουν αποδείξεις αφού μεταξύ άλλων σχολιάζεται πως παρατηρούνται μόνο «μου είπε, του είπα, άκουσα», τα όσα δηλαδή υποστήριξαν οι παίκτες στην απολογία τους, ωστόσο το «Athletic» σχολίασε ότι και πριν από περίπου ένα χρόνο, τον Σεπτέμβριο του 2022, υπήρξε άλλη αντίστοιχη καταγγελία εναντίον του και ναι μεν δεν αποδείχθηκε εκ νέου κάτι, ο Φούντας έγινε πλέον ο πρώτος ποδοσφαιριστής στη σύγχρονη ιστορία του MLS για τον οποίο διεξάγονται δύο σχετικές έρευνες. Λόγω αυτού η πλειοψηφία των φίλων της ομάδας ζητά την αποπομπή του και ασκείται πίεση στη διοίκηση.","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Άρης: Η πρώτη ανάρτηση του «κομμένου» Γκρέι","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244300/aris-i-proti-anartisi-toy-kommenoy-gkrei","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Άρης","Newsroom","Αντρέ Γκρέι"],"creator":null,"video_url":null,"description":"Το πρώτο του μήνυμα μετά τη γνωστοποίηση πως είναι εκτός πλάνων στον Άρη έστειλε μέσω post στο Instagram ο Αντρέ Γκρέι.","content":"Ο Άρης γνωστοποίησε στον Αντρέ Γκρέι πως πλέον βρίσκεται εκτός ομάδας και θα προπονείται μόνος του, με τους Θεσσαλονικείς να ψάχνουν τον τρόπο να λύσουν τη συνεργασία τους μαζί του. Από την πλευρά του πάντως, ο Τζαμαϊκανός φορ με ανάρτησή του στο Instagram έστειλε μήνυμα προσωπικής ανάκαμψης. « Βάζω τα γόνατα στο στήθος και σηκώνομαι ξανά» , έγραψε χαρακτηριστικά, με τον άλλοτε συμπαίκτη του στους «κίτρινους», Μπράιαν Νταμπό να σχολιάζει: «Το κεφάλι ψηλά πάντα».","pubDate":"2023-08-05 18:47:21","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Ατρόμητος-ΟΦΗ 2-2: Από ένα ημίχρονο με γκολ και θέαμα","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244298/atromitos-ofi-2-2-apo-ena-imihrono-me-gkol-kai-theama","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ατρόμητος Αθηνών","ΟΦΗ","Νότης Χάλαρης"],"creator":null,"video_url":null,"description":"Ατρόμητος και ΟΦΗ αναμετρήθηκαν στο Ελ Πάσο της Καλλιθέας σε φιλική αναμέτρηση, όπου οι Περιστεριώτες προηγήθηκαν με 2-0 αλλά οι Κρητικοί ανέτρεψαν το σκορ στο τελικό 2-2.","content":"Αν και ο Ατρόμητος αιφνιδίασε τον ΟΦΗ στα πρώτα 15 λεπτά, οι Κρητικοί βρήκαν τον τρόπο να γυρίσουν το ματς στο τελικό 2-2. Στο γήπεδο βρέθηκε και ο πρόεδρος του ΟΦΗ, Μιχάλης Μπούσης . Αμφότερες οι δύο ομάδες μπήκαν δυναμικά στο παιχνίδι, με τον ΟΦΗ να έχει την πρώτη καλή στιγμή στο 3ο λεπτό, όταν ο Φελίπε πήρε την κεφαλιά αλλά η μπάλα πήγε άουτ. Η απάντηση του Ατρομήτου ήταν ένα σουτ του Ντε Μποκ που πήγε άουτ δύο λεπτά αργότερα όμως από το 10' και μετά, οι Περιστεριώτες αιφνιδίασαν τους Κρητικούς. Στο 14' ο Γιουμπιτάνα βρήκε χώρο, έφερε την μπάλα στο αριστερό και με σουτ νίκησε τον Χριστογεώργο για το 1-0 του Ατρομήτου. Η αυτοπεποίηθηση από το γκολ φάνηκε λίγα δευτερόλεπτα μετά, όταν ο Ρομπάιγ βγήκε τετ-α-τετ με τον Έλληνα πορτιέρε και με πλασέ έκανε το 2-0 για τους Περιστεριώτες. Όπως ήταν λογικό, ο ΟΦΗ άργησε να αντιδράση σε αυτά τα δύο γρήγορα γκολ όμως βρήκε τον δρόμο για μείωση του σκορ στο 41' όταν ο Μπάκιτς έκλεψε την μπάλα, έδωσε στον Μπιφουμά και αυτός με εξαιρετικό τελείωμα έκανε το 2-1 που ήταν και το τελικό σκορ του πρώτου μέρους. Στο δεύτερο 45λεπτο οι δύο ομάδες δεν κλείστηκαν στην άμυνα τους και προσπάθησαν να βρουν το γκολ έχοντας αμφότερες σημαντικές φάσεις για να το καταφέρουν. Ο Έρλινγκμαρκ στο 51' βρέθηκε σε καλή θέση στην περιοχή αλλά το σουτ πήγε άουτ ενώ ο Φελίπε προσπάθησε να απειλήσει με σουτ στη συνέχεια για τον ΟΦΗ αλλά η μπάλα κόντραρε στα σώματα. Οι μαζεμένες αλλαγές στο 59' και από τις δύο ομάδες έριξαν λίγο τον ρυθμό αλλά οι φάσεις συνεχίστηκαν. Τελικά οι Κρητικοί ήταν εκείνοι που βρήκαν τον δρόμο προς την ισοφάριση, όταν έφυγαν στην αντεπίθεση και ο Νέιρα με εξαιρετικό πλασέ νίκησε τον αντίπαλο πορτιέρε στο 79' για το 2-2. Στο 87' ο Αποστολάκης είχε μεγάλη στιγμή για να ολοκληρώσει την ανατροπή του ΟΦΗ μετά τη σέντρα του Θοράρινσον αλλά το πλασέ του πήγε πάνω από τα δοκάρια. Εν τέλει το σκορ δεν άλλαξε με τις δύο ομάδες να προσφέρουν γκολ, θέαμα και υποσχέσεις ενόψει της σεζόν. ΟΦΗ : Χριστογεώργος, Πασαλίδης (Βούρος 63'), Λαμπρόπουλος (Καρώ 63'), Αμπάντα (Θοράρινσον 63'), Λάρσον (Γκρόνινγκ 77'), Μεγιάδο (Νέιρα 70'), Μπάκιτς (Γιαννούλης 63'), Τοράλ (Αποστολάκης 63'), Ριέρα (Νέιρα 70'), Μπιφουμά (Μοσκέρα 63'), Φελίπε (Ντίκο 63') Ατρόμητος : Τσιντώτας, Κεσχρίντα, Ντε Μποκ, Τσακμάκης, Ασεβέδο, Έρλινγκμαρκ (Καραμάνος 70'), Γκονζάλες, Φριτζόνσον, Ρομπάιγ, Βέργος, Γιουμπιτάνα (Ντιρκς 52')","pubDate":"2023-08-05 18:40:53","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability","link":"https://www.dailymail.co.uk/sport/football/article-12374249/Jurgen-Klopp-learned-summers-unbalanced-preseason-Liverpool-look-fitter-sharper-HAPPIER-result-Reds-ready-new-campaign-despite-showing-occasional-vulnerability.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LEWIS STEELE IN SINGAPORE: It was in this south-eastern corner of Asia a year ago that Jurgen Klopp started to realise things weren't right at Liverpool after being thrashed by Man United.","content":"Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability Liverpool are almost ready for the start of the new Premier League season Management have learned their lessons from a torrid pre-season last year Boss Jurgen Klopp has transformed his team into a happier and fitter side By Lewis Steele For Mailonline Updated: 14:37 EDT, 5 August 2023 e-mail View comments It was in this south-eastern corner of Asia a year ago that Jurgen Klopp started to realise things weren't all right at Liverpool . Having been thrashed 4-0 by Manchester United in Bangkok, the Reds then jetted to Singapore for a quick jaunt that ended with injuries to several key men. Though they beat Crystal Palace there, Klopp struggled to find a balance between giving players significant rest after a gruelling 63-game 2021-22 season and giving them ample match time to get up to speed ahead of the new campaign. Liverpool did not find that balance. And so by the time the Reds were home the 14,000-mile round trip to Asia, they were left underprepared after a truncated pre-season. They then went to Austria for an intensive fitness camp but it always felt like they were playing catch-up. They never did catch up. 'Would I do anything differently in pre-season? I wouldn't spend the first week (of pre-season) in Asia,' said Klopp in January. The German and his management team blamed the hectic summer camps for a dreadful start to the season that saw them win just four of the first 10 games. But Klopp has learned lessons from last summer, and this pre-season has looked a lot different. Though Liverpool showed tactical and defensive vulnerabilities against Leicester and Bayern Munich here, the squad looks sharper, more focused and generally happier. Jurgen Klopp has been busy getting his Liverpool stars ready for the new campaign on their pre-season tour of Singapore Liverpool look a happier and fitter team to the side that struggled in pre-season last year Liverpool have only played in Singapore as opposed to travelling around Asia like they did last year Instead of a two-leg tour of Asia including a trip to Thailand, Liverpool jetted to just one destination this time around. To quash fears of tiredness and jet lag in Singapore, Klopp instructed his players and staff to follow a fake timezone. Though Singapore is seven hours ahead of the UK, Liverpool set their watches to just three hours ahead. One afternoon when arriving at the plush Ritz Carlton hotel where the Reds stayed, Mail Sport noticed one Liverpool player's phone displayed the time of 8.25am when it was actually 12.25pm. It meant Liverpool often sat down for team meals past midnight local time. Though the hotel was crawling with local autograph-hunters and kids trying for selfies - or wefies as they are called in these parts - Liverpool commandeered the 17th floor, with breathtaking views of the Singapore skyline, the futuristic Marina Bay Sands and Formula One track. Karaoke and table tennis tournaments were commonplace in the hotel. Mo Salah is the king of ping-pong and has a backhand nearly as good as his left foot on the football pitch. Defenders Ibou Konate and Andy Robertson are the class clowns. Robertson and his 'co-host' Salah conducted a series of fun assignments during down time, with them setting each other a series of undercover tasks. The pair frequently gatecrashed other players' commercial or media duties, while the Scotsman told a series of 'crap jokes'. 'What did the drummer call his twin daughters?' asked Robertson. 'Anna one, Anna two!' Trent Alexander-Arnold lamented Robertson's gag as awful but came to his rescue later to help his sidekick complete the challenge of winning a point off Salah at table tennis. Konate polled the team's favourite song, which ranged from many hip-hop beats such as Travis Scott and Drake, to Alexis Mac Allister's love for Latin American tunes, to Ayrshire starlet Ben Doak's favourite Gerry Cinnamon anthem, Belter. To quash fears of tiredness and jet lag in Singapore, Klopp (middle right) instructed his players and staff to follow a fake timezone Newly-appointed vice-captain Trent Alexander-Arnold (pictured) has played a key role in Liverpool's pre-season plans Liverpool have been undergoing a series of team-building activities during their time in Singapore These team-building activities are crucial to Klopp, though it wasn't all fun and games. Liverpool trained three times a day and striker Cody Gakpo told Mail Sport earlier this week that the non-matchday routine was, 'wake up, train, eat food, train, rest a bit, train'. Liverpool also flew out a group of club legends to Singapore, with the main aim of easing the burden on the players to fulfil media and commercial obligations. Instead, the likes of Lucas Leiva, Gary McAllister, John Barnes, John Aldridge and Ian Rush took the strain. New captain Virgil van Dijk has been crucial to helping new signings settle in Players such as Mohamed Salah (right) have been mobbed by fans wanting pictures and autographs in Singapore New boys Mac Allister and Dominik Szoboszlai have settled in nicely, with new captain Virgil Van Dijk crucial to that amid the unplanned exit of Jordan Henderson. It was also a solid tour for Diogo Jota and Luis Diaz, both of whom missed large chunks of last season injured. Gerry Cinnamon fan Doak is, to use the lyrics of his favourite song, different from the rest. The 17-year-old, who signed from Celtic for £600,000 last year, has experienced a meteoric rise and the speedy, direct winger has done his first-team chances no harm on this tour. Doak's agent is former Celtic legend Jackie McNamara, and the former Ayr United kid is said to have shown an innate desire to win from a young age while he treats every match the same, be it a kick-about back north of the border or playing alongside Liverpool's heavyweights. Liverpool will play in the Europa League this season and it could be a blessing in disguise The fact that Liverpool will play in the Europa League this season could be a blessing in disguise for some youngsters. It is hard to see Klopp risking Salah, Alexander-Arnold and Van Dijk in deepest, darkest eastern Europe on a Thursday night, so some openings might occur. Young box-to-box midfielder Bobby Clark has big admirers at Anfield, while James McConnell played well in the No 6 role in Singapore. Jarell Quansah could get some minutes as a back-up defender, while right-back Conor Bradley is well liked despite a recent injury. All of this means Klopp and Co boarded the long-haul flight back to Merseyside in much better shape than this time last year. Liverpool had an extra 14 days of pre-season this year compared to last, with no international tournament or Community Shield to play. Assistant manager Pep Ljinders refers to pre-season as a 'trampoline' for a good campaign in his diary book Intensity and, though this was hardly a bungee jump start, Liverpool can take plenty of positives from the trip to Singapore as a springboard for success in the new season. Share or comment on this article: Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-05 18:37:10","image_url":"https://i.dailymail.co.uk/1s/2023/08/04/19/73977507-0-image-a-2_1691173654779.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bears sign 39-year-old tight end Marcedes Lewis to 1-year contract","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/05/bears-sign-39-year-old-tight-end-mercedes-lewis-to-1-year-contract","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. The 39-year-old Lewis — entering his 18th season — gives […]","content":"LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. Read this article for free: Already have an account? To continue reading, please subscribe: * LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. The 39-year-old Lewis — entering his 18th season — gives the Bears a blocking tight end to complement Cole Kmet and help protect quarterback Justin Fields. He spent the past five years with Green Bay after playing his first 12 with Jacksonville. The 6-foot-6, 267-pound Lewis has 432 receptions for 5,084 yards and 39 touchdowns over 251 games and 221 starts. He is one of three tight ends, along with Tony Gonzalez and Jason Witten, with at least 200 regular-season starts and 400 receptions. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-05 18:35:50","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"Παναιτωλικός: Ο Μπαλντασάρα μπήκε στο αεροπλάνο για την Ελλάδα (vid)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244297/panaitolikos-o-mpalntasara-mpike-sto-aeroplano-gia-tin","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναιτωλικός","Newsroom"],"creator":null,"video_url":null,"description":"Ο Φράνκο Μπαλντασάρα που θα συνεχίσει στον Παναιτωλικό ξεκίνησε το ταξίδι του για την Ελλάδα, με σκοπό να ενσωματωθεί στα «καναρίνια».","content":"Αντίστροφα μετρά πλέον ο χρόνος ώστε ο Φράνκο Μπαλντασάρα να γίνει παίκτης επίσημα παίκτης του Παναιτωλικού , καθώς ο Αργεντινός χαφ έχει συμφωνήσει με τα «καναρίνια» και θα αποκτηθεί ως δανεικός από την Πλατένσε (στο Αγρίνιο θα διατηρούν buy in για το 50% των δικαιωμάτων του). Ο 25χρονος μπήκε πριν από λίγο στο αεροπλάνο για προορισμό την Ελλάδα και τις επόμενες ώρες θα ενσωματωθεί στα «καναρίνια».","pubDate":"2023-08-05 18:35:05","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Brad Lyons rocks Rangers as Michael Beale already playing Celtic catch up after opening day shocker - 3 talking points","link":"https://www.dailyrecord.co.uk/sport/football/football-match-reports/brad-lyons-rocks-rangers-michael-30636886","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (David McCarthy)"],"video_url":null,"description":"There was so much hype around the new-look Light Blues but it went horribly wrong in Ayrshire.","content":"Brad Lyons celebrates making it 1-0 Kilmarnock (Image: SNS Group) Get the latest Rangers news from Record Sport with our daily newsletter. More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Rangers news from Record Sport with our daily newsletter. Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Rangers are playing catch-up on Celtic after only 90 minutes as Kilmarnock deservedly took all three points at Rugby Park. Derek McInnes’ men outfought a lacklustre Gers outfit, who had five summer signings in their starting X1 and never looked comfortable against combative Killie, who snatched the winner through Brad Lyons midway through the second half after a John Souttar blunder. Michael Beale brought Connor Goldson straight back into the fold despite not playing any part in the pre-season build-up but there was a surprise further forward with Todd Cantwell starting on the bench alongside latest arrivals Danilo and Jose Cifuentes. As expected, the visitors had plenty of possession in the early stages, but little penetration and a couple of Borna Barisic crosses were pulled out of the air confidently by Will Dennis in the Killie goal. McInnes’ men began to impose themselves and were enjoying a spell on top when Abdallah Sima sprung the previously anonymous Cyriel Dessers on the counter attack, Ex-Gers kid Lewis Mayo got back to make a great challenge and wasn’t to know a late flag had gone up for offside against the Nigeria international. Read More Related Articles Kilmarnock 1 Rangers 0 LIVE reaction as Michael Beale stunned by Brad Lyons Rugby Park winner Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings It took Rangers 37 minutes to force Dennis into proper action, the keeper doing well to dive at Dessers’ feet to prevent him stabbing home a James Tavernier corner. The Killie keeper came out on top against the same player five minutes from the break, diving to smother his left foot drive after a Sima cutback had opened up the space. The second period followed the same pattern, only coming to life on the hour mark when Dowell saw a shot deflected on the roof of the net. It was the Englishman’s last contribution as he and Dessers were switched for Cantwell and debutant Danilo. Cyriel Dessers tries to get a shot away during a cinch Premiership match between Kilmarnock and Rangers (Image: SNS Group) But before either had broken sweat, their team was a goal behind as Killie struck through Lyons. A throw into the box from David Watson landed between John Souttar’s legs and as he dallied, the midfielder pounced to lash past Butland from eight yards. Butland kept his side in it with a fine save from Kyle Magennis’ long range effort in the 69th minute as Killie went for the jugular. Rangers huffed and puffed in the closing stages but never looked like rescuing even a point. Here's three talking points from Rugby Park. Del's boys go in for the Kil First things first, Killie deserved it. They were hungrier, brighter and in spells played very good football. Their fans can look forward to the season with genuine optimism after this display. Kilmarnock Manager Derek McInnes (Image: SNS Group) Solid at the back, industrious in midfield and in Kennedy and Armstrong have two aggressive, mobile attackers who will work around Watkins or Vassell. New boys must get up to speed - and fast Players like Sam Lammers, and Cyriel Dessers will now know far more about Scottish football and if they are smart they won’t produce many more lifeless, insipid displays like this one. Kieran Dowell might well have been the least heralded of Rangers’ new arrivals but he was the most impressive with a decent display for the hour he was on the pitch. Heat is on Gers already It’s only day one but Rangers will have to improve and pronto. They played like a team still getting to know each other and for most of the game lacked the urgency needed to get results at away grounds in the Premiership. Their next two league games against Livingston and Ross County must be won before they face Celtic on September 3. Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Rangers FC Scottish Premiership Kilmarnock FC Derek McInnes Michael Beale John Lundstram","pubDate":"2023-08-05 18:20:07","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30637614.ece/ALTERNATES/s615/0_Kilmarnock-v-Rangers-Cinch-Premiership.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international","link":"https://www.dailymail.co.uk/sport/football/article-12376853/Brighton-agree-35m-fee-wantaway-Ajax-star-Mohammed-Kudus-Seagulls-set-beat-Chelsea-Arsenal-signing-Ghana-international.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"SIMON JONES: Talks are ongoing for the Ghana international who has been a target for Brighton all summer but has also had interest from Chelsea and Arsenal.","content":"Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international The Seagulls have agreed a £35million fee for the Ajax attacking midfielder Talks are ongoing between the two clubs as Brighton look to bolster their attack The Ghana star had previously been closely linked with a move to Chelsea By Simon Jones for MailOnline Updated: 20:49, 5 August 2023 e-mail View comments Brighton have agreed a £35million fee with Ajax for Mohammed Kudus. Talks are ongoing for the Ghana international who has been a target for Brighton all summer but has also had interest from Chelsea and Arsenal . The 23-year old, who can play behind the striker or as a winger, had told Ajax he did not wish to sign a new contract and decided a move this summer would be best for all parties. Brighton hope to finalise details over the coming days. Kudus, who started his career with Danish side Nordsjælland before moving to Ajax, had an impressive return of 11 goals and three assists in the Eredivise last year. More to follow... Share or comment on this article: Brighton agree £35m fee for wantaway Ajax star Mohammed Kudus - with Seagulls set to beat Chelsea and Arsenal to signing Ghana international e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-05 19:49:57","image_url":"https://i.dailymail.co.uk/1s/2023/08/05/20/74001567-0-image-a-20_1691264845405.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Μπράιτον μεταγραφές: Πάει για «μπαμ» με Κούντους, συμφώνησε με Άγιαξ στα 40 εκατ. ευρώ!","link":"https://www.gazzetta.gr/football/premier-league/2244304/mpraiton-metagrafes-paei-gia-mpam-me-koyntoys-symfonise-me-agiax","keywords":["Ποδόσφαιρο","Premier League","Μπράιτον","Αγιαξ","Μεταγραφές","Ιάσονας Θεριός"],"creator":null,"video_url":null,"description":"Τη σπουδαιότερη μεταγραφή της ιστορίας της είναι έτοιμη να ολοκληρώσει η Μπράιτον, η οποία έδωσε τα χέρια με τον Άγιαξ για τον Γκανέζο μεσοεπιθετικό, Μοχάμεντ Κούντους.","content":"Μια ανάσα από το «μπαμ» η Μπράιτον ! Οι Γλάροι, σύμφωνα με το Athletic, συμφώνησαν με τον Άγιαξ για τον Μοχάμεντ Κούντους και είναι έτοιμοι να τελειώσουν τη μεταγραφή του Γκανέζου μεσοεπιθετικού έναντι 40 εκατομμυρίων ευρώ . Σε περίπτωση που αυτό συμβεί, ο 23χρονος θα γίνει ο πιο ακριβός παίκτης της ιστορίας τους. Αξίζει να σημειωθεί πως η Μπράιτον ήδη είχε σπάσει το σχετικό της ρεκόρ τον Ιούνιο με τη μεταγραφή του Ζοάο Πέδρο (35 εκατομμύρια από τη Γουότφορντ). Με βάση το ίδιο δημοσίευμα, ο σύλλογος από τον αγγλικό Νότο βρίσκεται πολύ κοντά και στη συμφωνία με τον ίδιο τον παίκτη για τους προσωπικούς όρους του συμβολαίου του. Για τον ταλαντούχο μεσοεπιθετικό, που μπορεί να αγωνιστεί ουσιαστικά σε κάθε θέση από τη μέση και μπροστά, είχαν ενδιαφερθεί και η Τσέλσι και η Άρσεναλ , ωστόσο, όπως όλα δείχνουν, αυτός θα καταλήξει στην Μπράιτον . Τη σεζόν που ολοκληρώθηκε ο Κούντους μέτρησε 18 γκολ και 7 ασίστ σε 42 εμφανίσεις και ενττυπωσίασε με την Γκάνα στο Μουντιάλ.","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"ΠΑΟΚ: Επιστροφή στις προπονήσεις για Σάστρε","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244309/paok-epistrofi-stis-proponiseis-gia-sastre","keywords":["Ποδόσφαιρο","Stoiximan Superleague","ΠΑΟΚ","Newsroom"],"creator":null,"video_url":null,"description":"Ξεκίνησε η προετοιμασία για το παιχνίδι του ΠΑΟΚ με την Χάιντουκ Σπλιτ και ο Ζοάν Σάστρε επέστρεψε στις προπονήσεις.","content":"Μετά την πρόκριση επί της Μπεϊτάρ , ο ΠΑΟΚ κοιτάζει πλέον το επόμενο ματς για το Conference League που είναι απέναντι στην Χάιντουκ Σπλιτ του Λιβάγια. Ο Δικέφαλος ξεκίνησε την προετοιμασία του για το συγκεκριμένο ματς και ο Ραζβάν Λουτσέσκου είδε τον Ζοάν Σάστρε να επανέρχεται σε κανονικούς ρυθμούς μετά τον τραυματισμό του. Αναλυτικά η ανακοίνωση: «Ο στόχος κόντρα στην Μπεϊτάρ Ιερουσαλήμ επετεύχθη, η επόμενη πρόκληση για τον ΠΑΟΚ είναι τα παιχνίδια με την Χάιντουκ Σπλιτ αρχής γενομένης με αυτό στην Κροατία. Η προετοιμασία της ομάδας ξεκίνησε το απόγευμα του Σαββάτου (05.08) στη Νέα Μεσημβρία. Η προπόνηση διεξήχθη σε δύο γκρουπ, όσοι βρέθηκαν στο αρχικό σχήμα στο παιχνίδι στην Ιερουσαλήμ έκαναν ένα πρόγραμμα αποκατάστασης και αποθεραπείας στο γήπεδο, στο γυμναστήριο και στην πισίνα, ενώ οι υπόλοιποι δούλεψαν στο κομμάτι της τακτικής και έκλεισαν το πρόγραμμα τους με δίτερμα. Ο Ζοάν Σάστρε ξεκίνησε να προπονείτε κανονικά με την ομάδα, οπότε το ιατρικό δελτίο είναι πλέον κενό. Την Κυριακή (06.08) η ομάδα θα προπονηθεί στις 18:45 στη Νέα Μεσημβρία».","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"«Ο Φούντας θα αποχωρήσει από την DC United, παρότι πέρασε με επιτυχία τον ανιχνευτή ψεύδους»","link":"https://www.gazzetta.gr/football/mls/2244310/o-foyntas-tha-apohorisei-apo-tin-dc-united-paroti-perase-me-epityhia-ton","keywords":["Ποδόσφαιρο","Newsroom","Ταξιάρχης Φούντας","MLS","DC United","Έλληνες του εξωτερικού"],"creator":null,"video_url":null,"description":"Το «Athletic» μετέδωσε πως ο Ταξιαρχής Φούντας δεν αναμένεται να συνεχίσει στην DC United, με αφορμή τα όσα του καταλογίζει ο συμπαίκτης του Νάιτζελ Ρομπέρτα.","content":"Παρελθόν από την DC United αναμένεται να αποτελέσει ο Ταξιαρχής Φούντας σύμφωνα με το «Athletic» και με αφορμή την πρόσφατη καταγγελία του συμπαίκτη του Νάιτζελ Ρομπέρτα πως χειροδίκησε και καταφέρθηκε εναντίον του με ρατσιστικούς χαρακτηρισμούς, κάτι που οδήγησε τόσο την ομάδα του όσο και τη διοργανώτρια αρχή του MLS να ξεκινήσουν σχετικές έρευνες. Το σχετικό δημοσίευμα παραθέτει λεπτομέρειες, σύμφωνα με το ρεπορτάζ του, των όσων έχουν συμβεί από τις 22 Ιουλίου που βγήκε η υπόθεση στο φως της δημοσιότητας και μάλιστα στέκεται στο ότι με πρωτοβουλία του Ελληνα μεσοεπιθετικού εξετάστηκε από ανιχνευτή ψεύδους, ο οποίος έδειξε πως λέει την αλήθεια όταν ισχυρίζεται πως δεν είπε κάτι το μεμπτό. Ωστόσο η παραπάνω εξέταση δεν λαμβάνεται υπ' όψιν επειδή, όπως μεταδόθηκε σχετικά, το ποσοστό ακρίβειάς της κυμαίνεται από 60% ως 90% και όχι 100%, για αυτό και άλλωστε δεν ζητήθηκε από τον ποδοσφαιριστή να υποβληθεί σε αυτή αλλά το έπραξε μόνος του και μετά κατέθεσε τα αποτελέσματα στις αρμόδιες αρχές. Πάντως όπως μεταδόθηκε δεν υπάρχουν αποδείξεις αφού μεταξύ άλλων σχολιάζεται πως παρατηρούνται μόνο «μου είπε, του είπα, άκουσα», τα όσα δηλαδή υποστήριξαν οι παίκτες στην απολογία τους, ωστόσο το «Athletic» σχολίασε ότι και πριν από περίπου ένα χρόνο, τον Σεπτέμβριο του 2022, υπήρξε άλλη αντίστοιχη καταγγελία εναντίον του και ναι μεν δεν αποδείχθηκε εκ νέου κάτι, ο Φούντας έγινε πλέον ο πρώτος ποδοσφαιριστής στη σύγχρονη ιστορία του MLS για τον οποίο διεξάγονται δύο σχετικές έρευνες. Λόγω αυτού η πλειοψηφία των φίλων της ομάδας ζητά την αποπομπή του και ασκείται πίεση στη διοίκηση.","pubDate":"2023-08-05 18:58:22","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Άρης: Η πρώτη ανάρτηση του «κομμένου» Γκρέι","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244300/aris-i-proti-anartisi-toy-kommenoy-gkrei","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Άρης","Newsroom","Αντρέ Γκρέι"],"creator":null,"video_url":null,"description":"Το πρώτο του μήνυμα μετά τη γνωστοποίηση πως είναι εκτός πλάνων στον Άρη έστειλε μέσω post στο Instagram ο Αντρέ Γκρέι.","content":"Ο Άρης γνωστοποίησε στον Αντρέ Γκρέι πως πλέον βρίσκεται εκτός ομάδας και θα προπονείται μόνος του, με τους Θεσσαλονικείς να ψάχνουν τον τρόπο να λύσουν τη συνεργασία τους μαζί του. Από την πλευρά του πάντως, ο Τζαμαϊκανός φορ με ανάρτησή του στο Instagram έστειλε μήνυμα προσωπικής ανάκαμψης. « Βάζω τα γόνατα στο στήθος και σηκώνομαι ξανά» , έγραψε χαρακτηριστικά, με τον άλλοτε συμπαίκτη του στους «κίτρινους», Μπράιαν Νταμπό να σχολιάζει: «Το κεφάλι ψηλά πάντα».","pubDate":"2023-08-05 18:47:21","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Ατρόμητος-ΟΦΗ 2-2: Από ένα ημίχρονο με γκολ και θέαμα","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244298/atromitos-ofi-2-2-apo-ena-imihrono-me-gkol-kai-theama","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Ατρόμητος Αθηνών","ΟΦΗ","Νότης Χάλαρης"],"creator":null,"video_url":null,"description":"Ατρόμητος και ΟΦΗ αναμετρήθηκαν στο Ελ Πάσο της Καλλιθέας σε φιλική αναμέτρηση, όπου οι Περιστεριώτες προηγήθηκαν με 2-0 αλλά οι Κρητικοί ανέτρεψαν το σκορ στο τελικό 2-2.","content":"Αν και ο Ατρόμητος αιφνιδίασε τον ΟΦΗ στα πρώτα 15 λεπτά, οι Κρητικοί βρήκαν τον τρόπο να γυρίσουν το ματς στο τελικό 2-2. Στο γήπεδο βρέθηκε και ο πρόεδρος του ΟΦΗ, Μιχάλης Μπούσης . Αμφότερες οι δύο ομάδες μπήκαν δυναμικά στο παιχνίδι, με τον ΟΦΗ να έχει την πρώτη καλή στιγμή στο 3ο λεπτό, όταν ο Φελίπε πήρε την κεφαλιά αλλά η μπάλα πήγε άουτ. Η απάντηση του Ατρομήτου ήταν ένα σουτ του Ντε Μποκ που πήγε άουτ δύο λεπτά αργότερα όμως από το 10' και μετά, οι Περιστεριώτες αιφνιδίασαν τους Κρητικούς. Στο 14' ο Γιουμπιτάνα βρήκε χώρο, έφερε την μπάλα στο αριστερό και με σουτ νίκησε τον Χριστογεώργο για το 1-0 του Ατρομήτου. Η αυτοπεποίηθηση από το γκολ φάνηκε λίγα δευτερόλεπτα μετά, όταν ο Ρομπάιγ βγήκε τετ-α-τετ με τον Έλληνα πορτιέρε και με πλασέ έκανε το 2-0 για τους Περιστεριώτες. Όπως ήταν λογικό, ο ΟΦΗ άργησε να αντιδράση σε αυτά τα δύο γρήγορα γκολ όμως βρήκε τον δρόμο για μείωση του σκορ στο 41' όταν ο Μπάκιτς έκλεψε την μπάλα, έδωσε στον Μπιφουμά και αυτός με εξαιρετικό τελείωμα έκανε το 2-1 που ήταν και το τελικό σκορ του πρώτου μέρους. Στο δεύτερο 45λεπτο οι δύο ομάδες δεν κλείστηκαν στην άμυνα τους και προσπάθησαν να βρουν το γκολ έχοντας αμφότερες σημαντικές φάσεις για να το καταφέρουν. Ο Έρλινγκμαρκ στο 51' βρέθηκε σε καλή θέση στην περιοχή αλλά το σουτ πήγε άουτ ενώ ο Φελίπε προσπάθησε να απειλήσει με σουτ στη συνέχεια για τον ΟΦΗ αλλά η μπάλα κόντραρε στα σώματα. Οι μαζεμένες αλλαγές στο 59' και από τις δύο ομάδες έριξαν λίγο τον ρυθμό αλλά οι φάσεις συνεχίστηκαν. Τελικά οι Κρητικοί ήταν εκείνοι που βρήκαν τον δρόμο προς την ισοφάριση, όταν έφυγαν στην αντεπίθεση και ο Νέιρα με εξαιρετικό πλασέ νίκησε τον αντίπαλο πορτιέρε στο 79' για το 2-2. Στο 87' ο Αποστολάκης είχε μεγάλη στιγμή για να ολοκληρώσει την ανατροπή του ΟΦΗ μετά τη σέντρα του Θοράρινσον αλλά το πλασέ του πήγε πάνω από τα δοκάρια. Εν τέλει το σκορ δεν άλλαξε με τις δύο ομάδες να προσφέρουν γκολ, θέαμα και υποσχέσεις ενόψει της σεζόν. ΟΦΗ : Χριστογεώργος, Πασαλίδης (Βούρος 63'), Λαμπρόπουλος (Καρώ 63'), Αμπάντα (Θοράρινσον 63'), Λάρσον (Γκρόνινγκ 77'), Μεγιάδο (Νέιρα 70'), Μπάκιτς (Γιαννούλης 63'), Τοράλ (Αποστολάκης 63'), Ριέρα (Νέιρα 70'), Μπιφουμά (Μοσκέρα 63'), Φελίπε (Ντίκο 63') Ατρόμητος : Τσιντώτας, Κεσχρίντα, Ντε Μποκ, Τσακμάκης, Ασεβέδο, Έρλινγκμαρκ (Καραμάνος 70'), Γκονζάλες, Φριτζόνσον, Ρομπάιγ, Βέργος, Γιουμπιτάνα (Ντιρκς 52')","pubDate":"2023-08-05 18:40:53","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability","link":"https://www.dailymail.co.uk/sport/football/article-12374249/Jurgen-Klopp-learned-summers-unbalanced-preseason-Liverpool-look-fitter-sharper-HAPPIER-result-Reds-ready-new-campaign-despite-showing-occasional-vulnerability.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LEWIS STEELE IN SINGAPORE: It was in this south-eastern corner of Asia a year ago that Jurgen Klopp started to realise things weren't right at Liverpool after being thrashed by Man United.","content":"Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability Liverpool are almost ready for the start of the new Premier League season Management have learned their lessons from a torrid pre-season last year Boss Jurgen Klopp has transformed his team into a happier and fitter side By Lewis Steele For Mailonline Updated: 14:37 EDT, 5 August 2023 e-mail View comments It was in this south-eastern corner of Asia a year ago that Jurgen Klopp started to realise things weren't all right at Liverpool . Having been thrashed 4-0 by Manchester United in Bangkok, the Reds then jetted to Singapore for a quick jaunt that ended with injuries to several key men. Though they beat Crystal Palace there, Klopp struggled to find a balance between giving players significant rest after a gruelling 63-game 2021-22 season and giving them ample match time to get up to speed ahead of the new campaign. Liverpool did not find that balance. And so by the time the Reds were home the 14,000-mile round trip to Asia, they were left underprepared after a truncated pre-season. They then went to Austria for an intensive fitness camp but it always felt like they were playing catch-up. They never did catch up. 'Would I do anything differently in pre-season? I wouldn't spend the first week (of pre-season) in Asia,' said Klopp in January. The German and his management team blamed the hectic summer camps for a dreadful start to the season that saw them win just four of the first 10 games. But Klopp has learned lessons from last summer, and this pre-season has looked a lot different. Though Liverpool showed tactical and defensive vulnerabilities against Leicester and Bayern Munich here, the squad looks sharper, more focused and generally happier. Jurgen Klopp has been busy getting his Liverpool stars ready for the new campaign on their pre-season tour of Singapore Liverpool look a happier and fitter team to the side that struggled in pre-season last year Liverpool have only played in Singapore as opposed to travelling around Asia like they did last year Instead of a two-leg tour of Asia including a trip to Thailand, Liverpool jetted to just one destination this time around. To quash fears of tiredness and jet lag in Singapore, Klopp instructed his players and staff to follow a fake timezone. Though Singapore is seven hours ahead of the UK, Liverpool set their watches to just three hours ahead. One afternoon when arriving at the plush Ritz Carlton hotel where the Reds stayed, Mail Sport noticed one Liverpool player's phone displayed the time of 8.25am when it was actually 12.25pm. It meant Liverpool often sat down for team meals past midnight local time. Though the hotel was crawling with local autograph-hunters and kids trying for selfies - or wefies as they are called in these parts - Liverpool commandeered the 17th floor, with breathtaking views of the Singapore skyline, the futuristic Marina Bay Sands and Formula One track. Karaoke and table tennis tournaments were commonplace in the hotel. Mo Salah is the king of ping-pong and has a backhand nearly as good as his left foot on the football pitch. Defenders Ibou Konate and Andy Robertson are the class clowns. Robertson and his 'co-host' Salah conducted a series of fun assignments during down time, with them setting each other a series of undercover tasks. The pair frequently gatecrashed other players' commercial or media duties, while the Scotsman told a series of 'crap jokes'. 'What did the drummer call his twin daughters?' asked Robertson. 'Anna one, Anna two!' Trent Alexander-Arnold lamented Robertson's gag as awful but came to his rescue later to help his sidekick complete the challenge of winning a point off Salah at table tennis. Konate polled the team's favourite song, which ranged from many hip-hop beats such as Travis Scott and Drake, to Alexis Mac Allister's love for Latin American tunes, to Ayrshire starlet Ben Doak's favourite Gerry Cinnamon anthem, Belter. To quash fears of tiredness and jet lag in Singapore, Klopp (middle right) instructed his players and staff to follow a fake timezone Newly-appointed vice-captain Trent Alexander-Arnold (pictured) has played a key role in Liverpool's pre-season plans Liverpool have been undergoing a series of team-building activities during their time in Singapore These team-building activities are crucial to Klopp, though it wasn't all fun and games. Liverpool trained three times a day and striker Cody Gakpo told Mail Sport earlier this week that the non-matchday routine was, 'wake up, train, eat food, train, rest a bit, train'. Liverpool also flew out a group of club legends to Singapore, with the main aim of easing the burden on the players to fulfil media and commercial obligations. Instead, the likes of Lucas Leiva, Gary McAllister, John Barnes, John Aldridge and Ian Rush took the strain. New captain Virgil van Dijk has been crucial to helping new signings settle in Players such as Mohamed Salah (right) have been mobbed by fans wanting pictures and autographs in Singapore New boys Mac Allister and Dominik Szoboszlai have settled in nicely, with new captain Virgil Van Dijk crucial to that amid the unplanned exit of Jordan Henderson. It was also a solid tour for Diogo Jota and Luis Diaz, both of whom missed large chunks of last season injured. Gerry Cinnamon fan Doak is, to use the lyrics of his favourite song, different from the rest. The 17-year-old, who signed from Celtic for £600,000 last year, has experienced a meteoric rise and the speedy, direct winger has done his first-team chances no harm on this tour. Doak's agent is former Celtic legend Jackie McNamara, and the former Ayr United kid is said to have shown an innate desire to win from a young age while he treats every match the same, be it a kick-about back north of the border or playing alongside Liverpool's heavyweights. Liverpool will play in the Europa League this season and it could be a blessing in disguise The fact that Liverpool will play in the Europa League this season could be a blessing in disguise for some youngsters. It is hard to see Klopp risking Salah, Alexander-Arnold and Van Dijk in deepest, darkest eastern Europe on a Thursday night, so some openings might occur. Young box-to-box midfielder Bobby Clark has big admirers at Anfield, while James McConnell played well in the No 6 role in Singapore. Jarell Quansah could get some minutes as a back-up defender, while right-back Conor Bradley is well liked despite a recent injury. All of this means Klopp and Co boarded the long-haul flight back to Merseyside in much better shape than this time last year. Liverpool had an extra 14 days of pre-season this year compared to last, with no international tournament or Community Shield to play. Assistant manager Pep Ljinders refers to pre-season as a 'trampoline' for a good campaign in his diary book Intensity and, though this was hardly a bungee jump start, Liverpool can take plenty of positives from the trip to Singapore as a springboard for success in the new season. Share or comment on this article: Jurgen Klopp has learned from last summer's unbalanced preseason and Liverpool look fitter, sharper and HAPPIER as a result... the Reds are ready for the new campaign despite showing occasional vulnerability e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-05 18:37:10","image_url":"https://i.dailymail.co.uk/1s/2023/08/04/19/73977507-0-image-a-2_1691173654779.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bears sign 39-year-old tight end Marcedes Lewis to 1-year contract","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/05/bears-sign-39-year-old-tight-end-mercedes-lewis-to-1-year-contract","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. The 39-year-old Lewis — entering his 18th season — gives […]","content":"LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. Read this article for free: Already have an account? To continue reading, please subscribe: * LAKE FOREST, Ill. (AP) — The Chicago Bears signed veteran tight end Marcedes Lewis to a one-year contract on Saturday. The 39-year-old Lewis — entering his 18th season — gives the Bears a blocking tight end to complement Cole Kmet and help protect quarterback Justin Fields. He spent the past five years with Green Bay after playing his first 12 with Jacksonville. The 6-foot-6, 267-pound Lewis has 432 receptions for 5,084 yards and 39 touchdowns over 251 games and 221 starts. He is one of three tight ends, along with Tony Gonzalez and Jason Witten, with at least 200 regular-season starts and 400 receptions. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-05 18:35:50","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"Παναιτωλικός: Ο Μπαλντασάρα μπήκε στο αεροπλάνο για την Ελλάδα (vid)","link":"https://www.gazzetta.gr/football/stoiximan-superleague/2244297/panaitolikos-o-mpalntasara-mpike-sto-aeroplano-gia-tin","keywords":["Ποδόσφαιρο","Stoiximan Superleague","Παναιτωλικός","Newsroom"],"creator":null,"video_url":null,"description":"Ο Φράνκο Μπαλντασάρα που θα συνεχίσει στον Παναιτωλικό ξεκίνησε το ταξίδι του για την Ελλάδα, με σκοπό να ενσωματωθεί στα «καναρίνια».","content":"Αντίστροφα μετρά πλέον ο χρόνος ώστε ο Φράνκο Μπαλντασάρα να γίνει παίκτης επίσημα παίκτης του Παναιτωλικού , καθώς ο Αργεντινός χαφ έχει συμφωνήσει με τα «καναρίνια» και θα αποκτηθεί ως δανεικός από την Πλατένσε (στο Αγρίνιο θα διατηρούν buy in για το 50% των δικαιωμάτων του). Ο 25χρονος μπήκε πριν από λίγο στο αεροπλάνο για προορισμό την Ελλάδα και τις επόμενες ώρες θα ενσωματωθεί στα «καναρίνια».","pubDate":"2023-08-05 18:35:05","image_url":null,"source_id":"gazzetta_gr","category":["sports"],"country":["greece"],"language":"greek"},{"title":"Brad Lyons rocks Rangers as Michael Beale already playing Celtic catch up after opening day shocker - 3 talking points","link":"https://www.dailyrecord.co.uk/sport/football/football-match-reports/brad-lyons-rocks-rangers-michael-30636886","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (David McCarthy)"],"video_url":null,"description":"There was so much hype around the new-look Light Blues but it went horribly wrong in Ayrshire.","content":"Brad Lyons celebrates making it 1-0 Kilmarnock (Image: SNS Group) Get the latest Rangers news from Record Sport with our daily newsletter. More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Rangers news from Record Sport with our daily newsletter. Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Rangers are playing catch-up on Celtic after only 90 minutes as Kilmarnock deservedly took all three points at Rugby Park. Derek McInnes’ men outfought a lacklustre Gers outfit, who had five summer signings in their starting X1 and never looked comfortable against combative Killie, who snatched the winner through Brad Lyons midway through the second half after a John Souttar blunder. Michael Beale brought Connor Goldson straight back into the fold despite not playing any part in the pre-season build-up but there was a surprise further forward with Todd Cantwell starting on the bench alongside latest arrivals Danilo and Jose Cifuentes. As expected, the visitors had plenty of possession in the early stages, but little penetration and a couple of Borna Barisic crosses were pulled out of the air confidently by Will Dennis in the Killie goal. McInnes’ men began to impose themselves and were enjoying a spell on top when Abdallah Sima sprung the previously anonymous Cyriel Dessers on the counter attack, Ex-Gers kid Lewis Mayo got back to make a great challenge and wasn’t to know a late flag had gone up for offside against the Nigeria international. Read More Related Articles Kilmarnock 1 Rangers 0 LIVE reaction as Michael Beale stunned by Brad Lyons Rugby Park winner Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings It took Rangers 37 minutes to force Dennis into proper action, the keeper doing well to dive at Dessers’ feet to prevent him stabbing home a James Tavernier corner. The Killie keeper came out on top against the same player five minutes from the break, diving to smother his left foot drive after a Sima cutback had opened up the space. The second period followed the same pattern, only coming to life on the hour mark when Dowell saw a shot deflected on the roof of the net. It was the Englishman’s last contribution as he and Dessers were switched for Cantwell and debutant Danilo. Cyriel Dessers tries to get a shot away during a cinch Premiership match between Kilmarnock and Rangers (Image: SNS Group) But before either had broken sweat, their team was a goal behind as Killie struck through Lyons. A throw into the box from David Watson landed between John Souttar’s legs and as he dallied, the midfielder pounced to lash past Butland from eight yards. Butland kept his side in it with a fine save from Kyle Magennis’ long range effort in the 69th minute as Killie went for the jugular. Rangers huffed and puffed in the closing stages but never looked like rescuing even a point. Here's three talking points from Rugby Park. Del's boys go in for the Kil First things first, Killie deserved it. They were hungrier, brighter and in spells played very good football. Their fans can look forward to the season with genuine optimism after this display. Kilmarnock Manager Derek McInnes (Image: SNS Group) Solid at the back, industrious in midfield and in Kennedy and Armstrong have two aggressive, mobile attackers who will work around Watkins or Vassell. New boys must get up to speed - and fast Players like Sam Lammers, and Cyriel Dessers will now know far more about Scottish football and if they are smart they won’t produce many more lifeless, insipid displays like this one. Kieran Dowell might well have been the least heralded of Rangers’ new arrivals but he was the most impressive with a decent display for the hour he was on the pitch. Heat is on Gers already It’s only day one but Rangers will have to improve and pronto. They played like a team still getting to know each other and for most of the game lacked the urgency needed to get results at away grounds in the Premiership. Their next two league games against Livingston and Ross County must be won before they face Celtic on September 3. Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Rangers FC Scottish Premiership Kilmarnock FC Derek McInnes Michael Beale John Lundstram","pubDate":"2023-08-05 18:20:07","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30637614.ece/ALTERNATES/s615/0_Kilmarnock-v-Rangers-Cinch-Premiership.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"}]}