{"newsArray":[{"title":"Matildas champion Caitlin Foord’s decade-long regret she’s ready to set right at FIFA Women’s World Cup 2023","link":"https://7news.com.au/sport/fifa-womens-world-cup/matildas-champions-retrospective-wish-ahead-of-insane-fifa-womens-world-cup-moment-in-australia-c-10864270","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"Caitlin Foord has opened up on the enormous moment she took for granted - and how she’s ready to set it right.","content":"It’s a strange thing for Caitlin Foord to admit, given the enormity of her feat, but the Matildas star can honestly say she “didn’t really know what the World Cup was” when she made her debut at just 16 years old. Now, over a decade later, the 28-year-old is more than aware as she enters her fourth as one of Australia’s leading players alongside Sam Kerr. Foord shapes as one of the team’s most important players for the upcoming tournament, which the Aussies will host for the first time ever. It will be a watershed moment for women’s football — and football in general — in the country, giving aspiring footballers the chance to see live what few other kids around the globe will ever have the privilege of seeing. “It’s going to be insane. I wish when I was growing up, I had something like this to go watch and support. But I think it will change the game in Australia, and I hope we can play a massive part in that,” Foord tells 7NEWS.com.au. “I remember going to my first one (in 2011) and, to be honest, I didn’t really know what the World Cup was. I mean, I did — I knew I was going to it, but I didn’t know how big that stage was and I guess I didn’t really take it all in. “I was just having fun with my mates. I didn’t even really think that much into the football side of things. I guess I took it for a little bit for granted, but that’s at a young age and I was just so carefree and going through the motions. “Now I know what’s at stake and I know the importance of it and I know what it could do for us as a team. It could change the whole outlook on the sport.” The Aussies enter the global marquee event sitting 10th in the FIFA women’s rankings and a genuine title contender, a label few Matildas teams have earned in the history of the tournament. They have reached the quarter-finals on three separate occasions (2007, 2011 and 2015) but never made it any further. Foord played in two of those, as well as the 2019 campaign, but she feels this time it’s different. “In the past at the World Cup, we’ve gone out in the quarter-finals and it’s been disappointing because we do feel like we have deserved more as a team,” the Arsenal player says. “With the core group we have had for many years now, this feels like it’s our time. And most of our players are at their peak or in their best form. “Our hopes going into a World Cup are always to make it to the final and to have the opportunity to lift the trophy. But it’s going to start with one game at a time and not getting too far ahead of ourselves.” But even with few of the team’s key players on the wrong side of 30, Foord concedes the stars are aligning for Australia to lift the trophy this year. “This definitely does feel like the time to do it, if we’re going to do it,” she says. “It feels like we have a massive opportunity in front of us and we we don’t want to miss out on it. Not many people will get to say they’ve played a World Cup at home, so I think I want to just to enjoy that moment and take it all in.” Playing in front of friends and family is a privilege the Matildas have worked long and hard for over decades. And Foord, one of the most senior figures in Australian football, knows that as well as anyone. “The push for securing the World Cup on home soil started a long time ago; it’s been a long process and we’ve all kind of been along for that journey and the excitement and the hype,” Foord says. “It feels like ages ago now that we were told that we’ll be hosting it. So, it feels a bit weird to know that it is so close. “To be honest, I can’t really wrap my head around it; that the World Cup is gonna be at home, but hopefully everyone’s all fit and healthy and walking out to that opening game. Not until then will it hit that it feels real, that this is actually a World Cup on home soil with our friends and families in the stadium and fans. “It’s going to be a massive moment for women’s football, and football in general in Australia, and around the world as well. “I don’t think an opening game has been that big before — it’s insane to think about. I do think that’s going to be a game-changing moment and hopefully that continues throughout the tournament for the rest of our games in the group stage and beyond that as well. “It’s hard not to let your mind wander to that moment. But also there’s there’s a lot to be done before then. “So yeah, it’s definitely going to be one to remember and a special one and I guess that’s why we want to make the most of it. We need leave no stone unturned along the way.”","pubDate":"2023-06-16 23:00:00","image_url":"https://images.7news.com.au/publication/C-10864270/e20433de6e98048b53005c89d9ee0f9e927caffa-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Bosso in turmoil… Auditors quit amid threats, tensions","link":"https://www.chronicle.co.zw/bosso-in-turmoil-auditors-quit-amid-threats-tensions/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Ricky Zililo ricky.zililo@chronicle.co.zw HIGHLANDERS Football Club is facing a crisis that threatens its reputation and financial stability. Recent events have unfolded, leading to the resignation of the club’s auditors, PNA Chartered Accountants, Saturday Chronicle can exclusively reveal. PNA Chartered Accountants’ decision comes in the wake of escalating tensions and disagreements within the club’s leadership, with […]","content":"The Chronicle HIGHLANDERS Football Club is facing a crisis that threatens its reputation and financial stability. Recent events have unfolded, leading to the resignation of the club’s auditors, PNA Chartered Accountants, Saturday Chronicle can exclusively reveal. PNA Chartered Accountants’ decision comes in the wake of escalating tensions and disagreements within the club’s leadership, with the executive committee and the board engaging in a bitter dispute. The auditors, unwilling to have their professional image tarnished, chose to sever ties with the club rather than compromise their integrity. Insiders within Highlanders have confirmed the resignation of the auditors and shed light on the circumstances that led to this drastic step. It appears that the auditors became increasingly disillusioned with the work environment, citing strained relations between the executive and the board as a primary concern. In fact, the auditors even revealed that they had been threatened with termination during the audit process, a troubling development that cast doubt on their ability to perform their duties impartially. Moreover, the auditors suspected a potential conspiracy to manipulate information provided to them during the audit. This discovery further eroded their trust in the club’s management. They were also dismayed by the lack of interest in implementing their recommendations, particularly in establishing proper structures within the club. Faced with these challenges, the auditors felt compelled to part ways with Highlanders and urged the club to seek alternative auditors for future financial assessments. During the presentation of the audited financial statements, the auditors highlighted the delayed completion of the audit, which could have been finalised as early as January. However, the club’s treasurer, Busani Mthombeni, had postponed the process, starting it only in October of the previous year. The auditors said commencing the audit earlier would have resolved numerous issues and expedited the reporting process. Earlier in January, Highlanders had conducted their annual general meeting without presenting the financial report, as a disagreement arose between the club and the auditors regarding the reporting currency. While the club had prepared the financial statements in local currency, the auditors insisted on using foreign currency, considering the majority of Highlanders’ transactions were conducted in US dollars. This disagreement further strained the relationship between the auditors and the club. Throughout the audit, the auditors faced threats of termination due to their insistence on presenting the financial statements in foreign currency. Undeterred, they remained steadfast and resolute, emphasising their commitment to fulfilling their responsibilities and preserving their professional credibility. Consequently, upon completing the audit, the auditors issued an adverse opinion on Highlanders’ financials, effectively conveying their inability to endorse the authenticity of the club’s financial statements. This adverse opinion casts a negative light on the institution and raises concerns among stakeholders, including sponsors, who may question the club’s financial stability and reliability. In addition to their adverse opinion, the auditors flagged several issues during the audit process. They discovered transactions that lacked supporting documentation, prompting the club’s finance department to retrieve the necessary records. These findings further exacerbated the auditors’ concerns and contributed to their adverse opinion. The auditors expressed the need for Highlanders’ accounting department to enhance its capacity and understanding of modern auditing practices. They encouraged the club to establish an independent internal audit team that would oversee the accounts throughout the year, providing an additional layer of checks and balances. One particular area of concern highlighted by the auditors was the club’s inability to properly account for funds raised by supporters’ chapters. The auditors discovered that some funds, raised on behalf of Highlanders, were being held by a chapter within the club. Such discrepancies raise questions about the club’s financial management and transparency. Additionally, the auditors noted inconsistencies in the recording of cash collected at the clubhouse and when recorded at Highlanders’ offices, despite the close proximity of these establishments on Robert Mugabe Way, a mere four streets apart. These discrepancies in cash handling added to the auditors’ apprehension and underscored the need for improved financial controls within the club. The auditors believed that implementing an internal audit process would help mitigate these issues and ensure greater accuracy and accountability in financial reporting. With their departure, Highlanders now faces the arduous task of investigating the financials and seeking to obtain a more favourable opinion to restore stakeholders’ confidence. This includes sponsors who may view the club as a less secure investment opportunity given the adverse opinion issued by the auditors. The resignation of the auditors serves as a wake-up call for Highlanders, highlighting the urgent need for improved governance, transparency, and financial management within the club. It is imperative for the executive committee and the board to address their differences and establish a harmonious working relationship that prioritizes the club’s long-term success and reputation. Repeated efforts to get comment from Highlanders were fruitless, with club spokesperson Nozibelo Maphosa saying she was waiting for the chief executive officer Ronald Moyo who in turn said he was yet to get a response from his superiors. @ZililoR","pubDate":"2023-06-16 22:04:18","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gabriel Nyoni wants to play football again","link":"https://www.chronicle.co.zw/gabriel-nyoni-wants-to-play-football-again/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Innocent Kurira kuriralnnocent@gmail.com “The pain is excruciating,” Gabriel Nyoni cried, his voice filled with desperation, as he stood on the precipice of uncertainty. These were the moments before he would enter the operation room, prepared to undergo foot surgery that was necessary after a devastating injury he sustained during a GladAfrica Championship match against Richards […]","content":"The Chronicle “The pain is excruciating,” Gabriel Nyoni cried, his voice filled with desperation, as he stood on the precipice of uncertainty. These were the moments before he would enter the operation room, prepared to undergo foot surgery that was necessary after a devastating injury he sustained during a GladAfrica Championship match against Richards Bay in February 2021 at the Umhlathuze Sports Complex Grounds in Richards Bay. As he uttered his plea, Nyoni’s prayers seemed to be answered. The surgery was successful, but the doctor delivered a sobering revelation. If the surgery had been delayed even slightly, Nyoni’s leg might have faced amputation due to compartment syndrome. At first glance, Nyoni’s leg injury appeared to be a minor setback. However, it posed a significant threat to his career. The speedster had suffered severe fractures in his foot, necessitating the use of wires and pins to stabilise the bones. Doubt shrouded Nyoni’s return to the field of play. Injuries have long been considered the ultimate adversary for athletes, prematurely ending numerous promising careers. Yet, Nyoni is among the courageous few who refuse to succumb to such a fate. He is determined to make a comeback after this grave injury, following in the footsteps of players like Shacky “Master Goals” Tauro, Johannes Ngodzo, Samson Choruwa, and Desmond “Gazza” Maringwa, whose own careers were destroyed by injuries. “Life is unpredictable,” Nyoni reflects, his voice tinged with wisdom. “Today, you may have grand plans to become one of the best soccer players of your generation, and tomorrow, you find yourself waking up in a hospital, facing the possibility of amputation. Life, whether good or bad, simply happens. It reminds me of the story of Job in the Bible.” Although the doctors have confirmed that his foot has fully recovered, there remains a risk in playing with it. The final decision lies with Nyoni himself. “Truthfully, I didn’t retire on my own terms, and it continues to bother me to this day,” Nyoni confides. “I would love to retire on my own terms. My business now runs smoothly without my constant presence, so I feel I can play more freely. I believe I have two or three more years, and then I will call it a day.” Having expressed his eagerness to return to the field of play, Nyoni holds no specific destination in mind. “Wherever a team is willing to give me an opportunity to revive my career, that’s where I’ll go. Of course, my former teams like Highlanders and CAPS United hold a special place in my heart, so they are my first preferences,” Nyoni reveals. While adversity has marked Nyoni’s journey, he has not allowed misfortune to define him. He ventured into the perfume manufacturing business, crafting 100 percent undiluted, long-lasting oil-based perfumes inspired by renowned designer brands. It was a new chapter in his life that began when he left Highlanders to join CAPS United in 2019, then moved to Maritzburg United in South Africa before ultimately finding himself with Cape Umoya in the GladAfrica Championship. @innocentskizoe","pubDate":"2023-06-16 22:03:57","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"The remarkable journey of Chamunorwa Maphosa and Makokoba Tigers FC","link":"https://www.chronicle.co.zw/the-remarkable-journey-of-chamunorwa-maphosa-and-makokoba-tigers-fc/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Lovemore Dube lovemore.dube@chronicle.co.zw SO many real heroes live in our midst but are rarely celebrated for unearthing gems that the country has celebrated on the field, courts, tracks and roads in Zimbabwean sport. Beginning today Saturday Chronicle will run a weekly column that seeks to unearth those community and sport champions that you don’t know […]","content":"The Chronicle SO many real heroes live in our midst but are rarely celebrated for unearthing gems that the country has celebrated on the field, courts, tracks and roads in Zimbabwean sport. Beginning today Saturday Chronicle will run a weekly column that seeks to unearth those community and sport champions that you don’t know but built the foundation of many a star. Today we feature little known Chamunorwa Maphosa of Makokoba Tigers FC, a team with juniors who play in the Bulawayo Province Junior Soccer League. Despite handling the likes of Nqobizitha Masuku and Godfrey Makaruse both of whom have made names for themselves in Zimbabwe football, Maphosa is among thousands whose great work was hijacked. This came by after their products’ brilliance got a platform to be amplified elsewhere. Not every good player started at Highlanders, AmaZulu, Bulawayo Wanderers, Railstars and Zimbabwe Saints. There are so many relatively obscure clubs and individuals like Maphosa who crafted the script that made Peter Ndlovu, Honour Gombami, Thulani Ncube, Zenzo Moyo, Thabani Moyo, Thabani Masawi and Innocent and Rahman Gumbo who have seen recognition elude them. Touched by seeing some boys from his EmaTongeni neighbourhood of Makokoba Flats, Maphosa decided promptly to save them. “I could not stand seeing the boys arrested regularly for stealing minor stuff like shoe polish. What touched me most was that a stone’s throw at the Lobengula Street Park, there would be some of their colleagues playing near Gertrude Hostel I then set it upon myself to have the boys playing there regularly. That gave birth to Makokoba City Warriors. “We started in Division Three and we were promoted up to Division One. We have produced players like Nqobizitha Masuku who now plays in Botswana and Highlanders’ Godera, Godfrey Makaruse. There are so many like Matriples Muleya who is at Triangle, Nickson Gama who is at Bulawayo Chiefs, Brendon Mpofu who is at Dynamos, Gillian Nyathi, Darlington Munkuli and Prince Ndlovu who are at Highlanders,” said Maphosa. Maphosa, 70, said eight players were this year released to Highlanders FC’s development side who in return gave them 10 soccer balls. “We are happy to see our local club that I support Highlanders FC getting our players. We are doing a great job of ensuring that our teams do not buy players from elsewhere but use home grown talent,” said Maphosa. Raising a child, Maphosa says, is a community responsibility hence his efforts of trying to develop very positive youngsters from Makokoba. “In the community I always try to ensure our children are kept occupied and with high moral values. Now I’m playing the overseer role, there is Wilton Kwenda my former player standing in as coach. Whenever there are disciplinary issues I do not hesitate to come and deal with it even to an extent of tearing the youngster’s Zifa licence. Discipline is a foundation pillar for my boys, that is why I came to work with them even sacrificing going to church just to be with the team,” said Maphosa. As a community builder, he said it is ever painful at times plucking a boy who is a bad influence out of the group as soccer teams are a small society expected to correct wayward characters. “It pains to tell the boy to go home or join another club. We are parents, it is our failure so we have to correct some of these kids early,” said Maphosa whose football team is based at Thabiso Youth Centre where they moved to from the Lobengula Street Park as City Warriors before changing to Tigers. He said changing to Tigers FC was forced by financial challenges. “That has been our biggest challenge in the last 23 years. We have no steady sponsorship, we rely on donations from members of our community with Rambo Milo, Ngoni Nyakudziwanza, Shadreck Sibanda, James Sithole and one Ossie from South Africa keeping us going. “We are dreaming big, we need sponsorship for the boys. Our approach is two-fold, we want them kept away from crime and at the same time pave their paths towards playing as professional footballers. Some have gone through our systems in the past 23 years and gone all the way to stardom,” said Maphosa. He recalls Methembe Ndlovu, the former Highlanders midfielder and coach, coming to Thabiso and talking to them under a tree on the northern tip of the field at Thabiso. “Methembe said there was something happening that he needed Nqobizitha Masuku for, the rest is history, the boy never came back and rose to one of the best players around through Bantu Rovers,” said Maphosa. He bemoaned big clubs’ bullying tactics where they get talent from small teams and do not compensate. “We make stars. Appreciate us, invest in us and we will give you more and don’t forget to acknowledge where you tapped from,” said Maphosa who in his younger days played for Matabeleland High City alongside Albert “Ali” Dube when he arrived from Buhera in 1974. Maphosa also played for Chronicle FC in Division One alongside Joshua Mutize and Gibson Bhinya. With support, these obscure football projects can achieve more and the coaches and officials running the teams are sport’s unsung heroes. Most of those hogging the limelight found stars ripe and ready and simply provided a platform to be the national and international showcase.","pubDate":"2023-06-16 22:01:23","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Colorado football coach Deion Sanders might have to have left foot amputated","link":"https://helenair.com/sports/college/colorado-football-coach-deion-sanders-might-have-to-have-left-foot-amputated/article_7bb28f83-8a05-5d36-965b-7a7ac654b8e7.html","keywords":null,"creator":["Associated Press"],"video_url":null,"description":"New University of Colorado head football coach Deion Sanders faces the possibility of having his left foot amputated as a result of continuing bloodflow issues. Sanders had two toes amputated from his left foot in 2021 while he was coaching…","content":"Deion Sanders might lose his left foot as a result of circulation issues that forced him to have two toes amputated in 2021. Sanders allowed camera crews with \" Thee Pregame Show \" to film a meeting with his medical team at the University of Colorado, where he’s preparing for his first season as head football coach. In at 11-minute segment released Friday on YouTube, Sanders met with orthopedic surgeon Dr. Ken Hunt, vascular surgeons Dr. Donald Jacobs and Dr. Max Wohlauer and athletic trainer Lauren Askevold to discuss his daily pain levels and possible next steps. “You just have to understand what the risks are. Things can cascade,” Jacobs said, adding that Sanders might not just lose another toe but \"he could lose the foot.” “Well, I know what risks are,\" Sanders replied. “I only have eight toes. So, I’m pretty sure I understand.” Sanders said he has no feeling on the bottom of his left foot and said if a procedure is recommended he wants to get it done right away because once the season starts he'll too busy. “I want to do it this summer because when we get rolling, I’m not going to have time to do it,” Sanders said. “This is the best downtime I have.” Sanders missed three games at Jackson State in 2021 after having two toes amputated during the season. Sanders took over the downtrodden Buffaloes program in December following Colorado's 1-11 season in 2022. His hiring has led to a resurgence of interest in the program that's had just two winning seasons since 2016, one of those was a 4-2 mark during the pandemic season of 2020. The Buffs sold out their spring game in April and has sold out its season ticket allotment for the first time in nearly three decades. Colorado opens at TCU on Sept. 2 and hosts former Big 12 rival Nebraska a week later at Folsom Field.","pubDate":"2023-06-16 21:52:00","image_url":"https://bloximages.chicago2.vip.townnews.com/helenair.com/content/tncms/assets/v3/editorial/3/61/36101750-ea67-59f4-8c3e-4b1b1de58d56/648cdaf172ecb.image.jpg?resize=300%2C200","source_id":"helenair","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Warren's Terence Roberson has good showing at UA","link":"https://www.nwahomepage.com/sports/pig-trail-nation/hogville-hog-recruiting/warrens-terence-roberson-has-good-showing-at-ua/","keywords":["Hogville, Hog Recruiting","Pig Trail Nation"],"creator":["Otis Kirk"],"video_url":null,"description":"Warren offensive lineman Terence Roberson was among the top campers at Arkansas on Friday.","content":"Photo by Otis Kirk. by: Posted: Updated: FAYETTEVILLE — Warren Class of 2024 offensive lineman Terence Roberson was among the top standouts at Arkansas’ football camp on Friday. Roberson, 6-4 1/2, 292 (both without shoes), owns a 3.95 grade-point average and showed on Friday he has the talent to play at high level in college. “It went good today,” Roberson said. “I learned a lot. It’s a great experience. I came here last year and also learned a lot. It’s a really good atmosphere here and I enjoy it a lot.” Sam Pittman, Arkansas’ head football coach, is a former offensive line coach. That appeals to Roberson. “I think he has done a great job here at Arkansas,” Roberson said. “He loves O-line and I like that about him too. I think he’s going to do a whole more in the future.” Roberson worked with Cody Kennedy on Friday. Kennedy is Arkansas’ offensive line coach. “Last year I learned a lot from him too,” Roberson said. “Great coach. He (his personality) reminds me of our O-line coach.” Roberson has offers to UAPB and Arkansas-Monticello. What would an offer to Arkansas mean to you? “It would mean a lot,” Roberson said. “Whole bunch of guys from my town have came here and gone to the NFL. So I think it would be a great feeling.” Roberson said the area where he needs to make the most improvement is his foot work. He also talked about his strengths on the field. “Just pushing through and trying to get better,” Roberson said. Roberson comes from a program that’s very well-coached and competitive each season. He talked about playing for the Lumberjacks. “It’s a great feeling,” Roberson said. “We have a good support system. We just go out there and work everyday and do the best we can.” He talked about how good Warren can be this fall and his goals. “I think we will be good. We’re going to come back bigger and stronger than last year. Get better and get a state championship.” Click for highlights. Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.","pubDate":"2023-06-16 21:41:09","image_url":"https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/06/Terence-Roberson.jpg?w=900","source_id":"nwahomepage","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Sources: SDSU tells Mtn. West of exit intentions","link":"https://www.espn.com/college-sports/story/_/id/37864747/sources-san-diego-st-tells-mountain-west-plans-exit?device=featurephone","keywords":null,"creator":null,"video_url":null,"description":"San Diego State gave the Mountain West written notice this week that the school \"intends to resign,\" sources told ESPN's Pete Thamel, but questions remain.","content":"San Diego State gave the Mountain West written notice this week that the school \"intends to resign from the Mountain West Conference,\" sources told ESPN. In a letter, the school asked the Mountain West for a \"one-month extension given unforeseen delays involving other collegiate athletic conferences beyond our control.\" As of now, there does not appear to be an invitation to San Diego State from a Power 5 conference. The withdrawal letter, which came from San Diego State president Adela de la Torre on Tuesday, brought complexities and prompted a tense back-and-forth between the league and the school. SDSU subsequently informed the league that the letter was \"not the official notice of resignation,\" according to sources. San Diego State would need to give a year of notice to withdraw next June. If it waits past June 30, the exit fee it would owe jumps from nearly $16.5 million to nearly $34 million. SDSU has long been linked to the Pac-12, which is in the midst of a protracted process of landing a television contract. There has been no formal invitation for the school to join the league, and the timeline for such a move has been linked to either the Pac-12's television deal or the departure of a Pac-12 member. \"San Diego State does not have an offer from the Pac-12,\" according to a source. San Diego State is attempting to explore all options if the Pac-12 doesn't get a TV deal done by June 30, according to a source. The school has also been part of the Big 12's realignment exploration, and there have been conversations, per a source. But sources say neither side has prioritized the other to this point. \"SDSU is exploring all of the options and asking all the questions,\" the source said. \"The intention of the June 13 letter wasn't that San Diego State is exiting.\" Along with the one-month extension requested in Tuesday's letter, the school also asked the league to consider discussing the exit fee. SDSU noted the income the Aztecs have generated for the Mountain West through the NCAA basketball tournament -- estimated this March to be at least $10 million -- none of which it see if it leaves the league. San Diego State requested that a four-year installment plan be considered for the exit fee. As of now, SDSU would have to pay the fee by June 2024, which would include the league withholding payment of its distribution to the school. The Mountain West responded, informing the school in a letter Wednesday that the conference had accepted the letter of withdrawal and that the consequences of the move had begun. Those include that de la Torre's seat on the MW board of directors is being pulled and that under league policies, its financial obligation tied to withdrawal will be withheld. That prompted another communication from San Diego State to clarify that the June 13 letter was not an official resignation, just a request for an extension. It also asked that no payments be withheld. Mountain West schools are expecting a check for nearly $6 million in the upcoming weeks. \"They're trying to find out what we're willing to do,\" a Mountain West source briefed on the exchange said. \"They want to see if the Mountain West Conference is going to handle this nicely. Well, that's not going to happen. Everyone wants to find the best financial path for themselves, and it's clunky.\" The Mountain West Conference held a call with athletic directors Thursday afternoon that detailed the back-and-forth between the league and San Diego State. The news didn't come as a surprise, as SDSU athletic director J.D. Wicker has spoken openly about switching leagues. Wicker told ESPN in March that SDSU would be \"ready to step into a power conference.\" He told CBS in January that the Pac-12 would want to give SDSU a full share of the media revenue to prevent the school from going to the Big 12 and having that league recruiting in the Pac-12's backyard. San Diego State has been in the Mountain West since 1999 and is arguably its top overall athletic department. SDSU reached the NCAA tournament title game in men's basketball this year and the football program has a new $300 million stadium. The football Aztecs have won 10 or more games five times since 2015. This isn't the first time that San Diego State has attempted to leave the Mountain West. According to a 2011 announcement, San Diego State agreed to join the Big East as a football-only member starting in July 2013. In January 2013, the Mountain West presidents voted to allow San Diego State to return all sports to the league. With USC and UCLA moving to the Big Ten in 2024, San Diego State's allure has increased for leagues, as the school offers a toehold in the Southern California market.","pubDate":"2023-06-16 21:30:47","image_url":null,"source_id":"espn","category":["sports"],"country":["australia","canada","united kingdom","india","singapore","united states of america"],"language":"english"},{"title":"Who are the top four newcomers to the B.C. Lions?","link":"http://vancouversun.com/sports/who-are-the-top-four-newcomers-to-the-b-c-lions/wcm/5a010d73-2049-4a23-a915-6effa19b8a8b","keywords":["BC Lions","CFL","Football","Sports"],"creator":["Lynn Mitges"],"video_url":null,"description":"They're new to the B.C. Lions, or maybe just new to you, but here's four newcomers to keep an eye on","content":"Article content It’s one game into the CFL season for the B.C. Lions. Long enough to see this team has some talent, but not long enough to know who they are. Article content Here are the top five newcomers — and sort of newcomers — to watch for when the Lions take on the Edmonton Elks in Saturday’s home-opener at B.C. Place. (4 p.m., TSN, AM730): Article content He was gifted the name ‘Smoke’ by his high school coach, because when he was used as a tackling dummy in Grade 9 for the varsity team, none of them could tackle him. It was, “like trying to grab smoke with your hand.” The same could be said of his football career, which has been a long, hard road to his new home with the Lions. His game is built on explosiveness and an ability to turn a seam into an open door, which he did at the University of Virginia, where he was the only player in ACC history to amass 1,500 yards in both rushing and receiving. Article content He’s made for the pass-happy CFL game with its wider field — or the CFL game was made for him, if you should ask him. “It definitely is. Every day it’s just been fun,” he said. “I’m still getting used to the field being so huge. I feel like each week I’m gonna get better-and-better, and you’ll be able to see that. “(The larger field) gives me more room when I have to run East-West … But I don’t want people to stereotype me. ‘Oh, he’s just an East-West type of guy.’ I want to be able to show that I’m gonna block, run downhill, but when it is time to run East-West, I’m gonna be able to do it.” “He’s done a great job in training camp, great job learning the offence and the CFL game,” said offensive coordinator Jordan Maksymic. “So just to see his rise from a rookie to what he’s doing now and how comfortable he is with the system and CFL defences at this point, he definitely checks that (standout newcomer) box.” Article content Article content As a kid in Detroit, Siddiq played soccer until racking up a few too many red cards made him realize he was destined for a more physical sport. The 6-foot-2, 245-pounder was one the seemingly endless stream of anonymous pre-training camp free agent signings in May, but separated himself from the pack. The rookie out of Central Michigan and UNC-Charlotte busted out the shovel celebration after planting Calgary Stampeders quarterback Chris Reynolds in the B.C. Place turf during their pre-season game, right in line with his hard-working, high energy playing style. “I honestly think that the sleeper of everybody, futuristically, is gonna be Siddiq,” said defensive coordinator Ryan Phillips. “He’s a defensive end, playing special teams now, but once you start seeing him get a little bit more involved in defence, I think he’s gonna take a valuable step for us. He presents a different dynamic; he’s that hybrid type of defensive end that you need in the CFL, a guy that can run like a linebacker … but has the pedigree and the weight of a defensive end.” Article content A complementary role player during his time with the Saskatchewan Roughriders, he had his best career game — and first touchdown — against the Lions. Now he hopes to have the best performances with the Leos. Last August he had six catches for 111 yards and a touchdown against B.C., definitely putting him on their radar when he became a free agent in February. After coming to B.C., he had a two-TD game against the Stamps in the pre-season, then made the biggest catch of the game late in last week’s regular-season matchup, a dynamic first-down snag that moved the chains and allowed B.C. to run out the clock. With Keon Hatcher on the six-game injured list, he’ll be pressed into starting service again this week. Article content “Justin’s been huge,” said Maksymic. “We told him in free agency that we wanted him to be a Swiss Army Knife, and that’s what he is. The Lions had to reshape their front five when Joel Figueroa and Peter Godber left in free agency, to Hamilton and Saskatchewan, respectively. Peirson, who’s spent all five years of his CFL career in B.C., has always been a serviceable stand-in, but has stepped up into a starter’s role at left guard this year. Article content Broxton, 30, started at both left tackle and left guard in the playoffs last season, and had what offensive lines’ coach Kelly Bates said was his best season in 2022. He’ll fill Fig’s spot. Both started last week, when B.C. was the only team not to give up a quarterback sack. “They’re not newcomers by any means,” said Maksymic. “The way that they’ve worked into those roles … they’re just super-solid over there. They graded out well and they were just really dependable.” Maksymic also added that Couture, whom they picked up in free agency from Winnipeg, has been exactly what they want in a veteran centre. “He’s stepped into the role as a captain of that offensive line and done everything we need. He’s a solid veteran there, mentally and physically.” Article content tw Article content Share this article in your social network Advertisement 1","pubDate":"2023-06-16 21:27:24","image_url":null,"source_id":"vancouversun","category":["sports"],"country":["canada"],"language":"english"},{"title":"Qualifications Euro 2024 : la France, l'Angleterre et la Suisse continuent leur sans-faute","link":"https://www.dhnet.be/sports/football/europe/2023/06/16/qualifications-euro-2024-la-france-langleterre-et-la-suisse-continuent-leur-sans-faute-EY3QGENLFVAMRGZV6G4GUYAN54/","keywords":["Europe"],"creator":["Belga  -"],"video_url":null,"description":"La France, l'Angleterre et la Suisse ont respectivement battu Gibraltar, Malte et Andorre vendredi, remportant chacune leur troisième victoire en autant de matchs dans les qualifications à l'Euro 2024 et se classant en tête de leur groupe.","content":"La France, l'Angleterre et la Suisse ont respectivement battu Gibraltar, Malte et Andorre vendredi, remportant chacune leur troisième victoire en autant de matchs dans les qualifications à l'Euro 2024 et se classant en tête de leur groupe. Dans le groupe B, la France n'a fait qu'une bouchée de Gibraltar. Les Bleus ont vite ouvert le score (3e) grâce à une tête d'Olivier Giroud. Mbappé sur pénalty (45e+3) et un autobut de Mouelhi (78e) ont permis à la France de creuser l'écart. Dans l'autre match du groupe, la Grèce a battu l'Irlande 2-1 et est désormais deuxième du groupe B. Le scénario était identique dans le groupe C, où l'Angleterre se déplaçait chez le petit poucet maltais. Les Three Lions ont profité d'un but contre-son-camp d'Apap (9e) pour ouvrir le score. Alexander-Arnold (28e), Kane (31e) et Wilson (83e) ont alourdi la marque. Dans l'autre match, l'Ukraine, menée 2-0 par la Macédoine du Nord, a renversé le match pour s'imposer 2-3. Les Ukrainiens sont deuxièmes avec trois points. Dans le groupe D, la Turquie s'est imposé en Lettonie (2-1) et a pris la tête du groupe avec six points, alors que l'Arménie a battu le Pays de Galles (4-2). Dans un groupe H équilibré, la Finlande et le Kazakhstan ont battu respectivement la Slovénie (2-0) et Saint-Marin (0-3). Ils partagent la tête du groupe avec la Slovénie (6 points chacun). Le Danemark a remporté sa première victoire en trois matchs, battant péniblement l'Irlande du Nord (1-0). Comme la France et l'Angleterre, la Suisse a aussi marqué neuf points en trois matchs après sa victoire à Andorre (1-2). Dans les autres matchs du groupe I, le Bélarus et Israël se sont neutralisés (1-1), tout comme le Kosovo et la Roumanie (0-0). Cette dernière est deuxième avec sept points.","pubDate":"2023-06-16 21:20:25","image_url":null,"source_id":"dhnet","category":["sports"],"country":["belgium"],"language":"french"},{"title":"Jamie Carragher makes exciting Trent Alexander-Arnold Liverpool prediction after England wonder show","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/trent-alexander-arnold-liverpool-carragher-27142337","keywords":["Sport"],"creator":null,"video_url":null,"description":"Trent Alexander-Arnold scored one goal and created another in a sensational performance for England against Malta","content":"Jamie Carragher believes the time will soon come when Trent Alexander-Arnold will be hitting double figures for both goals and assists after watching his sensational performance for England. , wearing the No.10 shirt, was handed a midfield role by Gareth Southgate for England's Euro 2024 qualifier in Malta. And the star certainly did not disappoint. It was his stunning through pass that set Bukayo Saka on the way to lay on England's opener, which came courtesy of a Ferdinando Apap own goal. And, on what was his 19th appearance for his country, Alexander-Arnold then scored himself with a typically brilliantly long-range strike. The 24-year-old was also involved in the third goal on the night, which came courtesy of the penalty spot, and was converted by captain Harry Kane. Substitute Callum Wilson later scored a spot-kick of his own as Southgate's side ran out comfortable 4-0 winners. And during the match, former Liverpool and England defender made an exciting observation about Alexander-Arnold, who toward the end of the 2022-23 campaign began to play - and impress - in midfield for his club side. Carragher tweeted: \"This midfield role for TAA (Trent Alexander-Arnold) will eventually become the norm for club and country! He creates plenty from full-back as he will in CM (centre-midfield), but the goal he has just scored will happen a lot more in midfield. \"He could get double figures in goals and assists playing further forward.\" In 273 appearances for Liverpool, Alexander-Arnold has scored 16 goals and has 71 assists to his name. England are back in action on Monday when they welcome North Macedonia to Old Trafford.","pubDate":"2023-06-16 21:03:23","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article26971553.ece/ALTERNATES/s98/0_JC.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Matildas champion Caitlin Foord’s decade-long regret she’s ready to set right at FIFA Women’s World Cup 2023","link":"https://7news.com.au/sport/fifa-womens-world-cup/matildas-champions-retrospective-wish-ahead-of-insane-fifa-womens-world-cup-moment-in-australia-c-10864270","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"Caitlin Foord has opened up on the enormous moment she took for granted - and how she’s ready to set it right.","content":"It’s a strange thing for Caitlin Foord to admit, given the enormity of her feat, but the Matildas star can honestly say she “didn’t really know what the World Cup was” when she made her debut at just 16 years old. Now, over a decade later, the 28-year-old is more than aware as she enters her fourth as one of Australia’s leading players alongside Sam Kerr. Foord shapes as one of the team’s most important players for the upcoming tournament, which the Aussies will host for the first time ever. It will be a watershed moment for women’s football — and football in general — in the country, giving aspiring footballers the chance to see live what few other kids around the globe will ever have the privilege of seeing. “It’s going to be insane. I wish when I was growing up, I had something like this to go watch and support. But I think it will change the game in Australia, and I hope we can play a massive part in that,” Foord tells 7NEWS.com.au. “I remember going to my first one (in 2011) and, to be honest, I didn’t really know what the World Cup was. I mean, I did — I knew I was going to it, but I didn’t know how big that stage was and I guess I didn’t really take it all in. “I was just having fun with my mates. I didn’t even really think that much into the football side of things. I guess I took it for a little bit for granted, but that’s at a young age and I was just so carefree and going through the motions. “Now I know what’s at stake and I know the importance of it and I know what it could do for us as a team. It could change the whole outlook on the sport.” The Aussies enter the global marquee event sitting 10th in the FIFA women’s rankings and a genuine title contender, a label few Matildas teams have earned in the history of the tournament. They have reached the quarter-finals on three separate occasions (2007, 2011 and 2015) but never made it any further. Foord played in two of those, as well as the 2019 campaign, but she feels this time it’s different. “In the past at the World Cup, we’ve gone out in the quarter-finals and it’s been disappointing because we do feel like we have deserved more as a team,” the Arsenal player says. “With the core group we have had for many years now, this feels like it’s our time. And most of our players are at their peak or in their best form. “Our hopes going into a World Cup are always to make it to the final and to have the opportunity to lift the trophy. But it’s going to start with one game at a time and not getting too far ahead of ourselves.” But even with few of the team’s key players on the wrong side of 30, Foord concedes the stars are aligning for Australia to lift the trophy this year. “This definitely does feel like the time to do it, if we’re going to do it,” she says. “It feels like we have a massive opportunity in front of us and we we don’t want to miss out on it. Not many people will get to say they’ve played a World Cup at home, so I think I want to just to enjoy that moment and take it all in.” Playing in front of friends and family is a privilege the Matildas have worked long and hard for over decades. And Foord, one of the most senior figures in Australian football, knows that as well as anyone. “The push for securing the World Cup on home soil started a long time ago; it’s been a long process and we’ve all kind of been along for that journey and the excitement and the hype,” Foord says. “It feels like ages ago now that we were told that we’ll be hosting it. So, it feels a bit weird to know that it is so close. “To be honest, I can’t really wrap my head around it; that the World Cup is gonna be at home, but hopefully everyone’s all fit and healthy and walking out to that opening game. Not until then will it hit that it feels real, that this is actually a World Cup on home soil with our friends and families in the stadium and fans. “It’s going to be a massive moment for women’s football, and football in general in Australia, and around the world as well. “I don’t think an opening game has been that big before — it’s insane to think about. I do think that’s going to be a game-changing moment and hopefully that continues throughout the tournament for the rest of our games in the group stage and beyond that as well. “It’s hard not to let your mind wander to that moment. But also there’s there’s a lot to be done before then. “So yeah, it’s definitely going to be one to remember and a special one and I guess that’s why we want to make the most of it. We need leave no stone unturned along the way.”","pubDate":"2023-06-16 23:00:00","image_url":"https://images.7news.com.au/publication/C-10864270/e20433de6e98048b53005c89d9ee0f9e927caffa-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Bosso in turmoil… Auditors quit amid threats, tensions","link":"https://www.chronicle.co.zw/bosso-in-turmoil-auditors-quit-amid-threats-tensions/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Ricky Zililo ricky.zililo@chronicle.co.zw HIGHLANDERS Football Club is facing a crisis that threatens its reputation and financial stability. Recent events have unfolded, leading to the resignation of the club’s auditors, PNA Chartered Accountants, Saturday Chronicle can exclusively reveal. PNA Chartered Accountants’ decision comes in the wake of escalating tensions and disagreements within the club’s leadership, with […]","content":"The Chronicle HIGHLANDERS Football Club is facing a crisis that threatens its reputation and financial stability. Recent events have unfolded, leading to the resignation of the club’s auditors, PNA Chartered Accountants, Saturday Chronicle can exclusively reveal. PNA Chartered Accountants’ decision comes in the wake of escalating tensions and disagreements within the club’s leadership, with the executive committee and the board engaging in a bitter dispute. The auditors, unwilling to have their professional image tarnished, chose to sever ties with the club rather than compromise their integrity. Insiders within Highlanders have confirmed the resignation of the auditors and shed light on the circumstances that led to this drastic step. It appears that the auditors became increasingly disillusioned with the work environment, citing strained relations between the executive and the board as a primary concern. In fact, the auditors even revealed that they had been threatened with termination during the audit process, a troubling development that cast doubt on their ability to perform their duties impartially. Moreover, the auditors suspected a potential conspiracy to manipulate information provided to them during the audit. This discovery further eroded their trust in the club’s management. They were also dismayed by the lack of interest in implementing their recommendations, particularly in establishing proper structures within the club. Faced with these challenges, the auditors felt compelled to part ways with Highlanders and urged the club to seek alternative auditors for future financial assessments. During the presentation of the audited financial statements, the auditors highlighted the delayed completion of the audit, which could have been finalised as early as January. However, the club’s treasurer, Busani Mthombeni, had postponed the process, starting it only in October of the previous year. The auditors said commencing the audit earlier would have resolved numerous issues and expedited the reporting process. Earlier in January, Highlanders had conducted their annual general meeting without presenting the financial report, as a disagreement arose between the club and the auditors regarding the reporting currency. While the club had prepared the financial statements in local currency, the auditors insisted on using foreign currency, considering the majority of Highlanders’ transactions were conducted in US dollars. This disagreement further strained the relationship between the auditors and the club. Throughout the audit, the auditors faced threats of termination due to their insistence on presenting the financial statements in foreign currency. Undeterred, they remained steadfast and resolute, emphasising their commitment to fulfilling their responsibilities and preserving their professional credibility. Consequently, upon completing the audit, the auditors issued an adverse opinion on Highlanders’ financials, effectively conveying their inability to endorse the authenticity of the club’s financial statements. This adverse opinion casts a negative light on the institution and raises concerns among stakeholders, including sponsors, who may question the club’s financial stability and reliability. In addition to their adverse opinion, the auditors flagged several issues during the audit process. They discovered transactions that lacked supporting documentation, prompting the club’s finance department to retrieve the necessary records. These findings further exacerbated the auditors’ concerns and contributed to their adverse opinion. The auditors expressed the need for Highlanders’ accounting department to enhance its capacity and understanding of modern auditing practices. They encouraged the club to establish an independent internal audit team that would oversee the accounts throughout the year, providing an additional layer of checks and balances. One particular area of concern highlighted by the auditors was the club’s inability to properly account for funds raised by supporters’ chapters. The auditors discovered that some funds, raised on behalf of Highlanders, were being held by a chapter within the club. Such discrepancies raise questions about the club’s financial management and transparency. Additionally, the auditors noted inconsistencies in the recording of cash collected at the clubhouse and when recorded at Highlanders’ offices, despite the close proximity of these establishments on Robert Mugabe Way, a mere four streets apart. These discrepancies in cash handling added to the auditors’ apprehension and underscored the need for improved financial controls within the club. The auditors believed that implementing an internal audit process would help mitigate these issues and ensure greater accuracy and accountability in financial reporting. With their departure, Highlanders now faces the arduous task of investigating the financials and seeking to obtain a more favourable opinion to restore stakeholders’ confidence. This includes sponsors who may view the club as a less secure investment opportunity given the adverse opinion issued by the auditors. The resignation of the auditors serves as a wake-up call for Highlanders, highlighting the urgent need for improved governance, transparency, and financial management within the club. It is imperative for the executive committee and the board to address their differences and establish a harmonious working relationship that prioritizes the club’s long-term success and reputation. Repeated efforts to get comment from Highlanders were fruitless, with club spokesperson Nozibelo Maphosa saying she was waiting for the chief executive officer Ronald Moyo who in turn said he was yet to get a response from his superiors. @ZililoR","pubDate":"2023-06-16 22:04:18","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gabriel Nyoni wants to play football again","link":"https://www.chronicle.co.zw/gabriel-nyoni-wants-to-play-football-again/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Innocent Kurira kuriralnnocent@gmail.com “The pain is excruciating,” Gabriel Nyoni cried, his voice filled with desperation, as he stood on the precipice of uncertainty. These were the moments before he would enter the operation room, prepared to undergo foot surgery that was necessary after a devastating injury he sustained during a GladAfrica Championship match against Richards […]","content":"The Chronicle “The pain is excruciating,” Gabriel Nyoni cried, his voice filled with desperation, as he stood on the precipice of uncertainty. These were the moments before he would enter the operation room, prepared to undergo foot surgery that was necessary after a devastating injury he sustained during a GladAfrica Championship match against Richards Bay in February 2021 at the Umhlathuze Sports Complex Grounds in Richards Bay. As he uttered his plea, Nyoni’s prayers seemed to be answered. The surgery was successful, but the doctor delivered a sobering revelation. If the surgery had been delayed even slightly, Nyoni’s leg might have faced amputation due to compartment syndrome. At first glance, Nyoni’s leg injury appeared to be a minor setback. However, it posed a significant threat to his career. The speedster had suffered severe fractures in his foot, necessitating the use of wires and pins to stabilise the bones. Doubt shrouded Nyoni’s return to the field of play. Injuries have long been considered the ultimate adversary for athletes, prematurely ending numerous promising careers. Yet, Nyoni is among the courageous few who refuse to succumb to such a fate. He is determined to make a comeback after this grave injury, following in the footsteps of players like Shacky “Master Goals” Tauro, Johannes Ngodzo, Samson Choruwa, and Desmond “Gazza” Maringwa, whose own careers were destroyed by injuries. “Life is unpredictable,” Nyoni reflects, his voice tinged with wisdom. “Today, you may have grand plans to become one of the best soccer players of your generation, and tomorrow, you find yourself waking up in a hospital, facing the possibility of amputation. Life, whether good or bad, simply happens. It reminds me of the story of Job in the Bible.” Although the doctors have confirmed that his foot has fully recovered, there remains a risk in playing with it. The final decision lies with Nyoni himself. “Truthfully, I didn’t retire on my own terms, and it continues to bother me to this day,” Nyoni confides. “I would love to retire on my own terms. My business now runs smoothly without my constant presence, so I feel I can play more freely. I believe I have two or three more years, and then I will call it a day.” Having expressed his eagerness to return to the field of play, Nyoni holds no specific destination in mind. “Wherever a team is willing to give me an opportunity to revive my career, that’s where I’ll go. Of course, my former teams like Highlanders and CAPS United hold a special place in my heart, so they are my first preferences,” Nyoni reveals. While adversity has marked Nyoni’s journey, he has not allowed misfortune to define him. He ventured into the perfume manufacturing business, crafting 100 percent undiluted, long-lasting oil-based perfumes inspired by renowned designer brands. It was a new chapter in his life that began when he left Highlanders to join CAPS United in 2019, then moved to Maritzburg United in South Africa before ultimately finding himself with Cape Umoya in the GladAfrica Championship. @innocentskizoe","pubDate":"2023-06-16 22:03:57","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"The remarkable journey of Chamunorwa Maphosa and Makokoba Tigers FC","link":"https://www.chronicle.co.zw/the-remarkable-journey-of-chamunorwa-maphosa-and-makokoba-tigers-fc/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Lovemore Dube lovemore.dube@chronicle.co.zw SO many real heroes live in our midst but are rarely celebrated for unearthing gems that the country has celebrated on the field, courts, tracks and roads in Zimbabwean sport. Beginning today Saturday Chronicle will run a weekly column that seeks to unearth those community and sport champions that you don’t know […]","content":"The Chronicle SO many real heroes live in our midst but are rarely celebrated for unearthing gems that the country has celebrated on the field, courts, tracks and roads in Zimbabwean sport. Beginning today Saturday Chronicle will run a weekly column that seeks to unearth those community and sport champions that you don’t know but built the foundation of many a star. Today we feature little known Chamunorwa Maphosa of Makokoba Tigers FC, a team with juniors who play in the Bulawayo Province Junior Soccer League. Despite handling the likes of Nqobizitha Masuku and Godfrey Makaruse both of whom have made names for themselves in Zimbabwe football, Maphosa is among thousands whose great work was hijacked. This came by after their products’ brilliance got a platform to be amplified elsewhere. Not every good player started at Highlanders, AmaZulu, Bulawayo Wanderers, Railstars and Zimbabwe Saints. There are so many relatively obscure clubs and individuals like Maphosa who crafted the script that made Peter Ndlovu, Honour Gombami, Thulani Ncube, Zenzo Moyo, Thabani Moyo, Thabani Masawi and Innocent and Rahman Gumbo who have seen recognition elude them. Touched by seeing some boys from his EmaTongeni neighbourhood of Makokoba Flats, Maphosa decided promptly to save them. “I could not stand seeing the boys arrested regularly for stealing minor stuff like shoe polish. What touched me most was that a stone’s throw at the Lobengula Street Park, there would be some of their colleagues playing near Gertrude Hostel I then set it upon myself to have the boys playing there regularly. That gave birth to Makokoba City Warriors. “We started in Division Three and we were promoted up to Division One. We have produced players like Nqobizitha Masuku who now plays in Botswana and Highlanders’ Godera, Godfrey Makaruse. There are so many like Matriples Muleya who is at Triangle, Nickson Gama who is at Bulawayo Chiefs, Brendon Mpofu who is at Dynamos, Gillian Nyathi, Darlington Munkuli and Prince Ndlovu who are at Highlanders,” said Maphosa. Maphosa, 70, said eight players were this year released to Highlanders FC’s development side who in return gave them 10 soccer balls. “We are happy to see our local club that I support Highlanders FC getting our players. We are doing a great job of ensuring that our teams do not buy players from elsewhere but use home grown talent,” said Maphosa. Raising a child, Maphosa says, is a community responsibility hence his efforts of trying to develop very positive youngsters from Makokoba. “In the community I always try to ensure our children are kept occupied and with high moral values. Now I’m playing the overseer role, there is Wilton Kwenda my former player standing in as coach. Whenever there are disciplinary issues I do not hesitate to come and deal with it even to an extent of tearing the youngster’s Zifa licence. Discipline is a foundation pillar for my boys, that is why I came to work with them even sacrificing going to church just to be with the team,” said Maphosa. As a community builder, he said it is ever painful at times plucking a boy who is a bad influence out of the group as soccer teams are a small society expected to correct wayward characters. “It pains to tell the boy to go home or join another club. We are parents, it is our failure so we have to correct some of these kids early,” said Maphosa whose football team is based at Thabiso Youth Centre where they moved to from the Lobengula Street Park as City Warriors before changing to Tigers. He said changing to Tigers FC was forced by financial challenges. “That has been our biggest challenge in the last 23 years. We have no steady sponsorship, we rely on donations from members of our community with Rambo Milo, Ngoni Nyakudziwanza, Shadreck Sibanda, James Sithole and one Ossie from South Africa keeping us going. “We are dreaming big, we need sponsorship for the boys. Our approach is two-fold, we want them kept away from crime and at the same time pave their paths towards playing as professional footballers. Some have gone through our systems in the past 23 years and gone all the way to stardom,” said Maphosa. He recalls Methembe Ndlovu, the former Highlanders midfielder and coach, coming to Thabiso and talking to them under a tree on the northern tip of the field at Thabiso. “Methembe said there was something happening that he needed Nqobizitha Masuku for, the rest is history, the boy never came back and rose to one of the best players around through Bantu Rovers,” said Maphosa. He bemoaned big clubs’ bullying tactics where they get talent from small teams and do not compensate. “We make stars. Appreciate us, invest in us and we will give you more and don’t forget to acknowledge where you tapped from,” said Maphosa who in his younger days played for Matabeleland High City alongside Albert “Ali” Dube when he arrived from Buhera in 1974. Maphosa also played for Chronicle FC in Division One alongside Joshua Mutize and Gibson Bhinya. With support, these obscure football projects can achieve more and the coaches and officials running the teams are sport’s unsung heroes. Most of those hogging the limelight found stars ripe and ready and simply provided a platform to be the national and international showcase.","pubDate":"2023-06-16 22:01:23","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Colorado football coach Deion Sanders might have to have left foot amputated","link":"https://helenair.com/sports/college/colorado-football-coach-deion-sanders-might-have-to-have-left-foot-amputated/article_7bb28f83-8a05-5d36-965b-7a7ac654b8e7.html","keywords":null,"creator":["Associated Press"],"video_url":null,"description":"New University of Colorado head football coach Deion Sanders faces the possibility of having his left foot amputated as a result of continuing bloodflow issues. Sanders had two toes amputated from his left foot in 2021 while he was coaching…","content":"Deion Sanders might lose his left foot as a result of circulation issues that forced him to have two toes amputated in 2021. Sanders allowed camera crews with \" Thee Pregame Show \" to film a meeting with his medical team at the University of Colorado, where he’s preparing for his first season as head football coach. In at 11-minute segment released Friday on YouTube, Sanders met with orthopedic surgeon Dr. Ken Hunt, vascular surgeons Dr. Donald Jacobs and Dr. Max Wohlauer and athletic trainer Lauren Askevold to discuss his daily pain levels and possible next steps. “You just have to understand what the risks are. Things can cascade,” Jacobs said, adding that Sanders might not just lose another toe but \"he could lose the foot.” “Well, I know what risks are,\" Sanders replied. “I only have eight toes. So, I’m pretty sure I understand.” Sanders said he has no feeling on the bottom of his left foot and said if a procedure is recommended he wants to get it done right away because once the season starts he'll too busy. “I want to do it this summer because when we get rolling, I’m not going to have time to do it,” Sanders said. “This is the best downtime I have.” Sanders missed three games at Jackson State in 2021 after having two toes amputated during the season. Sanders took over the downtrodden Buffaloes program in December following Colorado's 1-11 season in 2022. His hiring has led to a resurgence of interest in the program that's had just two winning seasons since 2016, one of those was a 4-2 mark during the pandemic season of 2020. The Buffs sold out their spring game in April and has sold out its season ticket allotment for the first time in nearly three decades. Colorado opens at TCU on Sept. 2 and hosts former Big 12 rival Nebraska a week later at Folsom Field.","pubDate":"2023-06-16 21:52:00","image_url":"https://bloximages.chicago2.vip.townnews.com/helenair.com/content/tncms/assets/v3/editorial/3/61/36101750-ea67-59f4-8c3e-4b1b1de58d56/648cdaf172ecb.image.jpg?resize=300%2C200","source_id":"helenair","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Warren's Terence Roberson has good showing at UA","link":"https://www.nwahomepage.com/sports/pig-trail-nation/hogville-hog-recruiting/warrens-terence-roberson-has-good-showing-at-ua/","keywords":["Hogville, Hog Recruiting","Pig Trail Nation"],"creator":["Otis Kirk"],"video_url":null,"description":"Warren offensive lineman Terence Roberson was among the top campers at Arkansas on Friday.","content":"Photo by Otis Kirk. by: Posted: Updated: FAYETTEVILLE — Warren Class of 2024 offensive lineman Terence Roberson was among the top standouts at Arkansas’ football camp on Friday. Roberson, 6-4 1/2, 292 (both without shoes), owns a 3.95 grade-point average and showed on Friday he has the talent to play at high level in college. “It went good today,” Roberson said. “I learned a lot. It’s a great experience. I came here last year and also learned a lot. It’s a really good atmosphere here and I enjoy it a lot.” Sam Pittman, Arkansas’ head football coach, is a former offensive line coach. That appeals to Roberson. “I think he has done a great job here at Arkansas,” Roberson said. “He loves O-line and I like that about him too. I think he’s going to do a whole more in the future.” Roberson worked with Cody Kennedy on Friday. Kennedy is Arkansas’ offensive line coach. “Last year I learned a lot from him too,” Roberson said. “Great coach. He (his personality) reminds me of our O-line coach.” Roberson has offers to UAPB and Arkansas-Monticello. What would an offer to Arkansas mean to you? “It would mean a lot,” Roberson said. “Whole bunch of guys from my town have came here and gone to the NFL. So I think it would be a great feeling.” Roberson said the area where he needs to make the most improvement is his foot work. He also talked about his strengths on the field. “Just pushing through and trying to get better,” Roberson said. Roberson comes from a program that’s very well-coached and competitive each season. He talked about playing for the Lumberjacks. “It’s a great feeling,” Roberson said. “We have a good support system. We just go out there and work everyday and do the best we can.” He talked about how good Warren can be this fall and his goals. “I think we will be good. We’re going to come back bigger and stronger than last year. Get better and get a state championship.” Click for highlights. Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.","pubDate":"2023-06-16 21:41:09","image_url":"https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/06/Terence-Roberson.jpg?w=900","source_id":"nwahomepage","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Sources: SDSU tells Mtn. West of exit intentions","link":"https://www.espn.com/college-sports/story/_/id/37864747/sources-san-diego-st-tells-mountain-west-plans-exit?device=featurephone","keywords":null,"creator":null,"video_url":null,"description":"San Diego State gave the Mountain West written notice this week that the school \"intends to resign,\" sources told ESPN's Pete Thamel, but questions remain.","content":"San Diego State gave the Mountain West written notice this week that the school \"intends to resign from the Mountain West Conference,\" sources told ESPN. In a letter, the school asked the Mountain West for a \"one-month extension given unforeseen delays involving other collegiate athletic conferences beyond our control.\" As of now, there does not appear to be an invitation to San Diego State from a Power 5 conference. The withdrawal letter, which came from San Diego State president Adela de la Torre on Tuesday, brought complexities and prompted a tense back-and-forth between the league and the school. SDSU subsequently informed the league that the letter was \"not the official notice of resignation,\" according to sources. San Diego State would need to give a year of notice to withdraw next June. If it waits past June 30, the exit fee it would owe jumps from nearly $16.5 million to nearly $34 million. SDSU has long been linked to the Pac-12, which is in the midst of a protracted process of landing a television contract. There has been no formal invitation for the school to join the league, and the timeline for such a move has been linked to either the Pac-12's television deal or the departure of a Pac-12 member. \"San Diego State does not have an offer from the Pac-12,\" according to a source. San Diego State is attempting to explore all options if the Pac-12 doesn't get a TV deal done by June 30, according to a source. The school has also been part of the Big 12's realignment exploration, and there have been conversations, per a source. But sources say neither side has prioritized the other to this point. \"SDSU is exploring all of the options and asking all the questions,\" the source said. \"The intention of the June 13 letter wasn't that San Diego State is exiting.\" Along with the one-month extension requested in Tuesday's letter, the school also asked the league to consider discussing the exit fee. SDSU noted the income the Aztecs have generated for the Mountain West through the NCAA basketball tournament -- estimated this March to be at least $10 million -- none of which it see if it leaves the league. San Diego State requested that a four-year installment plan be considered for the exit fee. As of now, SDSU would have to pay the fee by June 2024, which would include the league withholding payment of its distribution to the school. The Mountain West responded, informing the school in a letter Wednesday that the conference had accepted the letter of withdrawal and that the consequences of the move had begun. Those include that de la Torre's seat on the MW board of directors is being pulled and that under league policies, its financial obligation tied to withdrawal will be withheld. That prompted another communication from San Diego State to clarify that the June 13 letter was not an official resignation, just a request for an extension. It also asked that no payments be withheld. Mountain West schools are expecting a check for nearly $6 million in the upcoming weeks. \"They're trying to find out what we're willing to do,\" a Mountain West source briefed on the exchange said. \"They want to see if the Mountain West Conference is going to handle this nicely. Well, that's not going to happen. Everyone wants to find the best financial path for themselves, and it's clunky.\" The Mountain West Conference held a call with athletic directors Thursday afternoon that detailed the back-and-forth between the league and San Diego State. The news didn't come as a surprise, as SDSU athletic director J.D. Wicker has spoken openly about switching leagues. Wicker told ESPN in March that SDSU would be \"ready to step into a power conference.\" He told CBS in January that the Pac-12 would want to give SDSU a full share of the media revenue to prevent the school from going to the Big 12 and having that league recruiting in the Pac-12's backyard. San Diego State has been in the Mountain West since 1999 and is arguably its top overall athletic department. SDSU reached the NCAA tournament title game in men's basketball this year and the football program has a new $300 million stadium. The football Aztecs have won 10 or more games five times since 2015. This isn't the first time that San Diego State has attempted to leave the Mountain West. According to a 2011 announcement, San Diego State agreed to join the Big East as a football-only member starting in July 2013. In January 2013, the Mountain West presidents voted to allow San Diego State to return all sports to the league. With USC and UCLA moving to the Big Ten in 2024, San Diego State's allure has increased for leagues, as the school offers a toehold in the Southern California market.","pubDate":"2023-06-16 21:30:47","image_url":null,"source_id":"espn","category":["sports"],"country":["australia","canada","united kingdom","india","singapore","united states of america"],"language":"english"},{"title":"Who are the top four newcomers to the B.C. Lions?","link":"http://vancouversun.com/sports/who-are-the-top-four-newcomers-to-the-b-c-lions/wcm/5a010d73-2049-4a23-a915-6effa19b8a8b","keywords":["BC Lions","CFL","Football","Sports"],"creator":["Lynn Mitges"],"video_url":null,"description":"They're new to the B.C. Lions, or maybe just new to you, but here's four newcomers to keep an eye on","content":"Article content It’s one game into the CFL season for the B.C. Lions. Long enough to see this team has some talent, but not long enough to know who they are. Article content Here are the top five newcomers — and sort of newcomers — to watch for when the Lions take on the Edmonton Elks in Saturday’s home-opener at B.C. Place. (4 p.m., TSN, AM730): Article content He was gifted the name ‘Smoke’ by his high school coach, because when he was used as a tackling dummy in Grade 9 for the varsity team, none of them could tackle him. It was, “like trying to grab smoke with your hand.” The same could be said of his football career, which has been a long, hard road to his new home with the Lions. His game is built on explosiveness and an ability to turn a seam into an open door, which he did at the University of Virginia, where he was the only player in ACC history to amass 1,500 yards in both rushing and receiving. Article content He’s made for the pass-happy CFL game with its wider field — or the CFL game was made for him, if you should ask him. “It definitely is. Every day it’s just been fun,” he said. “I’m still getting used to the field being so huge. I feel like each week I’m gonna get better-and-better, and you’ll be able to see that. “(The larger field) gives me more room when I have to run East-West … But I don’t want people to stereotype me. ‘Oh, he’s just an East-West type of guy.’ I want to be able to show that I’m gonna block, run downhill, but when it is time to run East-West, I’m gonna be able to do it.” “He’s done a great job in training camp, great job learning the offence and the CFL game,” said offensive coordinator Jordan Maksymic. “So just to see his rise from a rookie to what he’s doing now and how comfortable he is with the system and CFL defences at this point, he definitely checks that (standout newcomer) box.” Article content Article content As a kid in Detroit, Siddiq played soccer until racking up a few too many red cards made him realize he was destined for a more physical sport. The 6-foot-2, 245-pounder was one the seemingly endless stream of anonymous pre-training camp free agent signings in May, but separated himself from the pack. The rookie out of Central Michigan and UNC-Charlotte busted out the shovel celebration after planting Calgary Stampeders quarterback Chris Reynolds in the B.C. Place turf during their pre-season game, right in line with his hard-working, high energy playing style. “I honestly think that the sleeper of everybody, futuristically, is gonna be Siddiq,” said defensive coordinator Ryan Phillips. “He’s a defensive end, playing special teams now, but once you start seeing him get a little bit more involved in defence, I think he’s gonna take a valuable step for us. He presents a different dynamic; he’s that hybrid type of defensive end that you need in the CFL, a guy that can run like a linebacker … but has the pedigree and the weight of a defensive end.” Article content A complementary role player during his time with the Saskatchewan Roughriders, he had his best career game — and first touchdown — against the Lions. Now he hopes to have the best performances with the Leos. Last August he had six catches for 111 yards and a touchdown against B.C., definitely putting him on their radar when he became a free agent in February. After coming to B.C., he had a two-TD game against the Stamps in the pre-season, then made the biggest catch of the game late in last week’s regular-season matchup, a dynamic first-down snag that moved the chains and allowed B.C. to run out the clock. With Keon Hatcher on the six-game injured list, he’ll be pressed into starting service again this week. Article content “Justin’s been huge,” said Maksymic. “We told him in free agency that we wanted him to be a Swiss Army Knife, and that’s what he is. The Lions had to reshape their front five when Joel Figueroa and Peter Godber left in free agency, to Hamilton and Saskatchewan, respectively. Peirson, who’s spent all five years of his CFL career in B.C., has always been a serviceable stand-in, but has stepped up into a starter’s role at left guard this year. Article content Broxton, 30, started at both left tackle and left guard in the playoffs last season, and had what offensive lines’ coach Kelly Bates said was his best season in 2022. He’ll fill Fig’s spot. Both started last week, when B.C. was the only team not to give up a quarterback sack. “They’re not newcomers by any means,” said Maksymic. “The way that they’ve worked into those roles … they’re just super-solid over there. They graded out well and they were just really dependable.” Maksymic also added that Couture, whom they picked up in free agency from Winnipeg, has been exactly what they want in a veteran centre. “He’s stepped into the role as a captain of that offensive line and done everything we need. He’s a solid veteran there, mentally and physically.” Article content tw Article content Share this article in your social network Advertisement 1","pubDate":"2023-06-16 21:27:24","image_url":null,"source_id":"vancouversun","category":["sports"],"country":["canada"],"language":"english"},{"title":"Qualifications Euro 2024 : la France, l'Angleterre et la Suisse continuent leur sans-faute","link":"https://www.dhnet.be/sports/football/europe/2023/06/16/qualifications-euro-2024-la-france-langleterre-et-la-suisse-continuent-leur-sans-faute-EY3QGENLFVAMRGZV6G4GUYAN54/","keywords":["Europe"],"creator":["Belga  -"],"video_url":null,"description":"La France, l'Angleterre et la Suisse ont respectivement battu Gibraltar, Malte et Andorre vendredi, remportant chacune leur troisième victoire en autant de matchs dans les qualifications à l'Euro 2024 et se classant en tête de leur groupe.","content":"La France, l'Angleterre et la Suisse ont respectivement battu Gibraltar, Malte et Andorre vendredi, remportant chacune leur troisième victoire en autant de matchs dans les qualifications à l'Euro 2024 et se classant en tête de leur groupe. Dans le groupe B, la France n'a fait qu'une bouchée de Gibraltar. Les Bleus ont vite ouvert le score (3e) grâce à une tête d'Olivier Giroud. Mbappé sur pénalty (45e+3) et un autobut de Mouelhi (78e) ont permis à la France de creuser l'écart. Dans l'autre match du groupe, la Grèce a battu l'Irlande 2-1 et est désormais deuxième du groupe B. Le scénario était identique dans le groupe C, où l'Angleterre se déplaçait chez le petit poucet maltais. Les Three Lions ont profité d'un but contre-son-camp d'Apap (9e) pour ouvrir le score. Alexander-Arnold (28e), Kane (31e) et Wilson (83e) ont alourdi la marque. Dans l'autre match, l'Ukraine, menée 2-0 par la Macédoine du Nord, a renversé le match pour s'imposer 2-3. Les Ukrainiens sont deuxièmes avec trois points. Dans le groupe D, la Turquie s'est imposé en Lettonie (2-1) et a pris la tête du groupe avec six points, alors que l'Arménie a battu le Pays de Galles (4-2). Dans un groupe H équilibré, la Finlande et le Kazakhstan ont battu respectivement la Slovénie (2-0) et Saint-Marin (0-3). Ils partagent la tête du groupe avec la Slovénie (6 points chacun). Le Danemark a remporté sa première victoire en trois matchs, battant péniblement l'Irlande du Nord (1-0). Comme la France et l'Angleterre, la Suisse a aussi marqué neuf points en trois matchs après sa victoire à Andorre (1-2). Dans les autres matchs du groupe I, le Bélarus et Israël se sont neutralisés (1-1), tout comme le Kosovo et la Roumanie (0-0). Cette dernière est deuxième avec sept points.","pubDate":"2023-06-16 21:20:25","image_url":null,"source_id":"dhnet","category":["sports"],"country":["belgium"],"language":"french"},{"title":"Jamie Carragher makes exciting Trent Alexander-Arnold Liverpool prediction after England wonder show","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/trent-alexander-arnold-liverpool-carragher-27142337","keywords":["Sport"],"creator":null,"video_url":null,"description":"Trent Alexander-Arnold scored one goal and created another in a sensational performance for England against Malta","content":"Jamie Carragher believes the time will soon come when Trent Alexander-Arnold will be hitting double figures for both goals and assists after watching his sensational performance for England. , wearing the No.10 shirt, was handed a midfield role by Gareth Southgate for England's Euro 2024 qualifier in Malta. And the star certainly did not disappoint. It was his stunning through pass that set Bukayo Saka on the way to lay on England's opener, which came courtesy of a Ferdinando Apap own goal. And, on what was his 19th appearance for his country, Alexander-Arnold then scored himself with a typically brilliantly long-range strike. The 24-year-old was also involved in the third goal on the night, which came courtesy of the penalty spot, and was converted by captain Harry Kane. Substitute Callum Wilson later scored a spot-kick of his own as Southgate's side ran out comfortable 4-0 winners. And during the match, former Liverpool and England defender made an exciting observation about Alexander-Arnold, who toward the end of the 2022-23 campaign began to play - and impress - in midfield for his club side. Carragher tweeted: \"This midfield role for TAA (Trent Alexander-Arnold) will eventually become the norm for club and country! He creates plenty from full-back as he will in CM (centre-midfield), but the goal he has just scored will happen a lot more in midfield. \"He could get double figures in goals and assists playing further forward.\" In 273 appearances for Liverpool, Alexander-Arnold has scored 16 goals and has 71 assists to his name. England are back in action on Monday when they welcome North Macedonia to Old Trafford.","pubDate":"2023-06-16 21:03:23","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article26971553.ece/ALTERNATES/s98/0_JC.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Matildas champion Caitlin Foord’s decade-long regret she’s ready to set right at FIFA Women’s World Cup 2023","link":"https://7news.com.au/sport/fifa-womens-world-cup/matildas-champions-retrospective-wish-ahead-of-insane-fifa-womens-world-cup-moment-in-australia-c-10864270","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"Caitlin Foord has opened up on the enormous moment she took for granted - and how she’s ready to set it right.","content":"It’s a strange thing for Caitlin Foord to admit, given the enormity of her feat, but the Matildas star can honestly say she “didn’t really know what the World Cup was” when she made her debut at just 16 years old. Now, over a decade later, the 28-year-old is more than aware as she enters her fourth as one of Australia’s leading players alongside Sam Kerr. Foord shapes as one of the team’s most important players for the upcoming tournament, which the Aussies will host for the first time ever. It will be a watershed moment for women’s football — and football in general — in the country, giving aspiring footballers the chance to see live what few other kids around the globe will ever have the privilege of seeing. “It’s going to be insane. I wish when I was growing up, I had something like this to go watch and support. But I think it will change the game in Australia, and I hope we can play a massive part in that,” Foord tells 7NEWS.com.au. “I remember going to my first one (in 2011) and, to be honest, I didn’t really know what the World Cup was. I mean, I did — I knew I was going to it, but I didn’t know how big that stage was and I guess I didn’t really take it all in. “I was just having fun with my mates. I didn’t even really think that much into the football side of things. I guess I took it for a little bit for granted, but that’s at a young age and I was just so carefree and going through the motions. “Now I know what’s at stake and I know the importance of it and I know what it could do for us as a team. It could change the whole outlook on the sport.” The Aussies enter the global marquee event sitting 10th in the FIFA women’s rankings and a genuine title contender, a label few Matildas teams have earned in the history of the tournament. They have reached the quarter-finals on three separate occasions (2007, 2011 and 2015) but never made it any further. Foord played in two of those, as well as the 2019 campaign, but she feels this time it’s different. “In the past at the World Cup, we’ve gone out in the quarter-finals and it’s been disappointing because we do feel like we have deserved more as a team,” the Arsenal player says. “With the core group we have had for many years now, this feels like it’s our time. And most of our players are at their peak or in their best form. “Our hopes going into a World Cup are always to make it to the final and to have the opportunity to lift the trophy. But it’s going to start with one game at a time and not getting too far ahead of ourselves.” But even with few of the team’s key players on the wrong side of 30, Foord concedes the stars are aligning for Australia to lift the trophy this year. “This definitely does feel like the time to do it, if we’re going to do it,” she says. “It feels like we have a massive opportunity in front of us and we we don’t want to miss out on it. Not many people will get to say they’ve played a World Cup at home, so I think I want to just to enjoy that moment and take it all in.” Playing in front of friends and family is a privilege the Matildas have worked long and hard for over decades. And Foord, one of the most senior figures in Australian football, knows that as well as anyone. “The push for securing the World Cup on home soil started a long time ago; it’s been a long process and we’ve all kind of been along for that journey and the excitement and the hype,” Foord says. “It feels like ages ago now that we were told that we’ll be hosting it. So, it feels a bit weird to know that it is so close. “To be honest, I can’t really wrap my head around it; that the World Cup is gonna be at home, but hopefully everyone’s all fit and healthy and walking out to that opening game. Not until then will it hit that it feels real, that this is actually a World Cup on home soil with our friends and families in the stadium and fans. “It’s going to be a massive moment for women’s football, and football in general in Australia, and around the world as well. “I don’t think an opening game has been that big before — it’s insane to think about. I do think that’s going to be a game-changing moment and hopefully that continues throughout the tournament for the rest of our games in the group stage and beyond that as well. “It’s hard not to let your mind wander to that moment. But also there’s there’s a lot to be done before then. “So yeah, it’s definitely going to be one to remember and a special one and I guess that’s why we want to make the most of it. We need leave no stone unturned along the way.”","pubDate":"2023-06-16 23:00:00","image_url":"https://images.7news.com.au/publication/C-10864270/e20433de6e98048b53005c89d9ee0f9e927caffa-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"Bosso in turmoil… Auditors quit amid threats, tensions","link":"https://www.chronicle.co.zw/bosso-in-turmoil-auditors-quit-amid-threats-tensions/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Ricky Zililo ricky.zililo@chronicle.co.zw HIGHLANDERS Football Club is facing a crisis that threatens its reputation and financial stability. Recent events have unfolded, leading to the resignation of the club’s auditors, PNA Chartered Accountants, Saturday Chronicle can exclusively reveal. PNA Chartered Accountants’ decision comes in the wake of escalating tensions and disagreements within the club’s leadership, with […]","content":"The Chronicle HIGHLANDERS Football Club is facing a crisis that threatens its reputation and financial stability. Recent events have unfolded, leading to the resignation of the club’s auditors, PNA Chartered Accountants, Saturday Chronicle can exclusively reveal. PNA Chartered Accountants’ decision comes in the wake of escalating tensions and disagreements within the club’s leadership, with the executive committee and the board engaging in a bitter dispute. The auditors, unwilling to have their professional image tarnished, chose to sever ties with the club rather than compromise their integrity. Insiders within Highlanders have confirmed the resignation of the auditors and shed light on the circumstances that led to this drastic step. It appears that the auditors became increasingly disillusioned with the work environment, citing strained relations between the executive and the board as a primary concern. In fact, the auditors even revealed that they had been threatened with termination during the audit process, a troubling development that cast doubt on their ability to perform their duties impartially. Moreover, the auditors suspected a potential conspiracy to manipulate information provided to them during the audit. This discovery further eroded their trust in the club’s management. They were also dismayed by the lack of interest in implementing their recommendations, particularly in establishing proper structures within the club. Faced with these challenges, the auditors felt compelled to part ways with Highlanders and urged the club to seek alternative auditors for future financial assessments. During the presentation of the audited financial statements, the auditors highlighted the delayed completion of the audit, which could have been finalised as early as January. However, the club’s treasurer, Busani Mthombeni, had postponed the process, starting it only in October of the previous year. The auditors said commencing the audit earlier would have resolved numerous issues and expedited the reporting process. Earlier in January, Highlanders had conducted their annual general meeting without presenting the financial report, as a disagreement arose between the club and the auditors regarding the reporting currency. While the club had prepared the financial statements in local currency, the auditors insisted on using foreign currency, considering the majority of Highlanders’ transactions were conducted in US dollars. This disagreement further strained the relationship between the auditors and the club. Throughout the audit, the auditors faced threats of termination due to their insistence on presenting the financial statements in foreign currency. Undeterred, they remained steadfast and resolute, emphasising their commitment to fulfilling their responsibilities and preserving their professional credibility. Consequently, upon completing the audit, the auditors issued an adverse opinion on Highlanders’ financials, effectively conveying their inability to endorse the authenticity of the club’s financial statements. This adverse opinion casts a negative light on the institution and raises concerns among stakeholders, including sponsors, who may question the club’s financial stability and reliability. In addition to their adverse opinion, the auditors flagged several issues during the audit process. They discovered transactions that lacked supporting documentation, prompting the club’s finance department to retrieve the necessary records. These findings further exacerbated the auditors’ concerns and contributed to their adverse opinion. The auditors expressed the need for Highlanders’ accounting department to enhance its capacity and understanding of modern auditing practices. They encouraged the club to establish an independent internal audit team that would oversee the accounts throughout the year, providing an additional layer of checks and balances. One particular area of concern highlighted by the auditors was the club’s inability to properly account for funds raised by supporters’ chapters. The auditors discovered that some funds, raised on behalf of Highlanders, were being held by a chapter within the club. Such discrepancies raise questions about the club’s financial management and transparency. Additionally, the auditors noted inconsistencies in the recording of cash collected at the clubhouse and when recorded at Highlanders’ offices, despite the close proximity of these establishments on Robert Mugabe Way, a mere four streets apart. These discrepancies in cash handling added to the auditors’ apprehension and underscored the need for improved financial controls within the club. The auditors believed that implementing an internal audit process would help mitigate these issues and ensure greater accuracy and accountability in financial reporting. With their departure, Highlanders now faces the arduous task of investigating the financials and seeking to obtain a more favourable opinion to restore stakeholders’ confidence. This includes sponsors who may view the club as a less secure investment opportunity given the adverse opinion issued by the auditors. The resignation of the auditors serves as a wake-up call for Highlanders, highlighting the urgent need for improved governance, transparency, and financial management within the club. It is imperative for the executive committee and the board to address their differences and establish a harmonious working relationship that prioritizes the club’s long-term success and reputation. Repeated efforts to get comment from Highlanders were fruitless, with club spokesperson Nozibelo Maphosa saying she was waiting for the chief executive officer Ronald Moyo who in turn said he was yet to get a response from his superiors. @ZililoR","pubDate":"2023-06-16 22:04:18","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gabriel Nyoni wants to play football again","link":"https://www.chronicle.co.zw/gabriel-nyoni-wants-to-play-football-again/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Innocent Kurira kuriralnnocent@gmail.com “The pain is excruciating,” Gabriel Nyoni cried, his voice filled with desperation, as he stood on the precipice of uncertainty. These were the moments before he would enter the operation room, prepared to undergo foot surgery that was necessary after a devastating injury he sustained during a GladAfrica Championship match against Richards […]","content":"The Chronicle “The pain is excruciating,” Gabriel Nyoni cried, his voice filled with desperation, as he stood on the precipice of uncertainty. These were the moments before he would enter the operation room, prepared to undergo foot surgery that was necessary after a devastating injury he sustained during a GladAfrica Championship match against Richards Bay in February 2021 at the Umhlathuze Sports Complex Grounds in Richards Bay. As he uttered his plea, Nyoni’s prayers seemed to be answered. The surgery was successful, but the doctor delivered a sobering revelation. If the surgery had been delayed even slightly, Nyoni’s leg might have faced amputation due to compartment syndrome. At first glance, Nyoni’s leg injury appeared to be a minor setback. However, it posed a significant threat to his career. The speedster had suffered severe fractures in his foot, necessitating the use of wires and pins to stabilise the bones. Doubt shrouded Nyoni’s return to the field of play. Injuries have long been considered the ultimate adversary for athletes, prematurely ending numerous promising careers. Yet, Nyoni is among the courageous few who refuse to succumb to such a fate. He is determined to make a comeback after this grave injury, following in the footsteps of players like Shacky “Master Goals” Tauro, Johannes Ngodzo, Samson Choruwa, and Desmond “Gazza” Maringwa, whose own careers were destroyed by injuries. “Life is unpredictable,” Nyoni reflects, his voice tinged with wisdom. “Today, you may have grand plans to become one of the best soccer players of your generation, and tomorrow, you find yourself waking up in a hospital, facing the possibility of amputation. Life, whether good or bad, simply happens. It reminds me of the story of Job in the Bible.” Although the doctors have confirmed that his foot has fully recovered, there remains a risk in playing with it. The final decision lies with Nyoni himself. “Truthfully, I didn’t retire on my own terms, and it continues to bother me to this day,” Nyoni confides. “I would love to retire on my own terms. My business now runs smoothly without my constant presence, so I feel I can play more freely. I believe I have two or three more years, and then I will call it a day.” Having expressed his eagerness to return to the field of play, Nyoni holds no specific destination in mind. “Wherever a team is willing to give me an opportunity to revive my career, that’s where I’ll go. Of course, my former teams like Highlanders and CAPS United hold a special place in my heart, so they are my first preferences,” Nyoni reveals. While adversity has marked Nyoni’s journey, he has not allowed misfortune to define him. He ventured into the perfume manufacturing business, crafting 100 percent undiluted, long-lasting oil-based perfumes inspired by renowned designer brands. It was a new chapter in his life that began when he left Highlanders to join CAPS United in 2019, then moved to Maritzburg United in South Africa before ultimately finding himself with Cape Umoya in the GladAfrica Championship. @innocentskizoe","pubDate":"2023-06-16 22:03:57","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"The remarkable journey of Chamunorwa Maphosa and Makokoba Tigers FC","link":"https://www.chronicle.co.zw/the-remarkable-journey-of-chamunorwa-maphosa-and-makokoba-tigers-fc/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Lovemore Dube lovemore.dube@chronicle.co.zw SO many real heroes live in our midst but are rarely celebrated for unearthing gems that the country has celebrated on the field, courts, tracks and roads in Zimbabwean sport. Beginning today Saturday Chronicle will run a weekly column that seeks to unearth those community and sport champions that you don’t know […]","content":"The Chronicle SO many real heroes live in our midst but are rarely celebrated for unearthing gems that the country has celebrated on the field, courts, tracks and roads in Zimbabwean sport. Beginning today Saturday Chronicle will run a weekly column that seeks to unearth those community and sport champions that you don’t know but built the foundation of many a star. Today we feature little known Chamunorwa Maphosa of Makokoba Tigers FC, a team with juniors who play in the Bulawayo Province Junior Soccer League. Despite handling the likes of Nqobizitha Masuku and Godfrey Makaruse both of whom have made names for themselves in Zimbabwe football, Maphosa is among thousands whose great work was hijacked. This came by after their products’ brilliance got a platform to be amplified elsewhere. Not every good player started at Highlanders, AmaZulu, Bulawayo Wanderers, Railstars and Zimbabwe Saints. There are so many relatively obscure clubs and individuals like Maphosa who crafted the script that made Peter Ndlovu, Honour Gombami, Thulani Ncube, Zenzo Moyo, Thabani Moyo, Thabani Masawi and Innocent and Rahman Gumbo who have seen recognition elude them. Touched by seeing some boys from his EmaTongeni neighbourhood of Makokoba Flats, Maphosa decided promptly to save them. “I could not stand seeing the boys arrested regularly for stealing minor stuff like shoe polish. What touched me most was that a stone’s throw at the Lobengula Street Park, there would be some of their colleagues playing near Gertrude Hostel I then set it upon myself to have the boys playing there regularly. That gave birth to Makokoba City Warriors. “We started in Division Three and we were promoted up to Division One. We have produced players like Nqobizitha Masuku who now plays in Botswana and Highlanders’ Godera, Godfrey Makaruse. There are so many like Matriples Muleya who is at Triangle, Nickson Gama who is at Bulawayo Chiefs, Brendon Mpofu who is at Dynamos, Gillian Nyathi, Darlington Munkuli and Prince Ndlovu who are at Highlanders,” said Maphosa. Maphosa, 70, said eight players were this year released to Highlanders FC’s development side who in return gave them 10 soccer balls. “We are happy to see our local club that I support Highlanders FC getting our players. We are doing a great job of ensuring that our teams do not buy players from elsewhere but use home grown talent,” said Maphosa. Raising a child, Maphosa says, is a community responsibility hence his efforts of trying to develop very positive youngsters from Makokoba. “In the community I always try to ensure our children are kept occupied and with high moral values. Now I’m playing the overseer role, there is Wilton Kwenda my former player standing in as coach. Whenever there are disciplinary issues I do not hesitate to come and deal with it even to an extent of tearing the youngster’s Zifa licence. Discipline is a foundation pillar for my boys, that is why I came to work with them even sacrificing going to church just to be with the team,” said Maphosa. As a community builder, he said it is ever painful at times plucking a boy who is a bad influence out of the group as soccer teams are a small society expected to correct wayward characters. “It pains to tell the boy to go home or join another club. We are parents, it is our failure so we have to correct some of these kids early,” said Maphosa whose football team is based at Thabiso Youth Centre where they moved to from the Lobengula Street Park as City Warriors before changing to Tigers. He said changing to Tigers FC was forced by financial challenges. “That has been our biggest challenge in the last 23 years. We have no steady sponsorship, we rely on donations from members of our community with Rambo Milo, Ngoni Nyakudziwanza, Shadreck Sibanda, James Sithole and one Ossie from South Africa keeping us going. “We are dreaming big, we need sponsorship for the boys. Our approach is two-fold, we want them kept away from crime and at the same time pave their paths towards playing as professional footballers. Some have gone through our systems in the past 23 years and gone all the way to stardom,” said Maphosa. He recalls Methembe Ndlovu, the former Highlanders midfielder and coach, coming to Thabiso and talking to them under a tree on the northern tip of the field at Thabiso. “Methembe said there was something happening that he needed Nqobizitha Masuku for, the rest is history, the boy never came back and rose to one of the best players around through Bantu Rovers,” said Maphosa. He bemoaned big clubs’ bullying tactics where they get talent from small teams and do not compensate. “We make stars. Appreciate us, invest in us and we will give you more and don’t forget to acknowledge where you tapped from,” said Maphosa who in his younger days played for Matabeleland High City alongside Albert “Ali” Dube when he arrived from Buhera in 1974. Maphosa also played for Chronicle FC in Division One alongside Joshua Mutize and Gibson Bhinya. With support, these obscure football projects can achieve more and the coaches and officials running the teams are sport’s unsung heroes. Most of those hogging the limelight found stars ripe and ready and simply provided a platform to be the national and international showcase.","pubDate":"2023-06-16 22:01:23","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Colorado football coach Deion Sanders might have to have left foot amputated","link":"https://helenair.com/sports/college/colorado-football-coach-deion-sanders-might-have-to-have-left-foot-amputated/article_7bb28f83-8a05-5d36-965b-7a7ac654b8e7.html","keywords":null,"creator":["Associated Press"],"video_url":null,"description":"New University of Colorado head football coach Deion Sanders faces the possibility of having his left foot amputated as a result of continuing bloodflow issues. Sanders had two toes amputated from his left foot in 2021 while he was coaching…","content":"Deion Sanders might lose his left foot as a result of circulation issues that forced him to have two toes amputated in 2021. Sanders allowed camera crews with \" Thee Pregame Show \" to film a meeting with his medical team at the University of Colorado, where he’s preparing for his first season as head football coach. In at 11-minute segment released Friday on YouTube, Sanders met with orthopedic surgeon Dr. Ken Hunt, vascular surgeons Dr. Donald Jacobs and Dr. Max Wohlauer and athletic trainer Lauren Askevold to discuss his daily pain levels and possible next steps. “You just have to understand what the risks are. Things can cascade,” Jacobs said, adding that Sanders might not just lose another toe but \"he could lose the foot.” “Well, I know what risks are,\" Sanders replied. “I only have eight toes. So, I’m pretty sure I understand.” Sanders said he has no feeling on the bottom of his left foot and said if a procedure is recommended he wants to get it done right away because once the season starts he'll too busy. “I want to do it this summer because when we get rolling, I’m not going to have time to do it,” Sanders said. “This is the best downtime I have.” Sanders missed three games at Jackson State in 2021 after having two toes amputated during the season. Sanders took over the downtrodden Buffaloes program in December following Colorado's 1-11 season in 2022. His hiring has led to a resurgence of interest in the program that's had just two winning seasons since 2016, one of those was a 4-2 mark during the pandemic season of 2020. The Buffs sold out their spring game in April and has sold out its season ticket allotment for the first time in nearly three decades. Colorado opens at TCU on Sept. 2 and hosts former Big 12 rival Nebraska a week later at Folsom Field.","pubDate":"2023-06-16 21:52:00","image_url":"https://bloximages.chicago2.vip.townnews.com/helenair.com/content/tncms/assets/v3/editorial/3/61/36101750-ea67-59f4-8c3e-4b1b1de58d56/648cdaf172ecb.image.jpg?resize=300%2C200","source_id":"helenair","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Warren's Terence Roberson has good showing at UA","link":"https://www.nwahomepage.com/sports/pig-trail-nation/hogville-hog-recruiting/warrens-terence-roberson-has-good-showing-at-ua/","keywords":["Hogville, Hog Recruiting","Pig Trail Nation"],"creator":["Otis Kirk"],"video_url":null,"description":"Warren offensive lineman Terence Roberson was among the top campers at Arkansas on Friday.","content":"Photo by Otis Kirk. by: Posted: Updated: FAYETTEVILLE — Warren Class of 2024 offensive lineman Terence Roberson was among the top standouts at Arkansas’ football camp on Friday. Roberson, 6-4 1/2, 292 (both without shoes), owns a 3.95 grade-point average and showed on Friday he has the talent to play at high level in college. “It went good today,” Roberson said. “I learned a lot. It’s a great experience. I came here last year and also learned a lot. It’s a really good atmosphere here and I enjoy it a lot.” Sam Pittman, Arkansas’ head football coach, is a former offensive line coach. That appeals to Roberson. “I think he has done a great job here at Arkansas,” Roberson said. “He loves O-line and I like that about him too. I think he’s going to do a whole more in the future.” Roberson worked with Cody Kennedy on Friday. Kennedy is Arkansas’ offensive line coach. “Last year I learned a lot from him too,” Roberson said. “Great coach. He (his personality) reminds me of our O-line coach.” Roberson has offers to UAPB and Arkansas-Monticello. What would an offer to Arkansas mean to you? “It would mean a lot,” Roberson said. “Whole bunch of guys from my town have came here and gone to the NFL. So I think it would be a great feeling.” Roberson said the area where he needs to make the most improvement is his foot work. He also talked about his strengths on the field. “Just pushing through and trying to get better,” Roberson said. Roberson comes from a program that’s very well-coached and competitive each season. He talked about playing for the Lumberjacks. “It’s a great feeling,” Roberson said. “We have a good support system. We just go out there and work everyday and do the best we can.” He talked about how good Warren can be this fall and his goals. “I think we will be good. We’re going to come back bigger and stronger than last year. Get better and get a state championship.” Click for highlights. Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.","pubDate":"2023-06-16 21:41:09","image_url":"https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/06/Terence-Roberson.jpg?w=900","source_id":"nwahomepage","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Sources: SDSU tells Mtn. West of exit intentions","link":"https://www.espn.com/college-sports/story/_/id/37864747/sources-san-diego-st-tells-mountain-west-plans-exit?device=featurephone","keywords":null,"creator":null,"video_url":null,"description":"San Diego State gave the Mountain West written notice this week that the school \"intends to resign,\" sources told ESPN's Pete Thamel, but questions remain.","content":"San Diego State gave the Mountain West written notice this week that the school \"intends to resign from the Mountain West Conference,\" sources told ESPN. In a letter, the school asked the Mountain West for a \"one-month extension given unforeseen delays involving other collegiate athletic conferences beyond our control.\" As of now, there does not appear to be an invitation to San Diego State from a Power 5 conference. The withdrawal letter, which came from San Diego State president Adela de la Torre on Tuesday, brought complexities and prompted a tense back-and-forth between the league and the school. SDSU subsequently informed the league that the letter was \"not the official notice of resignation,\" according to sources. San Diego State would need to give a year of notice to withdraw next June. If it waits past June 30, the exit fee it would owe jumps from nearly $16.5 million to nearly $34 million. SDSU has long been linked to the Pac-12, which is in the midst of a protracted process of landing a television contract. There has been no formal invitation for the school to join the league, and the timeline for such a move has been linked to either the Pac-12's television deal or the departure of a Pac-12 member. \"San Diego State does not have an offer from the Pac-12,\" according to a source. San Diego State is attempting to explore all options if the Pac-12 doesn't get a TV deal done by June 30, according to a source. The school has also been part of the Big 12's realignment exploration, and there have been conversations, per a source. But sources say neither side has prioritized the other to this point. \"SDSU is exploring all of the options and asking all the questions,\" the source said. \"The intention of the June 13 letter wasn't that San Diego State is exiting.\" Along with the one-month extension requested in Tuesday's letter, the school also asked the league to consider discussing the exit fee. SDSU noted the income the Aztecs have generated for the Mountain West through the NCAA basketball tournament -- estimated this March to be at least $10 million -- none of which it see if it leaves the league. San Diego State requested that a four-year installment plan be considered for the exit fee. As of now, SDSU would have to pay the fee by June 2024, which would include the league withholding payment of its distribution to the school. The Mountain West responded, informing the school in a letter Wednesday that the conference had accepted the letter of withdrawal and that the consequences of the move had begun. Those include that de la Torre's seat on the MW board of directors is being pulled and that under league policies, its financial obligation tied to withdrawal will be withheld. That prompted another communication from San Diego State to clarify that the June 13 letter was not an official resignation, just a request for an extension. It also asked that no payments be withheld. Mountain West schools are expecting a check for nearly $6 million in the upcoming weeks. \"They're trying to find out what we're willing to do,\" a Mountain West source briefed on the exchange said. \"They want to see if the Mountain West Conference is going to handle this nicely. Well, that's not going to happen. Everyone wants to find the best financial path for themselves, and it's clunky.\" The Mountain West Conference held a call with athletic directors Thursday afternoon that detailed the back-and-forth between the league and San Diego State. The news didn't come as a surprise, as SDSU athletic director J.D. Wicker has spoken openly about switching leagues. Wicker told ESPN in March that SDSU would be \"ready to step into a power conference.\" He told CBS in January that the Pac-12 would want to give SDSU a full share of the media revenue to prevent the school from going to the Big 12 and having that league recruiting in the Pac-12's backyard. San Diego State has been in the Mountain West since 1999 and is arguably its top overall athletic department. SDSU reached the NCAA tournament title game in men's basketball this year and the football program has a new $300 million stadium. The football Aztecs have won 10 or more games five times since 2015. This isn't the first time that San Diego State has attempted to leave the Mountain West. According to a 2011 announcement, San Diego State agreed to join the Big East as a football-only member starting in July 2013. In January 2013, the Mountain West presidents voted to allow San Diego State to return all sports to the league. With USC and UCLA moving to the Big Ten in 2024, San Diego State's allure has increased for leagues, as the school offers a toehold in the Southern California market.","pubDate":"2023-06-16 21:30:47","image_url":null,"source_id":"espn","category":["sports"],"country":["australia","canada","united kingdom","india","singapore","united states of america"],"language":"english"},{"title":"Who are the top four newcomers to the B.C. Lions?","link":"http://vancouversun.com/sports/who-are-the-top-four-newcomers-to-the-b-c-lions/wcm/5a010d73-2049-4a23-a915-6effa19b8a8b","keywords":["BC Lions","CFL","Football","Sports"],"creator":["Lynn Mitges"],"video_url":null,"description":"They're new to the B.C. Lions, or maybe just new to you, but here's four newcomers to keep an eye on","content":"Article content It’s one game into the CFL season for the B.C. Lions. Long enough to see this team has some talent, but not long enough to know who they are. Article content Here are the top five newcomers — and sort of newcomers — to watch for when the Lions take on the Edmonton Elks in Saturday’s home-opener at B.C. Place. (4 p.m., TSN, AM730): Article content He was gifted the name ‘Smoke’ by his high school coach, because when he was used as a tackling dummy in Grade 9 for the varsity team, none of them could tackle him. It was, “like trying to grab smoke with your hand.” The same could be said of his football career, which has been a long, hard road to his new home with the Lions. His game is built on explosiveness and an ability to turn a seam into an open door, which he did at the University of Virginia, where he was the only player in ACC history to amass 1,500 yards in both rushing and receiving. Article content He’s made for the pass-happy CFL game with its wider field — or the CFL game was made for him, if you should ask him. “It definitely is. Every day it’s just been fun,” he said. “I’m still getting used to the field being so huge. I feel like each week I’m gonna get better-and-better, and you’ll be able to see that. “(The larger field) gives me more room when I have to run East-West … But I don’t want people to stereotype me. ‘Oh, he’s just an East-West type of guy.’ I want to be able to show that I’m gonna block, run downhill, but when it is time to run East-West, I’m gonna be able to do it.” “He’s done a great job in training camp, great job learning the offence and the CFL game,” said offensive coordinator Jordan Maksymic. “So just to see his rise from a rookie to what he’s doing now and how comfortable he is with the system and CFL defences at this point, he definitely checks that (standout newcomer) box.” Article content Article content As a kid in Detroit, Siddiq played soccer until racking up a few too many red cards made him realize he was destined for a more physical sport. The 6-foot-2, 245-pounder was one the seemingly endless stream of anonymous pre-training camp free agent signings in May, but separated himself from the pack. The rookie out of Central Michigan and UNC-Charlotte busted out the shovel celebration after planting Calgary Stampeders quarterback Chris Reynolds in the B.C. Place turf during their pre-season game, right in line with his hard-working, high energy playing style. “I honestly think that the sleeper of everybody, futuristically, is gonna be Siddiq,” said defensive coordinator Ryan Phillips. “He’s a defensive end, playing special teams now, but once you start seeing him get a little bit more involved in defence, I think he’s gonna take a valuable step for us. He presents a different dynamic; he’s that hybrid type of defensive end that you need in the CFL, a guy that can run like a linebacker … but has the pedigree and the weight of a defensive end.” Article content A complementary role player during his time with the Saskatchewan Roughriders, he had his best career game — and first touchdown — against the Lions. Now he hopes to have the best performances with the Leos. Last August he had six catches for 111 yards and a touchdown against B.C., definitely putting him on their radar when he became a free agent in February. After coming to B.C., he had a two-TD game against the Stamps in the pre-season, then made the biggest catch of the game late in last week’s regular-season matchup, a dynamic first-down snag that moved the chains and allowed B.C. to run out the clock. With Keon Hatcher on the six-game injured list, he’ll be pressed into starting service again this week. Article content “Justin’s been huge,” said Maksymic. “We told him in free agency that we wanted him to be a Swiss Army Knife, and that’s what he is. The Lions had to reshape their front five when Joel Figueroa and Peter Godber left in free agency, to Hamilton and Saskatchewan, respectively. Peirson, who’s spent all five years of his CFL career in B.C., has always been a serviceable stand-in, but has stepped up into a starter’s role at left guard this year. Article content Broxton, 30, started at both left tackle and left guard in the playoffs last season, and had what offensive lines’ coach Kelly Bates said was his best season in 2022. He’ll fill Fig’s spot. Both started last week, when B.C. was the only team not to give up a quarterback sack. “They’re not newcomers by any means,” said Maksymic. “The way that they’ve worked into those roles … they’re just super-solid over there. They graded out well and they were just really dependable.” Maksymic also added that Couture, whom they picked up in free agency from Winnipeg, has been exactly what they want in a veteran centre. “He’s stepped into the role as a captain of that offensive line and done everything we need. He’s a solid veteran there, mentally and physically.” Article content tw Article content Share this article in your social network Advertisement 1","pubDate":"2023-06-16 21:27:24","image_url":null,"source_id":"vancouversun","category":["sports"],"country":["canada"],"language":"english"},{"title":"Qualifications Euro 2024 : la France, l'Angleterre et la Suisse continuent leur sans-faute","link":"https://www.dhnet.be/sports/football/europe/2023/06/16/qualifications-euro-2024-la-france-langleterre-et-la-suisse-continuent-leur-sans-faute-EY3QGENLFVAMRGZV6G4GUYAN54/","keywords":["Europe"],"creator":["Belga  -"],"video_url":null,"description":"La France, l'Angleterre et la Suisse ont respectivement battu Gibraltar, Malte et Andorre vendredi, remportant chacune leur troisième victoire en autant de matchs dans les qualifications à l'Euro 2024 et se classant en tête de leur groupe.","content":"La France, l'Angleterre et la Suisse ont respectivement battu Gibraltar, Malte et Andorre vendredi, remportant chacune leur troisième victoire en autant de matchs dans les qualifications à l'Euro 2024 et se classant en tête de leur groupe. Dans le groupe B, la France n'a fait qu'une bouchée de Gibraltar. Les Bleus ont vite ouvert le score (3e) grâce à une tête d'Olivier Giroud. Mbappé sur pénalty (45e+3) et un autobut de Mouelhi (78e) ont permis à la France de creuser l'écart. Dans l'autre match du groupe, la Grèce a battu l'Irlande 2-1 et est désormais deuxième du groupe B. Le scénario était identique dans le groupe C, où l'Angleterre se déplaçait chez le petit poucet maltais. Les Three Lions ont profité d'un but contre-son-camp d'Apap (9e) pour ouvrir le score. Alexander-Arnold (28e), Kane (31e) et Wilson (83e) ont alourdi la marque. Dans l'autre match, l'Ukraine, menée 2-0 par la Macédoine du Nord, a renversé le match pour s'imposer 2-3. Les Ukrainiens sont deuxièmes avec trois points. Dans le groupe D, la Turquie s'est imposé en Lettonie (2-1) et a pris la tête du groupe avec six points, alors que l'Arménie a battu le Pays de Galles (4-2). Dans un groupe H équilibré, la Finlande et le Kazakhstan ont battu respectivement la Slovénie (2-0) et Saint-Marin (0-3). Ils partagent la tête du groupe avec la Slovénie (6 points chacun). Le Danemark a remporté sa première victoire en trois matchs, battant péniblement l'Irlande du Nord (1-0). Comme la France et l'Angleterre, la Suisse a aussi marqué neuf points en trois matchs après sa victoire à Andorre (1-2). Dans les autres matchs du groupe I, le Bélarus et Israël se sont neutralisés (1-1), tout comme le Kosovo et la Roumanie (0-0). Cette dernière est deuxième avec sept points.","pubDate":"2023-06-16 21:20:25","image_url":null,"source_id":"dhnet","category":["sports"],"country":["belgium"],"language":"french"},{"title":"Jamie Carragher makes exciting Trent Alexander-Arnold Liverpool prediction after England wonder show","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/trent-alexander-arnold-liverpool-carragher-27142337","keywords":["Sport"],"creator":null,"video_url":null,"description":"Trent Alexander-Arnold scored one goal and created another in a sensational performance for England against Malta","content":"Jamie Carragher believes the time will soon come when Trent Alexander-Arnold will be hitting double figures for both goals and assists after watching his sensational performance for England. , wearing the No.10 shirt, was handed a midfield role by Gareth Southgate for England's Euro 2024 qualifier in Malta. And the star certainly did not disappoint. It was his stunning through pass that set Bukayo Saka on the way to lay on England's opener, which came courtesy of a Ferdinando Apap own goal. And, on what was his 19th appearance for his country, Alexander-Arnold then scored himself with a typically brilliantly long-range strike. The 24-year-old was also involved in the third goal on the night, which came courtesy of the penalty spot, and was converted by captain Harry Kane. Substitute Callum Wilson later scored a spot-kick of his own as Southgate's side ran out comfortable 4-0 winners. And during the match, former Liverpool and England defender made an exciting observation about Alexander-Arnold, who toward the end of the 2022-23 campaign began to play - and impress - in midfield for his club side. Carragher tweeted: \"This midfield role for TAA (Trent Alexander-Arnold) will eventually become the norm for club and country! He creates plenty from full-back as he will in CM (centre-midfield), but the goal he has just scored will happen a lot more in midfield. \"He could get double figures in goals and assists playing further forward.\" In 273 appearances for Liverpool, Alexander-Arnold has scored 16 goals and has 71 assists to his name. England are back in action on Monday when they welcome North Macedonia to Old Trafford.","pubDate":"2023-06-16 21:03:23","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article26971553.ece/ALTERNATES/s98/0_JC.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"}]}