{"newsArray":[{"title":"Snl24.com | One Year On: Rulani Gives Saavedra Assessment & Reveals Challenge","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Mamelodi-Sundowns/mamelodi-sundowns-coach-rulani-mokwena-assesses-erwin-saavedras-first-year-at-chloorkop-20230209","keywords":null,"creator":null,"video_url":null,"description":"Mamelodi Sundowns coach Rulani Mokwena has given an assessment of Erwin Saavedra's time, exactly a year after the Bolivian made his debut for the DStv Premiership.","content":"Mamelodi Sundowns coach Rulani Mokwena has given an assessment of Erwin Saavedra's time, exactly a year after the Bolivian made his debut for the DStv Premiership. Saavedra was signed from Bolivar in the January transfer window last year, but his time at the has been affected by injury. This season, the 26-year-old has made five appearances, one more than he did last term. Coincidently, Saavedra made his debut against Sudanese side Al Hilal on February 11, 2022, and Sundowns are set to play the club on the same date this year. It's their opening group stage match for the 2022/23 edition of the Champions League. Whether or not Saavedra will feature this weekend, is unclear. \"It's been very difficult for him. It's not easy coming from a different country and it's not easy coming from an area where the football is different and the food is different. He comes into a country where he does not bring his family. He's got a newborn baby boy and it becomes difficult to be in South Africa without knowing how the boy is doing every single day. From a psychological perspective, you can understand the challenges that come into that space, apart from the injuries,\" Mokwena told media during a press conference ahead of the Champions League clash against Hilal. \"Already, if you get injured, you need a lot more social warmth because that helps more than anything else to recover from injuries. And then if there is a psychological hurdle to overcome, then it becomes even more difficult. \"He has played for the national team, which means he has played games of consequence and games of pressure. There is an interesting documentary of the Argentinean road to Qatar. One of the highlights is of Saavedra scoring against Argentina. He is a player who comes with competitive pedigree and you see the quality in the games he has played. From the football perspective, the adaptation is not too much of a challenge. It's just been the physical with regards to injuries and for me it's been the mental. But having said that, he is a player who shows incredible characteristics and we are still to see the best of him in Mamelodi Sundowns colours for sure.\"","pubDate":"2023-02-09 13:10:33","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | The Top 8 Goalscorers In 2022/23 CAFCL","link":"https://www.snl24.com/soccerladuma/International/African-Football/the-top-8-goalscorers-in-202223-caf-champions-league-20230209","keywords":null,"creator":null,"video_url":null,"description":"With CAF Champions League action set to resume this weekend with some blockbuster fixtures, here are the eight most prolific players in the competition so far this season.","content":"With CAF Champions League action set to resume this weekend with some blockbuster fixtures, here are the eight most prolific players in the competition so far this season. The 2022/23 edition of Africa's premier club competition makes its return this weekend, when the continent's superpowers look to begin their group-stage campaigns on the right note. The tournament's return starts with Egyptian giants Zamalek taking on Algerian Ligue Professionnelle 1 table-toppers CR Belouizdad, with White Knights star Zizo looking to add to his tally of five competition goals this season. The 26-year-old is currently second in the race for the competition's Golden Boot, two goals behind Young Africans forward Fiston Mayele, and with the Tanzanian outfit now out of the Champions League, Friday's encounter against the reigning Algerian champions presents the perfect opportunity for Zizo to usurp the Congolese. Just behind the Egypt international is the top goalscorer from last year's competition, Tiago Azulao, with the veteran Brazilian having scored in all but one of his Champions League appearances so far this season. Of his four goals, two were scored in South Africa when Petro de Luanda were able to overcome Cape Town City 3-0 in the first leg of their second-round encounter. Not only is the Petro captain the oldest among the eight highest-scoring forwards in the Champions League so far in this campaign, he is also the only non-African on the list. While Azulao may be the oldest, right behind him on the goalscoring chart is the youngest player on the list in Souaibou Marou. The 22-year-old's goalscoring prowess for Coton Sport caught the attention of many sides during the mid-season transfer window, and it is because of this that the Cameroonian will be unable to add to his Champions League tally this season, having signed for Orlando Pirates in January. You must be to read and post comments.","pubDate":"2023-02-09 12:41:30","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Once A Pirate! Modabi’s New Bucs Role Confirmed","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Orlando-Pirates/gerald-modabi-is-back-at-orlando-pirates-in-a-new-role-20230209","keywords":null,"creator":null,"video_url":null,"description":"The Siya crew can reveal that Gerald ‘Jomo’ Modabi is back at Orlando Pirates in a new role at the club.","content":"The Siya crew can reveal that Gerald ‘Jomo’ Modabi is back at Orlando Pirates in a new role at the club. Modabi played for the Buccaneers between 2006 and 2008 before he returned to Dynamos FC, which is where the Soweto giants had signed him from. In the earlier stages of his career, Modabi played for SuperSport United in the early 2000s, before featuring for Wits University, Silver Stars and Jomo Cosmos, among other clubs. While he didn’t play much during his time with Bucs, the Chiawelo-born star proved himself as a midfield strongman who gave opponents a tough time with his high work rate although it can be argued that his off-the-field antics affected his career. The 41-year-old has been spotted at Pirates and sources have confirmed to the Siya crew that he has joined the club as a coach in the youth ranks. “Gerald Modabi is back at Orlando Pirates and is with the development. He is coaching the club’s U19 team,” confirmed the source. Contacted for comment, Modabi refused to confirm his return to the Bucs on official appointment though he didn’t deny his presence at the club. “I’ve got a friend at Pirates and that is Joseph Makhanya who is my former teammate and I will visit now and again to talk about football,” he said. You must be to read and post comments.","pubDate":"2023-02-09 12:12:06","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Super Bowl has rare matchup of top 2 regular-season teams","link":"https://businessmirror.com.ph/2023/02/09/super-bowl-has-rare-matchup-of-top-2-regular-season-teams/","keywords":["Sports","Featured"],"creator":["The Associated Press"],"video_url":null,"description":"THIS year’s Super Bowl features a rare matchup of the National Football League’s (NFL) top two teams from the regular season.","content":"THIS year’s Super Bowl features a rare matchup of the National Football League’s (NFL) top two teams from the regular season. The and were the league’s only 14-game winners, marking just the sixth time since the 1970 merger that the squads with sole possession of the two best records in the regular season met for the championship. The last time it happened came after the 2013 season when Seattle beat Denver 43-8 in a matchup of 13-win teams. That blowout was relatively typical of these meetings, with the average margin of victory in the previous five powerhouse matchups being 21 points. The closest game was Washington’s 37-24 win over Buffalo following the 1991 season. The three others featured San Francisco beating Miami 38-16 after the 1984 season, Dallas topping Denver 27-10 to cap the 1977 season and Oakland beating Minnesota 32-14 the previous year. Since seeding began in 1975, this is the 15th time the top team in each conference made it to the Super Bowl. The previous time came after the 2017 season when the Eagles won their first Super Bowl championship by beating New England 41-33. This is also the third time both Super Bowl teams won at least 14 games in the regular season, although both Kansas City and Philadelphia needed wins in the added 17th game to get there. Atlanta and Denver did it in 16-game seasons in 1998, and Miami and San Francisco in 1984. The Chiefs and Eagles also have been in control all postseason, with neither team trailing in the playoffs. The only other times both Super Bowl teams did that came in the 2004 season (Patriots vs. Eagles), 1991 season (Bills vs. Washington) and 1966 season (Packers vs. Chiefs). PATRICK MAHOMES will try to do something that has never been done before in the NFL by following up a regular season when he led the league in yards passing with a Super Bowl title. Mahomes threw for 5,250 yards during the regular season—511 more than second-place Justin Herbert for the largest gap between first and second place since Kurt Warner beat out Peyton Manning by 699 yards in 2001. The only player to reach the Super Bowl after throwing for more yards in the regular season than Mahomes was Manning, with a record 5,477 in 2013. His Broncos lost 43-8 to Seattle in the Super Bowl. That was one of six times before Mahomes that the player who led the league in yards passing made it to the Super Bowl, with all of them losing. The others were Tom Brady (2017 season), Brady (2007), Rich Gannon (2002), Warner (2001) and Dan Marino (1984). CHIEFS coach Andy Reid joins Dan Reeves as the only coaches to face a franchise in the Super Bowl that they previously took to the big game. Reid coached the Eagles to their second Super Bowl following the 2004 season before getting fired after the 2012 season. He quickly built Kansas City into a power and now is ready for his fourth Super Bowl appearance as a head coach—the ninth coach to reach that mark. Reid will hope for better luck in his rematch than Reeves had after the 1998 season against a Denver organization he had guided to the Super Bowl in the 1986, ‘87 and ’89 seasons before losing all three. The Broncos beat Reeves and the Atlanta Falcons 34-19 in the Super Bowl. Two other coaches faced their former teams in the Super Bowl and ended up on the winning side: Jon Gruden led Tampa Bay past the Raiders after the 2002 season and Weeb Ewbank coached the Jets to a huge upset over the Colts following the 1968 season. The Eagles will be the sixth franchise to reach the Super Bowl under four coaches, with Nick Sirianni joining Doug Pederson, Reid and Dick Vermeil. The Raiders, 49ers, Colts and Rams all got there with four coaches, and the Broncos did it with a record five. CHIEFS tight end Travis Kelce has put together a playoff career topped perhaps only by the greatest receiver ever in Jerry Rice. Kelce has 127 catches in 17 career playoff games for 1,467 yards and 15 touchdowns. The only player to top any of those numbers was Rice, with 151 catches for 2,245 yards and 22 TDs in 29 playoff games. The Mahomes-Kelce connection also is one of the best, with their 13 TD passes in the playoffs trailing only the 15 Tom Brady threw to Rob Gronkowski. Image credits:","pubDate":"2023-02-09 11:43:42","image_url":null,"source_id":"businessmirror","category":["sports"],"country":["philippines"],"language":"english"},{"title":"Snl24.com | Messi's brother backtracks on shock 'Leo made Barca' claim","link":"https://www.snl24.com/KickOff/WorldNews/FC-Barcelona/lionel-messis-brother-matias-messi-backtracks-on-shock-leo-made-barcelona-claim-20230209","keywords":null,"creator":null,"video_url":null,"description":"Lionel Messi's brother Matias has backtracked after making the shock claim that Barcelona are only known because of the Paris Saint-Germain superstar.","content":"Earlier this week, Matias had suggested, via his son's Twitch channel, that the Blaugrana only became prominent in the football world because of his superstar brother. \"I don't know about you, but Barcelona became known thanks to Messi,\" he said during a live stream, per . \"Nobody knew about them before. \"Whoever's had the chance to go to Barcelona and see the museum, you can see that the museum is Messi.\" His words fuelled speculation there is a rift between Barca president Joan Laporta and Messi, with the player's brother also saying the Argentina captain would \"kick\" the president out if he returned to the Camp Nou following his shock departure from the Catalans in 2021. These comments, among a few others, were met with a lot of criticism, with many deeming them to be disrespectful towards the Catalan giants. Messi's entourage later moved to distance themselves from Matias' opinions, insisting that the player does not share the same views. Matias appears to have had a change of heart since, and has apologised for his comments. \"I want to apologise for what I said on social media, I was just joking with my son and friends,\" he wrote on Instagram, per . \"How can I think like that about a club as great as Barcelona, which has given so much to my family and Leo. \"I want to say sorry to everyone, specifically to all Barcelona fans.\" It remains to be seen if the 2022 FIFA World Cup winner, whose contract with PSG is set to expire in June, will ever return to the Spanish club, but Laporta has previously insisted he is open to the idea. You must be to read and post comments.","pubDate":"2023-02-09 11:14:28","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Ange Postecoglou to Leeds United resurrected as Andoni Iraola knocks back switch and Celtic boss back on radar","link":"https://www.dailyrecord.co.uk/sport/football/football-news/ange-postecoglou-leeds-united-resurrected-29172004","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ross Pilcher)"],"video_url":null,"description":"Postecoglou remains among the named candidates as the Elland Road club search for Jesse Marsch's replacement.","content":"Celtic manager Ange Postecoglou (Image: PA) Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Just when Celtic thought Leeds United had their new boss lined up, the possibility of an approach for Ange Postecoglou is alive again after their first choice said no. Rayo Vallecano boss Andoni Iraola looked set to bet Jesse Marsch’s replacement at Elland Road after he was sacked this week. But the Spaniard has now reportedly decided against making the move to Yorkshire, forcing the club hierarchy to move on to other targets. The Hoops are confident that Postecoglou has no desire to the leave Pakhead, as revealed by Record Sport on Tuesday, and would be happy for the club to reject any attempt by Leeds to poach the Aussie after a highly impressive 18 months in the East End of Glasgow. But with the English Premier League outfit keen to avoid a second successive relegation dogfight and their No 1 choice having rejected their advances, it’s back to the drawing board. Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles 5 infamous Rangers and Celtic manager tearups as rivalry returns in Beale and Postecoglou Feyenoord coach Arnie lot has emerged as the new favourite. However, Postecoglou remains in the mix, alongside former Wolves and Tottenham boss Nuno Espirito Santo and former River Plate head coach and Argentina international Marcello Gallardo. Caretaker boss Michael Skubala took charge of Leeds’ short trip to Old Trafford on Wednesday night. They led 2-0 thanks to goals from Wilfried Gnonto and a Rafael Varane OG. But Erik Ten Hag’s men fought back to level the score through Marcus Rashford and Jadon Sancho. The sides face each other again this weekend, this time at Elland Road. Skubala is likely to remain in charge at least until then, although a new arrivals in the dugout shouldn't be ruled out. READ NEXT: Read More Related Articles Giorgos Giakoumakis explains Celtic transfer exit as 'extra motivation' behind Atlanta United switch revealed Read More Related Articles Michael Beale stuck the Rangers needle in Ange with his 'lucky man' joust and got exactly what he wanted – Barry Ferguson Read More Related Articles The reason Celtic and Rangers are only clubs with VAR in operation this weekend in Scottish Cup Read More Related Articles Barry Ferguson dismisses Dwight Yorke's Aberdeen Old Firm split claims with old Blackburn mate 'on a different planet' Read More Related Articles Alistair Johnston in Celtic shoutout to underrated star as he marvels at Jota skills and ‘beautiful hair’ Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On English Premier League Ange Postecoglou Celtic FC Leeds United FC Scottish Premiership","pubDate":"2023-02-09 10:31:07","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article28951018.ece/ALTERNATES/s615/0_Ange-Postecoglou-File-Photo.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"5 infamous Rangers and Celtic manager tearups as rivalry returns in Beale and Postecoglou","link":"https://www.dailyrecord.co.uk/sport/football/5-infamous-rangers-celtic-manager-29170919","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Robbie Copeland)"],"video_url":null,"description":"Tensions often flare across the Glasgow divide and while the men in the dugout try to steer clear of controversy, it's not always easy keeping a cool head.","content":"Michael Beale and Ange Postecoglou (Image: Getty Images) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice No matter who is in the dugout for Rangers and Celtic, there's usually a mutual respect between the men in charge. But the Old Firm derby being what it is, there's always a bit of needle too. Ange Postecoglou and Michael Beale haven't gone at it hammer and tong on the touchline yet but the signs are there that there's a bit of tension simmering beneath the surface. From the Celtic boss' quip about being more concerned with what he's having for dinner than Beale's appointment, to his Rangers counterpart branding the Parkhead boss \"lucky\" in a pop at their resources, it's fair to say we're unlikely to see these two sitting down for dinner any time soon. Writing in his Record Sport column, Barry Ferguson revealed that's exactly how he likes it. He said: \"I’m all for a bit of cut and thrust where Beale and Postecoglou are concerned. I’ve seen some people react to it by saying Beale would eat himself if he was chocolate. And I’ve seen others try to claim Postecoglou is in danger of losing the plot because he won’t let the ‘lucky man’ quip lie. But what we really have here is two very clever managers who realise their success depends on bringing the other guy down. That’s not something to be criticised.\" Read More Related Articles Michael Beale stuck the Rangers needle in Ange with his 'lucky man' joust and got exactly what he wanted – Barry Ferguson Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp They're not the first two in the Glasgow dugouts to have a pop at one another, of course. Far from it. Here, Record Sport take a look at some of the other clashes down the years. Mowbray vs Smith Poor old Tony Mowbray, eh? The writing was on the wall for the beleaguered Englishman whose fate was sealed by a thrashing at St Mirren on a rainy night in March less than a year after taking the job. But while he only managed a single point from his three derbies as Celtic boss, he managed to get under the skin of opposing boss Walter Smith when he said he could never set his side up like Smith, who was known for his pragmatism. Tony Mowbray in 2010 during his stint as Celtic boss (Image: SNS Group) It proved to be a parting shot from Mowbray as he was sacked just days later but Smith jumped to the defence of his side's setup. He said: “It was Tony who brought it up. The first time it was in the context of setting teams up and what he would like to try to achieve in the longer term. I said that was all right if you have got a longer term. “He did it the other night again, but it doesn’t bother me. It’s not a bone of contention. It’s not something that would annoy me. If you look at every team throughout Europe, the balance between attack and defending is one of the hardest things to achieve.\" Smith vs Lennon The late, great Smith's final Old Firm derby was one of the less explosive clashes over the years but it wasn't without a controversy. The two sides battled out a 0-0 draw as Rangers went on to win the league by a single point in what would be their final league title for 10 years, but Smith was left raging by a penalty award. He took a pop at Celtic and Neil Lennon for \"asking for decisions\" after Allan McGregor saved a spot-kick from Georgios Samaras, claiming it wasn't a foul from Steven Davis on Anthony Stokes. He said: “It’s not a penalty kick. But they got it and Allan McGregor saved it and Celtic will be happy now because their whole campaign this season has been the fact they have been asking for decisions. \"Well, they got one today and Allan McGregor saved it. That’s it. The whole of the season, all we have heard is that Celtic don’t get penalty kicks.\" McCoist vs Lennon One of the enduring images of derbies in the modern era is that of Ally McCoist and Neil Lennon at each other's throats. The March 2011 derby was already guaranteed to go down in infamy after three red cards and 13 bookings but it was the touchline fracas between two of the men in the dugout that really sticks in the memory. Plus the fact the Scottish Government deemed it worthy to get involved. Dear God. Steven Whittaker, Madjid Bougherra and El-Hadj Diouf were all sent off in the Scottish Cup replay at Celtic Park as the home side fought – literally – to a narrow win. And when McCoist – then Walter Smith's No.2 – pointed the finger at Lennon at the full-time whistle, all hell broke loose. Lennon and McCoist had to be restrained following Celtic's fiery 1-0 Scottish Cup win (Image: Internet Unknown) Then-Celtic coach Alan Thompson later revealed: “I was stood so close that I clearly heard Ally tell Lenny, ‘And don’t you be speaking to my f***ing players like that’, only for Lenny to tell him, 'they’re not your f****** players, they’re Walter’s. “It’s never been disclosed what was actually said in over a decade now — but I’m telling you that was the spark that lit the fire and hell was hot. Lenny was right because Walter was the gaffer and Ally was only the No 2 at that time. Ally didn’t take well to that. The Rangers boys were all trying to say it was our fault but any team who receives three red cards in one match need to have a long hard look at themselves.” Kennedy vs Beale Rangers' win at Parkhead in late December 2019 was seen as one of the first major blows Steven Gerrard landed on Celtic as he chipped away at Lennon and eventually won the title in 2021. But it was the two assistants who stole the show after the fiery clash, where Nikola Katic struck a second-half winner and Alfredo Morelos was sent off in stoppage time. Beale, then Gerrard's right-hand man, also saw red after the game for a clash with Kennedy - who himself went on to have a spell as Celtic boss - that saw him get into it with the referee. He later explained: “In that moment, I assumed he said something I wouldn’t have liked him to say – and I told him that. You get carried away and I accused the ref of something you can’t do. Michael Beale and John Kennedy in a heated touchline exchange (Image: SNS Group) “It was just that game, that moment. Just two minutes before, I was so calm. I’m a little bit more mature now for that. It was part of my learning.” Kennedy meanwhile said at the time . “I’ve had a couple of people ask me about whether there was fighting in the tunnel. There was no such thing. It’s just the usual nonsense. It’s an emotional time. I know Michael very well and I have done since before he came to Rangers. We have spoken in the past. There is no issue with us. “He was in trouble with the officials, there was a bit of verbals, that’s it, end of. That’s the way it goes sometimes. The Hoops no.2 went on to assert that it “looked worse than it was” and said he’d “quite like to put it to bed.” Lennon vs Gerrard The same derby saw Gerrard tear onto the Celtic Park pitch to celebrate what was seen as a substantial victory for Rangers at the time and he later admitted he regretted it – as well as how he treated Lennon. But he said it was down to the \"winding up\" from the other side of the city. Speaking after taking the Aston Villa job, he said: \"Maybe going into the media, answering a few questions where I thought, 'I shouldn't have said that, why did I let myself get there?' There was once where we beat Celtic at Celtic Park. There had been a lot of mud flying in the media with pundits and ex players, it's not that I go and look for it. (Image: PA) \"We won at Celtic Park and I was probably a bit over the top with my celebrations, on the pitch and with Neil Lennon, which I regret. But at the same time it's like a constant wind-up from their side, all the success. I feel it. I'm emotional, I'm not perfect, but it's something I'm working on and getting better at. \"Balance is important. You've got to enjoy the wins because they're hard to get, and that's the good part. But at the same time people are looking to me and that's the reason it's important to be balanced.\" READ NEXT Read More Related Articles Giorgos Giakoumakis explains Celtic transfer exit as 'extra motivation' behind Atlanta United switch revealed Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Kyle Lafferty on the Rangers connection that made Linfield switch a 'no brainer' Read More Related Articles The reason Celtic and Rangers are only clubs with VAR in operation this weekend in Scottish Cup Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Celtic FC Rangers FC Michael Beale Ange Postecoglou Walter Smith Neil Lennon Ally McCoist John Kennedy Steven Gerrard Scottish Premiership Scottish Cup","pubDate":"2023-02-09 10:23:35","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171813.ece/ALTERNATES/s615/1_Rangers-FC-v-Celtic-FC-Cinch-Scottish-Premiership.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Aberdeen earn freedom of the city as Gothenburg greats honoured 40 years after Real Madrid triumph","link":"https://www.dailyrecord.co.uk/sport/football/aberdeen-earn-freedom-city-gothenburg-29171843","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ben Banks)"],"video_url":null,"description":"The famous Dons side will see a weekend of celebrations commemorate their big day.","content":"Aberdeen legends will be rewarded this spring (Image: SNS Group 0141 221 3602) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Aberdeen will be rewarded with the freedom of the city alongside their Gothenburg Greats side, on the 40th anniversary of their historic European Cup Winners’ Cup triumph. Celebrations will begin with a gala dinner on May 11th, 40 years to the day since the Dons beat Real Madrid under Sir Alex Ferguson's management in Gothenburg. There will be a special event at Pittodrie the following, at which the club and the Gothenburg Greats team will be presented with the Freedom of the City by the city's council. A weekend of, celebration will culminate with a homecoming game on the 13th or 14th, with the SPFL confirming a post-split Premiership game on that weekend for the side currently hunting a manager after Jim Goodwin's sacking. Aberdeen chairman Dave Cormack said: “Being awarded the Freedom of the City is a tremendous honour for the club and befitting of our greatest-ever team. The Gothenburg Greats have long been assured of their position as legends at the club and in the city but this special tribute further underlines their place in our history. To beat Real Madrid in a European final is an achievement that has only become increasingly impressive over the course of time. Read More Related Articles Alan Burrows to Aberdeen fast tracked by Motherwell as Fir Park chairman takes action to avoid 'awkwardness' Read More Related Articles Angus MacDonald takes on 'manic' Aberdeen and foundation juggling act as he opens up on cancer battle eye opener \"Winning the Cup Winners’ Cup and European Super Cup in 1983 was inspirational for the club and city; something that we should remember and cherish. This weekend of celebrations will allow our supporters to share in recognising these players and in celebrating with them.” Willie Miller was captain at the Ullevi Stadium and said: “It is difficult to believe that four decades have passed since that night in Gothenburg. We were all incredibly fortunate to be part of such great team and are honoured and humbled, in equal measure, by the celebratory events to commemorate our success being laid on by both the club and the city. “It will be an emotional weekend where we can reflect on what we achieved and mark what is still one of the best nights of our lives.” Aberdeen Lord Provost Dr David Cameron added: “I very much look forward to presenting the club and the Gothenburg Greats with the Freedom on the City. The club, with its rich history, and the European Cup Winners’ Cup team, with their giant-beating performances, have long been an inspiration for the whole city. “The Dons’ work within our local communities has also helped bring people together. The event in May promises to have all the excitement and sense of team spirit of the best football matches.” READ NEXT Read More Related Articles Stuart McKinstry approaching Leeds United exit door as Motherwell loan form sparks Premiership interest Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Barry Ferguson dismisses Dwight Yorke's Aberdeen Old Firm split claims with old Blackburn mate 'on a different planet' Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Champions League Sir Alex Ferguson Willie Miller Aberdeen FC Real Madrid CF Dave Cormack","pubDate":"2023-02-09 10:20:01","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171840.ece/ALTERNATES/s615/0_922761.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Davids aware of Chiefs danger ahead of sold out Ke Yona tie","link":"https://www.citizen.co.za/sport/soccer/local-soccer/davids-aware-of-chiefs-danger-ahead-of-sold-out-ke-yona-tie/","keywords":["Local Soccer","Arthur Zwane","Kaizer Chiefs","Nedbank Cup"],"creator":["Sibongiseni Gumbi"],"video_url":null,"description":"Speaking ahead of Maritzburg United's clash with Kaizer Chiefs in the Nedbank Cup first round, Fadlu Davids says Amakhosi are desperate.","content":"Maritzburg United coach Fadlu Davids does not need anyone to tell him how dangerous Kaizer Chiefs can be in cup games. ALSO READ: Maduka raves about Andile Mpisane, says ‘he has potential’ Speaking ahead of the two sides’ Nedbank Cup first round meeting at Harry Gwala Stadium on Friday, Davids said he knows Chiefs are desperate. The game is sold out already and it is expected to be a thrill-a-minute encounter with both teams playing attacking football. It has been over seven years now since Amakhosi won a trophy and Davids knows they will fancy their chances with the Ke Yona. “This is the competition they (Chiefs) will really focus on since they are playing for silverware and they will be playing to win,” said Davids this week. “So, you can expect an end-to-end game where both teams will be playing for the result,” promised the former Orlando Pirates coach. “I don’t think there is a team who will sit back and try to absorb pressure or hold on for a draw. “We are not playing for extra time, we will try to win the match – it will be an interesting match.” Maritzburg have not done well in the league and many would think they would be better served focusing more on that campaign. Relegation a real threat After 20 games, the Blue Army have collected 21 points and are 15th on the standings , three points ahead of Marumo Gallants behind them. “We know the league is the ultimate focus, but on the other hand a good performance can help build your team,” said Davids. “But we will approach it like we have approached other matches. We approach the game to win it. “We don’t go to any match to play for a draw because it doesn’t help us in a situation we are in.” What could be making Davids believe that his team have a chance of upsetting Chiefs in this match is that Arthur Zwane’s side have been blowing hot and cold. ALSO READ: Zwane aims to end Chiefs trophy drought with Nedbank Cup “It’s not only Chiefs’ problem, all the teams in the league except for (Mamelodi) Sundowns are not consistent. “They (Chiefs) are a very good team. We don’t take them lightly, we give them the respect they deserve. “And I think we need to commend them for the work they are doing,” added Davids who added that Zwane was doing well in the rebuilding of the Amakhosi team.","pubDate":"2023-02-09 10:11:33","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/Davids-1.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Stuart McKinstry approaching Leeds United exit door as Motherwell loan form sparks Premiership interest","link":"https://www.dailyrecord.co.uk/sport/football/stuart-mckinstry-approaching-leeds-united-29171525","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"The youngster has performed well in claret and amber but it doesn't look likely to be enough to stay a Premier League player.","content":"Stuart McKinstry during a Motherwell press conference (Image: SNS Group) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Leeds United are set to spark a summer transfer chase by releasing Stuart McKinstry after his loan at Motherwell ends. The Scotland U21s international is out of contract at the end of the season and his parent club in England's Premier League have yet to open talks. Leeds are without a senior manager following the sacking of Jesse Marsch, but the early indications are that they will let him go. A clutch of Scottish Premiership clubs would be interested in the winger alongside some English Championship teams, who are all watching him closely. The 20-year-old has spent this season out on loan at boyhood club Motherwell and has impressed this season in a struggling side that is battling relegation from the Premiership. McKinstry came through the ranks at Fir Park before he won a six figure move to Elland Road in 2021 and has been a key player for manager Steven Hammell. Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles Alan Burrows to Aberdeen fast tracked by Motherwell as Fir Park chairman takes action to avoid 'awkwardness' He's scored four time with two assists and has made two appearances at senior level with Leeds. Hammell - previously 'Well academy director - said in 2021 that his young starlet 'will do wonderful things and become a household name in the next three or four years.' Follow Record Sport on Twitter , Facebook and Instagram for all of the up-to-the minute breaking news, video and audio on the SPFL, the Scotland national team and beyond. You can also follow our dedicated Rangers and Celtic podcast pages and sign up to our newsletters to make sure you never miss a beat throughout the season. Read More Related Articles Angus MacDonald takes on 'manic' Aberdeen and foundation juggling act as he opens up on cancer battle eye opener Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Alan Burrows reveals Aberdeen fended off other SPFL clubs who wanted to nab him from Motherwell Read More Related Articles Tam McManus names 5 Hibs kids standouts as Dortmund heartbreaker stirs memory of Alex McLeish ear-bashing Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Motherwell FC Scotland U21s football team Transfer Talk Leeds United FC Scottish Premiership","pubDate":"2023-02-09 09:53:53","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171519.ece/ALTERNATES/s615/0_Motherwell-FC-Media-Access.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | One Year On: Rulani Gives Saavedra Assessment & Reveals Challenge","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Mamelodi-Sundowns/mamelodi-sundowns-coach-rulani-mokwena-assesses-erwin-saavedras-first-year-at-chloorkop-20230209","keywords":null,"creator":null,"video_url":null,"description":"Mamelodi Sundowns coach Rulani Mokwena has given an assessment of Erwin Saavedra's time, exactly a year after the Bolivian made his debut for the DStv Premiership.","content":"Mamelodi Sundowns coach Rulani Mokwena has given an assessment of Erwin Saavedra's time, exactly a year after the Bolivian made his debut for the DStv Premiership. Saavedra was signed from Bolivar in the January transfer window last year, but his time at the has been affected by injury. This season, the 26-year-old has made five appearances, one more than he did last term. Coincidently, Saavedra made his debut against Sudanese side Al Hilal on February 11, 2022, and Sundowns are set to play the club on the same date this year. It's their opening group stage match for the 2022/23 edition of the Champions League. Whether or not Saavedra will feature this weekend, is unclear. \"It's been very difficult for him. It's not easy coming from a different country and it's not easy coming from an area where the football is different and the food is different. He comes into a country where he does not bring his family. He's got a newborn baby boy and it becomes difficult to be in South Africa without knowing how the boy is doing every single day. From a psychological perspective, you can understand the challenges that come into that space, apart from the injuries,\" Mokwena told media during a press conference ahead of the Champions League clash against Hilal. \"Already, if you get injured, you need a lot more social warmth because that helps more than anything else to recover from injuries. And then if there is a psychological hurdle to overcome, then it becomes even more difficult. \"He has played for the national team, which means he has played games of consequence and games of pressure. There is an interesting documentary of the Argentinean road to Qatar. One of the highlights is of Saavedra scoring against Argentina. He is a player who comes with competitive pedigree and you see the quality in the games he has played. From the football perspective, the adaptation is not too much of a challenge. It's just been the physical with regards to injuries and for me it's been the mental. But having said that, he is a player who shows incredible characteristics and we are still to see the best of him in Mamelodi Sundowns colours for sure.\"","pubDate":"2023-02-09 13:10:33","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | The Top 8 Goalscorers In 2022/23 CAFCL","link":"https://www.snl24.com/soccerladuma/International/African-Football/the-top-8-goalscorers-in-202223-caf-champions-league-20230209","keywords":null,"creator":null,"video_url":null,"description":"With CAF Champions League action set to resume this weekend with some blockbuster fixtures, here are the eight most prolific players in the competition so far this season.","content":"With CAF Champions League action set to resume this weekend with some blockbuster fixtures, here are the eight most prolific players in the competition so far this season. The 2022/23 edition of Africa's premier club competition makes its return this weekend, when the continent's superpowers look to begin their group-stage campaigns on the right note. The tournament's return starts with Egyptian giants Zamalek taking on Algerian Ligue Professionnelle 1 table-toppers CR Belouizdad, with White Knights star Zizo looking to add to his tally of five competition goals this season. The 26-year-old is currently second in the race for the competition's Golden Boot, two goals behind Young Africans forward Fiston Mayele, and with the Tanzanian outfit now out of the Champions League, Friday's encounter against the reigning Algerian champions presents the perfect opportunity for Zizo to usurp the Congolese. Just behind the Egypt international is the top goalscorer from last year's competition, Tiago Azulao, with the veteran Brazilian having scored in all but one of his Champions League appearances so far this season. Of his four goals, two were scored in South Africa when Petro de Luanda were able to overcome Cape Town City 3-0 in the first leg of their second-round encounter. Not only is the Petro captain the oldest among the eight highest-scoring forwards in the Champions League so far in this campaign, he is also the only non-African on the list. While Azulao may be the oldest, right behind him on the goalscoring chart is the youngest player on the list in Souaibou Marou. The 22-year-old's goalscoring prowess for Coton Sport caught the attention of many sides during the mid-season transfer window, and it is because of this that the Cameroonian will be unable to add to his Champions League tally this season, having signed for Orlando Pirates in January. You must be to read and post comments.","pubDate":"2023-02-09 12:41:30","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Once A Pirate! Modabi’s New Bucs Role Confirmed","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Orlando-Pirates/gerald-modabi-is-back-at-orlando-pirates-in-a-new-role-20230209","keywords":null,"creator":null,"video_url":null,"description":"The Siya crew can reveal that Gerald ‘Jomo’ Modabi is back at Orlando Pirates in a new role at the club.","content":"The Siya crew can reveal that Gerald ‘Jomo’ Modabi is back at Orlando Pirates in a new role at the club. Modabi played for the Buccaneers between 2006 and 2008 before he returned to Dynamos FC, which is where the Soweto giants had signed him from. In the earlier stages of his career, Modabi played for SuperSport United in the early 2000s, before featuring for Wits University, Silver Stars and Jomo Cosmos, among other clubs. While he didn’t play much during his time with Bucs, the Chiawelo-born star proved himself as a midfield strongman who gave opponents a tough time with his high work rate although it can be argued that his off-the-field antics affected his career. The 41-year-old has been spotted at Pirates and sources have confirmed to the Siya crew that he has joined the club as a coach in the youth ranks. “Gerald Modabi is back at Orlando Pirates and is with the development. He is coaching the club’s U19 team,” confirmed the source. Contacted for comment, Modabi refused to confirm his return to the Bucs on official appointment though he didn’t deny his presence at the club. “I’ve got a friend at Pirates and that is Joseph Makhanya who is my former teammate and I will visit now and again to talk about football,” he said. You must be to read and post comments.","pubDate":"2023-02-09 12:12:06","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Super Bowl has rare matchup of top 2 regular-season teams","link":"https://businessmirror.com.ph/2023/02/09/super-bowl-has-rare-matchup-of-top-2-regular-season-teams/","keywords":["Sports","Featured"],"creator":["The Associated Press"],"video_url":null,"description":"THIS year’s Super Bowl features a rare matchup of the National Football League’s (NFL) top two teams from the regular season.","content":"THIS year’s Super Bowl features a rare matchup of the National Football League’s (NFL) top two teams from the regular season. The and were the league’s only 14-game winners, marking just the sixth time since the 1970 merger that the squads with sole possession of the two best records in the regular season met for the championship. The last time it happened came after the 2013 season when Seattle beat Denver 43-8 in a matchup of 13-win teams. That blowout was relatively typical of these meetings, with the average margin of victory in the previous five powerhouse matchups being 21 points. The closest game was Washington’s 37-24 win over Buffalo following the 1991 season. The three others featured San Francisco beating Miami 38-16 after the 1984 season, Dallas topping Denver 27-10 to cap the 1977 season and Oakland beating Minnesota 32-14 the previous year. Since seeding began in 1975, this is the 15th time the top team in each conference made it to the Super Bowl. The previous time came after the 2017 season when the Eagles won their first Super Bowl championship by beating New England 41-33. This is also the third time both Super Bowl teams won at least 14 games in the regular season, although both Kansas City and Philadelphia needed wins in the added 17th game to get there. Atlanta and Denver did it in 16-game seasons in 1998, and Miami and San Francisco in 1984. The Chiefs and Eagles also have been in control all postseason, with neither team trailing in the playoffs. The only other times both Super Bowl teams did that came in the 2004 season (Patriots vs. Eagles), 1991 season (Bills vs. Washington) and 1966 season (Packers vs. Chiefs). PATRICK MAHOMES will try to do something that has never been done before in the NFL by following up a regular season when he led the league in yards passing with a Super Bowl title. Mahomes threw for 5,250 yards during the regular season—511 more than second-place Justin Herbert for the largest gap between first and second place since Kurt Warner beat out Peyton Manning by 699 yards in 2001. The only player to reach the Super Bowl after throwing for more yards in the regular season than Mahomes was Manning, with a record 5,477 in 2013. His Broncos lost 43-8 to Seattle in the Super Bowl. That was one of six times before Mahomes that the player who led the league in yards passing made it to the Super Bowl, with all of them losing. The others were Tom Brady (2017 season), Brady (2007), Rich Gannon (2002), Warner (2001) and Dan Marino (1984). CHIEFS coach Andy Reid joins Dan Reeves as the only coaches to face a franchise in the Super Bowl that they previously took to the big game. Reid coached the Eagles to their second Super Bowl following the 2004 season before getting fired after the 2012 season. He quickly built Kansas City into a power and now is ready for his fourth Super Bowl appearance as a head coach—the ninth coach to reach that mark. Reid will hope for better luck in his rematch than Reeves had after the 1998 season against a Denver organization he had guided to the Super Bowl in the 1986, ‘87 and ’89 seasons before losing all three. The Broncos beat Reeves and the Atlanta Falcons 34-19 in the Super Bowl. Two other coaches faced their former teams in the Super Bowl and ended up on the winning side: Jon Gruden led Tampa Bay past the Raiders after the 2002 season and Weeb Ewbank coached the Jets to a huge upset over the Colts following the 1968 season. The Eagles will be the sixth franchise to reach the Super Bowl under four coaches, with Nick Sirianni joining Doug Pederson, Reid and Dick Vermeil. The Raiders, 49ers, Colts and Rams all got there with four coaches, and the Broncos did it with a record five. CHIEFS tight end Travis Kelce has put together a playoff career topped perhaps only by the greatest receiver ever in Jerry Rice. Kelce has 127 catches in 17 career playoff games for 1,467 yards and 15 touchdowns. The only player to top any of those numbers was Rice, with 151 catches for 2,245 yards and 22 TDs in 29 playoff games. The Mahomes-Kelce connection also is one of the best, with their 13 TD passes in the playoffs trailing only the 15 Tom Brady threw to Rob Gronkowski. Image credits:","pubDate":"2023-02-09 11:43:42","image_url":null,"source_id":"businessmirror","category":["sports"],"country":["philippines"],"language":"english"},{"title":"Snl24.com | Messi's brother backtracks on shock 'Leo made Barca' claim","link":"https://www.snl24.com/KickOff/WorldNews/FC-Barcelona/lionel-messis-brother-matias-messi-backtracks-on-shock-leo-made-barcelona-claim-20230209","keywords":null,"creator":null,"video_url":null,"description":"Lionel Messi's brother Matias has backtracked after making the shock claim that Barcelona are only known because of the Paris Saint-Germain superstar.","content":"Earlier this week, Matias had suggested, via his son's Twitch channel, that the Blaugrana only became prominent in the football world because of his superstar brother. \"I don't know about you, but Barcelona became known thanks to Messi,\" he said during a live stream, per . \"Nobody knew about them before. \"Whoever's had the chance to go to Barcelona and see the museum, you can see that the museum is Messi.\" His words fuelled speculation there is a rift between Barca president Joan Laporta and Messi, with the player's brother also saying the Argentina captain would \"kick\" the president out if he returned to the Camp Nou following his shock departure from the Catalans in 2021. These comments, among a few others, were met with a lot of criticism, with many deeming them to be disrespectful towards the Catalan giants. Messi's entourage later moved to distance themselves from Matias' opinions, insisting that the player does not share the same views. Matias appears to have had a change of heart since, and has apologised for his comments. \"I want to apologise for what I said on social media, I was just joking with my son and friends,\" he wrote on Instagram, per . \"How can I think like that about a club as great as Barcelona, which has given so much to my family and Leo. \"I want to say sorry to everyone, specifically to all Barcelona fans.\" It remains to be seen if the 2022 FIFA World Cup winner, whose contract with PSG is set to expire in June, will ever return to the Spanish club, but Laporta has previously insisted he is open to the idea. You must be to read and post comments.","pubDate":"2023-02-09 11:14:28","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Ange Postecoglou to Leeds United resurrected as Andoni Iraola knocks back switch and Celtic boss back on radar","link":"https://www.dailyrecord.co.uk/sport/football/football-news/ange-postecoglou-leeds-united-resurrected-29172004","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ross Pilcher)"],"video_url":null,"description":"Postecoglou remains among the named candidates as the Elland Road club search for Jesse Marsch's replacement.","content":"Celtic manager Ange Postecoglou (Image: PA) Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Just when Celtic thought Leeds United had their new boss lined up, the possibility of an approach for Ange Postecoglou is alive again after their first choice said no. Rayo Vallecano boss Andoni Iraola looked set to bet Jesse Marsch’s replacement at Elland Road after he was sacked this week. But the Spaniard has now reportedly decided against making the move to Yorkshire, forcing the club hierarchy to move on to other targets. The Hoops are confident that Postecoglou has no desire to the leave Pakhead, as revealed by Record Sport on Tuesday, and would be happy for the club to reject any attempt by Leeds to poach the Aussie after a highly impressive 18 months in the East End of Glasgow. But with the English Premier League outfit keen to avoid a second successive relegation dogfight and their No 1 choice having rejected their advances, it’s back to the drawing board. Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles 5 infamous Rangers and Celtic manager tearups as rivalry returns in Beale and Postecoglou Feyenoord coach Arnie lot has emerged as the new favourite. However, Postecoglou remains in the mix, alongside former Wolves and Tottenham boss Nuno Espirito Santo and former River Plate head coach and Argentina international Marcello Gallardo. Caretaker boss Michael Skubala took charge of Leeds’ short trip to Old Trafford on Wednesday night. They led 2-0 thanks to goals from Wilfried Gnonto and a Rafael Varane OG. But Erik Ten Hag’s men fought back to level the score through Marcus Rashford and Jadon Sancho. The sides face each other again this weekend, this time at Elland Road. Skubala is likely to remain in charge at least until then, although a new arrivals in the dugout shouldn't be ruled out. READ NEXT: Read More Related Articles Giorgos Giakoumakis explains Celtic transfer exit as 'extra motivation' behind Atlanta United switch revealed Read More Related Articles Michael Beale stuck the Rangers needle in Ange with his 'lucky man' joust and got exactly what he wanted – Barry Ferguson Read More Related Articles The reason Celtic and Rangers are only clubs with VAR in operation this weekend in Scottish Cup Read More Related Articles Barry Ferguson dismisses Dwight Yorke's Aberdeen Old Firm split claims with old Blackburn mate 'on a different planet' Read More Related Articles Alistair Johnston in Celtic shoutout to underrated star as he marvels at Jota skills and ‘beautiful hair’ Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On English Premier League Ange Postecoglou Celtic FC Leeds United FC Scottish Premiership","pubDate":"2023-02-09 10:31:07","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article28951018.ece/ALTERNATES/s615/0_Ange-Postecoglou-File-Photo.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"5 infamous Rangers and Celtic manager tearups as rivalry returns in Beale and Postecoglou","link":"https://www.dailyrecord.co.uk/sport/football/5-infamous-rangers-celtic-manager-29170919","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Robbie Copeland)"],"video_url":null,"description":"Tensions often flare across the Glasgow divide and while the men in the dugout try to steer clear of controversy, it's not always easy keeping a cool head.","content":"Michael Beale and Ange Postecoglou (Image: Getty Images) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice No matter who is in the dugout for Rangers and Celtic, there's usually a mutual respect between the men in charge. But the Old Firm derby being what it is, there's always a bit of needle too. Ange Postecoglou and Michael Beale haven't gone at it hammer and tong on the touchline yet but the signs are there that there's a bit of tension simmering beneath the surface. From the Celtic boss' quip about being more concerned with what he's having for dinner than Beale's appointment, to his Rangers counterpart branding the Parkhead boss \"lucky\" in a pop at their resources, it's fair to say we're unlikely to see these two sitting down for dinner any time soon. Writing in his Record Sport column, Barry Ferguson revealed that's exactly how he likes it. He said: \"I’m all for a bit of cut and thrust where Beale and Postecoglou are concerned. I’ve seen some people react to it by saying Beale would eat himself if he was chocolate. And I’ve seen others try to claim Postecoglou is in danger of losing the plot because he won’t let the ‘lucky man’ quip lie. But what we really have here is two very clever managers who realise their success depends on bringing the other guy down. That’s not something to be criticised.\" Read More Related Articles Michael Beale stuck the Rangers needle in Ange with his 'lucky man' joust and got exactly what he wanted – Barry Ferguson Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp They're not the first two in the Glasgow dugouts to have a pop at one another, of course. Far from it. Here, Record Sport take a look at some of the other clashes down the years. Mowbray vs Smith Poor old Tony Mowbray, eh? The writing was on the wall for the beleaguered Englishman whose fate was sealed by a thrashing at St Mirren on a rainy night in March less than a year after taking the job. But while he only managed a single point from his three derbies as Celtic boss, he managed to get under the skin of opposing boss Walter Smith when he said he could never set his side up like Smith, who was known for his pragmatism. Tony Mowbray in 2010 during his stint as Celtic boss (Image: SNS Group) It proved to be a parting shot from Mowbray as he was sacked just days later but Smith jumped to the defence of his side's setup. He said: “It was Tony who brought it up. The first time it was in the context of setting teams up and what he would like to try to achieve in the longer term. I said that was all right if you have got a longer term. “He did it the other night again, but it doesn’t bother me. It’s not a bone of contention. It’s not something that would annoy me. If you look at every team throughout Europe, the balance between attack and defending is one of the hardest things to achieve.\" Smith vs Lennon The late, great Smith's final Old Firm derby was one of the less explosive clashes over the years but it wasn't without a controversy. The two sides battled out a 0-0 draw as Rangers went on to win the league by a single point in what would be their final league title for 10 years, but Smith was left raging by a penalty award. He took a pop at Celtic and Neil Lennon for \"asking for decisions\" after Allan McGregor saved a spot-kick from Georgios Samaras, claiming it wasn't a foul from Steven Davis on Anthony Stokes. He said: “It’s not a penalty kick. But they got it and Allan McGregor saved it and Celtic will be happy now because their whole campaign this season has been the fact they have been asking for decisions. \"Well, they got one today and Allan McGregor saved it. That’s it. The whole of the season, all we have heard is that Celtic don’t get penalty kicks.\" McCoist vs Lennon One of the enduring images of derbies in the modern era is that of Ally McCoist and Neil Lennon at each other's throats. The March 2011 derby was already guaranteed to go down in infamy after three red cards and 13 bookings but it was the touchline fracas between two of the men in the dugout that really sticks in the memory. Plus the fact the Scottish Government deemed it worthy to get involved. Dear God. Steven Whittaker, Madjid Bougherra and El-Hadj Diouf were all sent off in the Scottish Cup replay at Celtic Park as the home side fought – literally – to a narrow win. And when McCoist – then Walter Smith's No.2 – pointed the finger at Lennon at the full-time whistle, all hell broke loose. Lennon and McCoist had to be restrained following Celtic's fiery 1-0 Scottish Cup win (Image: Internet Unknown) Then-Celtic coach Alan Thompson later revealed: “I was stood so close that I clearly heard Ally tell Lenny, ‘And don’t you be speaking to my f***ing players like that’, only for Lenny to tell him, 'they’re not your f****** players, they’re Walter’s. “It’s never been disclosed what was actually said in over a decade now — but I’m telling you that was the spark that lit the fire and hell was hot. Lenny was right because Walter was the gaffer and Ally was only the No 2 at that time. Ally didn’t take well to that. The Rangers boys were all trying to say it was our fault but any team who receives three red cards in one match need to have a long hard look at themselves.” Kennedy vs Beale Rangers' win at Parkhead in late December 2019 was seen as one of the first major blows Steven Gerrard landed on Celtic as he chipped away at Lennon and eventually won the title in 2021. But it was the two assistants who stole the show after the fiery clash, where Nikola Katic struck a second-half winner and Alfredo Morelos was sent off in stoppage time. Beale, then Gerrard's right-hand man, also saw red after the game for a clash with Kennedy - who himself went on to have a spell as Celtic boss - that saw him get into it with the referee. He later explained: “In that moment, I assumed he said something I wouldn’t have liked him to say – and I told him that. You get carried away and I accused the ref of something you can’t do. Michael Beale and John Kennedy in a heated touchline exchange (Image: SNS Group) “It was just that game, that moment. Just two minutes before, I was so calm. I’m a little bit more mature now for that. It was part of my learning.” Kennedy meanwhile said at the time . “I’ve had a couple of people ask me about whether there was fighting in the tunnel. There was no such thing. It’s just the usual nonsense. It’s an emotional time. I know Michael very well and I have done since before he came to Rangers. We have spoken in the past. There is no issue with us. “He was in trouble with the officials, there was a bit of verbals, that’s it, end of. That’s the way it goes sometimes. The Hoops no.2 went on to assert that it “looked worse than it was” and said he’d “quite like to put it to bed.” Lennon vs Gerrard The same derby saw Gerrard tear onto the Celtic Park pitch to celebrate what was seen as a substantial victory for Rangers at the time and he later admitted he regretted it – as well as how he treated Lennon. But he said it was down to the \"winding up\" from the other side of the city. Speaking after taking the Aston Villa job, he said: \"Maybe going into the media, answering a few questions where I thought, 'I shouldn't have said that, why did I let myself get there?' There was once where we beat Celtic at Celtic Park. There had been a lot of mud flying in the media with pundits and ex players, it's not that I go and look for it. (Image: PA) \"We won at Celtic Park and I was probably a bit over the top with my celebrations, on the pitch and with Neil Lennon, which I regret. But at the same time it's like a constant wind-up from their side, all the success. I feel it. I'm emotional, I'm not perfect, but it's something I'm working on and getting better at. \"Balance is important. You've got to enjoy the wins because they're hard to get, and that's the good part. But at the same time people are looking to me and that's the reason it's important to be balanced.\" READ NEXT Read More Related Articles Giorgos Giakoumakis explains Celtic transfer exit as 'extra motivation' behind Atlanta United switch revealed Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Kyle Lafferty on the Rangers connection that made Linfield switch a 'no brainer' Read More Related Articles The reason Celtic and Rangers are only clubs with VAR in operation this weekend in Scottish Cup Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Celtic FC Rangers FC Michael Beale Ange Postecoglou Walter Smith Neil Lennon Ally McCoist John Kennedy Steven Gerrard Scottish Premiership Scottish Cup","pubDate":"2023-02-09 10:23:35","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171813.ece/ALTERNATES/s615/1_Rangers-FC-v-Celtic-FC-Cinch-Scottish-Premiership.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Aberdeen earn freedom of the city as Gothenburg greats honoured 40 years after Real Madrid triumph","link":"https://www.dailyrecord.co.uk/sport/football/aberdeen-earn-freedom-city-gothenburg-29171843","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ben Banks)"],"video_url":null,"description":"The famous Dons side will see a weekend of celebrations commemorate their big day.","content":"Aberdeen legends will be rewarded this spring (Image: SNS Group 0141 221 3602) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Aberdeen will be rewarded with the freedom of the city alongside their Gothenburg Greats side, on the 40th anniversary of their historic European Cup Winners’ Cup triumph. Celebrations will begin with a gala dinner on May 11th, 40 years to the day since the Dons beat Real Madrid under Sir Alex Ferguson's management in Gothenburg. There will be a special event at Pittodrie the following, at which the club and the Gothenburg Greats team will be presented with the Freedom of the City by the city's council. A weekend of, celebration will culminate with a homecoming game on the 13th or 14th, with the SPFL confirming a post-split Premiership game on that weekend for the side currently hunting a manager after Jim Goodwin's sacking. Aberdeen chairman Dave Cormack said: “Being awarded the Freedom of the City is a tremendous honour for the club and befitting of our greatest-ever team. The Gothenburg Greats have long been assured of their position as legends at the club and in the city but this special tribute further underlines their place in our history. To beat Real Madrid in a European final is an achievement that has only become increasingly impressive over the course of time. Read More Related Articles Alan Burrows to Aberdeen fast tracked by Motherwell as Fir Park chairman takes action to avoid 'awkwardness' Read More Related Articles Angus MacDonald takes on 'manic' Aberdeen and foundation juggling act as he opens up on cancer battle eye opener \"Winning the Cup Winners’ Cup and European Super Cup in 1983 was inspirational for the club and city; something that we should remember and cherish. This weekend of celebrations will allow our supporters to share in recognising these players and in celebrating with them.” Willie Miller was captain at the Ullevi Stadium and said: “It is difficult to believe that four decades have passed since that night in Gothenburg. We were all incredibly fortunate to be part of such great team and are honoured and humbled, in equal measure, by the celebratory events to commemorate our success being laid on by both the club and the city. “It will be an emotional weekend where we can reflect on what we achieved and mark what is still one of the best nights of our lives.” Aberdeen Lord Provost Dr David Cameron added: “I very much look forward to presenting the club and the Gothenburg Greats with the Freedom on the City. The club, with its rich history, and the European Cup Winners’ Cup team, with their giant-beating performances, have long been an inspiration for the whole city. “The Dons’ work within our local communities has also helped bring people together. The event in May promises to have all the excitement and sense of team spirit of the best football matches.” READ NEXT Read More Related Articles Stuart McKinstry approaching Leeds United exit door as Motherwell loan form sparks Premiership interest Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Barry Ferguson dismisses Dwight Yorke's Aberdeen Old Firm split claims with old Blackburn mate 'on a different planet' Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Champions League Sir Alex Ferguson Willie Miller Aberdeen FC Real Madrid CF Dave Cormack","pubDate":"2023-02-09 10:20:01","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171840.ece/ALTERNATES/s615/0_922761.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Davids aware of Chiefs danger ahead of sold out Ke Yona tie","link":"https://www.citizen.co.za/sport/soccer/local-soccer/davids-aware-of-chiefs-danger-ahead-of-sold-out-ke-yona-tie/","keywords":["Local Soccer","Arthur Zwane","Kaizer Chiefs","Nedbank Cup"],"creator":["Sibongiseni Gumbi"],"video_url":null,"description":"Speaking ahead of Maritzburg United's clash with Kaizer Chiefs in the Nedbank Cup first round, Fadlu Davids says Amakhosi are desperate.","content":"Maritzburg United coach Fadlu Davids does not need anyone to tell him how dangerous Kaizer Chiefs can be in cup games. ALSO READ: Maduka raves about Andile Mpisane, says ‘he has potential’ Speaking ahead of the two sides’ Nedbank Cup first round meeting at Harry Gwala Stadium on Friday, Davids said he knows Chiefs are desperate. The game is sold out already and it is expected to be a thrill-a-minute encounter with both teams playing attacking football. It has been over seven years now since Amakhosi won a trophy and Davids knows they will fancy their chances with the Ke Yona. “This is the competition they (Chiefs) will really focus on since they are playing for silverware and they will be playing to win,” said Davids this week. “So, you can expect an end-to-end game where both teams will be playing for the result,” promised the former Orlando Pirates coach. “I don’t think there is a team who will sit back and try to absorb pressure or hold on for a draw. “We are not playing for extra time, we will try to win the match – it will be an interesting match.” Maritzburg have not done well in the league and many would think they would be better served focusing more on that campaign. Relegation a real threat After 20 games, the Blue Army have collected 21 points and are 15th on the standings , three points ahead of Marumo Gallants behind them. “We know the league is the ultimate focus, but on the other hand a good performance can help build your team,” said Davids. “But we will approach it like we have approached other matches. We approach the game to win it. “We don’t go to any match to play for a draw because it doesn’t help us in a situation we are in.” What could be making Davids believe that his team have a chance of upsetting Chiefs in this match is that Arthur Zwane’s side have been blowing hot and cold. ALSO READ: Zwane aims to end Chiefs trophy drought with Nedbank Cup “It’s not only Chiefs’ problem, all the teams in the league except for (Mamelodi) Sundowns are not consistent. “They (Chiefs) are a very good team. We don’t take them lightly, we give them the respect they deserve. “And I think we need to commend them for the work they are doing,” added Davids who added that Zwane was doing well in the rebuilding of the Amakhosi team.","pubDate":"2023-02-09 10:11:33","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/Davids-1.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Stuart McKinstry approaching Leeds United exit door as Motherwell loan form sparks Premiership interest","link":"https://www.dailyrecord.co.uk/sport/football/stuart-mckinstry-approaching-leeds-united-29171525","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"The youngster has performed well in claret and amber but it doesn't look likely to be enough to stay a Premier League player.","content":"Stuart McKinstry during a Motherwell press conference (Image: SNS Group) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Leeds United are set to spark a summer transfer chase by releasing Stuart McKinstry after his loan at Motherwell ends. The Scotland U21s international is out of contract at the end of the season and his parent club in England's Premier League have yet to open talks. Leeds are without a senior manager following the sacking of Jesse Marsch, but the early indications are that they will let him go. A clutch of Scottish Premiership clubs would be interested in the winger alongside some English Championship teams, who are all watching him closely. The 20-year-old has spent this season out on loan at boyhood club Motherwell and has impressed this season in a struggling side that is battling relegation from the Premiership. McKinstry came through the ranks at Fir Park before he won a six figure move to Elland Road in 2021 and has been a key player for manager Steven Hammell. Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles Alan Burrows to Aberdeen fast tracked by Motherwell as Fir Park chairman takes action to avoid 'awkwardness' He's scored four time with two assists and has made two appearances at senior level with Leeds. Hammell - previously 'Well academy director - said in 2021 that his young starlet 'will do wonderful things and become a household name in the next three or four years.' Follow Record Sport on Twitter , Facebook and Instagram for all of the up-to-the minute breaking news, video and audio on the SPFL, the Scotland national team and beyond. You can also follow our dedicated Rangers and Celtic podcast pages and sign up to our newsletters to make sure you never miss a beat throughout the season. Read More Related Articles Angus MacDonald takes on 'manic' Aberdeen and foundation juggling act as he opens up on cancer battle eye opener Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Alan Burrows reveals Aberdeen fended off other SPFL clubs who wanted to nab him from Motherwell Read More Related Articles Tam McManus names 5 Hibs kids standouts as Dortmund heartbreaker stirs memory of Alex McLeish ear-bashing Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Motherwell FC Scotland U21s football team Transfer Talk Leeds United FC Scottish Premiership","pubDate":"2023-02-09 09:53:53","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171519.ece/ALTERNATES/s615/0_Motherwell-FC-Media-Access.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | One Year On: Rulani Gives Saavedra Assessment & Reveals Challenge","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Mamelodi-Sundowns/mamelodi-sundowns-coach-rulani-mokwena-assesses-erwin-saavedras-first-year-at-chloorkop-20230209","keywords":null,"creator":null,"video_url":null,"description":"Mamelodi Sundowns coach Rulani Mokwena has given an assessment of Erwin Saavedra's time, exactly a year after the Bolivian made his debut for the DStv Premiership.","content":"Mamelodi Sundowns coach Rulani Mokwena has given an assessment of Erwin Saavedra's time, exactly a year after the Bolivian made his debut for the DStv Premiership. Saavedra was signed from Bolivar in the January transfer window last year, but his time at the has been affected by injury. This season, the 26-year-old has made five appearances, one more than he did last term. Coincidently, Saavedra made his debut against Sudanese side Al Hilal on February 11, 2022, and Sundowns are set to play the club on the same date this year. It's their opening group stage match for the 2022/23 edition of the Champions League. Whether or not Saavedra will feature this weekend, is unclear. \"It's been very difficult for him. It's not easy coming from a different country and it's not easy coming from an area where the football is different and the food is different. He comes into a country where he does not bring his family. He's got a newborn baby boy and it becomes difficult to be in South Africa without knowing how the boy is doing every single day. From a psychological perspective, you can understand the challenges that come into that space, apart from the injuries,\" Mokwena told media during a press conference ahead of the Champions League clash against Hilal. \"Already, if you get injured, you need a lot more social warmth because that helps more than anything else to recover from injuries. And then if there is a psychological hurdle to overcome, then it becomes even more difficult. \"He has played for the national team, which means he has played games of consequence and games of pressure. There is an interesting documentary of the Argentinean road to Qatar. One of the highlights is of Saavedra scoring against Argentina. He is a player who comes with competitive pedigree and you see the quality in the games he has played. From the football perspective, the adaptation is not too much of a challenge. It's just been the physical with regards to injuries and for me it's been the mental. But having said that, he is a player who shows incredible characteristics and we are still to see the best of him in Mamelodi Sundowns colours for sure.\"","pubDate":"2023-02-09 13:10:33","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | The Top 8 Goalscorers In 2022/23 CAFCL","link":"https://www.snl24.com/soccerladuma/International/African-Football/the-top-8-goalscorers-in-202223-caf-champions-league-20230209","keywords":null,"creator":null,"video_url":null,"description":"With CAF Champions League action set to resume this weekend with some blockbuster fixtures, here are the eight most prolific players in the competition so far this season.","content":"With CAF Champions League action set to resume this weekend with some blockbuster fixtures, here are the eight most prolific players in the competition so far this season. The 2022/23 edition of Africa's premier club competition makes its return this weekend, when the continent's superpowers look to begin their group-stage campaigns on the right note. The tournament's return starts with Egyptian giants Zamalek taking on Algerian Ligue Professionnelle 1 table-toppers CR Belouizdad, with White Knights star Zizo looking to add to his tally of five competition goals this season. The 26-year-old is currently second in the race for the competition's Golden Boot, two goals behind Young Africans forward Fiston Mayele, and with the Tanzanian outfit now out of the Champions League, Friday's encounter against the reigning Algerian champions presents the perfect opportunity for Zizo to usurp the Congolese. Just behind the Egypt international is the top goalscorer from last year's competition, Tiago Azulao, with the veteran Brazilian having scored in all but one of his Champions League appearances so far this season. Of his four goals, two were scored in South Africa when Petro de Luanda were able to overcome Cape Town City 3-0 in the first leg of their second-round encounter. Not only is the Petro captain the oldest among the eight highest-scoring forwards in the Champions League so far in this campaign, he is also the only non-African on the list. While Azulao may be the oldest, right behind him on the goalscoring chart is the youngest player on the list in Souaibou Marou. The 22-year-old's goalscoring prowess for Coton Sport caught the attention of many sides during the mid-season transfer window, and it is because of this that the Cameroonian will be unable to add to his Champions League tally this season, having signed for Orlando Pirates in January. You must be to read and post comments.","pubDate":"2023-02-09 12:41:30","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Once A Pirate! Modabi’s New Bucs Role Confirmed","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Orlando-Pirates/gerald-modabi-is-back-at-orlando-pirates-in-a-new-role-20230209","keywords":null,"creator":null,"video_url":null,"description":"The Siya crew can reveal that Gerald ‘Jomo’ Modabi is back at Orlando Pirates in a new role at the club.","content":"The Siya crew can reveal that Gerald ‘Jomo’ Modabi is back at Orlando Pirates in a new role at the club. Modabi played for the Buccaneers between 2006 and 2008 before he returned to Dynamos FC, which is where the Soweto giants had signed him from. In the earlier stages of his career, Modabi played for SuperSport United in the early 2000s, before featuring for Wits University, Silver Stars and Jomo Cosmos, among other clubs. While he didn’t play much during his time with Bucs, the Chiawelo-born star proved himself as a midfield strongman who gave opponents a tough time with his high work rate although it can be argued that his off-the-field antics affected his career. The 41-year-old has been spotted at Pirates and sources have confirmed to the Siya crew that he has joined the club as a coach in the youth ranks. “Gerald Modabi is back at Orlando Pirates and is with the development. He is coaching the club’s U19 team,” confirmed the source. Contacted for comment, Modabi refused to confirm his return to the Bucs on official appointment though he didn’t deny his presence at the club. “I’ve got a friend at Pirates and that is Joseph Makhanya who is my former teammate and I will visit now and again to talk about football,” he said. You must be to read and post comments.","pubDate":"2023-02-09 12:12:06","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Super Bowl has rare matchup of top 2 regular-season teams","link":"https://businessmirror.com.ph/2023/02/09/super-bowl-has-rare-matchup-of-top-2-regular-season-teams/","keywords":["Sports","Featured"],"creator":["The Associated Press"],"video_url":null,"description":"THIS year’s Super Bowl features a rare matchup of the National Football League’s (NFL) top two teams from the regular season.","content":"THIS year’s Super Bowl features a rare matchup of the National Football League’s (NFL) top two teams from the regular season. The and were the league’s only 14-game winners, marking just the sixth time since the 1970 merger that the squads with sole possession of the two best records in the regular season met for the championship. The last time it happened came after the 2013 season when Seattle beat Denver 43-8 in a matchup of 13-win teams. That blowout was relatively typical of these meetings, with the average margin of victory in the previous five powerhouse matchups being 21 points. The closest game was Washington’s 37-24 win over Buffalo following the 1991 season. The three others featured San Francisco beating Miami 38-16 after the 1984 season, Dallas topping Denver 27-10 to cap the 1977 season and Oakland beating Minnesota 32-14 the previous year. Since seeding began in 1975, this is the 15th time the top team in each conference made it to the Super Bowl. The previous time came after the 2017 season when the Eagles won their first Super Bowl championship by beating New England 41-33. This is also the third time both Super Bowl teams won at least 14 games in the regular season, although both Kansas City and Philadelphia needed wins in the added 17th game to get there. Atlanta and Denver did it in 16-game seasons in 1998, and Miami and San Francisco in 1984. The Chiefs and Eagles also have been in control all postseason, with neither team trailing in the playoffs. The only other times both Super Bowl teams did that came in the 2004 season (Patriots vs. Eagles), 1991 season (Bills vs. Washington) and 1966 season (Packers vs. Chiefs). PATRICK MAHOMES will try to do something that has never been done before in the NFL by following up a regular season when he led the league in yards passing with a Super Bowl title. Mahomes threw for 5,250 yards during the regular season—511 more than second-place Justin Herbert for the largest gap between first and second place since Kurt Warner beat out Peyton Manning by 699 yards in 2001. The only player to reach the Super Bowl after throwing for more yards in the regular season than Mahomes was Manning, with a record 5,477 in 2013. His Broncos lost 43-8 to Seattle in the Super Bowl. That was one of six times before Mahomes that the player who led the league in yards passing made it to the Super Bowl, with all of them losing. The others were Tom Brady (2017 season), Brady (2007), Rich Gannon (2002), Warner (2001) and Dan Marino (1984). CHIEFS coach Andy Reid joins Dan Reeves as the only coaches to face a franchise in the Super Bowl that they previously took to the big game. Reid coached the Eagles to their second Super Bowl following the 2004 season before getting fired after the 2012 season. He quickly built Kansas City into a power and now is ready for his fourth Super Bowl appearance as a head coach—the ninth coach to reach that mark. Reid will hope for better luck in his rematch than Reeves had after the 1998 season against a Denver organization he had guided to the Super Bowl in the 1986, ‘87 and ’89 seasons before losing all three. The Broncos beat Reeves and the Atlanta Falcons 34-19 in the Super Bowl. Two other coaches faced their former teams in the Super Bowl and ended up on the winning side: Jon Gruden led Tampa Bay past the Raiders after the 2002 season and Weeb Ewbank coached the Jets to a huge upset over the Colts following the 1968 season. The Eagles will be the sixth franchise to reach the Super Bowl under four coaches, with Nick Sirianni joining Doug Pederson, Reid and Dick Vermeil. The Raiders, 49ers, Colts and Rams all got there with four coaches, and the Broncos did it with a record five. CHIEFS tight end Travis Kelce has put together a playoff career topped perhaps only by the greatest receiver ever in Jerry Rice. Kelce has 127 catches in 17 career playoff games for 1,467 yards and 15 touchdowns. The only player to top any of those numbers was Rice, with 151 catches for 2,245 yards and 22 TDs in 29 playoff games. The Mahomes-Kelce connection also is one of the best, with their 13 TD passes in the playoffs trailing only the 15 Tom Brady threw to Rob Gronkowski. Image credits:","pubDate":"2023-02-09 11:43:42","image_url":null,"source_id":"businessmirror","category":["sports"],"country":["philippines"],"language":"english"},{"title":"Snl24.com | Messi's brother backtracks on shock 'Leo made Barca' claim","link":"https://www.snl24.com/KickOff/WorldNews/FC-Barcelona/lionel-messis-brother-matias-messi-backtracks-on-shock-leo-made-barcelona-claim-20230209","keywords":null,"creator":null,"video_url":null,"description":"Lionel Messi's brother Matias has backtracked after making the shock claim that Barcelona are only known because of the Paris Saint-Germain superstar.","content":"Earlier this week, Matias had suggested, via his son's Twitch channel, that the Blaugrana only became prominent in the football world because of his superstar brother. \"I don't know about you, but Barcelona became known thanks to Messi,\" he said during a live stream, per . \"Nobody knew about them before. \"Whoever's had the chance to go to Barcelona and see the museum, you can see that the museum is Messi.\" His words fuelled speculation there is a rift between Barca president Joan Laporta and Messi, with the player's brother also saying the Argentina captain would \"kick\" the president out if he returned to the Camp Nou following his shock departure from the Catalans in 2021. These comments, among a few others, were met with a lot of criticism, with many deeming them to be disrespectful towards the Catalan giants. Messi's entourage later moved to distance themselves from Matias' opinions, insisting that the player does not share the same views. Matias appears to have had a change of heart since, and has apologised for his comments. \"I want to apologise for what I said on social media, I was just joking with my son and friends,\" he wrote on Instagram, per . \"How can I think like that about a club as great as Barcelona, which has given so much to my family and Leo. \"I want to say sorry to everyone, specifically to all Barcelona fans.\" It remains to be seen if the 2022 FIFA World Cup winner, whose contract with PSG is set to expire in June, will ever return to the Spanish club, but Laporta has previously insisted he is open to the idea. You must be to read and post comments.","pubDate":"2023-02-09 11:14:28","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Ange Postecoglou to Leeds United resurrected as Andoni Iraola knocks back switch and Celtic boss back on radar","link":"https://www.dailyrecord.co.uk/sport/football/football-news/ange-postecoglou-leeds-united-resurrected-29172004","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ross Pilcher)"],"video_url":null,"description":"Postecoglou remains among the named candidates as the Elland Road club search for Jesse Marsch's replacement.","content":"Celtic manager Ange Postecoglou (Image: PA) Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Just when Celtic thought Leeds United had their new boss lined up, the possibility of an approach for Ange Postecoglou is alive again after their first choice said no. Rayo Vallecano boss Andoni Iraola looked set to bet Jesse Marsch’s replacement at Elland Road after he was sacked this week. But the Spaniard has now reportedly decided against making the move to Yorkshire, forcing the club hierarchy to move on to other targets. The Hoops are confident that Postecoglou has no desire to the leave Pakhead, as revealed by Record Sport on Tuesday, and would be happy for the club to reject any attempt by Leeds to poach the Aussie after a highly impressive 18 months in the East End of Glasgow. But with the English Premier League outfit keen to avoid a second successive relegation dogfight and their No 1 choice having rejected their advances, it’s back to the drawing board. Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles 5 infamous Rangers and Celtic manager tearups as rivalry returns in Beale and Postecoglou Feyenoord coach Arnie lot has emerged as the new favourite. However, Postecoglou remains in the mix, alongside former Wolves and Tottenham boss Nuno Espirito Santo and former River Plate head coach and Argentina international Marcello Gallardo. Caretaker boss Michael Skubala took charge of Leeds’ short trip to Old Trafford on Wednesday night. They led 2-0 thanks to goals from Wilfried Gnonto and a Rafael Varane OG. But Erik Ten Hag’s men fought back to level the score through Marcus Rashford and Jadon Sancho. The sides face each other again this weekend, this time at Elland Road. Skubala is likely to remain in charge at least until then, although a new arrivals in the dugout shouldn't be ruled out. READ NEXT: Read More Related Articles Giorgos Giakoumakis explains Celtic transfer exit as 'extra motivation' behind Atlanta United switch revealed Read More Related Articles Michael Beale stuck the Rangers needle in Ange with his 'lucky man' joust and got exactly what he wanted – Barry Ferguson Read More Related Articles The reason Celtic and Rangers are only clubs with VAR in operation this weekend in Scottish Cup Read More Related Articles Barry Ferguson dismisses Dwight Yorke's Aberdeen Old Firm split claims with old Blackburn mate 'on a different planet' Read More Related Articles Alistair Johnston in Celtic shoutout to underrated star as he marvels at Jota skills and ‘beautiful hair’ Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On English Premier League Ange Postecoglou Celtic FC Leeds United FC Scottish Premiership","pubDate":"2023-02-09 10:31:07","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article28951018.ece/ALTERNATES/s615/0_Ange-Postecoglou-File-Photo.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"5 infamous Rangers and Celtic manager tearups as rivalry returns in Beale and Postecoglou","link":"https://www.dailyrecord.co.uk/sport/football/5-infamous-rangers-celtic-manager-29170919","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Robbie Copeland)"],"video_url":null,"description":"Tensions often flare across the Glasgow divide and while the men in the dugout try to steer clear of controversy, it's not always easy keeping a cool head.","content":"Michael Beale and Ange Postecoglou (Image: Getty Images) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice No matter who is in the dugout for Rangers and Celtic, there's usually a mutual respect between the men in charge. But the Old Firm derby being what it is, there's always a bit of needle too. Ange Postecoglou and Michael Beale haven't gone at it hammer and tong on the touchline yet but the signs are there that there's a bit of tension simmering beneath the surface. From the Celtic boss' quip about being more concerned with what he's having for dinner than Beale's appointment, to his Rangers counterpart branding the Parkhead boss \"lucky\" in a pop at their resources, it's fair to say we're unlikely to see these two sitting down for dinner any time soon. Writing in his Record Sport column, Barry Ferguson revealed that's exactly how he likes it. He said: \"I’m all for a bit of cut and thrust where Beale and Postecoglou are concerned. I’ve seen some people react to it by saying Beale would eat himself if he was chocolate. And I’ve seen others try to claim Postecoglou is in danger of losing the plot because he won’t let the ‘lucky man’ quip lie. But what we really have here is two very clever managers who realise their success depends on bringing the other guy down. That’s not something to be criticised.\" Read More Related Articles Michael Beale stuck the Rangers needle in Ange with his 'lucky man' joust and got exactly what he wanted – Barry Ferguson Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp They're not the first two in the Glasgow dugouts to have a pop at one another, of course. Far from it. Here, Record Sport take a look at some of the other clashes down the years. Mowbray vs Smith Poor old Tony Mowbray, eh? The writing was on the wall for the beleaguered Englishman whose fate was sealed by a thrashing at St Mirren on a rainy night in March less than a year after taking the job. But while he only managed a single point from his three derbies as Celtic boss, he managed to get under the skin of opposing boss Walter Smith when he said he could never set his side up like Smith, who was known for his pragmatism. Tony Mowbray in 2010 during his stint as Celtic boss (Image: SNS Group) It proved to be a parting shot from Mowbray as he was sacked just days later but Smith jumped to the defence of his side's setup. He said: “It was Tony who brought it up. The first time it was in the context of setting teams up and what he would like to try to achieve in the longer term. I said that was all right if you have got a longer term. “He did it the other night again, but it doesn’t bother me. It’s not a bone of contention. It’s not something that would annoy me. If you look at every team throughout Europe, the balance between attack and defending is one of the hardest things to achieve.\" Smith vs Lennon The late, great Smith's final Old Firm derby was one of the less explosive clashes over the years but it wasn't without a controversy. The two sides battled out a 0-0 draw as Rangers went on to win the league by a single point in what would be their final league title for 10 years, but Smith was left raging by a penalty award. He took a pop at Celtic and Neil Lennon for \"asking for decisions\" after Allan McGregor saved a spot-kick from Georgios Samaras, claiming it wasn't a foul from Steven Davis on Anthony Stokes. He said: “It’s not a penalty kick. But they got it and Allan McGregor saved it and Celtic will be happy now because their whole campaign this season has been the fact they have been asking for decisions. \"Well, they got one today and Allan McGregor saved it. That’s it. The whole of the season, all we have heard is that Celtic don’t get penalty kicks.\" McCoist vs Lennon One of the enduring images of derbies in the modern era is that of Ally McCoist and Neil Lennon at each other's throats. The March 2011 derby was already guaranteed to go down in infamy after three red cards and 13 bookings but it was the touchline fracas between two of the men in the dugout that really sticks in the memory. Plus the fact the Scottish Government deemed it worthy to get involved. Dear God. Steven Whittaker, Madjid Bougherra and El-Hadj Diouf were all sent off in the Scottish Cup replay at Celtic Park as the home side fought – literally – to a narrow win. And when McCoist – then Walter Smith's No.2 – pointed the finger at Lennon at the full-time whistle, all hell broke loose. Lennon and McCoist had to be restrained following Celtic's fiery 1-0 Scottish Cup win (Image: Internet Unknown) Then-Celtic coach Alan Thompson later revealed: “I was stood so close that I clearly heard Ally tell Lenny, ‘And don’t you be speaking to my f***ing players like that’, only for Lenny to tell him, 'they’re not your f****** players, they’re Walter’s. “It’s never been disclosed what was actually said in over a decade now — but I’m telling you that was the spark that lit the fire and hell was hot. Lenny was right because Walter was the gaffer and Ally was only the No 2 at that time. Ally didn’t take well to that. The Rangers boys were all trying to say it was our fault but any team who receives three red cards in one match need to have a long hard look at themselves.” Kennedy vs Beale Rangers' win at Parkhead in late December 2019 was seen as one of the first major blows Steven Gerrard landed on Celtic as he chipped away at Lennon and eventually won the title in 2021. But it was the two assistants who stole the show after the fiery clash, where Nikola Katic struck a second-half winner and Alfredo Morelos was sent off in stoppage time. Beale, then Gerrard's right-hand man, also saw red after the game for a clash with Kennedy - who himself went on to have a spell as Celtic boss - that saw him get into it with the referee. He later explained: “In that moment, I assumed he said something I wouldn’t have liked him to say – and I told him that. You get carried away and I accused the ref of something you can’t do. Michael Beale and John Kennedy in a heated touchline exchange (Image: SNS Group) “It was just that game, that moment. Just two minutes before, I was so calm. I’m a little bit more mature now for that. It was part of my learning.” Kennedy meanwhile said at the time . “I’ve had a couple of people ask me about whether there was fighting in the tunnel. There was no such thing. It’s just the usual nonsense. It’s an emotional time. I know Michael very well and I have done since before he came to Rangers. We have spoken in the past. There is no issue with us. “He was in trouble with the officials, there was a bit of verbals, that’s it, end of. That’s the way it goes sometimes. The Hoops no.2 went on to assert that it “looked worse than it was” and said he’d “quite like to put it to bed.” Lennon vs Gerrard The same derby saw Gerrard tear onto the Celtic Park pitch to celebrate what was seen as a substantial victory for Rangers at the time and he later admitted he regretted it – as well as how he treated Lennon. But he said it was down to the \"winding up\" from the other side of the city. Speaking after taking the Aston Villa job, he said: \"Maybe going into the media, answering a few questions where I thought, 'I shouldn't have said that, why did I let myself get there?' There was once where we beat Celtic at Celtic Park. There had been a lot of mud flying in the media with pundits and ex players, it's not that I go and look for it. (Image: PA) \"We won at Celtic Park and I was probably a bit over the top with my celebrations, on the pitch and with Neil Lennon, which I regret. But at the same time it's like a constant wind-up from their side, all the success. I feel it. I'm emotional, I'm not perfect, but it's something I'm working on and getting better at. \"Balance is important. You've got to enjoy the wins because they're hard to get, and that's the good part. But at the same time people are looking to me and that's the reason it's important to be balanced.\" READ NEXT Read More Related Articles Giorgos Giakoumakis explains Celtic transfer exit as 'extra motivation' behind Atlanta United switch revealed Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Kyle Lafferty on the Rangers connection that made Linfield switch a 'no brainer' Read More Related Articles The reason Celtic and Rangers are only clubs with VAR in operation this weekend in Scottish Cup Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Celtic FC Rangers FC Michael Beale Ange Postecoglou Walter Smith Neil Lennon Ally McCoist John Kennedy Steven Gerrard Scottish Premiership Scottish Cup","pubDate":"2023-02-09 10:23:35","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171813.ece/ALTERNATES/s615/1_Rangers-FC-v-Celtic-FC-Cinch-Scottish-Premiership.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Aberdeen earn freedom of the city as Gothenburg greats honoured 40 years after Real Madrid triumph","link":"https://www.dailyrecord.co.uk/sport/football/aberdeen-earn-freedom-city-gothenburg-29171843","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Ben Banks)"],"video_url":null,"description":"The famous Dons side will see a weekend of celebrations commemorate their big day.","content":"Aberdeen legends will be rewarded this spring (Image: SNS Group 0141 221 3602) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Aberdeen will be rewarded with the freedom of the city alongside their Gothenburg Greats side, on the 40th anniversary of their historic European Cup Winners’ Cup triumph. Celebrations will begin with a gala dinner on May 11th, 40 years to the day since the Dons beat Real Madrid under Sir Alex Ferguson's management in Gothenburg. There will be a special event at Pittodrie the following, at which the club and the Gothenburg Greats team will be presented with the Freedom of the City by the city's council. A weekend of, celebration will culminate with a homecoming game on the 13th or 14th, with the SPFL confirming a post-split Premiership game on that weekend for the side currently hunting a manager after Jim Goodwin's sacking. Aberdeen chairman Dave Cormack said: “Being awarded the Freedom of the City is a tremendous honour for the club and befitting of our greatest-ever team. The Gothenburg Greats have long been assured of their position as legends at the club and in the city but this special tribute further underlines their place in our history. To beat Real Madrid in a European final is an achievement that has only become increasingly impressive over the course of time. Read More Related Articles Alan Burrows to Aberdeen fast tracked by Motherwell as Fir Park chairman takes action to avoid 'awkwardness' Read More Related Articles Angus MacDonald takes on 'manic' Aberdeen and foundation juggling act as he opens up on cancer battle eye opener \"Winning the Cup Winners’ Cup and European Super Cup in 1983 was inspirational for the club and city; something that we should remember and cherish. This weekend of celebrations will allow our supporters to share in recognising these players and in celebrating with them.” Willie Miller was captain at the Ullevi Stadium and said: “It is difficult to believe that four decades have passed since that night in Gothenburg. We were all incredibly fortunate to be part of such great team and are honoured and humbled, in equal measure, by the celebratory events to commemorate our success being laid on by both the club and the city. “It will be an emotional weekend where we can reflect on what we achieved and mark what is still one of the best nights of our lives.” Aberdeen Lord Provost Dr David Cameron added: “I very much look forward to presenting the club and the Gothenburg Greats with the Freedom on the City. The club, with its rich history, and the European Cup Winners’ Cup team, with their giant-beating performances, have long been an inspiration for the whole city. “The Dons’ work within our local communities has also helped bring people together. The event in May promises to have all the excitement and sense of team spirit of the best football matches.” READ NEXT Read More Related Articles Stuart McKinstry approaching Leeds United exit door as Motherwell loan form sparks Premiership interest Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Barry Ferguson dismisses Dwight Yorke's Aberdeen Old Firm split claims with old Blackburn mate 'on a different planet' Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Champions League Sir Alex Ferguson Willie Miller Aberdeen FC Real Madrid CF Dave Cormack","pubDate":"2023-02-09 10:20:01","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171840.ece/ALTERNATES/s615/0_922761.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Davids aware of Chiefs danger ahead of sold out Ke Yona tie","link":"https://www.citizen.co.za/sport/soccer/local-soccer/davids-aware-of-chiefs-danger-ahead-of-sold-out-ke-yona-tie/","keywords":["Local Soccer","Arthur Zwane","Kaizer Chiefs","Nedbank Cup"],"creator":["Sibongiseni Gumbi"],"video_url":null,"description":"Speaking ahead of Maritzburg United's clash with Kaizer Chiefs in the Nedbank Cup first round, Fadlu Davids says Amakhosi are desperate.","content":"Maritzburg United coach Fadlu Davids does not need anyone to tell him how dangerous Kaizer Chiefs can be in cup games. ALSO READ: Maduka raves about Andile Mpisane, says ‘he has potential’ Speaking ahead of the two sides’ Nedbank Cup first round meeting at Harry Gwala Stadium on Friday, Davids said he knows Chiefs are desperate. The game is sold out already and it is expected to be a thrill-a-minute encounter with both teams playing attacking football. It has been over seven years now since Amakhosi won a trophy and Davids knows they will fancy their chances with the Ke Yona. “This is the competition they (Chiefs) will really focus on since they are playing for silverware and they will be playing to win,” said Davids this week. “So, you can expect an end-to-end game where both teams will be playing for the result,” promised the former Orlando Pirates coach. “I don’t think there is a team who will sit back and try to absorb pressure or hold on for a draw. “We are not playing for extra time, we will try to win the match – it will be an interesting match.” Maritzburg have not done well in the league and many would think they would be better served focusing more on that campaign. Relegation a real threat After 20 games, the Blue Army have collected 21 points and are 15th on the standings , three points ahead of Marumo Gallants behind them. “We know the league is the ultimate focus, but on the other hand a good performance can help build your team,” said Davids. “But we will approach it like we have approached other matches. We approach the game to win it. “We don’t go to any match to play for a draw because it doesn’t help us in a situation we are in.” What could be making Davids believe that his team have a chance of upsetting Chiefs in this match is that Arthur Zwane’s side have been blowing hot and cold. ALSO READ: Zwane aims to end Chiefs trophy drought with Nedbank Cup “It’s not only Chiefs’ problem, all the teams in the league except for (Mamelodi) Sundowns are not consistent. “They (Chiefs) are a very good team. We don’t take them lightly, we give them the respect they deserve. “And I think we need to commend them for the work they are doing,” added Davids who added that Zwane was doing well in the rebuilding of the Amakhosi team.","pubDate":"2023-02-09 10:11:33","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/Davids-1.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Stuart McKinstry approaching Leeds United exit door as Motherwell loan form sparks Premiership interest","link":"https://www.dailyrecord.co.uk/sport/football/stuart-mckinstry-approaching-leeds-united-29171525","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"The youngster has performed well in claret and amber but it doesn't look likely to be enough to stay a Premier League player.","content":"Stuart McKinstry during a Motherwell press conference (Image: SNS Group) Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Leeds United are set to spark a summer transfer chase by releasing Stuart McKinstry after his loan at Motherwell ends. The Scotland U21s international is out of contract at the end of the season and his parent club in England's Premier League have yet to open talks. Leeds are without a senior manager following the sacking of Jesse Marsch, but the early indications are that they will let him go. A clutch of Scottish Premiership clubs would be interested in the winger alongside some English Championship teams, who are all watching him closely. The 20-year-old has spent this season out on loan at boyhood club Motherwell and has impressed this season in a struggling side that is battling relegation from the Premiership. McKinstry came through the ranks at Fir Park before he won a six figure move to Elland Road in 2021 and has been a key player for manager Steven Hammell. Read More Related Articles Celtic and Rangers braced for Super League 2.0 as more than 50 invitations sent for seismic European football revamp Read More Related Articles Alan Burrows to Aberdeen fast tracked by Motherwell as Fir Park chairman takes action to avoid 'awkwardness' He's scored four time with two assists and has made two appearances at senior level with Leeds. Hammell - previously 'Well academy director - said in 2021 that his young starlet 'will do wonderful things and become a household name in the next three or four years.' Follow Record Sport on Twitter , Facebook and Instagram for all of the up-to-the minute breaking news, video and audio on the SPFL, the Scotland national team and beyond. You can also follow our dedicated Rangers and Celtic podcast pages and sign up to our newsletters to make sure you never miss a beat throughout the season. Read More Related Articles Angus MacDonald takes on 'manic' Aberdeen and foundation juggling act as he opens up on cancer battle eye opener Read More Related Articles Todd Cantwell and his Rangers point to prove as Norwich ally explains how transfer 'anger' could become Ibrox gain Read More Related Articles Twitter down as football fans left in the dark after Dundee and Raith semi final updates go quiet Read More Related Articles Alan Burrows reveals Aberdeen fended off other SPFL clubs who wanted to nab him from Motherwell Read More Related Articles Tam McManus names 5 Hibs kids standouts as Dortmund heartbreaker stirs memory of Alex McLeish ear-bashing Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Motherwell FC Scotland U21s football team Transfer Talk Leeds United FC Scottish Premiership","pubDate":"2023-02-09 09:53:53","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article29171519.ece/ALTERNATES/s615/0_Motherwell-FC-Media-Access.jpg","source_id":"dailyrecord","category":["sports"],"country":["united kingdom"],"language":"english"}]}