{"newsArray":[{"title":"Snl24.com | Revealed: How Komphela Asked Downs To Leave","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Swallows-FC/how-steve-komphela-asked-mamelodi-sundowns-to-leave-for-swallows-20230704","keywords":null,"creator":null,"video_url":null,"description":"New Swallows FC head coach Steve Komphela has revealed how Mamelodi Sundowns reacted to the news of him wanting to leave and what it took for them to release him.","content":"New Swallows FC head coach Steve Komphela has revealed how Mamelodi Sundowns reacted to the news of him wanting to leave and what it took for them to release him. Swallows shocked the football fraternity on Sunday , effective immediately. The experienced mentor had one year left to run as an assistant coach at Sundowns and has explained how he broke the news to the Tshwane giants that he wanted to leave and join the Birds. \"You talk to relevant people. I think Sundowns has given one so much respect, so much quality in approach and even achievement that it would take a lunatic not to be grateful, not to follow the right processes in terms of requesting for or in terms of advice,\" Komphela said on . \"I did consult with the chairman, obviously the president would know about the proceedings and up until it now gets to a stage you have to cut the throat, which is the most painful. \"Because you fully understand that as you cut the throat, when blood spills, it does not only splatter on your toes or shoes, there's a whole lot of bystanders, people who appreciate the brand who are likely to be affected,\" he said. \"So you have to be very careful when that happens, it must be done with dignity and I think it was dealt with in a very dignified manner.\" The former Kaizer Chiefs coach continued and revealed that the negotiations for his release were not easy, as Sundowns did not see it coming and he had to be patient before finally going for the \"jugular\". \"Not a fight, not understood either because when you bring something to the table, a discussion that is quite serious, it does trigger a lot, wait a minute, 'Where did this come from?' And you have to explain yourself and you strike some sort of agreement, you develop frameworks and you retreat a bit, you give it another shot,\" Komphela went on. \"Because you don't just break sad news and expect the news will be carried forth, no. It will be a question of, 'Wait a minute, what did you say?' \"So, you try to cushion yourself in a manner that (you) can understand in the same manner it was put across. So, these processes went on and on up until as I said we had to go for the jagular,\" he added. Swallows chairman David Mogashoa also revealed, in the same interview, that he started negotiating virtually with Komphela a week before this past weekend, before they finally met in person on Saturday. However, Mogashoa already had exploratory talks with Komphela's agent before he spoke to the erudite tactician and Sundowns. You must be to read and post comments.","pubDate":"2023-07-04 17:12:29","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | PSG 'Identify' Neymar Replacement","link":"https://www.snl24.com/soccerladuma/International/Ligue-1/psg-identify-neymar-replacement-20230704-2","keywords":null,"creator":null,"video_url":null,"description":"With Neymar heavily tipped to make a move away from Paris Saint-Germain, the French giants have reportedly already identified a potential replacement for the Brazilian superstar.","content":"With Neymar heavily tipped to make a move away from Paris Saint-Germain, the French giants have reportedly already identified a potential replacement for the Brazilian superstar. For much of 2023, rumours have been abounded about the 31-year-old's potential exit from the Parc des Princes, with the club believed to be disillusioned with the return on their world-record investment in the winger. Brazil's all-time top goalscorer has not played football since February following an ankle injury, with multiple reports suggesting that the attacker has already played his final game in PSG colours. According to , Les Parisiens are already looking at possible replacements for the Selecao forward, and one of the names being considered is Portugal star Joao Felix. The 23-year-old has returned to Atletico Madrid following a short loan stint with Chelsea in the second half of the 2022/23 campaign, but the attacker's situation in the Spanish capital does not seem to have changed and he reportedly wants to leave Los Rojiblancos. The Viseu native's arrival in the French capital, however, will be contingent on whether or not the record Ligue 1 champions are able to successfully get Neymar off their books. Spanish tactician Luis Enrique is expected to be revealed as PSG's newest boss soon, and it is said that he is likely to overrule any sale of Neymar as the pair will be reunited for the first time since their successful spell together at Barcelona between 2014 and 2017. The same report claims that the French club and Neymar's representatives will seek a resolution over the player's future within the next 10 days. You must be to read and post comments.","pubDate":"2023-07-04 17:12:29","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Should Kaizer Chiefs be doing better than Ranga Chivaviro?","link":"https://www.thesouthafrican.com/sport/soccer/psl-south-africa/should-kaizer-chiefs-should-be-doing-better-than-ranga-chivaviro-psl-4-july-2023/","keywords":["Premier Soccer League","Featured","Kaizer Chiefs","Ranga Chivaviro"],"creator":["James Freemantle"],"video_url":null,"description":"Kaizer Chiefs have put all of their striking eggs in the Ranga Chivaviro basket. We've asked if that's such a good long-term idea.","content":"Kaizer Chiefs have confirmed the signing of Ranga Chivaviro from Marumo Gallants and he’ll wear the number 7 jersey. Is that a good thing though? ICYMI: Five things to know about Molefi Ntseki MSHINI: Ngcobo like a new signing for Chiefs? Chivaviro’s track record Ranga Chivaviro was prolific for Gallants last term, scoring 17 times in 30 appearances across all competitions. It’s a stat that’s all the more impressive if you consider it was for a team who got relegated. However, the converse of that is you start to wonder how Chivaviro would cope in an environment where success is demanded on a weekly basis. He did score double figures in the PSL last term, but then again so did Khanyisa Mayo. Chivaviro has never been prolific in any other season barring 2022-23, so the pressure is on at Naturena. CONFIRMED: Six new players and their jersey numbers Wrong side of 30 Chivaviro will turn 31 in November and it’s difficult to ensure that he’ll improve as a player from here. Obviously, if he grabs double figures for Chiefs in the league in his debut campaign, they might say the move has been justified. However, with little to no resale value, Chivaviro’s signing represents a significant risk. Should Chiefs have tried to put all their eggs in the Mayo basket? We all know the Cape Town City star signed a new deal with the Citizens, but a big offer could have been tempting. There were other options on the market. Just saying. NATURENA: Remember the name of this latest wonder kid! Ranga must deliver for Chiefs from day one Simply put, what is the long-term goal-scoring plan beyond Ranga Chivaviro? It doesn’t seem very obvious for now. There’s also the worry he doesn’t fire on all cylinders, and then there’s a real issue to solve. If he does deliver in his maiden campaign then it’ll be a massive bonus for both the player and the club. If he doesn’t, serious questions will have to be asked. CONFIRMED: Six new players and their jersey numbers Do you think Ranga will deliver the goods for the Glamour Boys? Meanwhile, hit up James Freemantle for more insights, analysis and love for the beautiful game of football. Also, follow The South African on Twitter for up-to-the-minute news updates","pubDate":"2023-07-04 16:11:33","image_url":"https://www.thesouthafrican.com/wp-content/uploads/2023/03/Chiefs-3-e1687499943651-1200x1000.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Room for one more? Kaizer Chiefs in talks to complete ‘surprise’ signing!","link":"https://www.thesouthafrican.com/sport/soccer/psl-south-africa/room-for-one-more-kaizer-chiefs-in-talks-to-complete-surprise-signing-04-july-2023/","keywords":["Premier Soccer League","DStv Premiership","Featured","Important","Kaizer Chiefs","Surprise Ralani"],"creator":["Yolulwe Qoshe"],"video_url":null,"description":"Having already confirmed six new signings on Monday, Chiefs are believed to be far from done in the transfer market ahead of the new season.","content":"Having already confirmed six new signings on Monday, Chiefs are believed to be far from done in the transfer market ahead of the new season. READ | NEW KAIZER CHIEFS SIGNINGS SPOTTED ON THE FIELD FOR THE FIRST TIME IN NEW KIT! The players that Chiefs announced are Thathayoane Ditlhokwe , Given Msimango, Mduduzi Mdantsane , Edson Castillo , Pule Mmodi and Ranga Chivaviro . Multi-million Jackpots Ticket sales close in: Days : Hours : Minutes : Seconds Play Powerball Now! READ | EXCITING YOUNGSTER REJOINS ORLANDO PIRATES, GETS CHANCE TO IMPRESS IN SPAIN? Those players putting pen to paper at Chiefs has been more or less an open secret for a while now, with fans and the football fraternity just waiting for the club to officially announce them. Looking at that list, three of the six in Chivaviro, Mmodi and Mdantsane are capable of playing in offensive positions. But it looks like new head coach Molefi Ntseki may not be done yet in that regard. Multi-million Jackpots Ticket sales close in: Days : Hours : Minutes : Seconds Play Powerball Now! READ | MAMELODI SUNDOWNS RELEASE ATTACKER, SOWETO GIANTS TO POUNCE? According to Soccer-Laduma , Chiefs have opened talks to sign Bradley Surprise Ralani, who has just been released by former club Mamelodi Sundowns following the expiration of his contract on 30 June. Chiefs in talks to sign Ralani? “What I can tell you for now is that the club (Chiefs) is talking to the player (Ralani). Whether it’s through his representatives or direct to him, that I’m not sure about, but what I’m sure of is that they’re talking. “I don’t think they are that much in a hurry because he is a free agent. But wanting him and talking to him I know they are,” said one source to the publication above. READ | (WATCH) KAIZER CHIEFS NEW SIGNINGS GET STUCK IN ON DAY ONE Another source also weighed in on the supposed talks between Chiefs and Ralani. READ | (PICTURE) MAMELODI SUNDOWNS FANS WELCOME NEW SOUTH AMERICAN SIGNING UPON ARRIVAL “There are other wingers that they are looking at including Sanele Barns of Richards Bay and also if some of their players go on loan then they don’t have a very big squad for next season, But, yes they are talking to Bradley (Ralani). Only time and situation will tell,” said the second source. READ | MAMELODI SUNDOWNS PRESENT ‘TAKE IT OR LEAVE IT’ OFFER FOR SUPERSPORT UNITED FOR STAR MAN It would certainly come as a ‘surprise’ as Ralani is currently 35-years-old and Chiefs have multitude of wingers who are yet to fully show their full potential. Additionally, Amakhosi have tried over the past year to significantly drop their age average.","pubDate":"2023-07-04 16:08:59","image_url":"https://www.thesouthafrican.com/www.thesouthafrican.com/wp-content/plugins/lotto-powerball-banners/assets/images/powerball-logo-min.png","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Swansea City complete move for young full-back Josh Key","link":"https://www.walesonline.co.uk/sport/football/transfer-news/swansea-city-complete-move-young-27256158","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Tom Coleman)"],"video_url":null,"description":"The 23-year-old has signed a three-year deal with the Swans after leaving Exeter","content":"Josh Key has become Swansea City's second signing of the summer transfer window. The young full-back left Exeter City following the expiration of his deal with the Grecians, and has now signed a three-year contract with Swansea with the option for an additional 12 months. The 23-year-old has been on the club's radar since January, and was linked with a number of other Championship clubs in this window. However, he has chosen a move to SA1, and follows Josh Ginnelly in strengthening Michael Duff's squad. Although Key's contract has expired, Swansea will have to pay out compensation to Exeter as the player is under the age of 24. Negotiations on that front are ongoing. Key leaves Devon having scored eight goals in 148 senior appearances for Exeter, who despite offering him a new deal couldn't persuade him to stay. The move bolsters Duff's full-back options, which had been left depleted following the departures of Joel Latibeaudiere and Ryan Manning. Key will wear the number two shirt.","pubDate":"2023-07-04 16:08:14","image_url":"https://i2-prod.walesonline.co.uk/incoming/article27256159.ece/ALTERNATES/s615/0_Josh-Key.jpg","source_id":"walesonline","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Kylian Mbappe parties with Tom Brady at Michael Rubin's star-studded white party in the Hamptons","link":"https://www.dailymail.co.uk/sport/football/article-12263497/Kylian-Mbappe-parties-Tom-Brady-Michael-Rubins-star-studded-white-party-Hamptons.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The 24-year-old France striker partied with the likes of Tom Brady, Leonardo Di Caprio, Jennifer Lopez, Ben Affleck, Beyonce and Jay-Z at Rubin's sprawling $50million Bridgehampton pad.","content":"Kylian Mbappe parties with Tom Brady and poses for snaps with stunning model Grace Adele as he attends Michael Rubin's star-studded white party in the Hamptons Billionaire Michael Rubin welcomed some of sports' biggest names to his party Kylian Mbappe partied with the likes of Joe Burrow, Tom Brady and Beyonce DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Published: 17:03, 4 July 2023 | Updated: 17:21, 4 July 2023 e-mail 2 View comments Kylian Mbappe welcomed in the 4th of July alongside some of the biggest names in sports and showbiz at billionaire Michael Rubin's annual extravaganza in the Hamptons. The France striker partied with the likes of Tom Brady, Leonardo Di Caprio, Jennifer Lopez , Ben Affleck , Beyonce , Jay-Z, Kendall Jenner, Hailey and Justin Bieber at Rubin's $50million Bridgehampton pad. Mbappe, whose long-term future at Paris Saint-Germain remains clouded in mystery, was pictured w ith stunning model Grace Adele at the star-studded white party, which saw 350 people crammed on to one of the most expensive stretches of beach in the world. Among the other sports stars invited to the Hamptons were James Harden of the Philadelphia 76ers, Dallas Cowboys linebacker Micah Parsons and Cincinnati Bengals quarterback Joe Burrow. The athletes could be seen clinking glasses with Rubin and others, all dressed in white for the annual bash, which saw Usher on the mic and appearances from some of Hollywood's biggest stars. Kylian Mbappe pictured with model Grace Adele at Michael Rubin's party in the Hamptons Dallas Cowboys linebacker Micah Parsons (left) was among the other sports stars with Mbappe James Harden of the Philadelphia 76ers and Tom Brady are pictured with billionaire Rubin Leonardo Di Caprio was one of hundreds of household names to attend the Hamptons bash There were armies of valets and security guards on-hand to keep out party crashers. After several incidents at the last two events, Rubin brought in an entire medical staff this year to keep his well-heeled guests in safe hands. But the former 76ers owner joked on Instagram: 'We didn’t need the medical tent this year, no major injuries lol' The sports merchandise billionaire added: 'Might need a whole year for my liver to recover... incredible night with incredible people!' He is the CEO of Fanatics, the world's leading provider of licensed sports merchandise. Tom Brady, 45, attended the bash which included performances from Usher and Ne-Yo Harden, 33, rocked a fashionable suit and monochrome sunglasses for the party on Monday Model Grace Adele was among the 350 guests invited to the extravaganza in the Hamptons Rubin's annual exclusive Independence Day bash has become one of the Hamptons' most famous summer parties. The party included performances from Usher and Ne-Yo and guests were treated to the finest food and drinks. Starting at 5pm sharp on Dune Road, one of the Hamptons' most coveted addresses, the night kicked off with a parade of expensive sports cars and SUVS. The thrilling night finished with a spectacular firework show. Share or comment on this article: Kylian Mbappe parties with Tom Brady at Michael Rubin's star-studded white party in the Hamptons e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:03:53","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/17/72841915-0-image-a-33_1688486613385.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man Utd target’s manager ‘working against’ £60m transfer as midfielder ‘waits’ for Barcelona offer","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-targets-manager-working-against-ps60m-transfer-as-midfielder-waits-for-barcelona-offer-4206964","keywords":["Manchester United","Football","Sport"],"creator":["Jamie Kemble"],"video_url":null,"description":"All the latest transfer news surrounding Manchester United as pre-season takes hold.","content":"All the latest transfer news surrounding Manchester United as pre-season takes hold. are hard at work on new signings as pre-season kicks off at Carrington. The first set of players have already returned for pre-season, with more to come next week after some extra holiday time due to holidays. In the meantime, Erik ten Hag will begin work with his players while also landing new signings amid news will be a Red Devils player next season. United have a number of areas to strengthen, and the summer will come and go rapidly. Advertisement Advertisement As United search for targets, we have rounded up all the latest transfer news surrounding . Inter Milan boss Simone Inzaghi is said to be fighting against . United are said to be targeting the goalkeeper this summer as they look to replace David De Gea, who has seen his contract expire over the course of the last few days. Onana has established himself as one of the best goalkeepers in Europe, and it’s reported Inter will demand around £60million for his signature amid reported interest from United, Chelsea and Saudi Arabia. Inter are said to be willing to sell to fund new signings, but Tuttosport say Inzaghi is fighting internally and is keen to keep the keeper at all costs this summer. Advertisement Advertisement There have been plenty of reports over recent days claiming United have agreed personal terms with Fiorentina star Sofyan Amrabat. United have not agreed anything with Fiorentina, with the Italian club making that clear, but reports suggest the Red Devils are getting somewhere with the player himself. Though, say otherwise, with claims Amrabat still wants to join amid previous interest. In fact, the report claims the Morocco World Cup star will wait for an offer from Barcelona ahead of joining United this summer.","pubDate":"2023-07-04 16:03:51","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/07/04/14/GettyImages-1258590710.jpg?width=1200&auto=webp","source_id":"manchesterworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes €1bn release clause'","link":"https://www.dailymail.co.uk/sport/football/article-12263443/Vinicius-Junior-signs-new-contract-Real-Madrid-2027-includes-1bn-release-clause.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The winger's new deal includes a release clause of €1billion (£856million), which is designed to prevent Saudi Arabian clubs from attempting to sign him, as reported by AS .","content":"Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes a release clause of €1bn to prevent Saudi Arabian clubs from trying to sign him' Vinicus Junior has reportedly signed a new Real Madrid contract until 2027 The winger's new contract includes a staggering release clause of €1billion Vinicius has established himself as a key figure for Real and was given No 7 shirt By Jeorge Bird For Mailonline Published: 16:49, 4 July 2023 | Updated: 17:33, 4 July 2023 e-mail 3 View comments Vinicius Junior has reportedly signed a new contract with Real Madrid that will run until 2027. The winger's new deal includes a release clause of €1billion (£856million), which is designed to prevent Saudi Arabian clubs from attempting to sign him, as reported by AS . It has been a lengthy process to get the Brazil international to sign a new deal, with talks having initially taken place in September last year. However, the 22-year-old will remain at Real, where he has established himself as a hugely important player. Since signing from Flamengo in 2018, Vinicius has played 225 times for Real and has scored 59 goals while he has provided 64 assists. Vinicius Junior has signed a new contract with Real that will reportedly run until 2027 The winger's new deal with Carlo Ancelotti's team has a release clause of €1billion Vinicius scored the winner against Liverpool in the Champions League final in 2022, and he has won the LaLiga title twice and the Copa del Rey once. On the international stage he has been capped by Brazil 23 times and has scored thee goals. After Karim Benzema's departure to Al-Ittihad it is likely that there will now be even more responsibility on Vinicius' shoulders at Real. Vinicius' status at the club was reflected by the fact that he was recently given the No 7 shirt following Eden Hazard's departure. Real Madrid have already signed Jude Bellingham from Borussia Dortmund in a high-profile deal, while forward Joselu has joined on loan from Espanyol. Vinicius Junior has been rewarded with the No 7 shirt after five seasons at Real Madrid Share or comment on this article: Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes €1bn release clause' e-mail Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:01:07","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/16/72839765-0-image-a-3_1688484185473.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea agree deal to keep Ben Roberts under Mauricio Pochettino as head of goalkeeping department","link":"https://www.dailymail.co.uk/sport/football/article-12263431/Chelsea-agree-deal-Ben-Roberts-Mauricio-Pochettino-head-goalkeeping-department.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have agreed a deal to keep former manager Graham Potter's appointment, Ben Roberts, in an overseeing role in their goalkeeping department.","content":"Chelsea agree deal to keep Graham Potter appointment Ben Roberts in new role under Mauricio Pochettino as head of goalkeeping department Roberts arrived as part of Potter's backroom staff when he took over at Chelsea The goalkeeping coach has agreed to stay under Pochettino, but in a new role Pochettino has also brought in his own goalkeeper specialist this summer By Adrian Kajumba For Mailonline Published: 16:40 BST, 4 July 2023 | Updated: 17:00 BST, 4 July 2023 e-mail View comments Chelsea have agreed a deal to keep former manager Graham Potter 's appointment, Ben Roberts, in an overseeing role in their goalkeeping department. Mauricio Pochettino 's reign has officially begun and he has been joined at Chelsea by his own team of coaches, including his goalkeeper specialist Toni Jimenez. But Roberts will also remain and be part of the new era, though in a position with a far wider remit than the initial coaching job he took on when joining Chelsea from Brighton with Potter in September and one likely to see him spend less time on the training pitch. Mail Sport revealed in May that Chelsea had held talks with Roberts with a view to retaining him and his expertise at the club, where he is well-liked and respected. Those discussions have concluded successfully with the 48 year-old signing a long-term deal to stay on in a head of goalkeeping-type role. Ben Roberts (right) became Chelsea's goalkeeping coach under former boss Graham Potter Potter was dismissed as Chelsea head coach last season and remains out of work Mauricio Pochettino has brought goalkeeping expert Toni Jimenez (left) with him to Chelsea Roberts is set to have a hand in shaping the coaching of goalkeepers of all ages up to first-team, their development plus scouting and recruitment. And with Chelsea's owners buying French side Strasbourg last week and looking to add a Portuguese side to their stables, Roberts's responsibilities will not just be limited to Chelsea but expected to extend to covering all clubs in the group as it grows. That raises the prospect of Chelsea buying young hopefuls and being able to develop them at one of their partner clubs until they are deemed ready for a move to the Premier League. Having Roberts head things up should help better align the work done both within Chelsea and across their network with their goalkeepers while also improve pathways to first-team football for the club's stoppers due to having someone tasked with long-term planning. Roberts is one of the most highly rated coaches in England in his field having followed a 17-year professional playing career with a move into coaching and being responsible for the development of a string of top flight and professional goalkeepers. Bruno Saltor and Bjorn Hamberg also moved to Chelsea from Brighton and their coaching profiles remain on the club's website despite their lower profile since the latter's departure with their futures yet to be confirmed. Share or comment on this article: Chelsea agree deal to keep Ben Roberts under Mauricio Pochettino as head of goalkeeping department e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:00:56","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/16/72840523-0-image-a-8_1688485058037.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cardiff City announce first summer transfer as ex-Chelsea striker Ike Ugbo signs on loan","link":"https://www.walesonline.co.uk/sport/football/transfer-news/cardiff-city-announce-first-summer-27251041","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Glen Williams)"],"video_url":null,"description":"The Bluebirds have announced their first signing of the summer","content":"Cardiff City have announced their first signing of the Erol Bulut era as Ike Ugbo joins on a season-long loan from French club Troyes. During his unveiling, Bulut made a point of stating that Cardiff's attacking output had to be improved this season and has sought to address that in this transfer window. Indeed, we believe this to be the first of a spate of transfers in the coming days and weeks, with business set to ratchet up exactly one month out from the beginning of the Championship campaign. READ MORE: Cardiff City hold talks with Aaron Ramsey over sensational homecoming And Bulut will hope that Ugbo, 24 and a product of Chelsea's academy, is just one piece of the jigsaw which will slot into place in order to make the Bluebirds a far more threatening prospect at the top end of the pitch. “I’m very happy to be here. I’ve been waiting to come back to the English leagues for a while now and I’m really pleased that it’s finally over the line,\" Ugbo said. “I spoke to the manager before coming here. He was telling me how I suit the club, what I can do to help the club and what the club can do to help me. I think our ambitions align together, so I think it was a perfect choice for me. “For the team, I think we should push for the highest and try and get promoted. I think we shouldn’t short-change ourselves. There is great variety in the team, so I think we can do really good stuff this year. I can’t wait to finally put on the shirt and score my first goal for the club.” The Bluebirds are understood to have held interest in former Blues man Ugbo from last January when they brought in Sory Kaba and Connor Wickham. Scottish giants Rangers have also kept tabs on the Canada international. Ugbo has had spells with Barnsley, MK Dons, Scunthorpe United, Roda JC and Cercle Brugge while on loan from Chelsea before joining Genk permanently in 2021. The forward's loan to second division Dutch side Roda JC in 2019/20 shot him into the wider public conscience across Europe as he netted 13 goals in 28 league appearances for the club. It earned him a move to Belgian top-flight club Cercle Brugge, where he once again impressed with 16 goals in 32 league outings, helping him secure a permanent move away from Chelsea to Genk. He signed for Troyes last season in Ligue 1 after a successful loan spell with them. \"For me, this is an excellent signing for the offensive part of the team,\" manager Bulut said. \"Iké has shown what he can do over the last three years. When he was in Belgium he scored a lot of goals, and he did some very good things with Troyes as well. \"In 1v1 situations, he is really good in the box. His heading and finishing is also good. These are things that we need, because we know that last season the team did not score enough goals. \"We have signed him early, so he will have a pre-season with us. I think having a pre-season will bring a lot of positive things for him.\"","pubDate":"2023-07-04 16:00:00","image_url":"https://i2-prod.walesonline.co.uk/incoming/article27255337.ece/ALTERNATES/s615/1_ike-ugbo1.jpg","source_id":"walesonline","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Revealed: How Komphela Asked Downs To Leave","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Swallows-FC/how-steve-komphela-asked-mamelodi-sundowns-to-leave-for-swallows-20230704","keywords":null,"creator":null,"video_url":null,"description":"New Swallows FC head coach Steve Komphela has revealed how Mamelodi Sundowns reacted to the news of him wanting to leave and what it took for them to release him.","content":"New Swallows FC head coach Steve Komphela has revealed how Mamelodi Sundowns reacted to the news of him wanting to leave and what it took for them to release him. Swallows shocked the football fraternity on Sunday , effective immediately. The experienced mentor had one year left to run as an assistant coach at Sundowns and has explained how he broke the news to the Tshwane giants that he wanted to leave and join the Birds. \"You talk to relevant people. I think Sundowns has given one so much respect, so much quality in approach and even achievement that it would take a lunatic not to be grateful, not to follow the right processes in terms of requesting for or in terms of advice,\" Komphela said on . \"I did consult with the chairman, obviously the president would know about the proceedings and up until it now gets to a stage you have to cut the throat, which is the most painful. \"Because you fully understand that as you cut the throat, when blood spills, it does not only splatter on your toes or shoes, there's a whole lot of bystanders, people who appreciate the brand who are likely to be affected,\" he said. \"So you have to be very careful when that happens, it must be done with dignity and I think it was dealt with in a very dignified manner.\" The former Kaizer Chiefs coach continued and revealed that the negotiations for his release were not easy, as Sundowns did not see it coming and he had to be patient before finally going for the \"jugular\". \"Not a fight, not understood either because when you bring something to the table, a discussion that is quite serious, it does trigger a lot, wait a minute, 'Where did this come from?' And you have to explain yourself and you strike some sort of agreement, you develop frameworks and you retreat a bit, you give it another shot,\" Komphela went on. \"Because you don't just break sad news and expect the news will be carried forth, no. It will be a question of, 'Wait a minute, what did you say?' \"So, you try to cushion yourself in a manner that (you) can understand in the same manner it was put across. So, these processes went on and on up until as I said we had to go for the jagular,\" he added. Swallows chairman David Mogashoa also revealed, in the same interview, that he started negotiating virtually with Komphela a week before this past weekend, before they finally met in person on Saturday. However, Mogashoa already had exploratory talks with Komphela's agent before he spoke to the erudite tactician and Sundowns. You must be to read and post comments.","pubDate":"2023-07-04 17:12:29","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | PSG 'Identify' Neymar Replacement","link":"https://www.snl24.com/soccerladuma/International/Ligue-1/psg-identify-neymar-replacement-20230704-2","keywords":null,"creator":null,"video_url":null,"description":"With Neymar heavily tipped to make a move away from Paris Saint-Germain, the French giants have reportedly already identified a potential replacement for the Brazilian superstar.","content":"With Neymar heavily tipped to make a move away from Paris Saint-Germain, the French giants have reportedly already identified a potential replacement for the Brazilian superstar. For much of 2023, rumours have been abounded about the 31-year-old's potential exit from the Parc des Princes, with the club believed to be disillusioned with the return on their world-record investment in the winger. Brazil's all-time top goalscorer has not played football since February following an ankle injury, with multiple reports suggesting that the attacker has already played his final game in PSG colours. According to , Les Parisiens are already looking at possible replacements for the Selecao forward, and one of the names being considered is Portugal star Joao Felix. The 23-year-old has returned to Atletico Madrid following a short loan stint with Chelsea in the second half of the 2022/23 campaign, but the attacker's situation in the Spanish capital does not seem to have changed and he reportedly wants to leave Los Rojiblancos. The Viseu native's arrival in the French capital, however, will be contingent on whether or not the record Ligue 1 champions are able to successfully get Neymar off their books. Spanish tactician Luis Enrique is expected to be revealed as PSG's newest boss soon, and it is said that he is likely to overrule any sale of Neymar as the pair will be reunited for the first time since their successful spell together at Barcelona between 2014 and 2017. The same report claims that the French club and Neymar's representatives will seek a resolution over the player's future within the next 10 days. You must be to read and post comments.","pubDate":"2023-07-04 17:12:29","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Should Kaizer Chiefs be doing better than Ranga Chivaviro?","link":"https://www.thesouthafrican.com/sport/soccer/psl-south-africa/should-kaizer-chiefs-should-be-doing-better-than-ranga-chivaviro-psl-4-july-2023/","keywords":["Premier Soccer League","Featured","Kaizer Chiefs","Ranga Chivaviro"],"creator":["James Freemantle"],"video_url":null,"description":"Kaizer Chiefs have put all of their striking eggs in the Ranga Chivaviro basket. We've asked if that's such a good long-term idea.","content":"Kaizer Chiefs have confirmed the signing of Ranga Chivaviro from Marumo Gallants and he’ll wear the number 7 jersey. Is that a good thing though? ICYMI: Five things to know about Molefi Ntseki MSHINI: Ngcobo like a new signing for Chiefs? Chivaviro’s track record Ranga Chivaviro was prolific for Gallants last term, scoring 17 times in 30 appearances across all competitions. It’s a stat that’s all the more impressive if you consider it was for a team who got relegated. However, the converse of that is you start to wonder how Chivaviro would cope in an environment where success is demanded on a weekly basis. He did score double figures in the PSL last term, but then again so did Khanyisa Mayo. Chivaviro has never been prolific in any other season barring 2022-23, so the pressure is on at Naturena. CONFIRMED: Six new players and their jersey numbers Wrong side of 30 Chivaviro will turn 31 in November and it’s difficult to ensure that he’ll improve as a player from here. Obviously, if he grabs double figures for Chiefs in the league in his debut campaign, they might say the move has been justified. However, with little to no resale value, Chivaviro’s signing represents a significant risk. Should Chiefs have tried to put all their eggs in the Mayo basket? We all know the Cape Town City star signed a new deal with the Citizens, but a big offer could have been tempting. There were other options on the market. Just saying. NATURENA: Remember the name of this latest wonder kid! Ranga must deliver for Chiefs from day one Simply put, what is the long-term goal-scoring plan beyond Ranga Chivaviro? It doesn’t seem very obvious for now. There’s also the worry he doesn’t fire on all cylinders, and then there’s a real issue to solve. If he does deliver in his maiden campaign then it’ll be a massive bonus for both the player and the club. If he doesn’t, serious questions will have to be asked. CONFIRMED: Six new players and their jersey numbers Do you think Ranga will deliver the goods for the Glamour Boys? Meanwhile, hit up James Freemantle for more insights, analysis and love for the beautiful game of football. Also, follow The South African on Twitter for up-to-the-minute news updates","pubDate":"2023-07-04 16:11:33","image_url":"https://www.thesouthafrican.com/wp-content/uploads/2023/03/Chiefs-3-e1687499943651-1200x1000.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Room for one more? Kaizer Chiefs in talks to complete ‘surprise’ signing!","link":"https://www.thesouthafrican.com/sport/soccer/psl-south-africa/room-for-one-more-kaizer-chiefs-in-talks-to-complete-surprise-signing-04-july-2023/","keywords":["Premier Soccer League","DStv Premiership","Featured","Important","Kaizer Chiefs","Surprise Ralani"],"creator":["Yolulwe Qoshe"],"video_url":null,"description":"Having already confirmed six new signings on Monday, Chiefs are believed to be far from done in the transfer market ahead of the new season.","content":"Having already confirmed six new signings on Monday, Chiefs are believed to be far from done in the transfer market ahead of the new season. READ | NEW KAIZER CHIEFS SIGNINGS SPOTTED ON THE FIELD FOR THE FIRST TIME IN NEW KIT! The players that Chiefs announced are Thathayoane Ditlhokwe , Given Msimango, Mduduzi Mdantsane , Edson Castillo , Pule Mmodi and Ranga Chivaviro . Multi-million Jackpots Ticket sales close in: Days : Hours : Minutes : Seconds Play Powerball Now! READ | EXCITING YOUNGSTER REJOINS ORLANDO PIRATES, GETS CHANCE TO IMPRESS IN SPAIN? Those players putting pen to paper at Chiefs has been more or less an open secret for a while now, with fans and the football fraternity just waiting for the club to officially announce them. Looking at that list, three of the six in Chivaviro, Mmodi and Mdantsane are capable of playing in offensive positions. But it looks like new head coach Molefi Ntseki may not be done yet in that regard. Multi-million Jackpots Ticket sales close in: Days : Hours : Minutes : Seconds Play Powerball Now! READ | MAMELODI SUNDOWNS RELEASE ATTACKER, SOWETO GIANTS TO POUNCE? According to Soccer-Laduma , Chiefs have opened talks to sign Bradley Surprise Ralani, who has just been released by former club Mamelodi Sundowns following the expiration of his contract on 30 June. Chiefs in talks to sign Ralani? “What I can tell you for now is that the club (Chiefs) is talking to the player (Ralani). Whether it’s through his representatives or direct to him, that I’m not sure about, but what I’m sure of is that they’re talking. “I don’t think they are that much in a hurry because he is a free agent. But wanting him and talking to him I know they are,” said one source to the publication above. READ | (WATCH) KAIZER CHIEFS NEW SIGNINGS GET STUCK IN ON DAY ONE Another source also weighed in on the supposed talks between Chiefs and Ralani. READ | (PICTURE) MAMELODI SUNDOWNS FANS WELCOME NEW SOUTH AMERICAN SIGNING UPON ARRIVAL “There are other wingers that they are looking at including Sanele Barns of Richards Bay and also if some of their players go on loan then they don’t have a very big squad for next season, But, yes they are talking to Bradley (Ralani). Only time and situation will tell,” said the second source. READ | MAMELODI SUNDOWNS PRESENT ‘TAKE IT OR LEAVE IT’ OFFER FOR SUPERSPORT UNITED FOR STAR MAN It would certainly come as a ‘surprise’ as Ralani is currently 35-years-old and Chiefs have multitude of wingers who are yet to fully show their full potential. Additionally, Amakhosi have tried over the past year to significantly drop their age average.","pubDate":"2023-07-04 16:08:59","image_url":"https://www.thesouthafrican.com/www.thesouthafrican.com/wp-content/plugins/lotto-powerball-banners/assets/images/powerball-logo-min.png","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Swansea City complete move for young full-back Josh Key","link":"https://www.walesonline.co.uk/sport/football/transfer-news/swansea-city-complete-move-young-27256158","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Tom Coleman)"],"video_url":null,"description":"The 23-year-old has signed a three-year deal with the Swans after leaving Exeter","content":"Josh Key has become Swansea City's second signing of the summer transfer window. The young full-back left Exeter City following the expiration of his deal with the Grecians, and has now signed a three-year contract with Swansea with the option for an additional 12 months. The 23-year-old has been on the club's radar since January, and was linked with a number of other Championship clubs in this window. However, he has chosen a move to SA1, and follows Josh Ginnelly in strengthening Michael Duff's squad. Although Key's contract has expired, Swansea will have to pay out compensation to Exeter as the player is under the age of 24. Negotiations on that front are ongoing. Key leaves Devon having scored eight goals in 148 senior appearances for Exeter, who despite offering him a new deal couldn't persuade him to stay. The move bolsters Duff's full-back options, which had been left depleted following the departures of Joel Latibeaudiere and Ryan Manning. Key will wear the number two shirt.","pubDate":"2023-07-04 16:08:14","image_url":"https://i2-prod.walesonline.co.uk/incoming/article27256159.ece/ALTERNATES/s615/0_Josh-Key.jpg","source_id":"walesonline","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Kylian Mbappe parties with Tom Brady at Michael Rubin's star-studded white party in the Hamptons","link":"https://www.dailymail.co.uk/sport/football/article-12263497/Kylian-Mbappe-parties-Tom-Brady-Michael-Rubins-star-studded-white-party-Hamptons.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The 24-year-old France striker partied with the likes of Tom Brady, Leonardo Di Caprio, Jennifer Lopez, Ben Affleck, Beyonce and Jay-Z at Rubin's sprawling $50million Bridgehampton pad.","content":"Kylian Mbappe parties with Tom Brady and poses for snaps with stunning model Grace Adele as he attends Michael Rubin's star-studded white party in the Hamptons Billionaire Michael Rubin welcomed some of sports' biggest names to his party Kylian Mbappe partied with the likes of Joe Burrow, Tom Brady and Beyonce DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Published: 17:03, 4 July 2023 | Updated: 17:21, 4 July 2023 e-mail 2 View comments Kylian Mbappe welcomed in the 4th of July alongside some of the biggest names in sports and showbiz at billionaire Michael Rubin's annual extravaganza in the Hamptons. The France striker partied with the likes of Tom Brady, Leonardo Di Caprio, Jennifer Lopez , Ben Affleck , Beyonce , Jay-Z, Kendall Jenner, Hailey and Justin Bieber at Rubin's $50million Bridgehampton pad. Mbappe, whose long-term future at Paris Saint-Germain remains clouded in mystery, was pictured w ith stunning model Grace Adele at the star-studded white party, which saw 350 people crammed on to one of the most expensive stretches of beach in the world. Among the other sports stars invited to the Hamptons were James Harden of the Philadelphia 76ers, Dallas Cowboys linebacker Micah Parsons and Cincinnati Bengals quarterback Joe Burrow. The athletes could be seen clinking glasses with Rubin and others, all dressed in white for the annual bash, which saw Usher on the mic and appearances from some of Hollywood's biggest stars. Kylian Mbappe pictured with model Grace Adele at Michael Rubin's party in the Hamptons Dallas Cowboys linebacker Micah Parsons (left) was among the other sports stars with Mbappe James Harden of the Philadelphia 76ers and Tom Brady are pictured with billionaire Rubin Leonardo Di Caprio was one of hundreds of household names to attend the Hamptons bash There were armies of valets and security guards on-hand to keep out party crashers. After several incidents at the last two events, Rubin brought in an entire medical staff this year to keep his well-heeled guests in safe hands. But the former 76ers owner joked on Instagram: 'We didn’t need the medical tent this year, no major injuries lol' The sports merchandise billionaire added: 'Might need a whole year for my liver to recover... incredible night with incredible people!' He is the CEO of Fanatics, the world's leading provider of licensed sports merchandise. Tom Brady, 45, attended the bash which included performances from Usher and Ne-Yo Harden, 33, rocked a fashionable suit and monochrome sunglasses for the party on Monday Model Grace Adele was among the 350 guests invited to the extravaganza in the Hamptons Rubin's annual exclusive Independence Day bash has become one of the Hamptons' most famous summer parties. The party included performances from Usher and Ne-Yo and guests were treated to the finest food and drinks. Starting at 5pm sharp on Dune Road, one of the Hamptons' most coveted addresses, the night kicked off with a parade of expensive sports cars and SUVS. The thrilling night finished with a spectacular firework show. Share or comment on this article: Kylian Mbappe parties with Tom Brady at Michael Rubin's star-studded white party in the Hamptons e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:03:53","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/17/72841915-0-image-a-33_1688486613385.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man Utd target’s manager ‘working against’ £60m transfer as midfielder ‘waits’ for Barcelona offer","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-targets-manager-working-against-ps60m-transfer-as-midfielder-waits-for-barcelona-offer-4206964","keywords":["Manchester United","Football","Sport"],"creator":["Jamie Kemble"],"video_url":null,"description":"All the latest transfer news surrounding Manchester United as pre-season takes hold.","content":"All the latest transfer news surrounding Manchester United as pre-season takes hold. are hard at work on new signings as pre-season kicks off at Carrington. The first set of players have already returned for pre-season, with more to come next week after some extra holiday time due to holidays. In the meantime, Erik ten Hag will begin work with his players while also landing new signings amid news will be a Red Devils player next season. United have a number of areas to strengthen, and the summer will come and go rapidly. Advertisement Advertisement As United search for targets, we have rounded up all the latest transfer news surrounding . Inter Milan boss Simone Inzaghi is said to be fighting against . United are said to be targeting the goalkeeper this summer as they look to replace David De Gea, who has seen his contract expire over the course of the last few days. Onana has established himself as one of the best goalkeepers in Europe, and it’s reported Inter will demand around £60million for his signature amid reported interest from United, Chelsea and Saudi Arabia. Inter are said to be willing to sell to fund new signings, but Tuttosport say Inzaghi is fighting internally and is keen to keep the keeper at all costs this summer. Advertisement Advertisement There have been plenty of reports over recent days claiming United have agreed personal terms with Fiorentina star Sofyan Amrabat. United have not agreed anything with Fiorentina, with the Italian club making that clear, but reports suggest the Red Devils are getting somewhere with the player himself. Though, say otherwise, with claims Amrabat still wants to join amid previous interest. In fact, the report claims the Morocco World Cup star will wait for an offer from Barcelona ahead of joining United this summer.","pubDate":"2023-07-04 16:03:51","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/07/04/14/GettyImages-1258590710.jpg?width=1200&auto=webp","source_id":"manchesterworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes €1bn release clause'","link":"https://www.dailymail.co.uk/sport/football/article-12263443/Vinicius-Junior-signs-new-contract-Real-Madrid-2027-includes-1bn-release-clause.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The winger's new deal includes a release clause of €1billion (£856million), which is designed to prevent Saudi Arabian clubs from attempting to sign him, as reported by AS .","content":"Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes a release clause of €1bn to prevent Saudi Arabian clubs from trying to sign him' Vinicus Junior has reportedly signed a new Real Madrid contract until 2027 The winger's new contract includes a staggering release clause of €1billion Vinicius has established himself as a key figure for Real and was given No 7 shirt By Jeorge Bird For Mailonline Published: 16:49, 4 July 2023 | Updated: 17:33, 4 July 2023 e-mail 3 View comments Vinicius Junior has reportedly signed a new contract with Real Madrid that will run until 2027. The winger's new deal includes a release clause of €1billion (£856million), which is designed to prevent Saudi Arabian clubs from attempting to sign him, as reported by AS . It has been a lengthy process to get the Brazil international to sign a new deal, with talks having initially taken place in September last year. However, the 22-year-old will remain at Real, where he has established himself as a hugely important player. Since signing from Flamengo in 2018, Vinicius has played 225 times for Real and has scored 59 goals while he has provided 64 assists. Vinicius Junior has signed a new contract with Real that will reportedly run until 2027 The winger's new deal with Carlo Ancelotti's team has a release clause of €1billion Vinicius scored the winner against Liverpool in the Champions League final in 2022, and he has won the LaLiga title twice and the Copa del Rey once. On the international stage he has been capped by Brazil 23 times and has scored thee goals. After Karim Benzema's departure to Al-Ittihad it is likely that there will now be even more responsibility on Vinicius' shoulders at Real. Vinicius' status at the club was reflected by the fact that he was recently given the No 7 shirt following Eden Hazard's departure. Real Madrid have already signed Jude Bellingham from Borussia Dortmund in a high-profile deal, while forward Joselu has joined on loan from Espanyol. Vinicius Junior has been rewarded with the No 7 shirt after five seasons at Real Madrid Share or comment on this article: Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes €1bn release clause' e-mail Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:01:07","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/16/72839765-0-image-a-3_1688484185473.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea agree deal to keep Ben Roberts under Mauricio Pochettino as head of goalkeeping department","link":"https://www.dailymail.co.uk/sport/football/article-12263431/Chelsea-agree-deal-Ben-Roberts-Mauricio-Pochettino-head-goalkeeping-department.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have agreed a deal to keep former manager Graham Potter's appointment, Ben Roberts, in an overseeing role in their goalkeeping department.","content":"Chelsea agree deal to keep Graham Potter appointment Ben Roberts in new role under Mauricio Pochettino as head of goalkeeping department Roberts arrived as part of Potter's backroom staff when he took over at Chelsea The goalkeeping coach has agreed to stay under Pochettino, but in a new role Pochettino has also brought in his own goalkeeper specialist this summer By Adrian Kajumba For Mailonline Published: 16:40 BST, 4 July 2023 | Updated: 17:00 BST, 4 July 2023 e-mail View comments Chelsea have agreed a deal to keep former manager Graham Potter 's appointment, Ben Roberts, in an overseeing role in their goalkeeping department. Mauricio Pochettino 's reign has officially begun and he has been joined at Chelsea by his own team of coaches, including his goalkeeper specialist Toni Jimenez. But Roberts will also remain and be part of the new era, though in a position with a far wider remit than the initial coaching job he took on when joining Chelsea from Brighton with Potter in September and one likely to see him spend less time on the training pitch. Mail Sport revealed in May that Chelsea had held talks with Roberts with a view to retaining him and his expertise at the club, where he is well-liked and respected. Those discussions have concluded successfully with the 48 year-old signing a long-term deal to stay on in a head of goalkeeping-type role. Ben Roberts (right) became Chelsea's goalkeeping coach under former boss Graham Potter Potter was dismissed as Chelsea head coach last season and remains out of work Mauricio Pochettino has brought goalkeeping expert Toni Jimenez (left) with him to Chelsea Roberts is set to have a hand in shaping the coaching of goalkeepers of all ages up to first-team, their development plus scouting and recruitment. And with Chelsea's owners buying French side Strasbourg last week and looking to add a Portuguese side to their stables, Roberts's responsibilities will not just be limited to Chelsea but expected to extend to covering all clubs in the group as it grows. That raises the prospect of Chelsea buying young hopefuls and being able to develop them at one of their partner clubs until they are deemed ready for a move to the Premier League. Having Roberts head things up should help better align the work done both within Chelsea and across their network with their goalkeepers while also improve pathways to first-team football for the club's stoppers due to having someone tasked with long-term planning. Roberts is one of the most highly rated coaches in England in his field having followed a 17-year professional playing career with a move into coaching and being responsible for the development of a string of top flight and professional goalkeepers. Bruno Saltor and Bjorn Hamberg also moved to Chelsea from Brighton and their coaching profiles remain on the club's website despite their lower profile since the latter's departure with their futures yet to be confirmed. Share or comment on this article: Chelsea agree deal to keep Ben Roberts under Mauricio Pochettino as head of goalkeeping department e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:00:56","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/16/72840523-0-image-a-8_1688485058037.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cardiff City announce first summer transfer as ex-Chelsea striker Ike Ugbo signs on loan","link":"https://www.walesonline.co.uk/sport/football/transfer-news/cardiff-city-announce-first-summer-27251041","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Glen Williams)"],"video_url":null,"description":"The Bluebirds have announced their first signing of the summer","content":"Cardiff City have announced their first signing of the Erol Bulut era as Ike Ugbo joins on a season-long loan from French club Troyes. During his unveiling, Bulut made a point of stating that Cardiff's attacking output had to be improved this season and has sought to address that in this transfer window. Indeed, we believe this to be the first of a spate of transfers in the coming days and weeks, with business set to ratchet up exactly one month out from the beginning of the Championship campaign. READ MORE: Cardiff City hold talks with Aaron Ramsey over sensational homecoming And Bulut will hope that Ugbo, 24 and a product of Chelsea's academy, is just one piece of the jigsaw which will slot into place in order to make the Bluebirds a far more threatening prospect at the top end of the pitch. “I’m very happy to be here. I’ve been waiting to come back to the English leagues for a while now and I’m really pleased that it’s finally over the line,\" Ugbo said. “I spoke to the manager before coming here. He was telling me how I suit the club, what I can do to help the club and what the club can do to help me. I think our ambitions align together, so I think it was a perfect choice for me. “For the team, I think we should push for the highest and try and get promoted. I think we shouldn’t short-change ourselves. There is great variety in the team, so I think we can do really good stuff this year. I can’t wait to finally put on the shirt and score my first goal for the club.” The Bluebirds are understood to have held interest in former Blues man Ugbo from last January when they brought in Sory Kaba and Connor Wickham. Scottish giants Rangers have also kept tabs on the Canada international. Ugbo has had spells with Barnsley, MK Dons, Scunthorpe United, Roda JC and Cercle Brugge while on loan from Chelsea before joining Genk permanently in 2021. The forward's loan to second division Dutch side Roda JC in 2019/20 shot him into the wider public conscience across Europe as he netted 13 goals in 28 league appearances for the club. It earned him a move to Belgian top-flight club Cercle Brugge, where he once again impressed with 16 goals in 32 league outings, helping him secure a permanent move away from Chelsea to Genk. He signed for Troyes last season in Ligue 1 after a successful loan spell with them. \"For me, this is an excellent signing for the offensive part of the team,\" manager Bulut said. \"Iké has shown what he can do over the last three years. When he was in Belgium he scored a lot of goals, and he did some very good things with Troyes as well. \"In 1v1 situations, he is really good in the box. His heading and finishing is also good. These are things that we need, because we know that last season the team did not score enough goals. \"We have signed him early, so he will have a pre-season with us. I think having a pre-season will bring a lot of positive things for him.\"","pubDate":"2023-07-04 16:00:00","image_url":"https://i2-prod.walesonline.co.uk/incoming/article27255337.ece/ALTERNATES/s615/1_ike-ugbo1.jpg","source_id":"walesonline","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | Revealed: How Komphela Asked Downs To Leave","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Swallows-FC/how-steve-komphela-asked-mamelodi-sundowns-to-leave-for-swallows-20230704","keywords":null,"creator":null,"video_url":null,"description":"New Swallows FC head coach Steve Komphela has revealed how Mamelodi Sundowns reacted to the news of him wanting to leave and what it took for them to release him.","content":"New Swallows FC head coach Steve Komphela has revealed how Mamelodi Sundowns reacted to the news of him wanting to leave and what it took for them to release him. Swallows shocked the football fraternity on Sunday , effective immediately. The experienced mentor had one year left to run as an assistant coach at Sundowns and has explained how he broke the news to the Tshwane giants that he wanted to leave and join the Birds. \"You talk to relevant people. I think Sundowns has given one so much respect, so much quality in approach and even achievement that it would take a lunatic not to be grateful, not to follow the right processes in terms of requesting for or in terms of advice,\" Komphela said on . \"I did consult with the chairman, obviously the president would know about the proceedings and up until it now gets to a stage you have to cut the throat, which is the most painful. \"Because you fully understand that as you cut the throat, when blood spills, it does not only splatter on your toes or shoes, there's a whole lot of bystanders, people who appreciate the brand who are likely to be affected,\" he said. \"So you have to be very careful when that happens, it must be done with dignity and I think it was dealt with in a very dignified manner.\" The former Kaizer Chiefs coach continued and revealed that the negotiations for his release were not easy, as Sundowns did not see it coming and he had to be patient before finally going for the \"jugular\". \"Not a fight, not understood either because when you bring something to the table, a discussion that is quite serious, it does trigger a lot, wait a minute, 'Where did this come from?' And you have to explain yourself and you strike some sort of agreement, you develop frameworks and you retreat a bit, you give it another shot,\" Komphela went on. \"Because you don't just break sad news and expect the news will be carried forth, no. It will be a question of, 'Wait a minute, what did you say?' \"So, you try to cushion yourself in a manner that (you) can understand in the same manner it was put across. So, these processes went on and on up until as I said we had to go for the jagular,\" he added. Swallows chairman David Mogashoa also revealed, in the same interview, that he started negotiating virtually with Komphela a week before this past weekend, before they finally met in person on Saturday. However, Mogashoa already had exploratory talks with Komphela's agent before he spoke to the erudite tactician and Sundowns. You must be to read and post comments.","pubDate":"2023-07-04 17:12:29","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | PSG 'Identify' Neymar Replacement","link":"https://www.snl24.com/soccerladuma/International/Ligue-1/psg-identify-neymar-replacement-20230704-2","keywords":null,"creator":null,"video_url":null,"description":"With Neymar heavily tipped to make a move away from Paris Saint-Germain, the French giants have reportedly already identified a potential replacement for the Brazilian superstar.","content":"With Neymar heavily tipped to make a move away from Paris Saint-Germain, the French giants have reportedly already identified a potential replacement for the Brazilian superstar. For much of 2023, rumours have been abounded about the 31-year-old's potential exit from the Parc des Princes, with the club believed to be disillusioned with the return on their world-record investment in the winger. Brazil's all-time top goalscorer has not played football since February following an ankle injury, with multiple reports suggesting that the attacker has already played his final game in PSG colours. According to , Les Parisiens are already looking at possible replacements for the Selecao forward, and one of the names being considered is Portugal star Joao Felix. The 23-year-old has returned to Atletico Madrid following a short loan stint with Chelsea in the second half of the 2022/23 campaign, but the attacker's situation in the Spanish capital does not seem to have changed and he reportedly wants to leave Los Rojiblancos. The Viseu native's arrival in the French capital, however, will be contingent on whether or not the record Ligue 1 champions are able to successfully get Neymar off their books. Spanish tactician Luis Enrique is expected to be revealed as PSG's newest boss soon, and it is said that he is likely to overrule any sale of Neymar as the pair will be reunited for the first time since their successful spell together at Barcelona between 2014 and 2017. The same report claims that the French club and Neymar's representatives will seek a resolution over the player's future within the next 10 days. You must be to read and post comments.","pubDate":"2023-07-04 17:12:29","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Should Kaizer Chiefs be doing better than Ranga Chivaviro?","link":"https://www.thesouthafrican.com/sport/soccer/psl-south-africa/should-kaizer-chiefs-should-be-doing-better-than-ranga-chivaviro-psl-4-july-2023/","keywords":["Premier Soccer League","Featured","Kaizer Chiefs","Ranga Chivaviro"],"creator":["James Freemantle"],"video_url":null,"description":"Kaizer Chiefs have put all of their striking eggs in the Ranga Chivaviro basket. We've asked if that's such a good long-term idea.","content":"Kaizer Chiefs have confirmed the signing of Ranga Chivaviro from Marumo Gallants and he’ll wear the number 7 jersey. Is that a good thing though? ICYMI: Five things to know about Molefi Ntseki MSHINI: Ngcobo like a new signing for Chiefs? Chivaviro’s track record Ranga Chivaviro was prolific for Gallants last term, scoring 17 times in 30 appearances across all competitions. It’s a stat that’s all the more impressive if you consider it was for a team who got relegated. However, the converse of that is you start to wonder how Chivaviro would cope in an environment where success is demanded on a weekly basis. He did score double figures in the PSL last term, but then again so did Khanyisa Mayo. Chivaviro has never been prolific in any other season barring 2022-23, so the pressure is on at Naturena. CONFIRMED: Six new players and their jersey numbers Wrong side of 30 Chivaviro will turn 31 in November and it’s difficult to ensure that he’ll improve as a player from here. Obviously, if he grabs double figures for Chiefs in the league in his debut campaign, they might say the move has been justified. However, with little to no resale value, Chivaviro’s signing represents a significant risk. Should Chiefs have tried to put all their eggs in the Mayo basket? We all know the Cape Town City star signed a new deal with the Citizens, but a big offer could have been tempting. There were other options on the market. Just saying. NATURENA: Remember the name of this latest wonder kid! Ranga must deliver for Chiefs from day one Simply put, what is the long-term goal-scoring plan beyond Ranga Chivaviro? It doesn’t seem very obvious for now. There’s also the worry he doesn’t fire on all cylinders, and then there’s a real issue to solve. If he does deliver in his maiden campaign then it’ll be a massive bonus for both the player and the club. If he doesn’t, serious questions will have to be asked. CONFIRMED: Six new players and their jersey numbers Do you think Ranga will deliver the goods for the Glamour Boys? Meanwhile, hit up James Freemantle for more insights, analysis and love for the beautiful game of football. Also, follow The South African on Twitter for up-to-the-minute news updates","pubDate":"2023-07-04 16:11:33","image_url":"https://www.thesouthafrican.com/wp-content/uploads/2023/03/Chiefs-3-e1687499943651-1200x1000.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Room for one more? Kaizer Chiefs in talks to complete ‘surprise’ signing!","link":"https://www.thesouthafrican.com/sport/soccer/psl-south-africa/room-for-one-more-kaizer-chiefs-in-talks-to-complete-surprise-signing-04-july-2023/","keywords":["Premier Soccer League","DStv Premiership","Featured","Important","Kaizer Chiefs","Surprise Ralani"],"creator":["Yolulwe Qoshe"],"video_url":null,"description":"Having already confirmed six new signings on Monday, Chiefs are believed to be far from done in the transfer market ahead of the new season.","content":"Having already confirmed six new signings on Monday, Chiefs are believed to be far from done in the transfer market ahead of the new season. READ | NEW KAIZER CHIEFS SIGNINGS SPOTTED ON THE FIELD FOR THE FIRST TIME IN NEW KIT! The players that Chiefs announced are Thathayoane Ditlhokwe , Given Msimango, Mduduzi Mdantsane , Edson Castillo , Pule Mmodi and Ranga Chivaviro . Multi-million Jackpots Ticket sales close in: Days : Hours : Minutes : Seconds Play Powerball Now! READ | EXCITING YOUNGSTER REJOINS ORLANDO PIRATES, GETS CHANCE TO IMPRESS IN SPAIN? Those players putting pen to paper at Chiefs has been more or less an open secret for a while now, with fans and the football fraternity just waiting for the club to officially announce them. Looking at that list, three of the six in Chivaviro, Mmodi and Mdantsane are capable of playing in offensive positions. But it looks like new head coach Molefi Ntseki may not be done yet in that regard. Multi-million Jackpots Ticket sales close in: Days : Hours : Minutes : Seconds Play Powerball Now! READ | MAMELODI SUNDOWNS RELEASE ATTACKER, SOWETO GIANTS TO POUNCE? According to Soccer-Laduma , Chiefs have opened talks to sign Bradley Surprise Ralani, who has just been released by former club Mamelodi Sundowns following the expiration of his contract on 30 June. Chiefs in talks to sign Ralani? “What I can tell you for now is that the club (Chiefs) is talking to the player (Ralani). Whether it’s through his representatives or direct to him, that I’m not sure about, but what I’m sure of is that they’re talking. “I don’t think they are that much in a hurry because he is a free agent. But wanting him and talking to him I know they are,” said one source to the publication above. READ | (WATCH) KAIZER CHIEFS NEW SIGNINGS GET STUCK IN ON DAY ONE Another source also weighed in on the supposed talks between Chiefs and Ralani. READ | (PICTURE) MAMELODI SUNDOWNS FANS WELCOME NEW SOUTH AMERICAN SIGNING UPON ARRIVAL “There are other wingers that they are looking at including Sanele Barns of Richards Bay and also if some of their players go on loan then they don’t have a very big squad for next season, But, yes they are talking to Bradley (Ralani). Only time and situation will tell,” said the second source. READ | MAMELODI SUNDOWNS PRESENT ‘TAKE IT OR LEAVE IT’ OFFER FOR SUPERSPORT UNITED FOR STAR MAN It would certainly come as a ‘surprise’ as Ralani is currently 35-years-old and Chiefs have multitude of wingers who are yet to fully show their full potential. Additionally, Amakhosi have tried over the past year to significantly drop their age average.","pubDate":"2023-07-04 16:08:59","image_url":"https://www.thesouthafrican.com/www.thesouthafrican.com/wp-content/plugins/lotto-powerball-banners/assets/images/powerball-logo-min.png","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Swansea City complete move for young full-back Josh Key","link":"https://www.walesonline.co.uk/sport/football/transfer-news/swansea-city-complete-move-young-27256158","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Tom Coleman)"],"video_url":null,"description":"The 23-year-old has signed a three-year deal with the Swans after leaving Exeter","content":"Josh Key has become Swansea City's second signing of the summer transfer window. The young full-back left Exeter City following the expiration of his deal with the Grecians, and has now signed a three-year contract with Swansea with the option for an additional 12 months. The 23-year-old has been on the club's radar since January, and was linked with a number of other Championship clubs in this window. However, he has chosen a move to SA1, and follows Josh Ginnelly in strengthening Michael Duff's squad. Although Key's contract has expired, Swansea will have to pay out compensation to Exeter as the player is under the age of 24. Negotiations on that front are ongoing. Key leaves Devon having scored eight goals in 148 senior appearances for Exeter, who despite offering him a new deal couldn't persuade him to stay. The move bolsters Duff's full-back options, which had been left depleted following the departures of Joel Latibeaudiere and Ryan Manning. Key will wear the number two shirt.","pubDate":"2023-07-04 16:08:14","image_url":"https://i2-prod.walesonline.co.uk/incoming/article27256159.ece/ALTERNATES/s615/0_Josh-Key.jpg","source_id":"walesonline","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Kylian Mbappe parties with Tom Brady at Michael Rubin's star-studded white party in the Hamptons","link":"https://www.dailymail.co.uk/sport/football/article-12263497/Kylian-Mbappe-parties-Tom-Brady-Michael-Rubins-star-studded-white-party-Hamptons.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The 24-year-old France striker partied with the likes of Tom Brady, Leonardo Di Caprio, Jennifer Lopez, Ben Affleck, Beyonce and Jay-Z at Rubin's sprawling $50million Bridgehampton pad.","content":"Kylian Mbappe parties with Tom Brady and poses for snaps with stunning model Grace Adele as he attends Michael Rubin's star-studded white party in the Hamptons Billionaire Michael Rubin welcomed some of sports' biggest names to his party Kylian Mbappe partied with the likes of Joe Burrow, Tom Brady and Beyonce DailyMail.com provides all the latest international sports news By Ben Nagle For Dailymail.Com Published: 17:03, 4 July 2023 | Updated: 17:21, 4 July 2023 e-mail 2 View comments Kylian Mbappe welcomed in the 4th of July alongside some of the biggest names in sports and showbiz at billionaire Michael Rubin's annual extravaganza in the Hamptons. The France striker partied with the likes of Tom Brady, Leonardo Di Caprio, Jennifer Lopez , Ben Affleck , Beyonce , Jay-Z, Kendall Jenner, Hailey and Justin Bieber at Rubin's $50million Bridgehampton pad. Mbappe, whose long-term future at Paris Saint-Germain remains clouded in mystery, was pictured w ith stunning model Grace Adele at the star-studded white party, which saw 350 people crammed on to one of the most expensive stretches of beach in the world. Among the other sports stars invited to the Hamptons were James Harden of the Philadelphia 76ers, Dallas Cowboys linebacker Micah Parsons and Cincinnati Bengals quarterback Joe Burrow. The athletes could be seen clinking glasses with Rubin and others, all dressed in white for the annual bash, which saw Usher on the mic and appearances from some of Hollywood's biggest stars. Kylian Mbappe pictured with model Grace Adele at Michael Rubin's party in the Hamptons Dallas Cowboys linebacker Micah Parsons (left) was among the other sports stars with Mbappe James Harden of the Philadelphia 76ers and Tom Brady are pictured with billionaire Rubin Leonardo Di Caprio was one of hundreds of household names to attend the Hamptons bash There were armies of valets and security guards on-hand to keep out party crashers. After several incidents at the last two events, Rubin brought in an entire medical staff this year to keep his well-heeled guests in safe hands. But the former 76ers owner joked on Instagram: 'We didn’t need the medical tent this year, no major injuries lol' The sports merchandise billionaire added: 'Might need a whole year for my liver to recover... incredible night with incredible people!' He is the CEO of Fanatics, the world's leading provider of licensed sports merchandise. Tom Brady, 45, attended the bash which included performances from Usher and Ne-Yo Harden, 33, rocked a fashionable suit and monochrome sunglasses for the party on Monday Model Grace Adele was among the 350 guests invited to the extravaganza in the Hamptons Rubin's annual exclusive Independence Day bash has become one of the Hamptons' most famous summer parties. The party included performances from Usher and Ne-Yo and guests were treated to the finest food and drinks. Starting at 5pm sharp on Dune Road, one of the Hamptons' most coveted addresses, the night kicked off with a parade of expensive sports cars and SUVS. The thrilling night finished with a spectacular firework show. Share or comment on this article: Kylian Mbappe parties with Tom Brady at Michael Rubin's star-studded white party in the Hamptons e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:03:53","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/17/72841915-0-image-a-33_1688486613385.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man Utd target’s manager ‘working against’ £60m transfer as midfielder ‘waits’ for Barcelona offer","link":"https://www.manchesterworld.uk/sport/football/manchester-united/man-utd-targets-manager-working-against-ps60m-transfer-as-midfielder-waits-for-barcelona-offer-4206964","keywords":["Manchester United","Football","Sport"],"creator":["Jamie Kemble"],"video_url":null,"description":"All the latest transfer news surrounding Manchester United as pre-season takes hold.","content":"All the latest transfer news surrounding Manchester United as pre-season takes hold. are hard at work on new signings as pre-season kicks off at Carrington. The first set of players have already returned for pre-season, with more to come next week after some extra holiday time due to holidays. In the meantime, Erik ten Hag will begin work with his players while also landing new signings amid news will be a Red Devils player next season. United have a number of areas to strengthen, and the summer will come and go rapidly. Advertisement Advertisement As United search for targets, we have rounded up all the latest transfer news surrounding . Inter Milan boss Simone Inzaghi is said to be fighting against . United are said to be targeting the goalkeeper this summer as they look to replace David De Gea, who has seen his contract expire over the course of the last few days. Onana has established himself as one of the best goalkeepers in Europe, and it’s reported Inter will demand around £60million for his signature amid reported interest from United, Chelsea and Saudi Arabia. Inter are said to be willing to sell to fund new signings, but Tuttosport say Inzaghi is fighting internally and is keen to keep the keeper at all costs this summer. Advertisement Advertisement There have been plenty of reports over recent days claiming United have agreed personal terms with Fiorentina star Sofyan Amrabat. United have not agreed anything with Fiorentina, with the Italian club making that clear, but reports suggest the Red Devils are getting somewhere with the player himself. Though, say otherwise, with claims Amrabat still wants to join amid previous interest. In fact, the report claims the Morocco World Cup star will wait for an offer from Barcelona ahead of joining United this summer.","pubDate":"2023-07-04 16:03:51","image_url":"https://www.manchesterworld.uk/jpim-static/image/2023/07/04/14/GettyImages-1258590710.jpg?width=1200&auto=webp","source_id":"manchesterworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes €1bn release clause'","link":"https://www.dailymail.co.uk/sport/football/article-12263443/Vinicius-Junior-signs-new-contract-Real-Madrid-2027-includes-1bn-release-clause.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The winger's new deal includes a release clause of €1billion (£856million), which is designed to prevent Saudi Arabian clubs from attempting to sign him, as reported by AS .","content":"Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes a release clause of €1bn to prevent Saudi Arabian clubs from trying to sign him' Vinicus Junior has reportedly signed a new Real Madrid contract until 2027 The winger's new contract includes a staggering release clause of €1billion Vinicius has established himself as a key figure for Real and was given No 7 shirt By Jeorge Bird For Mailonline Published: 16:49, 4 July 2023 | Updated: 17:33, 4 July 2023 e-mail 3 View comments Vinicius Junior has reportedly signed a new contract with Real Madrid that will run until 2027. The winger's new deal includes a release clause of €1billion (£856million), which is designed to prevent Saudi Arabian clubs from attempting to sign him, as reported by AS . It has been a lengthy process to get the Brazil international to sign a new deal, with talks having initially taken place in September last year. However, the 22-year-old will remain at Real, where he has established himself as a hugely important player. Since signing from Flamengo in 2018, Vinicius has played 225 times for Real and has scored 59 goals while he has provided 64 assists. Vinicius Junior has signed a new contract with Real that will reportedly run until 2027 The winger's new deal with Carlo Ancelotti's team has a release clause of €1billion Vinicius scored the winner against Liverpool in the Champions League final in 2022, and he has won the LaLiga title twice and the Copa del Rey once. On the international stage he has been capped by Brazil 23 times and has scored thee goals. After Karim Benzema's departure to Al-Ittihad it is likely that there will now be even more responsibility on Vinicius' shoulders at Real. Vinicius' status at the club was reflected by the fact that he was recently given the No 7 shirt following Eden Hazard's departure. Real Madrid have already signed Jude Bellingham from Borussia Dortmund in a high-profile deal, while forward Joselu has joined on loan from Espanyol. Vinicius Junior has been rewarded with the No 7 shirt after five seasons at Real Madrid Share or comment on this article: Vinicius Junior 'signs new contract with Real Madrid until 2027 which includes €1bn release clause' e-mail Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:01:07","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/16/72839765-0-image-a-3_1688484185473.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Chelsea agree deal to keep Ben Roberts under Mauricio Pochettino as head of goalkeeping department","link":"https://www.dailymail.co.uk/sport/football/article-12263431/Chelsea-agree-deal-Ben-Roberts-Mauricio-Pochettino-head-goalkeeping-department.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have agreed a deal to keep former manager Graham Potter's appointment, Ben Roberts, in an overseeing role in their goalkeeping department.","content":"Chelsea agree deal to keep Graham Potter appointment Ben Roberts in new role under Mauricio Pochettino as head of goalkeeping department Roberts arrived as part of Potter's backroom staff when he took over at Chelsea The goalkeeping coach has agreed to stay under Pochettino, but in a new role Pochettino has also brought in his own goalkeeper specialist this summer By Adrian Kajumba For Mailonline Published: 16:40 BST, 4 July 2023 | Updated: 17:00 BST, 4 July 2023 e-mail View comments Chelsea have agreed a deal to keep former manager Graham Potter 's appointment, Ben Roberts, in an overseeing role in their goalkeeping department. Mauricio Pochettino 's reign has officially begun and he has been joined at Chelsea by his own team of coaches, including his goalkeeper specialist Toni Jimenez. But Roberts will also remain and be part of the new era, though in a position with a far wider remit than the initial coaching job he took on when joining Chelsea from Brighton with Potter in September and one likely to see him spend less time on the training pitch. Mail Sport revealed in May that Chelsea had held talks with Roberts with a view to retaining him and his expertise at the club, where he is well-liked and respected. Those discussions have concluded successfully with the 48 year-old signing a long-term deal to stay on in a head of goalkeeping-type role. Ben Roberts (right) became Chelsea's goalkeeping coach under former boss Graham Potter Potter was dismissed as Chelsea head coach last season and remains out of work Mauricio Pochettino has brought goalkeeping expert Toni Jimenez (left) with him to Chelsea Roberts is set to have a hand in shaping the coaching of goalkeepers of all ages up to first-team, their development plus scouting and recruitment. And with Chelsea's owners buying French side Strasbourg last week and looking to add a Portuguese side to their stables, Roberts's responsibilities will not just be limited to Chelsea but expected to extend to covering all clubs in the group as it grows. That raises the prospect of Chelsea buying young hopefuls and being able to develop them at one of their partner clubs until they are deemed ready for a move to the Premier League. Having Roberts head things up should help better align the work done both within Chelsea and across their network with their goalkeepers while also improve pathways to first-team football for the club's stoppers due to having someone tasked with long-term planning. Roberts is one of the most highly rated coaches in England in his field having followed a 17-year professional playing career with a move into coaching and being responsible for the development of a string of top flight and professional goalkeepers. Bruno Saltor and Bjorn Hamberg also moved to Chelsea from Brighton and their coaching profiles remain on the club's website despite their lower profile since the latter's departure with their futures yet to be confirmed. Share or comment on this article: Chelsea agree deal to keep Ben Roberts under Mauricio Pochettino as head of goalkeeping department e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-04 16:00:56","image_url":"https://i.dailymail.co.uk/1s/2023/07/04/16/72840523-0-image-a-8_1688485058037.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cardiff City announce first summer transfer as ex-Chelsea striker Ike Ugbo signs on loan","link":"https://www.walesonline.co.uk/sport/football/transfer-news/cardiff-city-announce-first-summer-27251041","keywords":["Sport"],"creator":["newsdesk@walesonline.co.uk (Glen Williams)"],"video_url":null,"description":"The Bluebirds have announced their first signing of the summer","content":"Cardiff City have announced their first signing of the Erol Bulut era as Ike Ugbo joins on a season-long loan from French club Troyes. During his unveiling, Bulut made a point of stating that Cardiff's attacking output had to be improved this season and has sought to address that in this transfer window. Indeed, we believe this to be the first of a spate of transfers in the coming days and weeks, with business set to ratchet up exactly one month out from the beginning of the Championship campaign. READ MORE: Cardiff City hold talks with Aaron Ramsey over sensational homecoming And Bulut will hope that Ugbo, 24 and a product of Chelsea's academy, is just one piece of the jigsaw which will slot into place in order to make the Bluebirds a far more threatening prospect at the top end of the pitch. “I’m very happy to be here. I’ve been waiting to come back to the English leagues for a while now and I’m really pleased that it’s finally over the line,\" Ugbo said. “I spoke to the manager before coming here. He was telling me how I suit the club, what I can do to help the club and what the club can do to help me. I think our ambitions align together, so I think it was a perfect choice for me. “For the team, I think we should push for the highest and try and get promoted. I think we shouldn’t short-change ourselves. There is great variety in the team, so I think we can do really good stuff this year. I can’t wait to finally put on the shirt and score my first goal for the club.” The Bluebirds are understood to have held interest in former Blues man Ugbo from last January when they brought in Sory Kaba and Connor Wickham. Scottish giants Rangers have also kept tabs on the Canada international. Ugbo has had spells with Barnsley, MK Dons, Scunthorpe United, Roda JC and Cercle Brugge while on loan from Chelsea before joining Genk permanently in 2021. The forward's loan to second division Dutch side Roda JC in 2019/20 shot him into the wider public conscience across Europe as he netted 13 goals in 28 league appearances for the club. It earned him a move to Belgian top-flight club Cercle Brugge, where he once again impressed with 16 goals in 32 league outings, helping him secure a permanent move away from Chelsea to Genk. He signed for Troyes last season in Ligue 1 after a successful loan spell with them. \"For me, this is an excellent signing for the offensive part of the team,\" manager Bulut said. \"Iké has shown what he can do over the last three years. When he was in Belgium he scored a lot of goals, and he did some very good things with Troyes as well. \"In 1v1 situations, he is really good in the box. His heading and finishing is also good. These are things that we need, because we know that last season the team did not score enough goals. \"We have signed him early, so he will have a pre-season with us. I think having a pre-season will bring a lot of positive things for him.\"","pubDate":"2023-07-04 16:00:00","image_url":"https://i2-prod.walesonline.co.uk/incoming/article27255337.ece/ALTERNATES/s615/1_ike-ugbo1.jpg","source_id":"walesonline","category":["sports"],"country":["united kingdom"],"language":"english"}]}