{"newsArray":[{"title":"National-Foot/Arriérés de salaires : les clubs mis à l’index","link":"https://agpgabon.ga/national-foot-arrieres-de-salaires-les-clubs-mis-a-lindex/","keywords":["Actualité","Sports","football","Gabon","National Foot"],"creator":["Franck Fusher EDZANG"],"video_url":null,"description":"Libreville, 08 Mai 2023 (AGP) – La sortie du Premier ministre, Alain Claude Bilié-By-Nze, jeudi dernier, sur la situation des arriérés de salaires des joueurs du championnat national, bien que diversement appréciée, a néanmoins eu le mérite de mettre les présidents des clubs face à leurs responsabilités. La mutualisation des charges vit-elle ses dernières heures? C’est du moins ce qui semble se dégager après la sortie dernièrement du Premier ministre gabonais, Alain Claude Bilié-By-Nze, sur la question des arriérés de salaires des joueurs du National-Foot 1 et 2. «Ce sont les entreprises qui recrutent et paient les joueurs. L’État vient […] L’article National-Foot/Arriérés de salaires : les clubs mis à l’index est apparu en premier sur AGP - Agence Gabonaise de Presse.","content":"La mutualisation des charges vit-elle ses dernières heures? C’est du moins ce qui semble se dégager après la sortie dernièrement du Premier ministre gabonais, Alain Claude Bilié-By-Nze, sur la question des arriérés de salaires des joueurs du National-Foot 1 et 2. « », avait lâché Alain Claude Bilié-By-Nze. Lequel a encouragé les présidents des clubs à explorer les mécanismes de partenariats et sponsoring pour optimiser leur mode de fonctionnement. Une sortie de l’ancien ministre des Sports qui a bien évidemment suscité de nombreuses réactions, particulièrement dans les milieux du football gabonais. D’aucuns y voyant en cela une sorte de « » de l’Etat gabonais à assumer pleinement son engagement pris en début de saison. La mutualisation des charges, qui d’ailleurs n’en est pas une, vu la quasi absence de participation des clubs dans ce processus, implique l’Etat gabonais dans le paiement des salaires des joueurs, le déplacement, l’hébergement et la restauration des équipes. Une posture de l’Etat providence qui vit probablement ces dernières heures. La période transitoire tirant vers sa fin. De quoi faire naître de réelles incertitudes quant à l’avenir de ces championnats, dont la désargentée Ligue Nationale de Football (Linaf) aura désormais mission d’organiser sans la contribution de l’Etat. Pas sûre, sans verser dans un pessimisme ambiant, qu’elle parviendra à relever cet immense défi, parce que affaibli par des clubs assujettis aux seules aides de l’ Etat. Et dans l’incapacité de se réinventer, en dépit de nombreux millions perçus pendant plusieurs années. Certains n’ont même pas de siège, encore moins une page Facebook. Au point où l’on se demande comment ceux-ci ont fait pour être en phase avec le cahier de charges de la Linaf pour prendre part à la compétition. Le gouvernement gabonais avait adopté, le 10 août 2022, le décret fixant les modalités de constitution d’une Société à Objet Sportif. Sauf qu’à bientôt un an de l’aboutissement de ce texte, plusieurs clubs et associations traînent encore le pas pour s’y conformer. Allez comprendre pourquoi…","pubDate":"2023-05-08 16:44:06","image_url":null,"source_id":"agpgabon","category":["sports"],"country":["Gabon"],"language":"french"},{"title":"Médias-Fégafoot: Nick Jocelyn Fouba reçu par Pierre Alain Mounguengui","link":"https://agpgabon.ga/medias-fegafoot-nick-jocelyn-fouba-recu-par-pierre-alain-mounguengui/","keywords":["Actualité","Sports","Actualités gabonaises","AGP","Fégafoot","Football Fegafoot AGP média","Gabon","Nick Jocelyn Fouba","Pierre Alain Mounguengui"],"creator":["Franck Fusher EDZANG"],"video_url":null,"description":"Libreville, 08 mai 2023 (AGP) – L’Administrateur directeur général de l’Agence gabonaise de presse (AGP), Nick Jocelyn Fouba, a été, ce lundi matin, l’hôte du président de la Fédération gabonaise de football (Fégafoot), Pierre Alain Mounguengui. Entretien au cours duquel, les deux personnalités ont évoqué plusieurs axes de travail allant dans le sens du renforcement de la collaboration entre les deux entités. Après sa rencontre avec le président de la Ligue Nationale de football (Linaf), Brice Mbika Ndjambou, dernièrement, l’Administrateur directeur général de l’Agence gabonaise presse (AGP), Nick Jocelyn Fouba a poursuivi sa série de visites auprès des principaux acteurs […] L’article Médias-Fégafoot: Nick Jocelyn Fouba reçu par Pierre Alain Mounguengui est apparu en premier sur AGP - Agence Gabonaise de Presse.","content":"Après sa rencontre avec le président de la Ligue Nationale de football (Linaf), Brice Mbika Ndjambou, dernièrement, l’Administrateur directeur général de l’Agence gabonaise presse (AGP), Nick Jocelyn Fouba a poursuivi sa série de visites auprès des principaux acteurs du football local. D’où sa présence ce lundi dans les locaux de la première fédération sportive du pays, sise à Owendo. Là-bas et comme lors de ses précédentes sorties, l’ancien Directeur de l’information à Gabon Télévisions a esquissé le même rituel, en faisant, dans un premier temps, ses civilités à son interlocuteur avant de présenter à ce dernier les différents supports et produits de l’AGP, notamment l’hebdomadaire » Gabon Matin, le site www.agpgabon.ga, la page Facebook et « l’AGP Flash ». Nick Jocelyn Fouba a, en effet, assuré à Pierre Alain Mounguengui de la disponibilité du « grossiste » de l’information au Gabon à accompagner la Fégafoot dans sa communication vis-à-vis du grand public, tant sur le plan national qu’international. Cette rencontre, très enrichissante, a également eu pour objectif de renforcer la collaboration déjà existante entre les deux entités. Celle-ci intervient d’ailleurs à un moment assez particulier pour le football gabonais, d’autant que la selection nationale du Gabon, jouera un match décisif face à la République Démocratique du Congo (RDC), le 12 juin prochain, dans le cadre des éliminatoires de la Coupe d’Afrique des nations (CAN) 2023 en Côte d’Ivoire.","pubDate":"2023-05-08 13:18:52","image_url":null,"source_id":"agpgabon","category":["sports"],"country":["Gabon"],"language":"french"},{"title":"Micah Richards explains why he 'feels sorry' for Arsenal star Martin Odegaard","link":"https://www.mirror.co.uk/sport/football/news/richards-odegaard-arsenal-man-city-29923503","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"Arsenal captain Martin Odegaard has been one of the stars of the Premier League season, but it still might not be enough to deliver a league title for Mikel Arteta's team","content":"Former Manchester City star Micah Richards has sympathy for Martin Odegaard, who he believes would be well out in front in the race for the Premier League's Player of the Year award were it not for Erling Haaland . Haaland has hit the ground running in his first season in English football, setting a new Premier League record for goals in a single campaign. His efforts look set to help his City team defend their title, at the expense of the Arsenal squad captained by his Norway international team-mate Odegaard. The Gunners' skipper was on target again on Sunday, opening the scoring in a win at Newcastle which ensures Mikel Arteta's team will finish in the top two. It was Odegaard's 15th of the campaign, with seven assists on top of that, but his compatriot has been on another level. Alan Shearer loses cool with ex-ref Dermot Gallagher in angry argument over Arsenal call Martin Odegaard and Jorginho agree on \"something special\" Arsenal showed at Newcastle \"If it hadn't been for Erling Haaland, Arsenal's captain would be odds-on for Player of the Year,\" Richards wrote for The Mail . The ex-England defender said the Gunners pulled off a \"masterstroke\" to sign the midfielder from Real Madrid , and compared him to his former City colleague David Silva. \"He reminds me of David Silva in so many ways, with his quiet authority and leadership,\" the pundit added. \"You wouldn't know David was in a room sometimes, but on the pitch he made you follow him through his brilliance and that is what Odegaard is doing — 15 goals from midfield (and not one penalty) is just exceptional. \"Arsenal's business in getting Odegaard on loan, restoring his confidence and then buying him outright was a masterstroke. He's going to get even better.\" Does Martin Odegaard deserve the Player of the Year award? Have your say in the comments section Martin Odegaard scored his 15th goal of the season as Arsenal beat Newcastle ( Image: Getty Images) Odegaard's goal on Sunday saw him draw level with Gabriel Martinelli as the Gunners' top scorer. Only five players have more Premier League goals this season, but one of those five is Haaland with his 35 from 32 appearances. Haaland drew a rare blank on Saturday as City beat Leeds 2-1 at the Etihad Stadium to stay in control at the top. Manager Pep Guardiola was visibly frustrated when the frontman passed up the chance to take a penalty, with Ilkay Gundogan missing from the spot, but praised Haaland after the victory. \"Today Erling could have scored two or three goals,\" Guardiola told Match of the Day after his team came away with all three points. \"He played incredibly well, in his movement and everything... how he fought for us. \"I like to praise Erling when he does not score. If Gundo scores everyone is 'OK, hat-trick, well done'. But a taker is a taker. At 2-0, this is a business, not a situation where we cannot forget it.\"","pubDate":"2023-05-08 10:53:20","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923470.ece/ALTERNATES/s615/0_Kate-Abdo-delivers-brutal-Micah-Richards-dig-leaving-Jamie-Carragher-in-stitches.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Highlanders Back On Top Despite Goalless Draw At Sheasham","link":"https://zimetro.co.zw/highlanders-back-on-top-despite-goalless-draw-at-sheasham/","keywords":["Sports News","Highlanders"],"creator":["Kells Dziva"],"video_url":null,"description":"Highlanders are now top of the Castle Lager Premier Soccer League table despite being held to a goalless draw against Sheasham at Bata Stadium in Gweru on Sunday. The point took Highlanders to 15 points from seven matches. CAPS United, who have played 8 matches, also have 15 points but have an inferior goal difference … The post Highlanders Back On Top Despite Goalless Draw At Sheasham appeared first on ZiMetro News.","content":"Highlanders are now top of the Castle Lager Premier Soccer League table despite being held to a goalless draw against Sheasham at Bata Stadium in Gweru on Sunday. The point took Highlanders to 15 points from seven matches. CAPS United, who have played 8 matches, also have 15 points but have an inferior goal difference compared to Bosso. Highlanders coach Baltermar Brito was disappointed with the result and accused Sheasham players of time-wasting. He said: I’m not satisfied at all. We did play as planned. People come all the way to support the team but in the second half, they only watched the goalkeeper (Elton Sibanda) laying down. It’s not football. I feel pity for all these people who came to watch this game. Again, we saw people wasting time but nothing was added on. We take a point, but we wanted a win. In the other matches played on Sunday, Dynamos were also held to a 0-0 draw by Triangle United at the National Sports Stadium while Hwange lost 0-3 to Bulawayo Chiefs. Bulawayo Chiefs scored through Nkosilathi Ncube (30′), Ayanda Ncube (71′) and Nixon Gama (88′). The Matchday 8 results are as follows: Meanwhile, Black Rhinos take on Ngezi Platinum Stars at the National Sports Stadium on Wednesday at 3 PM. Source | Pindula News","pubDate":"2023-05-08 10:27:56","image_url":null,"source_id":"zimetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"How WSL title race is shaping up with Man Utd, Chelsea Man City and Arsenal chasing glory","link":"https://www.mirror.co.uk/sport/football/news/womens-super-league-title-race-29919431","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jack Lacey-Hatton)"],"video_url":null,"description":"There are London and Manchester derby fixtures still to be played that could be key in deciding the fate of the WSL title - Man Utd sit top but Chelsea's destiny is in their hands","content":null,"pubDate":"2023-05-08 10:24:29","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923717.ece/ALTERNATES/s615/0_RUSSO.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Football. D'un club endetté de D2 aux rêves de sommet de l'Europe : comment Jean-Michel Aulas aura transformé l'OL en 36 ans","link":"https://www.ledauphine.com/sport/2023/05/08/jean-michel-aulas-figure-incontournable-et-batisseur-de-l-ol-moderne","keywords":["Sport","Football","Sport national","OL (Olympique Lyonnais)","Ligue 1 (Football)","Fil Info","Lyon"],"creator":null,"video_url":null,"description":"Après 36 ans à la tête du club, Jean-Michel Aulas n'est plus le président de l'Olympique Lyonnais. D'un club de D2 à un géant du foot français respecté sur la scène européenne, il aura profondément transformé un club lyonnais qu'il a pleinement incarné pendant plus de trois décennies.","content":null,"pubDate":"2023-05-08 10:08:00","image_url":"https://cdn-s-www.ledauphine.com/images/F8CE0459-32E5-426C-BE85-8B5C6EBCAAB9/NW_listB/jean-michel-aulas-le-13-mai-2006-celebrant-le-cinquieme-titre-de-champion-de-france-d-affilee-remporte-par-l-ol-photo-sipa-ap-patrick-gardin-1683539173.jpg","source_id":"ledauphine","category":["sports"],"country":["france"],"language":"french"},{"title":"Chelsea boss Emma Hayes provides Sam Kerr injury update as tense WSL title race heats up","link":"https://www.mirror.co.uk/sport/football/news/chelsea-sam-kerr-injury-australia-29922793","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Megan Feringa)"],"video_url":null,"description":"Chelsea defeated Everton 7-0 in the Women's Super League on Sunday but saw taliswoman Sam Kerr forced off after 32 minutes with the Blues bidding for another title","content":null,"pubDate":"2023-05-08 10:02:30","image_url":"https://i2-prod.mirror.co.uk/incoming/article29922826.ece/ALTERNATES/s615/1_GettyImages-1488202572.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"2024 NFL Draft: Previewing the top 10 draft-eligible running backs in college football","link":"https://www.pff.com/news/draft-2024-nfl-draft-previewing-the-top-10-draft-eligible-running-backs-in-college-football/","keywords":null,"creator":["Max Chadwick"],"video_url":null,"description":"Max Chadwick previews the top 10 draft-eligible RBs in college football.","content":null,"pubDate":"2023-05-08 10:00:38","image_url":null,"source_id":"pff","category":["sports"],"country":["canada"],"language":"english"},{"title":"Liverpool told to change transfer plan as they already have \"England's best midfielder\"","link":"https://www.mirror.co.uk/sport/football/news/liverpool-transfer-window-midfield-klopp-29922876","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"Jurgen Klopp has been tipped to make a number of additions to his Liverpool midfield over the summer, with the Reds due to lose a number of senior squad members","content":null,"pubDate":"2023-05-08 09:57:27","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923339.ece/ALTERNATES/s615/0_Liverpool-FC-v-Everton-FC-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PM Hun Sen calls on president of FFC to continues his work","link":"https://www.khmertimeskh.com/501286647/pm-hun-sen-calls-on-president-of-ffc-to-continues-his-work/","keywords":["2023 SEA Games","Sports","expressed disappointment"],"creator":["Ratana"],"video_url":null,"description":"PM Hun Sen, sent a voice message on May 8, calling on General Sao Sokha, Deputy Commander of the Royal Cambodia Armed Forces and President of the Football Federation of Cambodia to continue The post PM Hun Sen calls on president of FFC to continues his work appeared first on Khmer Times.","content":"Prime Minister Hun Sen, sent a voice message on May 8, calling on General Sao Sokha, Deputy Commander of the Royal Cambodia Armed Forces and President of the Football Federation of Cambodia (FFC) to continue to lead the FFC. Hun Sen continued that after the football match between Cambodia and Myanmar had got bad results, Sokha resigned. But after this decision, many people expressed disappointment and regret for General Sao Sokha, who led the development of Cambodian football. He would like to express his regret for the decision of General Sao Sokha. He noted that since Sokha assumed the position of President of FFC, Cambodian football has progressed steadily, although the results have not been as good as desired. PM added that now Cambodian football has moved away from the point where we did not have before. Hun Sen appealed, “As Prime Minister, I would like to call on General Sao Sokha to continue as President of the Football Federation, and this is not a separate issue for me, but this is a common issue that I “Representatives of the Royal Government call on General Sao Sokha to continue this role with the desire of football players and people who support football.” Fresh News","pubDate":"2023-05-08 09:45:32","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"},{"title":"National-Foot/Arriérés de salaires : les clubs mis à l’index","link":"https://agpgabon.ga/national-foot-arrieres-de-salaires-les-clubs-mis-a-lindex/","keywords":["Actualité","Sports","football","Gabon","National Foot"],"creator":["Franck Fusher EDZANG"],"video_url":null,"description":"Libreville, 08 Mai 2023 (AGP) – La sortie du Premier ministre, Alain Claude Bilié-By-Nze, jeudi dernier, sur la situation des arriérés de salaires des joueurs du championnat national, bien que diversement appréciée, a néanmoins eu le mérite de mettre les présidents des clubs face à leurs responsabilités. La mutualisation des charges vit-elle ses dernières heures? C’est du moins ce qui semble se dégager après la sortie dernièrement du Premier ministre gabonais, Alain Claude Bilié-By-Nze, sur la question des arriérés de salaires des joueurs du National-Foot 1 et 2. «Ce sont les entreprises qui recrutent et paient les joueurs. L’État vient […] L’article National-Foot/Arriérés de salaires : les clubs mis à l’index est apparu en premier sur AGP - Agence Gabonaise de Presse.","content":"La mutualisation des charges vit-elle ses dernières heures? C’est du moins ce qui semble se dégager après la sortie dernièrement du Premier ministre gabonais, Alain Claude Bilié-By-Nze, sur la question des arriérés de salaires des joueurs du National-Foot 1 et 2. « », avait lâché Alain Claude Bilié-By-Nze. Lequel a encouragé les présidents des clubs à explorer les mécanismes de partenariats et sponsoring pour optimiser leur mode de fonctionnement. Une sortie de l’ancien ministre des Sports qui a bien évidemment suscité de nombreuses réactions, particulièrement dans les milieux du football gabonais. D’aucuns y voyant en cela une sorte de « » de l’Etat gabonais à assumer pleinement son engagement pris en début de saison. La mutualisation des charges, qui d’ailleurs n’en est pas une, vu la quasi absence de participation des clubs dans ce processus, implique l’Etat gabonais dans le paiement des salaires des joueurs, le déplacement, l’hébergement et la restauration des équipes. Une posture de l’Etat providence qui vit probablement ces dernières heures. La période transitoire tirant vers sa fin. De quoi faire naître de réelles incertitudes quant à l’avenir de ces championnats, dont la désargentée Ligue Nationale de Football (Linaf) aura désormais mission d’organiser sans la contribution de l’Etat. Pas sûre, sans verser dans un pessimisme ambiant, qu’elle parviendra à relever cet immense défi, parce que affaibli par des clubs assujettis aux seules aides de l’ Etat. Et dans l’incapacité de se réinventer, en dépit de nombreux millions perçus pendant plusieurs années. Certains n’ont même pas de siège, encore moins une page Facebook. Au point où l’on se demande comment ceux-ci ont fait pour être en phase avec le cahier de charges de la Linaf pour prendre part à la compétition. Le gouvernement gabonais avait adopté, le 10 août 2022, le décret fixant les modalités de constitution d’une Société à Objet Sportif. Sauf qu’à bientôt un an de l’aboutissement de ce texte, plusieurs clubs et associations traînent encore le pas pour s’y conformer. Allez comprendre pourquoi…","pubDate":"2023-05-08 16:44:06","image_url":null,"source_id":"agpgabon","category":["sports"],"country":["Gabon"],"language":"french"},{"title":"Médias-Fégafoot: Nick Jocelyn Fouba reçu par Pierre Alain Mounguengui","link":"https://agpgabon.ga/medias-fegafoot-nick-jocelyn-fouba-recu-par-pierre-alain-mounguengui/","keywords":["Actualité","Sports","Actualités gabonaises","AGP","Fégafoot","Football Fegafoot AGP média","Gabon","Nick Jocelyn Fouba","Pierre Alain Mounguengui"],"creator":["Franck Fusher EDZANG"],"video_url":null,"description":"Libreville, 08 mai 2023 (AGP) – L’Administrateur directeur général de l’Agence gabonaise de presse (AGP), Nick Jocelyn Fouba, a été, ce lundi matin, l’hôte du président de la Fédération gabonaise de football (Fégafoot), Pierre Alain Mounguengui. Entretien au cours duquel, les deux personnalités ont évoqué plusieurs axes de travail allant dans le sens du renforcement de la collaboration entre les deux entités. Après sa rencontre avec le président de la Ligue Nationale de football (Linaf), Brice Mbika Ndjambou, dernièrement, l’Administrateur directeur général de l’Agence gabonaise presse (AGP), Nick Jocelyn Fouba a poursuivi sa série de visites auprès des principaux acteurs […] L’article Médias-Fégafoot: Nick Jocelyn Fouba reçu par Pierre Alain Mounguengui est apparu en premier sur AGP - Agence Gabonaise de Presse.","content":"Après sa rencontre avec le président de la Ligue Nationale de football (Linaf), Brice Mbika Ndjambou, dernièrement, l’Administrateur directeur général de l’Agence gabonaise presse (AGP), Nick Jocelyn Fouba a poursuivi sa série de visites auprès des principaux acteurs du football local. D’où sa présence ce lundi dans les locaux de la première fédération sportive du pays, sise à Owendo. Là-bas et comme lors de ses précédentes sorties, l’ancien Directeur de l’information à Gabon Télévisions a esquissé le même rituel, en faisant, dans un premier temps, ses civilités à son interlocuteur avant de présenter à ce dernier les différents supports et produits de l’AGP, notamment l’hebdomadaire » Gabon Matin, le site www.agpgabon.ga, la page Facebook et « l’AGP Flash ». Nick Jocelyn Fouba a, en effet, assuré à Pierre Alain Mounguengui de la disponibilité du « grossiste » de l’information au Gabon à accompagner la Fégafoot dans sa communication vis-à-vis du grand public, tant sur le plan national qu’international. Cette rencontre, très enrichissante, a également eu pour objectif de renforcer la collaboration déjà existante entre les deux entités. Celle-ci intervient d’ailleurs à un moment assez particulier pour le football gabonais, d’autant que la selection nationale du Gabon, jouera un match décisif face à la République Démocratique du Congo (RDC), le 12 juin prochain, dans le cadre des éliminatoires de la Coupe d’Afrique des nations (CAN) 2023 en Côte d’Ivoire.","pubDate":"2023-05-08 13:18:52","image_url":null,"source_id":"agpgabon","category":["sports"],"country":["Gabon"],"language":"french"},{"title":"Micah Richards explains why he 'feels sorry' for Arsenal star Martin Odegaard","link":"https://www.mirror.co.uk/sport/football/news/richards-odegaard-arsenal-man-city-29923503","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"Arsenal captain Martin Odegaard has been one of the stars of the Premier League season, but it still might not be enough to deliver a league title for Mikel Arteta's team","content":"Former Manchester City star Micah Richards has sympathy for Martin Odegaard, who he believes would be well out in front in the race for the Premier League's Player of the Year award were it not for Erling Haaland . Haaland has hit the ground running in his first season in English football, setting a new Premier League record for goals in a single campaign. His efforts look set to help his City team defend their title, at the expense of the Arsenal squad captained by his Norway international team-mate Odegaard. The Gunners' skipper was on target again on Sunday, opening the scoring in a win at Newcastle which ensures Mikel Arteta's team will finish in the top two. It was Odegaard's 15th of the campaign, with seven assists on top of that, but his compatriot has been on another level. Alan Shearer loses cool with ex-ref Dermot Gallagher in angry argument over Arsenal call Martin Odegaard and Jorginho agree on \"something special\" Arsenal showed at Newcastle \"If it hadn't been for Erling Haaland, Arsenal's captain would be odds-on for Player of the Year,\" Richards wrote for The Mail . The ex-England defender said the Gunners pulled off a \"masterstroke\" to sign the midfielder from Real Madrid , and compared him to his former City colleague David Silva. \"He reminds me of David Silva in so many ways, with his quiet authority and leadership,\" the pundit added. \"You wouldn't know David was in a room sometimes, but on the pitch he made you follow him through his brilliance and that is what Odegaard is doing — 15 goals from midfield (and not one penalty) is just exceptional. \"Arsenal's business in getting Odegaard on loan, restoring his confidence and then buying him outright was a masterstroke. He's going to get even better.\" Does Martin Odegaard deserve the Player of the Year award? Have your say in the comments section Martin Odegaard scored his 15th goal of the season as Arsenal beat Newcastle ( Image: Getty Images) Odegaard's goal on Sunday saw him draw level with Gabriel Martinelli as the Gunners' top scorer. Only five players have more Premier League goals this season, but one of those five is Haaland with his 35 from 32 appearances. Haaland drew a rare blank on Saturday as City beat Leeds 2-1 at the Etihad Stadium to stay in control at the top. Manager Pep Guardiola was visibly frustrated when the frontman passed up the chance to take a penalty, with Ilkay Gundogan missing from the spot, but praised Haaland after the victory. \"Today Erling could have scored two or three goals,\" Guardiola told Match of the Day after his team came away with all three points. \"He played incredibly well, in his movement and everything... how he fought for us. \"I like to praise Erling when he does not score. If Gundo scores everyone is 'OK, hat-trick, well done'. But a taker is a taker. At 2-0, this is a business, not a situation where we cannot forget it.\"","pubDate":"2023-05-08 10:53:20","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923470.ece/ALTERNATES/s615/0_Kate-Abdo-delivers-brutal-Micah-Richards-dig-leaving-Jamie-Carragher-in-stitches.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Highlanders Back On Top Despite Goalless Draw At Sheasham","link":"https://zimetro.co.zw/highlanders-back-on-top-despite-goalless-draw-at-sheasham/","keywords":["Sports News","Highlanders"],"creator":["Kells Dziva"],"video_url":null,"description":"Highlanders are now top of the Castle Lager Premier Soccer League table despite being held to a goalless draw against Sheasham at Bata Stadium in Gweru on Sunday. The point took Highlanders to 15 points from seven matches. CAPS United, who have played 8 matches, also have 15 points but have an inferior goal difference … The post Highlanders Back On Top Despite Goalless Draw At Sheasham appeared first on ZiMetro News.","content":"Highlanders are now top of the Castle Lager Premier Soccer League table despite being held to a goalless draw against Sheasham at Bata Stadium in Gweru on Sunday. The point took Highlanders to 15 points from seven matches. CAPS United, who have played 8 matches, also have 15 points but have an inferior goal difference compared to Bosso. Highlanders coach Baltermar Brito was disappointed with the result and accused Sheasham players of time-wasting. He said: I’m not satisfied at all. We did play as planned. People come all the way to support the team but in the second half, they only watched the goalkeeper (Elton Sibanda) laying down. It’s not football. I feel pity for all these people who came to watch this game. Again, we saw people wasting time but nothing was added on. We take a point, but we wanted a win. In the other matches played on Sunday, Dynamos were also held to a 0-0 draw by Triangle United at the National Sports Stadium while Hwange lost 0-3 to Bulawayo Chiefs. Bulawayo Chiefs scored through Nkosilathi Ncube (30′), Ayanda Ncube (71′) and Nixon Gama (88′). The Matchday 8 results are as follows: Meanwhile, Black Rhinos take on Ngezi Platinum Stars at the National Sports Stadium on Wednesday at 3 PM. Source | Pindula News","pubDate":"2023-05-08 10:27:56","image_url":null,"source_id":"zimetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"How WSL title race is shaping up with Man Utd, Chelsea Man City and Arsenal chasing glory","link":"https://www.mirror.co.uk/sport/football/news/womens-super-league-title-race-29919431","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jack Lacey-Hatton)"],"video_url":null,"description":"There are London and Manchester derby fixtures still to be played that could be key in deciding the fate of the WSL title - Man Utd sit top but Chelsea's destiny is in their hands","content":null,"pubDate":"2023-05-08 10:24:29","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923717.ece/ALTERNATES/s615/0_RUSSO.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Football. D'un club endetté de D2 aux rêves de sommet de l'Europe : comment Jean-Michel Aulas aura transformé l'OL en 36 ans","link":"https://www.ledauphine.com/sport/2023/05/08/jean-michel-aulas-figure-incontournable-et-batisseur-de-l-ol-moderne","keywords":["Sport","Football","Sport national","OL (Olympique Lyonnais)","Ligue 1 (Football)","Fil Info","Lyon"],"creator":null,"video_url":null,"description":"Après 36 ans à la tête du club, Jean-Michel Aulas n'est plus le président de l'Olympique Lyonnais. D'un club de D2 à un géant du foot français respecté sur la scène européenne, il aura profondément transformé un club lyonnais qu'il a pleinement incarné pendant plus de trois décennies.","content":null,"pubDate":"2023-05-08 10:08:00","image_url":"https://cdn-s-www.ledauphine.com/images/F8CE0459-32E5-426C-BE85-8B5C6EBCAAB9/NW_listB/jean-michel-aulas-le-13-mai-2006-celebrant-le-cinquieme-titre-de-champion-de-france-d-affilee-remporte-par-l-ol-photo-sipa-ap-patrick-gardin-1683539173.jpg","source_id":"ledauphine","category":["sports"],"country":["france"],"language":"french"},{"title":"Chelsea boss Emma Hayes provides Sam Kerr injury update as tense WSL title race heats up","link":"https://www.mirror.co.uk/sport/football/news/chelsea-sam-kerr-injury-australia-29922793","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Megan Feringa)"],"video_url":null,"description":"Chelsea defeated Everton 7-0 in the Women's Super League on Sunday but saw taliswoman Sam Kerr forced off after 32 minutes with the Blues bidding for another title","content":null,"pubDate":"2023-05-08 10:02:30","image_url":"https://i2-prod.mirror.co.uk/incoming/article29922826.ece/ALTERNATES/s615/1_GettyImages-1488202572.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"2024 NFL Draft: Previewing the top 10 draft-eligible running backs in college football","link":"https://www.pff.com/news/draft-2024-nfl-draft-previewing-the-top-10-draft-eligible-running-backs-in-college-football/","keywords":null,"creator":["Max Chadwick"],"video_url":null,"description":"Max Chadwick previews the top 10 draft-eligible RBs in college football.","content":null,"pubDate":"2023-05-08 10:00:38","image_url":null,"source_id":"pff","category":["sports"],"country":["canada"],"language":"english"},{"title":"Liverpool told to change transfer plan as they already have \"England's best midfielder\"","link":"https://www.mirror.co.uk/sport/football/news/liverpool-transfer-window-midfield-klopp-29922876","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"Jurgen Klopp has been tipped to make a number of additions to his Liverpool midfield over the summer, with the Reds due to lose a number of senior squad members","content":null,"pubDate":"2023-05-08 09:57:27","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923339.ece/ALTERNATES/s615/0_Liverpool-FC-v-Everton-FC-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PM Hun Sen calls on president of FFC to continues his work","link":"https://www.khmertimeskh.com/501286647/pm-hun-sen-calls-on-president-of-ffc-to-continues-his-work/","keywords":["2023 SEA Games","Sports","expressed disappointment"],"creator":["Ratana"],"video_url":null,"description":"PM Hun Sen, sent a voice message on May 8, calling on General Sao Sokha, Deputy Commander of the Royal Cambodia Armed Forces and President of the Football Federation of Cambodia to continue The post PM Hun Sen calls on president of FFC to continues his work appeared first on Khmer Times.","content":"Prime Minister Hun Sen, sent a voice message on May 8, calling on General Sao Sokha, Deputy Commander of the Royal Cambodia Armed Forces and President of the Football Federation of Cambodia (FFC) to continue to lead the FFC. Hun Sen continued that after the football match between Cambodia and Myanmar had got bad results, Sokha resigned. But after this decision, many people expressed disappointment and regret for General Sao Sokha, who led the development of Cambodian football. He would like to express his regret for the decision of General Sao Sokha. He noted that since Sokha assumed the position of President of FFC, Cambodian football has progressed steadily, although the results have not been as good as desired. PM added that now Cambodian football has moved away from the point where we did not have before. Hun Sen appealed, “As Prime Minister, I would like to call on General Sao Sokha to continue as President of the Football Federation, and this is not a separate issue for me, but this is a common issue that I “Representatives of the Royal Government call on General Sao Sokha to continue this role with the desire of football players and people who support football.” Fresh News","pubDate":"2023-05-08 09:45:32","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"},{"title":"National-Foot/Arriérés de salaires : les clubs mis à l’index","link":"https://agpgabon.ga/national-foot-arrieres-de-salaires-les-clubs-mis-a-lindex/","keywords":["Actualité","Sports","football","Gabon","National Foot"],"creator":["Franck Fusher EDZANG"],"video_url":null,"description":"Libreville, 08 Mai 2023 (AGP) – La sortie du Premier ministre, Alain Claude Bilié-By-Nze, jeudi dernier, sur la situation des arriérés de salaires des joueurs du championnat national, bien que diversement appréciée, a néanmoins eu le mérite de mettre les présidents des clubs face à leurs responsabilités. La mutualisation des charges vit-elle ses dernières heures? C’est du moins ce qui semble se dégager après la sortie dernièrement du Premier ministre gabonais, Alain Claude Bilié-By-Nze, sur la question des arriérés de salaires des joueurs du National-Foot 1 et 2. «Ce sont les entreprises qui recrutent et paient les joueurs. L’État vient […] L’article National-Foot/Arriérés de salaires : les clubs mis à l’index est apparu en premier sur AGP - Agence Gabonaise de Presse.","content":"La mutualisation des charges vit-elle ses dernières heures? C’est du moins ce qui semble se dégager après la sortie dernièrement du Premier ministre gabonais, Alain Claude Bilié-By-Nze, sur la question des arriérés de salaires des joueurs du National-Foot 1 et 2. « », avait lâché Alain Claude Bilié-By-Nze. Lequel a encouragé les présidents des clubs à explorer les mécanismes de partenariats et sponsoring pour optimiser leur mode de fonctionnement. Une sortie de l’ancien ministre des Sports qui a bien évidemment suscité de nombreuses réactions, particulièrement dans les milieux du football gabonais. D’aucuns y voyant en cela une sorte de « » de l’Etat gabonais à assumer pleinement son engagement pris en début de saison. La mutualisation des charges, qui d’ailleurs n’en est pas une, vu la quasi absence de participation des clubs dans ce processus, implique l’Etat gabonais dans le paiement des salaires des joueurs, le déplacement, l’hébergement et la restauration des équipes. Une posture de l’Etat providence qui vit probablement ces dernières heures. La période transitoire tirant vers sa fin. De quoi faire naître de réelles incertitudes quant à l’avenir de ces championnats, dont la désargentée Ligue Nationale de Football (Linaf) aura désormais mission d’organiser sans la contribution de l’Etat. Pas sûre, sans verser dans un pessimisme ambiant, qu’elle parviendra à relever cet immense défi, parce que affaibli par des clubs assujettis aux seules aides de l’ Etat. Et dans l’incapacité de se réinventer, en dépit de nombreux millions perçus pendant plusieurs années. Certains n’ont même pas de siège, encore moins une page Facebook. Au point où l’on se demande comment ceux-ci ont fait pour être en phase avec le cahier de charges de la Linaf pour prendre part à la compétition. Le gouvernement gabonais avait adopté, le 10 août 2022, le décret fixant les modalités de constitution d’une Société à Objet Sportif. Sauf qu’à bientôt un an de l’aboutissement de ce texte, plusieurs clubs et associations traînent encore le pas pour s’y conformer. Allez comprendre pourquoi…","pubDate":"2023-05-08 16:44:06","image_url":null,"source_id":"agpgabon","category":["sports"],"country":["Gabon"],"language":"french"},{"title":"Médias-Fégafoot: Nick Jocelyn Fouba reçu par Pierre Alain Mounguengui","link":"https://agpgabon.ga/medias-fegafoot-nick-jocelyn-fouba-recu-par-pierre-alain-mounguengui/","keywords":["Actualité","Sports","Actualités gabonaises","AGP","Fégafoot","Football Fegafoot AGP média","Gabon","Nick Jocelyn Fouba","Pierre Alain Mounguengui"],"creator":["Franck Fusher EDZANG"],"video_url":null,"description":"Libreville, 08 mai 2023 (AGP) – L’Administrateur directeur général de l’Agence gabonaise de presse (AGP), Nick Jocelyn Fouba, a été, ce lundi matin, l’hôte du président de la Fédération gabonaise de football (Fégafoot), Pierre Alain Mounguengui. Entretien au cours duquel, les deux personnalités ont évoqué plusieurs axes de travail allant dans le sens du renforcement de la collaboration entre les deux entités. Après sa rencontre avec le président de la Ligue Nationale de football (Linaf), Brice Mbika Ndjambou, dernièrement, l’Administrateur directeur général de l’Agence gabonaise presse (AGP), Nick Jocelyn Fouba a poursuivi sa série de visites auprès des principaux acteurs […] L’article Médias-Fégafoot: Nick Jocelyn Fouba reçu par Pierre Alain Mounguengui est apparu en premier sur AGP - Agence Gabonaise de Presse.","content":"Après sa rencontre avec le président de la Ligue Nationale de football (Linaf), Brice Mbika Ndjambou, dernièrement, l’Administrateur directeur général de l’Agence gabonaise presse (AGP), Nick Jocelyn Fouba a poursuivi sa série de visites auprès des principaux acteurs du football local. D’où sa présence ce lundi dans les locaux de la première fédération sportive du pays, sise à Owendo. Là-bas et comme lors de ses précédentes sorties, l’ancien Directeur de l’information à Gabon Télévisions a esquissé le même rituel, en faisant, dans un premier temps, ses civilités à son interlocuteur avant de présenter à ce dernier les différents supports et produits de l’AGP, notamment l’hebdomadaire » Gabon Matin, le site www.agpgabon.ga, la page Facebook et « l’AGP Flash ». Nick Jocelyn Fouba a, en effet, assuré à Pierre Alain Mounguengui de la disponibilité du « grossiste » de l’information au Gabon à accompagner la Fégafoot dans sa communication vis-à-vis du grand public, tant sur le plan national qu’international. Cette rencontre, très enrichissante, a également eu pour objectif de renforcer la collaboration déjà existante entre les deux entités. Celle-ci intervient d’ailleurs à un moment assez particulier pour le football gabonais, d’autant que la selection nationale du Gabon, jouera un match décisif face à la République Démocratique du Congo (RDC), le 12 juin prochain, dans le cadre des éliminatoires de la Coupe d’Afrique des nations (CAN) 2023 en Côte d’Ivoire.","pubDate":"2023-05-08 13:18:52","image_url":null,"source_id":"agpgabon","category":["sports"],"country":["Gabon"],"language":"french"},{"title":"Micah Richards explains why he 'feels sorry' for Arsenal star Martin Odegaard","link":"https://www.mirror.co.uk/sport/football/news/richards-odegaard-arsenal-man-city-29923503","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"Arsenal captain Martin Odegaard has been one of the stars of the Premier League season, but it still might not be enough to deliver a league title for Mikel Arteta's team","content":"Former Manchester City star Micah Richards has sympathy for Martin Odegaard, who he believes would be well out in front in the race for the Premier League's Player of the Year award were it not for Erling Haaland . Haaland has hit the ground running in his first season in English football, setting a new Premier League record for goals in a single campaign. His efforts look set to help his City team defend their title, at the expense of the Arsenal squad captained by his Norway international team-mate Odegaard. The Gunners' skipper was on target again on Sunday, opening the scoring in a win at Newcastle which ensures Mikel Arteta's team will finish in the top two. It was Odegaard's 15th of the campaign, with seven assists on top of that, but his compatriot has been on another level. Alan Shearer loses cool with ex-ref Dermot Gallagher in angry argument over Arsenal call Martin Odegaard and Jorginho agree on \"something special\" Arsenal showed at Newcastle \"If it hadn't been for Erling Haaland, Arsenal's captain would be odds-on for Player of the Year,\" Richards wrote for The Mail . The ex-England defender said the Gunners pulled off a \"masterstroke\" to sign the midfielder from Real Madrid , and compared him to his former City colleague David Silva. \"He reminds me of David Silva in so many ways, with his quiet authority and leadership,\" the pundit added. \"You wouldn't know David was in a room sometimes, but on the pitch he made you follow him through his brilliance and that is what Odegaard is doing — 15 goals from midfield (and not one penalty) is just exceptional. \"Arsenal's business in getting Odegaard on loan, restoring his confidence and then buying him outright was a masterstroke. He's going to get even better.\" Does Martin Odegaard deserve the Player of the Year award? Have your say in the comments section Martin Odegaard scored his 15th goal of the season as Arsenal beat Newcastle ( Image: Getty Images) Odegaard's goal on Sunday saw him draw level with Gabriel Martinelli as the Gunners' top scorer. Only five players have more Premier League goals this season, but one of those five is Haaland with his 35 from 32 appearances. Haaland drew a rare blank on Saturday as City beat Leeds 2-1 at the Etihad Stadium to stay in control at the top. Manager Pep Guardiola was visibly frustrated when the frontman passed up the chance to take a penalty, with Ilkay Gundogan missing from the spot, but praised Haaland after the victory. \"Today Erling could have scored two or three goals,\" Guardiola told Match of the Day after his team came away with all three points. \"He played incredibly well, in his movement and everything... how he fought for us. \"I like to praise Erling when he does not score. If Gundo scores everyone is 'OK, hat-trick, well done'. But a taker is a taker. At 2-0, this is a business, not a situation where we cannot forget it.\"","pubDate":"2023-05-08 10:53:20","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923470.ece/ALTERNATES/s615/0_Kate-Abdo-delivers-brutal-Micah-Richards-dig-leaving-Jamie-Carragher-in-stitches.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Highlanders Back On Top Despite Goalless Draw At Sheasham","link":"https://zimetro.co.zw/highlanders-back-on-top-despite-goalless-draw-at-sheasham/","keywords":["Sports News","Highlanders"],"creator":["Kells Dziva"],"video_url":null,"description":"Highlanders are now top of the Castle Lager Premier Soccer League table despite being held to a goalless draw against Sheasham at Bata Stadium in Gweru on Sunday. The point took Highlanders to 15 points from seven matches. CAPS United, who have played 8 matches, also have 15 points but have an inferior goal difference … The post Highlanders Back On Top Despite Goalless Draw At Sheasham appeared first on ZiMetro News.","content":"Highlanders are now top of the Castle Lager Premier Soccer League table despite being held to a goalless draw against Sheasham at Bata Stadium in Gweru on Sunday. The point took Highlanders to 15 points from seven matches. CAPS United, who have played 8 matches, also have 15 points but have an inferior goal difference compared to Bosso. Highlanders coach Baltermar Brito was disappointed with the result and accused Sheasham players of time-wasting. He said: I’m not satisfied at all. We did play as planned. People come all the way to support the team but in the second half, they only watched the goalkeeper (Elton Sibanda) laying down. It’s not football. I feel pity for all these people who came to watch this game. Again, we saw people wasting time but nothing was added on. We take a point, but we wanted a win. In the other matches played on Sunday, Dynamos were also held to a 0-0 draw by Triangle United at the National Sports Stadium while Hwange lost 0-3 to Bulawayo Chiefs. Bulawayo Chiefs scored through Nkosilathi Ncube (30′), Ayanda Ncube (71′) and Nixon Gama (88′). The Matchday 8 results are as follows: Meanwhile, Black Rhinos take on Ngezi Platinum Stars at the National Sports Stadium on Wednesday at 3 PM. Source | Pindula News","pubDate":"2023-05-08 10:27:56","image_url":null,"source_id":"zimetro","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"How WSL title race is shaping up with Man Utd, Chelsea Man City and Arsenal chasing glory","link":"https://www.mirror.co.uk/sport/football/news/womens-super-league-title-race-29919431","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jack Lacey-Hatton)"],"video_url":null,"description":"There are London and Manchester derby fixtures still to be played that could be key in deciding the fate of the WSL title - Man Utd sit top but Chelsea's destiny is in their hands","content":null,"pubDate":"2023-05-08 10:24:29","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923717.ece/ALTERNATES/s615/0_RUSSO.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Football. D'un club endetté de D2 aux rêves de sommet de l'Europe : comment Jean-Michel Aulas aura transformé l'OL en 36 ans","link":"https://www.ledauphine.com/sport/2023/05/08/jean-michel-aulas-figure-incontournable-et-batisseur-de-l-ol-moderne","keywords":["Sport","Football","Sport national","OL (Olympique Lyonnais)","Ligue 1 (Football)","Fil Info","Lyon"],"creator":null,"video_url":null,"description":"Après 36 ans à la tête du club, Jean-Michel Aulas n'est plus le président de l'Olympique Lyonnais. D'un club de D2 à un géant du foot français respecté sur la scène européenne, il aura profondément transformé un club lyonnais qu'il a pleinement incarné pendant plus de trois décennies.","content":null,"pubDate":"2023-05-08 10:08:00","image_url":"https://cdn-s-www.ledauphine.com/images/F8CE0459-32E5-426C-BE85-8B5C6EBCAAB9/NW_listB/jean-michel-aulas-le-13-mai-2006-celebrant-le-cinquieme-titre-de-champion-de-france-d-affilee-remporte-par-l-ol-photo-sipa-ap-patrick-gardin-1683539173.jpg","source_id":"ledauphine","category":["sports"],"country":["france"],"language":"french"},{"title":"Chelsea boss Emma Hayes provides Sam Kerr injury update as tense WSL title race heats up","link":"https://www.mirror.co.uk/sport/football/news/chelsea-sam-kerr-injury-australia-29922793","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Megan Feringa)"],"video_url":null,"description":"Chelsea defeated Everton 7-0 in the Women's Super League on Sunday but saw taliswoman Sam Kerr forced off after 32 minutes with the Blues bidding for another title","content":null,"pubDate":"2023-05-08 10:02:30","image_url":"https://i2-prod.mirror.co.uk/incoming/article29922826.ece/ALTERNATES/s615/1_GettyImages-1488202572.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"2024 NFL Draft: Previewing the top 10 draft-eligible running backs in college football","link":"https://www.pff.com/news/draft-2024-nfl-draft-previewing-the-top-10-draft-eligible-running-backs-in-college-football/","keywords":null,"creator":["Max Chadwick"],"video_url":null,"description":"Max Chadwick previews the top 10 draft-eligible RBs in college football.","content":null,"pubDate":"2023-05-08 10:00:38","image_url":null,"source_id":"pff","category":["sports"],"country":["canada"],"language":"english"},{"title":"Liverpool told to change transfer plan as they already have \"England's best midfielder\"","link":"https://www.mirror.co.uk/sport/football/news/liverpool-transfer-window-midfield-klopp-29922876","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Victor)"],"video_url":null,"description":"Jurgen Klopp has been tipped to make a number of additions to his Liverpool midfield over the summer, with the Reds due to lose a number of senior squad members","content":null,"pubDate":"2023-05-08 09:57:27","image_url":"https://i2-prod.mirror.co.uk/incoming/article29923339.ece/ALTERNATES/s615/0_Liverpool-FC-v-Everton-FC-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"PM Hun Sen calls on president of FFC to continues his work","link":"https://www.khmertimeskh.com/501286647/pm-hun-sen-calls-on-president-of-ffc-to-continues-his-work/","keywords":["2023 SEA Games","Sports","expressed disappointment"],"creator":["Ratana"],"video_url":null,"description":"PM Hun Sen, sent a voice message on May 8, calling on General Sao Sokha, Deputy Commander of the Royal Cambodia Armed Forces and President of the Football Federation of Cambodia to continue The post PM Hun Sen calls on president of FFC to continues his work appeared first on Khmer Times.","content":"Prime Minister Hun Sen, sent a voice message on May 8, calling on General Sao Sokha, Deputy Commander of the Royal Cambodia Armed Forces and President of the Football Federation of Cambodia (FFC) to continue to lead the FFC. Hun Sen continued that after the football match between Cambodia and Myanmar had got bad results, Sokha resigned. But after this decision, many people expressed disappointment and regret for General Sao Sokha, who led the development of Cambodian football. He would like to express his regret for the decision of General Sao Sokha. He noted that since Sokha assumed the position of President of FFC, Cambodian football has progressed steadily, although the results have not been as good as desired. PM added that now Cambodian football has moved away from the point where we did not have before. Hun Sen appealed, “As Prime Minister, I would like to call on General Sao Sokha to continue as President of the Football Federation, and this is not a separate issue for me, but this is a common issue that I “Representatives of the Royal Government call on General Sao Sokha to continue this role with the desire of football players and people who support football.” Fresh News","pubDate":"2023-05-08 09:45:32","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"}]}