{"newsArray":[{"title":"Thierry Henry, un début de carrière d'entraîneur mitigé","link":"https://www.lequipe.fr/Football/Actualites/Thierry-henry-un-debut-de-carriere-d-entraineur-mitige/1414971#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Lucas Delhomme"],"video_url":null,"description":"Nommé ce lundi sélectionneur des Bleuets, Thierry Henry a connu des premières expériences mitigées dans le coaching, que ce soit avec la Belgique, Monaco ou Montréal.","content":"Adjoint de la Belgique pour faire ses armes À peine sa carrière terminée, en 2014, Thierry Henry a commencé à entraîner. Avec les moins de 16 ans d'Arsenal d'abord. Puis dans l'encadrement du sélectionneur de la Belgique, Roberto Martinez, entre 2016 et 2018, au poste de second, puis premier adjoint. Henry quitte les Diables rouges après la 3e place acquise lors de la Coupe du monde en Russie. Il revient pour l'Euro 2021, puis la Coupe du monde 2022. Après une élimination au premier tour au Qatar, Martinez n'est pas reconduit. . Monaco, une expérience écourtée De retour dans son club formateur en octobre 2018, cette fois-ci en tant qu'entraîneur principal, Thierry Henry a connu une première expérience compliquée. , champion de France un an avant, le défi s'annonçait ardu. Après 4 mois et seulement 20 petits matches toutes compétitions confondues (5 victoires, 4 nuls, 11 défaites), et remplacé par... Jardim. Le Portugais reprend l'ASM, alors 19e de L1. Un sentiment d'inachevé à Montréal Loin de l'Europe, Henry part entraîner dans une Ligue qu'il connaît bien : la MLS. À Montréal, l'ancien joueur d'Arsenal veut faire oublier la désillusion de Monaco. Malgré des résultats mitigés (31 % de victoires), Henry décroche les barrages des play-offs (une première pour le club depuis 2016) et un quart de finale de la Ligue des champions Concacaf. , , pour des raisons familiales, après seulement 29 matches sur le banc de l'Impact et avec un goût amer d'inachevé.","pubDate":"2023-08-21 18:18:30","image_url":"https://medias.lequipe.fr/img-photo-jpg/thierry-henry-lors-d-un-entrainement-avec-monaco-en-octobre-2018-a-reau-l-equipe/1500000001823809/0:0,1998:999-665-335-70/31eef.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"England legend Sir Geoff Hurst ‘bitterly disappointed’ for Lionesses","link":"https://metro.co.uk/2023/08/21/england-legend-sir-geoff-hurst-bitterly-disappointed-for-lionesses-19372551/","keywords":["Football","Sport","England Women's football team","National Lottery","Women's World Cup 2023"],"creator":["Kirsten Robertson"],"video_url":null,"description":"‘It’s not easy to win a World Cup, we won ours 57 years ago and England is still waiting for another.’","content":"Sir Geoff Hurst says the Lionesses ‘will get over’ the hurt of their World Cup loss sooner than they think. The 81-year-old – whose hat-trick heroics propelled the Three Lions to glory in 1966 – sent a message of support to Sarina Wiegman’s squad. It comes after the England legend hit out at Prince William for not making the journey Down Under to support the team. Sir Geoff told Metro : ‘I’ve been there and know how disappointing it feels. ‘On a personal level they will get over the loss. They are professionals and have bad times in sport – as we all do. You win stuff, you lose stuff. ‘They will be bitterly disappointed – we’re bitterly disappointed as supporters as well – but what the Lionesses have achieved is just amazing. ‘It’s not easy to win a World Cup, we won ours 57 years ago and England is still waiting for another.’ Sir Geoff watched the tournament unfold from his home in Cheltenham with his wife Judith, and excitedly texted with his granddaughter Amy during games. He added: ‘In the past, I’ve met female journalists who were once barred from playing football. It’s hard to imagine now with what we’ve seen in the last few years. ‘They don’t have the trophy, but the Lionesses are still winners to me. ‘The legacy they’ve left from the Euros and now the World Cup is making a huge difference. ‘It will also change their lives. They’ll be 80 in a supermarket and someone will come up and go “oh you’re Millie Bright, you were captain in the 2023 World Cup.” ‘People don’t forget.’ Sir Geoff spoke with Metro from a girls training session at Youngs FC , a club which has bolstered its ranks with an under-17s team thanks to National Lottery funding. The Wembley hero met with players and coaches to find out more about the impact of dedicated support at the grassroots level. Sir Geoff added: ‘The National Lottery has invested £50 million into the sport over the last decade. ‘They were magnificent’ World Cup winner Geoff Hurst told #BBCBreakfast the Lionesses should return with pride from their Australian adventure after finishing as World Cup runners up https://t.co/k5AXqv3JF3 pic.twitter.com/Lukc4QUJ4h ‘It takes funds and time to run a football club. Youngs FC have an under 17s team now, and that’s coming in thanks to new money. ‘It’s been really interesting talking with the coaches here and hearing what they are doing differently. ‘In the past, an issue in football at a grassroots level has been parents standing on the line shouting and screaming. ‘Here, they have a parent committee to officially deal with any issues. It’s a major step forward to make sure people can simply enjoy football and have fun. ‘There are 200 new clubs since the Euros, who knows how many will come after this tournament.’ Nike issue fresh statement on Mary Earps shirt controversy after World Cup heroics Jennifer Hermoso releases new statement on 'mutual' kiss with Spanish FA president Women’s World Cup star announces pregnancy day after tournament comes to end Sir Geoff added: ‘And as a team, the Lionesses have plenty more chance at success. ‘It’s a young and exciting squad, they’ve done us proud and will continue to do so.’ Sir Geoff spoke to Metro alongside the National Lottery. To continue creating more opportunities for women and girls all over the UK to play football, The National Lottery has committed an additional £15 million into the FA over the next four years (2023-2027.) Find out how your numbers make amazing happen at: www.lotterygoodcauses.org.uk Get in touch with our news team by emailing us at webnews@metro.co.uk . For more stories like this, check our news page .","pubDate":"2023-08-21 18:13:42","image_url":null,"source_id":"metro","source_priority":1797,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Panthers confident No. 1 pick Bryce Young is getting enough preseason reps, will be ready for Week 1","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/21/panthers-confident-no-1-pick-bryce-young-is-getting-enough-preseason-reps-will-be-ready-for-week-1","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. The No. […]","content":"CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. Read this article for free: Already have an account? To continue reading, please subscribe: * CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. The No. 1 overall pick in the NFL draft has only attempted 12 passes through two exhibition games with very limited success, completing seven for 56 yards with no touchdowns. Young has led five drives with three of them resulting in three-and-outs. The Panthers have scored just three points with the 2021 Heisman Trophy winner under center. “Yes, I feel he will be ready,” Reich said Monday. “He’s very accomplished mentally and maturity-wise.” Reich said he’s relying on Young’s extensive workload in practice to help him prepare for the team’s Sept. 10 regular-season opener against the Atlanta Falcons, which Young will start. “He’s gotten a lot of work and reps,” Reich said. “That’s why we made the decision back in the spring to announce him as the starter and put our team in a position to say ‘hey, this is who we are going to be moving forward.’ We are practicing at a high level that I think is preparing us for the season.” Young also said he feels he’ll be ready for the regular season, although he still has things he wants to improve on over the next couple of weeks including his timing and footwork. “The competitor in myself, and I think all of us, you want to keep playing,” Young said of the preseason. “But there is a reason for everything and we all trust in the coaches.” The Panthers aren’t alone in limiting the reps of their rookie quarterback. Reich’s former team, the Indianapolis Colts, didn’t even play Anthony Richardson in this past weekend’s preseason game against the Chicago Bears just four days after selecting him as the Week 1 starter. Reich said the Panthers only played Young two series on Friday night in part because they were facing a New York Giants defense that has a reputation for being a blitz-heavy team. Carolina’s offensive line has largely struggled to protect Young in the preseason, so Reich didn’t want to chance an injury. “When you go up against that scheme that we faced last week it can be a blitz fest,” Reich said. “And you’re like, ‘how much of it is worth it?’” Reich said. “It was great to prepare for it, and go through the mental exercise of getting ready for all of these blitzes, but then it’s risk-reward on how much you play.” Reich reiterated that Young will play in the final preseason game Friday night against the Detroit Lions, although he wouldn’t say how much. “We’d like to get a little rhythm going and accomplish certain things, so we will play it by ear,” Reich said. It’s been somewhat difficult to evaluate Young’s performance through two games because of Carolina’s struggles to protect him. The rookie was hit three times on seven drop-back passes in the team’s first preseason game against the New York Jets. Young said he’s confident the offense will get the wrinkles ironed out. Reich said overall he’s pleased with how the rookie QB has progressed and the poise he displayed in the pocket against the Giants while leading a 15-play, 62-yard drive that resulted in a field goal. Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. “I thought his reads were pretty sharp,” Reich said. “There was one play where he was pretty off, but that was it. Other than that I thought he looked crisp in the pocket, decisive and was really seeing things well. Other than that one play I thought his eyes were in the right place.” ROSTER MOVE The Panthers waived defensive tackle Marquan McCall, who had been listed as the team’s starting defensive tackle in the unofficial depth chart. McCall was an undrafted rookie in 2022 who played 16 games last season for the Panthers. Reich said it came down to McCall not being the right fit for the team’s 3-4 defensive scheme. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-21 17:56:52","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"title":"Le débrief du lundi - Anthony Clément : « 4 points pour l'OM, un moindre mal »","link":"https://www.lequipe.fr/Football/Actualites/Le-debrief-du-lundi-anthony-clement-4-points-pour-l-om-un-moindre-mal/1414970#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Stéphane Cassier"],"video_url":null,"description":"Éliminés en phase préliminaire de la Ligue des champions par le Panathinaïkos, puis tenus en échec par Metz en Ligue 1, les Marseillais ont connu une semaine compliquée.","content":"Après au 3e tour préliminaire en Ligue des champions, l'Olympique de Marseille a fait match nul à Metz, pour le compte de la 2e journée de Ligue 1. Deux matches aux scénarios aussi incroyables que décevants pour Anthony Clément, journaliste à L'Équipe. Mais finalement, avoir 4 points après deux journées et dans ces conditions, est un moindre mal.","pubDate":"2023-08-21 17:53:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/le-debrief-du-lundi-d-anthony-clement-l-equipe/1500000001823798/0:0,1499:749-665-335-70/5eea0.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"'Horrible'... Gary Neville reacts to Manchester United decision on Mason Greenwood","link":"https://www.unitedinfocus.com/news/gary-neville-reacts-to-manchester-united-decision-on-mason-greenwood/","keywords":["News","Gary Neville","Mason Greenwood"],"creator":["Dan Coombs"],"video_url":null,"description":"Gary Neville has given his verdict on Manchester United making a decision on Mason Greenwood. Manchester United have announced Mason Greenwood will not play for... The post 'Horrible'... Gary Neville reacts to Manchester United decision on Mason Greenwood appeared first on United In Focus.","content":"Gary Neville has given his verdict on Manchester United making a decision on Mason Greenwood. Manchester United have announced Mason Greenwood will not play for the club again. Chief executive Richard Arnold released a letter , separately, explaining United’s decision, while insisting Greenwood had satisfied the club he was not guilty of the offences he was charged with. Greenwood remains under full pay at United until the club find a loan or exit route, or agree a pay off. READ: Confirmed Manchester United transfers in, out, loans, releases, youth for 2023/24 Gary Neville was asked about the situation on Sky Sports’ Monday Night Football: “Yes they have (the right decision) they finally got there. “However, I would say that the process in getting there has been pretty horrible. “When you have difficult situations like this it requires strong leadership and Manchester United don’t have that.” Neville called for help from the Premier League for future situations like this, that the decisions are not left up to the club to investigate. He explained: “Of issues of this importance and severity they should be dealt with independently by a panel. It’s clear Manchester United do not have the skill and the ability to deal with their ability properly.” Jamie Carragher added: “However Manchester United have got to the decision, it is right. The right decision has been made that he doesn’t play for Manchester United again. “But I do feel the public opinion, a story being leaked in the past couple of weeks come out [and] caused a big stir as well, that has almost forced Manchester United’s hand. “You are almost thinking what decision United may have come to if the stories hadn’t been leaked.” Carragher was referring to reports via The Athletic last week which detailed United considering re-integrating Greenwood into the first team squad. Indeed the language in the statement from United , suggested that the club were disappointed not to be able to bring him back, citing external pressures making it impossible to do so. Greenwood himself issued a statement in which he expressed regret for the situation, accepting United’s decision, while maintaining his innocence.","pubDate":"2023-08-21 17:47:00","image_url":null,"source_id":"unitedinfocus","source_priority":72629,"country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Accord entre l'Inter Milan et le Bayern Munich pour Benjamin Pavard","link":"https://www.lequipe.fr/Football/Actualites/Accord-entre-l-inter-milan-et-le-bayern-munich-pour-benjamin-pavard/1414967#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Théo Troude"],"video_url":null,"description":"Le Bayern Munich a accepté lundi la deuxième offre de l'Inter Milan pour le défenseur international français Benjamin Pavard. L'accord porte sur 28 M€ et 5 M€ de bonus, et un contrat de 5 saisons.","content":"La deuxième offre est la bonne. Après avoir , le Bayern Munich a accepté une proposition de 30 M€, avec 2 M€ de bonus, pour transférer Benjamin Pavard à l'Inter Milan. Les deux clubs sont tombés d'accord lundi. Le défenseur international français (27 ans, 49 sélections, 3 buts) devrait donc s'engager pour cinq saisons en faveur des Nerazzurri. Si le joueur a exprimé sa volonté de rejoindre la Lombardie, le Bayern doit encore trouver son remplaçant avant que ce transfert soit bouclé. (lundi) , a notamment déclaré Giuseppe Marotta, le manager général de l'Inter Milan.","pubDate":"2023-08-21 17:46:37","image_url":"https://medias.lequipe.fr/img-photo-jpg/benjamin-pavard-va-quitter-le-bayern-munich-a-mounic-l-equipe/1500000001823796/0:0,1997:998-665-335-70/73450.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Accord de principe entre Rennes et Manchester City pour Doku","link":"https://www.lequipe.fr/Football/Actualites/Accord-de-principe-entre-rennes-et-manchester-city-pour-doku/1414966#xtor=RSS-1","keywords":["Foot, Transferts, Rennes"],"creator":["Johan Rigaud"],"video_url":null,"description":"Rennes et Manchester City ont trouvé un accord de principe pour le transfert de Jérémy Doku. L'ailier belge devrait rejoindre les Citizens pour environ 60 M d'euros.","content":"Comme révélé par le journaliste italien Fabrizio Romano, Rennes et Manchester City sont en passe de s'entendre sur le transfert de l'ailier belge Jérémy Doku, une information que nous sommes en mesure de confirmer. Un accord de principe a été trouvé et Doku est donc apparu en rouge et noir pour la dernière fois à Lens, dimanche soir. Ce transfert serait de l'ordre de 60 M d'euros, soit un record historique pour un joueur rennais. Doku était arrivé d'Anderlecht début octobre 2020 pour 26 M d'euros.","pubDate":"2023-08-21 17:42:20","image_url":"https://medias.lequipe.fr/img-photo-jpg/jeremy-doku-est-en-route-pour-manchester-city-a-reau-l-equipe/1500000001823795/0:0,1997:998-665-335-70/6732f.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Sport | Greenwood to leave Man United by 'mutual agreement'","link":"https://www.news24.com/sport/soccer/englishpremiership/greenwood-to-leave-man-united-by-mutual-agreement-20230821","keywords":null,"creator":null,"video_url":null,"description":"Manchester United and Mason Greenwood have mutually agreed for the forward to leave Old Trafford, the Premier League giants announced Monday.","content":"Manchester United and Mason Greenwood have mutually agreed for the forward to leave Old Trafford after he faced allegations of abuse involving a young woman, the club announced on Monday. The 21-year-old forward has been suspended by the Premier League giants since January 2022 over the allegations after images and videos were posted online. Prosecutors said in February they were dropping charges, including attempted rape and sexual assault, against Greenwood, after key witnesses withdrew and new evidence came to light. On Monday, the club said that after a six-month internal investigation into his conduct, it was releasing Greenwood so he could attempt to rebuild his career elsewhere. The club said Monday: \"All those involved, including Mason, recognise the difficulties with him recommencing his career at Manchester United. \"It has therefore been mutually agreed that it would be most appropriate for him to do so away from Old Trafford, and we will now work with Mason to achieve that outcome. \" Greenwood, whose contract runs until June 2025, said: \"I did not do the things I was accused of, and in February I was cleared of all charges. \"However, I fully accept I made mistakes in my relationship, and I take my share of responsibility for the situations which led to the social media post.\" He added: \"The best decision for us all, is for me to continue my football career away from Old Trafford, where my presence will not be a distraction for the club. \"I thank the club for their support since I joined aged seven. There will always be a part of me which is United.\" The club said: \"Based on the evidence available to us, we have concluded that the material posted online did not provide a full picture and that Mason did not commit the offences in respect of which he was originally charged. \"That said, as Mason publicly acknowledges today, he has made mistakes which he is taking responsibility for.\" Greenwood was tipped for stardom at United after rising through the Old Trafford youth system and went onto score 35 goals in 129 senior appearances for the club. In his statement, he said: \"I want to start by saying I understand that people will judge me because of what they have seen and heard on social media, and I know people will think the worst. \"I was brought up to know that violence or abuse in any relationship is wrong... However, I fully accept I made mistakes in my relationship, and I take my share of responsibility for the situations which led to the social media post. He added he was \"learning to understand my responsibilities to set a good example as a professional footballer, and I'm focused on the big responsibility of being a father, as well as a good partner\". Manchester United chief executive Richard Arnold, who was criticised after suggesting this year that Greenwood might be reintegrated back into the first-team squad, wrote an open letter to United's fans. He acknowledged that while \"reintegration was one of the outcomes we considered and planned for,\" his view had \"evolved as our process progressed\". Arnold added: \"I am also mindful of the challenge that Mason would face rebuilding his career and raising a baby together with his partner in the harsh spotlight of Manchester United. \"The club will continue to offer its support both to the alleged victim and Mason to help them rebuild and move forward positively with their lives.\"","pubDate":"2023-08-21 17:41:31","image_url":"https://cdn.24.co.za/files/Cms/General/d/7451/e3c02b4fb449444986898ae9e8673f79.jpg","source_id":"news24","source_priority":1882,"country":["south africa"],"category":["sports"],"language":"english"},{"title":"Gérald Baticle nommé adjoint de Thierry Henry en équipe de France Espoirs, Gaël Clichy également dans le staff","link":"https://www.lequipe.fr/Football/Actualites/Gerald-baticle-nomme-adjoint-de-thierry-henry-en-equipe-de-france-espoirs-gael-clichy-egalement-dans-le-staff/1414965#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Hugues Sionis"],"video_url":null,"description":"Gérald Baticle occupera la fonction d'adjoint de Thierry Henry dans le staff de l'équipe de France Espoirs, a précisé la Fédération française (FFF), ce lundi. Gaël Clichy devrait lui aussi intégrer le staff des Bleuets.","content":"Libre depuis sa mise à pied en novembre dernier par Angers, relégué depuis en Ligue 2, Gérald Baticle va reprendre du service. En confirmant comme nouveau sélectionneur de l'équipe de France Espoirs, ce jeudi, la Fédération française (FFF) a précisé que l'ancien attaquant d'Auxerre et Strasbourg notamment allait intégrer le staff en tant qu'adjoint. C'est la première fois de sa carrière que le technicien (53 ans), qui aussi dirigé des équipes de jeunes à Auxerre (2005-2008), avant d'enchaîner à Brest (2008-2009) ou encore au sein de l'OL dans différentes fonctions (2011-2021) va intégrer la FFF. Durant sa carrière de joueur, il a été en équipe de France A' mais n'a jamais porté le maillot des Bleus. Gaël Clichy devrait intégrer le staff Thierry Henry a voulu arriver avec un homme de confiance dans son staff. Sauf retournement de situation, il s'agira de Gaël Clichy (38 ans), son ancien coéquipier à Arsenal et chez les Bleus. Enfin, la FFF pourrait mettre à disposition Lionel Rouxel (53 ans), l'actuel sélectionneur de l'équipe de France des moins de 19 ans, pour étoffer encore le staff de Thierry Henry.","pubDate":"2023-08-21 17:39:12","image_url":"https://medias.lequipe.fr/img-photo-jpg/gerald-baticle-etait-libre-depuis-son-depart-d-angers-en-novembre-2022-a-reau-l-equipe/1500000001823794/0:0,1997:998-665-335-70/d03e9.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Dolphins QB Mike White in concussion protocol after preseason game vs. Texans","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/21/dolphins-qb-mike-white-in-concussion-protocol-after-preseason-game-vs-texans","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL’s concussion protocol after team staff members noticed “irregularities” during Saturday’s preseason game at the Houston […]","content":"MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL's concussion protocol after team staff members noticed \"irregularities\" during Saturday's preseason game at the Houston Texans, coach Mike McDaniel said Monday. Read this article for free: Already have an account? To continue reading, please subscribe: * MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL’s concussion protocol after team staff members noticed “irregularities” during Saturday’s preseason game at the Houston Texans, coach Mike McDaniel said Monday. White entered the game for a series in the third quarter when Skylar Thompson was taken to the sideline to be evaluated for an injury. McDaniel said there is not yet a timeline for White’s return, but the Dolphins will re-sign quarterback James Blackman, who began training camp with Miami but was recently cut. Blackman will be available for Saturday’s preseason finale at Jacksonville, along with Thompson and Tua Tagovailoa. White tried to evade a pass rush on second down at the Miami 41, but was sacked by Houston defensive end Adedayo Odeleye. The Dolphins eventually punted. White was tackled to the ground and did not return. Thompson finished the game. “We had them split to kind of equal it out from the game previous. When he was in, he was going to be in for the duration,” McDaniel said, “and then plans quickly change. You just adjust like all football teams have to, but we were planning on getting him some snaps in the game.” White signed a two-year deal with the Dolphins in March after spending the past three seasons with the Jets. White started Miami’s preseason opener against Atlanta and completed 9 of 14 passes for 85 yards with one interception. He and Thompson, a 2022 seventh-round draft pick, are both vying for the No. 2 quarterback role behind Tagovailoa. Thompson bounced back from a two-interception performance against the Falcons with 157 yards and three TDs against Houston. Injuries are piling up a bit for the Dolphins with less than a month before the regular-season opener against the Chargers on Sept. 10. Rookie running back De’Von Achane was carted off the field Saturday with a shoulder injury after a defensive lineman fell on him. McDaniel said Achane avoided serious injury and is week to week. Cornerback Cam Smith, Miami’s 2023 second-round pick, is out with a shoulder injury suffered against Atlanta. Veteran left tackle Terron Armstead, who nursed various injuries in 2022, appeared to sustain a lower-body injury during a joint practice against Houston. He was seen on the Dolphins sideline Saturday wearing a walking boot on his right foot, but McDaniel said he is optimistic about Armstead’s return. “We avoided anything too substantial in terms of a timeline,” McDaniel said Saturday. “I’m not really worried about it. I’m just worried about him getting right as fast as possible, which I know he’ll do.” Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. Robert Jones, who was competing for a starting left guard spot, left Saturday with a “lower extremity” injury that will keep him out for at least a week, McDaniel said. “On a roster like this, what it’s done is really enabled some people to get some opportunities to showcase some skills while people have been injured,” McDaniel said. “It’s a harder thing on teams that don’t have as much depth as we do.” NOTES: McDaniel said he hasn’t concerned himself with whether defensive lineman Christian Wilkins will extend his hold-in into the regular season. Wilkins hasn’t participated in team drills amid contract negotians. McDaniel has been in constant contact with Wilkins and added that when Wilkins is ready to go he will tell him. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-21 17:39:06","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"title":"Thierry Henry, un début de carrière d'entraîneur mitigé","link":"https://www.lequipe.fr/Football/Actualites/Thierry-henry-un-debut-de-carriere-d-entraineur-mitige/1414971#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Lucas Delhomme"],"video_url":null,"description":"Nommé ce lundi sélectionneur des Bleuets, Thierry Henry a connu des premières expériences mitigées dans le coaching, que ce soit avec la Belgique, Monaco ou Montréal.","content":"Adjoint de la Belgique pour faire ses armes À peine sa carrière terminée, en 2014, Thierry Henry a commencé à entraîner. Avec les moins de 16 ans d'Arsenal d'abord. Puis dans l'encadrement du sélectionneur de la Belgique, Roberto Martinez, entre 2016 et 2018, au poste de second, puis premier adjoint. Henry quitte les Diables rouges après la 3e place acquise lors de la Coupe du monde en Russie. Il revient pour l'Euro 2021, puis la Coupe du monde 2022. Après une élimination au premier tour au Qatar, Martinez n'est pas reconduit. . Monaco, une expérience écourtée De retour dans son club formateur en octobre 2018, cette fois-ci en tant qu'entraîneur principal, Thierry Henry a connu une première expérience compliquée. , champion de France un an avant, le défi s'annonçait ardu. Après 4 mois et seulement 20 petits matches toutes compétitions confondues (5 victoires, 4 nuls, 11 défaites), et remplacé par... Jardim. Le Portugais reprend l'ASM, alors 19e de L1. Un sentiment d'inachevé à Montréal Loin de l'Europe, Henry part entraîner dans une Ligue qu'il connaît bien : la MLS. À Montréal, l'ancien joueur d'Arsenal veut faire oublier la désillusion de Monaco. Malgré des résultats mitigés (31 % de victoires), Henry décroche les barrages des play-offs (une première pour le club depuis 2016) et un quart de finale de la Ligue des champions Concacaf. , , pour des raisons familiales, après seulement 29 matches sur le banc de l'Impact et avec un goût amer d'inachevé.","pubDate":"2023-08-21 18:18:30","image_url":"https://medias.lequipe.fr/img-photo-jpg/thierry-henry-lors-d-un-entrainement-avec-monaco-en-octobre-2018-a-reau-l-equipe/1500000001823809/0:0,1998:999-665-335-70/31eef.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"England legend Sir Geoff Hurst ‘bitterly disappointed’ for Lionesses","link":"https://metro.co.uk/2023/08/21/england-legend-sir-geoff-hurst-bitterly-disappointed-for-lionesses-19372551/","keywords":["Football","Sport","England Women's football team","National Lottery","Women's World Cup 2023"],"creator":["Kirsten Robertson"],"video_url":null,"description":"‘It’s not easy to win a World Cup, we won ours 57 years ago and England is still waiting for another.’","content":"Sir Geoff Hurst says the Lionesses ‘will get over’ the hurt of their World Cup loss sooner than they think. The 81-year-old – whose hat-trick heroics propelled the Three Lions to glory in 1966 – sent a message of support to Sarina Wiegman’s squad. It comes after the England legend hit out at Prince William for not making the journey Down Under to support the team. Sir Geoff told Metro : ‘I’ve been there and know how disappointing it feels. ‘On a personal level they will get over the loss. They are professionals and have bad times in sport – as we all do. You win stuff, you lose stuff. ‘They will be bitterly disappointed – we’re bitterly disappointed as supporters as well – but what the Lionesses have achieved is just amazing. ‘It’s not easy to win a World Cup, we won ours 57 years ago and England is still waiting for another.’ Sir Geoff watched the tournament unfold from his home in Cheltenham with his wife Judith, and excitedly texted with his granddaughter Amy during games. He added: ‘In the past, I’ve met female journalists who were once barred from playing football. It’s hard to imagine now with what we’ve seen in the last few years. ‘They don’t have the trophy, but the Lionesses are still winners to me. ‘The legacy they’ve left from the Euros and now the World Cup is making a huge difference. ‘It will also change their lives. They’ll be 80 in a supermarket and someone will come up and go “oh you’re Millie Bright, you were captain in the 2023 World Cup.” ‘People don’t forget.’ Sir Geoff spoke with Metro from a girls training session at Youngs FC , a club which has bolstered its ranks with an under-17s team thanks to National Lottery funding. The Wembley hero met with players and coaches to find out more about the impact of dedicated support at the grassroots level. Sir Geoff added: ‘The National Lottery has invested £50 million into the sport over the last decade. ‘They were magnificent’ World Cup winner Geoff Hurst told #BBCBreakfast the Lionesses should return with pride from their Australian adventure after finishing as World Cup runners up https://t.co/k5AXqv3JF3 pic.twitter.com/Lukc4QUJ4h ‘It takes funds and time to run a football club. Youngs FC have an under 17s team now, and that’s coming in thanks to new money. ‘It’s been really interesting talking with the coaches here and hearing what they are doing differently. ‘In the past, an issue in football at a grassroots level has been parents standing on the line shouting and screaming. ‘Here, they have a parent committee to officially deal with any issues. It’s a major step forward to make sure people can simply enjoy football and have fun. ‘There are 200 new clubs since the Euros, who knows how many will come after this tournament.’ Nike issue fresh statement on Mary Earps shirt controversy after World Cup heroics Jennifer Hermoso releases new statement on 'mutual' kiss with Spanish FA president Women’s World Cup star announces pregnancy day after tournament comes to end Sir Geoff added: ‘And as a team, the Lionesses have plenty more chance at success. ‘It’s a young and exciting squad, they’ve done us proud and will continue to do so.’ Sir Geoff spoke to Metro alongside the National Lottery. To continue creating more opportunities for women and girls all over the UK to play football, The National Lottery has committed an additional £15 million into the FA over the next four years (2023-2027.) Find out how your numbers make amazing happen at: www.lotterygoodcauses.org.uk Get in touch with our news team by emailing us at webnews@metro.co.uk . For more stories like this, check our news page .","pubDate":"2023-08-21 18:13:42","image_url":null,"source_id":"metro","source_priority":1797,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Panthers confident No. 1 pick Bryce Young is getting enough preseason reps, will be ready for Week 1","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/21/panthers-confident-no-1-pick-bryce-young-is-getting-enough-preseason-reps-will-be-ready-for-week-1","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. The No. […]","content":"CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. Read this article for free: Already have an account? To continue reading, please subscribe: * CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. The No. 1 overall pick in the NFL draft has only attempted 12 passes through two exhibition games with very limited success, completing seven for 56 yards with no touchdowns. Young has led five drives with three of them resulting in three-and-outs. The Panthers have scored just three points with the 2021 Heisman Trophy winner under center. “Yes, I feel he will be ready,” Reich said Monday. “He’s very accomplished mentally and maturity-wise.” Reich said he’s relying on Young’s extensive workload in practice to help him prepare for the team’s Sept. 10 regular-season opener against the Atlanta Falcons, which Young will start. “He’s gotten a lot of work and reps,” Reich said. “That’s why we made the decision back in the spring to announce him as the starter and put our team in a position to say ‘hey, this is who we are going to be moving forward.’ We are practicing at a high level that I think is preparing us for the season.” Young also said he feels he’ll be ready for the regular season, although he still has things he wants to improve on over the next couple of weeks including his timing and footwork. “The competitor in myself, and I think all of us, you want to keep playing,” Young said of the preseason. “But there is a reason for everything and we all trust in the coaches.” The Panthers aren’t alone in limiting the reps of their rookie quarterback. Reich’s former team, the Indianapolis Colts, didn’t even play Anthony Richardson in this past weekend’s preseason game against the Chicago Bears just four days after selecting him as the Week 1 starter. Reich said the Panthers only played Young two series on Friday night in part because they were facing a New York Giants defense that has a reputation for being a blitz-heavy team. Carolina’s offensive line has largely struggled to protect Young in the preseason, so Reich didn’t want to chance an injury. “When you go up against that scheme that we faced last week it can be a blitz fest,” Reich said. “And you’re like, ‘how much of it is worth it?’” Reich said. “It was great to prepare for it, and go through the mental exercise of getting ready for all of these blitzes, but then it’s risk-reward on how much you play.” Reich reiterated that Young will play in the final preseason game Friday night against the Detroit Lions, although he wouldn’t say how much. “We’d like to get a little rhythm going and accomplish certain things, so we will play it by ear,” Reich said. It’s been somewhat difficult to evaluate Young’s performance through two games because of Carolina’s struggles to protect him. The rookie was hit three times on seven drop-back passes in the team’s first preseason game against the New York Jets. Young said he’s confident the offense will get the wrinkles ironed out. Reich said overall he’s pleased with how the rookie QB has progressed and the poise he displayed in the pocket against the Giants while leading a 15-play, 62-yard drive that resulted in a field goal. Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. “I thought his reads were pretty sharp,” Reich said. “There was one play where he was pretty off, but that was it. Other than that I thought he looked crisp in the pocket, decisive and was really seeing things well. Other than that one play I thought his eyes were in the right place.” ROSTER MOVE The Panthers waived defensive tackle Marquan McCall, who had been listed as the team’s starting defensive tackle in the unofficial depth chart. McCall was an undrafted rookie in 2022 who played 16 games last season for the Panthers. Reich said it came down to McCall not being the right fit for the team’s 3-4 defensive scheme. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-21 17:56:52","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"title":"Le débrief du lundi - Anthony Clément : « 4 points pour l'OM, un moindre mal »","link":"https://www.lequipe.fr/Football/Actualites/Le-debrief-du-lundi-anthony-clement-4-points-pour-l-om-un-moindre-mal/1414970#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Stéphane Cassier"],"video_url":null,"description":"Éliminés en phase préliminaire de la Ligue des champions par le Panathinaïkos, puis tenus en échec par Metz en Ligue 1, les Marseillais ont connu une semaine compliquée.","content":"Après au 3e tour préliminaire en Ligue des champions, l'Olympique de Marseille a fait match nul à Metz, pour le compte de la 2e journée de Ligue 1. Deux matches aux scénarios aussi incroyables que décevants pour Anthony Clément, journaliste à L'Équipe. Mais finalement, avoir 4 points après deux journées et dans ces conditions, est un moindre mal.","pubDate":"2023-08-21 17:53:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/le-debrief-du-lundi-d-anthony-clement-l-equipe/1500000001823798/0:0,1499:749-665-335-70/5eea0.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"'Horrible'... Gary Neville reacts to Manchester United decision on Mason Greenwood","link":"https://www.unitedinfocus.com/news/gary-neville-reacts-to-manchester-united-decision-on-mason-greenwood/","keywords":["News","Gary Neville","Mason Greenwood"],"creator":["Dan Coombs"],"video_url":null,"description":"Gary Neville has given his verdict on Manchester United making a decision on Mason Greenwood. Manchester United have announced Mason Greenwood will not play for... The post 'Horrible'... Gary Neville reacts to Manchester United decision on Mason Greenwood appeared first on United In Focus.","content":"Gary Neville has given his verdict on Manchester United making a decision on Mason Greenwood. Manchester United have announced Mason Greenwood will not play for the club again. Chief executive Richard Arnold released a letter , separately, explaining United’s decision, while insisting Greenwood had satisfied the club he was not guilty of the offences he was charged with. Greenwood remains under full pay at United until the club find a loan or exit route, or agree a pay off. READ: Confirmed Manchester United transfers in, out, loans, releases, youth for 2023/24 Gary Neville was asked about the situation on Sky Sports’ Monday Night Football: “Yes they have (the right decision) they finally got there. “However, I would say that the process in getting there has been pretty horrible. “When you have difficult situations like this it requires strong leadership and Manchester United don’t have that.” Neville called for help from the Premier League for future situations like this, that the decisions are not left up to the club to investigate. He explained: “Of issues of this importance and severity they should be dealt with independently by a panel. It’s clear Manchester United do not have the skill and the ability to deal with their ability properly.” Jamie Carragher added: “However Manchester United have got to the decision, it is right. The right decision has been made that he doesn’t play for Manchester United again. “But I do feel the public opinion, a story being leaked in the past couple of weeks come out [and] caused a big stir as well, that has almost forced Manchester United’s hand. “You are almost thinking what decision United may have come to if the stories hadn’t been leaked.” Carragher was referring to reports via The Athletic last week which detailed United considering re-integrating Greenwood into the first team squad. Indeed the language in the statement from United , suggested that the club were disappointed not to be able to bring him back, citing external pressures making it impossible to do so. Greenwood himself issued a statement in which he expressed regret for the situation, accepting United’s decision, while maintaining his innocence.","pubDate":"2023-08-21 17:47:00","image_url":null,"source_id":"unitedinfocus","source_priority":72629,"country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Accord entre l'Inter Milan et le Bayern Munich pour Benjamin Pavard","link":"https://www.lequipe.fr/Football/Actualites/Accord-entre-l-inter-milan-et-le-bayern-munich-pour-benjamin-pavard/1414967#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Théo Troude"],"video_url":null,"description":"Le Bayern Munich a accepté lundi la deuxième offre de l'Inter Milan pour le défenseur international français Benjamin Pavard. L'accord porte sur 28 M€ et 5 M€ de bonus, et un contrat de 5 saisons.","content":"La deuxième offre est la bonne. Après avoir , le Bayern Munich a accepté une proposition de 30 M€, avec 2 M€ de bonus, pour transférer Benjamin Pavard à l'Inter Milan. Les deux clubs sont tombés d'accord lundi. Le défenseur international français (27 ans, 49 sélections, 3 buts) devrait donc s'engager pour cinq saisons en faveur des Nerazzurri. Si le joueur a exprimé sa volonté de rejoindre la Lombardie, le Bayern doit encore trouver son remplaçant avant que ce transfert soit bouclé. (lundi) , a notamment déclaré Giuseppe Marotta, le manager général de l'Inter Milan.","pubDate":"2023-08-21 17:46:37","image_url":"https://medias.lequipe.fr/img-photo-jpg/benjamin-pavard-va-quitter-le-bayern-munich-a-mounic-l-equipe/1500000001823796/0:0,1997:998-665-335-70/73450.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Accord de principe entre Rennes et Manchester City pour Doku","link":"https://www.lequipe.fr/Football/Actualites/Accord-de-principe-entre-rennes-et-manchester-city-pour-doku/1414966#xtor=RSS-1","keywords":["Foot, Transferts, Rennes"],"creator":["Johan Rigaud"],"video_url":null,"description":"Rennes et Manchester City ont trouvé un accord de principe pour le transfert de Jérémy Doku. L'ailier belge devrait rejoindre les Citizens pour environ 60 M d'euros.","content":"Comme révélé par le journaliste italien Fabrizio Romano, Rennes et Manchester City sont en passe de s'entendre sur le transfert de l'ailier belge Jérémy Doku, une information que nous sommes en mesure de confirmer. Un accord de principe a été trouvé et Doku est donc apparu en rouge et noir pour la dernière fois à Lens, dimanche soir. Ce transfert serait de l'ordre de 60 M d'euros, soit un record historique pour un joueur rennais. Doku était arrivé d'Anderlecht début octobre 2020 pour 26 M d'euros.","pubDate":"2023-08-21 17:42:20","image_url":"https://medias.lequipe.fr/img-photo-jpg/jeremy-doku-est-en-route-pour-manchester-city-a-reau-l-equipe/1500000001823795/0:0,1997:998-665-335-70/6732f.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Sport | Greenwood to leave Man United by 'mutual agreement'","link":"https://www.news24.com/sport/soccer/englishpremiership/greenwood-to-leave-man-united-by-mutual-agreement-20230821","keywords":null,"creator":null,"video_url":null,"description":"Manchester United and Mason Greenwood have mutually agreed for the forward to leave Old Trafford, the Premier League giants announced Monday.","content":"Manchester United and Mason Greenwood have mutually agreed for the forward to leave Old Trafford after he faced allegations of abuse involving a young woman, the club announced on Monday. The 21-year-old forward has been suspended by the Premier League giants since January 2022 over the allegations after images and videos were posted online. Prosecutors said in February they were dropping charges, including attempted rape and sexual assault, against Greenwood, after key witnesses withdrew and new evidence came to light. On Monday, the club said that after a six-month internal investigation into his conduct, it was releasing Greenwood so he could attempt to rebuild his career elsewhere. The club said Monday: \"All those involved, including Mason, recognise the difficulties with him recommencing his career at Manchester United. \"It has therefore been mutually agreed that it would be most appropriate for him to do so away from Old Trafford, and we will now work with Mason to achieve that outcome. \" Greenwood, whose contract runs until June 2025, said: \"I did not do the things I was accused of, and in February I was cleared of all charges. \"However, I fully accept I made mistakes in my relationship, and I take my share of responsibility for the situations which led to the social media post.\" He added: \"The best decision for us all, is for me to continue my football career away from Old Trafford, where my presence will not be a distraction for the club. \"I thank the club for their support since I joined aged seven. There will always be a part of me which is United.\" The club said: \"Based on the evidence available to us, we have concluded that the material posted online did not provide a full picture and that Mason did not commit the offences in respect of which he was originally charged. \"That said, as Mason publicly acknowledges today, he has made mistakes which he is taking responsibility for.\" Greenwood was tipped for stardom at United after rising through the Old Trafford youth system and went onto score 35 goals in 129 senior appearances for the club. In his statement, he said: \"I want to start by saying I understand that people will judge me because of what they have seen and heard on social media, and I know people will think the worst. \"I was brought up to know that violence or abuse in any relationship is wrong... However, I fully accept I made mistakes in my relationship, and I take my share of responsibility for the situations which led to the social media post. He added he was \"learning to understand my responsibilities to set a good example as a professional footballer, and I'm focused on the big responsibility of being a father, as well as a good partner\". Manchester United chief executive Richard Arnold, who was criticised after suggesting this year that Greenwood might be reintegrated back into the first-team squad, wrote an open letter to United's fans. He acknowledged that while \"reintegration was one of the outcomes we considered and planned for,\" his view had \"evolved as our process progressed\". Arnold added: \"I am also mindful of the challenge that Mason would face rebuilding his career and raising a baby together with his partner in the harsh spotlight of Manchester United. \"The club will continue to offer its support both to the alleged victim and Mason to help them rebuild and move forward positively with their lives.\"","pubDate":"2023-08-21 17:41:31","image_url":"https://cdn.24.co.za/files/Cms/General/d/7451/e3c02b4fb449444986898ae9e8673f79.jpg","source_id":"news24","source_priority":1882,"country":["south africa"],"category":["sports"],"language":"english"},{"title":"Gérald Baticle nommé adjoint de Thierry Henry en équipe de France Espoirs, Gaël Clichy également dans le staff","link":"https://www.lequipe.fr/Football/Actualites/Gerald-baticle-nomme-adjoint-de-thierry-henry-en-equipe-de-france-espoirs-gael-clichy-egalement-dans-le-staff/1414965#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Hugues Sionis"],"video_url":null,"description":"Gérald Baticle occupera la fonction d'adjoint de Thierry Henry dans le staff de l'équipe de France Espoirs, a précisé la Fédération française (FFF), ce lundi. Gaël Clichy devrait lui aussi intégrer le staff des Bleuets.","content":"Libre depuis sa mise à pied en novembre dernier par Angers, relégué depuis en Ligue 2, Gérald Baticle va reprendre du service. En confirmant comme nouveau sélectionneur de l'équipe de France Espoirs, ce jeudi, la Fédération française (FFF) a précisé que l'ancien attaquant d'Auxerre et Strasbourg notamment allait intégrer le staff en tant qu'adjoint. C'est la première fois de sa carrière que le technicien (53 ans), qui aussi dirigé des équipes de jeunes à Auxerre (2005-2008), avant d'enchaîner à Brest (2008-2009) ou encore au sein de l'OL dans différentes fonctions (2011-2021) va intégrer la FFF. Durant sa carrière de joueur, il a été en équipe de France A' mais n'a jamais porté le maillot des Bleus. Gaël Clichy devrait intégrer le staff Thierry Henry a voulu arriver avec un homme de confiance dans son staff. Sauf retournement de situation, il s'agira de Gaël Clichy (38 ans), son ancien coéquipier à Arsenal et chez les Bleus. Enfin, la FFF pourrait mettre à disposition Lionel Rouxel (53 ans), l'actuel sélectionneur de l'équipe de France des moins de 19 ans, pour étoffer encore le staff de Thierry Henry.","pubDate":"2023-08-21 17:39:12","image_url":"https://medias.lequipe.fr/img-photo-jpg/gerald-baticle-etait-libre-depuis-son-depart-d-angers-en-novembre-2022-a-reau-l-equipe/1500000001823794/0:0,1997:998-665-335-70/d03e9.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Dolphins QB Mike White in concussion protocol after preseason game vs. Texans","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/21/dolphins-qb-mike-white-in-concussion-protocol-after-preseason-game-vs-texans","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL’s concussion protocol after team staff members noticed “irregularities” during Saturday’s preseason game at the Houston […]","content":"MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL's concussion protocol after team staff members noticed \"irregularities\" during Saturday's preseason game at the Houston Texans, coach Mike McDaniel said Monday. Read this article for free: Already have an account? To continue reading, please subscribe: * MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL’s concussion protocol after team staff members noticed “irregularities” during Saturday’s preseason game at the Houston Texans, coach Mike McDaniel said Monday. White entered the game for a series in the third quarter when Skylar Thompson was taken to the sideline to be evaluated for an injury. McDaniel said there is not yet a timeline for White’s return, but the Dolphins will re-sign quarterback James Blackman, who began training camp with Miami but was recently cut. Blackman will be available for Saturday’s preseason finale at Jacksonville, along with Thompson and Tua Tagovailoa. White tried to evade a pass rush on second down at the Miami 41, but was sacked by Houston defensive end Adedayo Odeleye. The Dolphins eventually punted. White was tackled to the ground and did not return. Thompson finished the game. “We had them split to kind of equal it out from the game previous. When he was in, he was going to be in for the duration,” McDaniel said, “and then plans quickly change. You just adjust like all football teams have to, but we were planning on getting him some snaps in the game.” White signed a two-year deal with the Dolphins in March after spending the past three seasons with the Jets. White started Miami’s preseason opener against Atlanta and completed 9 of 14 passes for 85 yards with one interception. He and Thompson, a 2022 seventh-round draft pick, are both vying for the No. 2 quarterback role behind Tagovailoa. Thompson bounced back from a two-interception performance against the Falcons with 157 yards and three TDs against Houston. Injuries are piling up a bit for the Dolphins with less than a month before the regular-season opener against the Chargers on Sept. 10. Rookie running back De’Von Achane was carted off the field Saturday with a shoulder injury after a defensive lineman fell on him. McDaniel said Achane avoided serious injury and is week to week. Cornerback Cam Smith, Miami’s 2023 second-round pick, is out with a shoulder injury suffered against Atlanta. Veteran left tackle Terron Armstead, who nursed various injuries in 2022, appeared to sustain a lower-body injury during a joint practice against Houston. He was seen on the Dolphins sideline Saturday wearing a walking boot on his right foot, but McDaniel said he is optimistic about Armstead’s return. “We avoided anything too substantial in terms of a timeline,” McDaniel said Saturday. “I’m not really worried about it. I’m just worried about him getting right as fast as possible, which I know he’ll do.” Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. Robert Jones, who was competing for a starting left guard spot, left Saturday with a “lower extremity” injury that will keep him out for at least a week, McDaniel said. “On a roster like this, what it’s done is really enabled some people to get some opportunities to showcase some skills while people have been injured,” McDaniel said. “It’s a harder thing on teams that don’t have as much depth as we do.” NOTES: McDaniel said he hasn’t concerned himself with whether defensive lineman Christian Wilkins will extend his hold-in into the regular season. Wilkins hasn’t participated in team drills amid contract negotians. McDaniel has been in constant contact with Wilkins and added that when Wilkins is ready to go he will tell him. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-21 17:39:06","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"title":"Thierry Henry, un début de carrière d'entraîneur mitigé","link":"https://www.lequipe.fr/Football/Actualites/Thierry-henry-un-debut-de-carriere-d-entraineur-mitige/1414971#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Lucas Delhomme"],"video_url":null,"description":"Nommé ce lundi sélectionneur des Bleuets, Thierry Henry a connu des premières expériences mitigées dans le coaching, que ce soit avec la Belgique, Monaco ou Montréal.","content":"Adjoint de la Belgique pour faire ses armes À peine sa carrière terminée, en 2014, Thierry Henry a commencé à entraîner. Avec les moins de 16 ans d'Arsenal d'abord. Puis dans l'encadrement du sélectionneur de la Belgique, Roberto Martinez, entre 2016 et 2018, au poste de second, puis premier adjoint. Henry quitte les Diables rouges après la 3e place acquise lors de la Coupe du monde en Russie. Il revient pour l'Euro 2021, puis la Coupe du monde 2022. Après une élimination au premier tour au Qatar, Martinez n'est pas reconduit. . Monaco, une expérience écourtée De retour dans son club formateur en octobre 2018, cette fois-ci en tant qu'entraîneur principal, Thierry Henry a connu une première expérience compliquée. , champion de France un an avant, le défi s'annonçait ardu. Après 4 mois et seulement 20 petits matches toutes compétitions confondues (5 victoires, 4 nuls, 11 défaites), et remplacé par... Jardim. Le Portugais reprend l'ASM, alors 19e de L1. Un sentiment d'inachevé à Montréal Loin de l'Europe, Henry part entraîner dans une Ligue qu'il connaît bien : la MLS. À Montréal, l'ancien joueur d'Arsenal veut faire oublier la désillusion de Monaco. Malgré des résultats mitigés (31 % de victoires), Henry décroche les barrages des play-offs (une première pour le club depuis 2016) et un quart de finale de la Ligue des champions Concacaf. , , pour des raisons familiales, après seulement 29 matches sur le banc de l'Impact et avec un goût amer d'inachevé.","pubDate":"2023-08-21 18:18:30","image_url":"https://medias.lequipe.fr/img-photo-jpg/thierry-henry-lors-d-un-entrainement-avec-monaco-en-octobre-2018-a-reau-l-equipe/1500000001823809/0:0,1998:999-665-335-70/31eef.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"England legend Sir Geoff Hurst ‘bitterly disappointed’ for Lionesses","link":"https://metro.co.uk/2023/08/21/england-legend-sir-geoff-hurst-bitterly-disappointed-for-lionesses-19372551/","keywords":["Football","Sport","England Women's football team","National Lottery","Women's World Cup 2023"],"creator":["Kirsten Robertson"],"video_url":null,"description":"‘It’s not easy to win a World Cup, we won ours 57 years ago and England is still waiting for another.’","content":"Sir Geoff Hurst says the Lionesses ‘will get over’ the hurt of their World Cup loss sooner than they think. The 81-year-old – whose hat-trick heroics propelled the Three Lions to glory in 1966 – sent a message of support to Sarina Wiegman’s squad. It comes after the England legend hit out at Prince William for not making the journey Down Under to support the team. Sir Geoff told Metro : ‘I’ve been there and know how disappointing it feels. ‘On a personal level they will get over the loss. They are professionals and have bad times in sport – as we all do. You win stuff, you lose stuff. ‘They will be bitterly disappointed – we’re bitterly disappointed as supporters as well – but what the Lionesses have achieved is just amazing. ‘It’s not easy to win a World Cup, we won ours 57 years ago and England is still waiting for another.’ Sir Geoff watched the tournament unfold from his home in Cheltenham with his wife Judith, and excitedly texted with his granddaughter Amy during games. He added: ‘In the past, I’ve met female journalists who were once barred from playing football. It’s hard to imagine now with what we’ve seen in the last few years. ‘They don’t have the trophy, but the Lionesses are still winners to me. ‘The legacy they’ve left from the Euros and now the World Cup is making a huge difference. ‘It will also change their lives. They’ll be 80 in a supermarket and someone will come up and go “oh you’re Millie Bright, you were captain in the 2023 World Cup.” ‘People don’t forget.’ Sir Geoff spoke with Metro from a girls training session at Youngs FC , a club which has bolstered its ranks with an under-17s team thanks to National Lottery funding. The Wembley hero met with players and coaches to find out more about the impact of dedicated support at the grassroots level. Sir Geoff added: ‘The National Lottery has invested £50 million into the sport over the last decade. ‘They were magnificent’ World Cup winner Geoff Hurst told #BBCBreakfast the Lionesses should return with pride from their Australian adventure after finishing as World Cup runners up https://t.co/k5AXqv3JF3 pic.twitter.com/Lukc4QUJ4h ‘It takes funds and time to run a football club. Youngs FC have an under 17s team now, and that’s coming in thanks to new money. ‘It’s been really interesting talking with the coaches here and hearing what they are doing differently. ‘In the past, an issue in football at a grassroots level has been parents standing on the line shouting and screaming. ‘Here, they have a parent committee to officially deal with any issues. It’s a major step forward to make sure people can simply enjoy football and have fun. ‘There are 200 new clubs since the Euros, who knows how many will come after this tournament.’ Nike issue fresh statement on Mary Earps shirt controversy after World Cup heroics Jennifer Hermoso releases new statement on 'mutual' kiss with Spanish FA president Women’s World Cup star announces pregnancy day after tournament comes to end Sir Geoff added: ‘And as a team, the Lionesses have plenty more chance at success. ‘It’s a young and exciting squad, they’ve done us proud and will continue to do so.’ Sir Geoff spoke to Metro alongside the National Lottery. To continue creating more opportunities for women and girls all over the UK to play football, The National Lottery has committed an additional £15 million into the FA over the next four years (2023-2027.) Find out how your numbers make amazing happen at: www.lotterygoodcauses.org.uk Get in touch with our news team by emailing us at webnews@metro.co.uk . For more stories like this, check our news page .","pubDate":"2023-08-21 18:13:42","image_url":null,"source_id":"metro","source_priority":1797,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Panthers confident No. 1 pick Bryce Young is getting enough preseason reps, will be ready for Week 1","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/21/panthers-confident-no-1-pick-bryce-young-is-getting-enough-preseason-reps-will-be-ready-for-week-1","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. The No. […]","content":"CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. Read this article for free: Already have an account? To continue reading, please subscribe: * CHARLOTTE, N.C. (AP) — Carolina Panthers coach Frank Reich isn’t concerned over Bryce Young’s limited playing time in the preseason impacting his readiness for the upcoming regular season. The No. 1 overall pick in the NFL draft has only attempted 12 passes through two exhibition games with very limited success, completing seven for 56 yards with no touchdowns. Young has led five drives with three of them resulting in three-and-outs. The Panthers have scored just three points with the 2021 Heisman Trophy winner under center. “Yes, I feel he will be ready,” Reich said Monday. “He’s very accomplished mentally and maturity-wise.” Reich said he’s relying on Young’s extensive workload in practice to help him prepare for the team’s Sept. 10 regular-season opener against the Atlanta Falcons, which Young will start. “He’s gotten a lot of work and reps,” Reich said. “That’s why we made the decision back in the spring to announce him as the starter and put our team in a position to say ‘hey, this is who we are going to be moving forward.’ We are practicing at a high level that I think is preparing us for the season.” Young also said he feels he’ll be ready for the regular season, although he still has things he wants to improve on over the next couple of weeks including his timing and footwork. “The competitor in myself, and I think all of us, you want to keep playing,” Young said of the preseason. “But there is a reason for everything and we all trust in the coaches.” The Panthers aren’t alone in limiting the reps of their rookie quarterback. Reich’s former team, the Indianapolis Colts, didn’t even play Anthony Richardson in this past weekend’s preseason game against the Chicago Bears just four days after selecting him as the Week 1 starter. Reich said the Panthers only played Young two series on Friday night in part because they were facing a New York Giants defense that has a reputation for being a blitz-heavy team. Carolina’s offensive line has largely struggled to protect Young in the preseason, so Reich didn’t want to chance an injury. “When you go up against that scheme that we faced last week it can be a blitz fest,” Reich said. “And you’re like, ‘how much of it is worth it?’” Reich said. “It was great to prepare for it, and go through the mental exercise of getting ready for all of these blitzes, but then it’s risk-reward on how much you play.” Reich reiterated that Young will play in the final preseason game Friday night against the Detroit Lions, although he wouldn’t say how much. “We’d like to get a little rhythm going and accomplish certain things, so we will play it by ear,” Reich said. It’s been somewhat difficult to evaluate Young’s performance through two games because of Carolina’s struggles to protect him. The rookie was hit three times on seven drop-back passes in the team’s first preseason game against the New York Jets. Young said he’s confident the offense will get the wrinkles ironed out. Reich said overall he’s pleased with how the rookie QB has progressed and the poise he displayed in the pocket against the Giants while leading a 15-play, 62-yard drive that resulted in a field goal. Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. “I thought his reads were pretty sharp,” Reich said. “There was one play where he was pretty off, but that was it. Other than that I thought he looked crisp in the pocket, decisive and was really seeing things well. Other than that one play I thought his eyes were in the right place.” ROSTER MOVE The Panthers waived defensive tackle Marquan McCall, who had been listed as the team’s starting defensive tackle in the unofficial depth chart. McCall was an undrafted rookie in 2022 who played 16 games last season for the Panthers. Reich said it came down to McCall not being the right fit for the team’s 3-4 defensive scheme. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-21 17:56:52","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"title":"Le débrief du lundi - Anthony Clément : « 4 points pour l'OM, un moindre mal »","link":"https://www.lequipe.fr/Football/Actualites/Le-debrief-du-lundi-anthony-clement-4-points-pour-l-om-un-moindre-mal/1414970#xtor=RSS-1","keywords":["Foot, L1"],"creator":["Stéphane Cassier"],"video_url":null,"description":"Éliminés en phase préliminaire de la Ligue des champions par le Panathinaïkos, puis tenus en échec par Metz en Ligue 1, les Marseillais ont connu une semaine compliquée.","content":"Après au 3e tour préliminaire en Ligue des champions, l'Olympique de Marseille a fait match nul à Metz, pour le compte de la 2e journée de Ligue 1. Deux matches aux scénarios aussi incroyables que décevants pour Anthony Clément, journaliste à L'Équipe. Mais finalement, avoir 4 points après deux journées et dans ces conditions, est un moindre mal.","pubDate":"2023-08-21 17:53:04","image_url":"https://medias.lequipe.fr/img-photo-jpg/le-debrief-du-lundi-d-anthony-clement-l-equipe/1500000001823798/0:0,1499:749-665-335-70/5eea0.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"'Horrible'... Gary Neville reacts to Manchester United decision on Mason Greenwood","link":"https://www.unitedinfocus.com/news/gary-neville-reacts-to-manchester-united-decision-on-mason-greenwood/","keywords":["News","Gary Neville","Mason Greenwood"],"creator":["Dan Coombs"],"video_url":null,"description":"Gary Neville has given his verdict on Manchester United making a decision on Mason Greenwood. Manchester United have announced Mason Greenwood will not play for... The post 'Horrible'... Gary Neville reacts to Manchester United decision on Mason Greenwood appeared first on United In Focus.","content":"Gary Neville has given his verdict on Manchester United making a decision on Mason Greenwood. Manchester United have announced Mason Greenwood will not play for the club again. Chief executive Richard Arnold released a letter , separately, explaining United’s decision, while insisting Greenwood had satisfied the club he was not guilty of the offences he was charged with. Greenwood remains under full pay at United until the club find a loan or exit route, or agree a pay off. READ: Confirmed Manchester United transfers in, out, loans, releases, youth for 2023/24 Gary Neville was asked about the situation on Sky Sports’ Monday Night Football: “Yes they have (the right decision) they finally got there. “However, I would say that the process in getting there has been pretty horrible. “When you have difficult situations like this it requires strong leadership and Manchester United don’t have that.” Neville called for help from the Premier League for future situations like this, that the decisions are not left up to the club to investigate. He explained: “Of issues of this importance and severity they should be dealt with independently by a panel. It’s clear Manchester United do not have the skill and the ability to deal with their ability properly.” Jamie Carragher added: “However Manchester United have got to the decision, it is right. The right decision has been made that he doesn’t play for Manchester United again. “But I do feel the public opinion, a story being leaked in the past couple of weeks come out [and] caused a big stir as well, that has almost forced Manchester United’s hand. “You are almost thinking what decision United may have come to if the stories hadn’t been leaked.” Carragher was referring to reports via The Athletic last week which detailed United considering re-integrating Greenwood into the first team squad. Indeed the language in the statement from United , suggested that the club were disappointed not to be able to bring him back, citing external pressures making it impossible to do so. Greenwood himself issued a statement in which he expressed regret for the situation, accepting United’s decision, while maintaining his innocence.","pubDate":"2023-08-21 17:47:00","image_url":null,"source_id":"unitedinfocus","source_priority":72629,"country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Accord entre l'Inter Milan et le Bayern Munich pour Benjamin Pavard","link":"https://www.lequipe.fr/Football/Actualites/Accord-entre-l-inter-milan-et-le-bayern-munich-pour-benjamin-pavard/1414967#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Théo Troude"],"video_url":null,"description":"Le Bayern Munich a accepté lundi la deuxième offre de l'Inter Milan pour le défenseur international français Benjamin Pavard. L'accord porte sur 28 M€ et 5 M€ de bonus, et un contrat de 5 saisons.","content":"La deuxième offre est la bonne. Après avoir , le Bayern Munich a accepté une proposition de 30 M€, avec 2 M€ de bonus, pour transférer Benjamin Pavard à l'Inter Milan. Les deux clubs sont tombés d'accord lundi. Le défenseur international français (27 ans, 49 sélections, 3 buts) devrait donc s'engager pour cinq saisons en faveur des Nerazzurri. Si le joueur a exprimé sa volonté de rejoindre la Lombardie, le Bayern doit encore trouver son remplaçant avant que ce transfert soit bouclé. (lundi) , a notamment déclaré Giuseppe Marotta, le manager général de l'Inter Milan.","pubDate":"2023-08-21 17:46:37","image_url":"https://medias.lequipe.fr/img-photo-jpg/benjamin-pavard-va-quitter-le-bayern-munich-a-mounic-l-equipe/1500000001823796/0:0,1997:998-665-335-70/73450.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Accord de principe entre Rennes et Manchester City pour Doku","link":"https://www.lequipe.fr/Football/Actualites/Accord-de-principe-entre-rennes-et-manchester-city-pour-doku/1414966#xtor=RSS-1","keywords":["Foot, Transferts, Rennes"],"creator":["Johan Rigaud"],"video_url":null,"description":"Rennes et Manchester City ont trouvé un accord de principe pour le transfert de Jérémy Doku. L'ailier belge devrait rejoindre les Citizens pour environ 60 M d'euros.","content":"Comme révélé par le journaliste italien Fabrizio Romano, Rennes et Manchester City sont en passe de s'entendre sur le transfert de l'ailier belge Jérémy Doku, une information que nous sommes en mesure de confirmer. Un accord de principe a été trouvé et Doku est donc apparu en rouge et noir pour la dernière fois à Lens, dimanche soir. Ce transfert serait de l'ordre de 60 M d'euros, soit un record historique pour un joueur rennais. Doku était arrivé d'Anderlecht début octobre 2020 pour 26 M d'euros.","pubDate":"2023-08-21 17:42:20","image_url":"https://medias.lequipe.fr/img-photo-jpg/jeremy-doku-est-en-route-pour-manchester-city-a-reau-l-equipe/1500000001823795/0:0,1997:998-665-335-70/6732f.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Sport | Greenwood to leave Man United by 'mutual agreement'","link":"https://www.news24.com/sport/soccer/englishpremiership/greenwood-to-leave-man-united-by-mutual-agreement-20230821","keywords":null,"creator":null,"video_url":null,"description":"Manchester United and Mason Greenwood have mutually agreed for the forward to leave Old Trafford, the Premier League giants announced Monday.","content":"Manchester United and Mason Greenwood have mutually agreed for the forward to leave Old Trafford after he faced allegations of abuse involving a young woman, the club announced on Monday. The 21-year-old forward has been suspended by the Premier League giants since January 2022 over the allegations after images and videos were posted online. Prosecutors said in February they were dropping charges, including attempted rape and sexual assault, against Greenwood, after key witnesses withdrew and new evidence came to light. On Monday, the club said that after a six-month internal investigation into his conduct, it was releasing Greenwood so he could attempt to rebuild his career elsewhere. The club said Monday: \"All those involved, including Mason, recognise the difficulties with him recommencing his career at Manchester United. \"It has therefore been mutually agreed that it would be most appropriate for him to do so away from Old Trafford, and we will now work with Mason to achieve that outcome. \" Greenwood, whose contract runs until June 2025, said: \"I did not do the things I was accused of, and in February I was cleared of all charges. \"However, I fully accept I made mistakes in my relationship, and I take my share of responsibility for the situations which led to the social media post.\" He added: \"The best decision for us all, is for me to continue my football career away from Old Trafford, where my presence will not be a distraction for the club. \"I thank the club for their support since I joined aged seven. There will always be a part of me which is United.\" The club said: \"Based on the evidence available to us, we have concluded that the material posted online did not provide a full picture and that Mason did not commit the offences in respect of which he was originally charged. \"That said, as Mason publicly acknowledges today, he has made mistakes which he is taking responsibility for.\" Greenwood was tipped for stardom at United after rising through the Old Trafford youth system and went onto score 35 goals in 129 senior appearances for the club. In his statement, he said: \"I want to start by saying I understand that people will judge me because of what they have seen and heard on social media, and I know people will think the worst. \"I was brought up to know that violence or abuse in any relationship is wrong... However, I fully accept I made mistakes in my relationship, and I take my share of responsibility for the situations which led to the social media post. He added he was \"learning to understand my responsibilities to set a good example as a professional footballer, and I'm focused on the big responsibility of being a father, as well as a good partner\". Manchester United chief executive Richard Arnold, who was criticised after suggesting this year that Greenwood might be reintegrated back into the first-team squad, wrote an open letter to United's fans. He acknowledged that while \"reintegration was one of the outcomes we considered and planned for,\" his view had \"evolved as our process progressed\". Arnold added: \"I am also mindful of the challenge that Mason would face rebuilding his career and raising a baby together with his partner in the harsh spotlight of Manchester United. \"The club will continue to offer its support both to the alleged victim and Mason to help them rebuild and move forward positively with their lives.\"","pubDate":"2023-08-21 17:41:31","image_url":"https://cdn.24.co.za/files/Cms/General/d/7451/e3c02b4fb449444986898ae9e8673f79.jpg","source_id":"news24","source_priority":1882,"country":["south africa"],"category":["sports"],"language":"english"},{"title":"Gérald Baticle nommé adjoint de Thierry Henry en équipe de France Espoirs, Gaël Clichy également dans le staff","link":"https://www.lequipe.fr/Football/Actualites/Gerald-baticle-nomme-adjoint-de-thierry-henry-en-equipe-de-france-espoirs-gael-clichy-egalement-dans-le-staff/1414965#xtor=RSS-1","keywords":["Foot, Espoirs"],"creator":["Hugues Sionis"],"video_url":null,"description":"Gérald Baticle occupera la fonction d'adjoint de Thierry Henry dans le staff de l'équipe de France Espoirs, a précisé la Fédération française (FFF), ce lundi. Gaël Clichy devrait lui aussi intégrer le staff des Bleuets.","content":"Libre depuis sa mise à pied en novembre dernier par Angers, relégué depuis en Ligue 2, Gérald Baticle va reprendre du service. En confirmant comme nouveau sélectionneur de l'équipe de France Espoirs, ce jeudi, la Fédération française (FFF) a précisé que l'ancien attaquant d'Auxerre et Strasbourg notamment allait intégrer le staff en tant qu'adjoint. C'est la première fois de sa carrière que le technicien (53 ans), qui aussi dirigé des équipes de jeunes à Auxerre (2005-2008), avant d'enchaîner à Brest (2008-2009) ou encore au sein de l'OL dans différentes fonctions (2011-2021) va intégrer la FFF. Durant sa carrière de joueur, il a été en équipe de France A' mais n'a jamais porté le maillot des Bleus. Gaël Clichy devrait intégrer le staff Thierry Henry a voulu arriver avec un homme de confiance dans son staff. Sauf retournement de situation, il s'agira de Gaël Clichy (38 ans), son ancien coéquipier à Arsenal et chez les Bleus. Enfin, la FFF pourrait mettre à disposition Lionel Rouxel (53 ans), l'actuel sélectionneur de l'équipe de France des moins de 19 ans, pour étoffer encore le staff de Thierry Henry.","pubDate":"2023-08-21 17:39:12","image_url":"https://medias.lequipe.fr/img-photo-jpg/gerald-baticle-etait-libre-depuis-son-depart-d-angers-en-novembre-2022-a-reau-l-equipe/1500000001823794/0:0,1997:998-665-335-70/d03e9.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"title":"Dolphins QB Mike White in concussion protocol after preseason game vs. Texans","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/21/dolphins-qb-mike-white-in-concussion-protocol-after-preseason-game-vs-texans","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL’s concussion protocol after team staff members noticed “irregularities” during Saturday’s preseason game at the Houston […]","content":"MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL's concussion protocol after team staff members noticed \"irregularities\" during Saturday's preseason game at the Houston Texans, coach Mike McDaniel said Monday. Read this article for free: Already have an account? To continue reading, please subscribe: * MIAMI GARDENS, Fla. (AP) — Miami Dolphins backup quarterback Mike White is in the NFL’s concussion protocol after team staff members noticed “irregularities” during Saturday’s preseason game at the Houston Texans, coach Mike McDaniel said Monday. White entered the game for a series in the third quarter when Skylar Thompson was taken to the sideline to be evaluated for an injury. McDaniel said there is not yet a timeline for White’s return, but the Dolphins will re-sign quarterback James Blackman, who began training camp with Miami but was recently cut. Blackman will be available for Saturday’s preseason finale at Jacksonville, along with Thompson and Tua Tagovailoa. White tried to evade a pass rush on second down at the Miami 41, but was sacked by Houston defensive end Adedayo Odeleye. The Dolphins eventually punted. White was tackled to the ground and did not return. Thompson finished the game. “We had them split to kind of equal it out from the game previous. When he was in, he was going to be in for the duration,” McDaniel said, “and then plans quickly change. You just adjust like all football teams have to, but we were planning on getting him some snaps in the game.” White signed a two-year deal with the Dolphins in March after spending the past three seasons with the Jets. White started Miami’s preseason opener against Atlanta and completed 9 of 14 passes for 85 yards with one interception. He and Thompson, a 2022 seventh-round draft pick, are both vying for the No. 2 quarterback role behind Tagovailoa. Thompson bounced back from a two-interception performance against the Falcons with 157 yards and three TDs against Houston. Injuries are piling up a bit for the Dolphins with less than a month before the regular-season opener against the Chargers on Sept. 10. Rookie running back De’Von Achane was carted off the field Saturday with a shoulder injury after a defensive lineman fell on him. McDaniel said Achane avoided serious injury and is week to week. Cornerback Cam Smith, Miami’s 2023 second-round pick, is out with a shoulder injury suffered against Atlanta. Veteran left tackle Terron Armstead, who nursed various injuries in 2022, appeared to sustain a lower-body injury during a joint practice against Houston. He was seen on the Dolphins sideline Saturday wearing a walking boot on his right foot, but McDaniel said he is optimistic about Armstead’s return. “We avoided anything too substantial in terms of a timeline,” McDaniel said Saturday. “I’m not really worried about it. I’m just worried about him getting right as fast as possible, which I know he’ll do.” Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. Robert Jones, who was competing for a starting left guard spot, left Saturday with a “lower extremity” injury that will keep him out for at least a week, McDaniel said. “On a roster like this, what it’s done is really enabled some people to get some opportunities to showcase some skills while people have been injured,” McDaniel said. “It’s a harder thing on teams that don’t have as much depth as we do.” NOTES: McDaniel said he hasn’t concerned himself with whether defensive lineman Christian Wilkins will extend his hold-in into the regular season. Wilkins hasn’t participated in team drills amid contract negotians. McDaniel has been in constant contact with Wilkins and added that when Wilkins is ready to go he will tell him. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-21 17:39:06","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"}]}