{"newsArray":[{"title":"Can Stetson Bennett be an NFL quarterback? | College Football Enquirer","link":"https://ca.sports.yahoo.com/video/stetson-bennett-nfl-quarterback-college-202223353.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-10 20:22:23","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Mercato : Adlène Guedioura signe à Al-Wakrah SC (Qatar)","link":"https://www.dzfoot.com/verts-deurope/mercato-adlene-guedioura-signe-a-al-wakrah-sc-qatar-236677.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Transferts","Verts du Monde"],"creator":null,"video_url":null,"description":"Le club qatarien d’Al-Wakrah SC a annoncé la signature de l’international algérien, Adlène Guédioura, ce mardi 10 janvier 2023 sur ses réseaux sociaux. Le milieu de terrain de 37 ans a enchainé plusieurs expériences lors des dernières années. Depuis septembre 2021, l’Algérien a connu pas moins de trois clubs ; Sheffield United, Burton Alibon en Angleterre […] The post Mercato : Adlène Guedioura signe à Al-Wakrah SC (Qatar) appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-10 19:58:39","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"En direct - Football. Ligue 2 : Annecy veut aller chercher des points pour le maintien à Valenciennes","link":"https://www.ledauphine.com/sport/2023/01/10/ligue-2-suivez-en-direct-valenciennes-annecy","keywords":["Sport","Football","FC Annecy","Ligue 2 (Football)","Fil Info","Annecy","Edition Annecy / Rumilly / Les Aravis","Haute-Savoie"],"creator":null,"video_url":null,"description":"Bien placé dans la course au maintien, Annecy (14e, 20 pts) se déplace à Valenciennes (9e, 24 pts), ce mardi, avec l'intention de ne pas revenir bredouille du Nord. Une rencontre à suivre en direct commenté sur notre site. Coup d'envoi à 20h45.","content":null,"pubDate":"2023-01-10 19:57:00","image_url":null,"source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"En direct - Football. Ligue 2 : objectif top 5 pour le GF38 à Pau","link":"https://www.ledauphine.com/sport/2023/01/10/ligue-2-suivez-en-direct-pau-gf38","keywords":["Sport","Football","Ligue 2 (Football)","Sport national","GF38 (Grenoble Foot 38)","Fil Info","Grenoble","Edition Grenoble / Agglomération","Isère","Direct Sport"],"creator":null,"video_url":null,"description":"Après deux défaites consécutives en championnat, Grenoble espère rester en haut de tableau en arrêtant l’hémorragie ce mardi en déplacement à Pau, pour la 18e journée. Une rencontre à suivre en direct commenté sur notre site. Coup d'envoi à 20h45.","content":null,"pubDate":"2023-01-10 19:45:00","image_url":null,"source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"Paradou AC : Leknaoui remplace Chaló","link":"https://www.dzfoot.com/football-en-algerie/paradou-ac-leknaoui-remplace-chalo-236674.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Transferts","Football en Algérie","Ligue 1"],"creator":null,"video_url":null,"description":"Dans un récent communiqué de presse, la direction du Paradou AC a annoncé l’arrivée du technicien algérien Leknaoui Nadir au poste d’entraineur en chef de l’équipe première en remplacement de Francisco Chaló. Les dirigeants de la formation algéroise avaient trouvé, la semaine dernière, un accord pour se séparer à l'amiable avec le coach portugais, Francisco […] The post Paradou AC : Leknaoui remplace Chaló appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-10 19:43:43","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"National Championship Game Recap: What Went Wrong? Plus Stetson and Duggan as Pros With Trent Dilfer (Bonus Episode). ","link":"https://www.theringer.com/ryen-russillo-podcast/2023/1/10/23548759/national-championship-game-recap-georgia-tcu-stetson-bennett-max-duggan-as-pros-with-trent-dilfer","keywords":null,"creator":["Ryen Russillo"],"video_url":null,"description":null,"content":"Russillo shares his thoughts on Georgia’s blowout win over TCU in the College Football Playoff National Championship and the SEC’s continued dominance over the sport (0:30). Then Ryen is joined by Trent Dilfer to discuss the mismatch between TCU and Georgia, Stetson Bennett IV and Max Duggan as NFL prospects, next year’s college season, and more (7:47). Host: Ryen Russillo Guest: Trent Dilfer Producer: Kyle Crichton Subscribe: Spotify / Apple Podcasts / RSS","pubDate":"2023-01-10 19:20:18","image_url":null,"source_id":"theringer","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"What NCAA’s history with Jerry Tarkanian reveals about NIL | Opinion","link":"https://www.deseret.com/2023/1/10/23542398/ncaa-history-with-las-vegas-jerry-tarkanian-interesting-case-study-in-nil-transfer-portal-era","keywords":null,"creator":["Dave McCann"],"video_url":null,"description":null,"content":"In this Nov. 26, 2005, photo, former UNLV basketball coach Jerry Tarkanian waves to the crowd at the Thomas & Mack Center in Las Vegas.Isaac Brekken, Associated Press There was a time, not that long ago, when the NCAA only looked at Las Vegas when UNLV was accused of breaking the rules. It saw the illuminated Strip with its casinos and sports books as the uncontrollable Wild, Wild West, where anything goes 24/7, and it wanted no part of it.The idea of hosting neutral-site basketball games in southern Nevada for teams other than UNLV was seen as longer than a long shot and staging the NCAA Tournament’s coveted Final Four in the gamblers mecca forged by organized crime — fuhgeddaboudit!Times have changed.These days, nearly every hotel-casino that has room to roll out a basketball floor is hosting a tournament. More than 20 teams, including BYU and Utah State, staged neutral-site games in Las Vegas during November and December. The West Coast, Pac-12, Mountain West, WAC and Big West will again return in March to stage their respective conference tournaments.The NCAA announced that Las Vegas will host the men’s 2023 NCAA West Regional and the 2028 Final Four with the College Football Playoff expected to bring its championship game to Allegiant Stadium in 2027.Money — and the quest to get it — has always driven sports. But now it’s not just the kings and princes getting rich, it’s all the members of the court.The NCAA now allows student-athletes to receive compensation through an unbridled name, image and likeness program and enter a penalty-free transfer portal that has kids leaping from school to school faster than passengers arriving and departing from Harry Reid International Airport.Talk about the Wild, Wild West. The NCAA has not only allowed the chaos, but it has encouraged it by its lack of oversight. In fact, the governing body of college sports has become the very Las Vegas that it feared all those years ago — where anything goes, 24/7.Hypocrisy isn’t a strong enough word to describe what’s happened, but the Jerry Tarkanian story is laced with irony and if he is rolling in his grave, no one would be surprised.The NCAA hounded Tarkanian over dozens of alleged rules violations during his time at Long Beach State (1969-73), UNLV (1973-92) and Fresno State (1995-02), with most coming from his days in the desert where he turned a dormant basketball program into a thriving oasis. Related The line between the NFL and the college game growing thinner The transfer portal: Too much of a good thing? Along the successful journey came the accusations, and after years of squabbling back and forth, the NCAA put UNLV on two years’ probation and ordered Tarkanian’s suspension.The coach appealed to the Nevada Supreme Court and won an injunction. The case moved to the United States Supreme Court in 1988 where former Solicitor General and future BYU President Rex E. Lee argued on behalf of the NCAA and beat the coach in a 5-4 decision.Despite the legal defeat, Tarkanian was never suspended, and the team’s probation was put off a year to allow for the Rebels to defend their 1990 national championship. But he knew he was done on the morning a picture surfaced on the front page of the Las Vegas Review Journal showing three UNLV basketball players hot tubbing with a convicted sports fixer.Tarkanian left UNLV in 1992. Shortly after, he filed a civil lawsuit against the NCAA claiming the association manufactured evidence and used it against him. Six years later, while Tarkanian was coaching at Fresno State, the NCAA settled the case and paid him $2.5 million — or “2.5 million apologies” according to Tarkanian’s Las Vegas attorney.Tarkanian’s legacy was built on winning and losing. His 761 victories, four Final Fours and the national championship elevated him to greatness on the court. But leaving all three of his basketball programs destined for probation did little to win him any public sympathy (outside of Long Beach, Las Vegas and Fresno).One wonders how his tenure might be judged today in the wake of the NCAA’s acceptance of Las Vegas and its casual way of orchestrating its NIL program and the transfer portal.As a young sports TV anchor in Las Vegas, who missed the Tarkanian era by one season, I heard all the jokes — including “UNLV basketball players don’t leave early for the NBA because they can’t afford the pay cut.”Such an allegation back then was incriminating, but now it’s something that is justly considered. BYU quarterback Jaren Hall had to decide whether to forgo his senior year of eligibility and lucrative NIL deal for the uncertainty of the NFL draft. (According to On3.com, which tracks NIL deals, Hall’s agreement was in the neighborhood of $300,000.) It wasn’t an easy choice.NCAA investigators came after Tarkanian’s programs for a variety of issues, mostly centering around improper benefits including entertainment, financial aid, lodging and transportation, providing meals and institutional control. Related Another reason for reining in the transfer portal His Runnin’ Rebels were accused of receiving money and cars from friends outside the basketball program. The coach didn’t walk around with a bag of cash, but it’s easy to believe that he had supporters who did.Today’s NIL works in a similar way. Outside entities, away from university control, can legally provide athletes with unlimited amounts of money so long as they play for the program the NIL collective supports.  If former Rebels star Anderson Hunt received any money for hanging out at the Sahara pool in 1990, it would have been an NCAA violation. But today, any athlete can get paid to wear a certain shirt or hat around Provo or Salt Lake City.Last February, Alabama football coach Nick Saban said Texas A&M “bought their entire 2022 recruiting class through NIL deals.” Aggies coach Jimbo Fisher threw his arms up and said “We never bought anybody. No rules were broken. Nothing was done wrong.” Was he wrong? Rules that don’t exist can’t be broken and rules that are so vague can hardly be enforced.Whether or not Tarkanian paid Sidney Green, Armon Gilliam or Larry Johnson to play for him at UNLV will forever be debated. However, Pro Football Network reported in August that Alabama quarterback Bryce Young had an NIL deal worth $3.2 million and Ohio State quarterback C.J. Stroud had a deal worth $2.5 million.Bleacher Report cites Miami, Florida, recruit Jadan Rashada as receiving $9.5 million to play for the Hurricanes, with reports that he turned down $11 million from two other schools. That’s $9.5 million for a kid straight out of high school to play college football. It’s also three times the amount Jamaal Williams is earning this year with the Detroit Lions. Some of what Tarkanian was accused of might be true, but much of what the NCAA investigated back then wouldn’t even get a callback today. Related Do college football power brokers really want to fix NIL? “It is a little ironic that things, not just with Jerry, but all around the world of sports, the things that were so inappropriate 30 years ago are now part of mainstream college athletics,” said former BYU and Fresno State head coach Steve Cleveland. “I’m all for it. Whether it’s support for academics, nutrition, travel or taking care of their health, I’m happy about the changes for the student-athletes. It’s just ironic that most of those things were inappropriate and illegal back then.”Cleveland left BYU for the same job at Fresno State in 2005. The Bulldogs asked him to clean up the program amid NCAA trouble from the two previous staffs, including Tarkanian’s group. Cleveland cleaned it up, but he was fired for not winning enough while he was doing it.Talk about irony.Despite the uproar over how he did it and his legal fights, Tarkanian’s resume earned him a place in the Naismith Basketball Hall of Fame in 2013. Purists will always call him a cheater, but realists might see him as a pioneer who, while infamously sucking on his towel, introduced the original NIL to college sports by allegedly allowing his players to benefit from their success. Alas, contrary to the popular ad campaign, what happened in Vegas, didn’t stay in Vegas.By 2023 NIL standards, Tarkanian wasn’t in the wrong in many cases. He was just early. As for the NCAA, it has become the Las Vegas it once feared — a place where anything goes — and now it has a gambling problem to go with it. The organization is betting that NIL and the transfer portal will keep the NCAA in the game while it seems to be doing just the opposite.In the epitome of irony, the NCAA has allowed the Wild, Wild West to spread coast to coast and just like a trip to the blackjack table, no one has any idea if long-term success is in the cards. In this June 19, 1991, UNLV basketball coach Jerry Tarkanian testifies on Capitol Hill before the House Commerce Committee on reform of intercollegiate athletics.Marcy Nighswander, Associated Press Dave McCann is a contributor to the Deseret News and is the studio host for “BYU Sports Nation Game Day,” “The Post Game Show,” “After Further Review,” and play-by-play announcer for BYUtv. He is also co-host of “Y’s Guys” at ysguys.com. ","pubDate":"2023-01-10 19:09:41","image_url":null,"source_id":"deseret","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Cambio de sponsor en la camiseta de River","link":"https://lapaginamillonaria.com/riverplate/Cambio-de-sponsor-en-la-camiseta-de-River-20230110-0005.html","keywords":["River Plate"],"creator":["Federico del Rio"],"video_url":null,"description":"El club cerró un acuerdo hasta diciembre de 2026 con DirecTV, que ocupará el espacio que tenía Prime Video. La camiseta de River tendrá una modificación. Si bien algunos futbolistas cambiarán de numeración, como es el caso de Ignacio Fernández que se adueñó de la 10 que dejó vacante Juanfer Quintero, el club también cerró un acuerdo que genera un cambio global porque sumó un nuevo sponsor. Los dirigentes anunciaron el contrato que firmaron con DirecTV hasta el 31/12/2026 y dicha marca tendrá lugar en la espalda de la camiseta, donde antes estaba Prime Video. “Cada vez que establecemos un nuevo acuerdo como éste confirmamos el valor que tiene River para las distintas marcas y todas las posibilidades que surgen cuando trabajamos con ellas para potenciar los activos de cada una\", comentó el presidente Jorge Brito tras firmar el acuerdo que involucra tanto a la camiseta del plantel masculino como también al femenino. E incluso la marca se lucirá en la ropa de entrenamiento. Así se verá la camiseta con el nuevo sponsor (Foto: Prensa River). Todos los sponsors de la camiseta de River Con este nuevo cambio, siguen siendo cuatro las marcas que están en el manto sagrado. Codere ocupa el lugar principal en el pecho, Assist Card se ubica en las mangas, E-Football está en los números y ahora aparecerá DirecTV en la parte baja de la espalda. Para Prime Video su última aparición fue en el amistoso frente a Unión La Calera que se disputó en San Juan, en diciembre.   En el último partido del 2022, el amistoso contra La Calera, fue la última aparición de Prime Video en la camiseta (Foto: La Página Millonaria).","content":null,"pubDate":"2023-01-10 18:38:27","image_url":"https://lapaginamillonaria.com/__export/1673375849595/sites/lpm/img/2023/01/10/sponsor_river_camiseta.jpg_242310155.jpg","source_id":"lapaginamillonaria","country":["argentina"],"category":["sports"],"language":"spanish"},{"title":"Georgia’s Dominant Title Defense and a Curtain Call for the Ages","link":"https://www.theringer.com/college-football/2023/1/10/23548583/georgia-bulldogs-national-championship-stetson-bennett-curtain-call-for-the-ages","keywords":null,"creator":["Rodger Sherman"],"video_url":null,"description":null,"content":"The most memorable moment of a legendary athlete’s career is generally some sort of spectacular play. A buzzer-beating game-winner, a shot or pass that nobody else could make; a highlight that brought the crowd to its feet. But the defining moment for Stetson Bennett IV, now officially one of the most successful quarterbacks in modern college football history, will be one in which he didn’t pass or run. His moment came with 13 minutes left in Monday’s national championship game and Georgia leading TCU 52-7. (Yes, fifty-two to seven .) Georgia head coach Kirby Smart called a timeout to take Bennett out of the game. The sixth-year senior playing in his final college game came to the sideline and hugged his coach, knowing that his seemingly endless college football saga had ended in the best way possible. Stetson Bennett gets his curtain call with 13 minutes remaining in the 4th quarter What a career pic.twitter.com/SmfDGvZAf5 This isn’t to say that Bennett didn’t have highlights in his second national championship victory in as many seasons. He accounted for six touchdowns Monday night—four passes, two runs—in the best game of his career. But we’ve seen people throw a lot of touchdowns before. We’ve never seen a player subbed out of the most important game of the college football season with a quarter left because they were up by seven touchdowns. This is supposed to happen in those games in which a big-time program pays a small FCS school to lose in front of a big home crowd … except it was the national championship game. (And honestly this is unfair to FCS schools; Georgia beat Samford by only 33 in September.) The Bulldogs kept scoring with Bennett out, eventually winning 65-7. (Yes, sixty-five to seven .) TCU got exactly two stops in 60 minutes of football, forcing exactly one field goal and one punt while allowing nine touchdowns. Meanwhile, Georgia allowed TCU to cross the 40-yard line only once, on a busted coverage. No matter how you break it down, this win makes Georgia one of the greatest teams in college football history. They are just the second team to win back-to-back championships since the sport started having designated national championship games in 1995. Some of the schools we think about as dynasties—Miami around the turn of the century, Clemson at the dawn of the College Football Playoff, etc.—never pulled off a repeat. Only Alabama in 2011 and 2012 did it. (USC, with Matt Leinart and Reggie Bush, finished first in AP voting after the 2003 season and won the championship game in 2004, but the latter result was vacated.) And nobody has ever won a championship game by this much. In fact, 58 points is the largest margin of victory by any team in any bowl game in college football history—and it came in the national championship game, rather than some random bowl named after a roof repair company featuring two mismatched teams from mismatched conferences. Georgia opened the season against Oregon and humiliated the Ducks, picking off Bo Nix twice while going for 571 offensive yards in a 49-3 win. It seemed like a sign Oregon would have a down year. Nope! The Ducks finished 10-3, ranking as high as sixth in the country during the season. Georgia was just a team that wins games by 46 points. The season-opening win against the Ducks was closer than the season-closing win in the national title game. Monday night was the first game I attended this college football season, after watching hundreds of games on my couch. Walking around the field at SoFi Stadium before the game, I tried to soak in the bands and the fans and the atmosphere—but there was also something unavoidably obvious simply watching the two teams go through drills: Georgia was bigger and stronger and faster than TCU. Simply standing near Georgia’s defensive line as they practiced firing off the snap seemed dangerous. The Bulldogs likely won the game over the last few months and years of recruiting: Georgia has landed 18 five-star recruits, 14 of whom were on the championship game roster; TCU had no five-star recruits playing on Monday. Yes, Georgia is great at developing players too—its quarterback is Stetson Bennett IV —but, well, stars matter. In his postgame press conference, Smart cited lots of factors for a rare title blowout: his team’s toughness; the intelligence Bennett showed by checking in and out of plays after reading the TCU defense; a phenomenal performance by Georgia’s defensive scout team to mimic TCU’s 3-3-5 defense. I believe all of these things to be real—Georgia was better schematically, better prepared, and seemed to have more energy. Perhaps TCU was emotionally spent after a thrilling season filled with come-from-behind, last-second wins. Georgia even had more finesse in addition to being larger: Quarterback Max Duggan, the Heisman runner-up, played his worst game of the season, missing throw after throw after throw, while Bennett was on fire. But what the hell are you supposed to do about being smaller and weaker and slower? What’s the final score if TCU and Georgia were equally tough, and Bennett made a ton of wrong reads, and Georgia’s scout team stunk … but all of Georgia’s players were still significantly better? 42-14? 35-24? It’s easy to see Georgia’s off-the-bus dominance as a sign of something about college football that needs fixing. Mismatches like this simply don’t occur in pro sports. No NFL game in the Super Bowl era has had a margin of victory higher than 59 points, because the NFL doesn’t allow one team to have 18 times more elite players than the other. It’s depressing to contemplate that all of TCU’s hard work in a dream season didn’t matter because of recruiting wins Georgia made years ago. But it’s actually pretty hard to maintain complete dominance in a sport with as much roster turnover as college football. Last year, Georgia had 15 players picked in the NFL draft; Pro Football Focus puts 11 Dawgs on its 2023 big board , without diving into the question of whether anybody will take a flyer on the 25-year-old Bennett at QB. ( Maybe a team should sign him just to be the holder .) A few years ago Alabama and Clemson seemed like The Team To Beat, and this year neither made the playoff. Even with a new crop of five-stars heading to Athens, there’s no guarantee Georgia will be back here next year for the three-peat. Hell, if Ohio State’s kicker had made a field goal instead of shanking one as the ball dropped on New Year’s Eve, Georgia wouldn’t have even been in this title game. But I walked out of the stadium with a sense of awe about what we witnessed Monday night. It might not have been fun to watch Georgia win by about a million, but I’m glad Smart stopped the game to get his quarterback a round of applause. A season for the ages deserved a curtain call. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again.","pubDate":"2023-01-10 18:09:57","image_url":null,"source_id":"theringer","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"The ‘Ant-Man and the Wasp: Quantumania’ Trailer Doesn’t Hold Back","link":"https://www.theringer.com/marvel-cinematic-universe/2023/1/10/23548498/ant-man-and-the-wasp-quantumania-trailer","keywords":null,"creator":["Daniel Chin"],"video_url":null,"description":null,"content":"It’s only the second week of 2023, but the first piece of Marvel Studios content of the New Year has already arrived. The latest trailer for Ant-Man and the Wasp: Quantumania debuted during a one-sided college football national championship on Monday night, providing a closer look at what will be the first film of the MCU’s Phase 5 when it arrives on February 17. And the trailer reveals a lot . In the first Quantumania preview , which arrived in late October, the upcoming film’s Big Bad—Jonathan Majors’s Kang the Conqueror—is more talked about than seen, with the only close-up shot of his face reserved for the footage’s final moments. But in the latest trailer, Kang is front and center. “You’re an interesting man, Scott Lang,” Kang says to open the preview. “You’re an Avenger, you have a daughter, but you’ve lost a lot of time, like me. We could help each other with that.” Like many Marvel trailers, the first preview revealed little by way of plot, opting instead to reintroduce the audience to the Quantum Realm and to tease the long-awaited arrival of Kang the Conqueror after the character’s soft launch as his variant He Who Remains in the season finale of Loki . In that trailer, we also learned that Cassie Lang (Kathryn Newton) has seemingly created a means of communicating with the Quantum Realm despite being only in her teenage years. (What with the trio of young super-geniuses in Peter Parker, Riri Williams, and apparently Cassie Lang, one has to wonder, What’s going on with the American education system in the MCU, and who deserves a medal?) Cassie’s technological breakthrough naturally gets the Ant-Man clan into trouble as they’re all sucked into the Quantum Realm. The preview ends with Kang offering Scott Lang (Paul Rudd) an ominous deal that would return him and his family to their own dimension. The latest trailer, on the other hand, appears to lay out the plot in full, including the basic details of the deal that Kang offers and Scott foolishly accepts. Kang wants Scott to bring him something that might just start a multiversal war, and in return, he promises to grant the Avenger and his family much more than a ticket back to Earth; Kang can offer him time itself. And as a father who’s lost so much time with his daughter that the actress playing her has been recast twice , Scott can’t refuse that offer. “I don’t care who this guy is. I just lost so much,” Scott says via voiceover as the on-screen images convey the years he lost with Cassie during the Blip. “He can give us a second chance.” But the Quantumania preview goes even further than that, revealing, in no particular order: We also see glimpses of what sure looks like the climactic battle between Kang and Ant-Man and perhaps even the very end of Lang, with the Avenger getting beaten to a pulp as he all but concedes any chance of beating the time-traveling villain, saying: “I don’t have to win. We both just have to lose.” What may be most revealing of all about the latest look at Quantumania , though, is just how much the film seems designed to introduce Kang the Conqueror and set up the forthcoming events of the Multiverse Saga. Phase 4’s start to the Multiverse Saga felt directionless and disconnected at times compared to the Infinity Saga, but Quantumania is shaping up to be a swift course correction as the rest of Marvel Studios’ road map comes into focus. The movie may belong to Ant-Man and the Wasp in title, but Evangeline Lilly’s Hope Van Dyne has barely gotten a word in through two trailers, and here we see the spotlight shift to Kang in a major way as he assembles an army while planning for something much bigger than taking on the guy named “Ant-Man.” The preview even teases Quantumania as “the beginning of a new dynasty,” a nod to the upcoming Avengers: The Kang Dynasty , which is expected to be the penultimate entry in Phase 6 when it hits theaters in May 2025. There’s always the chance that the new Quantumania trailer features some misdirections, like the trailers for previous MCU films such as Spider-Man: Far From Home and Doctor Strange in the Multiverse of Madness , but it seems to supply more advance knowledge than Marvel typically dispenses. Given that Ant-Man has not exactly been the most memorable MCU franchise to date, and that Majors’s climactic appearance as He Who Remains in Loki gave the ongoing series one of Marvel’s most thrilling conclusions ever through the strength of riveting monologues alone, the film’s marketing team may be onto something here. There’s still the question of whether Scott will make it out of Quantumania alive as the old guard of Avengers continues to make way for the new, and whether Cassie will follow in his footsteps to become the hero known as Stature sooner rather than later. But when the third and potentially final Ant-Man film arrives next month, we’ll get a good indication of where the Loki and Avengers franchises are headed, as well as our first full-fledged meeting with the Thanos-level villain who’s primed to shape the future of the Multiverse Saga. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again.","pubDate":"2023-01-10 18:06:23","image_url":null,"source_id":"theringer","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Coupe de France de football. Les Chambériens n'iront pas au Groupama Stadium «pour faire des photos » assure l'entraîneur savoyard qui croit en l'exploit en Coupe de France face à l'OL","link":"https://www.ledauphine.com/sport/2023/01/10/chambery-ol-fiinalement-a-lyon-on-n-ira-pas-au-groupama-stadium-pour-faire-des-photos-cedric-rullier-l-entraineur-savoyard-croit-en-l-exploit","keywords":["Coupe de France de football","Sport","Football","Chambéry","Chambery-bassin","Edition Chambéry / Aix-les-Bains","Fil Info","Savoie"],"creator":null,"video_url":null,"description":"Même si Chambéry Savoie Football (National 3) a dû se résoudre à délocaliser son match de 16e de finale contre l’Olympique Lyonnais (Ligue 1) dans l’antre même du club du Rhône le samedi 21 janvier (20h45), l’entraîneur du CSF Cédric Rullier croit toujours que la magie de la Coupe de France peut opérer, y compris à Lyon et loin de la Savoie.","content":null,"pubDate":"2023-01-10 17:56:00","image_url":"https://cdn-s-www.ledauphine.com/images/400388B2-901F-48B1-969B-07E967B0D475/NW_listB/apres-avoir-fait-le-deplacement-a-aubagne-pour-voir-leurs-couleurs-se-qualifier-pour-les-16e-de-finale-de-la-coupe-de-france-les-supporters-chamberiens-dont-le-kop-de-la-frega-12-devront-se-rendre-au-groupama-stadium-le-21-janvier-pour-encourager-leurs-joueurs-contre-l-ol-photo-le-dl-sylvain-muscio-1673373070.jpg","source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"Le coup franc de Paga. Laurent Paganelli : « Toucher à Zinédine Zidane, c’est toucher ce que représente le football »","link":"https://www.ledauphine.com/sport/2023/01/10/le-coup-franc-de-paga-toucher-a-zidane-c-est-toucher-ce-que-represente-le-football","keywords":["Sport","Football","Avignon","Avignon-bassin","Edition Provençale","Vaucluse","Fil Info"],"creator":null,"video_url":null,"description":"Chaque semaine, retrouvez le coup de cœur ou le coup de gueule de Laurent Paganelli sur l’actualité footballistique.","content":null,"pubDate":"2023-01-10 17:45:00","image_url":"https://cdn-s-www.ledauphine.com/images/18B853EC-A11D-4618-961B-88519971657F/NW_listB/photo-le-dl-ch-agostinis-1673372634.jpg","source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"Get ready, Texas! College Football Playoff Championship game coming to Houston in 2024","link":"https://www.wfaa.com/article/sports/college/2024-national-championship-location/285-d21ae315-93e4-4904-84b5-3a9ca6176fea","keywords":["college","sports","news"],"creator":null,"video_url":null,"description":"The 2024 National Championship is scheduled for Jan. 8, the final year of the current four-team playoff format. The field will then expand to a 12-team bracket.","content":null,"pubDate":"2023-01-10 17:44:49","image_url":"https://media.tegna-media.com/assets/WUSA/images/f1fb6723-28e1-44fa-a998-0a6d278896cb/f1fb6723-28e1-44fa-a998-0a6d278896cb_750x422.jpg","source_id":"wfaa","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Soccer-French federation official calls for its president Le Graet to resign","link":"https://www.thestar.com.my/sport/football/2023/01/11/soccer-french-federation-official-calls-for-its-president-le-graet-to-resign","keywords":null,"creator":null,"video_url":null,"description":"PARIS (Reuters) - The head of the French Football Federation's (FFF) national ethics committee has called for the governing body's president Noel Le Graet to step down from his role. Read full story","content":null,"pubDate":"2023-01-10 17:36:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/11/1896593.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Premier League side braced for Qatar bid","link":"https://www.rt.com/sport/569665-football-qatar-tottenham-investment/?utm_source=rss&utm_medium=rss&utm_campaign=RSS","keywords":null,"creator":["RT"],"video_url":null,"description":"Tottenham has held talks with Qatar's sporting investment group as the gulf state seeks to invest in a Premier League side Read Full Article at RT.com","content":"The Qatar Sports Investments group is seeking to increase its portfolio With Qatar seeking to bolster its influence in global football after hosting last year’s FIFA World Cup, figures from the gulf state’s investment group have held talks with Tottenham Hotspur with a view to acquiring a stake in the Premier League side. According to The Guardian, figures close to Nasser al-Khelaifi, the head of Qatar Sports Investments (QSI) and the chairman of French team Paris Saint-Germain, have confirmed that he met with Tottenham chairman Daniel Levy in London last week where they discussed a potential QSI minority investment in the club. Similar reports linking QSI to bids for both Manchester United and Liverpool, who have each invited investment in recent months, are thought to be off the table for now. The potential move is intricately timed: the pound is currently in a weak position, and Qatar remains at the forefront of football, temporarily at least, after fulfilling its hosting duties last month for the FIFA World Cup which, despite some controversy associated with the event, was largely described as a success, leading figures within Qatar to believe that the time is right to invest in the world’s most popular football league. However, football rules mandate that QSI will only be permitted to purchase a partial stake in Tottenham due to guidelines dictating that clubs owned by the same entity cannot compete in the same competition. Both Paris Saint-Germain and Tottenham regularly compete in the UEFA Champions League. Minority stakes, though, are within the rules – with QSI already holding a 22% stake in Portuguese club Braga ahead of any future investments it makes. While QSI are currently considered to be frontrunners for investment into Tottenham, it is thought that at least two other parties are considering a bid. Tottenham, who are currently fifth in the Premier League, currently hold large debts in excess of £700 million ($850 million) following the building of the club's 62,000-seater Tottenham Hotspur Stadium, which was opened in 2019.","pubDate":"2023-01-10 17:22:30","image_url":"https://mf.b37mrtl.ru/files/2023.01/thumbnail/63bd95da2030273f204d5979.jpg","source_id":"rt","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"AHORA SERÁ FANTÁSTICO EN EL GOLF: La reacción viral de Pep Guardiola sobre el retiro de Gareth Bale","link":"https://somosinvictos.com/2023/01/10/ahora-sera-fantastico-en-el-golf-la-reaccion-viral-de-pep-guardiola-sobre-el-retiro-de-gareth-bale/","keywords":["España","Fútbol Europeo","Inglaterra","Bale","Guardiola","Manchester City","Real Madrid"],"creator":["INVICTOS"],"video_url":null,"description":"Durante la conferencia de prensa que concedió este martes, Pep Guardiola fue cuestionado sobre el retiro de Gareth Bale, histórico extremo galés que, en diferentes ventanas de transferencias, estuvo relacionado a equipos del míster catalán. El actual DT del Manchester City destacó la brillante trayectoria del 5 veces campeón de la UEFA Champions League. Y […] La entrada AHORA SERÁ FANTÁSTICO EN EL GOLF: La reacción viral de Pep Guardiola sobre el retiro de Gareth Bale aparece primero en SOMOS INVICTOS.","content":"Anuncios googletag.cmd.push(function() { googletag.display('div-gpt-ad-1584529102633-0'); }); Durante la conferencia de prensa que concedió este martes, Pep Guardiola fue cuestionado sobre el retiro de Gareth Bale, histórico extremo galés que, en diferentes ventanas de transferencias, estuvo relacionado a equipos del míster catalán. El actual DT del Manchester City destacó la brillante trayectoria del 5 veces campeón de la UEFA Champions League. Y luego, entre risas, bromeó diciendo que ahora sí tendrá tiempo para convertirse en un gran golfista (El Ciclón llegó a ser muy criticado porque, en el tramo final de su carrera, parecía estar más interesado en el golf que en el fútbol).Anuncios (adsbygoogle = window.adsbygoogle || []).push({}); LA REACCIÓN DE PEP GUARDIOLA TRAS EL RETIRO DE BALE «Qué jugador. Una carrera fantástica, ganó muchas cosas. Representó a Gales más de 100 veces. Ahora se convertirá en un jugador fantástico de golf (…) Quizá ahora sí tenga tiempo, lo volveré a invitar a jugar”. \"Now he will become a fantastic golf player…\" Man City boss Pep Guardiola on Gareth Bale announcing his retirement from football. pic.twitter.com/FPX0T21WIo— Sky Sports Premier League (@SkySportsPL) January 10, 2023 Dato Invicto. Gareth Bale tiene el récord de goles (41), asistencias (22) y partidos (111) en toda la historia de la Selección de Gales. Además, guió a su Nación a sus primeras Eurocopas de la historia y a su primer Mundial tras 64 años de historia. La máxima leyenda de su combinado nacional. Sin discusión. ¿Sabías que…? Gareth Bale registró 106 goles, 58 asistencias y 19 títulos en 258 partidos. Dejó una huella imborrable en el club más grande de la historia.Anuncios (adsbygoogle = window.adsbygoogle || []).push({}); La entrada AHORA SERÁ FANTÁSTICO EN EL GOLF: La reacción viral de Pep Guardiola sobre el retiro de Gareth Bale aparece primero en SOMOS INVICTOS.","pubDate":"2023-01-10 17:18:42","image_url":null,"source_id":"somosinvictos","country":["mexico"],"category":["sports"],"language":"spanish"},{"title":"LIVE Commentary this Saturday from the Gaoth Dobhair v Termon U21 Final","link":"https://highlandradio.com/2023/01/10/live-commentary-this-saturday-from-the-gaoth-dobhair-v-termon-u21-final/","keywords":["Sport"],"creator":["oisinkelly"],"video_url":null,"description":"Gaoth Dobhair and Termon will contest the Donegal U21A Football Final this Saturday. Join Pauric Hilferty & Martin McHugh for full online match commentary at highlandradio.com from the O’Donnell Park in Letterkenny (Throw In 1pm). Highland’s coverage of the Donegal U21A Football Final is in association with O’Donnell Fuels, Crolly & Ellistrin – warm up … LIVE Commentary this Saturday from the Gaoth Dobhair v Termon U21 Final Read More » The post LIVE Commentary this Saturday from the Gaoth Dobhair v Termon U21 Final appeared first on Highland Radio - Latest Donegal News and Sport.","content":"Gaoth Dobhair and Termon will contest the Donegal U21A Football Final this Saturday. Join Pauric Hilferty & Martin McHugh for full online match commentary at highlandradio.com from the O’Donnell Park in Letterkenny (Throw In 1pm). Highland’s coverage of the Donegal U21A Football Final is in association with O’Donnell Fuels, Crolly & Ellistrin – warm up for the match at www.odonnellfuels.ie The post LIVE Commentary this Saturday from the Gaoth Dobhair v Termon U21 Final appeared first on Highland Radio - Latest Donegal News and Sport.","pubDate":"2023-01-10 17:07:42","image_url":null,"source_id":"highlandradio","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Aaron Rodgers deja en vilo su futuro en la NFL: «Podría ser el momento de alejarse»","link":"https://www.hoyeneldeportecr.com/aaron-rodgers-deja-en-vilo-su-futuro-en-la-nfl-podria-ser-el-momento-de-alejarse/","keywords":["Deportes en el Mundo","Más deportes"],"creator":["Carlos Eduardo Diaz"],"video_url":null,"description":"Aaron Rodgers y los Green Bay Packers fracasaron una vez más en su intento de llegar al Super Bowl en la NFL. El cuadro de Green Bay cayó en casa ante los Detroit Lions 20-16 el pasado domingo en el tradicional Sunday Night Football, derrota que supuso su eliminación de la temporada. Tan solo segundos","content":"Aaron Rodgers y los Green Bay Packers fracasaron una vez más en su intento de llegar al Super Bowl en la NFL. El cuadro de Green Bay cayó en casa ante los Detroit Lions 20-16 el pasado domingo en el tradicional Sunday Night Football, derrota que supuso su eliminación de la temporada. Tan solo segundos después de haber finalizado el duelo la actitud de Rodgers llamó la atención entre la multitud de fanáticos de la franquicia de Wisconsin y distintos reportes en Estados Unidos, así como redes sociales en el país norteamericano apuntan a que el mítico número 12 tendría contemplado no regresar para este 2023 con el equipo de Matt LeFleur. Posterior a la derrota el QB acrecentó los rumores asegurando que por el momento no tomará ninguna decisión en cuanto a su futuro tras analizar hacia dónde va el cuadro de Green Bay de cara a la próxima temporada. , explicó Rodgers. Sin embargo, el suspenso y miedo de la fanaticada de los Packers creció tras las palabras del 12 en conferencia de prensa donde expresó que quizá ha llegado el momento de dar un paso al costado en su carrera como jugador profesional en la NFL o bien continuar un año más jugando al más alto nivel. detalló. El mariscal de 39 años de edad cerró el espacio evadiendo cualquier pregunta sobre si se ve jugando en otra franquicia que no sea la de Lambeau Field. , sentenció. Aaron Rodgers tiene dos años más de contrato con los Green Bay Packers tras la renovación que firmó a principios del 2022 (cuatro años de extensión) que lo convirtieron en el jugador mejor pagado de toda la NFL con un sueldo base de 50 millones de dólares por año.","pubDate":"2023-01-10 16:58:31","image_url":null,"source_id":"hoyeneldeportecr","country":["costa Rica"],"category":["sports"],"language":"spanish"},{"title":"Hopes to bring Super Bowl events into renovated Scottsdale venue won’t happen","link":"https://www.abc15.com/news/region-northeast-valley/scottsdale/hopes-to-bring-super-bowl-events-into-scottsdales-renovated-civic-center-venue-wont-happen","keywords":null,"creator":null,"video_url":null,"description":"A multi-million-dollar renovation project in the heart of Scottsdale is expected to open by the end of this month, but it won’t be in time to land big events ahead of Super Bowl 2023.","content":"A multi-million-dollar renovation project in the heart of Scottsdale is expected to open by the end of this month, but it won’t be in time to land big events ahead of Super Bowl XLVII next month.The City of Scottsdale asked voters to approve a bond in 2019 to update the city’s Civic Center Mall area, which is tucked away between Old Town and City Hall.The Civic Center has plans to draw in entertainment in its updated “event ready” venue that is outdoors. Despite the city advertising the project to help attract large-scale events, including 2023 Super Bowl events, officials were not able to do so.The city has posted on its website that the project would help make them competitive.Why did this project miss the timeline for the Super Bowl? Nicole Grigg explores how it is impacting the Scottsdale community tonight on ABC15 News at 10.“With few regional competitors for large events in a park-like outdoor setting, an updated public space will place Scottsdale in a competitive position to attract large-scale events, such as Super Bowl Live, a multi-day event leading up to Super Bowl 2023.”For business owner Paul Mitchell, he describes the demolition as a “nightmare.”Mitchell has owned Old Town Tavern for more than a decade, and the bar sits right along the Civic Center where construction has been ongoing for more than a year. \"There was dust, and just, jackhammering, loud, it was unbelievable and they were not hosing anything down, so reported them for dust.”Despite the ongoing mess that Mitchell describes, the project is nearing completion which will allow customers to enjoy the outdoor patio.“They said it would be all done before Super Bowl. That’s what they said,“ said Mitchell. “And it’s not.”Scottsdale city officials say that two-thirds of the park is expected to open before the Super Bowl in February. The first ticketed event will be on January 22 featuring a car show inside the Civic Center.However, despite opening a few weeks before the big game, the center will not host any Super Bowl events inside the Civic Center.ABC15 learned that people around hosting and organizing the Super Bowl brought in private companies to see the area for potential events, but did not get any inside in the outdoor venue.“We did pitch it, we can’t control where people are going to put their events, we had the drawings, we did plenty of tours, and we talked to a lot of folks,” said Erin Walsh, with the city’s communications office, \"We have ESPN which will be broadcasting directly adjacent to our project, with live shots into our project, if we hadn’t been doing these improvements they wouldn’t be there.”ESPN has hosted past Super Bowl events in Scottsdale in previous years.The tailgating event is said to be a five-day Old West-style football pre-game party as they plan to broadcast across the street for several days.The city’s Director of Tourism and Events, Karen Churchard, tells ABC15 that ESPN wanted the charm of Old Town.“Unfortunately, ESPN didn’t select the Civic Center per se, but we are really thrilled to have ESPN on Main Street which is right across the street,” said Churchard.The biggest events like the Super Bowl Experience will be at Hance Park in Phoenix, and several other major events are also in Downtown Phoenix.According to the city, the original project budget was $27.3 million which was approved by voters as part of the 2019 bond election. The city has added $6.2 million in additional funds to finish the project.“The additional funds were needed to cover construction cost escalation due to inflation and also changes to the scope of the project,” according to a city spokesperson.Walsh said that the city had a master plan, they accelerated construction, and were designing in some part as they went.“It was a mass undertaking, and then this has been a very hard time to build things, there's tons of material delays, there's tons of construction delays, steel, concrete, just even fuel delays, landscaping, PVC pipe, everything's been harder to get,” she said.“It hurt us, it did hurt us,” said Mitchell, referring to running a business during construction.As finishing touches near, Mitchell bought a second bar next to Old Town Tavern. The construction inspired him to call it the ‘Back Door’ since there was no access to a front door to get inside because there was chain link fencing that lined it.Mitchell tells ABC15 that he hopes business will be better after he says he saw a loss in revenue for several months last year, “nobody’s ever come to me, or said anything to me as the owner of both places now, ‘hey, can we do anything for you?’”The last part of the Civic Center that is not finished is expected to open at the end of March.","pubDate":"2023-01-10 16:49:52","image_url":null,"source_id":"abc15","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Gareth Bale offered role in Wales setup as Rob Page calls for retired superstar statue","link":"https://www.irishmirror.ie/sport/soccer/gareth-bale-offered-role-wales-28921276","keywords":["Sport"],"creator":["news@irishmirror.ie (James Nursey)"],"video_url":null,"description":"Gareth Bale announced his retirement from all forms of football to end a stunning career with Southampton, Tottenham, Real Madrid, LAFC and most importantly Wales","content":null,"pubDate":"2023-01-10 16:46:19","image_url":"https://i2-prod.mirror.co.uk/incoming/article28921159.ece/ALTERNATES/s98/0_GettyImages-1401199674.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Georgia win second straight US collegiate title with historic rout","link":"https://www.kuwaittimes.com/georgia-win-second-straight-us-collegiate-title-with-historic-rout/","keywords":["Other Sports","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"LOS ANGELES: The University of Georgia Bulldogs won a second straight US collegiate football crown in crushing style on Monday, routing Texas Christian University 65-7 in the championship game. The historic rout marked the first time in school history that Georgia repeated as national champions and they are the first team to repeat in the … The post Georgia win second straight US collegiate title with historic rout appeared first on Kuwait Times.","content":"LOS ANGELES: The University of Georgia Bulldogs won a second straight US collegiate football crown in crushing style on Monday, routing Texas Christian University 65-7 in the championship game. The historic rout marked the first time in school history that Georgia repeated as national champions and they are the first team to repeat in the College Football Playoff era. The last team to win back-to-back titles was the Alabama Crimson Tide in 2011 and 2012. The 58-point victory at SoFi Stadium, home of the NFL’s Los Angeles Rams and Chargers, shattered the previous record for largest margin of victory in a national championship game-Nebraska’s 38-point triumph over Florida to cap the 1995 season. TCU’s Horned Frogs were seeking to cap an unlikely season with a first national title since 1938. The team from the Fort Worth, Texas, university were 12-0 in the regular season and knocked out the second-seeded Michigan Wolverines in the Fiesta Bowl. But TCU were no match for the Bulldogs, who scored on all six of their first-half possessions to take a 38-7 halftime lead. Quarterback Stetson Bennett launched Georgia’s offensive outburst with a 21-yard touchdown run on his team’s opening drive. Georgia then parlayed a fumble from TCU receiver Derius Davis into a field goal from Jack Podlesny. On their next possession, Horned Frogs quarterback Max Duggan hit Davis with a 60-yard pass, then ran two yards for a touchdown. But Georgia closed the first half with four more touchdowns – on a 37-yard Bennett pass to Ladd McConkey, a six-yard run by Bennett, a one-yard TD plunge by Kendall Milton and a 22-yard pass from Bennett to Adonai Mitchell. The Bulldogs continued to run riot in the second half. They led 52-7 with 13:25 remaining when Bennett departed the contest to a massive ovation. He connected on 18 of 25 passes for 304 yards, rushed for 39 yards on three carries. After he left, second-year quarterback Carson Beck led Georgia on one last scoring drive. – AFP The post Georgia win second straight US collegiate title with historic rout appeared first on Kuwait Times.","pubDate":"2023-01-10 16:34:39","image_url":null,"source_id":"kuwaittimes","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Argentina: A lesson for 2023","link":"https://www.kuwaittimes.com/argentina-a-lesson-for-2023/","keywords":["Football","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"By Ricardo Guerra The hysteria in the streets was so intense that the victorious Argentinian World Cup team had to suddenly abort their tour to greet the crowds. For security reasons, instead of traveling around the city by bus, the players boarded a few helicopters and flew over the astounding number of people who awaited … The post Argentina: A lesson for 2023 appeared first on Kuwait Times.","content":"By Ricardo Guerra The hysteria in the streets was so intense that the victorious Argentinian World Cup team had to suddenly abort their tour to greet the crowds. For security reasons, instead of traveling around the city by bus, the players boarded a few helicopters and flew over the astounding number of people who awaited them in the streets. It has been reported that more than 4 million people inundated the busy streets of the beautiful and historic city of Buenos Aires. Many locals argued that Argentina had never before seen the depth of collective fervor, passion and admiration displayed for the national team. Not even the transition from dictatorship to democracy in 1983 engendered such a commotion as the one witnessed on the streets of Argentina following the World Cup victory. Nor did the lifting of the cup in 1986, despite all the ingenious plays of the legendary Diego Armando Maradona, lead to such a frenzy as the one witnessed recently in Argentina. Perhaps the current situation is so special to Argentinians simply due to the fact that it’s been more than 35 years since their team last won the cup. But maybe there’s a deeper reason for the massive scale of the festivities that followed the victory. As frustrated and divided as our society can at times be – and as certain countries find themselves today – human beings have the need to be part of a pack. In our hunter-gatherer days, survival demanded that humans be part of a group, and this craving to belong has lasted until the present. BUENOS AIRES: Argentina’s players celebrate on board a bus with a sign reading ‘World Champions’ with supporters after winning the Qatar 2022 World Cup tournament as they leave Ezeiza International Airport en route to the Argentine Football Association (AFA) training centre in Ezeiza, Buenos Aires province on December 20, 2022. – AFP In a society that at times glorifies the individual to the point of a pathological obsession with celebrity, there is perhaps no bigger task than convincing millionaire star athletes with oversized egos to subjugate their own selfish interests to the needs of the team. Add to our extreme individualism all the banalities and vulgarities surrounding these individuals, and teams may find themselves in a hothouse-like environment that becomes nearly impossible to manage. The need to balance the competing desires and personalities of star athletes presents a gargantuan challenge for the modern coach. In this morally relativistic world, the player needs not just a trainer, but an educator, a teacher, a leader. The most successful coaches are the ones who focus not just on technique, but also on the spirit, convincing these complicated individuals to strive for collective goals over their individual needs. A coach who instills in his players the idea that they are fighting for something bigger than themselves will succeed more often than one who focuses only on the technical aspects of the game. It is precisely here that the Argentinian team stands out. The unique unity of this winning team provides a sparkle of hope for 2023. What people saw in this squad was the kinship that has become more difficult to find in our fractured postmodern world. The cohesion of the Argentinian team provided a marked contrast to a society pervaded by greed, materialism and a pathological obsession with self. Their unity is a breath of fresh air within this lunacy. It almost seemed as if the people craved for themselves a dose of the unique social dynamic that permeated the family-like Argentinian squad. Through the team, they could immerse themselves in the feeling of togetherness so lacking in modern society – and perhaps be inspired to rekindle that feeling in ordinary life. Credit for this victory is due not only to the players themselves, but also to Scaloni, Argentina’s head coach, who helped instill this level of camaraderie through his expert managing skills. Scaloni himself is selfless, the embodiment of moderation and modesty. He directs all accolades and praise away from himself and onto his players. Most fans cannot even name his assistants. Members of this coaching staff are not looking for a pat on the shoulder. Football players can be very intuitive. Sensing their leader’s strength of character, they love him and strive to emulate him. Thus selflessness, modesty and decency spread through the squad. Admiring their coach even more, the players find themselves willing to run through fire for the man. In contrast to the cohesive Argentinian unit, we have other squads who float aimlessly through a banal celebrity world full of money and nefarious temptations of all sorts. How an individual athlete or an entire squad conducts itself behind the scenes can provide important information about character. A team’s behavior off the field can be indicative of its priorities and even predict its strength on the field. Muhammad Ali once said: “The fight is won or lost far away from witnesses, behind the lines, in the gym and out there on the road, long before I dance under those lights.” While the low-profile, high-spirited Argentinian squad remained focused on their trajectory toward winning the cup, behind the scenes, elements of other squads were chomping on steak sprinkled with gold at a local Qatari barbecue shop, an act whose absurdity would be hard to match. The golden steak has a deeper meaning. It symbolizes neglect and a lack of guidance, a lack of leadership and coaching. It shows the priorities of the group, indicating an astounding level of spiritual shallowness. Would these same players eat a steak sprinkled in excrement, if it were in fashion? Their preposterous behavior leaves one to wonder. Just as the Argentinian team’s cohesion derives from expert coaching, other teams’ self-indulgence results from rudderless leadership. Such lost, spoiled children desperately need to be schooled, and they need a teacher with wisdom, one they can look up to and who can lead by example, showing them how to prioritize what is worthy. They don’t need a warden who will give the keys of the penitentiary to the inmates just to keep them happy. Unfortunately, these players are led by individuals who know nothing about cultivating the spirit or setting dignified priorities. Such leaders may be more concerned with self-preservation than anything else, leading them to appease rather than direct their misguided pupils. With teachers like that, one is better off never going to school. The great middleweight boxer Marvin Hagler once said: “It’s tough to get out of bed to do roadwork at 5 am when you’ve been sleeping in silk pajamas.” Given the temptations of wealth and fame, the guidance of a Yoda-like Jedi character who can help a group of men discern right from wrong becomes even more necessary. Although this sort of guidance has nothing to do with the tactical and technical elements of the game, many times, it’s the most important form of leadership a coach can provide. It’s here that the young and humble sage Scaloni, endowed with wisdom beyond his years, left his mark by instilling in a group of men concepts such as comradeship and a selfless spiritual mentality, leading them to prioritize goals of a greater magnitude than those of any single individual. Rodrigo de Paul, the Argentinian player, is just one symbol of the squad’s grit and determination. He is tough as nails, embodying the warrior-like spirit that characterizes the entire squad. Following the victory, he wrote on one of his social media platforms: “Don’t search for money, search for glory, be champions of the world and all the people will remember and they will have gratitude for all their lives.” That says it all. The lifting of the cup is bigger than oneself. It’s bigger than any individual. And it’s more valuable than all the gold sprinkled on a piece of meat devoured by some poorly managed souls who should have been hungry for glory instead. NOTE: Ricardo Guerra is an exercise physiologist working with professional soccer teams. The post Argentina: A lesson for 2023 appeared first on Kuwait Times.","pubDate":"2023-01-10 16:27:14","image_url":null,"source_id":"kuwaittimes","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Russian football prodigy dismisses nationality concerns","link":"https://www.rt.com/sport/569655-football-russia-arsen-zakharyan/?utm_source=rss&utm_medium=rss&utm_campaign=RSS","keywords":null,"creator":["RT"],"video_url":null,"description":"Teenage Russian football star Arsen Zakharyan says that media speculation about him switching to Armenian nationality is off the mark Read Full Article at RT.com","content":"Arsen Zakharyan says he remains committed to the Russian national team Dynamo Moscow playmaker Arsen Zakharyan, 19, has rubbished suggestions that he is considering switching his national allegiance to Armenia. The highly-rated Zakharyan, who has won six caps for Russia, attracted speculation in the media that he's contemplating changing to Armenian nationality – where his parents were born – in order to help complete a high-profile transfer to Premier League giants Chelsea. He had been close to a move to the London club last summer but it was called off due to difficulties related to the registration of players from Russia in the wake of sanctions imposed upon the country due to the military operation in Ukraine. But Zakharyan says that despite the rumors he remains entirely committed to Valeri Karpin’s Russia side. “As for the rumors about the change of citizenship, nothing will need to be changed,” Zakharyan told news agency RIA Novosti. “I myself saw it on the Internet. It was just some kind of stuffing, I didn’t do anything. There are no such thoughts now.” According to numerous reports, Chelsea have retained a strong interest in Zakharyan as new co-owner of the club, Todd Boehly, continues to oversee a large-scale rebuild of the struggling English side. Results have suffered since Roman Abramovich’s sale of the club in May, with new boss Graham Potter under significant pressure to galvanize the injury-hit first team, and the former UEFA Champions League winners languishing in tenth position in the Premier League and already eliminated from both domestic cup competitions. Arsen Zakharyan on Chelsea talks: “We are already solving this with the club, agents. What and how it'll be - I myself can not say. I don't know, I don’t have a plane in 2 hours”, tells @sportexpress 🔵 #CFC“I'm at Dynamo, getting ready for the season”. @AbsoluteChelsea pic.twitter.com/nd6tcZSSjg— Fabrizio Romano (@FabrizioRomano) January 10, 2023 Zakharyan very much fits the bill, though, for the type of young, creative players they are looking to infuse into the squad – even if the player himself is getting somewhat tired of the speculation. “The constant news about Chelsea is no longer pressing. I myself read the news on social networks every day. I’m already fine with this,” he said. “If [football journalist] Fabrizio Romano wrote that Chelsea are still interested, then they are. Now I’m passing medical examination, preparing for the season. There is no such thing that I directly thought about it with all my head. “I myself can’t say what and how it will be with Chelsea. The team jokes about Chelsea – it’s okay, but I’m tired of talking. I’ll go to the Internet, there someone speaks out on this topic. I’m tired.” Dynamo Moscow are currently in fourth position in the Russian Premier League, some 13 points behind league leaders Zenit Saint Petersburg. Domestic Russian fixtures are due to resume in early March.","pubDate":"2023-01-10 16:16:37","image_url":"https://mf.b37mrtl.ru/files/2023.01/thumbnail/63bd756885f540769449c732.jpg","source_id":"rt","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Aiden McGeady admits he came close to quitting football after injury","link":"https://www.irishmirror.ie/sport/soccer/aiden-mcgeady-admits-came-close-28920615","keywords":["Sport"],"creator":["news@irishmirror.ie (Michael Turnbull)"],"video_url":null,"description":"Former Ireland international Aiden McGeady has revealed he came close to quitting football after picking up a serious injury last year","content":"Ex-Ireland playmaker Aiden McGeady has admitted he came close to retiring from football after a serious injury which left him sidelined for five months. McGeady suffered the injury, a recurrence of a knee problem, shortly after signing for Scottish Premiership side Hibernian in July 2022. The 36 year old revealed he feared his career was over and had seriously contemplated early retirement. 'The injury really set me back a lot, because it was a recurrence of the same one from last season. “There’s nothing worse than being injured. The last four or five months have been some of the worst of my career. I actually contemplated just packing it in completely. I thought, ‘I’m never going to get over this’. READ MORE: Andy Lyons hails Seamus Coleman as 'perfect role model' McGeady finally made his long awaited debut for Hibs in their 3-2 against Motherwell on Sunday and he even managed an assist for the first goal. The winger commented after the match, 'it’s all worth it when you have days like Sunday, when you are out there enjoying playing football again and showing you can make a difference.” \"I still love playing football and I want to do well for this club.” McGeady is the latest Hibs attacker to return from a lengthy injury lay-off after Kyle Magennis and Kevin Nisbet also made their comebacks over recent weeks. All three started together on Sunday as Hibs picked up a much-needed win following a run of nine defeats in 11 games for Lee Johnson’s side. They currently sit 7th in the Scottish Premiership table. READ NEXT: Get the latest sports headlines straight to your inbox by signing up for free email alerts","pubDate":"2023-01-10 16:05:55","image_url":"https://i2-prod.irishmirror.ie/incoming/article28920591.ece/ALTERNATES/s98/0_Aiden-McGeady.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Football: Singaporean referee Muhammad Taqi to officiate at Women’s World Cup","link":"https://www.straitstimes.com/sport/football-singaporean-referee-muhammad-taqi-to-officiate-at-women-s-world-cup","keywords":null,"creator":null,"video_url":null,"description":"January 10, 2023 11:43 PMHe will be the first Singaporean to officiate at both the men’s and women’s World Cups.","content":"SINGAPORE – After a once-in-a-lifetime opportunity at the Fifa World Cup in 2022, Singaporean referee Taqi Jahari will be adding another feather to his cap at the Women’s World Cup. On Tuesday, the 36-year-old was among 107 referees announced by Fifa for the Women’s World Cup, which will be held in Australia and New Zealand from July 20 to Aug 20. He will function as a video assistant referee (VAR), similar to his role in Qatar. His appointment marks another milestone for him and Singapore, as he will be the first in the country to officiate at both the men and women’s World Cups. He will be only the second Singaporean to referee at the Women’s World Cup, the first being policewoman Abirami Naidu, a former national player, in the 2015 edition in Canada. In addition, he is also the only South-east Asian referee on the list. Taqi said: “I am proud of this achievement (of being) involved in this World Cup, because this is only the second edition where the Women’s World Cup will be using the video system to referee.” Previously, he had worked in a VAR role for the men and women’s football games at the Tokyo Olympics in 2021. He noted that the standard of women’s football has “evolved drastically” since the World Cup in 2019. Pointing to the increase in the number of participating teams from 24 to 36 in the 2023 edition, he added: “It shows that the quality of women’s football has increased and improved from the previous World Cup.” In Qatar, he had the opportunity to work with women match officials, and he said: “It brings a different perspective of their thoughts, their interplay and their football understanding. “When we speak about the World Cup, for me, it doesn’t matter whether it’s men or women’s… Just understand that the World Cup is the biggest stage, you know, for everyone.” Football Association of Singapore director of referees Nazeer Hussain said the association was “both delighted and proud” of Taqi for this appointment. He added: “It is yet another feather in his cap... and a continued testament to Taqi’s ability, dedication, commitment and level of sacrifice.”","pubDate":"2023-01-10 15:43:22","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Noël Le Graët, le président décrié de la FFF, convoque un comité exécutif extraordinaire ce mercredi","link":"https://www.varmatin.com/football/noel-le-graet-le-president-decrie-de-la-fff-convoque-un-comite-executif-extraordinaire-ce-mercredi-819894","keywords":null,"creator":null,"video_url":null,"description":"Le président de la Fédération française de football (FFF), Noël Le Graët, fragilisé par une salve de critiques, a convoqué le comité exécutif de la FFF pour une session extraordinaire mercredi en fin de matinée, a appris l'AFP mardi de sources proches du dossier.","content":null,"pubDate":"2023-01-10 15:27:00","image_url":"https://fyooyzbm.filerobot.com/v7/image-a20161110t002317_m_10_161_6_18_6t.jpg?vh=c6a384&ci_seal=ecdeadb889&p=medium&v2&gravity=auto","source_id":"varmatin","country":["france"],"category":["sports"],"language":"french"},{"title":"Police to target illegal Premier League streaming and 'fire sticks'","link":"https://www.theargus.co.uk/news/23241286.police-target-illegal-premier-league-streaming-fire-sticks/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Police are targeting people who try and watch Premier League games, as well as other football from across Europe, as well as tv and movies, illegally","content":null,"pubDate":"2023-01-10 15:24:02","image_url":"https://www.theargus.co.uk/resources/images/16341383/?type=app&htype=0","source_id":"theargus","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"SI:AM | Georgia Left No Doubt","link":"https://www.si.com/college/2023/01/10/georgia-tcu-national-championship-stetson-bennett","keywords":["College","SI:AM Newsletter","News And Analysis","College Football"],"creator":["Dan Gartland"],"video_url":null,"description":"Stetson Bennett and the Bulldogs proved they’re leaps and bounds above the competition.","content":"Stetson Bennett and the Bulldogs proved they’re leaps and bounds above the competition.Good morning, I’m Dan Gartland. Let me extend a big thank you to Georgia for letting me get to bed early. In today’s SI:AM: 🐶 Stetson Bennett and Georgia roll🐸 TCU looks to the future1️⃣ The Way-Too-Early top 25If you're reading this on SI.com, you can sign up to get this free newsletter in your inbox each weekday at SI.com/newsletters.Not even close Kohjiro Kinno/Sports Illustrated College football has a new unstoppable force: the Georgia Bulldogs.“The bigger the stakes, the heavier the pressure, the better [quarterback Stetson Bennett] played. And as coach Kirby Smart declared after this 65–7 trucking of TCU—the biggest rout in the history of either the CFP or BCS—this was his finest performance,” Pat Forde writes in today’s Daily Cover story. Georgia humiliated TCU in the most lopsided game imaginable. The 58-point blowout was the biggest margin of victory in any bowl game in college football history. It was astonishing to watch. It goes without saying that the Bulldogs were leaps and bounds above their opponent in all aspects of the game. The defense held TCU to a mere 188 yards of total offense while Georgia’s offense racked up 589. Georgia punted once. It averaged more than eight yards per play. It’s tempting to look at the lopsided score and declare that TCU didn’t deserve to be in the title game, but that’s silly. The Horned Frogs went undefeated in a very strong conference before losing in overtime in the conference title game against an impressive Kansas State team. They outlasted Michigan in a heavyweight fight of a semifinal. TCU had a great team this year. It’s just that hardly anyone in college football can hang with Georgia now. Winning back-to-back national championships is next to impossible in college football. Georgia is the first team to repeat since Alabama in 2011 and ’12. The constant roster churn makes it daunting to assemble a championship-quality team in consecutive years, let alone not slip up over the course of a long season. It’s even harder in the College Football Playoff era, when teams have to win an extra semifinal game. And Georgia’s repeat is especially impressive when you consider the talent it lost from last year’s team. The Dawgs had eight defensive players selected in the NFL draft, five of them in the first round. Then that same defense went out and held TCU, which averaged more than 40 points per game in the regular season, to a lone touchdown in the national title game. But Georgia’s most important player was one who won’t be a top NFL draft pick. Quarterback Stetson Bennett, the undersized former walk-on whose story is well known by now, cemented his place in college football history with a six-touchdown game (four passing and two rushing). The game got so out of hand that Georgia coach Kirby Smart was able to pull Bennett from the game in the opening minutes of the fourth quarter so he could receive a standing ovation. Georgia’s win is a reassertion of SEC dominance over college football. The conference proves year after year that it’s the best in the country, which means that Kirby Smart’s program will have to gear up for a three-peat next fall. For more than a decade, Nick Saban’s Alabama teams have been the sport’s unstoppable force. With a thorough thrashing of an elite team last night, these Bulldogs made the case for being considered one of the best teams in college football history. In 2023, they can keep building upon what is becoming of the strongest dynasties the game has ever seen.Buy now: Relive Georgia’s back-to-back titles in SI’s commemorative issueThe best of Sports IllustratedForde also has his first top 25 ranking of the 2023 season. Ross Dellenger covered the game from TCU’s perspective, writing that the Horned Frogs are ready to do it again next year. Richard Johnson broke down how Georgia was able to win so convincingly. Chris Mannix argues that the NBA trade deadline is of tantamount importance for the Lakers, who need to make some moves to avoid squandering a great season from LeBron James.Rohan Nadkarni believes Kevin Durant’s injury could be beneficial in the long term for the Nets, who will have to weather a tough schedule in the near term without him. Conor Orr thinks the open Texans job isn’t nearly as bad as it may seem at first. Damar Hamlin was transferred to a hospital in Buffalo. Tua Tagovailoa has not been cleared to practice as the Dolphins prepare for the playoffs.The NWSL has announced its disciplinary action following the league’s sexual misconduct investigation.The top six...… Stetson Bennett touchdowns against TCU:6. An easy six-yard run thanks to some impeccable blocking. 5. 37 yards to a wide-open Ladd McConkey.4. Another one to McConkey.3. A back-shoulder fade to the unstoppable Brock Bowers.2. Adonai Mitchell’s one-handed catch. 1. His 21-yard untouched run for the first score of the game.SIQOn this day in 2003, NBA owners voted to approve an expansion team in Charlotte, bringing the number of teams in the league to 30. When the team came up with a list of finalists for its name five months later, which one did not make the list?BobcatsDragonsFlightKnightsYesterday’s SIQ: TCU has two national football championships in its history, most recently following the 1938 season. Who did the Horned Frogs beat in the Sugar Bowl on Jan. 2, 1939, to finish 11–0? TennesseeHoly CrossNotre DameCarnegie TechAnswer: Carnegie Tech. (The school is now known as Carnegie Mellon and competes at the Division III level.)TCU was led by the great Davey O’Brien, who was the team’s leading passer and rusher, but the defense was just as formidable. Only once did the Horned Frogs allow more than one touchdown in a game: in a 21–14 win over Arkansas in their second game. The Tartans didn’t have a great track record as a program (they’d won just six games in the previous three seasons combined) but came out of nowhere to post their best season in school history in 1938, going 7–1 in the regular season. Three of those wins came against nonmajor opponents (Davis & Elkins, Wittenberg and Akron), but Carnegie also boasted wins over Holy Cross (which finished the year ranked No. 9) and No. 1 Pitt. The Tartans’ only loss came against No. 5 Notre Dame, 7–0. That résumé was good enough to earn Carnegie the No. 6 spot in the AP poll at the end of the regular season and an invite to the Sugar Bowl. TCU was No. 1. But get this: The poll conducted before the bowl games was the final one of the season, so TCU had already technically locked up the national championship before facing the school from Pittsburgh. A loss to the Tartans would have weakened TCU’s claim as the best team in the nation, but the Horned Frogs won 15–7.Sports Illustrated may receive compensation for some links to products and services on this website.","pubDate":"2023-01-10 15:17:22","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTk1MDY2MjYzNzc1NDg3MTc1/stetson-bennett-kirby-smart.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Page: Bale helped put Wales on map | 'We must take advantage of his status'","link":"https://www.skysports.com/football/news/12040/12783654/gareth-bale-retires-rob-page-says-former-captain-could-have-role-to-play-in-wales-set-up","keywords":null,"creator":null,"video_url":null,"description":"Wales manager Rob Page told Gareth Bale it was the right time to finish his football career - and hinted he could have a role to play in his set-up in the future.","content":null,"pubDate":"2023-01-10 15:15:00","image_url":"https://e0.365dm.com/22/11/1920x1080/skysports-wales-rob-pag-rob-page_5969489.png?20221117194735","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Stetson Bennett’s Old Tweets Going Viral After National Title Win","link":"https://www.si.com/extra-mustard/2023/01/10/stetson-bennett-old-recruitment-tweets-viral-national-championship-victory","keywords":["Breaking","Extra Mustard","Wire"],"creator":["Zach Koons"],"video_url":null,"description":"The quarterback’s posts give a glimpse into what his football life might’ve been like had he not persevered at Georgia.","content":"The quarterback’s posts give a glimpse into what his football life might’ve been like had he not persevered at Georgia.Columbia quarterback Stetson Bennett or Middle Tennessee State quarterback Stetson Bennett certainly doesn’t have the same ring as two-time national champion Georgia quarterback Stetson Bennett. Yet that could have been the future for the Bulldogs legend had he not persevered in Athens. Following Bennett’s second straight national championship win with Georgia on Monday, in which he powered the Bulldogs to victory, a number of the 25-year-old’s old tweets began to circulate on Twitter. The primary focus of the posts that started to go viral was the quarterback tweeting out offers from programs that he received when first trying to get recruited to play in college.For instance: “Honored to receive my second offer from Columbia University!! #GoLions!!!” Bennett wrote on March 11, 2016. Or another, just a few months later: “Blessed to receive an offer from Middle Tennessee State University and @coachtf !!”Naturally, the football programs recruiting Bennett in his final year of high school were nowhere near the caliber that Georgia was or is. However, Bennett also was not exactly the same player today as when he first began his college career. Rather than attend Columbia or Middle Tennessee, Bennett opted to walk on at Georgia, not once but twice. In his second stint in Athens, he finally had his chance to shine and he took advantage of it, becoming a centerpiece of back-to-back title teams.On Monday night in Los Angeles, Bennett was more brilliant than ever. He completed 18-of-25 passes for 304 yards and four touchdowns, in addition to rushing for another 39 yards and two scores. The Bulldogs stepped on the gas and never looked back, downing upstart TCU, 65–7.Georgia capped off its undefeated season and Bennett capped off a rollercoaster of a college career that surely would’ve seemed improbable to even the quarterback himself in 2016. Now he’ll set his sights on proving his doubters wrong in the NFL, a feat that would only make his old tweets all the more satisfying. Buy now: Relive Georgia’s back-to-back titles in SI’s commemorative issue","pubDate":"2023-01-10 15:02:14","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTk1MDU2NjIzMTg0NTIwMzkx/stetson-bennett-1.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"}]}