{"newsArray":[{"title":"Snl24.com | SSU CEO: We're All Upset & Embarrassed","link":"https://www.snl24.com/soccerladuma/Local/Premiership/SuperSport-Utd/supersport-united-ceo-stan-matthews-dondol-stars-came-in-two-quantum-bakkies-my-boys-in-a-60-seater-luxury-bus-20230213","keywords":null,"creator":null,"video_url":null,"description":"SuperSport United CEO Stan Matthews has weighed in on the \"worst result in the history of the club\" after their shock elimination in the Nedbank Cup to third-tier side Dondol Stars.","content":"Matthews says they \"underestimated\" Stars, who are actually from Tshwane in Mamelodi, by fielding a weakened team and that the defeat left them \"upset and embarrassed\". \"Hats off to them, they came away from home to the team that's coming second in the PSL, they showed tremendous spirit and fight, they brought a little band of supporters,\" Matthews said on . \"They came in their two quantum bakkies and they showed they wanted the game more than my boys who came in a luxury 60-seater bus, so you know as much as it is disappointing, definitely the worst result in the history of the football club. \"Our lowest moment to lose to a team in a third tier, it's not something everybody in the club is proud about, we're all pretty upset and in a small way embarrassed,\" he said. \"But again I don't wanna take away what they brought to the party, they brought an element of surprise to us, we underestimated them. We took a calculated gamble of fielding a weaker team and giving some of the fringe players a chance to show what they can do.\" Matthews, however, consoled himself with the fact that his side is not the first club to lose to a lower league side in the Nedbank Cup, as even big teams such as Kaizer Chiefs and Orlando Pirates have suffered such upsets over the years. \"So we have to take that on the chin, we're not the first team to lose in the Nedbank Cup in a David and Goliath fashion, over the years I can recall Vaal University of Technology knocking out Golden Arrows,\" he continued. You must be to read and post comments.","pubDate":"2023-02-13 13:37:48","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Barca to make big change for iconic No. 10 shirt?","link":"https://www.snl24.com/KickOff/WorldNews/FC-Barcelona/fc-barcelona-to-make-big-change-for-iconic-ansu-fati-no-10-shirt-20230213","keywords":null,"creator":null,"video_url":null,"description":"FC Barcelona are reportedly considering making a big change regarding their iconic No. 10 shirt, which is said to have lost its appeal since Ansu Fati inherited it from Lionel Messi.","content":"The jersey has previously been donned by a number of footballing legends at the Camp Nou, including Messi, Ronaldinho, Romario, and Diego Maradona. In August 2021, the seven-time Ballon d'Or winner left the Blaugrana after his contract had expired, bringing his 20-year association with the club to an acrimonious end after he was promised a renewal. Fati, who broke into Barca's senior team in 2019 at the age of just 16, inherited the famous shirt number after the Argentine joined Paris Saint-Germain, with the young Spanish attacker widely considered at the time to be the next big talent to emerge from the LaLiga club.","pubDate":"2023-02-13 13:37:48","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"TOP 20: Waa Kuwee Kooxaha Ugu Koobabka Badan Adduunyada Kaddib Guushii Real Madrid Ee Club World Cup?","link":"https://laacibnet.net/somali/top-20-waa-kuwee-kooxaha-ugu-koobabka-badan-adduunyada-kaddib-guushii-real-madrid-ee-club-world-cup/","keywords":["Wararka Ciyaaraha","Wararka La Liga","Wararka Premier League"],"creator":["Abdiwahab Ahmed"],"video_url":null,"description":"Real Madrid ayaa Sabtidii ku guuleystay koobka naadiyada dunida ee Club World Cup, kaddib markii ay 5-3 ku karbaashtay kooxda reer Sucuudi Carabia ee Al Hilal oo ay isku haleen garoonka Prince Moulay Abdellah Stadium ee magalada Rabat ee waddanka Morocco. Koobkan ayaa ahaa midkii 98aad ee ay ku guuleysato Real Madrid intii ay dhisnayd, […]","content":"Real Madrid ayaa Sabtidii ku guuleystay koobka naadiyada dunida ee Club World Cup, kaddib markii ay 5-3 ku karbaashtay kooxda reer Sucuudi Carabia ee Al Hilal oo ay isku haleen garoonka Prince Moulay Abdellah Stadium ee magalada Rabat ee waddanka Morocco. Koobkan ayaa ahaa midkii 98aad ee ay ku guuleysato Real Madrid intii ay dhisnayd, waxaanay laba gool u jirtaa inay buuxiso tiro saddex-godle koobab ah. Lakiin haddana uma dhowa inay noqoto kooxda ugu koobabka badan adduunyada, waxaana ka horreeya kooxo badan. Warbixinta muujinaysa sida ay kooxaha adduunyadu ugu kala guuleysteen koobabka oo la daabacay sannadkii hore, isla markaana la cusboonaysiiyey kaddib koobabkii xilli ciyaareedkan la kala qaaday, ayaa waxay liiska kooxaha ugu koobabka badan ay kaga jirtaa booska lixaad. Waxa ka horreeya Atletico Penarol oo ka dhisan waddanka Uruguay oo 110 koob ku guuleysatay, Celtic oo 113 koob haysata, Rangers oo 116 koob ku guuleysatay iyo Club Nacional de Football oo reer Uruguay ah oo 117 koob urursatay sannado ay koobabka dalkaas ay guranaysay. Kooxda aan la gaadhi karin ee adduunyada oo dhan ugu koobabka badan waa Al Ahly oo reer Masar ah oo 121 koob ku guuleysatay. Halkan kaga bogo 20ka kooxood ee ugu koobabka badan adduunyada: =20. Club Olimpia (Paraguay) – 56 koob =20. Boca Juniors (Argentina) – 57 koob =18. FCSB (Romania) – 60 koob =18. Anderlecht (Belgium) – 60 koob =16. Galatasaray (Turkey) – 62 koob =15. Liverpool (England) – 66 koob =15. Manchester United (England) – 66 koob 14. Juventus (Italy) – 67 koob 13. Ajax (Netherlands) – 73 koob 12. Porto (Portugal) – 78 koob 11. Olympiacos (Greece) – 79 koob 10. Bayern Munich (Germany) – 82 koob =9. Al-Faisaly (Jordan) – 83 koob =8. Benfica (Portugal) – 83 koob 7. Barcelona (Spain) – 93 koob 6. Real Madrid (Spain) – 98 koob 5. Atletico Penarol (Uruguay) – 110 koob 4. Celtic (Scotland) – 113 koob 3. Rangers (Scotland) – 116 koob 2. Club Nacional de Football (Uruguay) – 117 koob 1. Al Ahly (Egypt) – 121 koob","pubDate":"2023-02-13 13:20:18","image_url":null,"source_id":"laacibnet","category":["sports"],"country":["somalia"],"language":"Somali"},{"title":"Liverpool vs Everton: Previewing the 242nd Merseyside Derby","link":"https://www.thesouthafrican.com/sport/soccer/epl/liverpool-vs-everton-previewing-the-242nd-merseyside-derby-epl-13-february-2023/","keywords":["English Premier League","Everton","Featured","Liverpool","Liverpool v Everton","Premier League"],"creator":["James Freemantle"],"video_url":null,"description":"Liverpool vs Everton in the Merseyside Derby is always a fiery occasion. Here's all you need to know ahead of tonight's EPL meeting.","content":"Liverpool vs Everton is always a fierce battle. Tonight in the EPL, they’ll contest the 242nd Merseyside Derby. Here’s a preview of the action. ICYMI: Cassius Mailula breaks amazing Sundowns record Liverpool vs Everton: previewing a key Merseyside Derby The Merseyside Derby has seen 22 EPL red cards, with 2 of those collected by Liverpool icon Steven Gerrard. No other EPL fixture has seen more. This derby has also produced more 90th-minute winning goals than any other H2H in the EPL, with all of these being scored by Liverpool – Ronny Rosenthal (1993), Gary McAllister (2001), Dirk Kuyt (2007), Sadio Mané (2016) and Divock Origi (2018). In other words, action is guaranteed. ICYMI: Is Benni McCarthy the most expensive South African footballer ever? Sean Dyche working wonders already at Everton The new Everton boss picked up a win in his first game at the helm, and it came against league leaders Arsenal. He could barely have asked for a trickier set of opening fixtures, but the ex-Burnley man enjoys a challenge. REVEALED: Why Vincent Kompany wanted to sign Lyle Foster so badly Liverpool in freefall The Reds have lost three of their last four EPL matches, drawing the other 0-0 with Chelsea. In that sample of games, they’ve scored just once. A They’ve also shipped three goals in three successive away league games for the first time since November and December 1993. Nothing is going right for Jurgen Klopp. After facing a Everton in the Merseyside Derby, Liverpool travel to Newcastle before a pair of meetings with Real Madrid and a battle with the fast-improving Manchester United. Things are getting trickier. What should we expect tonight at Anfield? For more insights, analysis and love for the beautiful game, hit up James Freemantle. Meanwhile, follow The South African on Twitter for up-to-the-minute news updates.","pubDate":"2023-02-13 12:16:58","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Missing PSL assistant referee found","link":"https://www.snl24.com/KickOff/SANews/Premiership/missing-psl-assistant-referee-found-20230213","keywords":null,"creator":null,"video_url":null,"description":"Assistant referee Tshepo Nojila is confirmed to have been found after being reported to have gone missing for a number of days.","content":"South African Football Association [SAFA] expressed concerns over the weekend over the whereabouts of Nojila who had reportedly gone missing. | The North West-born official was last seen by his girlfriend on Tuesday, 7 February 2023. A missing person's case was opened with the South African Police Service [SAPS] by the Nojila family. The match official disappeared with the rented vehicle he had hired to travel to a DStv Premiership match. Nojila was one of the assistant referees selected to officiate the KwaZulu-Natal derby between Lamontville Golden Arrows and Royal AM on February 4, 2023. Speaking to KickOff this morning, SAFA head of Referees Abdul Ebrahim confirmed that Nojila had been found. \"He's been found, he is safe and sound he is back home,\" Ebrahim tells . \"Everything should be fine, I haven't contacted the family as yet. \"But I've heard from the police, and they are certain everything is fine. \"He is unharmed, he is uninjured, the vehicle he was traveling in is fine as well. \"Probably during the course of today [Monday] I will get more information, but thank God he is safe, that is now the most important thing. \"All they said to me late last night was he is safe at home.\"","pubDate":"2023-02-13 12:10:43","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Lorch: What I Was Told","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Orlando-Pirates/orlando-pirates-star-thembinkosi-lorch-opens-up-on-his-long-awaited-return-from-injury-20230213","keywords":null,"creator":null,"video_url":null,"description":"Orlando Pirates talisman Thembinkosi Lorch has opened up about his long-awaited return from injury after he scored a vital goal in the win over All Stars in the Nedbank Cup.","content":"Orlando Pirates talisman Thembinkosi Lorch has opened up about his long-awaited return from injury after he scored a vital goal in the win over All Stars in the Nedbank Cup. Lorch has been out of the Pirates squad since August last year due to an injury that required surgery and after returning to training a couple of weeks ago, he finally made the bench for the first time since then in the Nedbank Cup last 32 clash against the Motsepe Foundation Championship side over the weekend. The Bafana Bafana attacker marked his return with a goal off the bench against All Stars, as the Buccaneers progressed with a 2-0 victory. The 29-year old says it was not easy dealing with being on the sidelines for so long but he's grateful for the support he got at the club. \"It wasn't easy for me, you know coming back from injury. I think I have five months not playing football but I want to thank my family for the support,\" Lorch told the club's media. \"And the technical team, they physios of the team for pushing me, it wasn't easy.\" Jose Riveiro's charges struggled to break down All Stars in the first stanza after the game went to the half-time break goalless but the Buccaneers had more energy and creativity after Lorch was introduced in the second stanza. Lorch went on to explain how he changed the game from the bench, as he had a hand in Monnapule Saleng breaking the deadlock just after the hour-mark before he put the game to bed ten minutes later. \"Sitting on the bench helped me a lot, I was watching that game, analyzing the game you know. I saw All Stars they were running all over, so the coach told me I must find the space, I must find the pocket,\" he continued. \"Even if you can check the first goal I was half space and then I passed to 'Dzvuka' (Terrence Dzvukamanja) and 'Dzvuka' crossed to Saleng. \"So ja it was important for me to score, especially coming back from injury, it's going to boost my confidence going forward,\" he said. Lorch, who had a loan spell at All Stars while they were still known as Cape Town All Stars back in 2015, also thanked the supporters for being behind him during his difficult period. \"I'd like to say to them they must keep on supporting, it's not easy to always get injured and come back stronger, their support means a lot to me,\" he added. You must be to read and post comments.","pubDate":"2023-02-13 12:10:23","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"🎥 | Kelce-broers in tranen na Super Bowl: ‘F*ck you he, gefeliciteerd’","link":"https://sportnieuws.nl/overig/american-football/nfl-super-bowl-lvii-broeders-bros-kelce-travis-jason-fuck-you-congrats-gefeliciteerd-mam-videos/","keywords":["American Football"],"creator":["Sportnieuws.nl"],"video_url":null,"description":"De eindstrijd om de Super Bowl 57 tussen Kansas City Chiefs en Philadelphia Eagles (38-35) was óók de broederstrijd tussen Jason en Travis Kelce. De 33-jarige Travis, tight end bij Chiefs, pakte zijn 2e Super Bowl-zege en kreeg na afloop de sportieve felicitaties van zijn broer. Center Jason Kelce was na afloop ontroostbaar, maar wel… Het bericht 🎥 | Kelce-broers in tranen na Super Bowl: ‘F*ck you he, gefeliciteerd’ verscheen eerst op Sportnieuws.","content":"De eindstrijd om de Super Bowl 57 tussen Kansas City Chiefs en Philadelphia Eagles ( 38-35 ) was óók de broederstrijd tussen Jason en Travis Kelce. De 33-jarige Travis, tight end bij Chiefs, pakte zijn 2e Super Bowl-zege en kreeg na afloop de sportieve felicitaties van zijn broer. ❤️ Chiefs TE Travis Kelce got emotional talking about beating his brother Eagles center Jason Kelce 💚 #SuperBowl pic.twitter.com/UcDpE9GHYZ Mom's always there. 💚 @JasonKelce @DKelce1 pic.twitter.com/lDA2dLhx3W Jason Kelce's full quote on the emotions of losing to his brother Travis' team: \"I don't know, maybe it hasn't hit me yet. I was real emotional when I saw my Mom and Dad. Trav -- I was not too emotional, obviously. 'Fuck you, congratulations.' Nah, I think it's awesome.","pubDate":"2023-02-13 11:35:52","image_url":null,"source_id":"sportnieuws","category":["sports"],"country":["netherland"],"language":"dutch"},{"title":"‘Pirates must go back to where they belong’ – Ncikazi","link":"https://www.citizen.co.za/sport/soccer/local-soccer/pirates-must-go-back-to-where-they-belong-ncikazi/","keywords":["Local Soccer","CAF Champions league","Caf Confederation Cup","DStv Premiership","mandla ncikazi","Orlando Pirates"],"creator":["Tshepo Ntsoelengoe"],"video_url":null,"description":"Pirates sauntered into the last 16 round of the Nedbank Cup after beating All Stars.","content":"With a spot in the next round of the Nedbank Cup secured, Orlando Pirates assistant coach Mandla Ncikazi revealed that the team’s main objective is to ensure that they get back to playing in Caf club competitions next season. ALSO READ: Gallants begin Confed Cup group campaign win convincing win The Bucs assistant coach emphasised that playing in either the Caf Confederation Cup or the Caf Champions League is the team’s priority this season. Pirates increased their chances of getting back to continental competition when they edged All Stars FC 2-0 at the Wits Football Stadium on Saturday to go into the last 16 of the Ke Yona Cup. The Soweto giants are aiming to winning the Nedbank Cup, which guarantees in the Confederation Cup, especially with the race for a second place and third place finish in the DStv Premiership looking extremely intense at the moment. Bucs are in fourth place on thestandings with 28 points, three points behind third placed Richards Bay FC for the Confederation Cup spot and four points behind second-placed SuperSport United. Nickazi emphasized the need for the club to do well and says injuries in the team have been derailing their progress. “Pirates must go back to where they belong. Pirates belong in the Champions League and winning trophies. That’s the challenge that we want to overcome. We must get back to that. Injuries haven’t been kind, but like other teams, we are working on that,” Ncikazi said after the All Stars match. Meanwhile, while Pirates managed to get a victory against All Stars, they had to finish the game without head coach Jose Riveiro on the bench, after he was sent off by referee Xola Sitela. Ncikazi says he wasn’t exactly sure what led to the red card and he didn’t get an explanation from the match officials. “I am not exactly sure what happened to the coach. I tried to speak to the officials. But I think their protocol doesn’t allow them to speak,” the Bucs assistant added. READ MORE: Tough games help Sundowns grow, says Mokwena The Buccaneers have to shift their focus back to the league now, with a clash against Maritzburg United at the Orlando Stadium on Friday.","pubDate":"2023-02-13 11:20:15","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/Mandla-Ncikazi-2.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Das war Super Bowl LVII: Kansas City Chiefs, Mahomes, Rihanna und großes Spektakel","link":"https://www.tt.com/artikel/30845948/das-war-super-bowl-lvii-kansas-city-chiefs-mahomes-rihanna-und-grosses-spektakel","keywords":["Sport","Sport Report"],"creator":["Michael Pipal"],"video_url":null,"description":"Dieser Super Bowl wird in Erinnerung bleiben: 73 Punkte erzielen die Kansas City Chiefs und die Philadelphia Eagles. Am Ende gibt es den zweiten Sieg für die Chiefs binnen vier Jahren.","content":"Dieser Super Bowl wird in Erinnerung bleiben: 73 Punkte erzielen die Kansas City Chiefs und die Philadelphia Eagles. Am Ende gibt es den zweiten Sieg für die Chiefs binnen vier Jahren. Und ein fulminantes Comeback von Rihanna in der Halftime-Show. Glendale – Nach dem Triumph in einem der spektakulärsten Super Bowls der Geschichte gaben Patrick Mahomes und Travis Kelce die Vorsänger für die Fans der Kansas City Chiefs. Mit der Vince Lombardi Trophy in der Hand und im Konfetti-Regen brüllten die beiden wichtigsten Football-Stars der Chiefs ihre Freude über das 38:35 gegen die Philadelphia Eagles ins Mikrofon und bekamen einen Chor zur Antwort. „Wir sind Super-Bowl-Champion. Let's go“, rief der überragende Quarterback Mahomes am Sonntagabend (Ortszeit) auf der kleinen Bühne im State Farm Stadium. Seit sechs Jahren spielt der 27-Jährige in der NFL und ist nun bereits zwei Mal Super-Bowl-Champion, zweimal wertvollster Spieler der Partie und zweimal wertvollster Spieler der Hauptrunde. „Das ist Pat Mahomes“, schrie sein kongenialer Partner Kelce - und stimmte „Fight for Your Right“ von den Beastie Boys an. Kurz vor der Halbzeit war Mahomes noch angeschlagen vom Feld gehumpelt, und führte die Chiefs danach zum insgesamt dritten Super-Bowl-Triumph der Team-Historie. Kicker Harrison Butker entschied die Partie mit einem Field Goal acht Sekunden vor Schluss. Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Die Party-Nacht hatten sich die Chiefs mit einem Comeback verdient, wie es es zuvor in einem Super Bowl erst einmal gegeben hatte. 14:24 stand es zur Pause, einen zweistelligen Rückstand zur Halbzeit hatte in zuvor 30 Fällen nur eine Mannschaft noch gedreht. Zunächst sorgte Rihanna mit ihrem Comeback-Auftritt bei der Halbzeitshow und danach mit der Nachricht ihrer zweiten Schwangerschaft für Furore – anschließend lieferten Mahomes & Co. die große Gala. Zweites Kind für Popstar Auch weil die Chiefs aus den ersten drei Angriffs-Serien nach der Pause drei Touchdowns machten, blieb die herausragende Leistung von Eagles-Quarterback Jalen Hurts ungekrönt. Seine drei Läufe für einen Touchdown und dazu ein Touchdown-Pass waren dennoch ein Super-Bowl-Bestwert. „Philadelphia hatte ein großartiges Spiel. Aber wir sind die Chieeeeeeeeeefs“, feixte Trainer Andy Reid bei der Siegerehrung. Mahomes mit seinen drei Touchdownpässen sei „phänomenal“ gewesen. „Er ist der MVP. Mehr muss man nicht sagen. Das hat er heute gezeigt.“ Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Vor seiner Ehrung als wertvollster Spieler des Super Bowls war Mahomes vergangene Woche schon als wertvollster Spieler der Hauptrunde ausgezeichnet worden. Er ist nun der erste Profi seit 1999, der in einer Saison den Super Bowl und den MVP-Titel gewonnen hat. Für Chiefs-Trainer Reid war es ebenfalls der zweite Sieg im Super Bowl. Die Eagles hatten die Vince Lombardi Trophy zum bislang einzigen Mal 2018 gewonnen. Gewinnspiel: 5x € 500,- Intersport-Gutschein und 20 x All4Lunch-Set TT-ePaper 4 Wochen gratis ausprobieren, ohne automatische Verlängerung Die Partie bot von Anfang an großes Spektakel. Jeweils mit der ersten Angriffs-Serie erzielten die Eagles und Chiefs einen Touchdown. Das hatte es 25 Jahre lang nicht mehr in einem Super Bowl gegeben. Die Fans und Promis um LeBron James, Jay-Z und Paul McCartney kamen früh auf ihre Kosten. Bei den Eagles vollendete der 24 Jahre alte Hurts zum Start in die Partie mit einem kurzen Lauf, bei den Chiefs war Kelce der Empfänger eines langen Wurfs von Mahomes. Die Eagles kontrollierten Ball und Uhr und nutzten die Entscheidung der Chiefs aus, die trotz des gewonnenen Münzwurfs auf den ersten Ballbesitz verzichtet hatten. Die Konsequenz: Mahomes und seine Angreifer hatten den Football nur gut 8 der ersten 24 Minuten und mussten lange von der Seitenlinie aus zuschauen. Sie sahen einen herausragend gefangenen Pass von AJ Brown über 45 Yards und die erneute Führung für die Eagles. Ein an den Pfosten gesetztes Field Goal der Chiefs war ein weiterer Dämpfer für die akustisch klar unterlegenen Fans der Chiefs. Die Anhänger von Kansas City konnten allerdings einen Ballverlust von Eagles-Quarterback Hurts bejubeln, den Nick Bolton zu einem Touchdown nutzte. Vor der Pause holten sich die Eagles durch einen weiteren Lauf von Hurts noch einen Touchdown und ein Field Goal und gingen mit zehn Punkten Vorsprung in die Halbzeit. „Wir wussten, dass wir nicht unser bestes Spiel gespielt haben, wir nicht so hart gespielt haben, wie wir wollten“, sagte Kelce. „In der zweiten Halbzeit haben wir es besser gemacht und sind durch die Gegend geflogen.“ Nach Jahren ohne Auftritt hat sich Pop-Superstar Rihanna mit einer fulminanten Halbzeitshow bei der Super Bowl zurückgemeldet. Bei dem Medley während des Finales der NFL reihte die 34-Jährige am Sonntagabend (Ortszeit) ihre größten Hits aneinander. Bei „Bitch Better Have My Money“ schwebten sie und ihre Tänzerinnen und Tänzer auf bewegbaren Bühnen im Stadion. Ihren Superhit „We Found Love“ performte die Sängerin aus Barbados ganz in rot, um sie herum in weiß gekleidete Tänzerinnen und Tänzer. 📽️ Link | Die komplette Halbzeitshow von Rihanna Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Hurts hatte zu diesem Zeitpunkt in einem Super Bowl voller historischer Premieren sein eigenes Kapitel bereits mit einem Ausrufezeichen versehen. Er und Mahomes sind das erste Duo schwarzer Quarterbacks in einem Super Bowl und gemeinsam auch das jüngste. Ebenfalls nie zuvor gab es ein Brüder-Duell: Travis Kelce von den Chiefs und Jason Kelce von den Eagles änderten das in Arizona. Mit nun zwei Siegen im wichtigsten Football-Spiel der Welt hat Travis Kelce, der jüngere der beiden Brüder nun die „ultimativen Angeber-Rechte“, wie sein älterer Bruder bereits zu Beginn der Woche angekündigt hatte. (TT.com, dpa) Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können.","pubDate":"2023-02-13 11:13:06","image_url":null,"source_id":"tt","category":["sports"],"country":["austria"],"language":"german"},{"title":"Snl24.com | Chiefs trialist: 'If Chiefs want me to come'…","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/chiefs-trialist-if-chiefs-want-me-to-come-20230213","keywords":null,"creator":null,"video_url":null,"description":"Mozambican international Stanley Ratifo who recently underwent an assessment at Kaizer Chiefs has revealed details on his time spent at Naturena after returning to Europe.","content":"Ratifo (28) has played all of his club career football in the German lower divisions with his current club being 1.CfR Pforzheim who play in the Oberliga Baden-Wurternberg (fifth tier league). | He has now disclosed how he came to spend time at Chiefs along with teammate Maurizio Macorig, Amansio Joao Pita ‘Neymar’ Canhembe, and Christian Saile Basomboli who has since been signed. \"After the Rwanda and Mozambique game (AFCON qualifier played at FNB Stadium last year) in South Africa I was told by Rui Frois (agent) that Kaizer Chiefs had shown some interest,\" Ratifo tells from Germany. \"So, I came back to Germany and was talking to my agent who I connected with Rui. \"It was then that they spoke about the situation. \"The experience at Chiefs was very nice as they have a lot of good players with quality. \"The tempo in the training sessions was very intense while the structure of the club was amazing. \"I still imagine myself playing in South Africa because I have African blood and I feel good in Africa. \"I don’t know why the transfer didn’t happen. \"This is not my decision. \"I was ready to join this amazing club, but we respect the decision of the club and I wish them the best. \"If Chiefs want me to come it will be a pleasure to join this club,\" says Ratifo who has scored four goals this season for his club. You must be to read and post comments. Click here to register:","pubDate":"2023-02-13 11:12:56","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | SSU CEO: We're All Upset & Embarrassed","link":"https://www.snl24.com/soccerladuma/Local/Premiership/SuperSport-Utd/supersport-united-ceo-stan-matthews-dondol-stars-came-in-two-quantum-bakkies-my-boys-in-a-60-seater-luxury-bus-20230213","keywords":null,"creator":null,"video_url":null,"description":"SuperSport United CEO Stan Matthews has weighed in on the \"worst result in the history of the club\" after their shock elimination in the Nedbank Cup to third-tier side Dondol Stars.","content":"Matthews says they \"underestimated\" Stars, who are actually from Tshwane in Mamelodi, by fielding a weakened team and that the defeat left them \"upset and embarrassed\". \"Hats off to them, they came away from home to the team that's coming second in the PSL, they showed tremendous spirit and fight, they brought a little band of supporters,\" Matthews said on . \"They came in their two quantum bakkies and they showed they wanted the game more than my boys who came in a luxury 60-seater bus, so you know as much as it is disappointing, definitely the worst result in the history of the football club. \"Our lowest moment to lose to a team in a third tier, it's not something everybody in the club is proud about, we're all pretty upset and in a small way embarrassed,\" he said. \"But again I don't wanna take away what they brought to the party, they brought an element of surprise to us, we underestimated them. We took a calculated gamble of fielding a weaker team and giving some of the fringe players a chance to show what they can do.\" Matthews, however, consoled himself with the fact that his side is not the first club to lose to a lower league side in the Nedbank Cup, as even big teams such as Kaizer Chiefs and Orlando Pirates have suffered such upsets over the years. \"So we have to take that on the chin, we're not the first team to lose in the Nedbank Cup in a David and Goliath fashion, over the years I can recall Vaal University of Technology knocking out Golden Arrows,\" he continued. You must be to read and post comments.","pubDate":"2023-02-13 13:37:48","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Barca to make big change for iconic No. 10 shirt?","link":"https://www.snl24.com/KickOff/WorldNews/FC-Barcelona/fc-barcelona-to-make-big-change-for-iconic-ansu-fati-no-10-shirt-20230213","keywords":null,"creator":null,"video_url":null,"description":"FC Barcelona are reportedly considering making a big change regarding their iconic No. 10 shirt, which is said to have lost its appeal since Ansu Fati inherited it from Lionel Messi.","content":"The jersey has previously been donned by a number of footballing legends at the Camp Nou, including Messi, Ronaldinho, Romario, and Diego Maradona. In August 2021, the seven-time Ballon d'Or winner left the Blaugrana after his contract had expired, bringing his 20-year association with the club to an acrimonious end after he was promised a renewal. Fati, who broke into Barca's senior team in 2019 at the age of just 16, inherited the famous shirt number after the Argentine joined Paris Saint-Germain, with the young Spanish attacker widely considered at the time to be the next big talent to emerge from the LaLiga club.","pubDate":"2023-02-13 13:37:48","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"TOP 20: Waa Kuwee Kooxaha Ugu Koobabka Badan Adduunyada Kaddib Guushii Real Madrid Ee Club World Cup?","link":"https://laacibnet.net/somali/top-20-waa-kuwee-kooxaha-ugu-koobabka-badan-adduunyada-kaddib-guushii-real-madrid-ee-club-world-cup/","keywords":["Wararka Ciyaaraha","Wararka La Liga","Wararka Premier League"],"creator":["Abdiwahab Ahmed"],"video_url":null,"description":"Real Madrid ayaa Sabtidii ku guuleystay koobka naadiyada dunida ee Club World Cup, kaddib markii ay 5-3 ku karbaashtay kooxda reer Sucuudi Carabia ee Al Hilal oo ay isku haleen garoonka Prince Moulay Abdellah Stadium ee magalada Rabat ee waddanka Morocco. Koobkan ayaa ahaa midkii 98aad ee ay ku guuleysato Real Madrid intii ay dhisnayd, […]","content":"Real Madrid ayaa Sabtidii ku guuleystay koobka naadiyada dunida ee Club World Cup, kaddib markii ay 5-3 ku karbaashtay kooxda reer Sucuudi Carabia ee Al Hilal oo ay isku haleen garoonka Prince Moulay Abdellah Stadium ee magalada Rabat ee waddanka Morocco. Koobkan ayaa ahaa midkii 98aad ee ay ku guuleysato Real Madrid intii ay dhisnayd, waxaanay laba gool u jirtaa inay buuxiso tiro saddex-godle koobab ah. Lakiin haddana uma dhowa inay noqoto kooxda ugu koobabka badan adduunyada, waxaana ka horreeya kooxo badan. Warbixinta muujinaysa sida ay kooxaha adduunyadu ugu kala guuleysteen koobabka oo la daabacay sannadkii hore, isla markaana la cusboonaysiiyey kaddib koobabkii xilli ciyaareedkan la kala qaaday, ayaa waxay liiska kooxaha ugu koobabka badan ay kaga jirtaa booska lixaad. Waxa ka horreeya Atletico Penarol oo ka dhisan waddanka Uruguay oo 110 koob ku guuleysatay, Celtic oo 113 koob haysata, Rangers oo 116 koob ku guuleysatay iyo Club Nacional de Football oo reer Uruguay ah oo 117 koob urursatay sannado ay koobabka dalkaas ay guranaysay. Kooxda aan la gaadhi karin ee adduunyada oo dhan ugu koobabka badan waa Al Ahly oo reer Masar ah oo 121 koob ku guuleysatay. Halkan kaga bogo 20ka kooxood ee ugu koobabka badan adduunyada: =20. Club Olimpia (Paraguay) – 56 koob =20. Boca Juniors (Argentina) – 57 koob =18. FCSB (Romania) – 60 koob =18. Anderlecht (Belgium) – 60 koob =16. Galatasaray (Turkey) – 62 koob =15. Liverpool (England) – 66 koob =15. Manchester United (England) – 66 koob 14. Juventus (Italy) – 67 koob 13. Ajax (Netherlands) – 73 koob 12. Porto (Portugal) – 78 koob 11. Olympiacos (Greece) – 79 koob 10. Bayern Munich (Germany) – 82 koob =9. Al-Faisaly (Jordan) – 83 koob =8. Benfica (Portugal) – 83 koob 7. Barcelona (Spain) – 93 koob 6. Real Madrid (Spain) – 98 koob 5. Atletico Penarol (Uruguay) – 110 koob 4. Celtic (Scotland) – 113 koob 3. Rangers (Scotland) – 116 koob 2. Club Nacional de Football (Uruguay) – 117 koob 1. Al Ahly (Egypt) – 121 koob","pubDate":"2023-02-13 13:20:18","image_url":null,"source_id":"laacibnet","category":["sports"],"country":["somalia"],"language":"Somali"},{"title":"Liverpool vs Everton: Previewing the 242nd Merseyside Derby","link":"https://www.thesouthafrican.com/sport/soccer/epl/liverpool-vs-everton-previewing-the-242nd-merseyside-derby-epl-13-february-2023/","keywords":["English Premier League","Everton","Featured","Liverpool","Liverpool v Everton","Premier League"],"creator":["James Freemantle"],"video_url":null,"description":"Liverpool vs Everton in the Merseyside Derby is always a fiery occasion. Here's all you need to know ahead of tonight's EPL meeting.","content":"Liverpool vs Everton is always a fierce battle. Tonight in the EPL, they’ll contest the 242nd Merseyside Derby. Here’s a preview of the action. ICYMI: Cassius Mailula breaks amazing Sundowns record Liverpool vs Everton: previewing a key Merseyside Derby The Merseyside Derby has seen 22 EPL red cards, with 2 of those collected by Liverpool icon Steven Gerrard. No other EPL fixture has seen more. This derby has also produced more 90th-minute winning goals than any other H2H in the EPL, with all of these being scored by Liverpool – Ronny Rosenthal (1993), Gary McAllister (2001), Dirk Kuyt (2007), Sadio Mané (2016) and Divock Origi (2018). In other words, action is guaranteed. ICYMI: Is Benni McCarthy the most expensive South African footballer ever? Sean Dyche working wonders already at Everton The new Everton boss picked up a win in his first game at the helm, and it came against league leaders Arsenal. He could barely have asked for a trickier set of opening fixtures, but the ex-Burnley man enjoys a challenge. REVEALED: Why Vincent Kompany wanted to sign Lyle Foster so badly Liverpool in freefall The Reds have lost three of their last four EPL matches, drawing the other 0-0 with Chelsea. In that sample of games, they’ve scored just once. A They’ve also shipped three goals in three successive away league games for the first time since November and December 1993. Nothing is going right for Jurgen Klopp. After facing a Everton in the Merseyside Derby, Liverpool travel to Newcastle before a pair of meetings with Real Madrid and a battle with the fast-improving Manchester United. Things are getting trickier. What should we expect tonight at Anfield? For more insights, analysis and love for the beautiful game, hit up James Freemantle. Meanwhile, follow The South African on Twitter for up-to-the-minute news updates.","pubDate":"2023-02-13 12:16:58","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Missing PSL assistant referee found","link":"https://www.snl24.com/KickOff/SANews/Premiership/missing-psl-assistant-referee-found-20230213","keywords":null,"creator":null,"video_url":null,"description":"Assistant referee Tshepo Nojila is confirmed to have been found after being reported to have gone missing for a number of days.","content":"South African Football Association [SAFA] expressed concerns over the weekend over the whereabouts of Nojila who had reportedly gone missing. | The North West-born official was last seen by his girlfriend on Tuesday, 7 February 2023. A missing person's case was opened with the South African Police Service [SAPS] by the Nojila family. The match official disappeared with the rented vehicle he had hired to travel to a DStv Premiership match. Nojila was one of the assistant referees selected to officiate the KwaZulu-Natal derby between Lamontville Golden Arrows and Royal AM on February 4, 2023. Speaking to KickOff this morning, SAFA head of Referees Abdul Ebrahim confirmed that Nojila had been found. \"He's been found, he is safe and sound he is back home,\" Ebrahim tells . \"Everything should be fine, I haven't contacted the family as yet. \"But I've heard from the police, and they are certain everything is fine. \"He is unharmed, he is uninjured, the vehicle he was traveling in is fine as well. \"Probably during the course of today [Monday] I will get more information, but thank God he is safe, that is now the most important thing. \"All they said to me late last night was he is safe at home.\"","pubDate":"2023-02-13 12:10:43","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Lorch: What I Was Told","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Orlando-Pirates/orlando-pirates-star-thembinkosi-lorch-opens-up-on-his-long-awaited-return-from-injury-20230213","keywords":null,"creator":null,"video_url":null,"description":"Orlando Pirates talisman Thembinkosi Lorch has opened up about his long-awaited return from injury after he scored a vital goal in the win over All Stars in the Nedbank Cup.","content":"Orlando Pirates talisman Thembinkosi Lorch has opened up about his long-awaited return from injury after he scored a vital goal in the win over All Stars in the Nedbank Cup. Lorch has been out of the Pirates squad since August last year due to an injury that required surgery and after returning to training a couple of weeks ago, he finally made the bench for the first time since then in the Nedbank Cup last 32 clash against the Motsepe Foundation Championship side over the weekend. The Bafana Bafana attacker marked his return with a goal off the bench against All Stars, as the Buccaneers progressed with a 2-0 victory. The 29-year old says it was not easy dealing with being on the sidelines for so long but he's grateful for the support he got at the club. \"It wasn't easy for me, you know coming back from injury. I think I have five months not playing football but I want to thank my family for the support,\" Lorch told the club's media. \"And the technical team, they physios of the team for pushing me, it wasn't easy.\" Jose Riveiro's charges struggled to break down All Stars in the first stanza after the game went to the half-time break goalless but the Buccaneers had more energy and creativity after Lorch was introduced in the second stanza. Lorch went on to explain how he changed the game from the bench, as he had a hand in Monnapule Saleng breaking the deadlock just after the hour-mark before he put the game to bed ten minutes later. \"Sitting on the bench helped me a lot, I was watching that game, analyzing the game you know. I saw All Stars they were running all over, so the coach told me I must find the space, I must find the pocket,\" he continued. \"Even if you can check the first goal I was half space and then I passed to 'Dzvuka' (Terrence Dzvukamanja) and 'Dzvuka' crossed to Saleng. \"So ja it was important for me to score, especially coming back from injury, it's going to boost my confidence going forward,\" he said. Lorch, who had a loan spell at All Stars while they were still known as Cape Town All Stars back in 2015, also thanked the supporters for being behind him during his difficult period. \"I'd like to say to them they must keep on supporting, it's not easy to always get injured and come back stronger, their support means a lot to me,\" he added. You must be to read and post comments.","pubDate":"2023-02-13 12:10:23","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"🎥 | Kelce-broers in tranen na Super Bowl: ‘F*ck you he, gefeliciteerd’","link":"https://sportnieuws.nl/overig/american-football/nfl-super-bowl-lvii-broeders-bros-kelce-travis-jason-fuck-you-congrats-gefeliciteerd-mam-videos/","keywords":["American Football"],"creator":["Sportnieuws.nl"],"video_url":null,"description":"De eindstrijd om de Super Bowl 57 tussen Kansas City Chiefs en Philadelphia Eagles (38-35) was óók de broederstrijd tussen Jason en Travis Kelce. De 33-jarige Travis, tight end bij Chiefs, pakte zijn 2e Super Bowl-zege en kreeg na afloop de sportieve felicitaties van zijn broer. Center Jason Kelce was na afloop ontroostbaar, maar wel… Het bericht 🎥 | Kelce-broers in tranen na Super Bowl: ‘F*ck you he, gefeliciteerd’ verscheen eerst op Sportnieuws.","content":"De eindstrijd om de Super Bowl 57 tussen Kansas City Chiefs en Philadelphia Eagles ( 38-35 ) was óók de broederstrijd tussen Jason en Travis Kelce. De 33-jarige Travis, tight end bij Chiefs, pakte zijn 2e Super Bowl-zege en kreeg na afloop de sportieve felicitaties van zijn broer. ❤️ Chiefs TE Travis Kelce got emotional talking about beating his brother Eagles center Jason Kelce 💚 #SuperBowl pic.twitter.com/UcDpE9GHYZ Mom's always there. 💚 @JasonKelce @DKelce1 pic.twitter.com/lDA2dLhx3W Jason Kelce's full quote on the emotions of losing to his brother Travis' team: \"I don't know, maybe it hasn't hit me yet. I was real emotional when I saw my Mom and Dad. Trav -- I was not too emotional, obviously. 'Fuck you, congratulations.' Nah, I think it's awesome.","pubDate":"2023-02-13 11:35:52","image_url":null,"source_id":"sportnieuws","category":["sports"],"country":["netherland"],"language":"dutch"},{"title":"‘Pirates must go back to where they belong’ – Ncikazi","link":"https://www.citizen.co.za/sport/soccer/local-soccer/pirates-must-go-back-to-where-they-belong-ncikazi/","keywords":["Local Soccer","CAF Champions league","Caf Confederation Cup","DStv Premiership","mandla ncikazi","Orlando Pirates"],"creator":["Tshepo Ntsoelengoe"],"video_url":null,"description":"Pirates sauntered into the last 16 round of the Nedbank Cup after beating All Stars.","content":"With a spot in the next round of the Nedbank Cup secured, Orlando Pirates assistant coach Mandla Ncikazi revealed that the team’s main objective is to ensure that they get back to playing in Caf club competitions next season. ALSO READ: Gallants begin Confed Cup group campaign win convincing win The Bucs assistant coach emphasised that playing in either the Caf Confederation Cup or the Caf Champions League is the team’s priority this season. Pirates increased their chances of getting back to continental competition when they edged All Stars FC 2-0 at the Wits Football Stadium on Saturday to go into the last 16 of the Ke Yona Cup. The Soweto giants are aiming to winning the Nedbank Cup, which guarantees in the Confederation Cup, especially with the race for a second place and third place finish in the DStv Premiership looking extremely intense at the moment. Bucs are in fourth place on thestandings with 28 points, three points behind third placed Richards Bay FC for the Confederation Cup spot and four points behind second-placed SuperSport United. Nickazi emphasized the need for the club to do well and says injuries in the team have been derailing their progress. “Pirates must go back to where they belong. Pirates belong in the Champions League and winning trophies. That’s the challenge that we want to overcome. We must get back to that. Injuries haven’t been kind, but like other teams, we are working on that,” Ncikazi said after the All Stars match. Meanwhile, while Pirates managed to get a victory against All Stars, they had to finish the game without head coach Jose Riveiro on the bench, after he was sent off by referee Xola Sitela. Ncikazi says he wasn’t exactly sure what led to the red card and he didn’t get an explanation from the match officials. “I am not exactly sure what happened to the coach. I tried to speak to the officials. But I think their protocol doesn’t allow them to speak,” the Bucs assistant added. READ MORE: Tough games help Sundowns grow, says Mokwena The Buccaneers have to shift their focus back to the league now, with a clash against Maritzburg United at the Orlando Stadium on Friday.","pubDate":"2023-02-13 11:20:15","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/Mandla-Ncikazi-2.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Das war Super Bowl LVII: Kansas City Chiefs, Mahomes, Rihanna und großes Spektakel","link":"https://www.tt.com/artikel/30845948/das-war-super-bowl-lvii-kansas-city-chiefs-mahomes-rihanna-und-grosses-spektakel","keywords":["Sport","Sport Report"],"creator":["Michael Pipal"],"video_url":null,"description":"Dieser Super Bowl wird in Erinnerung bleiben: 73 Punkte erzielen die Kansas City Chiefs und die Philadelphia Eagles. Am Ende gibt es den zweiten Sieg für die Chiefs binnen vier Jahren.","content":"Dieser Super Bowl wird in Erinnerung bleiben: 73 Punkte erzielen die Kansas City Chiefs und die Philadelphia Eagles. Am Ende gibt es den zweiten Sieg für die Chiefs binnen vier Jahren. Und ein fulminantes Comeback von Rihanna in der Halftime-Show. Glendale – Nach dem Triumph in einem der spektakulärsten Super Bowls der Geschichte gaben Patrick Mahomes und Travis Kelce die Vorsänger für die Fans der Kansas City Chiefs. Mit der Vince Lombardi Trophy in der Hand und im Konfetti-Regen brüllten die beiden wichtigsten Football-Stars der Chiefs ihre Freude über das 38:35 gegen die Philadelphia Eagles ins Mikrofon und bekamen einen Chor zur Antwort. „Wir sind Super-Bowl-Champion. Let's go“, rief der überragende Quarterback Mahomes am Sonntagabend (Ortszeit) auf der kleinen Bühne im State Farm Stadium. Seit sechs Jahren spielt der 27-Jährige in der NFL und ist nun bereits zwei Mal Super-Bowl-Champion, zweimal wertvollster Spieler der Partie und zweimal wertvollster Spieler der Hauptrunde. „Das ist Pat Mahomes“, schrie sein kongenialer Partner Kelce - und stimmte „Fight for Your Right“ von den Beastie Boys an. Kurz vor der Halbzeit war Mahomes noch angeschlagen vom Feld gehumpelt, und führte die Chiefs danach zum insgesamt dritten Super-Bowl-Triumph der Team-Historie. Kicker Harrison Butker entschied die Partie mit einem Field Goal acht Sekunden vor Schluss. Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Die Party-Nacht hatten sich die Chiefs mit einem Comeback verdient, wie es es zuvor in einem Super Bowl erst einmal gegeben hatte. 14:24 stand es zur Pause, einen zweistelligen Rückstand zur Halbzeit hatte in zuvor 30 Fällen nur eine Mannschaft noch gedreht. Zunächst sorgte Rihanna mit ihrem Comeback-Auftritt bei der Halbzeitshow und danach mit der Nachricht ihrer zweiten Schwangerschaft für Furore – anschließend lieferten Mahomes & Co. die große Gala. Zweites Kind für Popstar Auch weil die Chiefs aus den ersten drei Angriffs-Serien nach der Pause drei Touchdowns machten, blieb die herausragende Leistung von Eagles-Quarterback Jalen Hurts ungekrönt. Seine drei Läufe für einen Touchdown und dazu ein Touchdown-Pass waren dennoch ein Super-Bowl-Bestwert. „Philadelphia hatte ein großartiges Spiel. Aber wir sind die Chieeeeeeeeeefs“, feixte Trainer Andy Reid bei der Siegerehrung. Mahomes mit seinen drei Touchdownpässen sei „phänomenal“ gewesen. „Er ist der MVP. Mehr muss man nicht sagen. Das hat er heute gezeigt.“ Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Vor seiner Ehrung als wertvollster Spieler des Super Bowls war Mahomes vergangene Woche schon als wertvollster Spieler der Hauptrunde ausgezeichnet worden. Er ist nun der erste Profi seit 1999, der in einer Saison den Super Bowl und den MVP-Titel gewonnen hat. Für Chiefs-Trainer Reid war es ebenfalls der zweite Sieg im Super Bowl. Die Eagles hatten die Vince Lombardi Trophy zum bislang einzigen Mal 2018 gewonnen. Gewinnspiel: 5x € 500,- Intersport-Gutschein und 20 x All4Lunch-Set TT-ePaper 4 Wochen gratis ausprobieren, ohne automatische Verlängerung Die Partie bot von Anfang an großes Spektakel. Jeweils mit der ersten Angriffs-Serie erzielten die Eagles und Chiefs einen Touchdown. Das hatte es 25 Jahre lang nicht mehr in einem Super Bowl gegeben. Die Fans und Promis um LeBron James, Jay-Z und Paul McCartney kamen früh auf ihre Kosten. Bei den Eagles vollendete der 24 Jahre alte Hurts zum Start in die Partie mit einem kurzen Lauf, bei den Chiefs war Kelce der Empfänger eines langen Wurfs von Mahomes. Die Eagles kontrollierten Ball und Uhr und nutzten die Entscheidung der Chiefs aus, die trotz des gewonnenen Münzwurfs auf den ersten Ballbesitz verzichtet hatten. Die Konsequenz: Mahomes und seine Angreifer hatten den Football nur gut 8 der ersten 24 Minuten und mussten lange von der Seitenlinie aus zuschauen. Sie sahen einen herausragend gefangenen Pass von AJ Brown über 45 Yards und die erneute Führung für die Eagles. Ein an den Pfosten gesetztes Field Goal der Chiefs war ein weiterer Dämpfer für die akustisch klar unterlegenen Fans der Chiefs. Die Anhänger von Kansas City konnten allerdings einen Ballverlust von Eagles-Quarterback Hurts bejubeln, den Nick Bolton zu einem Touchdown nutzte. Vor der Pause holten sich die Eagles durch einen weiteren Lauf von Hurts noch einen Touchdown und ein Field Goal und gingen mit zehn Punkten Vorsprung in die Halbzeit. „Wir wussten, dass wir nicht unser bestes Spiel gespielt haben, wir nicht so hart gespielt haben, wie wir wollten“, sagte Kelce. „In der zweiten Halbzeit haben wir es besser gemacht und sind durch die Gegend geflogen.“ Nach Jahren ohne Auftritt hat sich Pop-Superstar Rihanna mit einer fulminanten Halbzeitshow bei der Super Bowl zurückgemeldet. Bei dem Medley während des Finales der NFL reihte die 34-Jährige am Sonntagabend (Ortszeit) ihre größten Hits aneinander. Bei „Bitch Better Have My Money“ schwebten sie und ihre Tänzerinnen und Tänzer auf bewegbaren Bühnen im Stadion. Ihren Superhit „We Found Love“ performte die Sängerin aus Barbados ganz in rot, um sie herum in weiß gekleidete Tänzerinnen und Tänzer. 📽️ Link | Die komplette Halbzeitshow von Rihanna Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Hurts hatte zu diesem Zeitpunkt in einem Super Bowl voller historischer Premieren sein eigenes Kapitel bereits mit einem Ausrufezeichen versehen. Er und Mahomes sind das erste Duo schwarzer Quarterbacks in einem Super Bowl und gemeinsam auch das jüngste. Ebenfalls nie zuvor gab es ein Brüder-Duell: Travis Kelce von den Chiefs und Jason Kelce von den Eagles änderten das in Arizona. Mit nun zwei Siegen im wichtigsten Football-Spiel der Welt hat Travis Kelce, der jüngere der beiden Brüder nun die „ultimativen Angeber-Rechte“, wie sein älterer Bruder bereits zu Beginn der Woche angekündigt hatte. (TT.com, dpa) Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können.","pubDate":"2023-02-13 11:13:06","image_url":null,"source_id":"tt","category":["sports"],"country":["austria"],"language":"german"},{"title":"Snl24.com | Chiefs trialist: 'If Chiefs want me to come'…","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/chiefs-trialist-if-chiefs-want-me-to-come-20230213","keywords":null,"creator":null,"video_url":null,"description":"Mozambican international Stanley Ratifo who recently underwent an assessment at Kaizer Chiefs has revealed details on his time spent at Naturena after returning to Europe.","content":"Ratifo (28) has played all of his club career football in the German lower divisions with his current club being 1.CfR Pforzheim who play in the Oberliga Baden-Wurternberg (fifth tier league). | He has now disclosed how he came to spend time at Chiefs along with teammate Maurizio Macorig, Amansio Joao Pita ‘Neymar’ Canhembe, and Christian Saile Basomboli who has since been signed. \"After the Rwanda and Mozambique game (AFCON qualifier played at FNB Stadium last year) in South Africa I was told by Rui Frois (agent) that Kaizer Chiefs had shown some interest,\" Ratifo tells from Germany. \"So, I came back to Germany and was talking to my agent who I connected with Rui. \"It was then that they spoke about the situation. \"The experience at Chiefs was very nice as they have a lot of good players with quality. \"The tempo in the training sessions was very intense while the structure of the club was amazing. \"I still imagine myself playing in South Africa because I have African blood and I feel good in Africa. \"I don’t know why the transfer didn’t happen. \"This is not my decision. \"I was ready to join this amazing club, but we respect the decision of the club and I wish them the best. \"If Chiefs want me to come it will be a pleasure to join this club,\" says Ratifo who has scored four goals this season for his club. You must be to read and post comments. Click here to register:","pubDate":"2023-02-13 11:12:56","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | SSU CEO: We're All Upset & Embarrassed","link":"https://www.snl24.com/soccerladuma/Local/Premiership/SuperSport-Utd/supersport-united-ceo-stan-matthews-dondol-stars-came-in-two-quantum-bakkies-my-boys-in-a-60-seater-luxury-bus-20230213","keywords":null,"creator":null,"video_url":null,"description":"SuperSport United CEO Stan Matthews has weighed in on the \"worst result in the history of the club\" after their shock elimination in the Nedbank Cup to third-tier side Dondol Stars.","content":"Matthews says they \"underestimated\" Stars, who are actually from Tshwane in Mamelodi, by fielding a weakened team and that the defeat left them \"upset and embarrassed\". \"Hats off to them, they came away from home to the team that's coming second in the PSL, they showed tremendous spirit and fight, they brought a little band of supporters,\" Matthews said on . \"They came in their two quantum bakkies and they showed they wanted the game more than my boys who came in a luxury 60-seater bus, so you know as much as it is disappointing, definitely the worst result in the history of the football club. \"Our lowest moment to lose to a team in a third tier, it's not something everybody in the club is proud about, we're all pretty upset and in a small way embarrassed,\" he said. \"But again I don't wanna take away what they brought to the party, they brought an element of surprise to us, we underestimated them. We took a calculated gamble of fielding a weaker team and giving some of the fringe players a chance to show what they can do.\" Matthews, however, consoled himself with the fact that his side is not the first club to lose to a lower league side in the Nedbank Cup, as even big teams such as Kaizer Chiefs and Orlando Pirates have suffered such upsets over the years. \"So we have to take that on the chin, we're not the first team to lose in the Nedbank Cup in a David and Goliath fashion, over the years I can recall Vaal University of Technology knocking out Golden Arrows,\" he continued. You must be to read and post comments.","pubDate":"2023-02-13 13:37:48","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Barca to make big change for iconic No. 10 shirt?","link":"https://www.snl24.com/KickOff/WorldNews/FC-Barcelona/fc-barcelona-to-make-big-change-for-iconic-ansu-fati-no-10-shirt-20230213","keywords":null,"creator":null,"video_url":null,"description":"FC Barcelona are reportedly considering making a big change regarding their iconic No. 10 shirt, which is said to have lost its appeal since Ansu Fati inherited it from Lionel Messi.","content":"The jersey has previously been donned by a number of footballing legends at the Camp Nou, including Messi, Ronaldinho, Romario, and Diego Maradona. In August 2021, the seven-time Ballon d'Or winner left the Blaugrana after his contract had expired, bringing his 20-year association with the club to an acrimonious end after he was promised a renewal. Fati, who broke into Barca's senior team in 2019 at the age of just 16, inherited the famous shirt number after the Argentine joined Paris Saint-Germain, with the young Spanish attacker widely considered at the time to be the next big talent to emerge from the LaLiga club.","pubDate":"2023-02-13 13:37:48","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"TOP 20: Waa Kuwee Kooxaha Ugu Koobabka Badan Adduunyada Kaddib Guushii Real Madrid Ee Club World Cup?","link":"https://laacibnet.net/somali/top-20-waa-kuwee-kooxaha-ugu-koobabka-badan-adduunyada-kaddib-guushii-real-madrid-ee-club-world-cup/","keywords":["Wararka Ciyaaraha","Wararka La Liga","Wararka Premier League"],"creator":["Abdiwahab Ahmed"],"video_url":null,"description":"Real Madrid ayaa Sabtidii ku guuleystay koobka naadiyada dunida ee Club World Cup, kaddib markii ay 5-3 ku karbaashtay kooxda reer Sucuudi Carabia ee Al Hilal oo ay isku haleen garoonka Prince Moulay Abdellah Stadium ee magalada Rabat ee waddanka Morocco. Koobkan ayaa ahaa midkii 98aad ee ay ku guuleysato Real Madrid intii ay dhisnayd, […]","content":"Real Madrid ayaa Sabtidii ku guuleystay koobka naadiyada dunida ee Club World Cup, kaddib markii ay 5-3 ku karbaashtay kooxda reer Sucuudi Carabia ee Al Hilal oo ay isku haleen garoonka Prince Moulay Abdellah Stadium ee magalada Rabat ee waddanka Morocco. Koobkan ayaa ahaa midkii 98aad ee ay ku guuleysato Real Madrid intii ay dhisnayd, waxaanay laba gool u jirtaa inay buuxiso tiro saddex-godle koobab ah. Lakiin haddana uma dhowa inay noqoto kooxda ugu koobabka badan adduunyada, waxaana ka horreeya kooxo badan. Warbixinta muujinaysa sida ay kooxaha adduunyadu ugu kala guuleysteen koobabka oo la daabacay sannadkii hore, isla markaana la cusboonaysiiyey kaddib koobabkii xilli ciyaareedkan la kala qaaday, ayaa waxay liiska kooxaha ugu koobabka badan ay kaga jirtaa booska lixaad. Waxa ka horreeya Atletico Penarol oo ka dhisan waddanka Uruguay oo 110 koob ku guuleysatay, Celtic oo 113 koob haysata, Rangers oo 116 koob ku guuleysatay iyo Club Nacional de Football oo reer Uruguay ah oo 117 koob urursatay sannado ay koobabka dalkaas ay guranaysay. Kooxda aan la gaadhi karin ee adduunyada oo dhan ugu koobabka badan waa Al Ahly oo reer Masar ah oo 121 koob ku guuleysatay. Halkan kaga bogo 20ka kooxood ee ugu koobabka badan adduunyada: =20. Club Olimpia (Paraguay) – 56 koob =20. Boca Juniors (Argentina) – 57 koob =18. FCSB (Romania) – 60 koob =18. Anderlecht (Belgium) – 60 koob =16. Galatasaray (Turkey) – 62 koob =15. Liverpool (England) – 66 koob =15. Manchester United (England) – 66 koob 14. Juventus (Italy) – 67 koob 13. Ajax (Netherlands) – 73 koob 12. Porto (Portugal) – 78 koob 11. Olympiacos (Greece) – 79 koob 10. Bayern Munich (Germany) – 82 koob =9. Al-Faisaly (Jordan) – 83 koob =8. Benfica (Portugal) – 83 koob 7. Barcelona (Spain) – 93 koob 6. Real Madrid (Spain) – 98 koob 5. Atletico Penarol (Uruguay) – 110 koob 4. Celtic (Scotland) – 113 koob 3. Rangers (Scotland) – 116 koob 2. Club Nacional de Football (Uruguay) – 117 koob 1. Al Ahly (Egypt) – 121 koob","pubDate":"2023-02-13 13:20:18","image_url":null,"source_id":"laacibnet","category":["sports"],"country":["somalia"],"language":"Somali"},{"title":"Liverpool vs Everton: Previewing the 242nd Merseyside Derby","link":"https://www.thesouthafrican.com/sport/soccer/epl/liverpool-vs-everton-previewing-the-242nd-merseyside-derby-epl-13-february-2023/","keywords":["English Premier League","Everton","Featured","Liverpool","Liverpool v Everton","Premier League"],"creator":["James Freemantle"],"video_url":null,"description":"Liverpool vs Everton in the Merseyside Derby is always a fiery occasion. Here's all you need to know ahead of tonight's EPL meeting.","content":"Liverpool vs Everton is always a fierce battle. Tonight in the EPL, they’ll contest the 242nd Merseyside Derby. Here’s a preview of the action. ICYMI: Cassius Mailula breaks amazing Sundowns record Liverpool vs Everton: previewing a key Merseyside Derby The Merseyside Derby has seen 22 EPL red cards, with 2 of those collected by Liverpool icon Steven Gerrard. No other EPL fixture has seen more. This derby has also produced more 90th-minute winning goals than any other H2H in the EPL, with all of these being scored by Liverpool – Ronny Rosenthal (1993), Gary McAllister (2001), Dirk Kuyt (2007), Sadio Mané (2016) and Divock Origi (2018). In other words, action is guaranteed. ICYMI: Is Benni McCarthy the most expensive South African footballer ever? Sean Dyche working wonders already at Everton The new Everton boss picked up a win in his first game at the helm, and it came against league leaders Arsenal. He could barely have asked for a trickier set of opening fixtures, but the ex-Burnley man enjoys a challenge. REVEALED: Why Vincent Kompany wanted to sign Lyle Foster so badly Liverpool in freefall The Reds have lost three of their last four EPL matches, drawing the other 0-0 with Chelsea. In that sample of games, they’ve scored just once. A They’ve also shipped three goals in three successive away league games for the first time since November and December 1993. Nothing is going right for Jurgen Klopp. After facing a Everton in the Merseyside Derby, Liverpool travel to Newcastle before a pair of meetings with Real Madrid and a battle with the fast-improving Manchester United. Things are getting trickier. What should we expect tonight at Anfield? For more insights, analysis and love for the beautiful game, hit up James Freemantle. Meanwhile, follow The South African on Twitter for up-to-the-minute news updates.","pubDate":"2023-02-13 12:16:58","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Missing PSL assistant referee found","link":"https://www.snl24.com/KickOff/SANews/Premiership/missing-psl-assistant-referee-found-20230213","keywords":null,"creator":null,"video_url":null,"description":"Assistant referee Tshepo Nojila is confirmed to have been found after being reported to have gone missing for a number of days.","content":"South African Football Association [SAFA] expressed concerns over the weekend over the whereabouts of Nojila who had reportedly gone missing. | The North West-born official was last seen by his girlfriend on Tuesday, 7 February 2023. A missing person's case was opened with the South African Police Service [SAPS] by the Nojila family. The match official disappeared with the rented vehicle he had hired to travel to a DStv Premiership match. Nojila was one of the assistant referees selected to officiate the KwaZulu-Natal derby between Lamontville Golden Arrows and Royal AM on February 4, 2023. Speaking to KickOff this morning, SAFA head of Referees Abdul Ebrahim confirmed that Nojila had been found. \"He's been found, he is safe and sound he is back home,\" Ebrahim tells . \"Everything should be fine, I haven't contacted the family as yet. \"But I've heard from the police, and they are certain everything is fine. \"He is unharmed, he is uninjured, the vehicle he was traveling in is fine as well. \"Probably during the course of today [Monday] I will get more information, but thank God he is safe, that is now the most important thing. \"All they said to me late last night was he is safe at home.\"","pubDate":"2023-02-13 12:10:43","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Lorch: What I Was Told","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Orlando-Pirates/orlando-pirates-star-thembinkosi-lorch-opens-up-on-his-long-awaited-return-from-injury-20230213","keywords":null,"creator":null,"video_url":null,"description":"Orlando Pirates talisman Thembinkosi Lorch has opened up about his long-awaited return from injury after he scored a vital goal in the win over All Stars in the Nedbank Cup.","content":"Orlando Pirates talisman Thembinkosi Lorch has opened up about his long-awaited return from injury after he scored a vital goal in the win over All Stars in the Nedbank Cup. Lorch has been out of the Pirates squad since August last year due to an injury that required surgery and after returning to training a couple of weeks ago, he finally made the bench for the first time since then in the Nedbank Cup last 32 clash against the Motsepe Foundation Championship side over the weekend. The Bafana Bafana attacker marked his return with a goal off the bench against All Stars, as the Buccaneers progressed with a 2-0 victory. The 29-year old says it was not easy dealing with being on the sidelines for so long but he's grateful for the support he got at the club. \"It wasn't easy for me, you know coming back from injury. I think I have five months not playing football but I want to thank my family for the support,\" Lorch told the club's media. \"And the technical team, they physios of the team for pushing me, it wasn't easy.\" Jose Riveiro's charges struggled to break down All Stars in the first stanza after the game went to the half-time break goalless but the Buccaneers had more energy and creativity after Lorch was introduced in the second stanza. Lorch went on to explain how he changed the game from the bench, as he had a hand in Monnapule Saleng breaking the deadlock just after the hour-mark before he put the game to bed ten minutes later. \"Sitting on the bench helped me a lot, I was watching that game, analyzing the game you know. I saw All Stars they were running all over, so the coach told me I must find the space, I must find the pocket,\" he continued. \"Even if you can check the first goal I was half space and then I passed to 'Dzvuka' (Terrence Dzvukamanja) and 'Dzvuka' crossed to Saleng. \"So ja it was important for me to score, especially coming back from injury, it's going to boost my confidence going forward,\" he said. Lorch, who had a loan spell at All Stars while they were still known as Cape Town All Stars back in 2015, also thanked the supporters for being behind him during his difficult period. \"I'd like to say to them they must keep on supporting, it's not easy to always get injured and come back stronger, their support means a lot to me,\" he added. You must be to read and post comments.","pubDate":"2023-02-13 12:10:23","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"🎥 | Kelce-broers in tranen na Super Bowl: ‘F*ck you he, gefeliciteerd’","link":"https://sportnieuws.nl/overig/american-football/nfl-super-bowl-lvii-broeders-bros-kelce-travis-jason-fuck-you-congrats-gefeliciteerd-mam-videos/","keywords":["American Football"],"creator":["Sportnieuws.nl"],"video_url":null,"description":"De eindstrijd om de Super Bowl 57 tussen Kansas City Chiefs en Philadelphia Eagles (38-35) was óók de broederstrijd tussen Jason en Travis Kelce. De 33-jarige Travis, tight end bij Chiefs, pakte zijn 2e Super Bowl-zege en kreeg na afloop de sportieve felicitaties van zijn broer. Center Jason Kelce was na afloop ontroostbaar, maar wel… Het bericht 🎥 | Kelce-broers in tranen na Super Bowl: ‘F*ck you he, gefeliciteerd’ verscheen eerst op Sportnieuws.","content":"De eindstrijd om de Super Bowl 57 tussen Kansas City Chiefs en Philadelphia Eagles ( 38-35 ) was óók de broederstrijd tussen Jason en Travis Kelce. De 33-jarige Travis, tight end bij Chiefs, pakte zijn 2e Super Bowl-zege en kreeg na afloop de sportieve felicitaties van zijn broer. ❤️ Chiefs TE Travis Kelce got emotional talking about beating his brother Eagles center Jason Kelce 💚 #SuperBowl pic.twitter.com/UcDpE9GHYZ Mom's always there. 💚 @JasonKelce @DKelce1 pic.twitter.com/lDA2dLhx3W Jason Kelce's full quote on the emotions of losing to his brother Travis' team: \"I don't know, maybe it hasn't hit me yet. I was real emotional when I saw my Mom and Dad. Trav -- I was not too emotional, obviously. 'Fuck you, congratulations.' Nah, I think it's awesome.","pubDate":"2023-02-13 11:35:52","image_url":null,"source_id":"sportnieuws","category":["sports"],"country":["netherland"],"language":"dutch"},{"title":"‘Pirates must go back to where they belong’ – Ncikazi","link":"https://www.citizen.co.za/sport/soccer/local-soccer/pirates-must-go-back-to-where-they-belong-ncikazi/","keywords":["Local Soccer","CAF Champions league","Caf Confederation Cup","DStv Premiership","mandla ncikazi","Orlando Pirates"],"creator":["Tshepo Ntsoelengoe"],"video_url":null,"description":"Pirates sauntered into the last 16 round of the Nedbank Cup after beating All Stars.","content":"With a spot in the next round of the Nedbank Cup secured, Orlando Pirates assistant coach Mandla Ncikazi revealed that the team’s main objective is to ensure that they get back to playing in Caf club competitions next season. ALSO READ: Gallants begin Confed Cup group campaign win convincing win The Bucs assistant coach emphasised that playing in either the Caf Confederation Cup or the Caf Champions League is the team’s priority this season. Pirates increased their chances of getting back to continental competition when they edged All Stars FC 2-0 at the Wits Football Stadium on Saturday to go into the last 16 of the Ke Yona Cup. The Soweto giants are aiming to winning the Nedbank Cup, which guarantees in the Confederation Cup, especially with the race for a second place and third place finish in the DStv Premiership looking extremely intense at the moment. Bucs are in fourth place on thestandings with 28 points, three points behind third placed Richards Bay FC for the Confederation Cup spot and four points behind second-placed SuperSport United. Nickazi emphasized the need for the club to do well and says injuries in the team have been derailing their progress. “Pirates must go back to where they belong. Pirates belong in the Champions League and winning trophies. That’s the challenge that we want to overcome. We must get back to that. Injuries haven’t been kind, but like other teams, we are working on that,” Ncikazi said after the All Stars match. Meanwhile, while Pirates managed to get a victory against All Stars, they had to finish the game without head coach Jose Riveiro on the bench, after he was sent off by referee Xola Sitela. Ncikazi says he wasn’t exactly sure what led to the red card and he didn’t get an explanation from the match officials. “I am not exactly sure what happened to the coach. I tried to speak to the officials. But I think their protocol doesn’t allow them to speak,” the Bucs assistant added. READ MORE: Tough games help Sundowns grow, says Mokwena The Buccaneers have to shift their focus back to the league now, with a clash against Maritzburg United at the Orlando Stadium on Friday.","pubDate":"2023-02-13 11:20:15","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/Mandla-Ncikazi-2.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Das war Super Bowl LVII: Kansas City Chiefs, Mahomes, Rihanna und großes Spektakel","link":"https://www.tt.com/artikel/30845948/das-war-super-bowl-lvii-kansas-city-chiefs-mahomes-rihanna-und-grosses-spektakel","keywords":["Sport","Sport Report"],"creator":["Michael Pipal"],"video_url":null,"description":"Dieser Super Bowl wird in Erinnerung bleiben: 73 Punkte erzielen die Kansas City Chiefs und die Philadelphia Eagles. Am Ende gibt es den zweiten Sieg für die Chiefs binnen vier Jahren.","content":"Dieser Super Bowl wird in Erinnerung bleiben: 73 Punkte erzielen die Kansas City Chiefs und die Philadelphia Eagles. Am Ende gibt es den zweiten Sieg für die Chiefs binnen vier Jahren. Und ein fulminantes Comeback von Rihanna in der Halftime-Show. Glendale – Nach dem Triumph in einem der spektakulärsten Super Bowls der Geschichte gaben Patrick Mahomes und Travis Kelce die Vorsänger für die Fans der Kansas City Chiefs. Mit der Vince Lombardi Trophy in der Hand und im Konfetti-Regen brüllten die beiden wichtigsten Football-Stars der Chiefs ihre Freude über das 38:35 gegen die Philadelphia Eagles ins Mikrofon und bekamen einen Chor zur Antwort. „Wir sind Super-Bowl-Champion. Let's go“, rief der überragende Quarterback Mahomes am Sonntagabend (Ortszeit) auf der kleinen Bühne im State Farm Stadium. Seit sechs Jahren spielt der 27-Jährige in der NFL und ist nun bereits zwei Mal Super-Bowl-Champion, zweimal wertvollster Spieler der Partie und zweimal wertvollster Spieler der Hauptrunde. „Das ist Pat Mahomes“, schrie sein kongenialer Partner Kelce - und stimmte „Fight for Your Right“ von den Beastie Boys an. Kurz vor der Halbzeit war Mahomes noch angeschlagen vom Feld gehumpelt, und führte die Chiefs danach zum insgesamt dritten Super-Bowl-Triumph der Team-Historie. Kicker Harrison Butker entschied die Partie mit einem Field Goal acht Sekunden vor Schluss. Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Die Party-Nacht hatten sich die Chiefs mit einem Comeback verdient, wie es es zuvor in einem Super Bowl erst einmal gegeben hatte. 14:24 stand es zur Pause, einen zweistelligen Rückstand zur Halbzeit hatte in zuvor 30 Fällen nur eine Mannschaft noch gedreht. Zunächst sorgte Rihanna mit ihrem Comeback-Auftritt bei der Halbzeitshow und danach mit der Nachricht ihrer zweiten Schwangerschaft für Furore – anschließend lieferten Mahomes & Co. die große Gala. Zweites Kind für Popstar Auch weil die Chiefs aus den ersten drei Angriffs-Serien nach der Pause drei Touchdowns machten, blieb die herausragende Leistung von Eagles-Quarterback Jalen Hurts ungekrönt. Seine drei Läufe für einen Touchdown und dazu ein Touchdown-Pass waren dennoch ein Super-Bowl-Bestwert. „Philadelphia hatte ein großartiges Spiel. Aber wir sind die Chieeeeeeeeeefs“, feixte Trainer Andy Reid bei der Siegerehrung. Mahomes mit seinen drei Touchdownpässen sei „phänomenal“ gewesen. „Er ist der MVP. Mehr muss man nicht sagen. Das hat er heute gezeigt.“ Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Vor seiner Ehrung als wertvollster Spieler des Super Bowls war Mahomes vergangene Woche schon als wertvollster Spieler der Hauptrunde ausgezeichnet worden. Er ist nun der erste Profi seit 1999, der in einer Saison den Super Bowl und den MVP-Titel gewonnen hat. Für Chiefs-Trainer Reid war es ebenfalls der zweite Sieg im Super Bowl. Die Eagles hatten die Vince Lombardi Trophy zum bislang einzigen Mal 2018 gewonnen. Gewinnspiel: 5x € 500,- Intersport-Gutschein und 20 x All4Lunch-Set TT-ePaper 4 Wochen gratis ausprobieren, ohne automatische Verlängerung Die Partie bot von Anfang an großes Spektakel. Jeweils mit der ersten Angriffs-Serie erzielten die Eagles und Chiefs einen Touchdown. Das hatte es 25 Jahre lang nicht mehr in einem Super Bowl gegeben. Die Fans und Promis um LeBron James, Jay-Z und Paul McCartney kamen früh auf ihre Kosten. Bei den Eagles vollendete der 24 Jahre alte Hurts zum Start in die Partie mit einem kurzen Lauf, bei den Chiefs war Kelce der Empfänger eines langen Wurfs von Mahomes. Die Eagles kontrollierten Ball und Uhr und nutzten die Entscheidung der Chiefs aus, die trotz des gewonnenen Münzwurfs auf den ersten Ballbesitz verzichtet hatten. Die Konsequenz: Mahomes und seine Angreifer hatten den Football nur gut 8 der ersten 24 Minuten und mussten lange von der Seitenlinie aus zuschauen. Sie sahen einen herausragend gefangenen Pass von AJ Brown über 45 Yards und die erneute Führung für die Eagles. Ein an den Pfosten gesetztes Field Goal der Chiefs war ein weiterer Dämpfer für die akustisch klar unterlegenen Fans der Chiefs. Die Anhänger von Kansas City konnten allerdings einen Ballverlust von Eagles-Quarterback Hurts bejubeln, den Nick Bolton zu einem Touchdown nutzte. Vor der Pause holten sich die Eagles durch einen weiteren Lauf von Hurts noch einen Touchdown und ein Field Goal und gingen mit zehn Punkten Vorsprung in die Halbzeit. „Wir wussten, dass wir nicht unser bestes Spiel gespielt haben, wir nicht so hart gespielt haben, wie wir wollten“, sagte Kelce. „In der zweiten Halbzeit haben wir es besser gemacht und sind durch die Gegend geflogen.“ Nach Jahren ohne Auftritt hat sich Pop-Superstar Rihanna mit einer fulminanten Halbzeitshow bei der Super Bowl zurückgemeldet. Bei dem Medley während des Finales der NFL reihte die 34-Jährige am Sonntagabend (Ortszeit) ihre größten Hits aneinander. Bei „Bitch Better Have My Money“ schwebten sie und ihre Tänzerinnen und Tänzer auf bewegbaren Bühnen im Stadion. Ihren Superhit „We Found Love“ performte die Sängerin aus Barbados ganz in rot, um sie herum in weiß gekleidete Tänzerinnen und Tänzer. 📽️ Link | Die komplette Halbzeitshow von Rihanna Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können. Hurts hatte zu diesem Zeitpunkt in einem Super Bowl voller historischer Premieren sein eigenes Kapitel bereits mit einem Ausrufezeichen versehen. Er und Mahomes sind das erste Duo schwarzer Quarterbacks in einem Super Bowl und gemeinsam auch das jüngste. Ebenfalls nie zuvor gab es ein Brüder-Duell: Travis Kelce von den Chiefs und Jason Kelce von den Eagles änderten das in Arizona. Mit nun zwei Siegen im wichtigsten Football-Spiel der Welt hat Travis Kelce, der jüngere der beiden Brüder nun die „ultimativen Angeber-Rechte“, wie sein älterer Bruder bereits zu Beginn der Woche angekündigt hatte. (TT.com, dpa) Bitte stimmen Sie dem Laden von Drittanbieter-Inhalten zu, um diesen Beitrag von Twitter (Datenschutz) ansehen zu können.","pubDate":"2023-02-13 11:13:06","image_url":null,"source_id":"tt","category":["sports"],"country":["austria"],"language":"german"},{"title":"Snl24.com | Chiefs trialist: 'If Chiefs want me to come'…","link":"https://www.snl24.com/KickOff/SANews/Premiership/Kaizer-Chiefs/chiefs-trialist-if-chiefs-want-me-to-come-20230213","keywords":null,"creator":null,"video_url":null,"description":"Mozambican international Stanley Ratifo who recently underwent an assessment at Kaizer Chiefs has revealed details on his time spent at Naturena after returning to Europe.","content":"Ratifo (28) has played all of his club career football in the German lower divisions with his current club being 1.CfR Pforzheim who play in the Oberliga Baden-Wurternberg (fifth tier league). | He has now disclosed how he came to spend time at Chiefs along with teammate Maurizio Macorig, Amansio Joao Pita ‘Neymar’ Canhembe, and Christian Saile Basomboli who has since been signed. \"After the Rwanda and Mozambique game (AFCON qualifier played at FNB Stadium last year) in South Africa I was told by Rui Frois (agent) that Kaizer Chiefs had shown some interest,\" Ratifo tells from Germany. \"So, I came back to Germany and was talking to my agent who I connected with Rui. \"It was then that they spoke about the situation. \"The experience at Chiefs was very nice as they have a lot of good players with quality. \"The tempo in the training sessions was very intense while the structure of the club was amazing. \"I still imagine myself playing in South Africa because I have African blood and I feel good in Africa. \"I don’t know why the transfer didn’t happen. \"This is not my decision. \"I was ready to join this amazing club, but we respect the decision of the club and I wish them the best. \"If Chiefs want me to come it will be a pleasure to join this club,\" says Ratifo who has scored four goals this season for his club. You must be to read and post comments. Click here to register:","pubDate":"2023-02-13 11:12:56","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"}]}