{"newsArray":[{"title":"England v Colombia: Women’s World Cup quarter-final – live","link":"https://www.theguardian.com/football/live/2023/aug/12/england-v-colombia-womens-world-cup-quarter-final-live-score-updates","keywords":["Women's World Cup 2023","Women's World Cup","Women's football","England women's football team","Colombia women's football team","Football","Sport"],"creator":["Sarah Rendell"],"video_url":null,"description":"World Cup quarter-final, 11.30am BST/8.30pm AEST kick-offAustralia knock out France | Mail Sarah or tweet @rendellxHere are some of the players who could play a major part in the outcome of this quarter-final. Keep a close eye on Linda Caicedo, she has been one of the biggest stars so far in this tournament:Colombia have also gone early with their team news. They too have made one change with Manuela Vanegas returning from her suspension. Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 14m ago Half time! England 1-1 Colombia 16m ago GOAL! England 1-1 Colombia (Hemp, 45+6') 23m ago GOAL! England 0-1 Colombia (Santos, 44') 1h ago Kick-off! England 0-0 Colombia 2h ago Colombia team news 3h ago England team news 3h ago Intro Show key events only Please turn on JavaScript to use this feature 1m ago 07.37 EDT England have equalised but Colombia’s strike is the goal of the match, this could be a nomination for goal of the tournament (the clip is from ITV and so some may not have access): 🇨🇴 INCREDIBLE FROM LEICY SANTOS! Santos lobs Mary Earps from an unlikely angle to give #COL the lead against England... #FIFAWWC pic.twitter.com/Pq041pVlZS — ITV Football (@itvfootball) August 12, 2023 10m ago 07.28 EDT Enjoying the Guardian’s coverage of the Women’s World Cup? This action-packed, up-to-the-minute live blog is only possible thanks to funding from our fans all around the world. We don’t have a paywall, so everything we publish is open and free for everyone. Unlike so many others, the Guardian is fiercely independent – meaning we don’t have a billionaire owner who can censor us. Fund quality sports journalism from the Guardian today from as little as £1 . It takes less than a minute but makes a huge difference. Support the Guardian 12m ago 07.26 EDT Colombia were the better team on balance over that half, their defending overall was clinical and their attack was far more deadly. But an individual error from goalkeeper Perez has allowed England back into this match and at the perfect time. 14m ago 07.25 EDT Half time! England 1-1 Colombia Colombia found the opener with a superb Santos strike but England equalised just before the half! Everything to play for, what a match. Sign up for the Moving the Goalposts newsletter: our free women’s football email Read more Updated at 07.25 EDT 15m ago 07.24 EDT 45 + 7 min : The ball kept pinging around, Colombia just couldn’t clear their lines. Perez initially saved but she couldn’t control and Hemp strikes. 16m ago 07.23 EDT GOAL! England 1-1 Colombia (Hemp, 45+6') An error from Perez and Hemp is in! Perez and Carabali colide under pressure from Russo. Photograph: Cameron Spencer/Getty Images Hemp is on hand to tap in. Photograph: Lars Baron/Getty Images Updated at 07.32 EDT 18m ago 07.21 EDT 45 + 5 min : England have kept composure since going behind, they do need to put more pressure on Colombia to get something. But Colombia’s defence is so compact and clinical. Mary has said: “Oh my lord, what a beautiful goal by Santos. England needs to get to halftime and regroup. Somehow England needs to slow the tempo down, and not allow Columbia to play chaos football, they seem to thrive in that manic tempo.” 20m ago 07.19 EDT 45 + 3 min : That was also the first goal England have conceded in open play, the other was a penalty against China. Bright passes to Stanway, who lays it off to Russo but it’s blocked. 21m ago 07.18 EDT 45 + 1 min : This will be interesting to see how England react here, this is the first time they have gone behind at this World Cup. There are six minutes added. 22m ago 07.17 EDT 45 min : Santos was a step into the box, her shot beats Daly and it bends into the top left corner. Earps tries to save but there’s nothing she can do about it. How about this! An upset on the cards! 23m ago 07.16 EDT GOAL! England 0-1 Colombia (Santos, 44') OH MY! It was coming and what a peach of a shot. Wow. Santos lifts the ball from the edge of the box. Photograph: Carl Recine/Reuters Keeper Earps gets lobbed. Photograph: Lars Baron/Getty Images Santos celebrates scoring. Photograph: Carl Recine/Reuters Colombia’s players celebrate with Santo. Photograph: Zac Goodwin/PA Updated at 07.28 EDT 24m ago 07.15 EDT 44 min : Vanegas connects with Caicedo but she is offside – Colombia look more likely to score at the moment. They are having all the joy going forward, England’s last pass in the final third just not coming together. This time Bronze loses out to Vanegas but Bright comes to the rescue. 26m ago 07.13 EDT 42 min : Russo now has it in the box but D Arias sees it out. Toone wins a throw, she isn’t looking at her best in this one yet. Greenwood puts in a long range pass but it comes to Perez. 28m ago 07.11 EDT 40 min : Carabali pops it in, this time Earps collects. Colombia are doing well and have had more opportunities in the box, England get it so far and then Colombia repel their threat. 29m ago 07.10 EDT 39 min : Guzman lays it off to Ramirez and it comes back to the substitute. She pops it in and Caicedo gets to it, her shot is blocked. 30m ago 07.09 EDT 38 min : A bit of patient play now from England, this game has been all go. Russo loses the ball in the midfield though and here come Colombia! 31m ago 07.08 EDT 36 min : The free kick is short and then Greenwood pops it in but Vanegas beats Bright. Caicedo looks to peel away, Stanway fouls. 32m ago 07.06 EDT 35 min : Greenwood goes down again holding her face but I think she’s okay. Walsh taking on some instruction from Wiegman before we get back underway. Stanway with a great run but she is pulled back by Santos and England have a free kick. 34m ago 07.05 EDT 34 min : Guzman again has a beaut of a cross in but Bright heads away. England on the counter but Toone loses out to Carabali – a frantic exchange at both ends! This is so entertaining! Greenwood hits the deck but play continues, she is eventually back to her feet and heads the ball away. It’s hard to keep up with all of this! 36m ago 07.03 EDT 32 min : Guzman with a great cross, she has been involved a lot since coming on, but no one in the box can connect. England are quick to work it up the other end but Toone’s touch isn’t clean and Colombia clear. 37m ago 07.02 EDT 31 min : Lauren Hemp that is beautiful. She is hounded on the line but she manages to get away and passes to Walsh but she boots the ball over the bar. Bright does well up the other end to prevent a ball coming to Ramirez. 38m ago 07.00 EDT 29 min : Daly takes a long range effort and it’s just over the bar! Carabali so good there to not concede a corner. Joe has emailed and said: “Watching from Indianapolis with a thunderstorm rumbling in the vicinity. But where is the snack chat? Your readers expect nothing less!” Oh you have some weather setting a mood! Apologies, I am slacking on my snack chat! Today I am eating cherry tomatoes, very odd I know! Daly shoots. Photograph: Cameron Spencer/Getty Images Updated at 07.22 EDT 40m ago 06.58 EDT 27 min : Greenwood is over the set piece ball and it’s a good delivery, Daly misses the header but it comes back in for her. The Aston Villa player’s header is straight at Perez. 42m ago 06.57 EDT 26 min : Bronze is wide open and it eventually come to her and she wins a corner. 42m ago 06.57 EDT 26 min : The free kick is taken short but England are ran back to halfway, a chance wasted but the Lionesses are still in possession. 43m ago 06.56 EDT 25 min : Daly is up and okay to continue. England have a free kick now as Guzman fouls Hemp but that time I think it shouldn’t be a foul? Bizarre. 44m ago 06.54 EDT 23 min : Bronze with a storming run but she is crowded by three defenders and eventually the Barcelona defender fouls. Guzman absolutely clatters Daly, no foul given again. Play is stopped as she needs some treatment. Daly is fouled by Guzman. Photograph: Rick Rycroft/AP Updated at 07.05 EDT 46m ago 06.53 EDT 22 min : Usme waits for the ball but Greenwood heads away. Hemp is taken out off the ball by Guzman but it’s not been given as a foul? Strange decision. Santos pings it in but England do enough to keep it out, frantic defence from England at the moment. 48m ago 06.51 EDT 20 min : Daly pops it in, it’s initially cleared and then Vanegas dispossess Carter. A long range pass from Bright has too much on it and we have a throw. No sign of a breather in this one. 50m ago 06.49 EDT 18 min : Colombia doing well to marshal England’s forwards and it pays off with Walsh misplacing a pass. Colombia come now and Ramirez, who is such a threat, has a good run but her pass doesn’t come off. A balanced game so far, Colombia with more chances but England’s looked the more deadly. 52m ago 06.47 EDT 16 min : Caicedo, how is she only 18?! She’s playing like a seasoned player! Unbelievable cut down the left to leave Carter in the dust, her resulting shot is over the bar. A reminder Caicedo has scored at three World Cups in a year – two youth tournaments and this one! Caicedo eveades the efforts of Carter on the wing. Photograph: Bianca de Marchi/AAP Updated at 07.03 EDT 53m ago 06.45 EDT 14 min : Caicedo with a lovely run and she whips it to Usme. She lines up a huge shot, it’s blocked but great play. Greenwood calmly works it out – she is so dependable at the back. 54m ago 06.44 EDT 13 min : Julian has got in touch and said: “Any idea why England are being booed by the crowd?” Because there are a lot of Colombia fans in, they like to create an atmosphere and will do what they can to help their team! England will also thrive on the great atmosphere. Back to the game and England have the ball and ae building from deep. Fans of Colombia show their support. Photograph: Lars Baron/Getty Images Meanwhile, a lion roars. Photograph: Dean Lewins/EPA Updated at 07.09 EDT 1h ago 06.43 EDT 12 min : Guzman is on for C Arias, such a big miss for Colombia but Guzman did have a big part in Colombia’s goal against Jamaica! Here come England again, a blistering ball in and she heads it – Perez calmly collects. I can tell my hands are going to get tired in this one, so much action! 1h ago 06.41 EDT 10 min : I think C Arias is off, the medical team signalled to the bench she is out. Colombia are still with 10 and Bronze gets the ball in the box but it’s blocked. 1h ago 06.40 EDT 9 min : C Arias has limped to the sidelines, she doesn’t look happy. For now Colombia play with 10 as we get back underway. 1h ago 06.39 EDT 8 min : This doesn’t look good for C Arias, she is such a big player in this Colombian team so I hope she is okay to continue. She quite literally threw herself at the shot from Hemp. Arias lies on the ground after sustaining an injury. Photograph: Dean Lewins/EPA Updated at 06.59 EDT 1h ago 06.38 EDT 7 min : OH MY WORD! How, oh how, have England not scored?! Walsh the key cog to connect the team and it comes to Russo in the box, her shot is blocked but a superb but of defending, it drops for Hemp but it’s blocked again. MASSIVE. C Arias needs some treatment after that defensive effort. Russo has a shot which makes contact with the head of Arias. Photograph: Lars Baron/Getty Images Hemp’s ebound is also blocked. Photograph: Cameron Spencer/Getty Images Updated at 06.47 EDT 1 of 2 Next Oldest Oldest Topics Women's World Cup 2023 Women's World Cup Women's football England women's football team Colombia women's football team Reuse this content","pubDate":"2023-08-12 10:56:13","image_url":"https://i.guim.co.uk/img/media/6f7a8bc9c349a022c5e11aa3ce860c7609e725fd/167_456_4022_2413/master/4022.jpg?width=460&quality=85&auto=format&fit=max&s=a8c161a76154ce2e4b66b39b45a85858","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Coupe du monde féminine : «Il faut garder la tête haute et penser aux JO», lance Hervé Renard après l’élimination des Bleues","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde-feminine-le-destin-a-choisi-juge-herve-renard-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"Le sélectionneur des Bleues revient l’élimination face à l’Australie, en quarts du Mondial, à Brisbane.","content":"Hervé Renard (sélectionneur de l'équipe de France féminine, après l’élimination aux tirs au but face à l’Australie ) : « Ça m'est déjà arrivé, j'en ai gagné, j'en ai perdu. Ce soir (samedi), il faut être fier des filles, elles ont fait un match exceptionnel. Ça allait de droite à gauche, de gauche à droite. Dire qui méritait le plus c'est difficile donc félicitations à l'Australie. Et puis félicitations à tout le staff qui a fait un travail magnifique. Il faut garder la tête haute et puis penser aux Jeux olympiques. Il faut toujours persévérer et être fier de ce qu'elles ont fait. On a un stade entier, une nation contre nous. On a fait un match exceptionnel. C'est le football, c'est le destin qui a choisi. Bonne chance à l'Australie. On méritait je pense mieux mais c'est comme ça ». (sur France 2)","pubDate":"2023-08-12 10:50:48","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Ligue 1 : le PSG sans Mbappé contre Lorient, Neymar et Verratti manquent également à l’appel","link":"https://www.lefigaro.fr/sports/football/ligue-1/ligue-1-le-psg-sans-mbappe-contre-lorient-neymar-et-verratti-manquent-egalement-a-l-appel-20230812","keywords":["Ligue 1"],"creator":null,"video_url":null,"description":"Luis Enrique a convoqué un groupe de 20 joueurs pour affronter Lorient ce samedi (21h), lors de la première journée du championnat de France.","content":"Luis Enrique, première ! Après une salve de matches amicaux, le technicien espagnol de 53 ans dirigera son premier match officiel à la tête du PSG ce samedi (21h), face à Lorient, lors de la première journée de Ligue 1 . Ce sera bien évidemment sans Kylian Mbappé, absent du groupe de 20 joueurs dévoilé ce samedi matin. Le crack de Bondy est mis à l'écart par sa direction en raison de son refus de prolonger un contrat qui ne court que jusqu'en 2024 . Poussés vers la sortie, Neymar et Marco Verratti manquent également à l'appel. « Il y a les mots, mais mes actes sont encore plus parlants. Mes actions montreront quelles sont mes idées », expliquait «Lucho» vendredi , en conférence de presse, au sujet de ses plans pour les deux joueurs. À noter que le club évoquait un « syndrome viral » pour expliquer l'absence du Brésilien à l'entraînement vendredi. L'Italien, lui, a participé normalement à la séance avec le reste de ses coéquipiers. Parmi les 20 joueurs retenus, on retrouve notamment huit des neuf recrues parisiennes de l'été. Pas Ousmane Dembélé, dont la signature n'a été officialisée que ce samedi matin . Deux revenants, Keylor Navas et Layvin Kurzawa, prêtés à l’étranger la saison dernière. Outre Mbappé, Neymar et Verratti, on signalera les absences de Nordi Mukiele, Presnel Kimpembe ou encore Nuno Mendes, blessés ou en phase de reprise. Le tout sans oublier les «lofteurs», ces joueurs placés sur la liste des transferts par le club, comme Gini Wijnaldum, Abdou Diallo ou encore Leandro Paredes.","pubDate":"2023-08-12 10:45:11","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Coupe du monde féminine de foot : la fin du rêve pour les Bleues, éliminées par l'Australie aux tirs au but","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde/coupe-du-monde-feminine-la-fin-du-reve-pour-les-bleues-eliminees-par-l-australie-aux-tirs-au-but-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"L'équipe de France d'Hervé Renard prend la porte en quarts de la Coupe du monde face à l'Australie au terme d’une interminable séance de tirs au but.","content":"Jamais deux sans trois. Comme lors des deux dernières éditions de la Coupe du monde féminine, les Bleues ont pris la porte en quarts de finale. Elles ont été éliminées par l'Australie ce samedi ( 0-0 ap, 6-7 aux t.a.b. ) à Brisbane. Une interminable et mythique séance d’ailleurs. Les Australiennes défieront l'Angleterre ou la Colombie en demies de «leur» Mondial, un stade de la compétition que la France n'a atteint qu'une fois, en 2011, terminant à la quatrième place. À Brisbane, ce sont les Françaises qui ont le mieux débuté la rencontre, moins tendues que les Australiennes. Diani a allumé une première mèche (8e) et quelques minutes plus tard, Lakrar a manqué une opportunité énorme, à quelques mètres du but, suite à un centre-tir de Le Sommer (12e). Le Sommer maintenait la pression dans la foulée (28e) et Lakrar s'offrait encore une occasion en or (31e) juste avant que les Bleues ne disparaissent pendant plus de trente minutes. Jusque-là timorées, les Australiennes sortaient le bout de leur nez avant la pause. Suite à une mésentente entre Karchaoui et Peyraud-Magnin, Fowler pensait ouvrir le score mais c'était sans compter sur un sauvetage magnifique sur sa ligne de De Almeida (41e). Cela lançait le match des Matildas. Au retour des vestiaires, les Australiennes accéléraient et asphyxiaient les Bleues pendant un gros quart d'heure et de nombreuses situations chaudes sur le but de Peyraud-Magnin. Fowler (50e, 60e) faisait à nouveau frissonner les Tricolores avant que la rencontre ne tombe dans un faux rythme jusqu'à la prolongation. À VOIR AUSSI - La préparation des Bleues avant le quart de finale face à l’Australie Trente minutes supplémentaires donc et trente minutes animées avec un but refusé pour les Bleues (100e). Un corner inexistant, tiré par Bacha, était donné aux Françaises et converti...par Kennedy dans son propre but mais les Australiennes allaient finalement être sauvées par une faute de Renard sur Foord. Un tournant. Dans la foulée, Vine se montrait dangereuse (105e). Becho réagissait (107, 110e) sans réussite. La décision allait donc se faire aux tirs au but et pour l'exercice, Hervé Renard fit le choix de changer de gardienne. Exit Pauline Peyraud-Magnin et place à Solène Durand. Une séance de tirs au but pleine de tension avec pas moins de dix tireuses de chaque côté. Et à deux reprises, Durand maintenait les Bleues en vie lors des premières balles de match australiennes mais les Françaises manquaient la cible à de trop nombreuses reprises (Bacha, Perisset, Dali) et la jeune Becho, dixième tireuse, expédiait sa tentative sur le poteau d'Arnold, la gardienne australienne. Et cette fois-ci, Vine ne laissait pas passer la troisième balle de match, envoyant ainsi l'Australie dans le dernier carré mondial pour la toute première fois.","pubDate":"2023-08-12 10:40:28","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"LIVE NRL: Roosters land ‘big blow’ on stroke of halftime against ‘brave’ Dolphins","link":"https://www.foxsports.com.au/nrl/nrl-premiership/nrl-live-sydney-roosters-vs-the-dolphins-live-scores-final-teams-finals-chances-supercoach-scores-highlights-james-tedesco-wayne-bennett/news-story/29a946ebf8ea3ad960217a82ad4f4d12","keywords":null,"creator":null,"video_url":null,"description":"The Roosters have struck a “blow” right on halftime, with Joey Manu crossing for the Chooks’ first try of the night. They trail the Dolphins 8-6 at the break.","content":"The Roosters have struck a “blow” right on halftime, with Joey Manu crossing for the Chooks’ first try of the night. They trail the Dolphins 8-6 at the break. Ray Stone barged over from close range to break the deadlock after 25 minutes, with Jamayne Isaako adding a penalty goal ten minutes later. The Roosters have had quite a few opportunites at the Dolphins line, with the attacking woes that have plagued their season reappearing, but the away side have been brave in defense. MATCH CENTRE: Sydney Roosters vs the Dolphins live scores, teams, videos Round 24 NRL Aug 10 7:50pm AEST FT Sea Eagles 12 Panthers 24 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 11 6:00pm AEST FT Sharks 36 Titans 6 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 11 8:00pm AEST FT Broncos 54 Eels 10 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 12 3:00pm AEST FT Rabbitohs 26 Dragons 14 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 12 5:30pm AEST FT Tigers 22 Warriors 30 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL LIVE 51:06 Roosters 12 Dolphins 8 MATCH CENTRE $1.14 $5.50 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 13 2:00pm AEST Storm Raiders MATCH CENTRE $1.28 $3.70 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 13 4:05pm AEST Knights Bulldogs MATCH CENTRE $1.30 $3.50 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES Watch every game of every round of the 2023 NRL Telstra Premiership Season LIVE on Kayo Sports. New to Kayo? Start your free trial now >>> That was until there was just 15 seconds left in the half, which is when Joey Manu put his mark on the game. Roosters fullback James Tedesco ran at the line and drew in a couple of Dolphins, before turning it back inside to the hard running Manu. “Joey Manu finally cracks this brave Dolphins defence and the Roosters land a big blow right on halftime,” Dan Ginnane said on Fox League. MATCH PREVIEW The Roosters will be desperate to keep their finals hopes alive on Saturday night when they face Wayne Bennett’s Dolphins. Trent Robinson’s side have given themself no room for error in the race for post-season football with a loss finishing their season. Drew Hutchison has been named at halfback, with Sandon Smith on the bench which could see the rookie shift in to dummy-half to replace Brandon Smith. Elsewhere, Dylan Napa returns to the NRL after signing with the Roosters mid-season. For the Dolphins, Kodi Nikorima lines up at fullback which has shifted Origin star Hamiso Tabuai-Fidow in to the centres. Isaiya Katoa and Sean O’Sullivan partner in the halves with Anthony Milford on the bench in the utility role. Roosters team : 1. James Tedesco 2. Daniel Tupou 3. Billy Smith 4. Joseph Manu 5. Joseph-Aukuso Suaalii 6. Luke Keary 7. Drew Hutchison 8. Jared Waerea-Hargreaves 9. Brandon Smith 10. Lindsay Collins 11. Nat Butcher 12. Siua Wong 13. Victor Radley 14. Sandon Smith 15. Fletcher Baker 16. Terrell May 17. Dylan Napa 22. Corey Allan Dolphins team : 1. Kodi Nikorima 2. Jamayne Isaako 3. Hamiso Tabuai-Fidow 4. Valynce Te Whare 5. Tesi Niu 6. Isaiya Katoa 7. Sean O’Sullivan 8. Jesse Bromwich 9. Jeremy Marshall-King 10. Mark Nicholls 11. Felise Kaufusi 12. Connelly Lemuelu 13. Kenny Bromwich 14. Ray Stone 15. Josh Kerr 16. Anthony Milford 17. Jarrod Wallace 18. Herman Ese’ese Get all the latest NRL news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now!! Catch all the action below in our live blog, if you can’t see it click here!","pubDate":"2023-08-12 10:30:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Les notes des Bleues face à l'Australie : De Almeida rebondit, Toletti déçoit","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde/les-notes-des-bleues-face-a-l-australie-de-almeida-rebondit-toletti-decoit-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"Découvrez les notes attribuées aux joueuses de l'équipe de France après l'élimination (0-0, 7-6 t.a.b) face à l'Australie en quart de finale de la Coupe du monde féminine, ce samedi, à Brisbane.","content":"Pauline Peyraud-Magnin (4) : Son match a été à l'image de son Mondial, frustrant. Encore terriblement en difficulté dans le jeu au pied, la gardienne tricolore s'est cette fois montrée maladroite dans les airs, passant au travers presque à chaque fois. Elle a réalisé plusieurs parades décisives en seconde période, avant d'être remplacée par Solène Durand pour la séance de tirs au but. Malgré deux arrêts, la gardienne de Sassuolo n'a pu sauver les Bleues. Elisa De Almeida (7) : Préférée à Eve Perisset sur le côté droit de la défense dans le onze de départ, elle a cette fois fait preuve de rigueur et de combativité pour contenir Foord, la principale menace australienne. Puis elle réalise un sauvetage incroyable devant Fowler (41e), avant de multiplier les interventions dans sa surface de réparation. Remplacée par Perisset, qui manque son tir au but. Maelle Lakrar (4) : Absente en 8es de finale sur blessure, la Montpelliéraine a fait son retour avec un imposant bandage sur la…","pubDate":"2023-08-12 10:25:50","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"What time do the Matildas play their semi final?","link":"https://www.foxsports.com.au/football/world-cup/what-time-do-the-matildas-play-their-semi-final/news-story/f826f9e50b8b51093abd228379f039e0","keywords":null,"creator":null,"video_url":null,"description":"The Matildas are into the semi-final of the FIFA Women’s World Cup for the first time in their history after a thrilling victory over France via a nailbiting penalty shootout.","content":"The Matildas are into the semi-final of the FIFA Women’s World Cup for the first time in their history after a thrilling victory over France via a nailbiting penalty shootout. Super-sub Cortnee Vine converted the winning penalty to spark jubilant scenes at Brisbane Stadium as the Matildas sealed a spot in the final four. Football fans across the nation now will be asking when and where the Matildas will play their next game. The Matildas will play their semi-final clash on Wednesday August 16, with kick-off schedule for 8pm AEST. The game will be played at Stadium Australia in Sydney, meaning yet another attendance record could be broken. The Matildas’ opponent will be the winner of the quarterfinal between England and Colombia.","pubDate":"2023-08-12 10:24:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Les Bleues éliminées en quarts de la Coupe du monde après une séance de tirs au but irrespirable face à l'Australie","link":"https://www.lequipe.fr/Football/Actualites/Les-bleues-eliminees-en-quarts-de-la-coupe-du-monde-apres-une-seance-de-tirs-au-but-irrespirable-face-a-l-australie/1413206#xtor=RSS-1","keywords":["Foot, CM 2023"],"creator":["Sébastien Buron"],"video_url":null,"description":"La France a été éliminée en quarts de finale de la Coupe du monde après une séance de tirs au but irrespirable, ce samedi, face à l'Australie (0-0 a.p., 6-7 aux t.a.b.). Le rêve de décrocher le sacre mondial s'est envolé pour les Bleues de Hervé Renard.","content":"Le match : 0-0 a.p., 7-6 aux t.a.b. Elles sont tombées de détresse sur la pelouse et les regrets seront, forcément, immenses après cette nouvelle désillusion. L'équipe de France féminine espérait décrocher son premier titre mondial cet été et elle devra toujours courir, dans quatre ans, après cet objectif. Face à l'Australie, coorganisatrice de l'épreuve avec la Nouvelle-Zélande, les Bleues ont vu leur rêve s'envoler au terme d'une séance de tirs au but irrespirable (0-0 a.p., 6-7 aux t.a.b.). Le début de rencontre laissait pourtant entrevoir une autre issue tant les joueuses de Hervé Renard, malgré le jeu dur des Australiennes, se montraient supérieures. À la 35e minute, les statistiques traduisaient cette domination : 8 tirs à 2 pour la France. Mais le score était toujours de 0-0. Car Diani avait tiré à côté (8e), Arnold avait repoussé les tirs de Le Sommer (28e) et Lakrar (32e), et la défenseuse avait surtout raté un but tout fait à la 12e minute. La fin de la première période a annoncé une bascule. De Almeida a sauvé devant sa ligne un tir de Fowler après une mésentente entre Karchaoui et Peyraud-Magnin (41e), la gardienne française s'est ensuite interposée devant l'attaquante australienne (45e) et le rapport de force a continué sur cette lancée au retour des vestiaires. Fowler a vu sa frappe déviée par De Almeida après une relance totalement ratée de Peyraud-Magnin (50e), très fébrile jusque-là, mais décisive ensuite par deux très belles parades sur des tentatives de Raso (56e) puis - encore - de Fowler (60e). Entre-temps, la star australienne Sam Kerr, pas encore à 100 %, avait fait son entrée sur la pelouse (55e) et l'inquiétude pouvait grandir. Incapables de se créer la moindre occasion toute la seconde période, les Bleues étaient alors au bord du précipice. Bacha, Périsset, Dali et Becho en échec Elles ont sorti la tête de l'eau en prolongation et ont même cru ouvrir le score sur un csc de Kennedy, mais le but était refusé pour un tirage de maillot de Renard sur Foord (100e). Vine (105e), Becho (107e) étaient à leur tour proches du K.-O., Catley a réussi un superbe sauvetage (110e), et Hervé Renard a tenté un immense coup en remplaçant Peyraud-Magnin par Solène Durand pour les tirs au but. Mais ses arrêts lors de la séance fatidique n'auront pas suffi face aux échecs de Bacha, Périsset et Dali, qui avait pourtant pu retirer une deuxième fois, et de Becho. Comme en 2015, face à l'Allemagne (1-1 a.p., 4-5 aux t.a.b.), les Bleues ont craqué lors de la séance fatidique. Un mois après avoir dominé les Bleues en amical (1-0) le 14 juillet, jour de la Fête Nationale en France, les Australiennes ont, dans la folie de Brisbane, pu célébrer leur première qualification de leur histoire pour les demi-finales de la Coupe du monde. 3 Pour la troisième fois de suite, la France a été éliminée en quarts de finale de la Coupe du monde féminine. Les Bleues n'ont atteint qu'une fois le dernier carré, en 2011. Elles avaient alors terminé 4es.","pubDate":"2023-08-12 10:08:44","image_url":"https://medias.lequipe.fr/img-photo-jpg/la-deception-des-bleues-ce-samedi-a-b-ratnayake-reuters/1500000001819605/0:0,1998:999-665-335-70/3061d.jpg","source_id":"lequipe","category":["sports"],"country":["france"],"language":"french"},{"title":"Harry Kane hints at future Tottenham return after finishing Bayern Munich transfer","link":"https://www.businesslend.com/sports/harry-kane-hints-at-future-tottenham-return-after-completing-bayern-munich-move/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox totally free Sign as much as Miguel’s Delaney’s free weekly publication England captain Harry Kane has left the door open for a return to Tottenham after finishing his £100million transfer to Bayern Munich. Kane travelled to Germany on Friday for [...] The post Harry Kane hints at future Tottenham return after finishing Bayern Munich transfer appeared first on BusinessLend.","content":"England captain Harry Kane has left the door open for a return to Tottenham after finishing his £100million transfer to Bayern Munich. Kane travelled to Germany on Friday for a medical and the Bundesliga giants confirmed on Saturday morning he had signed a deal till June 2027 and can put on the quantity 9 shirt. Spurs chairman Daniel Levy stated the membership had “reluctantly” agreed to the transfer after Kane, who was within the final 12 months of his contract, made it clear he needed a recent problem. Kane stated in a message to Tottenham followers posted on his social media accounts: “It’s not a goodbye because you never know how things pan out in the future, but it’s a thank you and I’ll see you soon.” The 30-year-old informed his new membership’s web site that he hoped to play some half in Bayern’s DFB Super Cup match with RB Leipzig on Saturday evening as he appears to be like to win the primary trophy of his profession. “I’m very happy to be a part of FC Bayern now,” Kane stated. “Bayern is one of the biggest clubs in the world and I’ve always said that I want to compete and prove myself at the highest level during my career. This club is defined by its winning mentality – it feels very good to be here. “I feel like it was the right step in my career to really push myself and test myself on the highest level so that’s why I’m here and I look forward to that challenge.” Shortly earlier than the deal was formally confirmed, Kane posted a message on social media wherein he thanked the followers and stated he had not needed to begin the season together with his future unresolved. “From the moment I’ve been playing I’ve been one of your own and I’ve given everything that I possibly could to make you proud and give you as many special moments and memories to hopefully last forever,” Kane stated. “This is a message to all you fans around the world, every single Tottenham fan that’s supported me and been with me throughout my journey. “Me and my family will cherish it forever, we’ll never forget all the moments we’ve had together so thank you. “I felt like it was the time to leave. I didn’t want to go into the season with a lot of unresolved future talk. “I think it’s important for the new manager and the players to concentrate on trying to get Tottenham back to around the top of the table and fighting for trophies so I wish Ange (Postecoglou) and all the boys all the very best of luck. “I’ll be watching from a fan point of view now and really hope the team can be successful.” Postecoglou had revealed on Friday that Kane’s transfer was “imminent” after a breakthrough in negotiations between the golf equipment was reached on Wednesday evening. It left the ball in Kane’s court docket and he selected Thursday to depart his boyhood membership for Bayern, who pays an preliminary £100m with add-ons probably taking the deal as much as an total charge of £120m, the PA information company understands. Kane leaves Tottenham having scored 280 targets to develop into the membership’s all-time main goalscorer, however with out a trophy. “I think it’s important for the new manager and the players to concentrate on trying to get Tottenham back to around the top of the table and fighting for trophies so I wish Ange (Postecoglou) and all the boys all the very best of luck,” Kane stated. “I’ll be watching from a fan point of view now and really hope the team can be successful.” Bayern had seen their earlier bids for Kane turned down, however refused to surrender their pursuit of the 30-year-old, who stays 47 targets shy of equalling Alan Shearer’s Premier League file of 260. Harry was clear that he needed a recent problem and wouldn’t be signing a brand new contract this summer season Levy informed the membership’s web site: “We sought over a long period of time to engage Harry and his representatives in several forms of contract extension, both short and long term. “Harry was clear, however, that he wanted a fresh challenge and would not be signing a new contract this summer. We have reluctantly, therefore, agreed to his transfer. “We have seen a product of our academy system become one of the best players to ever pull on a Spurs shirt and become one of world football’s elite strikers. It has been a truly remarkable journey.” Harry Kane’s highs and lows at Tottenham as he indicators with Bayern Munich","pubDate":"2023-08-12 10:07:27","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Les Bleues éliminées de la Coupe du monde par l'Australie aux tirs au but","link":"http://www.lechorepublicain.fr/paris-75000/sports/les-bleues-eliminees-de-la-coupe-du-monde-par-l-australie-aux-tirs-au-but_14356065/","keywords":["PARIS"],"creator":null,"video_url":null,"description":"La France affrontait l'Australie, ce samedi 12 août, à Brisbane, en quart de finale de la coupe du monde féminine. Les Bleues se sont inclinées aux tirs au but (6-7).","content":"Dans une première mi-temps plutôt timide, aucune des deux équipes n'est parvenue à inscrire le moindre un but. Les Bleues ont toutefois maitrisé la majeure partie de ce premier acte avec quelques occasions, notamment dès la 7e minute de jeu : sur une mauvaise relance de l'Australienne Alanna Kennedy, la Française Kadidiatou Diani lui chipe la balle et lâche une frappe trop croisée, qui passe à côté de la cage. Première frayeur pour les Matildas. À la 27e minute, il y a eu aussi ce tir de la numéro 9 tricolore, Eugénie Le Sommer, contré par la défense et finalement repoussé par la gardienne Mackenzie Arnold. Et puis c'est à peu près tout ce que ce quart de finale avait à offrir... Jusqu'au sauvetage miraculeux sur la ligne de but de l'arrière droit des Bleues, Elisa De Almeida. Après une incursion australienne dans la surface de réparation, et une mésentente entre la gardienne Pauline Peyraud-Magnin et Sakina Karchaoui, l'attaquante Mary Fowler décroche une frappe qui aurait dû finir au fond de la cage de but vide. Mais l'intervention spectaculaire de De Almeida permet de garder un score vierge à la 45e minute. La deuxième mi-temps aurait néanmoins pu être fatale aux Bleues, face à des Australiennes ultra dominantes, mais qui n'ont pas réussi à trouver le chemin des buts. Dès l'entame du deuxième acte, les Matildas ont pris d'assaut la surface de réparation tricolore. La première grosse occasion arrive à la 55e minute de jeu, juste après l'entrée sur le terrain de la star australienne Sam Kerr, sous l'ovation des 49 000 spectateurs. À l'entrée de la surface, Hayley Raso déclenche une frappe puissante qui est bien repoussée par Peyraud-Magnin. Peu de temps après, à la 59e, l'attaquante Fowler se distingue à nouveau, à bout portant, mais trouve une nouvelle fois sur son chemin la gardienne française. C'est alors qu'Hervé Renard décide d'effectuer son premier changement du match (64e), avec l'entrée en jeu de Vicky Becho à la place de Sandie Toletti. Les Bleues remettent un peu la tête à l'endroit, et subissent un peu moins. Mais se procurent qu'une toute petite occasion en deuxième mi-temps, loin d'être suffisant pour forcer le destin en 90 minutes, ce qui a donc laissé place aux prolongations. Dans la première partie des prolongations, les Bleues pensaient que le plus difficile était fait, après une tête contre son camp de Kennedy qui cherchait à défendre sur un corner (99e). Mais l'abrite siffle faute pour les Australiennes après un tirage de maillot de Wendie Renard dans la surface de réparation. À la 104e, un centre très dangereux de l'Australienne Caitlin Foord pour Cortnee Vine, qui venait d'entrer en jeu, finit dans le petit filet extérieur. Dans la deuxième mi-temps des prolongations, une frappe de Becho (107e) se dirigeait vers la lucarne mais la gardienne a réalisé une très jolie parade pour l'arrêter. A la 109e, c'est un centre fuyant de Grace Geyoro devant le but qui n'a pas n'a pas trouvé de Bleues pour reprendre le ballon... Dans l'ensemble, les Françaises se sont montrées plus entreprenantes que les Australiennes dans les prolongations, mais pas suffisamment pour éviter les tirs au but. Avant le dernier acte de la rencontre, à la toute fin des prolongations, Hervé Renard avait choisi de remplacer la gardienne Peyraud-Magnin par Solène Durand et de faire rentrer Eve Périsset à la place de De Almeida.","pubDate":"2023-08-12 10:05:00","image_url":"http://www.lechorepublicain.fr/photoSRC/VVZTJ19dUTgIDAVOBQwd/fbl-wc-2023-women-match59-aus-fra_6567405.jpeg","source_id":"lechorepublicain","category":["sports"],"country":["france"],"language":"french"},{"title":"England v Colombia: Women’s World Cup quarter-final – live","link":"https://www.theguardian.com/football/live/2023/aug/12/england-v-colombia-womens-world-cup-quarter-final-live-score-updates","keywords":["Women's World Cup 2023","Women's World Cup","Women's football","England women's football team","Colombia women's football team","Football","Sport"],"creator":["Sarah Rendell"],"video_url":null,"description":"World Cup quarter-final, 11.30am BST/8.30pm AEST kick-offAustralia knock out France | Mail Sarah or tweet @rendellxHere are some of the players who could play a major part in the outcome of this quarter-final. Keep a close eye on Linda Caicedo, she has been one of the biggest stars so far in this tournament:Colombia have also gone early with their team news. They too have made one change with Manuela Vanegas returning from her suspension. Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 14m ago Half time! England 1-1 Colombia 16m ago GOAL! England 1-1 Colombia (Hemp, 45+6') 23m ago GOAL! England 0-1 Colombia (Santos, 44') 1h ago Kick-off! England 0-0 Colombia 2h ago Colombia team news 3h ago England team news 3h ago Intro Show key events only Please turn on JavaScript to use this feature 1m ago 07.37 EDT England have equalised but Colombia’s strike is the goal of the match, this could be a nomination for goal of the tournament (the clip is from ITV and so some may not have access): 🇨🇴 INCREDIBLE FROM LEICY SANTOS! Santos lobs Mary Earps from an unlikely angle to give #COL the lead against England... #FIFAWWC pic.twitter.com/Pq041pVlZS — ITV Football (@itvfootball) August 12, 2023 10m ago 07.28 EDT Enjoying the Guardian’s coverage of the Women’s World Cup? This action-packed, up-to-the-minute live blog is only possible thanks to funding from our fans all around the world. We don’t have a paywall, so everything we publish is open and free for everyone. Unlike so many others, the Guardian is fiercely independent – meaning we don’t have a billionaire owner who can censor us. Fund quality sports journalism from the Guardian today from as little as £1 . It takes less than a minute but makes a huge difference. Support the Guardian 12m ago 07.26 EDT Colombia were the better team on balance over that half, their defending overall was clinical and their attack was far more deadly. But an individual error from goalkeeper Perez has allowed England back into this match and at the perfect time. 14m ago 07.25 EDT Half time! England 1-1 Colombia Colombia found the opener with a superb Santos strike but England equalised just before the half! Everything to play for, what a match. Sign up for the Moving the Goalposts newsletter: our free women’s football email Read more Updated at 07.25 EDT 15m ago 07.24 EDT 45 + 7 min : The ball kept pinging around, Colombia just couldn’t clear their lines. Perez initially saved but she couldn’t control and Hemp strikes. 16m ago 07.23 EDT GOAL! England 1-1 Colombia (Hemp, 45+6') An error from Perez and Hemp is in! Perez and Carabali colide under pressure from Russo. Photograph: Cameron Spencer/Getty Images Hemp is on hand to tap in. Photograph: Lars Baron/Getty Images Updated at 07.32 EDT 18m ago 07.21 EDT 45 + 5 min : England have kept composure since going behind, they do need to put more pressure on Colombia to get something. But Colombia’s defence is so compact and clinical. Mary has said: “Oh my lord, what a beautiful goal by Santos. England needs to get to halftime and regroup. Somehow England needs to slow the tempo down, and not allow Columbia to play chaos football, they seem to thrive in that manic tempo.” 20m ago 07.19 EDT 45 + 3 min : That was also the first goal England have conceded in open play, the other was a penalty against China. Bright passes to Stanway, who lays it off to Russo but it’s blocked. 21m ago 07.18 EDT 45 + 1 min : This will be interesting to see how England react here, this is the first time they have gone behind at this World Cup. There are six minutes added. 22m ago 07.17 EDT 45 min : Santos was a step into the box, her shot beats Daly and it bends into the top left corner. Earps tries to save but there’s nothing she can do about it. How about this! An upset on the cards! 23m ago 07.16 EDT GOAL! England 0-1 Colombia (Santos, 44') OH MY! It was coming and what a peach of a shot. Wow. Santos lifts the ball from the edge of the box. Photograph: Carl Recine/Reuters Keeper Earps gets lobbed. Photograph: Lars Baron/Getty Images Santos celebrates scoring. Photograph: Carl Recine/Reuters Colombia’s players celebrate with Santo. Photograph: Zac Goodwin/PA Updated at 07.28 EDT 24m ago 07.15 EDT 44 min : Vanegas connects with Caicedo but she is offside – Colombia look more likely to score at the moment. They are having all the joy going forward, England’s last pass in the final third just not coming together. This time Bronze loses out to Vanegas but Bright comes to the rescue. 26m ago 07.13 EDT 42 min : Russo now has it in the box but D Arias sees it out. Toone wins a throw, she isn’t looking at her best in this one yet. Greenwood puts in a long range pass but it comes to Perez. 28m ago 07.11 EDT 40 min : Carabali pops it in, this time Earps collects. Colombia are doing well and have had more opportunities in the box, England get it so far and then Colombia repel their threat. 29m ago 07.10 EDT 39 min : Guzman lays it off to Ramirez and it comes back to the substitute. She pops it in and Caicedo gets to it, her shot is blocked. 30m ago 07.09 EDT 38 min : A bit of patient play now from England, this game has been all go. Russo loses the ball in the midfield though and here come Colombia! 31m ago 07.08 EDT 36 min : The free kick is short and then Greenwood pops it in but Vanegas beats Bright. Caicedo looks to peel away, Stanway fouls. 32m ago 07.06 EDT 35 min : Greenwood goes down again holding her face but I think she’s okay. Walsh taking on some instruction from Wiegman before we get back underway. Stanway with a great run but she is pulled back by Santos and England have a free kick. 34m ago 07.05 EDT 34 min : Guzman again has a beaut of a cross in but Bright heads away. England on the counter but Toone loses out to Carabali – a frantic exchange at both ends! This is so entertaining! Greenwood hits the deck but play continues, she is eventually back to her feet and heads the ball away. It’s hard to keep up with all of this! 36m ago 07.03 EDT 32 min : Guzman with a great cross, she has been involved a lot since coming on, but no one in the box can connect. England are quick to work it up the other end but Toone’s touch isn’t clean and Colombia clear. 37m ago 07.02 EDT 31 min : Lauren Hemp that is beautiful. She is hounded on the line but she manages to get away and passes to Walsh but she boots the ball over the bar. Bright does well up the other end to prevent a ball coming to Ramirez. 38m ago 07.00 EDT 29 min : Daly takes a long range effort and it’s just over the bar! Carabali so good there to not concede a corner. Joe has emailed and said: “Watching from Indianapolis with a thunderstorm rumbling in the vicinity. But where is the snack chat? Your readers expect nothing less!” Oh you have some weather setting a mood! Apologies, I am slacking on my snack chat! Today I am eating cherry tomatoes, very odd I know! Daly shoots. Photograph: Cameron Spencer/Getty Images Updated at 07.22 EDT 40m ago 06.58 EDT 27 min : Greenwood is over the set piece ball and it’s a good delivery, Daly misses the header but it comes back in for her. The Aston Villa player’s header is straight at Perez. 42m ago 06.57 EDT 26 min : Bronze is wide open and it eventually come to her and she wins a corner. 42m ago 06.57 EDT 26 min : The free kick is taken short but England are ran back to halfway, a chance wasted but the Lionesses are still in possession. 43m ago 06.56 EDT 25 min : Daly is up and okay to continue. England have a free kick now as Guzman fouls Hemp but that time I think it shouldn’t be a foul? Bizarre. 44m ago 06.54 EDT 23 min : Bronze with a storming run but she is crowded by three defenders and eventually the Barcelona defender fouls. Guzman absolutely clatters Daly, no foul given again. Play is stopped as she needs some treatment. Daly is fouled by Guzman. Photograph: Rick Rycroft/AP Updated at 07.05 EDT 46m ago 06.53 EDT 22 min : Usme waits for the ball but Greenwood heads away. Hemp is taken out off the ball by Guzman but it’s not been given as a foul? Strange decision. Santos pings it in but England do enough to keep it out, frantic defence from England at the moment. 48m ago 06.51 EDT 20 min : Daly pops it in, it’s initially cleared and then Vanegas dispossess Carter. A long range pass from Bright has too much on it and we have a throw. No sign of a breather in this one. 50m ago 06.49 EDT 18 min : Colombia doing well to marshal England’s forwards and it pays off with Walsh misplacing a pass. Colombia come now and Ramirez, who is such a threat, has a good run but her pass doesn’t come off. A balanced game so far, Colombia with more chances but England’s looked the more deadly. 52m ago 06.47 EDT 16 min : Caicedo, how is she only 18?! She’s playing like a seasoned player! Unbelievable cut down the left to leave Carter in the dust, her resulting shot is over the bar. A reminder Caicedo has scored at three World Cups in a year – two youth tournaments and this one! Caicedo eveades the efforts of Carter on the wing. Photograph: Bianca de Marchi/AAP Updated at 07.03 EDT 53m ago 06.45 EDT 14 min : Caicedo with a lovely run and she whips it to Usme. She lines up a huge shot, it’s blocked but great play. Greenwood calmly works it out – she is so dependable at the back. 54m ago 06.44 EDT 13 min : Julian has got in touch and said: “Any idea why England are being booed by the crowd?” Because there are a lot of Colombia fans in, they like to create an atmosphere and will do what they can to help their team! England will also thrive on the great atmosphere. Back to the game and England have the ball and ae building from deep. Fans of Colombia show their support. Photograph: Lars Baron/Getty Images Meanwhile, a lion roars. Photograph: Dean Lewins/EPA Updated at 07.09 EDT 1h ago 06.43 EDT 12 min : Guzman is on for C Arias, such a big miss for Colombia but Guzman did have a big part in Colombia’s goal against Jamaica! Here come England again, a blistering ball in and she heads it – Perez calmly collects. I can tell my hands are going to get tired in this one, so much action! 1h ago 06.41 EDT 10 min : I think C Arias is off, the medical team signalled to the bench she is out. Colombia are still with 10 and Bronze gets the ball in the box but it’s blocked. 1h ago 06.40 EDT 9 min : C Arias has limped to the sidelines, she doesn’t look happy. For now Colombia play with 10 as we get back underway. 1h ago 06.39 EDT 8 min : This doesn’t look good for C Arias, she is such a big player in this Colombian team so I hope she is okay to continue. She quite literally threw herself at the shot from Hemp. Arias lies on the ground after sustaining an injury. Photograph: Dean Lewins/EPA Updated at 06.59 EDT 1h ago 06.38 EDT 7 min : OH MY WORD! How, oh how, have England not scored?! Walsh the key cog to connect the team and it comes to Russo in the box, her shot is blocked but a superb but of defending, it drops for Hemp but it’s blocked again. MASSIVE. C Arias needs some treatment after that defensive effort. Russo has a shot which makes contact with the head of Arias. Photograph: Lars Baron/Getty Images Hemp’s ebound is also blocked. Photograph: Cameron Spencer/Getty Images Updated at 06.47 EDT 1 of 2 Next Oldest Oldest Topics Women's World Cup 2023 Women's World Cup Women's football England women's football team Colombia women's football team Reuse this content","pubDate":"2023-08-12 10:56:13","image_url":"https://i.guim.co.uk/img/media/6f7a8bc9c349a022c5e11aa3ce860c7609e725fd/167_456_4022_2413/master/4022.jpg?width=460&quality=85&auto=format&fit=max&s=a8c161a76154ce2e4b66b39b45a85858","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Coupe du monde féminine : «Il faut garder la tête haute et penser aux JO», lance Hervé Renard après l’élimination des Bleues","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde-feminine-le-destin-a-choisi-juge-herve-renard-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"Le sélectionneur des Bleues revient l’élimination face à l’Australie, en quarts du Mondial, à Brisbane.","content":"Hervé Renard (sélectionneur de l'équipe de France féminine, après l’élimination aux tirs au but face à l’Australie ) : « Ça m'est déjà arrivé, j'en ai gagné, j'en ai perdu. Ce soir (samedi), il faut être fier des filles, elles ont fait un match exceptionnel. Ça allait de droite à gauche, de gauche à droite. Dire qui méritait le plus c'est difficile donc félicitations à l'Australie. Et puis félicitations à tout le staff qui a fait un travail magnifique. Il faut garder la tête haute et puis penser aux Jeux olympiques. Il faut toujours persévérer et être fier de ce qu'elles ont fait. On a un stade entier, une nation contre nous. On a fait un match exceptionnel. C'est le football, c'est le destin qui a choisi. Bonne chance à l'Australie. On méritait je pense mieux mais c'est comme ça ». (sur France 2)","pubDate":"2023-08-12 10:50:48","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Ligue 1 : le PSG sans Mbappé contre Lorient, Neymar et Verratti manquent également à l’appel","link":"https://www.lefigaro.fr/sports/football/ligue-1/ligue-1-le-psg-sans-mbappe-contre-lorient-neymar-et-verratti-manquent-egalement-a-l-appel-20230812","keywords":["Ligue 1"],"creator":null,"video_url":null,"description":"Luis Enrique a convoqué un groupe de 20 joueurs pour affronter Lorient ce samedi (21h), lors de la première journée du championnat de France.","content":"Luis Enrique, première ! Après une salve de matches amicaux, le technicien espagnol de 53 ans dirigera son premier match officiel à la tête du PSG ce samedi (21h), face à Lorient, lors de la première journée de Ligue 1 . Ce sera bien évidemment sans Kylian Mbappé, absent du groupe de 20 joueurs dévoilé ce samedi matin. Le crack de Bondy est mis à l'écart par sa direction en raison de son refus de prolonger un contrat qui ne court que jusqu'en 2024 . Poussés vers la sortie, Neymar et Marco Verratti manquent également à l'appel. « Il y a les mots, mais mes actes sont encore plus parlants. Mes actions montreront quelles sont mes idées », expliquait «Lucho» vendredi , en conférence de presse, au sujet de ses plans pour les deux joueurs. À noter que le club évoquait un « syndrome viral » pour expliquer l'absence du Brésilien à l'entraînement vendredi. L'Italien, lui, a participé normalement à la séance avec le reste de ses coéquipiers. Parmi les 20 joueurs retenus, on retrouve notamment huit des neuf recrues parisiennes de l'été. Pas Ousmane Dembélé, dont la signature n'a été officialisée que ce samedi matin . Deux revenants, Keylor Navas et Layvin Kurzawa, prêtés à l’étranger la saison dernière. Outre Mbappé, Neymar et Verratti, on signalera les absences de Nordi Mukiele, Presnel Kimpembe ou encore Nuno Mendes, blessés ou en phase de reprise. Le tout sans oublier les «lofteurs», ces joueurs placés sur la liste des transferts par le club, comme Gini Wijnaldum, Abdou Diallo ou encore Leandro Paredes.","pubDate":"2023-08-12 10:45:11","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Coupe du monde féminine de foot : la fin du rêve pour les Bleues, éliminées par l'Australie aux tirs au but","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde/coupe-du-monde-feminine-la-fin-du-reve-pour-les-bleues-eliminees-par-l-australie-aux-tirs-au-but-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"L'équipe de France d'Hervé Renard prend la porte en quarts de la Coupe du monde face à l'Australie au terme d’une interminable séance de tirs au but.","content":"Jamais deux sans trois. Comme lors des deux dernières éditions de la Coupe du monde féminine, les Bleues ont pris la porte en quarts de finale. Elles ont été éliminées par l'Australie ce samedi ( 0-0 ap, 6-7 aux t.a.b. ) à Brisbane. Une interminable et mythique séance d’ailleurs. Les Australiennes défieront l'Angleterre ou la Colombie en demies de «leur» Mondial, un stade de la compétition que la France n'a atteint qu'une fois, en 2011, terminant à la quatrième place. À Brisbane, ce sont les Françaises qui ont le mieux débuté la rencontre, moins tendues que les Australiennes. Diani a allumé une première mèche (8e) et quelques minutes plus tard, Lakrar a manqué une opportunité énorme, à quelques mètres du but, suite à un centre-tir de Le Sommer (12e). Le Sommer maintenait la pression dans la foulée (28e) et Lakrar s'offrait encore une occasion en or (31e) juste avant que les Bleues ne disparaissent pendant plus de trente minutes. Jusque-là timorées, les Australiennes sortaient le bout de leur nez avant la pause. Suite à une mésentente entre Karchaoui et Peyraud-Magnin, Fowler pensait ouvrir le score mais c'était sans compter sur un sauvetage magnifique sur sa ligne de De Almeida (41e). Cela lançait le match des Matildas. Au retour des vestiaires, les Australiennes accéléraient et asphyxiaient les Bleues pendant un gros quart d'heure et de nombreuses situations chaudes sur le but de Peyraud-Magnin. Fowler (50e, 60e) faisait à nouveau frissonner les Tricolores avant que la rencontre ne tombe dans un faux rythme jusqu'à la prolongation. À VOIR AUSSI - La préparation des Bleues avant le quart de finale face à l’Australie Trente minutes supplémentaires donc et trente minutes animées avec un but refusé pour les Bleues (100e). Un corner inexistant, tiré par Bacha, était donné aux Françaises et converti...par Kennedy dans son propre but mais les Australiennes allaient finalement être sauvées par une faute de Renard sur Foord. Un tournant. Dans la foulée, Vine se montrait dangereuse (105e). Becho réagissait (107, 110e) sans réussite. La décision allait donc se faire aux tirs au but et pour l'exercice, Hervé Renard fit le choix de changer de gardienne. Exit Pauline Peyraud-Magnin et place à Solène Durand. Une séance de tirs au but pleine de tension avec pas moins de dix tireuses de chaque côté. Et à deux reprises, Durand maintenait les Bleues en vie lors des premières balles de match australiennes mais les Françaises manquaient la cible à de trop nombreuses reprises (Bacha, Perisset, Dali) et la jeune Becho, dixième tireuse, expédiait sa tentative sur le poteau d'Arnold, la gardienne australienne. Et cette fois-ci, Vine ne laissait pas passer la troisième balle de match, envoyant ainsi l'Australie dans le dernier carré mondial pour la toute première fois.","pubDate":"2023-08-12 10:40:28","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"LIVE NRL: Roosters land ‘big blow’ on stroke of halftime against ‘brave’ Dolphins","link":"https://www.foxsports.com.au/nrl/nrl-premiership/nrl-live-sydney-roosters-vs-the-dolphins-live-scores-final-teams-finals-chances-supercoach-scores-highlights-james-tedesco-wayne-bennett/news-story/29a946ebf8ea3ad960217a82ad4f4d12","keywords":null,"creator":null,"video_url":null,"description":"The Roosters have struck a “blow” right on halftime, with Joey Manu crossing for the Chooks’ first try of the night. They trail the Dolphins 8-6 at the break.","content":"The Roosters have struck a “blow” right on halftime, with Joey Manu crossing for the Chooks’ first try of the night. They trail the Dolphins 8-6 at the break. Ray Stone barged over from close range to break the deadlock after 25 minutes, with Jamayne Isaako adding a penalty goal ten minutes later. The Roosters have had quite a few opportunites at the Dolphins line, with the attacking woes that have plagued their season reappearing, but the away side have been brave in defense. MATCH CENTRE: Sydney Roosters vs the Dolphins live scores, teams, videos Round 24 NRL Aug 10 7:50pm AEST FT Sea Eagles 12 Panthers 24 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 11 6:00pm AEST FT Sharks 36 Titans 6 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 11 8:00pm AEST FT Broncos 54 Eels 10 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 12 3:00pm AEST FT Rabbitohs 26 Dragons 14 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 12 5:30pm AEST FT Tigers 22 Warriors 30 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL LIVE 51:06 Roosters 12 Dolphins 8 MATCH CENTRE $1.14 $5.50 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 13 2:00pm AEST Storm Raiders MATCH CENTRE $1.28 $3.70 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 13 4:05pm AEST Knights Bulldogs MATCH CENTRE $1.30 $3.50 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES Watch every game of every round of the 2023 NRL Telstra Premiership Season LIVE on Kayo Sports. New to Kayo? Start your free trial now >>> That was until there was just 15 seconds left in the half, which is when Joey Manu put his mark on the game. Roosters fullback James Tedesco ran at the line and drew in a couple of Dolphins, before turning it back inside to the hard running Manu. “Joey Manu finally cracks this brave Dolphins defence and the Roosters land a big blow right on halftime,” Dan Ginnane said on Fox League. MATCH PREVIEW The Roosters will be desperate to keep their finals hopes alive on Saturday night when they face Wayne Bennett’s Dolphins. Trent Robinson’s side have given themself no room for error in the race for post-season football with a loss finishing their season. Drew Hutchison has been named at halfback, with Sandon Smith on the bench which could see the rookie shift in to dummy-half to replace Brandon Smith. Elsewhere, Dylan Napa returns to the NRL after signing with the Roosters mid-season. For the Dolphins, Kodi Nikorima lines up at fullback which has shifted Origin star Hamiso Tabuai-Fidow in to the centres. Isaiya Katoa and Sean O’Sullivan partner in the halves with Anthony Milford on the bench in the utility role. Roosters team : 1. James Tedesco 2. Daniel Tupou 3. Billy Smith 4. Joseph Manu 5. Joseph-Aukuso Suaalii 6. Luke Keary 7. Drew Hutchison 8. Jared Waerea-Hargreaves 9. Brandon Smith 10. Lindsay Collins 11. Nat Butcher 12. Siua Wong 13. Victor Radley 14. Sandon Smith 15. Fletcher Baker 16. Terrell May 17. Dylan Napa 22. Corey Allan Dolphins team : 1. Kodi Nikorima 2. Jamayne Isaako 3. Hamiso Tabuai-Fidow 4. Valynce Te Whare 5. Tesi Niu 6. Isaiya Katoa 7. Sean O’Sullivan 8. Jesse Bromwich 9. Jeremy Marshall-King 10. Mark Nicholls 11. Felise Kaufusi 12. Connelly Lemuelu 13. Kenny Bromwich 14. Ray Stone 15. Josh Kerr 16. Anthony Milford 17. Jarrod Wallace 18. Herman Ese’ese Get all the latest NRL news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now!! Catch all the action below in our live blog, if you can’t see it click here!","pubDate":"2023-08-12 10:30:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Les notes des Bleues face à l'Australie : De Almeida rebondit, Toletti déçoit","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde/les-notes-des-bleues-face-a-l-australie-de-almeida-rebondit-toletti-decoit-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"Découvrez les notes attribuées aux joueuses de l'équipe de France après l'élimination (0-0, 7-6 t.a.b) face à l'Australie en quart de finale de la Coupe du monde féminine, ce samedi, à Brisbane.","content":"Pauline Peyraud-Magnin (4) : Son match a été à l'image de son Mondial, frustrant. Encore terriblement en difficulté dans le jeu au pied, la gardienne tricolore s'est cette fois montrée maladroite dans les airs, passant au travers presque à chaque fois. Elle a réalisé plusieurs parades décisives en seconde période, avant d'être remplacée par Solène Durand pour la séance de tirs au but. Malgré deux arrêts, la gardienne de Sassuolo n'a pu sauver les Bleues. Elisa De Almeida (7) : Préférée à Eve Perisset sur le côté droit de la défense dans le onze de départ, elle a cette fois fait preuve de rigueur et de combativité pour contenir Foord, la principale menace australienne. Puis elle réalise un sauvetage incroyable devant Fowler (41e), avant de multiplier les interventions dans sa surface de réparation. Remplacée par Perisset, qui manque son tir au but. Maelle Lakrar (4) : Absente en 8es de finale sur blessure, la Montpelliéraine a fait son retour avec un imposant bandage sur la…","pubDate":"2023-08-12 10:25:50","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"What time do the Matildas play their semi final?","link":"https://www.foxsports.com.au/football/world-cup/what-time-do-the-matildas-play-their-semi-final/news-story/f826f9e50b8b51093abd228379f039e0","keywords":null,"creator":null,"video_url":null,"description":"The Matildas are into the semi-final of the FIFA Women’s World Cup for the first time in their history after a thrilling victory over France via a nailbiting penalty shootout.","content":"The Matildas are into the semi-final of the FIFA Women’s World Cup for the first time in their history after a thrilling victory over France via a nailbiting penalty shootout. Super-sub Cortnee Vine converted the winning penalty to spark jubilant scenes at Brisbane Stadium as the Matildas sealed a spot in the final four. Football fans across the nation now will be asking when and where the Matildas will play their next game. The Matildas will play their semi-final clash on Wednesday August 16, with kick-off schedule for 8pm AEST. The game will be played at Stadium Australia in Sydney, meaning yet another attendance record could be broken. The Matildas’ opponent will be the winner of the quarterfinal between England and Colombia.","pubDate":"2023-08-12 10:24:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Les Bleues éliminées en quarts de la Coupe du monde après une séance de tirs au but irrespirable face à l'Australie","link":"https://www.lequipe.fr/Football/Actualites/Les-bleues-eliminees-en-quarts-de-la-coupe-du-monde-apres-une-seance-de-tirs-au-but-irrespirable-face-a-l-australie/1413206#xtor=RSS-1","keywords":["Foot, CM 2023"],"creator":["Sébastien Buron"],"video_url":null,"description":"La France a été éliminée en quarts de finale de la Coupe du monde après une séance de tirs au but irrespirable, ce samedi, face à l'Australie (0-0 a.p., 6-7 aux t.a.b.). Le rêve de décrocher le sacre mondial s'est envolé pour les Bleues de Hervé Renard.","content":"Le match : 0-0 a.p., 7-6 aux t.a.b. Elles sont tombées de détresse sur la pelouse et les regrets seront, forcément, immenses après cette nouvelle désillusion. L'équipe de France féminine espérait décrocher son premier titre mondial cet été et elle devra toujours courir, dans quatre ans, après cet objectif. Face à l'Australie, coorganisatrice de l'épreuve avec la Nouvelle-Zélande, les Bleues ont vu leur rêve s'envoler au terme d'une séance de tirs au but irrespirable (0-0 a.p., 6-7 aux t.a.b.). Le début de rencontre laissait pourtant entrevoir une autre issue tant les joueuses de Hervé Renard, malgré le jeu dur des Australiennes, se montraient supérieures. À la 35e minute, les statistiques traduisaient cette domination : 8 tirs à 2 pour la France. Mais le score était toujours de 0-0. Car Diani avait tiré à côté (8e), Arnold avait repoussé les tirs de Le Sommer (28e) et Lakrar (32e), et la défenseuse avait surtout raté un but tout fait à la 12e minute. La fin de la première période a annoncé une bascule. De Almeida a sauvé devant sa ligne un tir de Fowler après une mésentente entre Karchaoui et Peyraud-Magnin (41e), la gardienne française s'est ensuite interposée devant l'attaquante australienne (45e) et le rapport de force a continué sur cette lancée au retour des vestiaires. Fowler a vu sa frappe déviée par De Almeida après une relance totalement ratée de Peyraud-Magnin (50e), très fébrile jusque-là, mais décisive ensuite par deux très belles parades sur des tentatives de Raso (56e) puis - encore - de Fowler (60e). Entre-temps, la star australienne Sam Kerr, pas encore à 100 %, avait fait son entrée sur la pelouse (55e) et l'inquiétude pouvait grandir. Incapables de se créer la moindre occasion toute la seconde période, les Bleues étaient alors au bord du précipice. Bacha, Périsset, Dali et Becho en échec Elles ont sorti la tête de l'eau en prolongation et ont même cru ouvrir le score sur un csc de Kennedy, mais le but était refusé pour un tirage de maillot de Renard sur Foord (100e). Vine (105e), Becho (107e) étaient à leur tour proches du K.-O., Catley a réussi un superbe sauvetage (110e), et Hervé Renard a tenté un immense coup en remplaçant Peyraud-Magnin par Solène Durand pour les tirs au but. Mais ses arrêts lors de la séance fatidique n'auront pas suffi face aux échecs de Bacha, Périsset et Dali, qui avait pourtant pu retirer une deuxième fois, et de Becho. Comme en 2015, face à l'Allemagne (1-1 a.p., 4-5 aux t.a.b.), les Bleues ont craqué lors de la séance fatidique. Un mois après avoir dominé les Bleues en amical (1-0) le 14 juillet, jour de la Fête Nationale en France, les Australiennes ont, dans la folie de Brisbane, pu célébrer leur première qualification de leur histoire pour les demi-finales de la Coupe du monde. 3 Pour la troisième fois de suite, la France a été éliminée en quarts de finale de la Coupe du monde féminine. Les Bleues n'ont atteint qu'une fois le dernier carré, en 2011. Elles avaient alors terminé 4es.","pubDate":"2023-08-12 10:08:44","image_url":"https://medias.lequipe.fr/img-photo-jpg/la-deception-des-bleues-ce-samedi-a-b-ratnayake-reuters/1500000001819605/0:0,1998:999-665-335-70/3061d.jpg","source_id":"lequipe","category":["sports"],"country":["france"],"language":"french"},{"title":"Harry Kane hints at future Tottenham return after finishing Bayern Munich transfer","link":"https://www.businesslend.com/sports/harry-kane-hints-at-future-tottenham-return-after-completing-bayern-munich-move/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox totally free Sign as much as Miguel’s Delaney’s free weekly publication England captain Harry Kane has left the door open for a return to Tottenham after finishing his £100million transfer to Bayern Munich. Kane travelled to Germany on Friday for [...] The post Harry Kane hints at future Tottenham return after finishing Bayern Munich transfer appeared first on BusinessLend.","content":"England captain Harry Kane has left the door open for a return to Tottenham after finishing his £100million transfer to Bayern Munich. Kane travelled to Germany on Friday for a medical and the Bundesliga giants confirmed on Saturday morning he had signed a deal till June 2027 and can put on the quantity 9 shirt. Spurs chairman Daniel Levy stated the membership had “reluctantly” agreed to the transfer after Kane, who was within the final 12 months of his contract, made it clear he needed a recent problem. Kane stated in a message to Tottenham followers posted on his social media accounts: “It’s not a goodbye because you never know how things pan out in the future, but it’s a thank you and I’ll see you soon.” The 30-year-old informed his new membership’s web site that he hoped to play some half in Bayern’s DFB Super Cup match with RB Leipzig on Saturday evening as he appears to be like to win the primary trophy of his profession. “I’m very happy to be a part of FC Bayern now,” Kane stated. “Bayern is one of the biggest clubs in the world and I’ve always said that I want to compete and prove myself at the highest level during my career. This club is defined by its winning mentality – it feels very good to be here. “I feel like it was the right step in my career to really push myself and test myself on the highest level so that’s why I’m here and I look forward to that challenge.” Shortly earlier than the deal was formally confirmed, Kane posted a message on social media wherein he thanked the followers and stated he had not needed to begin the season together with his future unresolved. “From the moment I’ve been playing I’ve been one of your own and I’ve given everything that I possibly could to make you proud and give you as many special moments and memories to hopefully last forever,” Kane stated. “This is a message to all you fans around the world, every single Tottenham fan that’s supported me and been with me throughout my journey. “Me and my family will cherish it forever, we’ll never forget all the moments we’ve had together so thank you. “I felt like it was the time to leave. I didn’t want to go into the season with a lot of unresolved future talk. “I think it’s important for the new manager and the players to concentrate on trying to get Tottenham back to around the top of the table and fighting for trophies so I wish Ange (Postecoglou) and all the boys all the very best of luck. “I’ll be watching from a fan point of view now and really hope the team can be successful.” Postecoglou had revealed on Friday that Kane’s transfer was “imminent” after a breakthrough in negotiations between the golf equipment was reached on Wednesday evening. It left the ball in Kane’s court docket and he selected Thursday to depart his boyhood membership for Bayern, who pays an preliminary £100m with add-ons probably taking the deal as much as an total charge of £120m, the PA information company understands. Kane leaves Tottenham having scored 280 targets to develop into the membership’s all-time main goalscorer, however with out a trophy. “I think it’s important for the new manager and the players to concentrate on trying to get Tottenham back to around the top of the table and fighting for trophies so I wish Ange (Postecoglou) and all the boys all the very best of luck,” Kane stated. “I’ll be watching from a fan point of view now and really hope the team can be successful.” Bayern had seen their earlier bids for Kane turned down, however refused to surrender their pursuit of the 30-year-old, who stays 47 targets shy of equalling Alan Shearer’s Premier League file of 260. Harry was clear that he needed a recent problem and wouldn’t be signing a brand new contract this summer season Levy informed the membership’s web site: “We sought over a long period of time to engage Harry and his representatives in several forms of contract extension, both short and long term. “Harry was clear, however, that he wanted a fresh challenge and would not be signing a new contract this summer. We have reluctantly, therefore, agreed to his transfer. “We have seen a product of our academy system become one of the best players to ever pull on a Spurs shirt and become one of world football’s elite strikers. It has been a truly remarkable journey.” Harry Kane’s highs and lows at Tottenham as he indicators with Bayern Munich","pubDate":"2023-08-12 10:07:27","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Les Bleues éliminées de la Coupe du monde par l'Australie aux tirs au but","link":"http://www.lechorepublicain.fr/paris-75000/sports/les-bleues-eliminees-de-la-coupe-du-monde-par-l-australie-aux-tirs-au-but_14356065/","keywords":["PARIS"],"creator":null,"video_url":null,"description":"La France affrontait l'Australie, ce samedi 12 août, à Brisbane, en quart de finale de la coupe du monde féminine. Les Bleues se sont inclinées aux tirs au but (6-7).","content":"Dans une première mi-temps plutôt timide, aucune des deux équipes n'est parvenue à inscrire le moindre un but. Les Bleues ont toutefois maitrisé la majeure partie de ce premier acte avec quelques occasions, notamment dès la 7e minute de jeu : sur une mauvaise relance de l'Australienne Alanna Kennedy, la Française Kadidiatou Diani lui chipe la balle et lâche une frappe trop croisée, qui passe à côté de la cage. Première frayeur pour les Matildas. À la 27e minute, il y a eu aussi ce tir de la numéro 9 tricolore, Eugénie Le Sommer, contré par la défense et finalement repoussé par la gardienne Mackenzie Arnold. Et puis c'est à peu près tout ce que ce quart de finale avait à offrir... Jusqu'au sauvetage miraculeux sur la ligne de but de l'arrière droit des Bleues, Elisa De Almeida. Après une incursion australienne dans la surface de réparation, et une mésentente entre la gardienne Pauline Peyraud-Magnin et Sakina Karchaoui, l'attaquante Mary Fowler décroche une frappe qui aurait dû finir au fond de la cage de but vide. Mais l'intervention spectaculaire de De Almeida permet de garder un score vierge à la 45e minute. La deuxième mi-temps aurait néanmoins pu être fatale aux Bleues, face à des Australiennes ultra dominantes, mais qui n'ont pas réussi à trouver le chemin des buts. Dès l'entame du deuxième acte, les Matildas ont pris d'assaut la surface de réparation tricolore. La première grosse occasion arrive à la 55e minute de jeu, juste après l'entrée sur le terrain de la star australienne Sam Kerr, sous l'ovation des 49 000 spectateurs. À l'entrée de la surface, Hayley Raso déclenche une frappe puissante qui est bien repoussée par Peyraud-Magnin. Peu de temps après, à la 59e, l'attaquante Fowler se distingue à nouveau, à bout portant, mais trouve une nouvelle fois sur son chemin la gardienne française. C'est alors qu'Hervé Renard décide d'effectuer son premier changement du match (64e), avec l'entrée en jeu de Vicky Becho à la place de Sandie Toletti. Les Bleues remettent un peu la tête à l'endroit, et subissent un peu moins. Mais se procurent qu'une toute petite occasion en deuxième mi-temps, loin d'être suffisant pour forcer le destin en 90 minutes, ce qui a donc laissé place aux prolongations. Dans la première partie des prolongations, les Bleues pensaient que le plus difficile était fait, après une tête contre son camp de Kennedy qui cherchait à défendre sur un corner (99e). Mais l'abrite siffle faute pour les Australiennes après un tirage de maillot de Wendie Renard dans la surface de réparation. À la 104e, un centre très dangereux de l'Australienne Caitlin Foord pour Cortnee Vine, qui venait d'entrer en jeu, finit dans le petit filet extérieur. Dans la deuxième mi-temps des prolongations, une frappe de Becho (107e) se dirigeait vers la lucarne mais la gardienne a réalisé une très jolie parade pour l'arrêter. A la 109e, c'est un centre fuyant de Grace Geyoro devant le but qui n'a pas n'a pas trouvé de Bleues pour reprendre le ballon... Dans l'ensemble, les Françaises se sont montrées plus entreprenantes que les Australiennes dans les prolongations, mais pas suffisamment pour éviter les tirs au but. Avant le dernier acte de la rencontre, à la toute fin des prolongations, Hervé Renard avait choisi de remplacer la gardienne Peyraud-Magnin par Solène Durand et de faire rentrer Eve Périsset à la place de De Almeida.","pubDate":"2023-08-12 10:05:00","image_url":"http://www.lechorepublicain.fr/photoSRC/VVZTJ19dUTgIDAVOBQwd/fbl-wc-2023-women-match59-aus-fra_6567405.jpeg","source_id":"lechorepublicain","category":["sports"],"country":["france"],"language":"french"},{"title":"England v Colombia: Women’s World Cup quarter-final – live","link":"https://www.theguardian.com/football/live/2023/aug/12/england-v-colombia-womens-world-cup-quarter-final-live-score-updates","keywords":["Women's World Cup 2023","Women's World Cup","Women's football","England women's football team","Colombia women's football team","Football","Sport"],"creator":["Sarah Rendell"],"video_url":null,"description":"World Cup quarter-final, 11.30am BST/8.30pm AEST kick-offAustralia knock out France | Mail Sarah or tweet @rendellxHere are some of the players who could play a major part in the outcome of this quarter-final. Keep a close eye on Linda Caicedo, she has been one of the biggest stars so far in this tournament:Colombia have also gone early with their team news. They too have made one change with Manuela Vanegas returning from her suspension. Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 14m ago Half time! England 1-1 Colombia 16m ago GOAL! England 1-1 Colombia (Hemp, 45+6') 23m ago GOAL! England 0-1 Colombia (Santos, 44') 1h ago Kick-off! England 0-0 Colombia 2h ago Colombia team news 3h ago England team news 3h ago Intro Show key events only Please turn on JavaScript to use this feature 1m ago 07.37 EDT England have equalised but Colombia’s strike is the goal of the match, this could be a nomination for goal of the tournament (the clip is from ITV and so some may not have access): 🇨🇴 INCREDIBLE FROM LEICY SANTOS! Santos lobs Mary Earps from an unlikely angle to give #COL the lead against England... #FIFAWWC pic.twitter.com/Pq041pVlZS — ITV Football (@itvfootball) August 12, 2023 10m ago 07.28 EDT Enjoying the Guardian’s coverage of the Women’s World Cup? This action-packed, up-to-the-minute live blog is only possible thanks to funding from our fans all around the world. We don’t have a paywall, so everything we publish is open and free for everyone. Unlike so many others, the Guardian is fiercely independent – meaning we don’t have a billionaire owner who can censor us. Fund quality sports journalism from the Guardian today from as little as £1 . It takes less than a minute but makes a huge difference. Support the Guardian 12m ago 07.26 EDT Colombia were the better team on balance over that half, their defending overall was clinical and their attack was far more deadly. But an individual error from goalkeeper Perez has allowed England back into this match and at the perfect time. 14m ago 07.25 EDT Half time! England 1-1 Colombia Colombia found the opener with a superb Santos strike but England equalised just before the half! Everything to play for, what a match. Sign up for the Moving the Goalposts newsletter: our free women’s football email Read more Updated at 07.25 EDT 15m ago 07.24 EDT 45 + 7 min : The ball kept pinging around, Colombia just couldn’t clear their lines. Perez initially saved but she couldn’t control and Hemp strikes. 16m ago 07.23 EDT GOAL! England 1-1 Colombia (Hemp, 45+6') An error from Perez and Hemp is in! Perez and Carabali colide under pressure from Russo. Photograph: Cameron Spencer/Getty Images Hemp is on hand to tap in. Photograph: Lars Baron/Getty Images Updated at 07.32 EDT 18m ago 07.21 EDT 45 + 5 min : England have kept composure since going behind, they do need to put more pressure on Colombia to get something. But Colombia’s defence is so compact and clinical. Mary has said: “Oh my lord, what a beautiful goal by Santos. England needs to get to halftime and regroup. Somehow England needs to slow the tempo down, and not allow Columbia to play chaos football, they seem to thrive in that manic tempo.” 20m ago 07.19 EDT 45 + 3 min : That was also the first goal England have conceded in open play, the other was a penalty against China. Bright passes to Stanway, who lays it off to Russo but it’s blocked. 21m ago 07.18 EDT 45 + 1 min : This will be interesting to see how England react here, this is the first time they have gone behind at this World Cup. There are six minutes added. 22m ago 07.17 EDT 45 min : Santos was a step into the box, her shot beats Daly and it bends into the top left corner. Earps tries to save but there’s nothing she can do about it. How about this! An upset on the cards! 23m ago 07.16 EDT GOAL! England 0-1 Colombia (Santos, 44') OH MY! It was coming and what a peach of a shot. Wow. Santos lifts the ball from the edge of the box. Photograph: Carl Recine/Reuters Keeper Earps gets lobbed. Photograph: Lars Baron/Getty Images Santos celebrates scoring. Photograph: Carl Recine/Reuters Colombia’s players celebrate with Santo. Photograph: Zac Goodwin/PA Updated at 07.28 EDT 24m ago 07.15 EDT 44 min : Vanegas connects with Caicedo but she is offside – Colombia look more likely to score at the moment. They are having all the joy going forward, England’s last pass in the final third just not coming together. This time Bronze loses out to Vanegas but Bright comes to the rescue. 26m ago 07.13 EDT 42 min : Russo now has it in the box but D Arias sees it out. Toone wins a throw, she isn’t looking at her best in this one yet. Greenwood puts in a long range pass but it comes to Perez. 28m ago 07.11 EDT 40 min : Carabali pops it in, this time Earps collects. Colombia are doing well and have had more opportunities in the box, England get it so far and then Colombia repel their threat. 29m ago 07.10 EDT 39 min : Guzman lays it off to Ramirez and it comes back to the substitute. She pops it in and Caicedo gets to it, her shot is blocked. 30m ago 07.09 EDT 38 min : A bit of patient play now from England, this game has been all go. Russo loses the ball in the midfield though and here come Colombia! 31m ago 07.08 EDT 36 min : The free kick is short and then Greenwood pops it in but Vanegas beats Bright. Caicedo looks to peel away, Stanway fouls. 32m ago 07.06 EDT 35 min : Greenwood goes down again holding her face but I think she’s okay. Walsh taking on some instruction from Wiegman before we get back underway. Stanway with a great run but she is pulled back by Santos and England have a free kick. 34m ago 07.05 EDT 34 min : Guzman again has a beaut of a cross in but Bright heads away. England on the counter but Toone loses out to Carabali – a frantic exchange at both ends! This is so entertaining! Greenwood hits the deck but play continues, she is eventually back to her feet and heads the ball away. It’s hard to keep up with all of this! 36m ago 07.03 EDT 32 min : Guzman with a great cross, she has been involved a lot since coming on, but no one in the box can connect. England are quick to work it up the other end but Toone’s touch isn’t clean and Colombia clear. 37m ago 07.02 EDT 31 min : Lauren Hemp that is beautiful. She is hounded on the line but she manages to get away and passes to Walsh but she boots the ball over the bar. Bright does well up the other end to prevent a ball coming to Ramirez. 38m ago 07.00 EDT 29 min : Daly takes a long range effort and it’s just over the bar! Carabali so good there to not concede a corner. Joe has emailed and said: “Watching from Indianapolis with a thunderstorm rumbling in the vicinity. But where is the snack chat? Your readers expect nothing less!” Oh you have some weather setting a mood! Apologies, I am slacking on my snack chat! Today I am eating cherry tomatoes, very odd I know! Daly shoots. Photograph: Cameron Spencer/Getty Images Updated at 07.22 EDT 40m ago 06.58 EDT 27 min : Greenwood is over the set piece ball and it’s a good delivery, Daly misses the header but it comes back in for her. The Aston Villa player’s header is straight at Perez. 42m ago 06.57 EDT 26 min : Bronze is wide open and it eventually come to her and she wins a corner. 42m ago 06.57 EDT 26 min : The free kick is taken short but England are ran back to halfway, a chance wasted but the Lionesses are still in possession. 43m ago 06.56 EDT 25 min : Daly is up and okay to continue. England have a free kick now as Guzman fouls Hemp but that time I think it shouldn’t be a foul? Bizarre. 44m ago 06.54 EDT 23 min : Bronze with a storming run but she is crowded by three defenders and eventually the Barcelona defender fouls. Guzman absolutely clatters Daly, no foul given again. Play is stopped as she needs some treatment. Daly is fouled by Guzman. Photograph: Rick Rycroft/AP Updated at 07.05 EDT 46m ago 06.53 EDT 22 min : Usme waits for the ball but Greenwood heads away. Hemp is taken out off the ball by Guzman but it’s not been given as a foul? Strange decision. Santos pings it in but England do enough to keep it out, frantic defence from England at the moment. 48m ago 06.51 EDT 20 min : Daly pops it in, it’s initially cleared and then Vanegas dispossess Carter. A long range pass from Bright has too much on it and we have a throw. No sign of a breather in this one. 50m ago 06.49 EDT 18 min : Colombia doing well to marshal England’s forwards and it pays off with Walsh misplacing a pass. Colombia come now and Ramirez, who is such a threat, has a good run but her pass doesn’t come off. A balanced game so far, Colombia with more chances but England’s looked the more deadly. 52m ago 06.47 EDT 16 min : Caicedo, how is she only 18?! She’s playing like a seasoned player! Unbelievable cut down the left to leave Carter in the dust, her resulting shot is over the bar. A reminder Caicedo has scored at three World Cups in a year – two youth tournaments and this one! Caicedo eveades the efforts of Carter on the wing. Photograph: Bianca de Marchi/AAP Updated at 07.03 EDT 53m ago 06.45 EDT 14 min : Caicedo with a lovely run and she whips it to Usme. She lines up a huge shot, it’s blocked but great play. Greenwood calmly works it out – she is so dependable at the back. 54m ago 06.44 EDT 13 min : Julian has got in touch and said: “Any idea why England are being booed by the crowd?” Because there are a lot of Colombia fans in, they like to create an atmosphere and will do what they can to help their team! England will also thrive on the great atmosphere. Back to the game and England have the ball and ae building from deep. Fans of Colombia show their support. Photograph: Lars Baron/Getty Images Meanwhile, a lion roars. Photograph: Dean Lewins/EPA Updated at 07.09 EDT 1h ago 06.43 EDT 12 min : Guzman is on for C Arias, such a big miss for Colombia but Guzman did have a big part in Colombia’s goal against Jamaica! Here come England again, a blistering ball in and she heads it – Perez calmly collects. I can tell my hands are going to get tired in this one, so much action! 1h ago 06.41 EDT 10 min : I think C Arias is off, the medical team signalled to the bench she is out. Colombia are still with 10 and Bronze gets the ball in the box but it’s blocked. 1h ago 06.40 EDT 9 min : C Arias has limped to the sidelines, she doesn’t look happy. For now Colombia play with 10 as we get back underway. 1h ago 06.39 EDT 8 min : This doesn’t look good for C Arias, she is such a big player in this Colombian team so I hope she is okay to continue. She quite literally threw herself at the shot from Hemp. Arias lies on the ground after sustaining an injury. Photograph: Dean Lewins/EPA Updated at 06.59 EDT 1h ago 06.38 EDT 7 min : OH MY WORD! How, oh how, have England not scored?! Walsh the key cog to connect the team and it comes to Russo in the box, her shot is blocked but a superb but of defending, it drops for Hemp but it’s blocked again. MASSIVE. C Arias needs some treatment after that defensive effort. Russo has a shot which makes contact with the head of Arias. Photograph: Lars Baron/Getty Images Hemp’s ebound is also blocked. Photograph: Cameron Spencer/Getty Images Updated at 06.47 EDT 1 of 2 Next Oldest Oldest Topics Women's World Cup 2023 Women's World Cup Women's football England women's football team Colombia women's football team Reuse this content","pubDate":"2023-08-12 10:56:13","image_url":"https://i.guim.co.uk/img/media/6f7a8bc9c349a022c5e11aa3ce860c7609e725fd/167_456_4022_2413/master/4022.jpg?width=460&quality=85&auto=format&fit=max&s=a8c161a76154ce2e4b66b39b45a85858","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Coupe du monde féminine : «Il faut garder la tête haute et penser aux JO», lance Hervé Renard après l’élimination des Bleues","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde-feminine-le-destin-a-choisi-juge-herve-renard-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"Le sélectionneur des Bleues revient l’élimination face à l’Australie, en quarts du Mondial, à Brisbane.","content":"Hervé Renard (sélectionneur de l'équipe de France féminine, après l’élimination aux tirs au but face à l’Australie ) : « Ça m'est déjà arrivé, j'en ai gagné, j'en ai perdu. Ce soir (samedi), il faut être fier des filles, elles ont fait un match exceptionnel. Ça allait de droite à gauche, de gauche à droite. Dire qui méritait le plus c'est difficile donc félicitations à l'Australie. Et puis félicitations à tout le staff qui a fait un travail magnifique. Il faut garder la tête haute et puis penser aux Jeux olympiques. Il faut toujours persévérer et être fier de ce qu'elles ont fait. On a un stade entier, une nation contre nous. On a fait un match exceptionnel. C'est le football, c'est le destin qui a choisi. Bonne chance à l'Australie. On méritait je pense mieux mais c'est comme ça ». (sur France 2)","pubDate":"2023-08-12 10:50:48","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Ligue 1 : le PSG sans Mbappé contre Lorient, Neymar et Verratti manquent également à l’appel","link":"https://www.lefigaro.fr/sports/football/ligue-1/ligue-1-le-psg-sans-mbappe-contre-lorient-neymar-et-verratti-manquent-egalement-a-l-appel-20230812","keywords":["Ligue 1"],"creator":null,"video_url":null,"description":"Luis Enrique a convoqué un groupe de 20 joueurs pour affronter Lorient ce samedi (21h), lors de la première journée du championnat de France.","content":"Luis Enrique, première ! Après une salve de matches amicaux, le technicien espagnol de 53 ans dirigera son premier match officiel à la tête du PSG ce samedi (21h), face à Lorient, lors de la première journée de Ligue 1 . Ce sera bien évidemment sans Kylian Mbappé, absent du groupe de 20 joueurs dévoilé ce samedi matin. Le crack de Bondy est mis à l'écart par sa direction en raison de son refus de prolonger un contrat qui ne court que jusqu'en 2024 . Poussés vers la sortie, Neymar et Marco Verratti manquent également à l'appel. « Il y a les mots, mais mes actes sont encore plus parlants. Mes actions montreront quelles sont mes idées », expliquait «Lucho» vendredi , en conférence de presse, au sujet de ses plans pour les deux joueurs. À noter que le club évoquait un « syndrome viral » pour expliquer l'absence du Brésilien à l'entraînement vendredi. L'Italien, lui, a participé normalement à la séance avec le reste de ses coéquipiers. Parmi les 20 joueurs retenus, on retrouve notamment huit des neuf recrues parisiennes de l'été. Pas Ousmane Dembélé, dont la signature n'a été officialisée que ce samedi matin . Deux revenants, Keylor Navas et Layvin Kurzawa, prêtés à l’étranger la saison dernière. Outre Mbappé, Neymar et Verratti, on signalera les absences de Nordi Mukiele, Presnel Kimpembe ou encore Nuno Mendes, blessés ou en phase de reprise. Le tout sans oublier les «lofteurs», ces joueurs placés sur la liste des transferts par le club, comme Gini Wijnaldum, Abdou Diallo ou encore Leandro Paredes.","pubDate":"2023-08-12 10:45:11","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Coupe du monde féminine de foot : la fin du rêve pour les Bleues, éliminées par l'Australie aux tirs au but","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde/coupe-du-monde-feminine-la-fin-du-reve-pour-les-bleues-eliminees-par-l-australie-aux-tirs-au-but-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"L'équipe de France d'Hervé Renard prend la porte en quarts de la Coupe du monde face à l'Australie au terme d’une interminable séance de tirs au but.","content":"Jamais deux sans trois. Comme lors des deux dernières éditions de la Coupe du monde féminine, les Bleues ont pris la porte en quarts de finale. Elles ont été éliminées par l'Australie ce samedi ( 0-0 ap, 6-7 aux t.a.b. ) à Brisbane. Une interminable et mythique séance d’ailleurs. Les Australiennes défieront l'Angleterre ou la Colombie en demies de «leur» Mondial, un stade de la compétition que la France n'a atteint qu'une fois, en 2011, terminant à la quatrième place. À Brisbane, ce sont les Françaises qui ont le mieux débuté la rencontre, moins tendues que les Australiennes. Diani a allumé une première mèche (8e) et quelques minutes plus tard, Lakrar a manqué une opportunité énorme, à quelques mètres du but, suite à un centre-tir de Le Sommer (12e). Le Sommer maintenait la pression dans la foulée (28e) et Lakrar s'offrait encore une occasion en or (31e) juste avant que les Bleues ne disparaissent pendant plus de trente minutes. Jusque-là timorées, les Australiennes sortaient le bout de leur nez avant la pause. Suite à une mésentente entre Karchaoui et Peyraud-Magnin, Fowler pensait ouvrir le score mais c'était sans compter sur un sauvetage magnifique sur sa ligne de De Almeida (41e). Cela lançait le match des Matildas. Au retour des vestiaires, les Australiennes accéléraient et asphyxiaient les Bleues pendant un gros quart d'heure et de nombreuses situations chaudes sur le but de Peyraud-Magnin. Fowler (50e, 60e) faisait à nouveau frissonner les Tricolores avant que la rencontre ne tombe dans un faux rythme jusqu'à la prolongation. À VOIR AUSSI - La préparation des Bleues avant le quart de finale face à l’Australie Trente minutes supplémentaires donc et trente minutes animées avec un but refusé pour les Bleues (100e). Un corner inexistant, tiré par Bacha, était donné aux Françaises et converti...par Kennedy dans son propre but mais les Australiennes allaient finalement être sauvées par une faute de Renard sur Foord. Un tournant. Dans la foulée, Vine se montrait dangereuse (105e). Becho réagissait (107, 110e) sans réussite. La décision allait donc se faire aux tirs au but et pour l'exercice, Hervé Renard fit le choix de changer de gardienne. Exit Pauline Peyraud-Magnin et place à Solène Durand. Une séance de tirs au but pleine de tension avec pas moins de dix tireuses de chaque côté. Et à deux reprises, Durand maintenait les Bleues en vie lors des premières balles de match australiennes mais les Françaises manquaient la cible à de trop nombreuses reprises (Bacha, Perisset, Dali) et la jeune Becho, dixième tireuse, expédiait sa tentative sur le poteau d'Arnold, la gardienne australienne. Et cette fois-ci, Vine ne laissait pas passer la troisième balle de match, envoyant ainsi l'Australie dans le dernier carré mondial pour la toute première fois.","pubDate":"2023-08-12 10:40:28","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"LIVE NRL: Roosters land ‘big blow’ on stroke of halftime against ‘brave’ Dolphins","link":"https://www.foxsports.com.au/nrl/nrl-premiership/nrl-live-sydney-roosters-vs-the-dolphins-live-scores-final-teams-finals-chances-supercoach-scores-highlights-james-tedesco-wayne-bennett/news-story/29a946ebf8ea3ad960217a82ad4f4d12","keywords":null,"creator":null,"video_url":null,"description":"The Roosters have struck a “blow” right on halftime, with Joey Manu crossing for the Chooks’ first try of the night. They trail the Dolphins 8-6 at the break.","content":"The Roosters have struck a “blow” right on halftime, with Joey Manu crossing for the Chooks’ first try of the night. They trail the Dolphins 8-6 at the break. Ray Stone barged over from close range to break the deadlock after 25 minutes, with Jamayne Isaako adding a penalty goal ten minutes later. The Roosters have had quite a few opportunites at the Dolphins line, with the attacking woes that have plagued their season reappearing, but the away side have been brave in defense. MATCH CENTRE: Sydney Roosters vs the Dolphins live scores, teams, videos Round 24 NRL Aug 10 7:50pm AEST FT Sea Eagles 12 Panthers 24 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 11 6:00pm AEST FT Sharks 36 Titans 6 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 11 8:00pm AEST FT Broncos 54 Eels 10 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 12 3:00pm AEST FT Rabbitohs 26 Dragons 14 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 12 5:30pm AEST FT Tigers 22 Warriors 30 MATCH CENTRE *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL LIVE 51:06 Roosters 12 Dolphins 8 MATCH CENTRE $1.14 $5.50 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 13 2:00pm AEST Storm Raiders MATCH CENTRE $1.28 $3.70 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES NRL Aug 13 4:05pm AEST Knights Bulldogs MATCH CENTRE $1.30 $3.50 BET *Odds are current as of 12th August 2023, 8:48pm AEST VIEW ALL SCORES Watch every game of every round of the 2023 NRL Telstra Premiership Season LIVE on Kayo Sports. New to Kayo? Start your free trial now >>> That was until there was just 15 seconds left in the half, which is when Joey Manu put his mark on the game. Roosters fullback James Tedesco ran at the line and drew in a couple of Dolphins, before turning it back inside to the hard running Manu. “Joey Manu finally cracks this brave Dolphins defence and the Roosters land a big blow right on halftime,” Dan Ginnane said on Fox League. MATCH PREVIEW The Roosters will be desperate to keep their finals hopes alive on Saturday night when they face Wayne Bennett’s Dolphins. Trent Robinson’s side have given themself no room for error in the race for post-season football with a loss finishing their season. Drew Hutchison has been named at halfback, with Sandon Smith on the bench which could see the rookie shift in to dummy-half to replace Brandon Smith. Elsewhere, Dylan Napa returns to the NRL after signing with the Roosters mid-season. For the Dolphins, Kodi Nikorima lines up at fullback which has shifted Origin star Hamiso Tabuai-Fidow in to the centres. Isaiya Katoa and Sean O’Sullivan partner in the halves with Anthony Milford on the bench in the utility role. Roosters team : 1. James Tedesco 2. Daniel Tupou 3. Billy Smith 4. Joseph Manu 5. Joseph-Aukuso Suaalii 6. Luke Keary 7. Drew Hutchison 8. Jared Waerea-Hargreaves 9. Brandon Smith 10. Lindsay Collins 11. Nat Butcher 12. Siua Wong 13. Victor Radley 14. Sandon Smith 15. Fletcher Baker 16. Terrell May 17. Dylan Napa 22. Corey Allan Dolphins team : 1. Kodi Nikorima 2. Jamayne Isaako 3. Hamiso Tabuai-Fidow 4. Valynce Te Whare 5. Tesi Niu 6. Isaiya Katoa 7. Sean O’Sullivan 8. Jesse Bromwich 9. Jeremy Marshall-King 10. Mark Nicholls 11. Felise Kaufusi 12. Connelly Lemuelu 13. Kenny Bromwich 14. Ray Stone 15. Josh Kerr 16. Anthony Milford 17. Jarrod Wallace 18. Herman Ese’ese Get all the latest NRL news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now!! Catch all the action below in our live blog, if you can’t see it click here!","pubDate":"2023-08-12 10:30:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Les notes des Bleues face à l'Australie : De Almeida rebondit, Toletti déçoit","link":"https://www.lefigaro.fr/sports/football/coupe-du-monde/les-notes-des-bleues-face-a-l-australie-de-almeida-rebondit-toletti-decoit-20230812","keywords":["Coupe du monde"],"creator":null,"video_url":null,"description":"Découvrez les notes attribuées aux joueuses de l'équipe de France après l'élimination (0-0, 7-6 t.a.b) face à l'Australie en quart de finale de la Coupe du monde féminine, ce samedi, à Brisbane.","content":"Pauline Peyraud-Magnin (4) : Son match a été à l'image de son Mondial, frustrant. Encore terriblement en difficulté dans le jeu au pied, la gardienne tricolore s'est cette fois montrée maladroite dans les airs, passant au travers presque à chaque fois. Elle a réalisé plusieurs parades décisives en seconde période, avant d'être remplacée par Solène Durand pour la séance de tirs au but. Malgré deux arrêts, la gardienne de Sassuolo n'a pu sauver les Bleues. Elisa De Almeida (7) : Préférée à Eve Perisset sur le côté droit de la défense dans le onze de départ, elle a cette fois fait preuve de rigueur et de combativité pour contenir Foord, la principale menace australienne. Puis elle réalise un sauvetage incroyable devant Fowler (41e), avant de multiplier les interventions dans sa surface de réparation. Remplacée par Perisset, qui manque son tir au but. Maelle Lakrar (4) : Absente en 8es de finale sur blessure, la Montpelliéraine a fait son retour avec un imposant bandage sur la…","pubDate":"2023-08-12 10:25:50","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"What time do the Matildas play their semi final?","link":"https://www.foxsports.com.au/football/world-cup/what-time-do-the-matildas-play-their-semi-final/news-story/f826f9e50b8b51093abd228379f039e0","keywords":null,"creator":null,"video_url":null,"description":"The Matildas are into the semi-final of the FIFA Women’s World Cup for the first time in their history after a thrilling victory over France via a nailbiting penalty shootout.","content":"The Matildas are into the semi-final of the FIFA Women’s World Cup for the first time in their history after a thrilling victory over France via a nailbiting penalty shootout. Super-sub Cortnee Vine converted the winning penalty to spark jubilant scenes at Brisbane Stadium as the Matildas sealed a spot in the final four. Football fans across the nation now will be asking when and where the Matildas will play their next game. The Matildas will play their semi-final clash on Wednesday August 16, with kick-off schedule for 8pm AEST. The game will be played at Stadium Australia in Sydney, meaning yet another attendance record could be broken. The Matildas’ opponent will be the winner of the quarterfinal between England and Colombia.","pubDate":"2023-08-12 10:24:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Les Bleues éliminées en quarts de la Coupe du monde après une séance de tirs au but irrespirable face à l'Australie","link":"https://www.lequipe.fr/Football/Actualites/Les-bleues-eliminees-en-quarts-de-la-coupe-du-monde-apres-une-seance-de-tirs-au-but-irrespirable-face-a-l-australie/1413206#xtor=RSS-1","keywords":["Foot, CM 2023"],"creator":["Sébastien Buron"],"video_url":null,"description":"La France a été éliminée en quarts de finale de la Coupe du monde après une séance de tirs au but irrespirable, ce samedi, face à l'Australie (0-0 a.p., 6-7 aux t.a.b.). Le rêve de décrocher le sacre mondial s'est envolé pour les Bleues de Hervé Renard.","content":"Le match : 0-0 a.p., 7-6 aux t.a.b. Elles sont tombées de détresse sur la pelouse et les regrets seront, forcément, immenses après cette nouvelle désillusion. L'équipe de France féminine espérait décrocher son premier titre mondial cet été et elle devra toujours courir, dans quatre ans, après cet objectif. Face à l'Australie, coorganisatrice de l'épreuve avec la Nouvelle-Zélande, les Bleues ont vu leur rêve s'envoler au terme d'une séance de tirs au but irrespirable (0-0 a.p., 6-7 aux t.a.b.). Le début de rencontre laissait pourtant entrevoir une autre issue tant les joueuses de Hervé Renard, malgré le jeu dur des Australiennes, se montraient supérieures. À la 35e minute, les statistiques traduisaient cette domination : 8 tirs à 2 pour la France. Mais le score était toujours de 0-0. Car Diani avait tiré à côté (8e), Arnold avait repoussé les tirs de Le Sommer (28e) et Lakrar (32e), et la défenseuse avait surtout raté un but tout fait à la 12e minute. La fin de la première période a annoncé une bascule. De Almeida a sauvé devant sa ligne un tir de Fowler après une mésentente entre Karchaoui et Peyraud-Magnin (41e), la gardienne française s'est ensuite interposée devant l'attaquante australienne (45e) et le rapport de force a continué sur cette lancée au retour des vestiaires. Fowler a vu sa frappe déviée par De Almeida après une relance totalement ratée de Peyraud-Magnin (50e), très fébrile jusque-là, mais décisive ensuite par deux très belles parades sur des tentatives de Raso (56e) puis - encore - de Fowler (60e). Entre-temps, la star australienne Sam Kerr, pas encore à 100 %, avait fait son entrée sur la pelouse (55e) et l'inquiétude pouvait grandir. Incapables de se créer la moindre occasion toute la seconde période, les Bleues étaient alors au bord du précipice. Bacha, Périsset, Dali et Becho en échec Elles ont sorti la tête de l'eau en prolongation et ont même cru ouvrir le score sur un csc de Kennedy, mais le but était refusé pour un tirage de maillot de Renard sur Foord (100e). Vine (105e), Becho (107e) étaient à leur tour proches du K.-O., Catley a réussi un superbe sauvetage (110e), et Hervé Renard a tenté un immense coup en remplaçant Peyraud-Magnin par Solène Durand pour les tirs au but. Mais ses arrêts lors de la séance fatidique n'auront pas suffi face aux échecs de Bacha, Périsset et Dali, qui avait pourtant pu retirer une deuxième fois, et de Becho. Comme en 2015, face à l'Allemagne (1-1 a.p., 4-5 aux t.a.b.), les Bleues ont craqué lors de la séance fatidique. Un mois après avoir dominé les Bleues en amical (1-0) le 14 juillet, jour de la Fête Nationale en France, les Australiennes ont, dans la folie de Brisbane, pu célébrer leur première qualification de leur histoire pour les demi-finales de la Coupe du monde. 3 Pour la troisième fois de suite, la France a été éliminée en quarts de finale de la Coupe du monde féminine. Les Bleues n'ont atteint qu'une fois le dernier carré, en 2011. Elles avaient alors terminé 4es.","pubDate":"2023-08-12 10:08:44","image_url":"https://medias.lequipe.fr/img-photo-jpg/la-deception-des-bleues-ce-samedi-a-b-ratnayake-reuters/1500000001819605/0:0,1998:999-665-335-70/3061d.jpg","source_id":"lequipe","category":["sports"],"country":["france"],"language":"french"},{"title":"Harry Kane hints at future Tottenham return after finishing Bayern Munich transfer","link":"https://www.businesslend.com/sports/harry-kane-hints-at-future-tottenham-return-after-completing-bayern-munich-move/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox totally free Sign as much as Miguel’s Delaney’s free weekly publication England captain Harry Kane has left the door open for a return to Tottenham after finishing his £100million transfer to Bayern Munich. Kane travelled to Germany on Friday for [...] The post Harry Kane hints at future Tottenham return after finishing Bayern Munich transfer appeared first on BusinessLend.","content":"England captain Harry Kane has left the door open for a return to Tottenham after finishing his £100million transfer to Bayern Munich. Kane travelled to Germany on Friday for a medical and the Bundesliga giants confirmed on Saturday morning he had signed a deal till June 2027 and can put on the quantity 9 shirt. Spurs chairman Daniel Levy stated the membership had “reluctantly” agreed to the transfer after Kane, who was within the final 12 months of his contract, made it clear he needed a recent problem. Kane stated in a message to Tottenham followers posted on his social media accounts: “It’s not a goodbye because you never know how things pan out in the future, but it’s a thank you and I’ll see you soon.” The 30-year-old informed his new membership’s web site that he hoped to play some half in Bayern’s DFB Super Cup match with RB Leipzig on Saturday evening as he appears to be like to win the primary trophy of his profession. “I’m very happy to be a part of FC Bayern now,” Kane stated. “Bayern is one of the biggest clubs in the world and I’ve always said that I want to compete and prove myself at the highest level during my career. This club is defined by its winning mentality – it feels very good to be here. “I feel like it was the right step in my career to really push myself and test myself on the highest level so that’s why I’m here and I look forward to that challenge.” Shortly earlier than the deal was formally confirmed, Kane posted a message on social media wherein he thanked the followers and stated he had not needed to begin the season together with his future unresolved. “From the moment I’ve been playing I’ve been one of your own and I’ve given everything that I possibly could to make you proud and give you as many special moments and memories to hopefully last forever,” Kane stated. “This is a message to all you fans around the world, every single Tottenham fan that’s supported me and been with me throughout my journey. “Me and my family will cherish it forever, we’ll never forget all the moments we’ve had together so thank you. “I felt like it was the time to leave. I didn’t want to go into the season with a lot of unresolved future talk. “I think it’s important for the new manager and the players to concentrate on trying to get Tottenham back to around the top of the table and fighting for trophies so I wish Ange (Postecoglou) and all the boys all the very best of luck. “I’ll be watching from a fan point of view now and really hope the team can be successful.” Postecoglou had revealed on Friday that Kane’s transfer was “imminent” after a breakthrough in negotiations between the golf equipment was reached on Wednesday evening. It left the ball in Kane’s court docket and he selected Thursday to depart his boyhood membership for Bayern, who pays an preliminary £100m with add-ons probably taking the deal as much as an total charge of £120m, the PA information company understands. Kane leaves Tottenham having scored 280 targets to develop into the membership’s all-time main goalscorer, however with out a trophy. “I think it’s important for the new manager and the players to concentrate on trying to get Tottenham back to around the top of the table and fighting for trophies so I wish Ange (Postecoglou) and all the boys all the very best of luck,” Kane stated. “I’ll be watching from a fan point of view now and really hope the team can be successful.” Bayern had seen their earlier bids for Kane turned down, however refused to surrender their pursuit of the 30-year-old, who stays 47 targets shy of equalling Alan Shearer’s Premier League file of 260. Harry was clear that he needed a recent problem and wouldn’t be signing a brand new contract this summer season Levy informed the membership’s web site: “We sought over a long period of time to engage Harry and his representatives in several forms of contract extension, both short and long term. “Harry was clear, however, that he wanted a fresh challenge and would not be signing a new contract this summer. We have reluctantly, therefore, agreed to his transfer. “We have seen a product of our academy system become one of the best players to ever pull on a Spurs shirt and become one of world football’s elite strikers. It has been a truly remarkable journey.” Harry Kane’s highs and lows at Tottenham as he indicators with Bayern Munich","pubDate":"2023-08-12 10:07:27","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Les Bleues éliminées de la Coupe du monde par l'Australie aux tirs au but","link":"http://www.lechorepublicain.fr/paris-75000/sports/les-bleues-eliminees-de-la-coupe-du-monde-par-l-australie-aux-tirs-au-but_14356065/","keywords":["PARIS"],"creator":null,"video_url":null,"description":"La France affrontait l'Australie, ce samedi 12 août, à Brisbane, en quart de finale de la coupe du monde féminine. Les Bleues se sont inclinées aux tirs au but (6-7).","content":"Dans une première mi-temps plutôt timide, aucune des deux équipes n'est parvenue à inscrire le moindre un but. Les Bleues ont toutefois maitrisé la majeure partie de ce premier acte avec quelques occasions, notamment dès la 7e minute de jeu : sur une mauvaise relance de l'Australienne Alanna Kennedy, la Française Kadidiatou Diani lui chipe la balle et lâche une frappe trop croisée, qui passe à côté de la cage. Première frayeur pour les Matildas. À la 27e minute, il y a eu aussi ce tir de la numéro 9 tricolore, Eugénie Le Sommer, contré par la défense et finalement repoussé par la gardienne Mackenzie Arnold. Et puis c'est à peu près tout ce que ce quart de finale avait à offrir... Jusqu'au sauvetage miraculeux sur la ligne de but de l'arrière droit des Bleues, Elisa De Almeida. Après une incursion australienne dans la surface de réparation, et une mésentente entre la gardienne Pauline Peyraud-Magnin et Sakina Karchaoui, l'attaquante Mary Fowler décroche une frappe qui aurait dû finir au fond de la cage de but vide. Mais l'intervention spectaculaire de De Almeida permet de garder un score vierge à la 45e minute. La deuxième mi-temps aurait néanmoins pu être fatale aux Bleues, face à des Australiennes ultra dominantes, mais qui n'ont pas réussi à trouver le chemin des buts. Dès l'entame du deuxième acte, les Matildas ont pris d'assaut la surface de réparation tricolore. La première grosse occasion arrive à la 55e minute de jeu, juste après l'entrée sur le terrain de la star australienne Sam Kerr, sous l'ovation des 49 000 spectateurs. À l'entrée de la surface, Hayley Raso déclenche une frappe puissante qui est bien repoussée par Peyraud-Magnin. Peu de temps après, à la 59e, l'attaquante Fowler se distingue à nouveau, à bout portant, mais trouve une nouvelle fois sur son chemin la gardienne française. C'est alors qu'Hervé Renard décide d'effectuer son premier changement du match (64e), avec l'entrée en jeu de Vicky Becho à la place de Sandie Toletti. Les Bleues remettent un peu la tête à l'endroit, et subissent un peu moins. Mais se procurent qu'une toute petite occasion en deuxième mi-temps, loin d'être suffisant pour forcer le destin en 90 minutes, ce qui a donc laissé place aux prolongations. Dans la première partie des prolongations, les Bleues pensaient que le plus difficile était fait, après une tête contre son camp de Kennedy qui cherchait à défendre sur un corner (99e). Mais l'abrite siffle faute pour les Australiennes après un tirage de maillot de Wendie Renard dans la surface de réparation. À la 104e, un centre très dangereux de l'Australienne Caitlin Foord pour Cortnee Vine, qui venait d'entrer en jeu, finit dans le petit filet extérieur. Dans la deuxième mi-temps des prolongations, une frappe de Becho (107e) se dirigeait vers la lucarne mais la gardienne a réalisé une très jolie parade pour l'arrêter. A la 109e, c'est un centre fuyant de Grace Geyoro devant le but qui n'a pas n'a pas trouvé de Bleues pour reprendre le ballon... Dans l'ensemble, les Françaises se sont montrées plus entreprenantes que les Australiennes dans les prolongations, mais pas suffisamment pour éviter les tirs au but. Avant le dernier acte de la rencontre, à la toute fin des prolongations, Hervé Renard avait choisi de remplacer la gardienne Peyraud-Magnin par Solène Durand et de faire rentrer Eve Périsset à la place de De Almeida.","pubDate":"2023-08-12 10:05:00","image_url":"http://www.lechorepublicain.fr/photoSRC/VVZTJ19dUTgIDAVOBQwd/fbl-wc-2023-women-match59-aus-fra_6567405.jpeg","source_id":"lechorepublicain","category":["sports"],"country":["france"],"language":"french"}]}