{"newsArray":[{"article_id":"f6df8acddf69a564e387c1c1b6de02a5","title":"Is the Champions League draw on TV? Channel, start time and how to watch online","link":"https://www.independent.co.uk/sport/football/when-champions-league-group-stage-draw-b2402214.html","keywords":["Football","Sport"],"creator":["Lawrence Ostlere"],"video_url":null,"description":"Arsenal, Manchester City, Manchester United and Newcastle are all in the draw for the Champions League group stage","content":"The Champions League is back and the draw will take place later today to decide the 2023/24 group stage. Four English clubs are in the draw: the reigning champions Manchester City, along with Arsenal, Manchester United and Newcastle United. For the final time before the competition takes on a new format next season, 32 teams will be split into eight groups of four. Each group will contain one team from each of the four seeded pots, and clubs from the same national league will not be drawn together in the same group. Pot 1 will consist of the Champions League winners, the Europa League winners and six domestic champions of the highest ranked leagues. The remaining pots will be decided by Uefa’s club coefficient rankings . The final will take place at London’s Wembley Stadium on 1 June 2024. The draw for the group stage will take place in Monaco on Thursday 31 August, at 5pm BST. The draw will be televised live in the UK on TNT Sports (formerly BT Sport) for subscribing customers, and will be available on the TNT Sports app. You can also live stream the draw for free on the Uefa website and YouTube channel . There are 32 clubs qualified for the Champions League group stage: England: Arsenal, Manchester City, Manchester United, Newcastle United Spain : Atletico Madrid, Barcelona, Real Madrid, Real Sociedad, Sevilla Germany : Bayern Munich, Borussia Dortmund, Leipzig, Union Berlin Italy : Inter Milan, Lazio, AC Milan, Napoli France : Lens, Paris Saint-Germain Portugal : Benfica, Porto, Braga Netherlands : Feyenoord, PSV Austria : Salzburg Scotland : Celtic Serbia : Red Star Belgrade Ukraine : Shakhtar Donetsk Belgium : Antwerp Switzerland: Young Boys Turkey: Galatasaray Ukraine : Shakhtar Donetsk Matchday 1: 19/20 September 2023 Matchday 2: 3/4 October 2023 Matchday 3: 24/25 October 2023 Matchday 4: 7/8 November 2023 Matchday 5: 28/29 November 2023 Matchday 6: 12/13 December 2023","pubDate":"2023-08-31 06:26:18","image_url":"https://static.independent.co.uk/2023/08/30/12/a86b6bc41c328c576caa8179a7579fecY29udGVudHNlYXJjaGFwaSwxNjkyODc4ODE5-2.72555912.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6025a4ef2425293c9b76cffcb775c62b","title":"When is the Champions League group stage draw?","link":"https://www.independent.co.uk/sport/football/when-champions-league-group-stage-draw-b2402375.html","keywords":["Football","Sport"],"creator":["Lawrence Ostlere"],"video_url":null,"description":"Arsenal, Manchester City, Manchester United and Newcastle are all in the draw for the Champions League group stage","content":"The Champions League is nearly upon us for the new 2023/24 season, as treble-winners Manchester City try to retain their crown as the kings of Europe following their 1-0 win over Inter Milan in Istanbul in June. For the final time before the competition takes on a new format next season, 32 teams will be split into eight groups of four. Each group will contain one team from each of the four seeded pots, and clubs from the same national league will not be drawn together in the same group. Pot 1 will consist of the Champions League winners, the Europa League winners and six domestic champions of the highest ranked leagues. The remaining pots will be decided by Uefa’s club coefficient rankings . The final will take place at London’s Wembley Stadium on 1 June 2024. The draw for the group stage will take place in Monaco on Thursday 31 August, at 5pm BST. There are 32 clubs qualified for the Champions League group stage: England: Arsenal, Manchester City, Manchester United, Newcastle United Spain : Atletico Madrid, Barcelona, Real Madrid, Real Sociedad, Sevilla Germany : Bayern Munich, Borussia Dortmund, Leipzig, Union Berlin Italy : Inter Milan, Lazio, AC Milan, Napoli France : Lens, Paris Saint-Germain Portugal : Benfica, Porto, Braga Netherlands : Feyenoord, PSV Austria : Salzburg Scotland : Celtic Serbia : Red Star Belgrade Ukraine : Shakhtar Donetsk Belgium : Antwerp Switzerland: Young Boys Turkey: Galatasaray Ukraine : Shakhtar Donetsk Matchday 1: 19/20 September 2023 Matchday 2: 3/4 October 2023 Matchday 3: 24/25 October 2023 Matchday 4: 7/8 November 2023 Matchday 5: 28/29 November 2023 Matchday 6: 12/13 December 2023","pubDate":"2023-08-31 06:22:29","image_url":"https://static.independent.co.uk/2023/08/30/08/GettyImages-171460618.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d1680db87bb295cfe1b82df2b0968a64","title":"MLS : Monsef Bakrar marque son deuxième but avec New York City","link":"https://www.dzfoot.com/verts-deurope/mls-monsef-bakrar-marque-son-deuxieme-but-avec-new-york-city-246786.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["But","Verts du Monde","MLS","Monsef Bekrar","New York"],"creator":null,"video_url":null,"description":"Dans le cadre de la 27 ème journée de la Major League Soccer (MLS), le New York City FC de Monsef Bakrar recevait cette nuit le CF Montreal. Une rencontre au cours de laquelle le numéro 9 Algérien va s’illustrer en inscrivant son premier but en MLS et assurer ainsi la victoire des siens (2-0). […] The post MLS : Monsef Bakrar marque son deuxième but avec New York City appeared first on Football Algérien - DZFOOT.COM.","content":"Dans le cadre de la 27 ème journée de la Major League Soccer (MLS), le New York City FC de Monsef Bakrar recevait cette nuit le CF Montreal. Une rencontre au cours de laquelle le numéro 9 Algérien va s’illustrer en inscrivant son premier but en MLS et assurer ainsi la victoire des siens (2-0). Titulaire à la pointe de l’attaque du club New Yorkais, l’ancien joueur du NK Istra (Croatie) poursuit son rêve américain. Alors que son équipe menait face au club Québécois sur le score de 1 but à 0, Monsef Bakrar fera le break peu avant la pause. Sur un long ballon en profondeur, le natif de Sétif prendra le dessus sur son vis-à-vis et ajustera le gardien adverse sans trembler. Mounsef with his first @MLS goal 😍 Watch #NYCvMTL on @AppleTV #MLSSeasonPass : https://t.co/cMdkK7R82v pic.twitter.com/uOclzLAQkz — New York City Football Club (@NYCFC) August 31, 2023 Premier but donc en championnat en 3 apparitions, son deuxième toutes compétitions confondues. L'attaquant Algérien avait en effet inscrit sa première réalisation sous ses nouvelles couleurs en League Cup face à un autre club Canadien, le FC Toronto. Dzfoot","pubDate":"2023-08-31 06:14:47","image_url":null,"source_id":"dzfoot","source_priority":291587,"country":["algeria"],"category":["sports"],"language":"french"},{"article_id":"485d976e91b1c8d08f4d0852ea96d30f","title":"Football rumours: Al-Ittihad ready to make £118m bid for Mohamed Salah","link":"https://www.independent.co.uk/sport/football/mohamed-salah-jurgen-klopp-liverpool-daily-star-premier-league-b2402373.html","keywords":["Football","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Jurgen Klopp would reportedly be “furious” if Salah was allowed to leave Liverpool.","content":"With the transfer deadline looming, Premier League sides are making their final moves as the clock ticks down to September 1. According to the Daily Mail, one of the big moves could see a star name leave the Premier League, with Saudi Arabian side Al-Ittihad gearing up for a £118million bid for Egyptian forward Mohamed Salah , 31. The Daily Star reports that Liverpool boss Jurgen Klopp would be “furious” if the move went ahead. The Daily Mirror reports Manchester United are keen to nab a midfielder before the transfer window closes, with Sofyan Amrabat , 27, their prime target. The Daily Mail reports Fiorentina have turned down a £1.7million loan deal but would consider a deal with an obligation to buy. One player who could be on his way out of Old Trafford is English defender Teden Mengi . Luton are close to signing him, according to the Daily Mail. Tottenham’s move for Wales forward Brennan Johnson , 22, from Nottingham Forest has stalled, according to The Independent. Crystal Palace’s Eberechi Eze , 25, has emerged as a new target. Callum Hudson-Odoi : Nottingham Forest are close to a deal for the England winger, 22, from Chelsea, according to the Guardian. James McAtee: Manchester City’s England Under-21s midfielder could return for a second loan spell at Sheffield United, who are leading the chase for him, according to Football Insider.","pubDate":"2023-08-31 06:13:44","image_url":"https://static.independent.co.uk/2023/08/31/07/94b7e3ce63ca2e1c830a946ca88ad8e3Y29udGVudHNlYXJjaGFwaSwxNjkzNTM1MDU5-2.73269172.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3e3d9af9dcb4d0b2b463572576ca10d4","title":"Tiémoué Bakayoko deux ans à Lorient ?","link":"https://www.lequipe.fr/Football/Actualites/Tiemoue-bakayoko-deux-ans-a-lorient/1416832#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"Libre depuis le 1er juillet et la fin de son contrat avec Chelsea, Tiémoué Bakayoko devrait s'engager avec Lorient pour les deux prochaines saisons.","content":"La perspective semblait inimaginable au début de l'été, quand Tiémoué Bakayoko est devenu un joueur libre. Arrivé au terme de son contrat avec Chelsea au 1er juillet, le milieu international français (1 sélection) devrait, au bout de deux mois d'incertitudes, signer à Lorient. C'était la tendance mercredi et elle a pris du poids durant les dernières heures. À tel point que le joueur de 29 ans est attendu jeudi par le FCL pour la visite médicale. Le joueur et son entourage sont tout proches d'un accord avec les dirigeants bretons sur l'idée d'un contrat portant sur deux saisons. S'il faudra que Bakayoko, qui s'est entretenu en individuel, reprenne le rythme des entraînements collectifs, ce recrutement ressemble à une belle opportunité sportive et un joli rebond pour Lorient, qui avait déjà frôlé . Mais la piste menant au milieu de Manchester United s'est éteinte et cela a permis aux Merlus, qui ne pouvaient pas cumuler les deux dossiers, de miser sur Bakayoko. Les caractéristiques de l'ex-Blue devraient apporter encore un peu plus de consistance au milieu lorientais.","pubDate":"2023-08-31 05:45:55","image_url":"https://medias.lequipe.fr/img-photo-jpg/tiemoue-bakayoko-etait-prete-par-chelsea-a-l-ac-milan-la-saison-passee-m-borsari-presse-sports/1500000001827422/0:0,1997:998-665-335-70/d2568.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"293427537a1772213b9d58e6a0cefbc1","title":"Harry Sheezel wins 2023 AFL Rising Star award","link":"https://www.australianjewishnews.com/harry-sheezel-wins-2023-afl-rising-star-award/","keywords":["Sport","AFL","Harry Sheezel","AFL Rising Star Award","North Melbourne Kangaroos","AJAX Football Club"],"creator":null,"video_url":null,"description":"Harry Sheezel’s impressive debut AFL season was recognised in the highest possible way on August 30.","content":"Jewish 18-year-old North Melbourne Kangaroo player Harry Sheezel’s impressive debut AFL season was recognised in the highest possible way at the 2023 AFL Awards night on August 30, when he won the AFL’s Rising Star Award, earning 54 out of a maximum of 60 votes. To top it off, the former AJAX Footy Club junior and King David School graduate also won the AFLPA’s 2023 Best First Year Player award. Remarkably, Sheezel was tasked at the beginning of the season, by Roos head coach Alastair Clarkson, to play in the unfamiliar position of half back, rather than his usual half forward spot he’d played in for AJAX, the Sandringham Dragons, and Vic Metro. Taking hold of that new challenge with both hands, the 2022 AFL Draft number 3 pick averaged 27.0 disposals per game, and made the most disposals (622) by any player in their debut AFL season ever. In his Rising Star award acceptance speech, in front of Clarkson, his parents, and the who’s who of the AFL, Sheezel thanked his family, and especially his parents, Dean and Lana, for all they’ve done to help him achieve what he has in the sport. “From day one, they’ve done so much, and care so much for me. “They’re so passionate about football as well, which makes it even better, because I kind of live it with them. “The support they’ve shown to me, especially this year, has been incredible.” In an AFL press conference this morning, Sheezel reflected, “I wasn’t too sure what to espect [in the half back role] at the start of the year, to be honest, but it worked out pretty well, and I love that role now – you get a lot of freedom back there.” He said he also put his full trust in coach Alastair Clarkson putting him in the half back role, describing ‘Clarko’ as having “an unbelievable football brain”. On receiving the award, Sheezel commented, “I think I had that belief and confidence earlier in the year, and the award was kind of a result of that”. “Every week I’d just try and have that confidence that I belong at this level, and try to play my best every week, and so it was good to get recognised. “I’m not too sure where I’ll play [on the field next season]. “But I’m definitely working on my leadership, and trying to drive the group.”","pubDate":"2023-08-31 05:43:35","image_url":"https://static.timesofisrael.com/ajn/uploads/2023/08/20230831001836488282_31545-1024x640.jpeg","source_id":"australianjewishnews","source_priority":511030,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"12fe763306ed48ba6d7753a041a58c13","title":"Top-age contest","link":"https://borderwatch.com.au/sport/2023/08/31/top-age-contest/","keywords":["Sport"],"creator":["Hui Jin"],"video_url":null,"description":"UNDER 18 – SOUTH GAMBIER v NORTH GAMBIER AN anticipated match-up awaits in the Western Border Under 18 football qualifying […] The post Top-age contest appeared first on The Border Watch.","content":"James Murphy UNDER 18 – SOUTH GAMBIER v NORTH GAMBIER AN anticipated match-up awaits in the Western Border Under 18 football qualifying final. South Gambier and North Gambier will compete for the first grand final berth and a tight game could unfold. The Demons finished minor premiers, but the last meeting between the two sides went the way of the Tigers by six points. Kade Allen was a highlight for North on that occasion, while captain Reece McLaughlin top scored with two goals. Liam Delaney slotted two majors for the Demons, while Kobe Bannon and Cayde Watson also put in solid performances. The other two encounters were one-sided affairs in favour of South and the reigning premiers will be on the hunt for a similar result on Saturday. Bannon has been a regular in the Demons best players this season, while Angus Urquhart has led the goal kicking with 25 for the year so far. North’s Sebastian Doody took out the goal kicking award with 27 for the season, with McLaughlin (23 goals) and Zayne Young (21) also reliable up front. Trae Hamilton could be another to watch for the Tigers and he enters the final off a best-on-ground performance in his latest outing. The Demons kept East Gambier scoreless in their last match, where a nine-goal haul from Urquhart led them to a thumping win. They will enter Saturday as the favourite, but the Tigers should not be ruled out.","pubDate":"2023-08-31 05:30:05","image_url":null,"source_id":"borderwatch","source_priority":7435733,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"22e2603a9465ac2f4e2ab97af3bceabf","title":"Jonny Hayes keen to emulate Aberdeen FC team he's always been envious of by completing Hacken mission","link":"https://www.dailyrecord.co.uk/sport/football/football-news/jonny-hayes-keen-emulate-aberdeen-30827693","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"The veteran has always looked to one particular Dons side when embarking on European qualification quests.","content":"Jonny Hayes (Image: SNS Group) Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Jonny Hayes was always envious of the Aberdeen squad of 2007. The 36-year-old Irishman will get the chance to follow in their footsteps and is determined it will be in the continent’s second-tier competition once again. It is 16 years since Darren Mackie headed home in a 1-1 draw with Dnipro that sent Jimmy Calderwood’s Dons into the UEFA Cup group stage. It saw them face Atletico Madrid, Panathinaikos, Copenhagen and Lokomotiv Moscow before mighty Bayern Munich in the knockout stages. Since then, Aberdeen teams have tried and failed to repeat the feat. Hayes was involved when Derek McInnes’ side qualified for Europe eight years in a row and then again under Stephen Glass, only to fail to get beyond the qualifiers. Now Barry Robson’s crop know if they beat BK Hacken at Pittodrie tonight, they will be in the Europa League groups. If they don’t, the same stage of the Conference League looms. Hayes said: “We’ve had two, three or four rounds of qualifying before, had tough draws and fallen that little bit short. I’ve always been envious a little of the 2007-08 squad that played Dnipro. I wish we had one play-off game, regardless of the opposition, to prepare for. Read More Related Articles Michael Beale carries Rangers can for Champions League mauling but insists he has no regrets over PSV approach Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings “I’m sure our chances of having group stage football would have been increased. This season we’ve got our wish. We’ve got the parachute of the Conference League but by no means are we thinking about that. We want to win the game and the glory that comes with playing Europa League football.” Robson wants his side to enjoy the occasion but Hayes is adamant they are going all out for the Europa League. They aren’t interested in the consolation should they fail to build on last week’s 2-2 draw in Sweden. He added: “Golfers want to win the prizes on offer and for us it’s the same. “There is a difference between the Europa and Conference League and it is by no means a punishment to go into the Conference League. There’s an added incentive of the Europa League and I’m only thinking of winning a one-off game to go into the Europa League group stage. “It’s the closest this club have been in 15 years. Some years we had some really tough draws. We had Groningen and Real Sociedad in one season, which was really tough. “The game that took us most by surprise was probably Shkendija in 2015. They played well but Niall McGinn scored and we went through on away goals. “These teams are all technically really good. The gap is closing between the likes of Latvia and Macedonia with Scotland and Ireland. You come up against really quality teams you’ve never heard of. Aberdeen's Jonny Hayes (Image: SNS Group) \"Playing one round is easier to overcome than three or four. Had we been offered that chance, we’d have bitten your hand off. But it’s come around now and we’re trying to deliver Europa League football for the club.” The veteran is in his second spell at Pittodrie and the only starting survivor from a Glass side that put Hacken out of the Conference League in 2021. The Dons opened up with a 5-1 home win and although the Swedes mounted a mini revival in Gothenburg, it wasn’t enough. This time they got a morale-boosting draw on the road and want to finish the tie at home. Hayes said: “It feels like a lifetime ago, even though it was only a couple of years. It shows when things haven’t gone too well at a club, there’s a need for change. “It also highlights we’re always trying to progress and be better. We were really good that night. It was different to what the manager is working on now but as a player you appreciate those moments you work on in training coming to fruition on the pitch. “It clicked that night but it wasn’t a coincidence. The result caught us a little by surprise but the performance was one we expected. This one will be end to end. They like to attack with pace and we like to go forward too. I’m not saying this because we scored two goals but the second half was one of the best halves of football I’ve watched live in a long time. “The fitness side can sway a game. For me, it was more about the mentality and character to get back into the game. We knew we’d get a second after we scored and had we had five more minutes, I’m sure a third would’ve come. \"There are some games where you have to take your medicine, you don’t have the ball but keep going and never say die. That’s what the manager demands. You have to show the mentality that you want to win every game.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Jonny Hayes Aberdeen FC Europa League Scottish Premiership","pubDate":"2023-08-31 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30827718.ece/ALTERNATES/s615/0_Aberdeen-FC-Media-Access.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0b23f379ee5b54910ffbd1f9d2ca8e97","title":"On This Day in 2016: David Luiz returns to Chelsea","link":"https://www.independent.co.uk/sport/football/david-luiz-antonio-conte-juan-cuadrado-brazil-fernando-torres-b2402339.html","keywords":["Football","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"The Brazil international won six major trophies during his two spells at Stamford Bridge.","content":"David Luiz rejoined Chelsea from Paris St Germain in a £32million deal on this day in 2016. The Brazil international returned to familiar territory as then Blues boss Antonio Conte shuffled his pack with full-back Marcos Alonso also arriving from Fiorentina as midfielder Juan Cuadrado joined Juventus on loan. Luiz, then 23, had initially joined Chelsea from Portuguese side Benfica in a deal worth up to £25million in January 2011. He had arrived at Stamford Bridge on the same day as striker Fernando Torres , who cost the reigning champions £50million – a record transfer fee between British clubs – when they lured him away from Liverpool. The defender made 143 appearances in his first spell and won the Champions League, Europa League and the FA Cup before Paris St Germain paid £50million for his services in June 2014 with then Chelsea manager Jose Mourinho preferring to use Gary Cahill and John Terry at the heart of his rearguard. Luiz’s time in France proved hugely successful as PSG dominated on the domestic front, but after two seasons at the Parc des Princes, he could not resist the opportunity to renew his acquaintance with English football. Speaking as his return to the Blues was confirmed, he told the club’s official website: “I’m delighted to return to Chelsea. We had a fantastic story during my first time at the club and I want to help the team and Antonio Conte achieve a lot of success. “I always had a wonderful relationship with the fans and I am looking forward to wearing the blue shirt at Stamford Bridge once again.” Over the length of his three-year contract, Luiz added a league title, an FA Cup and another Europa League trophy to his tally before making a shock – and for some, controversial – £8million move to derby rivals Arsenal in August 2019 after indicating his desire to leave. Luiz spent two seasons at the Emirates Stadium and, now 36, is currently playing his club football with Flamengo in Brazil’s Serie A.","pubDate":"2023-08-31 05:00:00","image_url":"https://static.independent.co.uk/2023/08/31/06/0994f7b3f2445ae81f4bca0cf28db497Y29udGVudHNlYXJjaGFwaSwxNjkzNDY2NjA0-2.43203005.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d3701c93b7a2095aa95126400e5d3b4a","title":"Paulo Bernardo is Celtic transfer target with unlimited potential as Benfica mentor ranks golden boy with Joao Felix","link":"https://www.dailyrecord.co.uk/sport/football/football-transfer-news/paulo-bernardo-celtic-transfer-target-30825779","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (David McCarthy)"],"video_url":null,"description":"The midfielder's mentor has spoken in glowing terms about the man Celtic are believed to be after.","content":"Paulo Bernardo Get the latest Celtic news sent straight to your inbox with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Renato Paiva saw them all come through the Benfica academy to become superstars. Ruben Dias, Joao Cancelo, Renato Sanches, Bernardo Silva, Helder Costa and Joao Felix to name just some over the course of his 18 years overseeing the development of young talent at a club that rivals Ajax as being among the best on the planet at producing world-class footballers. So when Paiva, now the head coach of Bahia in Brazil, casts his mind back over the kids he coached at Benfica’s incredible Seixal training campus and pinpoints Paulo Bernardo as the one whose potential has no limits, it’s worth taking his opinion seriously. And when the possibility of this kid playing his football in Scotland with Celtic this season arises, Paiva’s comments on him should fill Parkhead fans with hope they will soon be witnessing someone pretty special from the same academy that gave the Jota . Bernardo, at 21, has already made 17 appearances for Benfica’s first team but after being farmed out to Pacos de Ferreira in the second half of last term, is not part of current boss Roger Schmidt’s plans for this season. The Portuguese giants – nicknames The Eagles – are, however, ready to sanction another loan deal for the player who is under contract until 2027 and is highly enough rated to have a £90million buyout clause built into it. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings Read More Related Articles Kieran Tierney in grinning Real Sociedad nickname response as Celtic hero asked how to pronounce his name That’s way too rich for Celtic’s blood, clearly, but a loan deal with the guarantee of Champions League and the knowledge on Benfica’s side that Jota was brilliantly developed in Scotland, could persuade Estadio da Luz president Rui Costa – whose has seen Bernardo’s flamboyant attacking-midfield style compared to the talent he showed at AC Milan and Borussia Dortmund – Glasgow would be a suitable destination for their protege. The youngster doesn’t shy away from the comparison – although his idol is former Argentina and Benfica midfielder Enzo Perez. But he accepts he is still at the start of a football journey, the next step of which could be taken in Scotland, although there is no shortage of interest in him across the continent. “I do have some similarities with Rui Costa I suppose in style,” Bernardo said. \"But you have to remember I am just taking my very first openings in football. “My debut for Benfica for the first team was the first step and my dream is to one day play for Portugal at a World Cup. But I am only young. I want to play, have fun and work to get my opportunities. \"My hero and the player I base my game on was Enzo Perez, when he was at Benfica. I’d love to play in a role like him as a free attacking midfielder.” Paiva reckons that wherever Bernardo ends up, he will shine as brightly as the name of the stadium he will leave behind. And that eventually, Benfica will make an absolute fortune on the boy he developed as a pre-teen into a budding superstar by impressing on him the need to add goals to his undoubted talent in the middle of the park. “Paulo had a beautiful history with us,” Paiva said recently. “He was identified at Benfica as an elite midfielder, but I told him there was a difference between an elite midfielder and a high-quality midfielder, scoring goals. “If he didn’t score goals, he would never become an elite midfielder. The truth is that Paulo, being the intelligent kid that he is, knew how to listen, be patient and work accordingly. “I left but I’m delighted whenever I see Paulo’s goals, because I remembered this story and he knows it’s true. What I can assess is Paulo’s potential and this is never-ending. \"And I said after leaving, Paulo could be the future biggest sale of Benfica. I see Paulo, with respect and affection to everyone else, this way. “I said this in the past about Joao Felix, and now I’m saying this about Paulo. I feel he’s different. If he stays healthy, he will give a lot of sporting and financial income to Benfica.” Joao Felix in action at the World Cup (Image: Offside via Getty Images) If Bernardo does find his way to Parkhead before the transfer window closes on Friday night, Paiva believes the Portugal U21 star will cope with anything that comes his way. He added: “Besides the quality he has, one fundamental thing is the mental aspect at this stage. “Paulo is a super-reserved kid. I’ve already told him he must speak louder and more often, but I also think it helps him. “He’s focused. On the field he changes and his football speaks for him and he’s becoming a leader. But outside it he’s a reserved kid, humble and very quiet, but focused on what he wants. “He has everything to be an elite player, there are no extravagances or distractions. He’s highly intelligent, he knows what he wants, he knows how to listen, which is a great virtue. That’s how he got to where he has and how I think he will get to where he’s going.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Paulo Bernardo Celtic FC Scottish Premiership Celtic Transfer News Transfer Talk Benfica","pubDate":"2023-08-31 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30817257.ece/ALTERNATES/s615/0_GettyImages-1240057712.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f6df8acddf69a564e387c1c1b6de02a5","title":"Is the Champions League draw on TV? Channel, start time and how to watch online","link":"https://www.independent.co.uk/sport/football/when-champions-league-group-stage-draw-b2402214.html","keywords":["Football","Sport"],"creator":["Lawrence Ostlere"],"video_url":null,"description":"Arsenal, Manchester City, Manchester United and Newcastle are all in the draw for the Champions League group stage","content":"The Champions League is back and the draw will take place later today to decide the 2023/24 group stage. Four English clubs are in the draw: the reigning champions Manchester City, along with Arsenal, Manchester United and Newcastle United. For the final time before the competition takes on a new format next season, 32 teams will be split into eight groups of four. Each group will contain one team from each of the four seeded pots, and clubs from the same national league will not be drawn together in the same group. Pot 1 will consist of the Champions League winners, the Europa League winners and six domestic champions of the highest ranked leagues. The remaining pots will be decided by Uefa’s club coefficient rankings . The final will take place at London’s Wembley Stadium on 1 June 2024. The draw for the group stage will take place in Monaco on Thursday 31 August, at 5pm BST. The draw will be televised live in the UK on TNT Sports (formerly BT Sport) for subscribing customers, and will be available on the TNT Sports app. You can also live stream the draw for free on the Uefa website and YouTube channel . There are 32 clubs qualified for the Champions League group stage: England: Arsenal, Manchester City, Manchester United, Newcastle United Spain : Atletico Madrid, Barcelona, Real Madrid, Real Sociedad, Sevilla Germany : Bayern Munich, Borussia Dortmund, Leipzig, Union Berlin Italy : Inter Milan, Lazio, AC Milan, Napoli France : Lens, Paris Saint-Germain Portugal : Benfica, Porto, Braga Netherlands : Feyenoord, PSV Austria : Salzburg Scotland : Celtic Serbia : Red Star Belgrade Ukraine : Shakhtar Donetsk Belgium : Antwerp Switzerland: Young Boys Turkey: Galatasaray Ukraine : Shakhtar Donetsk Matchday 1: 19/20 September 2023 Matchday 2: 3/4 October 2023 Matchday 3: 24/25 October 2023 Matchday 4: 7/8 November 2023 Matchday 5: 28/29 November 2023 Matchday 6: 12/13 December 2023","pubDate":"2023-08-31 06:26:18","image_url":"https://static.independent.co.uk/2023/08/30/12/a86b6bc41c328c576caa8179a7579fecY29udGVudHNlYXJjaGFwaSwxNjkyODc4ODE5-2.72555912.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6025a4ef2425293c9b76cffcb775c62b","title":"When is the Champions League group stage draw?","link":"https://www.independent.co.uk/sport/football/when-champions-league-group-stage-draw-b2402375.html","keywords":["Football","Sport"],"creator":["Lawrence Ostlere"],"video_url":null,"description":"Arsenal, Manchester City, Manchester United and Newcastle are all in the draw for the Champions League group stage","content":"The Champions League is nearly upon us for the new 2023/24 season, as treble-winners Manchester City try to retain their crown as the kings of Europe following their 1-0 win over Inter Milan in Istanbul in June. For the final time before the competition takes on a new format next season, 32 teams will be split into eight groups of four. Each group will contain one team from each of the four seeded pots, and clubs from the same national league will not be drawn together in the same group. Pot 1 will consist of the Champions League winners, the Europa League winners and six domestic champions of the highest ranked leagues. The remaining pots will be decided by Uefa’s club coefficient rankings . The final will take place at London’s Wembley Stadium on 1 June 2024. The draw for the group stage will take place in Monaco on Thursday 31 August, at 5pm BST. There are 32 clubs qualified for the Champions League group stage: England: Arsenal, Manchester City, Manchester United, Newcastle United Spain : Atletico Madrid, Barcelona, Real Madrid, Real Sociedad, Sevilla Germany : Bayern Munich, Borussia Dortmund, Leipzig, Union Berlin Italy : Inter Milan, Lazio, AC Milan, Napoli France : Lens, Paris Saint-Germain Portugal : Benfica, Porto, Braga Netherlands : Feyenoord, PSV Austria : Salzburg Scotland : Celtic Serbia : Red Star Belgrade Ukraine : Shakhtar Donetsk Belgium : Antwerp Switzerland: Young Boys Turkey: Galatasaray Ukraine : Shakhtar Donetsk Matchday 1: 19/20 September 2023 Matchday 2: 3/4 October 2023 Matchday 3: 24/25 October 2023 Matchday 4: 7/8 November 2023 Matchday 5: 28/29 November 2023 Matchday 6: 12/13 December 2023","pubDate":"2023-08-31 06:22:29","image_url":"https://static.independent.co.uk/2023/08/30/08/GettyImages-171460618.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d1680db87bb295cfe1b82df2b0968a64","title":"MLS : Monsef Bakrar marque son deuxième but avec New York City","link":"https://www.dzfoot.com/verts-deurope/mls-monsef-bakrar-marque-son-deuxieme-but-avec-new-york-city-246786.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["But","Verts du Monde","MLS","Monsef Bekrar","New York"],"creator":null,"video_url":null,"description":"Dans le cadre de la 27 ème journée de la Major League Soccer (MLS), le New York City FC de Monsef Bakrar recevait cette nuit le CF Montreal. Une rencontre au cours de laquelle le numéro 9 Algérien va s’illustrer en inscrivant son premier but en MLS et assurer ainsi la victoire des siens (2-0). […] The post MLS : Monsef Bakrar marque son deuxième but avec New York City appeared first on Football Algérien - DZFOOT.COM.","content":"Dans le cadre de la 27 ème journée de la Major League Soccer (MLS), le New York City FC de Monsef Bakrar recevait cette nuit le CF Montreal. Une rencontre au cours de laquelle le numéro 9 Algérien va s’illustrer en inscrivant son premier but en MLS et assurer ainsi la victoire des siens (2-0). Titulaire à la pointe de l’attaque du club New Yorkais, l’ancien joueur du NK Istra (Croatie) poursuit son rêve américain. Alors que son équipe menait face au club Québécois sur le score de 1 but à 0, Monsef Bakrar fera le break peu avant la pause. Sur un long ballon en profondeur, le natif de Sétif prendra le dessus sur son vis-à-vis et ajustera le gardien adverse sans trembler. Mounsef with his first @MLS goal 😍 Watch #NYCvMTL on @AppleTV #MLSSeasonPass : https://t.co/cMdkK7R82v pic.twitter.com/uOclzLAQkz — New York City Football Club (@NYCFC) August 31, 2023 Premier but donc en championnat en 3 apparitions, son deuxième toutes compétitions confondues. L'attaquant Algérien avait en effet inscrit sa première réalisation sous ses nouvelles couleurs en League Cup face à un autre club Canadien, le FC Toronto. Dzfoot","pubDate":"2023-08-31 06:14:47","image_url":null,"source_id":"dzfoot","source_priority":291587,"country":["algeria"],"category":["sports"],"language":"french"},{"article_id":"485d976e91b1c8d08f4d0852ea96d30f","title":"Football rumours: Al-Ittihad ready to make £118m bid for Mohamed Salah","link":"https://www.independent.co.uk/sport/football/mohamed-salah-jurgen-klopp-liverpool-daily-star-premier-league-b2402373.html","keywords":["Football","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Jurgen Klopp would reportedly be “furious” if Salah was allowed to leave Liverpool.","content":"With the transfer deadline looming, Premier League sides are making their final moves as the clock ticks down to September 1. According to the Daily Mail, one of the big moves could see a star name leave the Premier League, with Saudi Arabian side Al-Ittihad gearing up for a £118million bid for Egyptian forward Mohamed Salah , 31. The Daily Star reports that Liverpool boss Jurgen Klopp would be “furious” if the move went ahead. The Daily Mirror reports Manchester United are keen to nab a midfielder before the transfer window closes, with Sofyan Amrabat , 27, their prime target. The Daily Mail reports Fiorentina have turned down a £1.7million loan deal but would consider a deal with an obligation to buy. One player who could be on his way out of Old Trafford is English defender Teden Mengi . Luton are close to signing him, according to the Daily Mail. Tottenham’s move for Wales forward Brennan Johnson , 22, from Nottingham Forest has stalled, according to The Independent. Crystal Palace’s Eberechi Eze , 25, has emerged as a new target. Callum Hudson-Odoi : Nottingham Forest are close to a deal for the England winger, 22, from Chelsea, according to the Guardian. James McAtee: Manchester City’s England Under-21s midfielder could return for a second loan spell at Sheffield United, who are leading the chase for him, according to Football Insider.","pubDate":"2023-08-31 06:13:44","image_url":"https://static.independent.co.uk/2023/08/31/07/94b7e3ce63ca2e1c830a946ca88ad8e3Y29udGVudHNlYXJjaGFwaSwxNjkzNTM1MDU5-2.73269172.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3e3d9af9dcb4d0b2b463572576ca10d4","title":"Tiémoué Bakayoko deux ans à Lorient ?","link":"https://www.lequipe.fr/Football/Actualites/Tiemoue-bakayoko-deux-ans-a-lorient/1416832#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"Libre depuis le 1er juillet et la fin de son contrat avec Chelsea, Tiémoué Bakayoko devrait s'engager avec Lorient pour les deux prochaines saisons.","content":"La perspective semblait inimaginable au début de l'été, quand Tiémoué Bakayoko est devenu un joueur libre. Arrivé au terme de son contrat avec Chelsea au 1er juillet, le milieu international français (1 sélection) devrait, au bout de deux mois d'incertitudes, signer à Lorient. C'était la tendance mercredi et elle a pris du poids durant les dernières heures. À tel point que le joueur de 29 ans est attendu jeudi par le FCL pour la visite médicale. Le joueur et son entourage sont tout proches d'un accord avec les dirigeants bretons sur l'idée d'un contrat portant sur deux saisons. S'il faudra que Bakayoko, qui s'est entretenu en individuel, reprenne le rythme des entraînements collectifs, ce recrutement ressemble à une belle opportunité sportive et un joli rebond pour Lorient, qui avait déjà frôlé . Mais la piste menant au milieu de Manchester United s'est éteinte et cela a permis aux Merlus, qui ne pouvaient pas cumuler les deux dossiers, de miser sur Bakayoko. Les caractéristiques de l'ex-Blue devraient apporter encore un peu plus de consistance au milieu lorientais.","pubDate":"2023-08-31 05:45:55","image_url":"https://medias.lequipe.fr/img-photo-jpg/tiemoue-bakayoko-etait-prete-par-chelsea-a-l-ac-milan-la-saison-passee-m-borsari-presse-sports/1500000001827422/0:0,1997:998-665-335-70/d2568.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"293427537a1772213b9d58e6a0cefbc1","title":"Harry Sheezel wins 2023 AFL Rising Star award","link":"https://www.australianjewishnews.com/harry-sheezel-wins-2023-afl-rising-star-award/","keywords":["Sport","AFL","Harry Sheezel","AFL Rising Star Award","North Melbourne Kangaroos","AJAX Football Club"],"creator":null,"video_url":null,"description":"Harry Sheezel’s impressive debut AFL season was recognised in the highest possible way on August 30.","content":"Jewish 18-year-old North Melbourne Kangaroo player Harry Sheezel’s impressive debut AFL season was recognised in the highest possible way at the 2023 AFL Awards night on August 30, when he won the AFL’s Rising Star Award, earning 54 out of a maximum of 60 votes. To top it off, the former AJAX Footy Club junior and King David School graduate also won the AFLPA’s 2023 Best First Year Player award. Remarkably, Sheezel was tasked at the beginning of the season, by Roos head coach Alastair Clarkson, to play in the unfamiliar position of half back, rather than his usual half forward spot he’d played in for AJAX, the Sandringham Dragons, and Vic Metro. Taking hold of that new challenge with both hands, the 2022 AFL Draft number 3 pick averaged 27.0 disposals per game, and made the most disposals (622) by any player in their debut AFL season ever. In his Rising Star award acceptance speech, in front of Clarkson, his parents, and the who’s who of the AFL, Sheezel thanked his family, and especially his parents, Dean and Lana, for all they’ve done to help him achieve what he has in the sport. “From day one, they’ve done so much, and care so much for me. “They’re so passionate about football as well, which makes it even better, because I kind of live it with them. “The support they’ve shown to me, especially this year, has been incredible.” In an AFL press conference this morning, Sheezel reflected, “I wasn’t too sure what to espect [in the half back role] at the start of the year, to be honest, but it worked out pretty well, and I love that role now – you get a lot of freedom back there.” He said he also put his full trust in coach Alastair Clarkson putting him in the half back role, describing ‘Clarko’ as having “an unbelievable football brain”. On receiving the award, Sheezel commented, “I think I had that belief and confidence earlier in the year, and the award was kind of a result of that”. “Every week I’d just try and have that confidence that I belong at this level, and try to play my best every week, and so it was good to get recognised. “I’m not too sure where I’ll play [on the field next season]. “But I’m definitely working on my leadership, and trying to drive the group.”","pubDate":"2023-08-31 05:43:35","image_url":"https://static.timesofisrael.com/ajn/uploads/2023/08/20230831001836488282_31545-1024x640.jpeg","source_id":"australianjewishnews","source_priority":511030,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"12fe763306ed48ba6d7753a041a58c13","title":"Top-age contest","link":"https://borderwatch.com.au/sport/2023/08/31/top-age-contest/","keywords":["Sport"],"creator":["Hui Jin"],"video_url":null,"description":"UNDER 18 – SOUTH GAMBIER v NORTH GAMBIER AN anticipated match-up awaits in the Western Border Under 18 football qualifying […] The post Top-age contest appeared first on The Border Watch.","content":"James Murphy UNDER 18 – SOUTH GAMBIER v NORTH GAMBIER AN anticipated match-up awaits in the Western Border Under 18 football qualifying final. South Gambier and North Gambier will compete for the first grand final berth and a tight game could unfold. The Demons finished minor premiers, but the last meeting between the two sides went the way of the Tigers by six points. Kade Allen was a highlight for North on that occasion, while captain Reece McLaughlin top scored with two goals. Liam Delaney slotted two majors for the Demons, while Kobe Bannon and Cayde Watson also put in solid performances. The other two encounters were one-sided affairs in favour of South and the reigning premiers will be on the hunt for a similar result on Saturday. Bannon has been a regular in the Demons best players this season, while Angus Urquhart has led the goal kicking with 25 for the year so far. North’s Sebastian Doody took out the goal kicking award with 27 for the season, with McLaughlin (23 goals) and Zayne Young (21) also reliable up front. Trae Hamilton could be another to watch for the Tigers and he enters the final off a best-on-ground performance in his latest outing. The Demons kept East Gambier scoreless in their last match, where a nine-goal haul from Urquhart led them to a thumping win. They will enter Saturday as the favourite, but the Tigers should not be ruled out.","pubDate":"2023-08-31 05:30:05","image_url":null,"source_id":"borderwatch","source_priority":7435733,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"22e2603a9465ac2f4e2ab97af3bceabf","title":"Jonny Hayes keen to emulate Aberdeen FC team he's always been envious of by completing Hacken mission","link":"https://www.dailyrecord.co.uk/sport/football/football-news/jonny-hayes-keen-emulate-aberdeen-30827693","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"The veteran has always looked to one particular Dons side when embarking on European qualification quests.","content":"Jonny Hayes (Image: SNS Group) Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Jonny Hayes was always envious of the Aberdeen squad of 2007. The 36-year-old Irishman will get the chance to follow in their footsteps and is determined it will be in the continent’s second-tier competition once again. It is 16 years since Darren Mackie headed home in a 1-1 draw with Dnipro that sent Jimmy Calderwood’s Dons into the UEFA Cup group stage. It saw them face Atletico Madrid, Panathinaikos, Copenhagen and Lokomotiv Moscow before mighty Bayern Munich in the knockout stages. Since then, Aberdeen teams have tried and failed to repeat the feat. Hayes was involved when Derek McInnes’ side qualified for Europe eight years in a row and then again under Stephen Glass, only to fail to get beyond the qualifiers. Now Barry Robson’s crop know if they beat BK Hacken at Pittodrie tonight, they will be in the Europa League groups. If they don’t, the same stage of the Conference League looms. Hayes said: “We’ve had two, three or four rounds of qualifying before, had tough draws and fallen that little bit short. I’ve always been envious a little of the 2007-08 squad that played Dnipro. I wish we had one play-off game, regardless of the opposition, to prepare for. Read More Related Articles Michael Beale carries Rangers can for Champions League mauling but insists he has no regrets over PSV approach Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings “I’m sure our chances of having group stage football would have been increased. This season we’ve got our wish. We’ve got the parachute of the Conference League but by no means are we thinking about that. We want to win the game and the glory that comes with playing Europa League football.” Robson wants his side to enjoy the occasion but Hayes is adamant they are going all out for the Europa League. They aren’t interested in the consolation should they fail to build on last week’s 2-2 draw in Sweden. He added: “Golfers want to win the prizes on offer and for us it’s the same. “There is a difference between the Europa and Conference League and it is by no means a punishment to go into the Conference League. There’s an added incentive of the Europa League and I’m only thinking of winning a one-off game to go into the Europa League group stage. “It’s the closest this club have been in 15 years. Some years we had some really tough draws. We had Groningen and Real Sociedad in one season, which was really tough. “The game that took us most by surprise was probably Shkendija in 2015. They played well but Niall McGinn scored and we went through on away goals. “These teams are all technically really good. The gap is closing between the likes of Latvia and Macedonia with Scotland and Ireland. You come up against really quality teams you’ve never heard of. Aberdeen's Jonny Hayes (Image: SNS Group) \"Playing one round is easier to overcome than three or four. Had we been offered that chance, we’d have bitten your hand off. But it’s come around now and we’re trying to deliver Europa League football for the club.” The veteran is in his second spell at Pittodrie and the only starting survivor from a Glass side that put Hacken out of the Conference League in 2021. The Dons opened up with a 5-1 home win and although the Swedes mounted a mini revival in Gothenburg, it wasn’t enough. This time they got a morale-boosting draw on the road and want to finish the tie at home. Hayes said: “It feels like a lifetime ago, even though it was only a couple of years. It shows when things haven’t gone too well at a club, there’s a need for change. “It also highlights we’re always trying to progress and be better. We were really good that night. It was different to what the manager is working on now but as a player you appreciate those moments you work on in training coming to fruition on the pitch. “It clicked that night but it wasn’t a coincidence. The result caught us a little by surprise but the performance was one we expected. This one will be end to end. They like to attack with pace and we like to go forward too. I’m not saying this because we scored two goals but the second half was one of the best halves of football I’ve watched live in a long time. “The fitness side can sway a game. For me, it was more about the mentality and character to get back into the game. We knew we’d get a second after we scored and had we had five more minutes, I’m sure a third would’ve come. \"There are some games where you have to take your medicine, you don’t have the ball but keep going and never say die. That’s what the manager demands. You have to show the mentality that you want to win every game.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Jonny Hayes Aberdeen FC Europa League Scottish Premiership","pubDate":"2023-08-31 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30827718.ece/ALTERNATES/s615/0_Aberdeen-FC-Media-Access.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0b23f379ee5b54910ffbd1f9d2ca8e97","title":"On This Day in 2016: David Luiz returns to Chelsea","link":"https://www.independent.co.uk/sport/football/david-luiz-antonio-conte-juan-cuadrado-brazil-fernando-torres-b2402339.html","keywords":["Football","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"The Brazil international won six major trophies during his two spells at Stamford Bridge.","content":"David Luiz rejoined Chelsea from Paris St Germain in a £32million deal on this day in 2016. The Brazil international returned to familiar territory as then Blues boss Antonio Conte shuffled his pack with full-back Marcos Alonso also arriving from Fiorentina as midfielder Juan Cuadrado joined Juventus on loan. Luiz, then 23, had initially joined Chelsea from Portuguese side Benfica in a deal worth up to £25million in January 2011. He had arrived at Stamford Bridge on the same day as striker Fernando Torres , who cost the reigning champions £50million – a record transfer fee between British clubs – when they lured him away from Liverpool. The defender made 143 appearances in his first spell and won the Champions League, Europa League and the FA Cup before Paris St Germain paid £50million for his services in June 2014 with then Chelsea manager Jose Mourinho preferring to use Gary Cahill and John Terry at the heart of his rearguard. Luiz’s time in France proved hugely successful as PSG dominated on the domestic front, but after two seasons at the Parc des Princes, he could not resist the opportunity to renew his acquaintance with English football. Speaking as his return to the Blues was confirmed, he told the club’s official website: “I’m delighted to return to Chelsea. We had a fantastic story during my first time at the club and I want to help the team and Antonio Conte achieve a lot of success. “I always had a wonderful relationship with the fans and I am looking forward to wearing the blue shirt at Stamford Bridge once again.” Over the length of his three-year contract, Luiz added a league title, an FA Cup and another Europa League trophy to his tally before making a shock – and for some, controversial – £8million move to derby rivals Arsenal in August 2019 after indicating his desire to leave. Luiz spent two seasons at the Emirates Stadium and, now 36, is currently playing his club football with Flamengo in Brazil’s Serie A.","pubDate":"2023-08-31 05:00:00","image_url":"https://static.independent.co.uk/2023/08/31/06/0994f7b3f2445ae81f4bca0cf28db497Y29udGVudHNlYXJjaGFwaSwxNjkzNDY2NjA0-2.43203005.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d3701c93b7a2095aa95126400e5d3b4a","title":"Paulo Bernardo is Celtic transfer target with unlimited potential as Benfica mentor ranks golden boy with Joao Felix","link":"https://www.dailyrecord.co.uk/sport/football/football-transfer-news/paulo-bernardo-celtic-transfer-target-30825779","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (David McCarthy)"],"video_url":null,"description":"The midfielder's mentor has spoken in glowing terms about the man Celtic are believed to be after.","content":"Paulo Bernardo Get the latest Celtic news sent straight to your inbox with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Renato Paiva saw them all come through the Benfica academy to become superstars. Ruben Dias, Joao Cancelo, Renato Sanches, Bernardo Silva, Helder Costa and Joao Felix to name just some over the course of his 18 years overseeing the development of young talent at a club that rivals Ajax as being among the best on the planet at producing world-class footballers. So when Paiva, now the head coach of Bahia in Brazil, casts his mind back over the kids he coached at Benfica’s incredible Seixal training campus and pinpoints Paulo Bernardo as the one whose potential has no limits, it’s worth taking his opinion seriously. And when the possibility of this kid playing his football in Scotland with Celtic this season arises, Paiva’s comments on him should fill Parkhead fans with hope they will soon be witnessing someone pretty special from the same academy that gave the Jota . Bernardo, at 21, has already made 17 appearances for Benfica’s first team but after being farmed out to Pacos de Ferreira in the second half of last term, is not part of current boss Roger Schmidt’s plans for this season. The Portuguese giants – nicknames The Eagles – are, however, ready to sanction another loan deal for the player who is under contract until 2027 and is highly enough rated to have a £90million buyout clause built into it. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings Read More Related Articles Kieran Tierney in grinning Real Sociedad nickname response as Celtic hero asked how to pronounce his name That’s way too rich for Celtic’s blood, clearly, but a loan deal with the guarantee of Champions League and the knowledge on Benfica’s side that Jota was brilliantly developed in Scotland, could persuade Estadio da Luz president Rui Costa – whose has seen Bernardo’s flamboyant attacking-midfield style compared to the talent he showed at AC Milan and Borussia Dortmund – Glasgow would be a suitable destination for their protege. The youngster doesn’t shy away from the comparison – although his idol is former Argentina and Benfica midfielder Enzo Perez. But he accepts he is still at the start of a football journey, the next step of which could be taken in Scotland, although there is no shortage of interest in him across the continent. “I do have some similarities with Rui Costa I suppose in style,” Bernardo said. \"But you have to remember I am just taking my very first openings in football. “My debut for Benfica for the first team was the first step and my dream is to one day play for Portugal at a World Cup. But I am only young. I want to play, have fun and work to get my opportunities. \"My hero and the player I base my game on was Enzo Perez, when he was at Benfica. I’d love to play in a role like him as a free attacking midfielder.” Paiva reckons that wherever Bernardo ends up, he will shine as brightly as the name of the stadium he will leave behind. And that eventually, Benfica will make an absolute fortune on the boy he developed as a pre-teen into a budding superstar by impressing on him the need to add goals to his undoubted talent in the middle of the park. “Paulo had a beautiful history with us,” Paiva said recently. “He was identified at Benfica as an elite midfielder, but I told him there was a difference between an elite midfielder and a high-quality midfielder, scoring goals. “If he didn’t score goals, he would never become an elite midfielder. The truth is that Paulo, being the intelligent kid that he is, knew how to listen, be patient and work accordingly. “I left but I’m delighted whenever I see Paulo’s goals, because I remembered this story and he knows it’s true. What I can assess is Paulo’s potential and this is never-ending. \"And I said after leaving, Paulo could be the future biggest sale of Benfica. I see Paulo, with respect and affection to everyone else, this way. “I said this in the past about Joao Felix, and now I’m saying this about Paulo. I feel he’s different. If he stays healthy, he will give a lot of sporting and financial income to Benfica.” Joao Felix in action at the World Cup (Image: Offside via Getty Images) If Bernardo does find his way to Parkhead before the transfer window closes on Friday night, Paiva believes the Portugal U21 star will cope with anything that comes his way. He added: “Besides the quality he has, one fundamental thing is the mental aspect at this stage. “Paulo is a super-reserved kid. I’ve already told him he must speak louder and more often, but I also think it helps him. “He’s focused. On the field he changes and his football speaks for him and he’s becoming a leader. But outside it he’s a reserved kid, humble and very quiet, but focused on what he wants. “He has everything to be an elite player, there are no extravagances or distractions. He’s highly intelligent, he knows what he wants, he knows how to listen, which is a great virtue. That’s how he got to where he has and how I think he will get to where he’s going.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Paulo Bernardo Celtic FC Scottish Premiership Celtic Transfer News Transfer Talk Benfica","pubDate":"2023-08-31 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30817257.ece/ALTERNATES/s615/0_GettyImages-1240057712.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f6df8acddf69a564e387c1c1b6de02a5","title":"Is the Champions League draw on TV? Channel, start time and how to watch online","link":"https://www.independent.co.uk/sport/football/when-champions-league-group-stage-draw-b2402214.html","keywords":["Football","Sport"],"creator":["Lawrence Ostlere"],"video_url":null,"description":"Arsenal, Manchester City, Manchester United and Newcastle are all in the draw for the Champions League group stage","content":"The Champions League is back and the draw will take place later today to decide the 2023/24 group stage. Four English clubs are in the draw: the reigning champions Manchester City, along with Arsenal, Manchester United and Newcastle United. For the final time before the competition takes on a new format next season, 32 teams will be split into eight groups of four. Each group will contain one team from each of the four seeded pots, and clubs from the same national league will not be drawn together in the same group. Pot 1 will consist of the Champions League winners, the Europa League winners and six domestic champions of the highest ranked leagues. The remaining pots will be decided by Uefa’s club coefficient rankings . The final will take place at London’s Wembley Stadium on 1 June 2024. The draw for the group stage will take place in Monaco on Thursday 31 August, at 5pm BST. The draw will be televised live in the UK on TNT Sports (formerly BT Sport) for subscribing customers, and will be available on the TNT Sports app. You can also live stream the draw for free on the Uefa website and YouTube channel . There are 32 clubs qualified for the Champions League group stage: England: Arsenal, Manchester City, Manchester United, Newcastle United Spain : Atletico Madrid, Barcelona, Real Madrid, Real Sociedad, Sevilla Germany : Bayern Munich, Borussia Dortmund, Leipzig, Union Berlin Italy : Inter Milan, Lazio, AC Milan, Napoli France : Lens, Paris Saint-Germain Portugal : Benfica, Porto, Braga Netherlands : Feyenoord, PSV Austria : Salzburg Scotland : Celtic Serbia : Red Star Belgrade Ukraine : Shakhtar Donetsk Belgium : Antwerp Switzerland: Young Boys Turkey: Galatasaray Ukraine : Shakhtar Donetsk Matchday 1: 19/20 September 2023 Matchday 2: 3/4 October 2023 Matchday 3: 24/25 October 2023 Matchday 4: 7/8 November 2023 Matchday 5: 28/29 November 2023 Matchday 6: 12/13 December 2023","pubDate":"2023-08-31 06:26:18","image_url":"https://static.independent.co.uk/2023/08/30/12/a86b6bc41c328c576caa8179a7579fecY29udGVudHNlYXJjaGFwaSwxNjkyODc4ODE5-2.72555912.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6025a4ef2425293c9b76cffcb775c62b","title":"When is the Champions League group stage draw?","link":"https://www.independent.co.uk/sport/football/when-champions-league-group-stage-draw-b2402375.html","keywords":["Football","Sport"],"creator":["Lawrence Ostlere"],"video_url":null,"description":"Arsenal, Manchester City, Manchester United and Newcastle are all in the draw for the Champions League group stage","content":"The Champions League is nearly upon us for the new 2023/24 season, as treble-winners Manchester City try to retain their crown as the kings of Europe following their 1-0 win over Inter Milan in Istanbul in June. For the final time before the competition takes on a new format next season, 32 teams will be split into eight groups of four. Each group will contain one team from each of the four seeded pots, and clubs from the same national league will not be drawn together in the same group. Pot 1 will consist of the Champions League winners, the Europa League winners and six domestic champions of the highest ranked leagues. The remaining pots will be decided by Uefa’s club coefficient rankings . The final will take place at London’s Wembley Stadium on 1 June 2024. The draw for the group stage will take place in Monaco on Thursday 31 August, at 5pm BST. There are 32 clubs qualified for the Champions League group stage: England: Arsenal, Manchester City, Manchester United, Newcastle United Spain : Atletico Madrid, Barcelona, Real Madrid, Real Sociedad, Sevilla Germany : Bayern Munich, Borussia Dortmund, Leipzig, Union Berlin Italy : Inter Milan, Lazio, AC Milan, Napoli France : Lens, Paris Saint-Germain Portugal : Benfica, Porto, Braga Netherlands : Feyenoord, PSV Austria : Salzburg Scotland : Celtic Serbia : Red Star Belgrade Ukraine : Shakhtar Donetsk Belgium : Antwerp Switzerland: Young Boys Turkey: Galatasaray Ukraine : Shakhtar Donetsk Matchday 1: 19/20 September 2023 Matchday 2: 3/4 October 2023 Matchday 3: 24/25 October 2023 Matchday 4: 7/8 November 2023 Matchday 5: 28/29 November 2023 Matchday 6: 12/13 December 2023","pubDate":"2023-08-31 06:22:29","image_url":"https://static.independent.co.uk/2023/08/30/08/GettyImages-171460618.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d1680db87bb295cfe1b82df2b0968a64","title":"MLS : Monsef Bakrar marque son deuxième but avec New York City","link":"https://www.dzfoot.com/verts-deurope/mls-monsef-bakrar-marque-son-deuxieme-but-avec-new-york-city-246786.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["But","Verts du Monde","MLS","Monsef Bekrar","New York"],"creator":null,"video_url":null,"description":"Dans le cadre de la 27 ème journée de la Major League Soccer (MLS), le New York City FC de Monsef Bakrar recevait cette nuit le CF Montreal. Une rencontre au cours de laquelle le numéro 9 Algérien va s’illustrer en inscrivant son premier but en MLS et assurer ainsi la victoire des siens (2-0). […] The post MLS : Monsef Bakrar marque son deuxième but avec New York City appeared first on Football Algérien - DZFOOT.COM.","content":"Dans le cadre de la 27 ème journée de la Major League Soccer (MLS), le New York City FC de Monsef Bakrar recevait cette nuit le CF Montreal. Une rencontre au cours de laquelle le numéro 9 Algérien va s’illustrer en inscrivant son premier but en MLS et assurer ainsi la victoire des siens (2-0). Titulaire à la pointe de l’attaque du club New Yorkais, l’ancien joueur du NK Istra (Croatie) poursuit son rêve américain. Alors que son équipe menait face au club Québécois sur le score de 1 but à 0, Monsef Bakrar fera le break peu avant la pause. Sur un long ballon en profondeur, le natif de Sétif prendra le dessus sur son vis-à-vis et ajustera le gardien adverse sans trembler. Mounsef with his first @MLS goal 😍 Watch #NYCvMTL on @AppleTV #MLSSeasonPass : https://t.co/cMdkK7R82v pic.twitter.com/uOclzLAQkz — New York City Football Club (@NYCFC) August 31, 2023 Premier but donc en championnat en 3 apparitions, son deuxième toutes compétitions confondues. L'attaquant Algérien avait en effet inscrit sa première réalisation sous ses nouvelles couleurs en League Cup face à un autre club Canadien, le FC Toronto. Dzfoot","pubDate":"2023-08-31 06:14:47","image_url":null,"source_id":"dzfoot","source_priority":291587,"country":["algeria"],"category":["sports"],"language":"french"},{"article_id":"485d976e91b1c8d08f4d0852ea96d30f","title":"Football rumours: Al-Ittihad ready to make £118m bid for Mohamed Salah","link":"https://www.independent.co.uk/sport/football/mohamed-salah-jurgen-klopp-liverpool-daily-star-premier-league-b2402373.html","keywords":["Football","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Jurgen Klopp would reportedly be “furious” if Salah was allowed to leave Liverpool.","content":"With the transfer deadline looming, Premier League sides are making their final moves as the clock ticks down to September 1. According to the Daily Mail, one of the big moves could see a star name leave the Premier League, with Saudi Arabian side Al-Ittihad gearing up for a £118million bid for Egyptian forward Mohamed Salah , 31. The Daily Star reports that Liverpool boss Jurgen Klopp would be “furious” if the move went ahead. The Daily Mirror reports Manchester United are keen to nab a midfielder before the transfer window closes, with Sofyan Amrabat , 27, their prime target. The Daily Mail reports Fiorentina have turned down a £1.7million loan deal but would consider a deal with an obligation to buy. One player who could be on his way out of Old Trafford is English defender Teden Mengi . Luton are close to signing him, according to the Daily Mail. Tottenham’s move for Wales forward Brennan Johnson , 22, from Nottingham Forest has stalled, according to The Independent. Crystal Palace’s Eberechi Eze , 25, has emerged as a new target. Callum Hudson-Odoi : Nottingham Forest are close to a deal for the England winger, 22, from Chelsea, according to the Guardian. James McAtee: Manchester City’s England Under-21s midfielder could return for a second loan spell at Sheffield United, who are leading the chase for him, according to Football Insider.","pubDate":"2023-08-31 06:13:44","image_url":"https://static.independent.co.uk/2023/08/31/07/94b7e3ce63ca2e1c830a946ca88ad8e3Y29udGVudHNlYXJjaGFwaSwxNjkzNTM1MDU5-2.73269172.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3e3d9af9dcb4d0b2b463572576ca10d4","title":"Tiémoué Bakayoko deux ans à Lorient ?","link":"https://www.lequipe.fr/Football/Actualites/Tiemoue-bakayoko-deux-ans-a-lorient/1416832#xtor=RSS-1","keywords":["Foot, Transferts"],"creator":["Flavien Trésarrieu"],"video_url":null,"description":"Libre depuis le 1er juillet et la fin de son contrat avec Chelsea, Tiémoué Bakayoko devrait s'engager avec Lorient pour les deux prochaines saisons.","content":"La perspective semblait inimaginable au début de l'été, quand Tiémoué Bakayoko est devenu un joueur libre. Arrivé au terme de son contrat avec Chelsea au 1er juillet, le milieu international français (1 sélection) devrait, au bout de deux mois d'incertitudes, signer à Lorient. C'était la tendance mercredi et elle a pris du poids durant les dernières heures. À tel point que le joueur de 29 ans est attendu jeudi par le FCL pour la visite médicale. Le joueur et son entourage sont tout proches d'un accord avec les dirigeants bretons sur l'idée d'un contrat portant sur deux saisons. S'il faudra que Bakayoko, qui s'est entretenu en individuel, reprenne le rythme des entraînements collectifs, ce recrutement ressemble à une belle opportunité sportive et un joli rebond pour Lorient, qui avait déjà frôlé . Mais la piste menant au milieu de Manchester United s'est éteinte et cela a permis aux Merlus, qui ne pouvaient pas cumuler les deux dossiers, de miser sur Bakayoko. Les caractéristiques de l'ex-Blue devraient apporter encore un peu plus de consistance au milieu lorientais.","pubDate":"2023-08-31 05:45:55","image_url":"https://medias.lequipe.fr/img-photo-jpg/tiemoue-bakayoko-etait-prete-par-chelsea-a-l-ac-milan-la-saison-passee-m-borsari-presse-sports/1500000001827422/0:0,1997:998-665-335-70/d2568.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"293427537a1772213b9d58e6a0cefbc1","title":"Harry Sheezel wins 2023 AFL Rising Star award","link":"https://www.australianjewishnews.com/harry-sheezel-wins-2023-afl-rising-star-award/","keywords":["Sport","AFL","Harry Sheezel","AFL Rising Star Award","North Melbourne Kangaroos","AJAX Football Club"],"creator":null,"video_url":null,"description":"Harry Sheezel’s impressive debut AFL season was recognised in the highest possible way on August 30.","content":"Jewish 18-year-old North Melbourne Kangaroo player Harry Sheezel’s impressive debut AFL season was recognised in the highest possible way at the 2023 AFL Awards night on August 30, when he won the AFL’s Rising Star Award, earning 54 out of a maximum of 60 votes. To top it off, the former AJAX Footy Club junior and King David School graduate also won the AFLPA’s 2023 Best First Year Player award. Remarkably, Sheezel was tasked at the beginning of the season, by Roos head coach Alastair Clarkson, to play in the unfamiliar position of half back, rather than his usual half forward spot he’d played in for AJAX, the Sandringham Dragons, and Vic Metro. Taking hold of that new challenge with both hands, the 2022 AFL Draft number 3 pick averaged 27.0 disposals per game, and made the most disposals (622) by any player in their debut AFL season ever. In his Rising Star award acceptance speech, in front of Clarkson, his parents, and the who’s who of the AFL, Sheezel thanked his family, and especially his parents, Dean and Lana, for all they’ve done to help him achieve what he has in the sport. “From day one, they’ve done so much, and care so much for me. “They’re so passionate about football as well, which makes it even better, because I kind of live it with them. “The support they’ve shown to me, especially this year, has been incredible.” In an AFL press conference this morning, Sheezel reflected, “I wasn’t too sure what to espect [in the half back role] at the start of the year, to be honest, but it worked out pretty well, and I love that role now – you get a lot of freedom back there.” He said he also put his full trust in coach Alastair Clarkson putting him in the half back role, describing ‘Clarko’ as having “an unbelievable football brain”. On receiving the award, Sheezel commented, “I think I had that belief and confidence earlier in the year, and the award was kind of a result of that”. “Every week I’d just try and have that confidence that I belong at this level, and try to play my best every week, and so it was good to get recognised. “I’m not too sure where I’ll play [on the field next season]. “But I’m definitely working on my leadership, and trying to drive the group.”","pubDate":"2023-08-31 05:43:35","image_url":"https://static.timesofisrael.com/ajn/uploads/2023/08/20230831001836488282_31545-1024x640.jpeg","source_id":"australianjewishnews","source_priority":511030,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"12fe763306ed48ba6d7753a041a58c13","title":"Top-age contest","link":"https://borderwatch.com.au/sport/2023/08/31/top-age-contest/","keywords":["Sport"],"creator":["Hui Jin"],"video_url":null,"description":"UNDER 18 – SOUTH GAMBIER v NORTH GAMBIER AN anticipated match-up awaits in the Western Border Under 18 football qualifying […] The post Top-age contest appeared first on The Border Watch.","content":"James Murphy UNDER 18 – SOUTH GAMBIER v NORTH GAMBIER AN anticipated match-up awaits in the Western Border Under 18 football qualifying final. South Gambier and North Gambier will compete for the first grand final berth and a tight game could unfold. The Demons finished minor premiers, but the last meeting between the two sides went the way of the Tigers by six points. Kade Allen was a highlight for North on that occasion, while captain Reece McLaughlin top scored with two goals. Liam Delaney slotted two majors for the Demons, while Kobe Bannon and Cayde Watson also put in solid performances. The other two encounters were one-sided affairs in favour of South and the reigning premiers will be on the hunt for a similar result on Saturday. Bannon has been a regular in the Demons best players this season, while Angus Urquhart has led the goal kicking with 25 for the year so far. North’s Sebastian Doody took out the goal kicking award with 27 for the season, with McLaughlin (23 goals) and Zayne Young (21) also reliable up front. Trae Hamilton could be another to watch for the Tigers and he enters the final off a best-on-ground performance in his latest outing. The Demons kept East Gambier scoreless in their last match, where a nine-goal haul from Urquhart led them to a thumping win. They will enter Saturday as the favourite, but the Tigers should not be ruled out.","pubDate":"2023-08-31 05:30:05","image_url":null,"source_id":"borderwatch","source_priority":7435733,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"22e2603a9465ac2f4e2ab97af3bceabf","title":"Jonny Hayes keen to emulate Aberdeen FC team he's always been envious of by completing Hacken mission","link":"https://www.dailyrecord.co.uk/sport/football/football-news/jonny-hayes-keen-emulate-aberdeen-30827693","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (Scott Burns)"],"video_url":null,"description":"The veteran has always looked to one particular Dons side when embarking on European qualification quests.","content":"Jonny Hayes (Image: SNS Group) Get the latest news from Record Sport with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest news from Record Sport with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Jonny Hayes was always envious of the Aberdeen squad of 2007. The 36-year-old Irishman will get the chance to follow in their footsteps and is determined it will be in the continent’s second-tier competition once again. It is 16 years since Darren Mackie headed home in a 1-1 draw with Dnipro that sent Jimmy Calderwood’s Dons into the UEFA Cup group stage. It saw them face Atletico Madrid, Panathinaikos, Copenhagen and Lokomotiv Moscow before mighty Bayern Munich in the knockout stages. Since then, Aberdeen teams have tried and failed to repeat the feat. Hayes was involved when Derek McInnes’ side qualified for Europe eight years in a row and then again under Stephen Glass, only to fail to get beyond the qualifiers. Now Barry Robson’s crop know if they beat BK Hacken at Pittodrie tonight, they will be in the Europa League groups. If they don’t, the same stage of the Conference League looms. Hayes said: “We’ve had two, three or four rounds of qualifying before, had tough draws and fallen that little bit short. I’ve always been envious a little of the 2007-08 squad that played Dnipro. I wish we had one play-off game, regardless of the opposition, to prepare for. Read More Related Articles Michael Beale carries Rangers can for Champions League mauling but insists he has no regrets over PSV approach Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings “I’m sure our chances of having group stage football would have been increased. This season we’ve got our wish. We’ve got the parachute of the Conference League but by no means are we thinking about that. We want to win the game and the glory that comes with playing Europa League football.” Robson wants his side to enjoy the occasion but Hayes is adamant they are going all out for the Europa League. They aren’t interested in the consolation should they fail to build on last week’s 2-2 draw in Sweden. He added: “Golfers want to win the prizes on offer and for us it’s the same. “There is a difference between the Europa and Conference League and it is by no means a punishment to go into the Conference League. There’s an added incentive of the Europa League and I’m only thinking of winning a one-off game to go into the Europa League group stage. “It’s the closest this club have been in 15 years. Some years we had some really tough draws. We had Groningen and Real Sociedad in one season, which was really tough. “The game that took us most by surprise was probably Shkendija in 2015. They played well but Niall McGinn scored and we went through on away goals. “These teams are all technically really good. The gap is closing between the likes of Latvia and Macedonia with Scotland and Ireland. You come up against really quality teams you’ve never heard of. Aberdeen's Jonny Hayes (Image: SNS Group) \"Playing one round is easier to overcome than three or four. Had we been offered that chance, we’d have bitten your hand off. But it’s come around now and we’re trying to deliver Europa League football for the club.” The veteran is in his second spell at Pittodrie and the only starting survivor from a Glass side that put Hacken out of the Conference League in 2021. The Dons opened up with a 5-1 home win and although the Swedes mounted a mini revival in Gothenburg, it wasn’t enough. This time they got a morale-boosting draw on the road and want to finish the tie at home. Hayes said: “It feels like a lifetime ago, even though it was only a couple of years. It shows when things haven’t gone too well at a club, there’s a need for change. “It also highlights we’re always trying to progress and be better. We were really good that night. It was different to what the manager is working on now but as a player you appreciate those moments you work on in training coming to fruition on the pitch. “It clicked that night but it wasn’t a coincidence. The result caught us a little by surprise but the performance was one we expected. This one will be end to end. They like to attack with pace and we like to go forward too. I’m not saying this because we scored two goals but the second half was one of the best halves of football I’ve watched live in a long time. “The fitness side can sway a game. For me, it was more about the mentality and character to get back into the game. We knew we’d get a second after we scored and had we had five more minutes, I’m sure a third would’ve come. \"There are some games where you have to take your medicine, you don’t have the ball but keep going and never say die. That’s what the manager demands. You have to show the mentality that you want to win every game.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Jonny Hayes Aberdeen FC Europa League Scottish Premiership","pubDate":"2023-08-31 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30827718.ece/ALTERNATES/s615/0_Aberdeen-FC-Media-Access.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0b23f379ee5b54910ffbd1f9d2ca8e97","title":"On This Day in 2016: David Luiz returns to Chelsea","link":"https://www.independent.co.uk/sport/football/david-luiz-antonio-conte-juan-cuadrado-brazil-fernando-torres-b2402339.html","keywords":["Football","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"The Brazil international won six major trophies during his two spells at Stamford Bridge.","content":"David Luiz rejoined Chelsea from Paris St Germain in a £32million deal on this day in 2016. The Brazil international returned to familiar territory as then Blues boss Antonio Conte shuffled his pack with full-back Marcos Alonso also arriving from Fiorentina as midfielder Juan Cuadrado joined Juventus on loan. Luiz, then 23, had initially joined Chelsea from Portuguese side Benfica in a deal worth up to £25million in January 2011. He had arrived at Stamford Bridge on the same day as striker Fernando Torres , who cost the reigning champions £50million – a record transfer fee between British clubs – when they lured him away from Liverpool. The defender made 143 appearances in his first spell and won the Champions League, Europa League and the FA Cup before Paris St Germain paid £50million for his services in June 2014 with then Chelsea manager Jose Mourinho preferring to use Gary Cahill and John Terry at the heart of his rearguard. Luiz’s time in France proved hugely successful as PSG dominated on the domestic front, but after two seasons at the Parc des Princes, he could not resist the opportunity to renew his acquaintance with English football. Speaking as his return to the Blues was confirmed, he told the club’s official website: “I’m delighted to return to Chelsea. We had a fantastic story during my first time at the club and I want to help the team and Antonio Conte achieve a lot of success. “I always had a wonderful relationship with the fans and I am looking forward to wearing the blue shirt at Stamford Bridge once again.” Over the length of his three-year contract, Luiz added a league title, an FA Cup and another Europa League trophy to his tally before making a shock – and for some, controversial – £8million move to derby rivals Arsenal in August 2019 after indicating his desire to leave. Luiz spent two seasons at the Emirates Stadium and, now 36, is currently playing his club football with Flamengo in Brazil’s Serie A.","pubDate":"2023-08-31 05:00:00","image_url":"https://static.independent.co.uk/2023/08/31/06/0994f7b3f2445ae81f4bca0cf28db497Y29udGVudHNlYXJjaGFwaSwxNjkzNDY2NjA0-2.43203005.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d3701c93b7a2095aa95126400e5d3b4a","title":"Paulo Bernardo is Celtic transfer target with unlimited potential as Benfica mentor ranks golden boy with Joao Felix","link":"https://www.dailyrecord.co.uk/sport/football/football-transfer-news/paulo-bernardo-celtic-transfer-target-30825779","keywords":["Football"],"creator":["reporters@dailyrecord.co.uk (David McCarthy)"],"video_url":null,"description":"The midfielder's mentor has spoken in glowing terms about the man Celtic are believed to be after.","content":"Paulo Bernardo Get the latest Celtic news sent straight to your inbox with our daily newsletter More Newsletters Subscribe Invalid email Something went wrong, please try again later. More Newsletters We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info Thank you for subscribing! We have more newsletters Show me See Our Privacy Notice See Our Privacy Notice × Group 28 Get the latest Celtic news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in ways you’ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Renato Paiva saw them all come through the Benfica academy to become superstars. Ruben Dias, Joao Cancelo, Renato Sanches, Bernardo Silva, Helder Costa and Joao Felix to name just some over the course of his 18 years overseeing the development of young talent at a club that rivals Ajax as being among the best on the planet at producing world-class footballers. So when Paiva, now the head coach of Bahia in Brazil, casts his mind back over the kids he coached at Benfica’s incredible Seixal training campus and pinpoints Paulo Bernardo as the one whose potential has no limits, it’s worth taking his opinion seriously. And when the possibility of this kid playing his football in Scotland with Celtic this season arises, Paiva’s comments on him should fill Parkhead fans with hope they will soon be witnessing someone pretty special from the same academy that gave the Jota . Bernardo, at 21, has already made 17 appearances for Benfica’s first team but after being farmed out to Pacos de Ferreira in the second half of last term, is not part of current boss Roger Schmidt’s plans for this season. The Portuguese giants – nicknames The Eagles – are, however, ready to sanction another loan deal for the player who is under contract until 2027 and is highly enough rated to have a £90million buyout clause built into it. Read More Related Articles Transfer news LIVE as Celtic and Rangers plus Aberdeen FC, Hearts and Hibs eye signings Read More Related Articles Kieran Tierney in grinning Real Sociedad nickname response as Celtic hero asked how to pronounce his name That’s way too rich for Celtic’s blood, clearly, but a loan deal with the guarantee of Champions League and the knowledge on Benfica’s side that Jota was brilliantly developed in Scotland, could persuade Estadio da Luz president Rui Costa – whose has seen Bernardo’s flamboyant attacking-midfield style compared to the talent he showed at AC Milan and Borussia Dortmund – Glasgow would be a suitable destination for their protege. The youngster doesn’t shy away from the comparison – although his idol is former Argentina and Benfica midfielder Enzo Perez. But he accepts he is still at the start of a football journey, the next step of which could be taken in Scotland, although there is no shortage of interest in him across the continent. “I do have some similarities with Rui Costa I suppose in style,” Bernardo said. \"But you have to remember I am just taking my very first openings in football. “My debut for Benfica for the first team was the first step and my dream is to one day play for Portugal at a World Cup. But I am only young. I want to play, have fun and work to get my opportunities. \"My hero and the player I base my game on was Enzo Perez, when he was at Benfica. I’d love to play in a role like him as a free attacking midfielder.” Paiva reckons that wherever Bernardo ends up, he will shine as brightly as the name of the stadium he will leave behind. And that eventually, Benfica will make an absolute fortune on the boy he developed as a pre-teen into a budding superstar by impressing on him the need to add goals to his undoubted talent in the middle of the park. “Paulo had a beautiful history with us,” Paiva said recently. “He was identified at Benfica as an elite midfielder, but I told him there was a difference between an elite midfielder and a high-quality midfielder, scoring goals. “If he didn’t score goals, he would never become an elite midfielder. The truth is that Paulo, being the intelligent kid that he is, knew how to listen, be patient and work accordingly. “I left but I’m delighted whenever I see Paulo’s goals, because I remembered this story and he knows it’s true. What I can assess is Paulo’s potential and this is never-ending. \"And I said after leaving, Paulo could be the future biggest sale of Benfica. I see Paulo, with respect and affection to everyone else, this way. “I said this in the past about Joao Felix, and now I’m saying this about Paulo. I feel he’s different. If he stays healthy, he will give a lot of sporting and financial income to Benfica.” Joao Felix in action at the World Cup (Image: Offside via Getty Images) If Bernardo does find his way to Parkhead before the transfer window closes on Friday night, Paiva believes the Portugal U21 star will cope with anything that comes his way. He added: “Besides the quality he has, one fundamental thing is the mental aspect at this stage. “Paulo is a super-reserved kid. I’ve already told him he must speak louder and more often, but I also think it helps him. “He’s focused. On the field he changes and his football speaks for him and he’s becoming a leader. But outside it he’s a reserved kid, humble and very quiet, but focused on what he wants. “He has everything to be an elite player, there are no extravagances or distractions. He’s highly intelligent, he knows what he wants, he knows how to listen, which is a great virtue. That’s how he got to where he has and how I think he will get to where he’s going.” Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter More On Paulo Bernardo Celtic FC Scottish Premiership Celtic Transfer News Transfer Talk Benfica","pubDate":"2023-08-31 05:00:00","image_url":"https://i2-prod.dailyrecord.co.uk/incoming/article30817257.ece/ALTERNATES/s615/0_GettyImages-1240057712.jpg","source_id":"dailyrecord","source_priority":13708,"country":["united kingdom"],"category":["sports"],"language":"english"}]}