{"newsArray":[{"title":"Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer'","link":"https://www.dailymail.co.uk/sport/football/article-12395603/Liverpool-verge-beating-Chelsea-Moises-Caicedo-Brighton-ready-accept-110m-offer.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Caicedo, 21, had seemed destined to join Chelsea this summer but he is now slated to join Liverpool as early as Friday. The Reds are hopeful of agreeing personal terms with the Ecuadorian in the morning.","content":"Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer' Liverpool look set to beat Chelsea to the signature of Moises Caicedo Brighton have reportedly accepted Liverpool's £110m offer for Caicedo Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full By Daniel Matthews For Dailymail.Com Published: 01:36, 11 August 2023 | Updated: 02:03, 11 August 2023 e-mail View comments Liverpool are reportedly on the verge of completing a British record deal for Brighton midfielder Moises Caicedo. It's claimed Jurgen Klopp 's side have submitted a bid worth up to £110million, with The Athletic reporting Brighton have accepted the offer. Caicedo, 21, had seemed destined to join Chelsea this summer but he is now slated to join Liverpool as early as Friday. Brighton set a deadline of midnight on Thursday for final bids, and Liverpool returned with a £110m offer, while Chelsea put forward £100m. Agreeing personal terms with the player is not expected to be an issue for the Reds, and a medical is scheduled for Friday. Moises Caicedo now looks set to join Liverpool rather than Chelsea this summer IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Caicedo joining Liverpool would be a major blow for Chelsea given their lengthy pursuit of the midfielder this summer. The Blues have had multiple bids knocked back by Brighton, but had still appeared confident of getting a deal wrapped up before the transfer window closes at the start of September. They now look set to miss out on his signature to one of their closest rivals, and this setback comes just two days before they face Liverpool at Stamford Bridge in their first game of the new Premier League season. Both clubs have also shown considerable interest in Southampton's Romeo Lavia as they look to further strengthen their midfields. Liverpool have had three bids rejected by the Championship club, with their latest offer of £46m falling short of Southampton's £50m asking price. Chelsea trumped that offer with a £47m bid this week, but are yet to reach an agreement with the Saints. More to follow... Your browser does not support iframes. Share or comment on this article: Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer' e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 01:01:51","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74194131-0-image-a-9_1691714197389.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How to Watch Spain vs Netherlands, FIFA Women’s World Cup 2023 Live Streaming Online in India? Get Free Live Telecast of ESP vs NED Quarterfinal Football WC Match Score Updates on TV","link":"https://www.latestly.com/socially/sports/football/how-to-watch-spain-vs-netherlands-fifa-womens-world-cup-2023-live-streaming-online-in-india-get-free-live-telecast-of-esp-vs-ned-quarterfinal-football-wc-match-score-updates-on-tv-5332086.html","keywords":null,"creator":null,"video_url":null,"description":"Spain had a comprehensive victory against Netherlands in the last game while Netherlands are also coming out of a clinical victory. Scroll down to get live streaming and telecast details.","content":"Spain will square off against Netherlands in the Quarterfinal clash of the FIFA Women’s World Cup on August 11, 2023, Friday. The match will take place at the Wellington Regional Stadium, Wellington, New Zealand. The match begins at 6.30 AM IST (Indian Standard Time). DD Sports is the official broadcaster of the marquee tournament in India and therefore, fans can watch the knockout game on the DD Sports channel. Moreover, the Indian audience can enjoy the live streaming of the high-voltage encounter online on the FanCode app or website. Spain vs Netherlands, FIFA Women’s World Cup 2023 Live Streaming and Telecast Details The Netherlands are ready to take on Spain. 💪🇳🇱 Sherida Spitse, Esmee Brugts and Lineth Beerensteyn share their thoughts ahead of the #FIFAWWC Quarter-Final fixture. 👇 — FIFA Women's World Cup (@FIFAWWC) August 10, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-11 00:45:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires","link":"https://www.dailymail.co.uk/sport/football/article-12395501/The-promoter-Charlie-Sheen-Bill-Clinton-Princess-Mary-dubs-Sam-Kerr-female-Cristiano-Ronaldo-tips-Matildas-captain-earn-500million-retires.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"A leading Australian agent has dubbed Sam Kerr a 'female Cristiano Ronaldo' and has tipped the Matildas captain to become first female player to earn over $500million during her career","content":"The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires Matildas have reached quarter final against France Huge audiences are watching the World Cup Kerr stands to make a fortune in sponsorships and endorsements By Josh Alston For Daily Mail Australia Published: 20:41 EDT, 10 August 2023 | Updated: 20:41 EDT, 10 August 2023 e-mail 1 View comments A leading Australian agent has dubbed Sam Kerr a 'female Cristiano Ronaldo' and has tipped the Matildas captain to become the first female player to earn over $500million during her career. Celebrity and talent promoter, publicist and agent Max Markson has worked with some of the biggest names in the business, including Charlie Sheen , Bill Clinton , Tony Blair, George Bush snr, Princess Mary and Crown Prince Frederick of Denmark, Nelson Mandela, Rudy Giuliani, Shane Warne, Joe Bugner, Greg Chappell and Martina Navratilova. As Australia prepares for its Women's World Cup quarter final clash against France on Saturday, he believes Kerr has the talent and marketing appeal to become the biggest women's name in sport. He believes that businesses from a range of industries will line up to make Kerr the face of their marketing campaigns while the Chelsea striker could earn as much as $250,000 a year in speaking engagements alone. 'By the end of her career, she will end up with $500m in the bank,' Markson told CODE Sports . 'She will be a female Cristiano Ronaldo. Kerr's star is set to rise as the Matildas progress deep into the Women's World Cup in Australia and New Zealand Cristiano Ronaldo signed a contract for over $330million to play in Saudi Arabia and has a range of lucrative sponsorship and endorsements as well PR King Max Markson said that 'the world is her oyster' when it comes to the financial future of Sam Kerr following the Women's World Cup 'Sam could enter the same pay bracket as Ronaldo (estimated to be worth $500m). And Ronaldo is the biggest soccer player in the world. Sam is female – that's the magic. The world is her oyster.' It all begins on Saturday at Suncorp Stadium - re-badged Brisbane Stadium by FIFA - where the Matildas will look to make history by reaching their first World Cup semi-final with victory over France. Kerr missed the group stage matches against Republic of Ireland, Nigeria and Canada before returning from a calf injury to play limited minutes in the Matildas 2-0 round of 16 win over Denmark . She is expected to play more of a role against France and Markson said the eyes of the world were now upon her. 'The World Cup is enormous so she will get a World Cup deal. Any international or global deal with a major corporation will be worth $5m or $10m alone, at least,' he said. 'Even if Australia doesn't win, and they might, she has to be worth $25m by the time the World Cup ends, easily. And that money for Sam will increase every year, it will grow and grow and grow. 'Look at some of the corporations already doing the Olympic Games. You've got breakfast cereals, clothing companies, food, electronic companies, telephone companies, anything she wants, she will get. 'She is presentable, a great sports personality, is a performer and has another ten years of playing. Sam will keep going until she's 40 if she wants. Kerr celebrate victory with Chelsea teammates after their Women's FA Cup final victory over Arsenal in 2021 Before Kerr can start counting her money, she has a huge role to play for Australia in their quarter final showdown against France on Saturday 'I don't think she needs to be at the peak of her career to get enormous money playing overseas in places like America or Saudi Arabia. 'Sam could get a gig in America for a fortune, some serious money. Look at David Beckham. He was playing in the UK and finished up in America. If you want to go back even further, Pele went to New York. 'And she will also be able to do a speaking tour here in Australia whenever she wants.' Kerr already has lucrative sponsorships with Mastercard and Nike, the latter a deal believed to be worth around $1million. Nike also sponsors the likes of male superstars Ronaldo and Kylian Mbappe. On top of sponsorships, Kerr's $600,000 a season pricetag at Chelsea is also set to skyrocket. 'Sam is playing for Chelsea at the moment but she will get picked up by whoever she wants after this. And that will mean Chelsea have to put more money in, and believe me, Chelsea have got plenty of money,' Markson said. 'She will have global endorsement campaigns for advertising. She doesn't have to be on the pitch for those – just TV commercials and endorsements. Everyone will want her around the world.' Share or comment on this article: The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:41:40","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74193873-0-image-a-13_1691714432906.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Former Cal All-American football player dead at 52","link":"https://www.mercurynews.com/2023/08/10/former-cal-all-american-football-player-dead-at-52/","keywords":["College Sports","Latest Headlines","NFL","Sports","Cal Bears","Cal Football","Inside Sports","NFL Draft"],"creator":["Jon Becker"],"video_url":null,"description":"No cause of death revealed for the Indianapolis Colts' first-round draft pick in 1993.","content":"Sean Dawkins, a former All-American wide receiver at Cal who played nine seasons in the NFL, has died. Dawkins, who gained national attention while starring at Homestead High of Cupertino, was 52. A Cal Athletics spokesman on Thursday confirmed Dawkins’ death. No details about Dawkins’ death were available. Dawkins was a speedy, 6-foot-4 receiver who was a major offensive force on some of Cal’s best teams in decades while setting a pair of school records. In 1990, he helped the Bears win their first bowl game in more than 50 years with a Copper Bowl victory over Wyoming. Dawkins became an All-American after his junior season in which he caught 65 passes for 1,070 yards and 14 touchdowns for the Bears. The 14 touchdowns remain a single-season Cal record and his 31 career TD catches are also a record. After declaring for the NFL draft, Dawkins was selected 16th overall in the 1993 draft by the Indianapolis Colts. He spent five seasons with the Colts, where he compiled most of his NFL career numbers of 445 catches for 6,291 yards and 25 touchdowns. Dawkins also played for the Saints, Seahawks and Jaguars in a career that lasted until 2001. Dawkins’ best statistical season was in 1999, when he caught 58 passes for 992 yards and seven touchdowns to help Seattle win the AFC West. “Rest in peace, Sean Dawkins,” Colts owner Jim Irsay tweeted Thursday. “I am shocked and saddened. My prayers and condolences to Sean’s family.”","pubDate":"2023-08-11 00:35:13","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/08/SJM-DAWKINS-0811.jpg?w=1400px&strip=all","source_id":"mercurynews","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down","link":"https://www.dailymail.co.uk/sport/football/article-12395177/Chris-Suttons-Premier-League-predictions-Manchester-City-retain-title-Chelsea-miss-four-three-newly-promoted-sides-down.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"We asked Chris Sutton to try and answer the big questions for the coming season, so enjoy his definitive predictions, packed with key details and big opinions on all 20 clubs.","content":"Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down Chris Sutton predicts his final Premier League table for the 2023/24 season He's got Man City down as title winners and Chelsea as top four flops - again Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full By Chris Sutton For The Daily Mail Published: 20:10 EDT, 10 August 2023 | Updated: 20:21 EDT, 10 August 2023 e-mail View comments The Premier League is back - and we at Mail Sport couldn't be more excited. At 8pm on Friday night, two title winners will open the new campaign as last season's Championship winners, Burnley , host Treble heroes Manchester City . Over the summer we've seen Saudi Arabian clubs pluck some of the game's finest talent from our top clubs. Gone is Riyad Mahrez. Goodbye Jordan Henderson. So long, N'Golo Kante, and thanks for the memories. We've also seen some of the world's hottest talent land on English shores: Josko Gvardiol to Manchester City, Jurrien Timber to Arsenal , Christopher Nkunku to Chelsea ... only to suffer a long-term injury. Ouch. There are still so many questions to answer. Will Brighton be able to follow up their feats of last year now they're in Europe? Can Mauricio Pochettino inspire Chelsea back into title contention? And how will minnows Luton fare in their maiden Premier League voyage? We asked Chris Sutton to try and provide the answers, so enjoy his definitive predictions for the upcoming season, packed with key details and big opinions on all 20 clubs. Chris Sutton has given his predictions for the Premier League season ahead ARSENAL WHO'S IN CHARGE? Mikel Arteta - after spending 248 days on top of the Premier League last season, Arteta has upgraded his squad over the summer, with Kai Havertz and Co, in the hope of leading the way again. KEY PLAYER Martin Odegaard - Bukayo Saka is a wizard on the right and Gabriel Martinelli is direct on the left, but Odegaard, wearing the captain’s armband, stitches everything together in between. Martin Odegaard, wearing the captain’s armband, stitches everything together for Arsenal SUTTON'S VERDICT Arsenal fans may want to blast me out of their cannon for this, but I am still not convinced your club is ready to be Premier League champions. Everybody is excited by the £105million signing of Declan Rice, and I get that he will enhance their midfield, but is it enough to overtake Manchester City? I cannot see that happening. Finishing in the top four remains Arsenal’s top priority, in my mind. They sprinted into a strong start — winning nine of their first 10 league fixtures — but they lost the marathon to a poor finish. Let’s see where Arsenal are in the table when they host City on October 7. MAJOR INS D Rice (West Ham, £105m); K Havertz (Chelsea, £65m); J Timber (Ajax, £40m) MAJOR OUTS G Xhaka (Bayer Leverkusen, £21.4m); M Turner (Nottm Forest, £10m); P Mari (Monza, £6m); A Trusty (Sheff Utd, £5m); A Maitland-Niles (released) LAST SEASON: 2nd SUTTON PREDICTS: 2nd ASTON VILLA WHO'S IN CHARGE? Unai Emery - If anyone can guide Villa through the trickiness of competing in Europe as well as domestically, it is Emery — the four-time winner of the Europa League with Sevilla and Villarreal. KEY PLAYER Emiliano Martinez - It is a good sign that Martinez stayed instead of leaving for a Champions League club. The World Cup-winning goalkeeper must think he can win trophies at Villa. World Cup-winning goalkeeper Emiliano Martinez must think he can win trophies at Villa SUTTON'S VERDICT Thursdays are suddenly very interesting for Villa. They are set for the Europa Conference League, so long as they win their two-legged play-off at the end of August, and will be dreaming of doing what West Ham did last season. But like the Hammers, I wonder how the Villans will cope with juggling the Premier League and Europe. Finishing in the top seven again will be tough but Villa have bought well. I am looking forward to seeing Moussa Diaby, their £50m lightning winger, while Villarreal’s Pau Torres and Leicester’s Youri Tielemans are smart signings. MAJOR INS M Diaby (Bayer Leverkusen, £50m); P Torres (Villarreal, £33m); Y Tielemans (Leicester, free); R Richards (West Brom, free) MAJOR OUTS M Nakamba (Luton, undisclosed); M Sanson (Nice, loan); A Young (Everton, free); Wesley (Stoke, free); J Steer (released) LAST SEASON: 7th SUTTON PREDICTS: 8th BOURNEMOUTH WHO'S IN CHARGE? Andoni Iraola - I thought Gary O’Neil’s sacking was harsh but Bournemouth have brought in an attacking replacement whose style of play was influenced from time under his old boss, Marcelo Bielsa. KEY PLAYER Dominic Solanke - Solanke has shown promise in the past but then fallen away. He was a big part of Bournemouth retaining their Premier League status and should remain their star man. Dominic Solanke was a big part of Bournemouth retaining their Premier League status and should remain their star man SUTTON'S VERDICT: I like it when a new manager arrives in the Premier League with a reputation and Andoni Iraola is known for rock ’n’ roll football. With Rayo Vallecano, he got them promoted to La Liga and then secured back-to-back top-12 finishes despite having one of the division’s smallest budgets. Bournemouth will be brave under Iraola and it will either work beautifully or fail miserably. They have quietly gone about some good business this summer, such as Alex Scott and Justin Kluivert. MAJOR INS A Scott (Bristol City, £25m); H Traore (Sassuolo, £20m); M Kerkez (AZ Alkmaar, £15.5m); R Faivre (Lyon, £12.8m); J Kluivert (Roma, £10.2m); I Radu (Inter Milan, loan) MAJOR OUTS B Pearson (Stoke, undisclosed); C Saydee (Portsmouth, undisclosed) S Dembele (Birmingham, undisclosed); R Faivre (Lorient, loan); M Travers (Stoke, loan); W Dennis (Kilmarnock, loan); J Lerma (C Palace, free); J Zemura (Udinese, free); J Stanislas (released); J Stacey (Norwich, free) LAST SEASON: 15th SUTTON PREDICTS: 13th BRENTFORD WHO'S IN CHARGE? Thomas Frank - An exceptional coach who realises the Brentford Community Stadium is a fortress but, given the circumstances, bettering last season’s ninth-placed finish will be challenging. KEY PLAYER Bryan Mbeumo - The pressure is on Mbeumo, who scored nine league goals last season, so that Brentford are in a healthy position by the time Toney comes back after Christmas. The pressure is on Bryan Mbeumo to score enough so that Brentford are in a healthy position by the time Ivan Toney comes back after Christmas SUTTON'S VERDICT How will Brentford cope without Ivan Toney? Only Erling Haaland and Harry Kane scored more than Toney’s 20 Premier League goals last season, but he is banned until January. The good news is Toney missed the last three games of 2022-23 because of that ban and they won them all — 2-0 against West Ham, 3-1 at Tottenham, 1-0 against Manchester City. Yoane Wissa, Bryan Mbeumo and Kevin Schade must step up in Toney’s absence. This is Brentford’s third season in the Premier League. They have gone from strength to strength since promotion but this will be their toughest test yet. MAJOR INS N Collins (Wolves, £23m); K Schade (Freiburg, £22m); M Flekken (Freiburg, £11m); Kim Ji-soo (Seongnam, £500k) MAJOR OUTS M Bistrup (RB Salzburg, £5m); H Dervisoglu (Galatasaray, £450k); P Jansson (Malmo, free); J Valencia (Zaglebie Sosnowiec, free); M Cox (Bristol Rovers, loan); F Stevens (Oxford Utd, loan); R Trevitt (Exeter, loan); T Fosu (released); S Ghoddos (released) LAST SEASON: 9th SUTTON PREDICTS: 10th Brighton WHO'S IN CHARGE? Roberto de Zerbi - Brighton lost Graham Potter at the start of last season and yet only got better. That was down to De Zerbi, who has been a great addition to the Premier League. KEY PLAYER: Kaoru Mitoma - They did it again! Brighton discovered yet another diamond in Mitoma, their £2.5m winger who wrote his university thesis back home on the art of dribbling. Brighton discovered yet another diamond in Kaoru Mitoma, their £2.5m winger who wrote his university thesis back home on the art of dribbling SUTTON'S VERDICT: No offence to Manchester City, but Brighton were my favourite team to watch last season. Playing in Europe without Alexis Mac Allister and Levi Colwill will be difficult and it will be interesting to see if opponents have figured out how to get the better of them. Everton refused to press high and Sean Dyche’s side won 5-1 when they visited the Amex Stadium in May. But Arsenal played into their hands by pressing high in the next game and Mikel Arteta’s team lost 3-0. De Zerbi will hope teams try to take them on. MAJOR INS J Pedro (Watford, £30m); B Verbruggen (Anderlecht, £16.3m); Igor (Fiorentina, £14.5m); J Milner (Liverpool, free); M Dahoud (Borussia Dortmund, free) MAJOR OUTS A Mac Allister (Liverpool, £35m); R Sanchez (Chelsea, £25m); M Karbownik (Hertha Berlin, £2.3m); R Khadra (Reims, £1.6m); A Connolly (Hull, £1.2m); T Richards (QPR, undisclosed); J Sarmiento (West Brom, loan); D Undav (Stuttgart, loan); A Sima (Rangers, loan); K Scherpen (Sturm Graz, loan); E Turns (L Orient, loan); C Rushworth (Swansea, loan); H Roberts (Bristol City, free) LAST SEASON: 6th SUTTON PREDICTS: 9th IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/us/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Your browser does not support iframes. BURNLEY WHO'S IN CHARGE: Vincent Kompany - Kompany tore up the Championship. The Premier League is so much more difficult for coaches to crack but I am looking forward to seeing what he can conjure up. KEY PLAYER: Josh Cullen - Kompany brought Cullen with him from Anderlecht to Burnley and he played a major role in their midfield last season. He has got another big part to play in the Premier League. Josh Cullen played a major role in midfield as Burnley won the Championship and has got another big part to play in the Premier League SUTTON'S VERDICT: Burnley were brilliant in the Championship with their expansive brand of football. Vincent Kompany showed his managerial skillset with Craig Bellamy by his side. The question is, can they play that way in the Premier League? When they faced Manchester City in the FA Cup quarter-finals last season, they lost 6-0, remember. But something tells me Kompany will insist his team stick to their attacking ways. Burnley’s start is so crucial, although they do face City first! MAJOR INS J Trafford (Man City, £19m); Z Amdouni (Basle, £16m); S Berge (Sheff Utd, £12m); J Beyer (Borussia M’gladbach, £13m); D O’Shea (West Brom, £7m); M Obafemi (Swansea, £3.5m); L Vigouroux (L Orient, free); J Bruun Larsen (Hoffenheim, free) N Redmond (Besiktas, free) MAJOR OUTS B Thomas (Coventry, £2m); W Weghorst (Hoffenheim, loan); B Peacock-Farrell (Aarhus, loan); A Barnes (Norwich, free); M Lowton (released) LAST SEASON: 1st in the Championship SUTTON PREDICTS: 18th Chelsea WHO'S IN CHARGE? Mauricio Pochettino - Pochettino galvanised the group at Tottenham but even this motivational manager may struggle to piece together a broken Chelsea. At least he will try to deliver attractive football. KEY PLAYER Enzo Fernandez - Chelsea need Fernandez to show his value. There will be huge pressure on him to be the £106.8m midfielder he is, having shown signs of his passing range after joining from Benfica in January. Chelsea need Fernandez to show his value. There will be huge pressure on him to be the £106.8m midfielder he is SUTTON'S VERDICT It did not work out well for the last forward that Chelsea signed called Chris! Now the club have spent £53m on Christopher Nkunku... and he needs knee surgery. For all their expenditure, Chelsea finished 12th last season. When Chelsea finished 10th in 2015-16, Antonio Conte made them champions in 2016-17. I like Mauricio Pochettino but cannot see him doing that. With N’Golo Kante, Mason Mount and more gone, they are scrapping for fourth. MAJOR INS C Nkunku (RB Leipzig, £53m); A Disasi (Monaco, £38m); N Jackson (Villarreal, £32m), R Sanchez (Brighton, £25m); L Ugochukwu (Rennes, £23.8m) MAJOR OUTS K Havertz (Arsenal, £65m); M Mount (Man Utd, £55m); M Kovacic (Man City, £30m); K Koulibaly (Al Hilal, £20m); C Pulisic (AC Milan, £18.8m); R Loftus-Cheek (AC Milan, £18.5m); E Mendy (Al Ahli, £16m); E Ampadu (Leeds, £7m); N Kante (Al Ittihad, free); C Azpilicueta (Atletico Madrid, free); P-E Aubameyang (Marseille, free); B Rahman (PAOK, loan) LAST SEASON: 12th SUTTON PREDICTS: 5th CRYSTAL PALACE WHO'S IN CHARGE? Roy Hodgson - Happy birthday to my old boss! Hodgson turned 76 on the eve of this season and the Premier League’s oldest manager simply cannot escape the itch to be in the dugout. KEY PLAYER Michael Olise - Chelsea have been linked with the 21-year-old over the summer — with rumours of a £35m release clause — but he is surely worth far more than that to Palace. Chelsea are linked with Michael Olise but he is worth more than his £35m release clause SUTTON'S VERDICT Palace have lost Wilfried Zaha to Galatasaray, so for the first time in almost a decade they have to make do without their go-to guy. But Hodgson has stayed after extending his contract by another season. We know how Palace will play under Hodgson. They will be resilient and reliant on Michael Olise and Eberechi Eze stepping up to show their individual brilliance. Olise, 21, and Eze, 25, were outstanding last term but I do think Palace will feel the loss of Zaha. I am predicting they will survive but they may spend some of this season too close to the relegation zone for comfort. MAJOR INS M Franca (Flamengo £17.2m); J Lerma (Bournemouth, free) MAJOR OUTS J Butland (Rangers, free); J McArthur (released); L Milivojevic (Al Ahli UAE, free); W Zaha (Galatasaray, free); L Plange (Carlisle, loan); J McArthur (retired) LAST SEASON: 11th SUTTON PREDICTS: 16th EVERTON WHO'S IN CHARGE? Sean Dyche - Dyche took over from Frank Lampard in January last season and though they cut it close, his organisational skills helped Everton survive. Now for his first full season in the hot seat. KEY PLAYER Dominic Calvert-Lewin - Calvert-Lewin is the key. In the last two Premier League seasons, he’s made 17 appearances apiece. If he can play 30-plus games this term, Everton should stay up. Dominic Calvert-Lewin is the key. In the last two Premier League seasons, he’s made 17 appearances apiece. If he can play 30-plus games this term, Everton should stay up SUTTON'S VERDICT: If Dominic Calvert-Lewin can stay fit — and that is a big if, because of his tendency to break down — then Everton should survive comfortably. Dyche will have spent the summer trying to get them organised after finishing 17th. One of his signings is Ashley Young. While a 38-year-old full back may seem a surprising addition, Dyche wanted the reliability of someone proven in the Premier League. Everton fans may have to continue to grin and bear it for now because I cannot see this club being a quick fix. The good news is that I’ve got you finishing 14th in my predictions! MAJOR INS A Young (Aston Villa, free); A Danjuma (Villarreal, loan) MAJOR OUTS E Simms (Coventry, £8m); I Samuels-Smith (Chelsea, £4m); N Nkounkou (Saint-Etienne, £1.7m); A Townsend (released); T Davies (released); Y Mina (Fiorentina, free); A Begovic (QPR, free) LAST SEASON: 17th SUTTON PREDICTS: 14th FULHAM WHO'S IN CHARGE? Marco Silva - He turned down two lucrative approaches from Saudi Arabia to leave, which was admirable. Fulham must be thrilled Silva agreed to stay because he is so good at organising this team. KEY PLAYER Andreas Pereira - In other circumstances, I might have said Mitrovic. But I’m plumping for Pereira as Fulham’s main man after a seemingly swift recovery from ankle surgery at the end of last season. I’m saying Pereira as Fulham’s main man after a seemingly swift recovery from ankle surgery SUTTON'S VERICT I’d ask Fulham supporters, ‘How was your summer?’ but I suspect I know the answer. What a saga it’s been with Saudi Arabia throwing their bags of riyals at your biggest commodities — your masterful manager, your star striker and your wily winger. Marco Silva, Aleksandar Mitrovic and Willian were being lured by the Saudi riches when Fulham’s focus needed to be on the new season. Who knows what will happen between now and when the transfer window closes on September 1. It’s been a big headache which the club did not need. At least the Joao Palhinha saga didn’t last long… albeit he injured his shoulder in pre-season. MAJOR INS C Bassey (Ajax, £18.2m); R Jimenez (Wolves, £5m) MAJOR OUTS S Duffy (Nowich, free); P Gazzaniga (Girona, free); N Kebano (Al Jazira, free); J Bryan (Milwall, free); S Sessegnon (released); I Cavaleiro (Lille) LAST SEASON: 10th SUTTON PREDICTS: 11th LIVERPOOL WHO'S IN CHARGE? Jurgen Klopp - Klopp is not used to poor seasons like the one Liverpool endured last year. Sometimes his passion overspilled into abusing officials. Less of that, please, Jurgen, and more winning. KEY PLAYER Virgil van Dijk - Van Dijk wasn’t at his best last season — Liverpool conceded 47 goals, their most since 2015-16 — but Klopp needs his star defender and new captain if they want to win silverware. Van Dijk wasn’t at his best last season — Liverpool conceded 47 goals, their most since 2015-16 — but Klopp needs his star defender and new captain if they want to win silverware SUTTON'S VERDICT I suspect we will see Liverpool bounce back this season. I’m not saying they will challenge Manchester City for the title, but I cannot see them underperforming to the extent they did last year. We’ve been highlighting Liverpool’s midfield as an issue for a while and they’ve finally addressed that with Dominik Szoboszlai for £60m and Alexis Mac Allister for £35m. Trent Alexander-Arnold has been used in midfield in pre-season, too, which is intriguing. Liverpool have the tools to improve this term. MAJOR INS D Szoboszlai (RB Leipzig, £60m); A Mac Allister (Brighton, £35m) MAJOR OUTS Fabinho (Al Ittihad, £40m); J Henderson (Al Ettifaq, £12m); S Van den Berg (Mainz, loan); F Carvalho (RB Leipzig, loan); J Milner (Brighton, free); N Keita (Werder Bremen, free); R Firmino (Al Ahli, free); C Ramsay (Preston, loan); R Williams (Aberdeen, loan); A Oxlade-Chamberlain (released) LAST SEASON: 5th SUTTON PREDICTS: 4th LUTON WHO'S IN CHARGE? Rob Edwards - Luton's is a miraculous story, though Edwards knows it will take another miracle for them to survive. He will make sure they give it a good go against English football’s big boys. KEY PLAYER Carlton Morris - Luton’s top scorer last season. His was a long journey to the Premier League — via spells in League Two, League One, the Championship and Scottish Premiership — but now he’s here. Carlton Morris was Luton's top scorer last year and his journey to the top flight has been long SUTTON'S VERDICT I remember playing at Kenilworth Road in my youth. They had that dreaded plastic pitch and you would leave with third-degree burns if you dared slide on it. But I love going back to Luton and cannot wait to see them in the Premier League. I’ve spoken to a few fans and they are realistic enough. They are ready to enjoy the ride, whatever happens. Luton will try to be disruptive, bloody a few noses, nab some wins, accept a few beatings, and hope that they aren’t 20th by the end of the season. MAJOR INS R Giles (Wolves, £5m); T Chong (Birmingham, £4m); M Andersen (Barnsley, £3m); M Nakamba (Aston Villa, £2.5m); T Kaminski (Blackburn, £2.5m); J Brown (Stoke, undisclosed); C Ogbene (Rotherham, free); R Barkley (Chelsea, free); I Kabore (Man City, loan) MAJOR OUTS C Mendes (Bolton, undisclosed); S Bradley (Derby, free); H Isted (Charlton, free); J Walton (Dundee Utd, loan); F Onyedinma (Rotherham, loan); E Thorpe (Shrewsbury, loan); J Taylor (Colchester, loan); H Lansbury (released) LAST SEASON: 3rd in the Championship, promoted via play-offs SUTTON PREDICTS: 20th MANCHESTER CITY WHO'S IN CHARGE? Pep Guardiola - What tactical innovation will he spring on us next? Guardiola is the game’s greatest thinker, as evidenced by John Stones’ transformation from a defender into a midfielder last season. KEY PLAYER Erling Haaland - Who else? Anything less than 30 goals this season will be viewed as a disappointment. Defenders may as well be given a blindfold and cigarette when lining up against him. Defenders may as well be given a blindfold and cigarette when lining up against Erling Haaland SUTTON'S VERDICT My Premier League predictions say a sixth title in seven seasons is on the way for Manchester City because this is a runaway train that does not look like being derailed anytime soon. City have hardly stormed the summer’s transfer window. They didn’t need to. They’re so talented, you would not be surprised if a potential Invincibles season is being discussed by Christmas. With Erling Haaland, Kevin De Bruyne and Co, this is City’s title to lose before a ball has even been kicked and we all know it. MAJOR INS J Gvardiol (RB Leipzig, £77m); M Kovacic (Chelsea, £25m) MAJOR OUTS R Mahrez (Al Ahli, £30m); J Trafford (Burnley, £19m); S Charles (Southampton, £15m); Y Herrera (Girona, £4.3m); I Kabore (Luton, loan); J Wilson-Esbrand (Reims, loan); J McNamara (Southampton, undisclosed); I Gundogan (Barcelona, free); B Mendy (Lorient, free) LAST SEASON: 1st SUTTON PREDICTS: 1st MANCHESTER UNITED WHO'S IN CHARGE? Erik ten Hag - Ten Hag is trying to piece together a team that reflects his philosophy and that has included bringing in a goalkeeper who is much better than David de Gea at using his feet. KEY PLAYER Bruno Fernandes - Fernandes won the captain’s armband but I’m still not sure he has the right temperament for that role. Time will tell if it matures him. Fewer tantrums, more leadership, please, Bruno. Bruno Fernandes won the captain’s armband but I’m still not sure he has the right temperament for that role. Time will tell if it matures him SUTTON'S VERDICT: I cannot understand why Manchester United did not go all out for Harry Kane. If they wanted to challenge for the Premier League, they needed that ruthless finisher, that guarantor of goals, that focal point. United were the lowest scorers of last season’s top six. Bayern Munich and PSG’s sniffing around in the summer told us that Tottenham’s striker was available, albeit at a steep price. That was an opportunity missed by United, who instead snapped up Mason Mount for £55m and Andre Onana for £47.2m before trying for a striker whose name is not Kane — and has a back injury! MAJOR INS R Hojlund (Atalanta, £72m); M Mount (Chelsea, £60m); A Onana (Inter Milan, £43m); J Evans (Leicester, free) MAJOR OUTS A Elanga (Nottingham Forest, £15m); A Telles (Al Nassr, £4m); Z Iqbal (Utrecht, £800k); D De Gea (released); P Jones (released); A Tuanzebe (released) LAST SEASON: 3rd SUTTON PREDICTS: 3rd NEWCASTLE UNITED WHO'S IN CHARGE? Eddie Howe - Nice guy Eddie has worked wonders. Newcastle’s style of play was not only effective, it was entertaining, but Howe will realise expectations are rising after last year’s achievements. KEY PLAYER Bruno Guimaraes - Guimaraes was a game-changer as a signing. He rocked up looking like a Champions League player and now he is one with Newcastle. Tie him down to a new deal now! Bruno Guimaraes was a game-changer as a signing. He rocked up looking like a Champions League player and now he is one with Newcastle SUTTON'S VERDICT As well as Newcastle, Saudi Arabia’s Public Investment Fund own Al Hilal, the club that bid £259m for Kylian Mbappe. When Newcastle were taken over, we thought they would use their wealth to target superstars. But their work in the transfer market has been steady. Sandro Tonali from AC Milan is a smart signing at £52m, as is Leicester’s Harvey Barnes for £39m. Newcastle finished fourth last season. I certainly didn’t expect so much so soon. Now they’ve got Champions League nights returning to St James’ Park and it is great to see a huge club back on Europe’s grandest stage. MAJOR INS S Tonali (AC Milan, £52m); H Barnes (Leicester, £39m); T Livramento (Southampton, £30m); Y Minteh (Odense, £6.9m) MAJOR OUTS A Saint-Maximin (Al Ahli, £23.4m); C Wood (Nottm Forest, £15m), K Darlow (Leeds, £300k); J Lewis (Watford, loan); Y Minteh (Feyenoord, loan); H Ashby (Swansea, loan); G Kuol (Volendam, loan); K Watts (Wigan, loan); M Longstaff (released); C Clark (released) LAST SEASON: 4th SUTTON PREDICTS: 6th NOTTINGHAM FOREST WHO'S IN CHARGE? Steve Cooper - Forest owner Evangelos Marinakis has a reputation for being a hothead but it is to his credit that he did not pull the plug on Cooper when others might have. KEY PLAYER Morgan Gibbs-White - Eyebrows were raised when Forest paid £42.5m for him but he showed his worth towards the end of last season with his excellent displays. More of those are needed. Eyebrows were raised when Forest paid £42.5m for Gibbs-White but he showed his worth SUTTON'S VERDICT The City Ground was a fortress for Forest last season. Away, they were the division’s worst team. But at home, they gave themselves a fighting chance of staying up. Forest held their nerve in the relegation run-in, securing two home wins and two away draws to finish 16th. It will not be easy to survive a second time but if they show the same spirit as last season, I don’t see why they can’t do it again. At least Steve Cooper hasn’t got an army of new signings to try to gel this time around. MAJOR INS C Wood (Newcastle, £15m); A Elanga (Man Utd, £15m); M Turner (Arsenal, £10m): M Norkett (Man Utd, free); O Aina (Torino, free) MAJOR OUTS S Surridge (Nashville, £5m); Cafu (Rotherham, free); J Smith (Stockport, free); J Colback (QPR, free); B Ojeda (Real Salt Lake, free); R Laryea (Vancouver, loan); J Bowler (Cardiff, loan); J Lingard (released); L Taylor (released); A Kanuric (released); A Ayew (released) LAST SEASON: 16th SUTTON PREDICTS: 15th SHEFFIELD UNITED WHO'S IN CHARGE? Paul Heckingbottom - Since going from the Under 23s to the first team, Heckingbottom has been fantastic, largely trusting a 3-5-2 system which he hopes will make them defensively sound. KEY PLAYER Oli McBurnie - I would have named Iliman Ndiaye but last season’s top scorer is now a Marseille player after the newly promoted club reluctantly accepted £20m for him in the summer. Over to you, then, McBurnie! Oli McBurnie must deliver after Sheffield United sold their top scorer, Iliman Ndiaye SUTTON'S VERDICT Sheffield United bullied their way out of the Championship with an aggressive style of play and Heckingbottom deserves great credit for getting them up comfortably in the end. They will be a physical match for any Premier League team and will try to make themselves difficult to beat, particularly at Bramall Lane. Manchester City loanee James McAtee is no longer at the club, which is a loss. You don’t earn a nickname like the ‘Salford Silva’ for nothing. United stayed up the last time they were promoted. But can they do it again? I’m not so sure. MAJOR INS A Trusty (Arsenal, £5m); B Traore (Hacken, £4m); A Slimane (Brondby, £2.3m); V Souza (Lommel, undisclosed); Y Larouci (Troyes, loan) MAJOR OUTS I Ndiaye (Marseille, £20m); E Stevens (Stoke, free); J Eastwood (Grimsby, free); K Gordon (released); B Sharp (released); J O’Connell (released) LAST SEASON: 2nd in the Championship SUTTON PREDICTS: 19th TOTTENHAM WHO'S IN CHARGE? Ange Postecoglou - The Harry Kane saga was a sorry one for Postecoglou to inherit. But whoever starts up front for Tottenham, an abundance of chances will be created for him, thanks to the style of play. KEY PLAYER Son Heung-Min - With King Kane set to leave London, royal succession tells us the Son is next in line to the throne. He will need to help make up for the goals they are losing. With King Kane set to leave London, royal succession tells us the Son is next in line to the throne. He will need to help make up for the goals lost if Kane leaves SUTTON'S VERDICT With or without Harry Kane, Ange Postecoglou’s philosophy is to pepper teams. That was never going to change, whatever happened. The Kane situation will dominate narratives but in truth, Postecoglou would like his best players to be his centre backs. That’s because they need to be capable of clearing up any danger when opponents take back the ball and counter. I’m not sure if any of the Tottenham defenders Big Ange inherited meet his standards. In Scotland, when teams countered Celtic, they didn’t have the quality to hurt them. In England it will be different, so this will be interesting to watch. MAJOR INS J Maddison (Leicester, £45m); M Van de Ven (Wolfsburg, £34m); G Vicario (Empoli, £17m); A Veliz (Rosario, £13m); A Phillips (Blackburn, £2m); M Solomon (Fulham, free) MAJOR OUTS H Winks (Leicester, £10m); L Moura (Sao Paulo, free) LAST SEASON: 8th SUTTON PREDICTS: 7th WEST HAM UNITED WHO'S IN CHARGE? David Moyes - All the ‘Moyes Out’ advocates should take a look at the fantastic three years he’s given them since returning. The board’s patience was rewarded with that European triumph in Prague. KEY PLAYER Lucas Paqueta - Paqueta knows what the Premier League is about now. He is a superb playmaker, hence Man City’s interest, and I expect even better performances from him this season. Lucas Paqueta knows what the Premier League is about now. He is a superb playmaker SUTTON'S VERDICT They were the last Premier League club to make a signing, despite being linked with every midfielder who’s ever pulled on a pair of boots after selling Declan Rice for £105m. How West Ham cope without their club captain will be interesting to watch. David Moyes overachieved when he came back to the club with sixth and seventh-placed finishes. Last season was a struggle in the Premier League but they won the Europa Conference League, their first trophy since 1980. Moyes will desperately want his team to avoid another scrap for survival. The pressure on him last year was intense. MAJOR INS E Alvarez (Ajax, £34m); S Moore (Cliftonville, undisclosed) MAJOR OUTS D Rice (Arsenal, £105m); G Scamacca (Atalanta, £22m); N Vlasic (Torino, £11m); A Masuaku (Besiktas, £1.7m); M Lanzini (River Plate, free) LAST SEASON: 14th SUTTON PREDICTS: 12th WOLVES WHO'S IN CHARGE? Gary O'Neil - Julen Lopetegui was not a happy chappy in pre-season and now he has jumped a sinking ship. Wolves survived last season, but O’Neil faces one hell of a fight. KEY PLAYER Jose Sa - If Wolves endure another goal-shy season, then Sa’s ability to stop the shots flying his way will be key to them staying up. It feels like it is going to be a long old season. If Wolves endure another goal-shy season, then Sa’s ability to stop the shots flying his way will be key to them staying up SUTTON'S VERDICT The Premier League’s lowest scorers last season have lost Ruben Neves to Al Hilal. That’s the heartbeat of the team now plying his trade in Saudi Arabia. As if it could not get any worse, they then lost their manager with only three days to go until the start of the new season. Lopetegui voiced his dissatisfaction about their summer business, or lack thereof, and then departed. This is clearly a club in crisis and you have to worry about Wolves. They’ll have no Neves, no Lopetegui, no Raul Jimenez, no Joao Moutinho and so on. No hope? We’ll soon see. MAJOR INS M Cunha (A Madrid, £44m); B Traore (Metz, £9.5m); T King (Northampton Town, free); M Doherty (A Madrid, free) MAJOR OUTS R Neves (Al Hilal, £47m); N Collins (Brentford, £23m); C Coady (Leicester, £7.5m); R Jimenez (Fulham, £5m); R Giles (Luton, £5m); H Kawabe (Standard Liege, £1m); M Sarkic (Millwall, £1m); D Sanderson (Birmingham, undisclosed); D Costa (released); J Moutinho (released); L Matheson (released); A Traore (released); K-J Hoever (Stoke, loan) LAST SEASON: 13th SUTTON PREDICTS: 17th Share or comment on this article: Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:21:47","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74193461-0-image-a-14_1691712878655.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"New trophy unveiled for 2023 King Salman Club Cup","link":"https://www.arabnews.com/node/2353181/saudi-sport","keywords":null,"creator":["romulo"],"video_url":null,"description":"RIYADH: The Union of Arab Football Associations on Thursday unveiled the new trophy that will be presented this weekend to the winners of the 2023 King Salman Club Cup. The brand new trophy, specially created for the tournament, which is also known as the Arab Club Champions Cup, was revealed during a special event at Tera Mall in the western Saudi city of Taif.","content":"RIYADH: The Union of Arab Football Associations on Thursday unveiled the new trophy that will be presented this weekend to the winners of the 2023 King Salman Club Cup. The brand new trophy, specially created for the tournament, which is also known as the Arab Club Champions Cup, was revealed during a special event at Tera Mall in the western Saudi city of Taif. Made by Sports Partners International, the trophy’s design includes elements inspired by the headscarf that is one of the symbols of formal Saudi attire. It is topped by a golden soccer ball, and an inscription at the bottom includes the name of the tournament. Made from bronze-coated copper, plated with 24-carat gold, it weighs 6.1 kilograms and stands 39.5 centimeters tall. Special guests at the unveiling included tournament director Mu’eed Al-Shahri and Abdullah Al-Zayedi, the director of the Ministry of Sports in Taif. Afterwards, fans had a chance to have their photo taken with the trophy. Al-Hilal and Al-Nassr will battle it out for the trophy in the final of the competition, which kicks off at 7pm on Aug. 12 at King Fahd Stadium in Taif.","pubDate":"2023-08-11 00:10:03","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast","link":"https://www.dailymail.co.uk/sport/football/article-12388921/How-Manchester-United-legend-Roy-Keane-terrified-Mail-Sports-Ian-Ladyman-reveals-hilarious-anecdotes-new-Kicking-podcast.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Roy Keane has terrified fellow players, pundits and even journalists over the years and Mail Sport's Ian Ladyman has revealed two of his own brilliant anecdotes about the Manchester United legend.","content":"How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full Ian Ladyman revealed a couple of his Roy Keane anecdotes on preview show Manchester United legend gave him a withering look he's become known for By Will Griffee For Mailonline Published: 01:03 BST, 11 August 2023 | Updated: 01:03 BST, 11 August 2023 e-mail View comments Roy Keane has scared fellow players, pundits and even journalists over the years and Mail Sport's Ian Ladyman has revealed two of his own brilliant anecdotes about the Manchester United legend. Speaking on the first episode of the brand new It's All Kicking Off podcast, Ladyman spoke to Chris Sutton about a couple of encounters with the Irishman. One was during the 52-year-old's playing days and the other came when Keane released his tell-all autobiography just over a decade ago in 2012. Here's how the conversation went when Ladyman and Sutton discussed Keane and the varying effects his intimidating persona can have... Your browser does not support iframes. Ian Ladyman (L) and Chris Sutton talked Roy Keane on Mail Sport's It's All Kicking Off podcast Keane terrified Ladyman without doing anything whatsoever to him at an airport Ladyman: 'I will say Roy Keane is one of the few people who scared me one day, simply by ignoring me! 'I was in an airport and I think we must have been at the same game for TV and I saw him coming the other way. I wouldn't suggest Roy remembers who I am from when he was playing at United and was covering them, but he might have known my face. 'I just knew he was going to ignore me, and the hair stood up on the back of my neck because I didn't know how he was going to do it, deliberately look the other way or give me one of those kind of stares. You're a bit wary of criticising him aren't you!?' Sutton: 'No, I'm not, he's always been alright with me, when I played against him, they normally beat us, that's probably why! 'He came to Celtic for a couple of weeks when Gordon Strachan took over and I suppose the perception of him within the dressing room was of a really strong, fiery character, great player, great leader and that he was going to come in and be really vocal. 'He absolutely wasn't that. He came in, kept his head down, trained hard and was pretty quiet. I'm not saying that greatly surprised me, people have a problem with Roy Keane because he's forthright with his opinions, which isn't a bad thing. 'You know, people have always spoken about Craig Bellamy in the past and he's rubbed people up the wrong way but it's only because Keane and Bellamy had really high standards and demanded that from other people, I don't have a problem with that.' Ladyman: 'I think of all the players I've seen play in the 25 years covering the sport, Keane is probably the best I've seen. Keane remains the best player Ladyman has seen in his time covering football Mail Sport's podcast It's All Kicking Off has launched with a Premier League preview Sutton: ' On the off chance he's listening to this!' Ladyman: 'Any journalist who was covering Roy Keane in that time has a Roy Keane story, which I'm going to tell because I can, I'm essentially in charge here! 'When Keane's second book was published about 10 years ago, we all went over to Dublin for the launch, he was going through that geography teacher phase with the beard and tweed jacket and all that. 'He stood on the stage to promote the book and do a press conference and absolutely assassinated everyone he could think of, because he was there to promote the book. He assassinated Fergie, Mick McCarthy, Alf Inge Haaland, classic Keane form. And then it comes to do a little breakout session with the daily newspapers and we sat around a round table. 'Two people had to sit either side of him and I was one of them. We're talking about the book, stories, bits and pieces and I just look at him and say: \"I was quite interested to see that you admitted in the book that the first single that you ever bought was Karma Chameleon by Culture Club.\" The United legend had a fearsome reputation and carried that with him after football too Keane is seen here clashing with his own team-mate Peter Schmeichel (centre) 'He just looked at me and said: \"I was 11', he didn't take his eye off me. Then he said... \"What was yours?\" I thought \"he's got me now\", I said, \"It was, Does Your Mother Know by Abba\". 'He just said, \"Why am I not f***ing surprised\". The whole table just fell about laughing! Because he had me there, I walked right into that trap, that withering look that he gives you, that you normally get at home when you've left your socks on the floor or forgotten to open the kitchen door and the dog's peed on the lino or something like that!' That withering look has been part of Keane's weaponry from the pitch to the dugout and now television studio. The widely respected pundit has become must-see TV but no doubt a few of his colleagues will be feeling the same heat as Mail Sport's esteemed journalist did over the course of the season ahead. It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show on Thursday and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Share or comment on this article: How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:03:05","image_url":"https://i.dailymail.co.uk/1s/2023/08/10/13/74167511-0-image-a-6_1691670908346.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Raiders QB Jimmy Garoppolo sharp in practice against former 49ers teammates","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/10/raiders-qb-jimmy-garoppolo-sharp-in-practice-against-former-49ers-teammates","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn’t have been an unusual sight at practice when they […]","content":"HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn't have been an unusual sight at practice when they were San Francisco 49ers teammates. Read this article for free: Already have an account? To continue reading, please subscribe: * HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn’t have been an unusual sight at practice when they were San Francisco 49ers teammates. But they were on opposite sides Thursday with Warner at linebacker for the Niners and Garoppolo quarterbacking the starting offense for the Las Vegas Raiders as the teams met for a joint practice. “That’s my guy,” Warner said afterward. “I love Jimmy. I love seeing him succeed. He had a great practice today, so I’m looking forward to (Friday) again.” The teams have another joint practice Friday and then meet in a preseason game Sunday at Allegiant Stadium. Raiders coach Josh McDaniels didn’t rule out playing Garoppolo on Sunday, but the chances don’t appear likely. So these two practice days against the 49ers are especially important. Garoppolo played the previous 5 1/2 seasons in San Francisco before signing with the Raiders in the offseason. He didn’t have the easiest transition, a broken left foot delaying his signing by a day and then forcing him to miss organized team activities and minicamp. When training camp began, Garoppolo often didn’t look close to the quarterback who helped the 49ers reach the Super Bowl in 2019 and the NFC title game in 2021. But now he’s starting to come around, and on Thursday was especially sharp during two late-practice scrimmage drives. He went 3 for 4 on one drive while connecting with three different receivers — his solo miss a sideline pass to Davante Adams in which the receiver was just barely out of bounds. Then in a 2-minute drive, Garoppolo completed five of seven passes to three receivers, including a touchdown in double coverage to tight end Austin Hooper. “I think it’s moving in the right direction,” Garoppolo said. “I obviously started getting my feet under me, literally and figuratively.” Garoppolo said on the first play that Niners linebacker Dre Greenlaw started playfully yapping at him, calling it an enjoyable experiencing facing a group of players he called his “brothers.” That’s despite how it ended in the Bay Area. The 49ers had planned to trade Garoppolo before the 2022 season and start Trey Lance, the third overall pick in the 2021 draft whom San Francisco gave up three first-round picks to acquire. But when Garoppolo underwent offseason shoulder surgery, that eliminated outside trade interest in him, prompting the 49ers to re-sign him at a reduced deal. When Lance was injured two games into last season, Garoppolo again took over as the starter. He was having his best year, throwing 16 touchdown passes and four interceptions in 10 games, before going down with a season-ending foot injury. In February, Niners coach Kyle Shanahan said he didn’t see how Garoppolo would return to the club next season. “I think that was a simple question: Is there scenario he can be back here next year?” Shanahan said. “I gave a common-sense answer: ‘No.’ I think that was a little overblown on trying to be a shot at him or anything. We knew Jimmy wasn’t coming back on his standpoint and our standpoint, financially, and everything. But any time I’ve been asked about Jimmy and what he meant to us and how he was, I’ve never said it differently. “Jimmy was unbelievable here.” Shanahan said he didn’t get the chance to speak with Garoppolo on Thursday because the teams were on separate practice fields. “I think he’s an interesting guy because he doesn’t promote himself ever, but he could,” San Francisco running back Christian McCaffrey said of Garoppolo. “He won a lot of games. He’s obviously a great quarterback who’s been successful in the past. Always has a smile on his face, always has a great attitude and is just a really great guy to be around.” Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. Garoppolo said to not mistake his easygoing demeanor for a lack of competitiveness. “It’s in there,” Garoppolo said. “Everyone has different ways of dealing with stuff. Some people like to vocalize it and put it out there. Some people like to keep it in and just let their play do the talk. There are different ways to go about it, but that’s kind of how I’ve always been. I’m not changing.” NOTES: 49ers wide receiver and return specialist Ray-Ray McCloud will be out about eight weeks because of a broken wrist. He is expected to undergo surgery Friday. McCloud caught 14 passes for 243 yards and a touchdown last season and averaged 10.8 yards on punt returns and 23.0 on kickoff returns. … San Francisco TE George Kittle is out this week with an adductor strain. Greenlaw left early because of a hamstring injury. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-10 23:47:01","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"World Cup 2023 TV schedule: How to look at each match at present","link":"https://www.businesslend.com/sports/world-cup-2023-tv-schedule-how-to-watch-every-match-today-5/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox free of charge Sign as much as Miguel’s Delaney’s free weekly publication The quarter-finals of the Women’s World Cup are set as England proceed their preparations for Saturday’s conflict with Colombia in Sydney. After a bunch stage of shocks and [...] The post World Cup 2023 TV schedule: How to look at each match at present appeared first on BusinessLend.","content":"The quarter-finals of the Women’s World Cup are set as England proceed their preparations for Saturday’s conflict with Colombia in Sydney. After a bunch stage of shocks and surprises, the event has reached its enterprise finish with a number of huge names nonetheless standing. The Lionesses survived a scare to defeat Nigeria on penalties as Sarina Wiegman’s facet reached the final eight, however they’ve now acquired information that star ahead Lauren James is banned for 2 video games after her purple card within the final spherical, when she stamped on Michelle Alozie. The quarter-final motion resumes on Friday with a blockbuster pair of matches. First Spain will play Netherlands in an all-European conflict, earlier than Sweden face Japan, who’ve been the standout group on the World Cup to date. It’s England’s activate Saturday as they face Colombia, after co-hosts Australia play France on what is ready to be an electrical night time in Brisbane. Here is every part you might want to learn about the way to watch the Women’s World Cup. How can I watch the Women’s World Cup? For UK viewers, each sport will likely be obtainable to look at on the BBC and ITV. For the BBC, there will likely be reside protection on tv in addition to the BBC Sport web site with reside audio commentary obtainable on BBC Radio 5 Live, 5 Sports Extra and the BBC Sounds app. For ITV, reside protection will likely be obtainable on tv in addition to on-line through ITVX. Full knockout stage TV schedule Friday 11 August QF1: Spain vs Netherlands (02:00, Wellington) – ITV 1 QF2: Japan vs Sweden (08:30, Auckland) – BBC One Saturday 12 August QF3: Australia vs France (08:00, Brisbane) – ITV 1 QF4: England vs Colombia (11:30, Sydney) – ITV 1 Tuesday 15 August SF1: Winner QF1 vs Winner QF2 (09:00, Auckland) Wednesday 16 August SF2: Winner QF3 vs Winner QF4 (11:00, Sydney) Saturday 19 August third place play-off: Loser SF1 vs Loser SF2 (09:00, Brisbane) Sunday 20 August Final: Winner SF1 vs Winner SF2 (11:00, Sydney) Last-16 outcomes Saturday 5 August Match 49: Switzerland 1-5 Spain (06:00, Auckland) – BBC One Match 50: Japan 3-1 Norway (09:00, Wellington) – ITV 1 Sunday 6 August Match 51: Netherlands 2-0 South Africa (03:00, Sydney) – BBC One Match 52: Sweden 0-0 United States – Sweden win 5-4 on penalties (10:00, Melbourne) – ITV 1 Monday 7 August Match 54: England 0-0 Nigeria – England win 4-2 on penalties (08:30, Brisbane) – BBC One Match 53: Australia 2-0 Denmark (11:30, Sydney) – BBC One Tuesday 8 August Match 56: Colombia 1-0 Jamaica (09:00, Melbourne) – ITV 1 Match 55: France 4-0 Morocco (12:00, Adelaide) – BBC One Group Stage outcomes (All kick-off occasions BST ) Thursday 20 July Group A: New Zealand 1-0 Norway (08:00, Auckland) – BBC One Group B: Australia 1-0 Republic of Ireland (11:00, Sydney) – ITV 1 Friday 21 July Group B: Nigeria 0-0 Canada (03:30, Melbourne) – BBC Two Group A: Philippines 0-2 Switzerland (06:00, Dunedin) – ITV 1 Group C: Spain 3-0 Costa Rica (08:30, Wellington) – BBC Two Saturday 22 July Group E: USA 3-0 Vietnam (02:00, Auckland) – BBC One Group C: Zambia 0-5 Japan (08:00 Hamilton) – BBC Two Group D: England 1-0 Haiti (10:30, Brisbane) – ITV 1 Group D: Denmark 1-0 China (13:00, Perth) – BBC Two Sunday 23 July Group G: Sweden 2-1 South Africa (06:00, Wellington) – BBC Two Group E: Netherlands 1-0 Portugal (08:30, Dunedin) – BBC One Group F: France 0-0 Jamaica (11:00, Sydney) – ITV 1 Monday 24 July Group G: Italy 1-0 Argentina (07:00, Auckland) – ITV 1 Group H: Germany 6-0 Morocco (09:30, Melbourne) – ITV 1 Group F: Brazil 4-0 Panama (12:00, Adelaide) – ITV 1 Tuesday 25 July Group H: Colombia 2-0 Korea Republic (03:00, Sydney) – BBC 2 Group A: New Zealand 0-1 Philippines (06:30, Dunedin) – ITV 1 Group A: Switzerland 0-0 Norway (09:00, Hamilton) – ITV 1 Wednesday 26 July Group C: Japan 2-0 Costa Rica (06:00, Dunedin) – ITV 1 Group C: Spain 5-0 Zambia (08:30, Auckland) – BBC Two Group B: Canada 2-1 Republic of Ireland (13:00, Perth) – ITV 1 Thursday 27 July Group E: USA 1-1 Netherlands (02:00, Wellington) – BBC One Group E: Portugal 2-0 Vietnam (08:30, Hamilton) – ITV 1 Group B: Australia 2-3 Nigeria (11:00, Brisbane) – BBC Two Friday 28 July Group G: Argentina 2-2 South Africa (01:00, Dunedin) – ITV 1 Group D: England 1-0 Denmark (09:30, Sydney) – BBC One Group D: China 1-0 Haiti (12:00, Adelaide) – ITV 1 Saturday 29 July Group G: Sweden 5-0 Italy (08:30, Wellington) – BBC Two Group F: France 2-1 Brazil (11:00, Brisbane) – BBC One Group F: Panama 0-1 Jamaica (13:30, Perth) – ITV 4 Sunday 30 July Group H: Korea Republic 0-1 Morocco (05:30, Adelaide) – BBC Two Group A: Norway 6-0 Philippines (08:00, Auckland) – BBC iPlayer Group A: Switzerland 0-0 New Zealand (08:00, Dunedin) – BBC Two Group H: Germany 1-2 Colombia (10:30, Sydney) – ITV 1 Monday 31 July Group C: Costa Rica 1-3 Zambia (08:00, Hamilton) – ITV 4 Group C: Japan 4-0 Spain (08:00, Wellington) – ITV 1 Group B: Ireland 0-0 Nigeria (11:00, Brisbane) – BBC iPlayer Group B: Canada 0-4 Australia (11:00, Melbourne) – BBC Two Tuesday 1 August Group E: Vietnam 0-7 Netherlands (08:00, Dunedin) – ITV 4 Group E: Portugal 0-0 USA (08:00, Auckland) – ITV 1 Group D: Haiti 0-2 Denmark (12:00, Perth) – ITV 4 Group D: China 1-6 England (12:00, Adelaide) – ITV 1 Wednesday 2 August Group G: South Africa 3-2 Italy (08:00, Wellington) – BBC Two Group G: Argentina 0-2 Sweden (08:00, Hamilton) – BBC iPlayer Group F: Jamaica 0-0 Brazil (11:00, Melbourne) – ITV 1 Group F: Panama 3-6 France (11:00, Sydney) – ITV 4 Thursday 3 August Group H: Korea Republic 1-1 Germany (11:00, Brisbane) – BBC Two Group H: Morocco 1-0 Colombia (11:00, Perth) – BBC iPlayer Sydney (Stadium Australia, 83,500) Sydney (Sydney Football Stadium, 42,512) Brisbane (Lang Park, 52,263) Melbourne (Melbourne Rectangular Stadium, 30,000) Perth (Perth Rectangular Stadium, 22,225) Adelaide (Hindmarsh Stadium, 16,500) Auckland (Eden Park, 48,276) Wellington (Wellington Regional Stadium, 39,000) Dunedin (Forsyth Barr Stadium, 28,744) Hamilton (Waikato Stadium, 25,111) Harry Kane given permission to journey to Munich for medical – reviews","pubDate":"2023-08-10 23:43:25","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Bradford (Park Avenue) look able to cope with new challenge","link":"https://www.thetelegraphandargus.co.uk/sport/23711857.bradford-park-avenue-look-able-cope-new-challenge/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"BRADFORD (Park Avenue) finally get their league campaign underway this weekend and should be well placed to go up from the Northern Premier League","content":"After watching the neighbouring Bantams get going last weekend, and tenants Albion Sports start their season two weeks ago, Bradford (Park Avenue) finally get their league campaign underway this weekend. As we know, it is the first time in over a decade that Avenue have been down at this level, after a rollercoaster ride in the sixth tier. Play-off near misses and relegation great escapes have both featured in that spell, but the club’s time finally ran out at the end of April, as they slipped into the Northern Premier League Premier Division. But for years, long-serving manager Mark Bower has insisted that Avenue’s goal, first and foremost, was to stay in National League North. Avenue will have a new experience this season, having narrowly failed to survive in National League North. (Image: John Rhodes.) All of a sudden, Bradford are big fish in a new division, so a successful season suddenly looks very different. Speaking to Simon Parker last month, Bower said: “The onus now will be on us to dictate games and dominate, be the better team. “It will be tough, don’t get me wrong. There are obviously more big budgets in the Conference North but there are still a fair few in this league as well.” And reflecting on what Avenue can achieve, he said: “We have been punching above our weight for the last few years in that league. “When the luck goes against you, like it did when we had 11 or 12 players injured in one spell when we were playing every Saturday and midweek, it really did cause us problems. “We’ve kept some good players for the level. If we can keep people fit and get near to our best 11 out on the pitch every week, then we should be competing in the top half of the table. George Sykes-Kenworthy was at City only recently, and many might have expected him to move on from Avenue after their relegation. (Image: Thomas Gadd.) “Do that and you’re looking to get into the top five and hopefully back to where we’ve just come from. “We’ve definitely got a few more bodies to bring in. “We won’t have a squad full of depth. We’re going to have a core of decent quality, experienced players for that level.” Crucially for Avenue, who remember were only relegated on the final day of last term, they have retained an impressive number of players, including the likes of Luca Havern, Oli Johnson and Jamie Spencer , who have tasted relative success at the club. While many sides find themselves picked apart, or simply have players no longer wanting to stay, after going down, Bower has been rewarded for fostering a fine team spirit over the last few years, with many happy to help him try and guide the side back up. From all of Steps 1 to 6 in the Non-League system (Avenue now find themselves in Step 3), promotion has been standardised, to ensure the champions go up and the four teams below them enter the play-offs. Four also go down from Steps 1 to 3, as Avenue know all too well from last year, while some of their neighbours in and around Bradford are more fortunate, with two relegated from Step 4, only one from Step 5, and three being liable to drop from Step 6, depending on the suitability of the amateur teams primed to replace them. But for once, Avenue are surely looking at that top end of the table, rather than avoiding that dreaded trapdoor. Ultimately, a couple of moves have been made that should improve Avenue regardless. Avenue owner Gareth Roberts wrote off £1.8m of the club’s £2.1m debt in June , turning that into equity/shares, meaning the financial constraints that have held the club back for a long time should be much less severe. And in addition to their ever-growing academy, the Horsfall outfit are now moving to a hybrid structure, meaning they will finally have full-time players and coaches among their set-up as well as part-time ones. Oli Johnson is now a strength and conditioning coach at Avenue as well as a striker. (Image: John Rhodes.) That should offer a step up in the level of professionalism for the club, and allow them to dedicate the time and energy needed to some of the brightest talents in BD6. Avenue have a reputation for notoriously sluggish starts to league seasons, and that is one drawback of this league, the unpredictable nature of the teams in it, given many will be all-new to the club. Ever-growing phoenix club Macclesfield FC, Avenue’s opening day opponents, are a case in point. Having been formed just three years ago, they have won back-to-back promotions, with famous pundit and Welsh international Robbie Savage as their director of football. Who knows whether this will prove a step too far for them or whether their epic rise will continue. But after an early wobble in pre-season saw them trounced by Campion, Avenue have played well in beating the Bantams and Chorley, and pushing Blackpool all the way, since. It gives them some momentum heading into 2023/24 and with a settled squad and a sense of stability off the field, Avenue really should have no excuses other than to challenge towards the top.","pubDate":"2023-08-10 23:25:00","image_url":"https://www.thetelegraphandargus.co.uk/resources/images/17040912/?type=app&htype=0","source_id":"thetelegraphandargus","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer'","link":"https://www.dailymail.co.uk/sport/football/article-12395603/Liverpool-verge-beating-Chelsea-Moises-Caicedo-Brighton-ready-accept-110m-offer.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Caicedo, 21, had seemed destined to join Chelsea this summer but he is now slated to join Liverpool as early as Friday. The Reds are hopeful of agreeing personal terms with the Ecuadorian in the morning.","content":"Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer' Liverpool look set to beat Chelsea to the signature of Moises Caicedo Brighton have reportedly accepted Liverpool's £110m offer for Caicedo Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full By Daniel Matthews For Dailymail.Com Published: 01:36, 11 August 2023 | Updated: 02:03, 11 August 2023 e-mail View comments Liverpool are reportedly on the verge of completing a British record deal for Brighton midfielder Moises Caicedo. It's claimed Jurgen Klopp 's side have submitted a bid worth up to £110million, with The Athletic reporting Brighton have accepted the offer. Caicedo, 21, had seemed destined to join Chelsea this summer but he is now slated to join Liverpool as early as Friday. Brighton set a deadline of midnight on Thursday for final bids, and Liverpool returned with a £110m offer, while Chelsea put forward £100m. Agreeing personal terms with the player is not expected to be an issue for the Reds, and a medical is scheduled for Friday. Moises Caicedo now looks set to join Liverpool rather than Chelsea this summer IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Caicedo joining Liverpool would be a major blow for Chelsea given their lengthy pursuit of the midfielder this summer. The Blues have had multiple bids knocked back by Brighton, but had still appeared confident of getting a deal wrapped up before the transfer window closes at the start of September. They now look set to miss out on his signature to one of their closest rivals, and this setback comes just two days before they face Liverpool at Stamford Bridge in their first game of the new Premier League season. Both clubs have also shown considerable interest in Southampton's Romeo Lavia as they look to further strengthen their midfields. Liverpool have had three bids rejected by the Championship club, with their latest offer of £46m falling short of Southampton's £50m asking price. Chelsea trumped that offer with a £47m bid this week, but are yet to reach an agreement with the Saints. More to follow... Your browser does not support iframes. Share or comment on this article: Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer' e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 01:01:51","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74194131-0-image-a-9_1691714197389.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How to Watch Spain vs Netherlands, FIFA Women’s World Cup 2023 Live Streaming Online in India? Get Free Live Telecast of ESP vs NED Quarterfinal Football WC Match Score Updates on TV","link":"https://www.latestly.com/socially/sports/football/how-to-watch-spain-vs-netherlands-fifa-womens-world-cup-2023-live-streaming-online-in-india-get-free-live-telecast-of-esp-vs-ned-quarterfinal-football-wc-match-score-updates-on-tv-5332086.html","keywords":null,"creator":null,"video_url":null,"description":"Spain had a comprehensive victory against Netherlands in the last game while Netherlands are also coming out of a clinical victory. Scroll down to get live streaming and telecast details.","content":"Spain will square off against Netherlands in the Quarterfinal clash of the FIFA Women’s World Cup on August 11, 2023, Friday. The match will take place at the Wellington Regional Stadium, Wellington, New Zealand. The match begins at 6.30 AM IST (Indian Standard Time). DD Sports is the official broadcaster of the marquee tournament in India and therefore, fans can watch the knockout game on the DD Sports channel. Moreover, the Indian audience can enjoy the live streaming of the high-voltage encounter online on the FanCode app or website. Spain vs Netherlands, FIFA Women’s World Cup 2023 Live Streaming and Telecast Details The Netherlands are ready to take on Spain. 💪🇳🇱 Sherida Spitse, Esmee Brugts and Lineth Beerensteyn share their thoughts ahead of the #FIFAWWC Quarter-Final fixture. 👇 — FIFA Women's World Cup (@FIFAWWC) August 10, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-11 00:45:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires","link":"https://www.dailymail.co.uk/sport/football/article-12395501/The-promoter-Charlie-Sheen-Bill-Clinton-Princess-Mary-dubs-Sam-Kerr-female-Cristiano-Ronaldo-tips-Matildas-captain-earn-500million-retires.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"A leading Australian agent has dubbed Sam Kerr a 'female Cristiano Ronaldo' and has tipped the Matildas captain to become first female player to earn over $500million during her career","content":"The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires Matildas have reached quarter final against France Huge audiences are watching the World Cup Kerr stands to make a fortune in sponsorships and endorsements By Josh Alston For Daily Mail Australia Published: 20:41 EDT, 10 August 2023 | Updated: 20:41 EDT, 10 August 2023 e-mail 1 View comments A leading Australian agent has dubbed Sam Kerr a 'female Cristiano Ronaldo' and has tipped the Matildas captain to become the first female player to earn over $500million during her career. Celebrity and talent promoter, publicist and agent Max Markson has worked with some of the biggest names in the business, including Charlie Sheen , Bill Clinton , Tony Blair, George Bush snr, Princess Mary and Crown Prince Frederick of Denmark, Nelson Mandela, Rudy Giuliani, Shane Warne, Joe Bugner, Greg Chappell and Martina Navratilova. As Australia prepares for its Women's World Cup quarter final clash against France on Saturday, he believes Kerr has the talent and marketing appeal to become the biggest women's name in sport. He believes that businesses from a range of industries will line up to make Kerr the face of their marketing campaigns while the Chelsea striker could earn as much as $250,000 a year in speaking engagements alone. 'By the end of her career, she will end up with $500m in the bank,' Markson told CODE Sports . 'She will be a female Cristiano Ronaldo. Kerr's star is set to rise as the Matildas progress deep into the Women's World Cup in Australia and New Zealand Cristiano Ronaldo signed a contract for over $330million to play in Saudi Arabia and has a range of lucrative sponsorship and endorsements as well PR King Max Markson said that 'the world is her oyster' when it comes to the financial future of Sam Kerr following the Women's World Cup 'Sam could enter the same pay bracket as Ronaldo (estimated to be worth $500m). And Ronaldo is the biggest soccer player in the world. Sam is female – that's the magic. The world is her oyster.' It all begins on Saturday at Suncorp Stadium - re-badged Brisbane Stadium by FIFA - where the Matildas will look to make history by reaching their first World Cup semi-final with victory over France. Kerr missed the group stage matches against Republic of Ireland, Nigeria and Canada before returning from a calf injury to play limited minutes in the Matildas 2-0 round of 16 win over Denmark . She is expected to play more of a role against France and Markson said the eyes of the world were now upon her. 'The World Cup is enormous so she will get a World Cup deal. Any international or global deal with a major corporation will be worth $5m or $10m alone, at least,' he said. 'Even if Australia doesn't win, and they might, she has to be worth $25m by the time the World Cup ends, easily. And that money for Sam will increase every year, it will grow and grow and grow. 'Look at some of the corporations already doing the Olympic Games. You've got breakfast cereals, clothing companies, food, electronic companies, telephone companies, anything she wants, she will get. 'She is presentable, a great sports personality, is a performer and has another ten years of playing. Sam will keep going until she's 40 if she wants. Kerr celebrate victory with Chelsea teammates after their Women's FA Cup final victory over Arsenal in 2021 Before Kerr can start counting her money, she has a huge role to play for Australia in their quarter final showdown against France on Saturday 'I don't think she needs to be at the peak of her career to get enormous money playing overseas in places like America or Saudi Arabia. 'Sam could get a gig in America for a fortune, some serious money. Look at David Beckham. He was playing in the UK and finished up in America. If you want to go back even further, Pele went to New York. 'And she will also be able to do a speaking tour here in Australia whenever she wants.' Kerr already has lucrative sponsorships with Mastercard and Nike, the latter a deal believed to be worth around $1million. Nike also sponsors the likes of male superstars Ronaldo and Kylian Mbappe. On top of sponsorships, Kerr's $600,000 a season pricetag at Chelsea is also set to skyrocket. 'Sam is playing for Chelsea at the moment but she will get picked up by whoever she wants after this. And that will mean Chelsea have to put more money in, and believe me, Chelsea have got plenty of money,' Markson said. 'She will have global endorsement campaigns for advertising. She doesn't have to be on the pitch for those – just TV commercials and endorsements. Everyone will want her around the world.' Share or comment on this article: The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:41:40","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74193873-0-image-a-13_1691714432906.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Former Cal All-American football player dead at 52","link":"https://www.mercurynews.com/2023/08/10/former-cal-all-american-football-player-dead-at-52/","keywords":["College Sports","Latest Headlines","NFL","Sports","Cal Bears","Cal Football","Inside Sports","NFL Draft"],"creator":["Jon Becker"],"video_url":null,"description":"No cause of death revealed for the Indianapolis Colts' first-round draft pick in 1993.","content":"Sean Dawkins, a former All-American wide receiver at Cal who played nine seasons in the NFL, has died. Dawkins, who gained national attention while starring at Homestead High of Cupertino, was 52. A Cal Athletics spokesman on Thursday confirmed Dawkins’ death. No details about Dawkins’ death were available. Dawkins was a speedy, 6-foot-4 receiver who was a major offensive force on some of Cal’s best teams in decades while setting a pair of school records. In 1990, he helped the Bears win their first bowl game in more than 50 years with a Copper Bowl victory over Wyoming. Dawkins became an All-American after his junior season in which he caught 65 passes for 1,070 yards and 14 touchdowns for the Bears. The 14 touchdowns remain a single-season Cal record and his 31 career TD catches are also a record. After declaring for the NFL draft, Dawkins was selected 16th overall in the 1993 draft by the Indianapolis Colts. He spent five seasons with the Colts, where he compiled most of his NFL career numbers of 445 catches for 6,291 yards and 25 touchdowns. Dawkins also played for the Saints, Seahawks and Jaguars in a career that lasted until 2001. Dawkins’ best statistical season was in 1999, when he caught 58 passes for 992 yards and seven touchdowns to help Seattle win the AFC West. “Rest in peace, Sean Dawkins,” Colts owner Jim Irsay tweeted Thursday. “I am shocked and saddened. My prayers and condolences to Sean’s family.”","pubDate":"2023-08-11 00:35:13","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/08/SJM-DAWKINS-0811.jpg?w=1400px&strip=all","source_id":"mercurynews","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down","link":"https://www.dailymail.co.uk/sport/football/article-12395177/Chris-Suttons-Premier-League-predictions-Manchester-City-retain-title-Chelsea-miss-four-three-newly-promoted-sides-down.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"We asked Chris Sutton to try and answer the big questions for the coming season, so enjoy his definitive predictions, packed with key details and big opinions on all 20 clubs.","content":"Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down Chris Sutton predicts his final Premier League table for the 2023/24 season He's got Man City down as title winners and Chelsea as top four flops - again Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full By Chris Sutton For The Daily Mail Published: 20:10 EDT, 10 August 2023 | Updated: 20:21 EDT, 10 August 2023 e-mail View comments The Premier League is back - and we at Mail Sport couldn't be more excited. At 8pm on Friday night, two title winners will open the new campaign as last season's Championship winners, Burnley , host Treble heroes Manchester City . Over the summer we've seen Saudi Arabian clubs pluck some of the game's finest talent from our top clubs. Gone is Riyad Mahrez. Goodbye Jordan Henderson. So long, N'Golo Kante, and thanks for the memories. We've also seen some of the world's hottest talent land on English shores: Josko Gvardiol to Manchester City, Jurrien Timber to Arsenal , Christopher Nkunku to Chelsea ... only to suffer a long-term injury. Ouch. There are still so many questions to answer. Will Brighton be able to follow up their feats of last year now they're in Europe? Can Mauricio Pochettino inspire Chelsea back into title contention? And how will minnows Luton fare in their maiden Premier League voyage? We asked Chris Sutton to try and provide the answers, so enjoy his definitive predictions for the upcoming season, packed with key details and big opinions on all 20 clubs. Chris Sutton has given his predictions for the Premier League season ahead ARSENAL WHO'S IN CHARGE? Mikel Arteta - after spending 248 days on top of the Premier League last season, Arteta has upgraded his squad over the summer, with Kai Havertz and Co, in the hope of leading the way again. KEY PLAYER Martin Odegaard - Bukayo Saka is a wizard on the right and Gabriel Martinelli is direct on the left, but Odegaard, wearing the captain’s armband, stitches everything together in between. Martin Odegaard, wearing the captain’s armband, stitches everything together for Arsenal SUTTON'S VERDICT Arsenal fans may want to blast me out of their cannon for this, but I am still not convinced your club is ready to be Premier League champions. Everybody is excited by the £105million signing of Declan Rice, and I get that he will enhance their midfield, but is it enough to overtake Manchester City? I cannot see that happening. Finishing in the top four remains Arsenal’s top priority, in my mind. They sprinted into a strong start — winning nine of their first 10 league fixtures — but they lost the marathon to a poor finish. Let’s see where Arsenal are in the table when they host City on October 7. MAJOR INS D Rice (West Ham, £105m); K Havertz (Chelsea, £65m); J Timber (Ajax, £40m) MAJOR OUTS G Xhaka (Bayer Leverkusen, £21.4m); M Turner (Nottm Forest, £10m); P Mari (Monza, £6m); A Trusty (Sheff Utd, £5m); A Maitland-Niles (released) LAST SEASON: 2nd SUTTON PREDICTS: 2nd ASTON VILLA WHO'S IN CHARGE? Unai Emery - If anyone can guide Villa through the trickiness of competing in Europe as well as domestically, it is Emery — the four-time winner of the Europa League with Sevilla and Villarreal. KEY PLAYER Emiliano Martinez - It is a good sign that Martinez stayed instead of leaving for a Champions League club. The World Cup-winning goalkeeper must think he can win trophies at Villa. World Cup-winning goalkeeper Emiliano Martinez must think he can win trophies at Villa SUTTON'S VERDICT Thursdays are suddenly very interesting for Villa. They are set for the Europa Conference League, so long as they win their two-legged play-off at the end of August, and will be dreaming of doing what West Ham did last season. But like the Hammers, I wonder how the Villans will cope with juggling the Premier League and Europe. Finishing in the top seven again will be tough but Villa have bought well. I am looking forward to seeing Moussa Diaby, their £50m lightning winger, while Villarreal’s Pau Torres and Leicester’s Youri Tielemans are smart signings. MAJOR INS M Diaby (Bayer Leverkusen, £50m); P Torres (Villarreal, £33m); Y Tielemans (Leicester, free); R Richards (West Brom, free) MAJOR OUTS M Nakamba (Luton, undisclosed); M Sanson (Nice, loan); A Young (Everton, free); Wesley (Stoke, free); J Steer (released) LAST SEASON: 7th SUTTON PREDICTS: 8th BOURNEMOUTH WHO'S IN CHARGE? Andoni Iraola - I thought Gary O’Neil’s sacking was harsh but Bournemouth have brought in an attacking replacement whose style of play was influenced from time under his old boss, Marcelo Bielsa. KEY PLAYER Dominic Solanke - Solanke has shown promise in the past but then fallen away. He was a big part of Bournemouth retaining their Premier League status and should remain their star man. Dominic Solanke was a big part of Bournemouth retaining their Premier League status and should remain their star man SUTTON'S VERDICT: I like it when a new manager arrives in the Premier League with a reputation and Andoni Iraola is known for rock ’n’ roll football. With Rayo Vallecano, he got them promoted to La Liga and then secured back-to-back top-12 finishes despite having one of the division’s smallest budgets. Bournemouth will be brave under Iraola and it will either work beautifully or fail miserably. They have quietly gone about some good business this summer, such as Alex Scott and Justin Kluivert. MAJOR INS A Scott (Bristol City, £25m); H Traore (Sassuolo, £20m); M Kerkez (AZ Alkmaar, £15.5m); R Faivre (Lyon, £12.8m); J Kluivert (Roma, £10.2m); I Radu (Inter Milan, loan) MAJOR OUTS B Pearson (Stoke, undisclosed); C Saydee (Portsmouth, undisclosed) S Dembele (Birmingham, undisclosed); R Faivre (Lorient, loan); M Travers (Stoke, loan); W Dennis (Kilmarnock, loan); J Lerma (C Palace, free); J Zemura (Udinese, free); J Stanislas (released); J Stacey (Norwich, free) LAST SEASON: 15th SUTTON PREDICTS: 13th BRENTFORD WHO'S IN CHARGE? Thomas Frank - An exceptional coach who realises the Brentford Community Stadium is a fortress but, given the circumstances, bettering last season’s ninth-placed finish will be challenging. KEY PLAYER Bryan Mbeumo - The pressure is on Mbeumo, who scored nine league goals last season, so that Brentford are in a healthy position by the time Toney comes back after Christmas. The pressure is on Bryan Mbeumo to score enough so that Brentford are in a healthy position by the time Ivan Toney comes back after Christmas SUTTON'S VERDICT How will Brentford cope without Ivan Toney? Only Erling Haaland and Harry Kane scored more than Toney’s 20 Premier League goals last season, but he is banned until January. The good news is Toney missed the last three games of 2022-23 because of that ban and they won them all — 2-0 against West Ham, 3-1 at Tottenham, 1-0 against Manchester City. Yoane Wissa, Bryan Mbeumo and Kevin Schade must step up in Toney’s absence. This is Brentford’s third season in the Premier League. They have gone from strength to strength since promotion but this will be their toughest test yet. MAJOR INS N Collins (Wolves, £23m); K Schade (Freiburg, £22m); M Flekken (Freiburg, £11m); Kim Ji-soo (Seongnam, £500k) MAJOR OUTS M Bistrup (RB Salzburg, £5m); H Dervisoglu (Galatasaray, £450k); P Jansson (Malmo, free); J Valencia (Zaglebie Sosnowiec, free); M Cox (Bristol Rovers, loan); F Stevens (Oxford Utd, loan); R Trevitt (Exeter, loan); T Fosu (released); S Ghoddos (released) LAST SEASON: 9th SUTTON PREDICTS: 10th Brighton WHO'S IN CHARGE? Roberto de Zerbi - Brighton lost Graham Potter at the start of last season and yet only got better. That was down to De Zerbi, who has been a great addition to the Premier League. KEY PLAYER: Kaoru Mitoma - They did it again! Brighton discovered yet another diamond in Mitoma, their £2.5m winger who wrote his university thesis back home on the art of dribbling. Brighton discovered yet another diamond in Kaoru Mitoma, their £2.5m winger who wrote his university thesis back home on the art of dribbling SUTTON'S VERDICT: No offence to Manchester City, but Brighton were my favourite team to watch last season. Playing in Europe without Alexis Mac Allister and Levi Colwill will be difficult and it will be interesting to see if opponents have figured out how to get the better of them. Everton refused to press high and Sean Dyche’s side won 5-1 when they visited the Amex Stadium in May. But Arsenal played into their hands by pressing high in the next game and Mikel Arteta’s team lost 3-0. De Zerbi will hope teams try to take them on. MAJOR INS J Pedro (Watford, £30m); B Verbruggen (Anderlecht, £16.3m); Igor (Fiorentina, £14.5m); J Milner (Liverpool, free); M Dahoud (Borussia Dortmund, free) MAJOR OUTS A Mac Allister (Liverpool, £35m); R Sanchez (Chelsea, £25m); M Karbownik (Hertha Berlin, £2.3m); R Khadra (Reims, £1.6m); A Connolly (Hull, £1.2m); T Richards (QPR, undisclosed); J Sarmiento (West Brom, loan); D Undav (Stuttgart, loan); A Sima (Rangers, loan); K Scherpen (Sturm Graz, loan); E Turns (L Orient, loan); C Rushworth (Swansea, loan); H Roberts (Bristol City, free) LAST SEASON: 6th SUTTON PREDICTS: 9th IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/us/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Your browser does not support iframes. BURNLEY WHO'S IN CHARGE: Vincent Kompany - Kompany tore up the Championship. The Premier League is so much more difficult for coaches to crack but I am looking forward to seeing what he can conjure up. KEY PLAYER: Josh Cullen - Kompany brought Cullen with him from Anderlecht to Burnley and he played a major role in their midfield last season. He has got another big part to play in the Premier League. Josh Cullen played a major role in midfield as Burnley won the Championship and has got another big part to play in the Premier League SUTTON'S VERDICT: Burnley were brilliant in the Championship with their expansive brand of football. Vincent Kompany showed his managerial skillset with Craig Bellamy by his side. The question is, can they play that way in the Premier League? When they faced Manchester City in the FA Cup quarter-finals last season, they lost 6-0, remember. But something tells me Kompany will insist his team stick to their attacking ways. Burnley’s start is so crucial, although they do face City first! MAJOR INS J Trafford (Man City, £19m); Z Amdouni (Basle, £16m); S Berge (Sheff Utd, £12m); J Beyer (Borussia M’gladbach, £13m); D O’Shea (West Brom, £7m); M Obafemi (Swansea, £3.5m); L Vigouroux (L Orient, free); J Bruun Larsen (Hoffenheim, free) N Redmond (Besiktas, free) MAJOR OUTS B Thomas (Coventry, £2m); W Weghorst (Hoffenheim, loan); B Peacock-Farrell (Aarhus, loan); A Barnes (Norwich, free); M Lowton (released) LAST SEASON: 1st in the Championship SUTTON PREDICTS: 18th Chelsea WHO'S IN CHARGE? Mauricio Pochettino - Pochettino galvanised the group at Tottenham but even this motivational manager may struggle to piece together a broken Chelsea. At least he will try to deliver attractive football. KEY PLAYER Enzo Fernandez - Chelsea need Fernandez to show his value. There will be huge pressure on him to be the £106.8m midfielder he is, having shown signs of his passing range after joining from Benfica in January. Chelsea need Fernandez to show his value. There will be huge pressure on him to be the £106.8m midfielder he is SUTTON'S VERDICT It did not work out well for the last forward that Chelsea signed called Chris! Now the club have spent £53m on Christopher Nkunku... and he needs knee surgery. For all their expenditure, Chelsea finished 12th last season. When Chelsea finished 10th in 2015-16, Antonio Conte made them champions in 2016-17. I like Mauricio Pochettino but cannot see him doing that. With N’Golo Kante, Mason Mount and more gone, they are scrapping for fourth. MAJOR INS C Nkunku (RB Leipzig, £53m); A Disasi (Monaco, £38m); N Jackson (Villarreal, £32m), R Sanchez (Brighton, £25m); L Ugochukwu (Rennes, £23.8m) MAJOR OUTS K Havertz (Arsenal, £65m); M Mount (Man Utd, £55m); M Kovacic (Man City, £30m); K Koulibaly (Al Hilal, £20m); C Pulisic (AC Milan, £18.8m); R Loftus-Cheek (AC Milan, £18.5m); E Mendy (Al Ahli, £16m); E Ampadu (Leeds, £7m); N Kante (Al Ittihad, free); C Azpilicueta (Atletico Madrid, free); P-E Aubameyang (Marseille, free); B Rahman (PAOK, loan) LAST SEASON: 12th SUTTON PREDICTS: 5th CRYSTAL PALACE WHO'S IN CHARGE? Roy Hodgson - Happy birthday to my old boss! Hodgson turned 76 on the eve of this season and the Premier League’s oldest manager simply cannot escape the itch to be in the dugout. KEY PLAYER Michael Olise - Chelsea have been linked with the 21-year-old over the summer — with rumours of a £35m release clause — but he is surely worth far more than that to Palace. Chelsea are linked with Michael Olise but he is worth more than his £35m release clause SUTTON'S VERDICT Palace have lost Wilfried Zaha to Galatasaray, so for the first time in almost a decade they have to make do without their go-to guy. But Hodgson has stayed after extending his contract by another season. We know how Palace will play under Hodgson. They will be resilient and reliant on Michael Olise and Eberechi Eze stepping up to show their individual brilliance. Olise, 21, and Eze, 25, were outstanding last term but I do think Palace will feel the loss of Zaha. I am predicting they will survive but they may spend some of this season too close to the relegation zone for comfort. MAJOR INS M Franca (Flamengo £17.2m); J Lerma (Bournemouth, free) MAJOR OUTS J Butland (Rangers, free); J McArthur (released); L Milivojevic (Al Ahli UAE, free); W Zaha (Galatasaray, free); L Plange (Carlisle, loan); J McArthur (retired) LAST SEASON: 11th SUTTON PREDICTS: 16th EVERTON WHO'S IN CHARGE? Sean Dyche - Dyche took over from Frank Lampard in January last season and though they cut it close, his organisational skills helped Everton survive. Now for his first full season in the hot seat. KEY PLAYER Dominic Calvert-Lewin - Calvert-Lewin is the key. In the last two Premier League seasons, he’s made 17 appearances apiece. If he can play 30-plus games this term, Everton should stay up. Dominic Calvert-Lewin is the key. In the last two Premier League seasons, he’s made 17 appearances apiece. If he can play 30-plus games this term, Everton should stay up SUTTON'S VERDICT: If Dominic Calvert-Lewin can stay fit — and that is a big if, because of his tendency to break down — then Everton should survive comfortably. Dyche will have spent the summer trying to get them organised after finishing 17th. One of his signings is Ashley Young. While a 38-year-old full back may seem a surprising addition, Dyche wanted the reliability of someone proven in the Premier League. Everton fans may have to continue to grin and bear it for now because I cannot see this club being a quick fix. The good news is that I’ve got you finishing 14th in my predictions! MAJOR INS A Young (Aston Villa, free); A Danjuma (Villarreal, loan) MAJOR OUTS E Simms (Coventry, £8m); I Samuels-Smith (Chelsea, £4m); N Nkounkou (Saint-Etienne, £1.7m); A Townsend (released); T Davies (released); Y Mina (Fiorentina, free); A Begovic (QPR, free) LAST SEASON: 17th SUTTON PREDICTS: 14th FULHAM WHO'S IN CHARGE? Marco Silva - He turned down two lucrative approaches from Saudi Arabia to leave, which was admirable. Fulham must be thrilled Silva agreed to stay because he is so good at organising this team. KEY PLAYER Andreas Pereira - In other circumstances, I might have said Mitrovic. But I’m plumping for Pereira as Fulham’s main man after a seemingly swift recovery from ankle surgery at the end of last season. I’m saying Pereira as Fulham’s main man after a seemingly swift recovery from ankle surgery SUTTON'S VERICT I’d ask Fulham supporters, ‘How was your summer?’ but I suspect I know the answer. What a saga it’s been with Saudi Arabia throwing their bags of riyals at your biggest commodities — your masterful manager, your star striker and your wily winger. Marco Silva, Aleksandar Mitrovic and Willian were being lured by the Saudi riches when Fulham’s focus needed to be on the new season. Who knows what will happen between now and when the transfer window closes on September 1. It’s been a big headache which the club did not need. At least the Joao Palhinha saga didn’t last long… albeit he injured his shoulder in pre-season. MAJOR INS C Bassey (Ajax, £18.2m); R Jimenez (Wolves, £5m) MAJOR OUTS S Duffy (Nowich, free); P Gazzaniga (Girona, free); N Kebano (Al Jazira, free); J Bryan (Milwall, free); S Sessegnon (released); I Cavaleiro (Lille) LAST SEASON: 10th SUTTON PREDICTS: 11th LIVERPOOL WHO'S IN CHARGE? Jurgen Klopp - Klopp is not used to poor seasons like the one Liverpool endured last year. Sometimes his passion overspilled into abusing officials. Less of that, please, Jurgen, and more winning. KEY PLAYER Virgil van Dijk - Van Dijk wasn’t at his best last season — Liverpool conceded 47 goals, their most since 2015-16 — but Klopp needs his star defender and new captain if they want to win silverware. Van Dijk wasn’t at his best last season — Liverpool conceded 47 goals, their most since 2015-16 — but Klopp needs his star defender and new captain if they want to win silverware SUTTON'S VERDICT I suspect we will see Liverpool bounce back this season. I’m not saying they will challenge Manchester City for the title, but I cannot see them underperforming to the extent they did last year. We’ve been highlighting Liverpool’s midfield as an issue for a while and they’ve finally addressed that with Dominik Szoboszlai for £60m and Alexis Mac Allister for £35m. Trent Alexander-Arnold has been used in midfield in pre-season, too, which is intriguing. Liverpool have the tools to improve this term. MAJOR INS D Szoboszlai (RB Leipzig, £60m); A Mac Allister (Brighton, £35m) MAJOR OUTS Fabinho (Al Ittihad, £40m); J Henderson (Al Ettifaq, £12m); S Van den Berg (Mainz, loan); F Carvalho (RB Leipzig, loan); J Milner (Brighton, free); N Keita (Werder Bremen, free); R Firmino (Al Ahli, free); C Ramsay (Preston, loan); R Williams (Aberdeen, loan); A Oxlade-Chamberlain (released) LAST SEASON: 5th SUTTON PREDICTS: 4th LUTON WHO'S IN CHARGE? Rob Edwards - Luton's is a miraculous story, though Edwards knows it will take another miracle for them to survive. He will make sure they give it a good go against English football’s big boys. KEY PLAYER Carlton Morris - Luton’s top scorer last season. His was a long journey to the Premier League — via spells in League Two, League One, the Championship and Scottish Premiership — but now he’s here. Carlton Morris was Luton's top scorer last year and his journey to the top flight has been long SUTTON'S VERDICT I remember playing at Kenilworth Road in my youth. They had that dreaded plastic pitch and you would leave with third-degree burns if you dared slide on it. But I love going back to Luton and cannot wait to see them in the Premier League. I’ve spoken to a few fans and they are realistic enough. They are ready to enjoy the ride, whatever happens. Luton will try to be disruptive, bloody a few noses, nab some wins, accept a few beatings, and hope that they aren’t 20th by the end of the season. MAJOR INS R Giles (Wolves, £5m); T Chong (Birmingham, £4m); M Andersen (Barnsley, £3m); M Nakamba (Aston Villa, £2.5m); T Kaminski (Blackburn, £2.5m); J Brown (Stoke, undisclosed); C Ogbene (Rotherham, free); R Barkley (Chelsea, free); I Kabore (Man City, loan) MAJOR OUTS C Mendes (Bolton, undisclosed); S Bradley (Derby, free); H Isted (Charlton, free); J Walton (Dundee Utd, loan); F Onyedinma (Rotherham, loan); E Thorpe (Shrewsbury, loan); J Taylor (Colchester, loan); H Lansbury (released) LAST SEASON: 3rd in the Championship, promoted via play-offs SUTTON PREDICTS: 20th MANCHESTER CITY WHO'S IN CHARGE? Pep Guardiola - What tactical innovation will he spring on us next? Guardiola is the game’s greatest thinker, as evidenced by John Stones’ transformation from a defender into a midfielder last season. KEY PLAYER Erling Haaland - Who else? Anything less than 30 goals this season will be viewed as a disappointment. Defenders may as well be given a blindfold and cigarette when lining up against him. Defenders may as well be given a blindfold and cigarette when lining up against Erling Haaland SUTTON'S VERDICT My Premier League predictions say a sixth title in seven seasons is on the way for Manchester City because this is a runaway train that does not look like being derailed anytime soon. City have hardly stormed the summer’s transfer window. They didn’t need to. They’re so talented, you would not be surprised if a potential Invincibles season is being discussed by Christmas. With Erling Haaland, Kevin De Bruyne and Co, this is City’s title to lose before a ball has even been kicked and we all know it. MAJOR INS J Gvardiol (RB Leipzig, £77m); M Kovacic (Chelsea, £25m) MAJOR OUTS R Mahrez (Al Ahli, £30m); J Trafford (Burnley, £19m); S Charles (Southampton, £15m); Y Herrera (Girona, £4.3m); I Kabore (Luton, loan); J Wilson-Esbrand (Reims, loan); J McNamara (Southampton, undisclosed); I Gundogan (Barcelona, free); B Mendy (Lorient, free) LAST SEASON: 1st SUTTON PREDICTS: 1st MANCHESTER UNITED WHO'S IN CHARGE? Erik ten Hag - Ten Hag is trying to piece together a team that reflects his philosophy and that has included bringing in a goalkeeper who is much better than David de Gea at using his feet. KEY PLAYER Bruno Fernandes - Fernandes won the captain’s armband but I’m still not sure he has the right temperament for that role. Time will tell if it matures him. Fewer tantrums, more leadership, please, Bruno. Bruno Fernandes won the captain’s armband but I’m still not sure he has the right temperament for that role. Time will tell if it matures him SUTTON'S VERDICT: I cannot understand why Manchester United did not go all out for Harry Kane. If they wanted to challenge for the Premier League, they needed that ruthless finisher, that guarantor of goals, that focal point. United were the lowest scorers of last season’s top six. Bayern Munich and PSG’s sniffing around in the summer told us that Tottenham’s striker was available, albeit at a steep price. That was an opportunity missed by United, who instead snapped up Mason Mount for £55m and Andre Onana for £47.2m before trying for a striker whose name is not Kane — and has a back injury! MAJOR INS R Hojlund (Atalanta, £72m); M Mount (Chelsea, £60m); A Onana (Inter Milan, £43m); J Evans (Leicester, free) MAJOR OUTS A Elanga (Nottingham Forest, £15m); A Telles (Al Nassr, £4m); Z Iqbal (Utrecht, £800k); D De Gea (released); P Jones (released); A Tuanzebe (released) LAST SEASON: 3rd SUTTON PREDICTS: 3rd NEWCASTLE UNITED WHO'S IN CHARGE? Eddie Howe - Nice guy Eddie has worked wonders. Newcastle’s style of play was not only effective, it was entertaining, but Howe will realise expectations are rising after last year’s achievements. KEY PLAYER Bruno Guimaraes - Guimaraes was a game-changer as a signing. He rocked up looking like a Champions League player and now he is one with Newcastle. Tie him down to a new deal now! Bruno Guimaraes was a game-changer as a signing. He rocked up looking like a Champions League player and now he is one with Newcastle SUTTON'S VERDICT As well as Newcastle, Saudi Arabia’s Public Investment Fund own Al Hilal, the club that bid £259m for Kylian Mbappe. When Newcastle were taken over, we thought they would use their wealth to target superstars. But their work in the transfer market has been steady. Sandro Tonali from AC Milan is a smart signing at £52m, as is Leicester’s Harvey Barnes for £39m. Newcastle finished fourth last season. I certainly didn’t expect so much so soon. Now they’ve got Champions League nights returning to St James’ Park and it is great to see a huge club back on Europe’s grandest stage. MAJOR INS S Tonali (AC Milan, £52m); H Barnes (Leicester, £39m); T Livramento (Southampton, £30m); Y Minteh (Odense, £6.9m) MAJOR OUTS A Saint-Maximin (Al Ahli, £23.4m); C Wood (Nottm Forest, £15m), K Darlow (Leeds, £300k); J Lewis (Watford, loan); Y Minteh (Feyenoord, loan); H Ashby (Swansea, loan); G Kuol (Volendam, loan); K Watts (Wigan, loan); M Longstaff (released); C Clark (released) LAST SEASON: 4th SUTTON PREDICTS: 6th NOTTINGHAM FOREST WHO'S IN CHARGE? Steve Cooper - Forest owner Evangelos Marinakis has a reputation for being a hothead but it is to his credit that he did not pull the plug on Cooper when others might have. KEY PLAYER Morgan Gibbs-White - Eyebrows were raised when Forest paid £42.5m for him but he showed his worth towards the end of last season with his excellent displays. More of those are needed. Eyebrows were raised when Forest paid £42.5m for Gibbs-White but he showed his worth SUTTON'S VERDICT The City Ground was a fortress for Forest last season. Away, they were the division’s worst team. But at home, they gave themselves a fighting chance of staying up. Forest held their nerve in the relegation run-in, securing two home wins and two away draws to finish 16th. It will not be easy to survive a second time but if they show the same spirit as last season, I don’t see why they can’t do it again. At least Steve Cooper hasn’t got an army of new signings to try to gel this time around. MAJOR INS C Wood (Newcastle, £15m); A Elanga (Man Utd, £15m); M Turner (Arsenal, £10m): M Norkett (Man Utd, free); O Aina (Torino, free) MAJOR OUTS S Surridge (Nashville, £5m); Cafu (Rotherham, free); J Smith (Stockport, free); J Colback (QPR, free); B Ojeda (Real Salt Lake, free); R Laryea (Vancouver, loan); J Bowler (Cardiff, loan); J Lingard (released); L Taylor (released); A Kanuric (released); A Ayew (released) LAST SEASON: 16th SUTTON PREDICTS: 15th SHEFFIELD UNITED WHO'S IN CHARGE? Paul Heckingbottom - Since going from the Under 23s to the first team, Heckingbottom has been fantastic, largely trusting a 3-5-2 system which he hopes will make them defensively sound. KEY PLAYER Oli McBurnie - I would have named Iliman Ndiaye but last season’s top scorer is now a Marseille player after the newly promoted club reluctantly accepted £20m for him in the summer. Over to you, then, McBurnie! Oli McBurnie must deliver after Sheffield United sold their top scorer, Iliman Ndiaye SUTTON'S VERDICT Sheffield United bullied their way out of the Championship with an aggressive style of play and Heckingbottom deserves great credit for getting them up comfortably in the end. They will be a physical match for any Premier League team and will try to make themselves difficult to beat, particularly at Bramall Lane. Manchester City loanee James McAtee is no longer at the club, which is a loss. You don’t earn a nickname like the ‘Salford Silva’ for nothing. United stayed up the last time they were promoted. But can they do it again? I’m not so sure. MAJOR INS A Trusty (Arsenal, £5m); B Traore (Hacken, £4m); A Slimane (Brondby, £2.3m); V Souza (Lommel, undisclosed); Y Larouci (Troyes, loan) MAJOR OUTS I Ndiaye (Marseille, £20m); E Stevens (Stoke, free); J Eastwood (Grimsby, free); K Gordon (released); B Sharp (released); J O’Connell (released) LAST SEASON: 2nd in the Championship SUTTON PREDICTS: 19th TOTTENHAM WHO'S IN CHARGE? Ange Postecoglou - The Harry Kane saga was a sorry one for Postecoglou to inherit. But whoever starts up front for Tottenham, an abundance of chances will be created for him, thanks to the style of play. KEY PLAYER Son Heung-Min - With King Kane set to leave London, royal succession tells us the Son is next in line to the throne. He will need to help make up for the goals they are losing. With King Kane set to leave London, royal succession tells us the Son is next in line to the throne. He will need to help make up for the goals lost if Kane leaves SUTTON'S VERDICT With or without Harry Kane, Ange Postecoglou’s philosophy is to pepper teams. That was never going to change, whatever happened. The Kane situation will dominate narratives but in truth, Postecoglou would like his best players to be his centre backs. That’s because they need to be capable of clearing up any danger when opponents take back the ball and counter. I’m not sure if any of the Tottenham defenders Big Ange inherited meet his standards. In Scotland, when teams countered Celtic, they didn’t have the quality to hurt them. In England it will be different, so this will be interesting to watch. MAJOR INS J Maddison (Leicester, £45m); M Van de Ven (Wolfsburg, £34m); G Vicario (Empoli, £17m); A Veliz (Rosario, £13m); A Phillips (Blackburn, £2m); M Solomon (Fulham, free) MAJOR OUTS H Winks (Leicester, £10m); L Moura (Sao Paulo, free) LAST SEASON: 8th SUTTON PREDICTS: 7th WEST HAM UNITED WHO'S IN CHARGE? David Moyes - All the ‘Moyes Out’ advocates should take a look at the fantastic three years he’s given them since returning. The board’s patience was rewarded with that European triumph in Prague. KEY PLAYER Lucas Paqueta - Paqueta knows what the Premier League is about now. He is a superb playmaker, hence Man City’s interest, and I expect even better performances from him this season. Lucas Paqueta knows what the Premier League is about now. He is a superb playmaker SUTTON'S VERDICT They were the last Premier League club to make a signing, despite being linked with every midfielder who’s ever pulled on a pair of boots after selling Declan Rice for £105m. How West Ham cope without their club captain will be interesting to watch. David Moyes overachieved when he came back to the club with sixth and seventh-placed finishes. Last season was a struggle in the Premier League but they won the Europa Conference League, their first trophy since 1980. Moyes will desperately want his team to avoid another scrap for survival. The pressure on him last year was intense. MAJOR INS E Alvarez (Ajax, £34m); S Moore (Cliftonville, undisclosed) MAJOR OUTS D Rice (Arsenal, £105m); G Scamacca (Atalanta, £22m); N Vlasic (Torino, £11m); A Masuaku (Besiktas, £1.7m); M Lanzini (River Plate, free) LAST SEASON: 14th SUTTON PREDICTS: 12th WOLVES WHO'S IN CHARGE? Gary O'Neil - Julen Lopetegui was not a happy chappy in pre-season and now he has jumped a sinking ship. Wolves survived last season, but O’Neil faces one hell of a fight. KEY PLAYER Jose Sa - If Wolves endure another goal-shy season, then Sa’s ability to stop the shots flying his way will be key to them staying up. It feels like it is going to be a long old season. If Wolves endure another goal-shy season, then Sa’s ability to stop the shots flying his way will be key to them staying up SUTTON'S VERDICT The Premier League’s lowest scorers last season have lost Ruben Neves to Al Hilal. That’s the heartbeat of the team now plying his trade in Saudi Arabia. As if it could not get any worse, they then lost their manager with only three days to go until the start of the new season. Lopetegui voiced his dissatisfaction about their summer business, or lack thereof, and then departed. This is clearly a club in crisis and you have to worry about Wolves. They’ll have no Neves, no Lopetegui, no Raul Jimenez, no Joao Moutinho and so on. No hope? We’ll soon see. MAJOR INS M Cunha (A Madrid, £44m); B Traore (Metz, £9.5m); T King (Northampton Town, free); M Doherty (A Madrid, free) MAJOR OUTS R Neves (Al Hilal, £47m); N Collins (Brentford, £23m); C Coady (Leicester, £7.5m); R Jimenez (Fulham, £5m); R Giles (Luton, £5m); H Kawabe (Standard Liege, £1m); M Sarkic (Millwall, £1m); D Sanderson (Birmingham, undisclosed); D Costa (released); J Moutinho (released); L Matheson (released); A Traore (released); K-J Hoever (Stoke, loan) LAST SEASON: 13th SUTTON PREDICTS: 17th Share or comment on this article: Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:21:47","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74193461-0-image-a-14_1691712878655.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"New trophy unveiled for 2023 King Salman Club Cup","link":"https://www.arabnews.com/node/2353181/saudi-sport","keywords":null,"creator":["romulo"],"video_url":null,"description":"RIYADH: The Union of Arab Football Associations on Thursday unveiled the new trophy that will be presented this weekend to the winners of the 2023 King Salman Club Cup. The brand new trophy, specially created for the tournament, which is also known as the Arab Club Champions Cup, was revealed during a special event at Tera Mall in the western Saudi city of Taif.","content":"RIYADH: The Union of Arab Football Associations on Thursday unveiled the new trophy that will be presented this weekend to the winners of the 2023 King Salman Club Cup. The brand new trophy, specially created for the tournament, which is also known as the Arab Club Champions Cup, was revealed during a special event at Tera Mall in the western Saudi city of Taif. Made by Sports Partners International, the trophy’s design includes elements inspired by the headscarf that is one of the symbols of formal Saudi attire. It is topped by a golden soccer ball, and an inscription at the bottom includes the name of the tournament. Made from bronze-coated copper, plated with 24-carat gold, it weighs 6.1 kilograms and stands 39.5 centimeters tall. Special guests at the unveiling included tournament director Mu’eed Al-Shahri and Abdullah Al-Zayedi, the director of the Ministry of Sports in Taif. Afterwards, fans had a chance to have their photo taken with the trophy. Al-Hilal and Al-Nassr will battle it out for the trophy in the final of the competition, which kicks off at 7pm on Aug. 12 at King Fahd Stadium in Taif.","pubDate":"2023-08-11 00:10:03","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast","link":"https://www.dailymail.co.uk/sport/football/article-12388921/How-Manchester-United-legend-Roy-Keane-terrified-Mail-Sports-Ian-Ladyman-reveals-hilarious-anecdotes-new-Kicking-podcast.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Roy Keane has terrified fellow players, pundits and even journalists over the years and Mail Sport's Ian Ladyman has revealed two of his own brilliant anecdotes about the Manchester United legend.","content":"How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full Ian Ladyman revealed a couple of his Roy Keane anecdotes on preview show Manchester United legend gave him a withering look he's become known for By Will Griffee For Mailonline Published: 01:03 BST, 11 August 2023 | Updated: 01:03 BST, 11 August 2023 e-mail View comments Roy Keane has scared fellow players, pundits and even journalists over the years and Mail Sport's Ian Ladyman has revealed two of his own brilliant anecdotes about the Manchester United legend. Speaking on the first episode of the brand new It's All Kicking Off podcast, Ladyman spoke to Chris Sutton about a couple of encounters with the Irishman. One was during the 52-year-old's playing days and the other came when Keane released his tell-all autobiography just over a decade ago in 2012. Here's how the conversation went when Ladyman and Sutton discussed Keane and the varying effects his intimidating persona can have... Your browser does not support iframes. Ian Ladyman (L) and Chris Sutton talked Roy Keane on Mail Sport's It's All Kicking Off podcast Keane terrified Ladyman without doing anything whatsoever to him at an airport Ladyman: 'I will say Roy Keane is one of the few people who scared me one day, simply by ignoring me! 'I was in an airport and I think we must have been at the same game for TV and I saw him coming the other way. I wouldn't suggest Roy remembers who I am from when he was playing at United and was covering them, but he might have known my face. 'I just knew he was going to ignore me, and the hair stood up on the back of my neck because I didn't know how he was going to do it, deliberately look the other way or give me one of those kind of stares. You're a bit wary of criticising him aren't you!?' Sutton: 'No, I'm not, he's always been alright with me, when I played against him, they normally beat us, that's probably why! 'He came to Celtic for a couple of weeks when Gordon Strachan took over and I suppose the perception of him within the dressing room was of a really strong, fiery character, great player, great leader and that he was going to come in and be really vocal. 'He absolutely wasn't that. He came in, kept his head down, trained hard and was pretty quiet. I'm not saying that greatly surprised me, people have a problem with Roy Keane because he's forthright with his opinions, which isn't a bad thing. 'You know, people have always spoken about Craig Bellamy in the past and he's rubbed people up the wrong way but it's only because Keane and Bellamy had really high standards and demanded that from other people, I don't have a problem with that.' Ladyman: 'I think of all the players I've seen play in the 25 years covering the sport, Keane is probably the best I've seen. Keane remains the best player Ladyman has seen in his time covering football Mail Sport's podcast It's All Kicking Off has launched with a Premier League preview Sutton: ' On the off chance he's listening to this!' Ladyman: 'Any journalist who was covering Roy Keane in that time has a Roy Keane story, which I'm going to tell because I can, I'm essentially in charge here! 'When Keane's second book was published about 10 years ago, we all went over to Dublin for the launch, he was going through that geography teacher phase with the beard and tweed jacket and all that. 'He stood on the stage to promote the book and do a press conference and absolutely assassinated everyone he could think of, because he was there to promote the book. He assassinated Fergie, Mick McCarthy, Alf Inge Haaland, classic Keane form. And then it comes to do a little breakout session with the daily newspapers and we sat around a round table. 'Two people had to sit either side of him and I was one of them. We're talking about the book, stories, bits and pieces and I just look at him and say: \"I was quite interested to see that you admitted in the book that the first single that you ever bought was Karma Chameleon by Culture Club.\" The United legend had a fearsome reputation and carried that with him after football too Keane is seen here clashing with his own team-mate Peter Schmeichel (centre) 'He just looked at me and said: \"I was 11', he didn't take his eye off me. Then he said... \"What was yours?\" I thought \"he's got me now\", I said, \"It was, Does Your Mother Know by Abba\". 'He just said, \"Why am I not f***ing surprised\". The whole table just fell about laughing! Because he had me there, I walked right into that trap, that withering look that he gives you, that you normally get at home when you've left your socks on the floor or forgotten to open the kitchen door and the dog's peed on the lino or something like that!' That withering look has been part of Keane's weaponry from the pitch to the dugout and now television studio. The widely respected pundit has become must-see TV but no doubt a few of his colleagues will be feeling the same heat as Mail Sport's esteemed journalist did over the course of the season ahead. It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show on Thursday and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Share or comment on this article: How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:03:05","image_url":"https://i.dailymail.co.uk/1s/2023/08/10/13/74167511-0-image-a-6_1691670908346.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Raiders QB Jimmy Garoppolo sharp in practice against former 49ers teammates","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/10/raiders-qb-jimmy-garoppolo-sharp-in-practice-against-former-49ers-teammates","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn’t have been an unusual sight at practice when they […]","content":"HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn't have been an unusual sight at practice when they were San Francisco 49ers teammates. Read this article for free: Already have an account? To continue reading, please subscribe: * HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn’t have been an unusual sight at practice when they were San Francisco 49ers teammates. But they were on opposite sides Thursday with Warner at linebacker for the Niners and Garoppolo quarterbacking the starting offense for the Las Vegas Raiders as the teams met for a joint practice. “That’s my guy,” Warner said afterward. “I love Jimmy. I love seeing him succeed. He had a great practice today, so I’m looking forward to (Friday) again.” The teams have another joint practice Friday and then meet in a preseason game Sunday at Allegiant Stadium. Raiders coach Josh McDaniels didn’t rule out playing Garoppolo on Sunday, but the chances don’t appear likely. So these two practice days against the 49ers are especially important. Garoppolo played the previous 5 1/2 seasons in San Francisco before signing with the Raiders in the offseason. He didn’t have the easiest transition, a broken left foot delaying his signing by a day and then forcing him to miss organized team activities and minicamp. When training camp began, Garoppolo often didn’t look close to the quarterback who helped the 49ers reach the Super Bowl in 2019 and the NFC title game in 2021. But now he’s starting to come around, and on Thursday was especially sharp during two late-practice scrimmage drives. He went 3 for 4 on one drive while connecting with three different receivers — his solo miss a sideline pass to Davante Adams in which the receiver was just barely out of bounds. Then in a 2-minute drive, Garoppolo completed five of seven passes to three receivers, including a touchdown in double coverage to tight end Austin Hooper. “I think it’s moving in the right direction,” Garoppolo said. “I obviously started getting my feet under me, literally and figuratively.” Garoppolo said on the first play that Niners linebacker Dre Greenlaw started playfully yapping at him, calling it an enjoyable experiencing facing a group of players he called his “brothers.” That’s despite how it ended in the Bay Area. The 49ers had planned to trade Garoppolo before the 2022 season and start Trey Lance, the third overall pick in the 2021 draft whom San Francisco gave up three first-round picks to acquire. But when Garoppolo underwent offseason shoulder surgery, that eliminated outside trade interest in him, prompting the 49ers to re-sign him at a reduced deal. When Lance was injured two games into last season, Garoppolo again took over as the starter. He was having his best year, throwing 16 touchdown passes and four interceptions in 10 games, before going down with a season-ending foot injury. In February, Niners coach Kyle Shanahan said he didn’t see how Garoppolo would return to the club next season. “I think that was a simple question: Is there scenario he can be back here next year?” Shanahan said. “I gave a common-sense answer: ‘No.’ I think that was a little overblown on trying to be a shot at him or anything. We knew Jimmy wasn’t coming back on his standpoint and our standpoint, financially, and everything. But any time I’ve been asked about Jimmy and what he meant to us and how he was, I’ve never said it differently. “Jimmy was unbelievable here.” Shanahan said he didn’t get the chance to speak with Garoppolo on Thursday because the teams were on separate practice fields. “I think he’s an interesting guy because he doesn’t promote himself ever, but he could,” San Francisco running back Christian McCaffrey said of Garoppolo. “He won a lot of games. He’s obviously a great quarterback who’s been successful in the past. Always has a smile on his face, always has a great attitude and is just a really great guy to be around.” Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. Garoppolo said to not mistake his easygoing demeanor for a lack of competitiveness. “It’s in there,” Garoppolo said. “Everyone has different ways of dealing with stuff. Some people like to vocalize it and put it out there. Some people like to keep it in and just let their play do the talk. There are different ways to go about it, but that’s kind of how I’ve always been. I’m not changing.” NOTES: 49ers wide receiver and return specialist Ray-Ray McCloud will be out about eight weeks because of a broken wrist. He is expected to undergo surgery Friday. McCloud caught 14 passes for 243 yards and a touchdown last season and averaged 10.8 yards on punt returns and 23.0 on kickoff returns. … San Francisco TE George Kittle is out this week with an adductor strain. Greenlaw left early because of a hamstring injury. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-10 23:47:01","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"World Cup 2023 TV schedule: How to look at each match at present","link":"https://www.businesslend.com/sports/world-cup-2023-tv-schedule-how-to-watch-every-match-today-5/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox free of charge Sign as much as Miguel’s Delaney’s free weekly publication The quarter-finals of the Women’s World Cup are set as England proceed their preparations for Saturday’s conflict with Colombia in Sydney. After a bunch stage of shocks and [...] The post World Cup 2023 TV schedule: How to look at each match at present appeared first on BusinessLend.","content":"The quarter-finals of the Women’s World Cup are set as England proceed their preparations for Saturday’s conflict with Colombia in Sydney. After a bunch stage of shocks and surprises, the event has reached its enterprise finish with a number of huge names nonetheless standing. The Lionesses survived a scare to defeat Nigeria on penalties as Sarina Wiegman’s facet reached the final eight, however they’ve now acquired information that star ahead Lauren James is banned for 2 video games after her purple card within the final spherical, when she stamped on Michelle Alozie. The quarter-final motion resumes on Friday with a blockbuster pair of matches. First Spain will play Netherlands in an all-European conflict, earlier than Sweden face Japan, who’ve been the standout group on the World Cup to date. It’s England’s activate Saturday as they face Colombia, after co-hosts Australia play France on what is ready to be an electrical night time in Brisbane. Here is every part you might want to learn about the way to watch the Women’s World Cup. How can I watch the Women’s World Cup? For UK viewers, each sport will likely be obtainable to look at on the BBC and ITV. For the BBC, there will likely be reside protection on tv in addition to the BBC Sport web site with reside audio commentary obtainable on BBC Radio 5 Live, 5 Sports Extra and the BBC Sounds app. For ITV, reside protection will likely be obtainable on tv in addition to on-line through ITVX. Full knockout stage TV schedule Friday 11 August QF1: Spain vs Netherlands (02:00, Wellington) – ITV 1 QF2: Japan vs Sweden (08:30, Auckland) – BBC One Saturday 12 August QF3: Australia vs France (08:00, Brisbane) – ITV 1 QF4: England vs Colombia (11:30, Sydney) – ITV 1 Tuesday 15 August SF1: Winner QF1 vs Winner QF2 (09:00, Auckland) Wednesday 16 August SF2: Winner QF3 vs Winner QF4 (11:00, Sydney) Saturday 19 August third place play-off: Loser SF1 vs Loser SF2 (09:00, Brisbane) Sunday 20 August Final: Winner SF1 vs Winner SF2 (11:00, Sydney) Last-16 outcomes Saturday 5 August Match 49: Switzerland 1-5 Spain (06:00, Auckland) – BBC One Match 50: Japan 3-1 Norway (09:00, Wellington) – ITV 1 Sunday 6 August Match 51: Netherlands 2-0 South Africa (03:00, Sydney) – BBC One Match 52: Sweden 0-0 United States – Sweden win 5-4 on penalties (10:00, Melbourne) – ITV 1 Monday 7 August Match 54: England 0-0 Nigeria – England win 4-2 on penalties (08:30, Brisbane) – BBC One Match 53: Australia 2-0 Denmark (11:30, Sydney) – BBC One Tuesday 8 August Match 56: Colombia 1-0 Jamaica (09:00, Melbourne) – ITV 1 Match 55: France 4-0 Morocco (12:00, Adelaide) – BBC One Group Stage outcomes (All kick-off occasions BST ) Thursday 20 July Group A: New Zealand 1-0 Norway (08:00, Auckland) – BBC One Group B: Australia 1-0 Republic of Ireland (11:00, Sydney) – ITV 1 Friday 21 July Group B: Nigeria 0-0 Canada (03:30, Melbourne) – BBC Two Group A: Philippines 0-2 Switzerland (06:00, Dunedin) – ITV 1 Group C: Spain 3-0 Costa Rica (08:30, Wellington) – BBC Two Saturday 22 July Group E: USA 3-0 Vietnam (02:00, Auckland) – BBC One Group C: Zambia 0-5 Japan (08:00 Hamilton) – BBC Two Group D: England 1-0 Haiti (10:30, Brisbane) – ITV 1 Group D: Denmark 1-0 China (13:00, Perth) – BBC Two Sunday 23 July Group G: Sweden 2-1 South Africa (06:00, Wellington) – BBC Two Group E: Netherlands 1-0 Portugal (08:30, Dunedin) – BBC One Group F: France 0-0 Jamaica (11:00, Sydney) – ITV 1 Monday 24 July Group G: Italy 1-0 Argentina (07:00, Auckland) – ITV 1 Group H: Germany 6-0 Morocco (09:30, Melbourne) – ITV 1 Group F: Brazil 4-0 Panama (12:00, Adelaide) – ITV 1 Tuesday 25 July Group H: Colombia 2-0 Korea Republic (03:00, Sydney) – BBC 2 Group A: New Zealand 0-1 Philippines (06:30, Dunedin) – ITV 1 Group A: Switzerland 0-0 Norway (09:00, Hamilton) – ITV 1 Wednesday 26 July Group C: Japan 2-0 Costa Rica (06:00, Dunedin) – ITV 1 Group C: Spain 5-0 Zambia (08:30, Auckland) – BBC Two Group B: Canada 2-1 Republic of Ireland (13:00, Perth) – ITV 1 Thursday 27 July Group E: USA 1-1 Netherlands (02:00, Wellington) – BBC One Group E: Portugal 2-0 Vietnam (08:30, Hamilton) – ITV 1 Group B: Australia 2-3 Nigeria (11:00, Brisbane) – BBC Two Friday 28 July Group G: Argentina 2-2 South Africa (01:00, Dunedin) – ITV 1 Group D: England 1-0 Denmark (09:30, Sydney) – BBC One Group D: China 1-0 Haiti (12:00, Adelaide) – ITV 1 Saturday 29 July Group G: Sweden 5-0 Italy (08:30, Wellington) – BBC Two Group F: France 2-1 Brazil (11:00, Brisbane) – BBC One Group F: Panama 0-1 Jamaica (13:30, Perth) – ITV 4 Sunday 30 July Group H: Korea Republic 0-1 Morocco (05:30, Adelaide) – BBC Two Group A: Norway 6-0 Philippines (08:00, Auckland) – BBC iPlayer Group A: Switzerland 0-0 New Zealand (08:00, Dunedin) – BBC Two Group H: Germany 1-2 Colombia (10:30, Sydney) – ITV 1 Monday 31 July Group C: Costa Rica 1-3 Zambia (08:00, Hamilton) – ITV 4 Group C: Japan 4-0 Spain (08:00, Wellington) – ITV 1 Group B: Ireland 0-0 Nigeria (11:00, Brisbane) – BBC iPlayer Group B: Canada 0-4 Australia (11:00, Melbourne) – BBC Two Tuesday 1 August Group E: Vietnam 0-7 Netherlands (08:00, Dunedin) – ITV 4 Group E: Portugal 0-0 USA (08:00, Auckland) – ITV 1 Group D: Haiti 0-2 Denmark (12:00, Perth) – ITV 4 Group D: China 1-6 England (12:00, Adelaide) – ITV 1 Wednesday 2 August Group G: South Africa 3-2 Italy (08:00, Wellington) – BBC Two Group G: Argentina 0-2 Sweden (08:00, Hamilton) – BBC iPlayer Group F: Jamaica 0-0 Brazil (11:00, Melbourne) – ITV 1 Group F: Panama 3-6 France (11:00, Sydney) – ITV 4 Thursday 3 August Group H: Korea Republic 1-1 Germany (11:00, Brisbane) – BBC Two Group H: Morocco 1-0 Colombia (11:00, Perth) – BBC iPlayer Sydney (Stadium Australia, 83,500) Sydney (Sydney Football Stadium, 42,512) Brisbane (Lang Park, 52,263) Melbourne (Melbourne Rectangular Stadium, 30,000) Perth (Perth Rectangular Stadium, 22,225) Adelaide (Hindmarsh Stadium, 16,500) Auckland (Eden Park, 48,276) Wellington (Wellington Regional Stadium, 39,000) Dunedin (Forsyth Barr Stadium, 28,744) Hamilton (Waikato Stadium, 25,111) Harry Kane given permission to journey to Munich for medical – reviews","pubDate":"2023-08-10 23:43:25","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Bradford (Park Avenue) look able to cope with new challenge","link":"https://www.thetelegraphandargus.co.uk/sport/23711857.bradford-park-avenue-look-able-cope-new-challenge/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"BRADFORD (Park Avenue) finally get their league campaign underway this weekend and should be well placed to go up from the Northern Premier League","content":"After watching the neighbouring Bantams get going last weekend, and tenants Albion Sports start their season two weeks ago, Bradford (Park Avenue) finally get their league campaign underway this weekend. As we know, it is the first time in over a decade that Avenue have been down at this level, after a rollercoaster ride in the sixth tier. Play-off near misses and relegation great escapes have both featured in that spell, but the club’s time finally ran out at the end of April, as they slipped into the Northern Premier League Premier Division. But for years, long-serving manager Mark Bower has insisted that Avenue’s goal, first and foremost, was to stay in National League North. Avenue will have a new experience this season, having narrowly failed to survive in National League North. (Image: John Rhodes.) All of a sudden, Bradford are big fish in a new division, so a successful season suddenly looks very different. Speaking to Simon Parker last month, Bower said: “The onus now will be on us to dictate games and dominate, be the better team. “It will be tough, don’t get me wrong. There are obviously more big budgets in the Conference North but there are still a fair few in this league as well.” And reflecting on what Avenue can achieve, he said: “We have been punching above our weight for the last few years in that league. “When the luck goes against you, like it did when we had 11 or 12 players injured in one spell when we were playing every Saturday and midweek, it really did cause us problems. “We’ve kept some good players for the level. If we can keep people fit and get near to our best 11 out on the pitch every week, then we should be competing in the top half of the table. George Sykes-Kenworthy was at City only recently, and many might have expected him to move on from Avenue after their relegation. (Image: Thomas Gadd.) “Do that and you’re looking to get into the top five and hopefully back to where we’ve just come from. “We’ve definitely got a few more bodies to bring in. “We won’t have a squad full of depth. We’re going to have a core of decent quality, experienced players for that level.” Crucially for Avenue, who remember were only relegated on the final day of last term, they have retained an impressive number of players, including the likes of Luca Havern, Oli Johnson and Jamie Spencer , who have tasted relative success at the club. While many sides find themselves picked apart, or simply have players no longer wanting to stay, after going down, Bower has been rewarded for fostering a fine team spirit over the last few years, with many happy to help him try and guide the side back up. From all of Steps 1 to 6 in the Non-League system (Avenue now find themselves in Step 3), promotion has been standardised, to ensure the champions go up and the four teams below them enter the play-offs. Four also go down from Steps 1 to 3, as Avenue know all too well from last year, while some of their neighbours in and around Bradford are more fortunate, with two relegated from Step 4, only one from Step 5, and three being liable to drop from Step 6, depending on the suitability of the amateur teams primed to replace them. But for once, Avenue are surely looking at that top end of the table, rather than avoiding that dreaded trapdoor. Ultimately, a couple of moves have been made that should improve Avenue regardless. Avenue owner Gareth Roberts wrote off £1.8m of the club’s £2.1m debt in June , turning that into equity/shares, meaning the financial constraints that have held the club back for a long time should be much less severe. And in addition to their ever-growing academy, the Horsfall outfit are now moving to a hybrid structure, meaning they will finally have full-time players and coaches among their set-up as well as part-time ones. Oli Johnson is now a strength and conditioning coach at Avenue as well as a striker. (Image: John Rhodes.) That should offer a step up in the level of professionalism for the club, and allow them to dedicate the time and energy needed to some of the brightest talents in BD6. Avenue have a reputation for notoriously sluggish starts to league seasons, and that is one drawback of this league, the unpredictable nature of the teams in it, given many will be all-new to the club. Ever-growing phoenix club Macclesfield FC, Avenue’s opening day opponents, are a case in point. Having been formed just three years ago, they have won back-to-back promotions, with famous pundit and Welsh international Robbie Savage as their director of football. Who knows whether this will prove a step too far for them or whether their epic rise will continue. But after an early wobble in pre-season saw them trounced by Campion, Avenue have played well in beating the Bantams and Chorley, and pushing Blackpool all the way, since. It gives them some momentum heading into 2023/24 and with a settled squad and a sense of stability off the field, Avenue really should have no excuses other than to challenge towards the top.","pubDate":"2023-08-10 23:25:00","image_url":"https://www.thetelegraphandargus.co.uk/resources/images/17040912/?type=app&htype=0","source_id":"thetelegraphandargus","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer'","link":"https://www.dailymail.co.uk/sport/football/article-12395603/Liverpool-verge-beating-Chelsea-Moises-Caicedo-Brighton-ready-accept-110m-offer.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Caicedo, 21, had seemed destined to join Chelsea this summer but he is now slated to join Liverpool as early as Friday. The Reds are hopeful of agreeing personal terms with the Ecuadorian in the morning.","content":"Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer' Liverpool look set to beat Chelsea to the signature of Moises Caicedo Brighton have reportedly accepted Liverpool's £110m offer for Caicedo Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full By Daniel Matthews For Dailymail.Com Published: 01:36, 11 August 2023 | Updated: 02:03, 11 August 2023 e-mail View comments Liverpool are reportedly on the verge of completing a British record deal for Brighton midfielder Moises Caicedo. It's claimed Jurgen Klopp 's side have submitted a bid worth up to £110million, with The Athletic reporting Brighton have accepted the offer. Caicedo, 21, had seemed destined to join Chelsea this summer but he is now slated to join Liverpool as early as Friday. Brighton set a deadline of midnight on Thursday for final bids, and Liverpool returned with a £110m offer, while Chelsea put forward £100m. Agreeing personal terms with the player is not expected to be an issue for the Reds, and a medical is scheduled for Friday. Moises Caicedo now looks set to join Liverpool rather than Chelsea this summer IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Caicedo joining Liverpool would be a major blow for Chelsea given their lengthy pursuit of the midfielder this summer. The Blues have had multiple bids knocked back by Brighton, but had still appeared confident of getting a deal wrapped up before the transfer window closes at the start of September. They now look set to miss out on his signature to one of their closest rivals, and this setback comes just two days before they face Liverpool at Stamford Bridge in their first game of the new Premier League season. Both clubs have also shown considerable interest in Southampton's Romeo Lavia as they look to further strengthen their midfields. Liverpool have had three bids rejected by the Championship club, with their latest offer of £46m falling short of Southampton's £50m asking price. Chelsea trumped that offer with a £47m bid this week, but are yet to reach an agreement with the Saints. More to follow... Your browser does not support iframes. Share or comment on this article: Liverpool 'on the verge of beating Chelsea to Moises Caicedo... as Brighton accept British record £110m offer' e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 01:01:51","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74194131-0-image-a-9_1691714197389.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How to Watch Spain vs Netherlands, FIFA Women’s World Cup 2023 Live Streaming Online in India? Get Free Live Telecast of ESP vs NED Quarterfinal Football WC Match Score Updates on TV","link":"https://www.latestly.com/socially/sports/football/how-to-watch-spain-vs-netherlands-fifa-womens-world-cup-2023-live-streaming-online-in-india-get-free-live-telecast-of-esp-vs-ned-quarterfinal-football-wc-match-score-updates-on-tv-5332086.html","keywords":null,"creator":null,"video_url":null,"description":"Spain had a comprehensive victory against Netherlands in the last game while Netherlands are also coming out of a clinical victory. Scroll down to get live streaming and telecast details.","content":"Spain will square off against Netherlands in the Quarterfinal clash of the FIFA Women’s World Cup on August 11, 2023, Friday. The match will take place at the Wellington Regional Stadium, Wellington, New Zealand. The match begins at 6.30 AM IST (Indian Standard Time). DD Sports is the official broadcaster of the marquee tournament in India and therefore, fans can watch the knockout game on the DD Sports channel. Moreover, the Indian audience can enjoy the live streaming of the high-voltage encounter online on the FanCode app or website. Spain vs Netherlands, FIFA Women’s World Cup 2023 Live Streaming and Telecast Details The Netherlands are ready to take on Spain. 💪🇳🇱 Sherida Spitse, Esmee Brugts and Lineth Beerensteyn share their thoughts ahead of the #FIFAWWC Quarter-Final fixture. 👇 — FIFA Women's World Cup (@FIFAWWC) August 10, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-08-11 00:45:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires","link":"https://www.dailymail.co.uk/sport/football/article-12395501/The-promoter-Charlie-Sheen-Bill-Clinton-Princess-Mary-dubs-Sam-Kerr-female-Cristiano-Ronaldo-tips-Matildas-captain-earn-500million-retires.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"A leading Australian agent has dubbed Sam Kerr a 'female Cristiano Ronaldo' and has tipped the Matildas captain to become first female player to earn over $500million during her career","content":"The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires Matildas have reached quarter final against France Huge audiences are watching the World Cup Kerr stands to make a fortune in sponsorships and endorsements By Josh Alston For Daily Mail Australia Published: 20:41 EDT, 10 August 2023 | Updated: 20:41 EDT, 10 August 2023 e-mail 1 View comments A leading Australian agent has dubbed Sam Kerr a 'female Cristiano Ronaldo' and has tipped the Matildas captain to become the first female player to earn over $500million during her career. Celebrity and talent promoter, publicist and agent Max Markson has worked with some of the biggest names in the business, including Charlie Sheen , Bill Clinton , Tony Blair, George Bush snr, Princess Mary and Crown Prince Frederick of Denmark, Nelson Mandela, Rudy Giuliani, Shane Warne, Joe Bugner, Greg Chappell and Martina Navratilova. As Australia prepares for its Women's World Cup quarter final clash against France on Saturday, he believes Kerr has the talent and marketing appeal to become the biggest women's name in sport. He believes that businesses from a range of industries will line up to make Kerr the face of their marketing campaigns while the Chelsea striker could earn as much as $250,000 a year in speaking engagements alone. 'By the end of her career, she will end up with $500m in the bank,' Markson told CODE Sports . 'She will be a female Cristiano Ronaldo. Kerr's star is set to rise as the Matildas progress deep into the Women's World Cup in Australia and New Zealand Cristiano Ronaldo signed a contract for over $330million to play in Saudi Arabia and has a range of lucrative sponsorship and endorsements as well PR King Max Markson said that 'the world is her oyster' when it comes to the financial future of Sam Kerr following the Women's World Cup 'Sam could enter the same pay bracket as Ronaldo (estimated to be worth $500m). And Ronaldo is the biggest soccer player in the world. Sam is female – that's the magic. The world is her oyster.' It all begins on Saturday at Suncorp Stadium - re-badged Brisbane Stadium by FIFA - where the Matildas will look to make history by reaching their first World Cup semi-final with victory over France. Kerr missed the group stage matches against Republic of Ireland, Nigeria and Canada before returning from a calf injury to play limited minutes in the Matildas 2-0 round of 16 win over Denmark . She is expected to play more of a role against France and Markson said the eyes of the world were now upon her. 'The World Cup is enormous so she will get a World Cup deal. Any international or global deal with a major corporation will be worth $5m or $10m alone, at least,' he said. 'Even if Australia doesn't win, and they might, she has to be worth $25m by the time the World Cup ends, easily. And that money for Sam will increase every year, it will grow and grow and grow. 'Look at some of the corporations already doing the Olympic Games. You've got breakfast cereals, clothing companies, food, electronic companies, telephone companies, anything she wants, she will get. 'She is presentable, a great sports personality, is a performer and has another ten years of playing. Sam will keep going until she's 40 if she wants. Kerr celebrate victory with Chelsea teammates after their Women's FA Cup final victory over Arsenal in 2021 Before Kerr can start counting her money, she has a huge role to play for Australia in their quarter final showdown against France on Saturday 'I don't think she needs to be at the peak of her career to get enormous money playing overseas in places like America or Saudi Arabia. 'Sam could get a gig in America for a fortune, some serious money. Look at David Beckham. He was playing in the UK and finished up in America. If you want to go back even further, Pele went to New York. 'And she will also be able to do a speaking tour here in Australia whenever she wants.' Kerr already has lucrative sponsorships with Mastercard and Nike, the latter a deal believed to be worth around $1million. Nike also sponsors the likes of male superstars Ronaldo and Kylian Mbappe. On top of sponsorships, Kerr's $600,000 a season pricetag at Chelsea is also set to skyrocket. 'Sam is playing for Chelsea at the moment but she will get picked up by whoever she wants after this. And that will mean Chelsea have to put more money in, and believe me, Chelsea have got plenty of money,' Markson said. 'She will have global endorsement campaigns for advertising. She doesn't have to be on the pitch for those – just TV commercials and endorsements. Everyone will want her around the world.' Share or comment on this article: The promoter behind Charlie Sheen, Bill Clinton and Princess Mary dubs Sam Kerr 'the female Cristiano Ronaldo' and tips Matildas captain to earn $500million before she retires e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:41:40","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74193873-0-image-a-13_1691714432906.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Former Cal All-American football player dead at 52","link":"https://www.mercurynews.com/2023/08/10/former-cal-all-american-football-player-dead-at-52/","keywords":["College Sports","Latest Headlines","NFL","Sports","Cal Bears","Cal Football","Inside Sports","NFL Draft"],"creator":["Jon Becker"],"video_url":null,"description":"No cause of death revealed for the Indianapolis Colts' first-round draft pick in 1993.","content":"Sean Dawkins, a former All-American wide receiver at Cal who played nine seasons in the NFL, has died. Dawkins, who gained national attention while starring at Homestead High of Cupertino, was 52. A Cal Athletics spokesman on Thursday confirmed Dawkins’ death. No details about Dawkins’ death were available. Dawkins was a speedy, 6-foot-4 receiver who was a major offensive force on some of Cal’s best teams in decades while setting a pair of school records. In 1990, he helped the Bears win their first bowl game in more than 50 years with a Copper Bowl victory over Wyoming. Dawkins became an All-American after his junior season in which he caught 65 passes for 1,070 yards and 14 touchdowns for the Bears. The 14 touchdowns remain a single-season Cal record and his 31 career TD catches are also a record. After declaring for the NFL draft, Dawkins was selected 16th overall in the 1993 draft by the Indianapolis Colts. He spent five seasons with the Colts, where he compiled most of his NFL career numbers of 445 catches for 6,291 yards and 25 touchdowns. Dawkins also played for the Saints, Seahawks and Jaguars in a career that lasted until 2001. Dawkins’ best statistical season was in 1999, when he caught 58 passes for 992 yards and seven touchdowns to help Seattle win the AFC West. “Rest in peace, Sean Dawkins,” Colts owner Jim Irsay tweeted Thursday. “I am shocked and saddened. My prayers and condolences to Sean’s family.”","pubDate":"2023-08-11 00:35:13","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/08/SJM-DAWKINS-0811.jpg?w=1400px&strip=all","source_id":"mercurynews","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down","link":"https://www.dailymail.co.uk/sport/football/article-12395177/Chris-Suttons-Premier-League-predictions-Manchester-City-retain-title-Chelsea-miss-four-three-newly-promoted-sides-down.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"We asked Chris Sutton to try and answer the big questions for the coming season, so enjoy his definitive predictions, packed with key details and big opinions on all 20 clubs.","content":"Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down Chris Sutton predicts his final Premier League table for the 2023/24 season He's got Man City down as title winners and Chelsea as top four flops - again Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full By Chris Sutton For The Daily Mail Published: 20:10 EDT, 10 August 2023 | Updated: 20:21 EDT, 10 August 2023 e-mail View comments The Premier League is back - and we at Mail Sport couldn't be more excited. At 8pm on Friday night, two title winners will open the new campaign as last season's Championship winners, Burnley , host Treble heroes Manchester City . Over the summer we've seen Saudi Arabian clubs pluck some of the game's finest talent from our top clubs. Gone is Riyad Mahrez. Goodbye Jordan Henderson. So long, N'Golo Kante, and thanks for the memories. We've also seen some of the world's hottest talent land on English shores: Josko Gvardiol to Manchester City, Jurrien Timber to Arsenal , Christopher Nkunku to Chelsea ... only to suffer a long-term injury. Ouch. There are still so many questions to answer. Will Brighton be able to follow up their feats of last year now they're in Europe? Can Mauricio Pochettino inspire Chelsea back into title contention? And how will minnows Luton fare in their maiden Premier League voyage? We asked Chris Sutton to try and provide the answers, so enjoy his definitive predictions for the upcoming season, packed with key details and big opinions on all 20 clubs. Chris Sutton has given his predictions for the Premier League season ahead ARSENAL WHO'S IN CHARGE? Mikel Arteta - after spending 248 days on top of the Premier League last season, Arteta has upgraded his squad over the summer, with Kai Havertz and Co, in the hope of leading the way again. KEY PLAYER Martin Odegaard - Bukayo Saka is a wizard on the right and Gabriel Martinelli is direct on the left, but Odegaard, wearing the captain’s armband, stitches everything together in between. Martin Odegaard, wearing the captain’s armband, stitches everything together for Arsenal SUTTON'S VERDICT Arsenal fans may want to blast me out of their cannon for this, but I am still not convinced your club is ready to be Premier League champions. Everybody is excited by the £105million signing of Declan Rice, and I get that he will enhance their midfield, but is it enough to overtake Manchester City? I cannot see that happening. Finishing in the top four remains Arsenal’s top priority, in my mind. They sprinted into a strong start — winning nine of their first 10 league fixtures — but they lost the marathon to a poor finish. Let’s see where Arsenal are in the table when they host City on October 7. MAJOR INS D Rice (West Ham, £105m); K Havertz (Chelsea, £65m); J Timber (Ajax, £40m) MAJOR OUTS G Xhaka (Bayer Leverkusen, £21.4m); M Turner (Nottm Forest, £10m); P Mari (Monza, £6m); A Trusty (Sheff Utd, £5m); A Maitland-Niles (released) LAST SEASON: 2nd SUTTON PREDICTS: 2nd ASTON VILLA WHO'S IN CHARGE? Unai Emery - If anyone can guide Villa through the trickiness of competing in Europe as well as domestically, it is Emery — the four-time winner of the Europa League with Sevilla and Villarreal. KEY PLAYER Emiliano Martinez - It is a good sign that Martinez stayed instead of leaving for a Champions League club. The World Cup-winning goalkeeper must think he can win trophies at Villa. World Cup-winning goalkeeper Emiliano Martinez must think he can win trophies at Villa SUTTON'S VERDICT Thursdays are suddenly very interesting for Villa. They are set for the Europa Conference League, so long as they win their two-legged play-off at the end of August, and will be dreaming of doing what West Ham did last season. But like the Hammers, I wonder how the Villans will cope with juggling the Premier League and Europe. Finishing in the top seven again will be tough but Villa have bought well. I am looking forward to seeing Moussa Diaby, their £50m lightning winger, while Villarreal’s Pau Torres and Leicester’s Youri Tielemans are smart signings. MAJOR INS M Diaby (Bayer Leverkusen, £50m); P Torres (Villarreal, £33m); Y Tielemans (Leicester, free); R Richards (West Brom, free) MAJOR OUTS M Nakamba (Luton, undisclosed); M Sanson (Nice, loan); A Young (Everton, free); Wesley (Stoke, free); J Steer (released) LAST SEASON: 7th SUTTON PREDICTS: 8th BOURNEMOUTH WHO'S IN CHARGE? Andoni Iraola - I thought Gary O’Neil’s sacking was harsh but Bournemouth have brought in an attacking replacement whose style of play was influenced from time under his old boss, Marcelo Bielsa. KEY PLAYER Dominic Solanke - Solanke has shown promise in the past but then fallen away. He was a big part of Bournemouth retaining their Premier League status and should remain their star man. Dominic Solanke was a big part of Bournemouth retaining their Premier League status and should remain their star man SUTTON'S VERDICT: I like it when a new manager arrives in the Premier League with a reputation and Andoni Iraola is known for rock ’n’ roll football. With Rayo Vallecano, he got them promoted to La Liga and then secured back-to-back top-12 finishes despite having one of the division’s smallest budgets. Bournemouth will be brave under Iraola and it will either work beautifully or fail miserably. They have quietly gone about some good business this summer, such as Alex Scott and Justin Kluivert. MAJOR INS A Scott (Bristol City, £25m); H Traore (Sassuolo, £20m); M Kerkez (AZ Alkmaar, £15.5m); R Faivre (Lyon, £12.8m); J Kluivert (Roma, £10.2m); I Radu (Inter Milan, loan) MAJOR OUTS B Pearson (Stoke, undisclosed); C Saydee (Portsmouth, undisclosed) S Dembele (Birmingham, undisclosed); R Faivre (Lorient, loan); M Travers (Stoke, loan); W Dennis (Kilmarnock, loan); J Lerma (C Palace, free); J Zemura (Udinese, free); J Stanislas (released); J Stacey (Norwich, free) LAST SEASON: 15th SUTTON PREDICTS: 13th BRENTFORD WHO'S IN CHARGE? Thomas Frank - An exceptional coach who realises the Brentford Community Stadium is a fortress but, given the circumstances, bettering last season’s ninth-placed finish will be challenging. KEY PLAYER Bryan Mbeumo - The pressure is on Mbeumo, who scored nine league goals last season, so that Brentford are in a healthy position by the time Toney comes back after Christmas. The pressure is on Bryan Mbeumo to score enough so that Brentford are in a healthy position by the time Ivan Toney comes back after Christmas SUTTON'S VERDICT How will Brentford cope without Ivan Toney? Only Erling Haaland and Harry Kane scored more than Toney’s 20 Premier League goals last season, but he is banned until January. The good news is Toney missed the last three games of 2022-23 because of that ban and they won them all — 2-0 against West Ham, 3-1 at Tottenham, 1-0 against Manchester City. Yoane Wissa, Bryan Mbeumo and Kevin Schade must step up in Toney’s absence. This is Brentford’s third season in the Premier League. They have gone from strength to strength since promotion but this will be their toughest test yet. MAJOR INS N Collins (Wolves, £23m); K Schade (Freiburg, £22m); M Flekken (Freiburg, £11m); Kim Ji-soo (Seongnam, £500k) MAJOR OUTS M Bistrup (RB Salzburg, £5m); H Dervisoglu (Galatasaray, £450k); P Jansson (Malmo, free); J Valencia (Zaglebie Sosnowiec, free); M Cox (Bristol Rovers, loan); F Stevens (Oxford Utd, loan); R Trevitt (Exeter, loan); T Fosu (released); S Ghoddos (released) LAST SEASON: 9th SUTTON PREDICTS: 10th Brighton WHO'S IN CHARGE? Roberto de Zerbi - Brighton lost Graham Potter at the start of last season and yet only got better. That was down to De Zerbi, who has been a great addition to the Premier League. KEY PLAYER: Kaoru Mitoma - They did it again! Brighton discovered yet another diamond in Mitoma, their £2.5m winger who wrote his university thesis back home on the art of dribbling. Brighton discovered yet another diamond in Kaoru Mitoma, their £2.5m winger who wrote his university thesis back home on the art of dribbling SUTTON'S VERDICT: No offence to Manchester City, but Brighton were my favourite team to watch last season. Playing in Europe without Alexis Mac Allister and Levi Colwill will be difficult and it will be interesting to see if opponents have figured out how to get the better of them. Everton refused to press high and Sean Dyche’s side won 5-1 when they visited the Amex Stadium in May. But Arsenal played into their hands by pressing high in the next game and Mikel Arteta’s team lost 3-0. De Zerbi will hope teams try to take them on. MAJOR INS J Pedro (Watford, £30m); B Verbruggen (Anderlecht, £16.3m); Igor (Fiorentina, £14.5m); J Milner (Liverpool, free); M Dahoud (Borussia Dortmund, free) MAJOR OUTS A Mac Allister (Liverpool, £35m); R Sanchez (Chelsea, £25m); M Karbownik (Hertha Berlin, £2.3m); R Khadra (Reims, £1.6m); A Connolly (Hull, £1.2m); T Richards (QPR, undisclosed); J Sarmiento (West Brom, loan); D Undav (Stuttgart, loan); A Sima (Rangers, loan); K Scherpen (Sturm Graz, loan); E Turns (L Orient, loan); C Rushworth (Swansea, loan); H Roberts (Bristol City, free) LAST SEASON: 6th SUTTON PREDICTS: 9th IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/us/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Your browser does not support iframes. BURNLEY WHO'S IN CHARGE: Vincent Kompany - Kompany tore up the Championship. The Premier League is so much more difficult for coaches to crack but I am looking forward to seeing what he can conjure up. KEY PLAYER: Josh Cullen - Kompany brought Cullen with him from Anderlecht to Burnley and he played a major role in their midfield last season. He has got another big part to play in the Premier League. Josh Cullen played a major role in midfield as Burnley won the Championship and has got another big part to play in the Premier League SUTTON'S VERDICT: Burnley were brilliant in the Championship with their expansive brand of football. Vincent Kompany showed his managerial skillset with Craig Bellamy by his side. The question is, can they play that way in the Premier League? When they faced Manchester City in the FA Cup quarter-finals last season, they lost 6-0, remember. But something tells me Kompany will insist his team stick to their attacking ways. Burnley’s start is so crucial, although they do face City first! MAJOR INS J Trafford (Man City, £19m); Z Amdouni (Basle, £16m); S Berge (Sheff Utd, £12m); J Beyer (Borussia M’gladbach, £13m); D O’Shea (West Brom, £7m); M Obafemi (Swansea, £3.5m); L Vigouroux (L Orient, free); J Bruun Larsen (Hoffenheim, free) N Redmond (Besiktas, free) MAJOR OUTS B Thomas (Coventry, £2m); W Weghorst (Hoffenheim, loan); B Peacock-Farrell (Aarhus, loan); A Barnes (Norwich, free); M Lowton (released) LAST SEASON: 1st in the Championship SUTTON PREDICTS: 18th Chelsea WHO'S IN CHARGE? Mauricio Pochettino - Pochettino galvanised the group at Tottenham but even this motivational manager may struggle to piece together a broken Chelsea. At least he will try to deliver attractive football. KEY PLAYER Enzo Fernandez - Chelsea need Fernandez to show his value. There will be huge pressure on him to be the £106.8m midfielder he is, having shown signs of his passing range after joining from Benfica in January. Chelsea need Fernandez to show his value. There will be huge pressure on him to be the £106.8m midfielder he is SUTTON'S VERDICT It did not work out well for the last forward that Chelsea signed called Chris! Now the club have spent £53m on Christopher Nkunku... and he needs knee surgery. For all their expenditure, Chelsea finished 12th last season. When Chelsea finished 10th in 2015-16, Antonio Conte made them champions in 2016-17. I like Mauricio Pochettino but cannot see him doing that. With N’Golo Kante, Mason Mount and more gone, they are scrapping for fourth. MAJOR INS C Nkunku (RB Leipzig, £53m); A Disasi (Monaco, £38m); N Jackson (Villarreal, £32m), R Sanchez (Brighton, £25m); L Ugochukwu (Rennes, £23.8m) MAJOR OUTS K Havertz (Arsenal, £65m); M Mount (Man Utd, £55m); M Kovacic (Man City, £30m); K Koulibaly (Al Hilal, £20m); C Pulisic (AC Milan, £18.8m); R Loftus-Cheek (AC Milan, £18.5m); E Mendy (Al Ahli, £16m); E Ampadu (Leeds, £7m); N Kante (Al Ittihad, free); C Azpilicueta (Atletico Madrid, free); P-E Aubameyang (Marseille, free); B Rahman (PAOK, loan) LAST SEASON: 12th SUTTON PREDICTS: 5th CRYSTAL PALACE WHO'S IN CHARGE? Roy Hodgson - Happy birthday to my old boss! Hodgson turned 76 on the eve of this season and the Premier League’s oldest manager simply cannot escape the itch to be in the dugout. KEY PLAYER Michael Olise - Chelsea have been linked with the 21-year-old over the summer — with rumours of a £35m release clause — but he is surely worth far more than that to Palace. Chelsea are linked with Michael Olise but he is worth more than his £35m release clause SUTTON'S VERDICT Palace have lost Wilfried Zaha to Galatasaray, so for the first time in almost a decade they have to make do without their go-to guy. But Hodgson has stayed after extending his contract by another season. We know how Palace will play under Hodgson. They will be resilient and reliant on Michael Olise and Eberechi Eze stepping up to show their individual brilliance. Olise, 21, and Eze, 25, were outstanding last term but I do think Palace will feel the loss of Zaha. I am predicting they will survive but they may spend some of this season too close to the relegation zone for comfort. MAJOR INS M Franca (Flamengo £17.2m); J Lerma (Bournemouth, free) MAJOR OUTS J Butland (Rangers, free); J McArthur (released); L Milivojevic (Al Ahli UAE, free); W Zaha (Galatasaray, free); L Plange (Carlisle, loan); J McArthur (retired) LAST SEASON: 11th SUTTON PREDICTS: 16th EVERTON WHO'S IN CHARGE? Sean Dyche - Dyche took over from Frank Lampard in January last season and though they cut it close, his organisational skills helped Everton survive. Now for his first full season in the hot seat. KEY PLAYER Dominic Calvert-Lewin - Calvert-Lewin is the key. In the last two Premier League seasons, he’s made 17 appearances apiece. If he can play 30-plus games this term, Everton should stay up. Dominic Calvert-Lewin is the key. In the last two Premier League seasons, he’s made 17 appearances apiece. If he can play 30-plus games this term, Everton should stay up SUTTON'S VERDICT: If Dominic Calvert-Lewin can stay fit — and that is a big if, because of his tendency to break down — then Everton should survive comfortably. Dyche will have spent the summer trying to get them organised after finishing 17th. One of his signings is Ashley Young. While a 38-year-old full back may seem a surprising addition, Dyche wanted the reliability of someone proven in the Premier League. Everton fans may have to continue to grin and bear it for now because I cannot see this club being a quick fix. The good news is that I’ve got you finishing 14th in my predictions! MAJOR INS A Young (Aston Villa, free); A Danjuma (Villarreal, loan) MAJOR OUTS E Simms (Coventry, £8m); I Samuels-Smith (Chelsea, £4m); N Nkounkou (Saint-Etienne, £1.7m); A Townsend (released); T Davies (released); Y Mina (Fiorentina, free); A Begovic (QPR, free) LAST SEASON: 17th SUTTON PREDICTS: 14th FULHAM WHO'S IN CHARGE? Marco Silva - He turned down two lucrative approaches from Saudi Arabia to leave, which was admirable. Fulham must be thrilled Silva agreed to stay because he is so good at organising this team. KEY PLAYER Andreas Pereira - In other circumstances, I might have said Mitrovic. But I’m plumping for Pereira as Fulham’s main man after a seemingly swift recovery from ankle surgery at the end of last season. I’m saying Pereira as Fulham’s main man after a seemingly swift recovery from ankle surgery SUTTON'S VERICT I’d ask Fulham supporters, ‘How was your summer?’ but I suspect I know the answer. What a saga it’s been with Saudi Arabia throwing their bags of riyals at your biggest commodities — your masterful manager, your star striker and your wily winger. Marco Silva, Aleksandar Mitrovic and Willian were being lured by the Saudi riches when Fulham’s focus needed to be on the new season. Who knows what will happen between now and when the transfer window closes on September 1. It’s been a big headache which the club did not need. At least the Joao Palhinha saga didn’t last long… albeit he injured his shoulder in pre-season. MAJOR INS C Bassey (Ajax, £18.2m); R Jimenez (Wolves, £5m) MAJOR OUTS S Duffy (Nowich, free); P Gazzaniga (Girona, free); N Kebano (Al Jazira, free); J Bryan (Milwall, free); S Sessegnon (released); I Cavaleiro (Lille) LAST SEASON: 10th SUTTON PREDICTS: 11th LIVERPOOL WHO'S IN CHARGE? Jurgen Klopp - Klopp is not used to poor seasons like the one Liverpool endured last year. Sometimes his passion overspilled into abusing officials. Less of that, please, Jurgen, and more winning. KEY PLAYER Virgil van Dijk - Van Dijk wasn’t at his best last season — Liverpool conceded 47 goals, their most since 2015-16 — but Klopp needs his star defender and new captain if they want to win silverware. Van Dijk wasn’t at his best last season — Liverpool conceded 47 goals, their most since 2015-16 — but Klopp needs his star defender and new captain if they want to win silverware SUTTON'S VERDICT I suspect we will see Liverpool bounce back this season. I’m not saying they will challenge Manchester City for the title, but I cannot see them underperforming to the extent they did last year. We’ve been highlighting Liverpool’s midfield as an issue for a while and they’ve finally addressed that with Dominik Szoboszlai for £60m and Alexis Mac Allister for £35m. Trent Alexander-Arnold has been used in midfield in pre-season, too, which is intriguing. Liverpool have the tools to improve this term. MAJOR INS D Szoboszlai (RB Leipzig, £60m); A Mac Allister (Brighton, £35m) MAJOR OUTS Fabinho (Al Ittihad, £40m); J Henderson (Al Ettifaq, £12m); S Van den Berg (Mainz, loan); F Carvalho (RB Leipzig, loan); J Milner (Brighton, free); N Keita (Werder Bremen, free); R Firmino (Al Ahli, free); C Ramsay (Preston, loan); R Williams (Aberdeen, loan); A Oxlade-Chamberlain (released) LAST SEASON: 5th SUTTON PREDICTS: 4th LUTON WHO'S IN CHARGE? Rob Edwards - Luton's is a miraculous story, though Edwards knows it will take another miracle for them to survive. He will make sure they give it a good go against English football’s big boys. KEY PLAYER Carlton Morris - Luton’s top scorer last season. His was a long journey to the Premier League — via spells in League Two, League One, the Championship and Scottish Premiership — but now he’s here. Carlton Morris was Luton's top scorer last year and his journey to the top flight has been long SUTTON'S VERDICT I remember playing at Kenilworth Road in my youth. They had that dreaded plastic pitch and you would leave with third-degree burns if you dared slide on it. But I love going back to Luton and cannot wait to see them in the Premier League. I’ve spoken to a few fans and they are realistic enough. They are ready to enjoy the ride, whatever happens. Luton will try to be disruptive, bloody a few noses, nab some wins, accept a few beatings, and hope that they aren’t 20th by the end of the season. MAJOR INS R Giles (Wolves, £5m); T Chong (Birmingham, £4m); M Andersen (Barnsley, £3m); M Nakamba (Aston Villa, £2.5m); T Kaminski (Blackburn, £2.5m); J Brown (Stoke, undisclosed); C Ogbene (Rotherham, free); R Barkley (Chelsea, free); I Kabore (Man City, loan) MAJOR OUTS C Mendes (Bolton, undisclosed); S Bradley (Derby, free); H Isted (Charlton, free); J Walton (Dundee Utd, loan); F Onyedinma (Rotherham, loan); E Thorpe (Shrewsbury, loan); J Taylor (Colchester, loan); H Lansbury (released) LAST SEASON: 3rd in the Championship, promoted via play-offs SUTTON PREDICTS: 20th MANCHESTER CITY WHO'S IN CHARGE? Pep Guardiola - What tactical innovation will he spring on us next? Guardiola is the game’s greatest thinker, as evidenced by John Stones’ transformation from a defender into a midfielder last season. KEY PLAYER Erling Haaland - Who else? Anything less than 30 goals this season will be viewed as a disappointment. Defenders may as well be given a blindfold and cigarette when lining up against him. Defenders may as well be given a blindfold and cigarette when lining up against Erling Haaland SUTTON'S VERDICT My Premier League predictions say a sixth title in seven seasons is on the way for Manchester City because this is a runaway train that does not look like being derailed anytime soon. City have hardly stormed the summer’s transfer window. They didn’t need to. They’re so talented, you would not be surprised if a potential Invincibles season is being discussed by Christmas. With Erling Haaland, Kevin De Bruyne and Co, this is City’s title to lose before a ball has even been kicked and we all know it. MAJOR INS J Gvardiol (RB Leipzig, £77m); M Kovacic (Chelsea, £25m) MAJOR OUTS R Mahrez (Al Ahli, £30m); J Trafford (Burnley, £19m); S Charles (Southampton, £15m); Y Herrera (Girona, £4.3m); I Kabore (Luton, loan); J Wilson-Esbrand (Reims, loan); J McNamara (Southampton, undisclosed); I Gundogan (Barcelona, free); B Mendy (Lorient, free) LAST SEASON: 1st SUTTON PREDICTS: 1st MANCHESTER UNITED WHO'S IN CHARGE? Erik ten Hag - Ten Hag is trying to piece together a team that reflects his philosophy and that has included bringing in a goalkeeper who is much better than David de Gea at using his feet. KEY PLAYER Bruno Fernandes - Fernandes won the captain’s armband but I’m still not sure he has the right temperament for that role. Time will tell if it matures him. Fewer tantrums, more leadership, please, Bruno. Bruno Fernandes won the captain’s armband but I’m still not sure he has the right temperament for that role. Time will tell if it matures him SUTTON'S VERDICT: I cannot understand why Manchester United did not go all out for Harry Kane. If they wanted to challenge for the Premier League, they needed that ruthless finisher, that guarantor of goals, that focal point. United were the lowest scorers of last season’s top six. Bayern Munich and PSG’s sniffing around in the summer told us that Tottenham’s striker was available, albeit at a steep price. That was an opportunity missed by United, who instead snapped up Mason Mount for £55m and Andre Onana for £47.2m before trying for a striker whose name is not Kane — and has a back injury! MAJOR INS R Hojlund (Atalanta, £72m); M Mount (Chelsea, £60m); A Onana (Inter Milan, £43m); J Evans (Leicester, free) MAJOR OUTS A Elanga (Nottingham Forest, £15m); A Telles (Al Nassr, £4m); Z Iqbal (Utrecht, £800k); D De Gea (released); P Jones (released); A Tuanzebe (released) LAST SEASON: 3rd SUTTON PREDICTS: 3rd NEWCASTLE UNITED WHO'S IN CHARGE? Eddie Howe - Nice guy Eddie has worked wonders. Newcastle’s style of play was not only effective, it was entertaining, but Howe will realise expectations are rising after last year’s achievements. KEY PLAYER Bruno Guimaraes - Guimaraes was a game-changer as a signing. He rocked up looking like a Champions League player and now he is one with Newcastle. Tie him down to a new deal now! Bruno Guimaraes was a game-changer as a signing. He rocked up looking like a Champions League player and now he is one with Newcastle SUTTON'S VERDICT As well as Newcastle, Saudi Arabia’s Public Investment Fund own Al Hilal, the club that bid £259m for Kylian Mbappe. When Newcastle were taken over, we thought they would use their wealth to target superstars. But their work in the transfer market has been steady. Sandro Tonali from AC Milan is a smart signing at £52m, as is Leicester’s Harvey Barnes for £39m. Newcastle finished fourth last season. I certainly didn’t expect so much so soon. Now they’ve got Champions League nights returning to St James’ Park and it is great to see a huge club back on Europe’s grandest stage. MAJOR INS S Tonali (AC Milan, £52m); H Barnes (Leicester, £39m); T Livramento (Southampton, £30m); Y Minteh (Odense, £6.9m) MAJOR OUTS A Saint-Maximin (Al Ahli, £23.4m); C Wood (Nottm Forest, £15m), K Darlow (Leeds, £300k); J Lewis (Watford, loan); Y Minteh (Feyenoord, loan); H Ashby (Swansea, loan); G Kuol (Volendam, loan); K Watts (Wigan, loan); M Longstaff (released); C Clark (released) LAST SEASON: 4th SUTTON PREDICTS: 6th NOTTINGHAM FOREST WHO'S IN CHARGE? Steve Cooper - Forest owner Evangelos Marinakis has a reputation for being a hothead but it is to his credit that he did not pull the plug on Cooper when others might have. KEY PLAYER Morgan Gibbs-White - Eyebrows were raised when Forest paid £42.5m for him but he showed his worth towards the end of last season with his excellent displays. More of those are needed. Eyebrows were raised when Forest paid £42.5m for Gibbs-White but he showed his worth SUTTON'S VERDICT The City Ground was a fortress for Forest last season. Away, they were the division’s worst team. But at home, they gave themselves a fighting chance of staying up. Forest held their nerve in the relegation run-in, securing two home wins and two away draws to finish 16th. It will not be easy to survive a second time but if they show the same spirit as last season, I don’t see why they can’t do it again. At least Steve Cooper hasn’t got an army of new signings to try to gel this time around. MAJOR INS C Wood (Newcastle, £15m); A Elanga (Man Utd, £15m); M Turner (Arsenal, £10m): M Norkett (Man Utd, free); O Aina (Torino, free) MAJOR OUTS S Surridge (Nashville, £5m); Cafu (Rotherham, free); J Smith (Stockport, free); J Colback (QPR, free); B Ojeda (Real Salt Lake, free); R Laryea (Vancouver, loan); J Bowler (Cardiff, loan); J Lingard (released); L Taylor (released); A Kanuric (released); A Ayew (released) LAST SEASON: 16th SUTTON PREDICTS: 15th SHEFFIELD UNITED WHO'S IN CHARGE? Paul Heckingbottom - Since going from the Under 23s to the first team, Heckingbottom has been fantastic, largely trusting a 3-5-2 system which he hopes will make them defensively sound. KEY PLAYER Oli McBurnie - I would have named Iliman Ndiaye but last season’s top scorer is now a Marseille player after the newly promoted club reluctantly accepted £20m for him in the summer. Over to you, then, McBurnie! Oli McBurnie must deliver after Sheffield United sold their top scorer, Iliman Ndiaye SUTTON'S VERDICT Sheffield United bullied their way out of the Championship with an aggressive style of play and Heckingbottom deserves great credit for getting them up comfortably in the end. They will be a physical match for any Premier League team and will try to make themselves difficult to beat, particularly at Bramall Lane. Manchester City loanee James McAtee is no longer at the club, which is a loss. You don’t earn a nickname like the ‘Salford Silva’ for nothing. United stayed up the last time they were promoted. But can they do it again? I’m not so sure. MAJOR INS A Trusty (Arsenal, £5m); B Traore (Hacken, £4m); A Slimane (Brondby, £2.3m); V Souza (Lommel, undisclosed); Y Larouci (Troyes, loan) MAJOR OUTS I Ndiaye (Marseille, £20m); E Stevens (Stoke, free); J Eastwood (Grimsby, free); K Gordon (released); B Sharp (released); J O’Connell (released) LAST SEASON: 2nd in the Championship SUTTON PREDICTS: 19th TOTTENHAM WHO'S IN CHARGE? Ange Postecoglou - The Harry Kane saga was a sorry one for Postecoglou to inherit. But whoever starts up front for Tottenham, an abundance of chances will be created for him, thanks to the style of play. KEY PLAYER Son Heung-Min - With King Kane set to leave London, royal succession tells us the Son is next in line to the throne. He will need to help make up for the goals they are losing. With King Kane set to leave London, royal succession tells us the Son is next in line to the throne. He will need to help make up for the goals lost if Kane leaves SUTTON'S VERDICT With or without Harry Kane, Ange Postecoglou’s philosophy is to pepper teams. That was never going to change, whatever happened. The Kane situation will dominate narratives but in truth, Postecoglou would like his best players to be his centre backs. That’s because they need to be capable of clearing up any danger when opponents take back the ball and counter. I’m not sure if any of the Tottenham defenders Big Ange inherited meet his standards. In Scotland, when teams countered Celtic, they didn’t have the quality to hurt them. In England it will be different, so this will be interesting to watch. MAJOR INS J Maddison (Leicester, £45m); M Van de Ven (Wolfsburg, £34m); G Vicario (Empoli, £17m); A Veliz (Rosario, £13m); A Phillips (Blackburn, £2m); M Solomon (Fulham, free) MAJOR OUTS H Winks (Leicester, £10m); L Moura (Sao Paulo, free) LAST SEASON: 8th SUTTON PREDICTS: 7th WEST HAM UNITED WHO'S IN CHARGE? David Moyes - All the ‘Moyes Out’ advocates should take a look at the fantastic three years he’s given them since returning. The board’s patience was rewarded with that European triumph in Prague. KEY PLAYER Lucas Paqueta - Paqueta knows what the Premier League is about now. He is a superb playmaker, hence Man City’s interest, and I expect even better performances from him this season. Lucas Paqueta knows what the Premier League is about now. He is a superb playmaker SUTTON'S VERDICT They were the last Premier League club to make a signing, despite being linked with every midfielder who’s ever pulled on a pair of boots after selling Declan Rice for £105m. How West Ham cope without their club captain will be interesting to watch. David Moyes overachieved when he came back to the club with sixth and seventh-placed finishes. Last season was a struggle in the Premier League but they won the Europa Conference League, their first trophy since 1980. Moyes will desperately want his team to avoid another scrap for survival. The pressure on him last year was intense. MAJOR INS E Alvarez (Ajax, £34m); S Moore (Cliftonville, undisclosed) MAJOR OUTS D Rice (Arsenal, £105m); G Scamacca (Atalanta, £22m); N Vlasic (Torino, £11m); A Masuaku (Besiktas, £1.7m); M Lanzini (River Plate, free) LAST SEASON: 14th SUTTON PREDICTS: 12th WOLVES WHO'S IN CHARGE? Gary O'Neil - Julen Lopetegui was not a happy chappy in pre-season and now he has jumped a sinking ship. Wolves survived last season, but O’Neil faces one hell of a fight. KEY PLAYER Jose Sa - If Wolves endure another goal-shy season, then Sa’s ability to stop the shots flying his way will be key to them staying up. It feels like it is going to be a long old season. If Wolves endure another goal-shy season, then Sa’s ability to stop the shots flying his way will be key to them staying up SUTTON'S VERDICT The Premier League’s lowest scorers last season have lost Ruben Neves to Al Hilal. That’s the heartbeat of the team now plying his trade in Saudi Arabia. As if it could not get any worse, they then lost their manager with only three days to go until the start of the new season. Lopetegui voiced his dissatisfaction about their summer business, or lack thereof, and then departed. This is clearly a club in crisis and you have to worry about Wolves. They’ll have no Neves, no Lopetegui, no Raul Jimenez, no Joao Moutinho and so on. No hope? We’ll soon see. MAJOR INS M Cunha (A Madrid, £44m); B Traore (Metz, £9.5m); T King (Northampton Town, free); M Doherty (A Madrid, free) MAJOR OUTS R Neves (Al Hilal, £47m); N Collins (Brentford, £23m); C Coady (Leicester, £7.5m); R Jimenez (Fulham, £5m); R Giles (Luton, £5m); H Kawabe (Standard Liege, £1m); M Sarkic (Millwall, £1m); D Sanderson (Birmingham, undisclosed); D Costa (released); J Moutinho (released); L Matheson (released); A Traore (released); K-J Hoever (Stoke, loan) LAST SEASON: 13th SUTTON PREDICTS: 17th Share or comment on this article: Chris Sutton's Premier League predictions: Manchester City to retain title, Chelsea to miss out on top four AGAIN, and all three newly promoted sides to go down e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:21:47","image_url":"https://i.dailymail.co.uk/1s/2023/08/11/01/74193461-0-image-a-14_1691712878655.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"New trophy unveiled for 2023 King Salman Club Cup","link":"https://www.arabnews.com/node/2353181/saudi-sport","keywords":null,"creator":["romulo"],"video_url":null,"description":"RIYADH: The Union of Arab Football Associations on Thursday unveiled the new trophy that will be presented this weekend to the winners of the 2023 King Salman Club Cup. The brand new trophy, specially created for the tournament, which is also known as the Arab Club Champions Cup, was revealed during a special event at Tera Mall in the western Saudi city of Taif.","content":"RIYADH: The Union of Arab Football Associations on Thursday unveiled the new trophy that will be presented this weekend to the winners of the 2023 King Salman Club Cup. The brand new trophy, specially created for the tournament, which is also known as the Arab Club Champions Cup, was revealed during a special event at Tera Mall in the western Saudi city of Taif. Made by Sports Partners International, the trophy’s design includes elements inspired by the headscarf that is one of the symbols of formal Saudi attire. It is topped by a golden soccer ball, and an inscription at the bottom includes the name of the tournament. Made from bronze-coated copper, plated with 24-carat gold, it weighs 6.1 kilograms and stands 39.5 centimeters tall. Special guests at the unveiling included tournament director Mu’eed Al-Shahri and Abdullah Al-Zayedi, the director of the Ministry of Sports in Taif. Afterwards, fans had a chance to have their photo taken with the trophy. Al-Hilal and Al-Nassr will battle it out for the trophy in the final of the competition, which kicks off at 7pm on Aug. 12 at King Fahd Stadium in Taif.","pubDate":"2023-08-11 00:10:03","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast","link":"https://www.dailymail.co.uk/sport/football/article-12388921/How-Manchester-United-legend-Roy-Keane-terrified-Mail-Sports-Ian-Ladyman-reveals-hilarious-anecdotes-new-Kicking-podcast.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Roy Keane has terrified fellow players, pundits and even journalists over the years and Mail Sport's Ian Ladyman has revealed two of his own brilliant anecdotes about the Manchester United legend.","content":"How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast Click here to watch Mail Sport's brand new show 'It's All Kicking Off' in full Ian Ladyman revealed a couple of his Roy Keane anecdotes on preview show Manchester United legend gave him a withering look he's become known for By Will Griffee For Mailonline Published: 01:03 BST, 11 August 2023 | Updated: 01:03 BST, 11 August 2023 e-mail View comments Roy Keane has scared fellow players, pundits and even journalists over the years and Mail Sport's Ian Ladyman has revealed two of his own brilliant anecdotes about the Manchester United legend. Speaking on the first episode of the brand new It's All Kicking Off podcast, Ladyman spoke to Chris Sutton about a couple of encounters with the Irishman. One was during the 52-year-old's playing days and the other came when Keane released his tell-all autobiography just over a decade ago in 2012. Here's how the conversation went when Ladyman and Sutton discussed Keane and the varying effects his intimidating persona can have... Your browser does not support iframes. Ian Ladyman (L) and Chris Sutton talked Roy Keane on Mail Sport's It's All Kicking Off podcast Keane terrified Ladyman without doing anything whatsoever to him at an airport Ladyman: 'I will say Roy Keane is one of the few people who scared me one day, simply by ignoring me! 'I was in an airport and I think we must have been at the same game for TV and I saw him coming the other way. I wouldn't suggest Roy remembers who I am from when he was playing at United and was covering them, but he might have known my face. 'I just knew he was going to ignore me, and the hair stood up on the back of my neck because I didn't know how he was going to do it, deliberately look the other way or give me one of those kind of stares. You're a bit wary of criticising him aren't you!?' Sutton: 'No, I'm not, he's always been alright with me, when I played against him, they normally beat us, that's probably why! 'He came to Celtic for a couple of weeks when Gordon Strachan took over and I suppose the perception of him within the dressing room was of a really strong, fiery character, great player, great leader and that he was going to come in and be really vocal. 'He absolutely wasn't that. He came in, kept his head down, trained hard and was pretty quiet. I'm not saying that greatly surprised me, people have a problem with Roy Keane because he's forthright with his opinions, which isn't a bad thing. 'You know, people have always spoken about Craig Bellamy in the past and he's rubbed people up the wrong way but it's only because Keane and Bellamy had really high standards and demanded that from other people, I don't have a problem with that.' Ladyman: 'I think of all the players I've seen play in the 25 years covering the sport, Keane is probably the best I've seen. Keane remains the best player Ladyman has seen in his time covering football Mail Sport's podcast It's All Kicking Off has launched with a Premier League preview Sutton: ' On the off chance he's listening to this!' Ladyman: 'Any journalist who was covering Roy Keane in that time has a Roy Keane story, which I'm going to tell because I can, I'm essentially in charge here! 'When Keane's second book was published about 10 years ago, we all went over to Dublin for the launch, he was going through that geography teacher phase with the beard and tweed jacket and all that. 'He stood on the stage to promote the book and do a press conference and absolutely assassinated everyone he could think of, because he was there to promote the book. He assassinated Fergie, Mick McCarthy, Alf Inge Haaland, classic Keane form. And then it comes to do a little breakout session with the daily newspapers and we sat around a round table. 'Two people had to sit either side of him and I was one of them. We're talking about the book, stories, bits and pieces and I just look at him and say: \"I was quite interested to see that you admitted in the book that the first single that you ever bought was Karma Chameleon by Culture Club.\" The United legend had a fearsome reputation and carried that with him after football too Keane is seen here clashing with his own team-mate Peter Schmeichel (centre) 'He just looked at me and said: \"I was 11', he didn't take his eye off me. Then he said... \"What was yours?\" I thought \"he's got me now\", I said, \"It was, Does Your Mother Know by Abba\". 'He just said, \"Why am I not f***ing surprised\". The whole table just fell about laughing! Because he had me there, I walked right into that trap, that withering look that he gives you, that you normally get at home when you've left your socks on the floor or forgotten to open the kitchen door and the dog's peed on the lino or something like that!' That withering look has been part of Keane's weaponry from the pitch to the dugout and now television studio. The widely respected pundit has become must-see TV but no doubt a few of his colleagues will be feeling the same heat as Mail Sport's esteemed journalist did over the course of the season ahead. It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show on Thursday and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Share or comment on this article: How Manchester United legend Roy Keane terrified Mail Sport's Ian Ladyman, as he reveals hilarious anecdotes on new It's All Kicking Off podcast e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-11 00:03:05","image_url":"https://i.dailymail.co.uk/1s/2023/08/10/13/74167511-0-image-a-6_1691670908346.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Raiders QB Jimmy Garoppolo sharp in practice against former 49ers teammates","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/08/10/raiders-qb-jimmy-garoppolo-sharp-in-practice-against-former-49ers-teammates","keywords":["NFL"],"creator":["Feedloaderapi"],"video_url":null,"description":"HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn’t have been an unusual sight at practice when they […]","content":"HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn't have been an unusual sight at practice when they were San Francisco 49ers teammates. Read this article for free: Already have an account? To continue reading, please subscribe: * HENDERSON, Nev. (AP) — Fred Warner was begging Jimmy Garoppolo to throw a pass at him, which in previous years wouldn’t have been an unusual sight at practice when they were San Francisco 49ers teammates. But they were on opposite sides Thursday with Warner at linebacker for the Niners and Garoppolo quarterbacking the starting offense for the Las Vegas Raiders as the teams met for a joint practice. “That’s my guy,” Warner said afterward. “I love Jimmy. I love seeing him succeed. He had a great practice today, so I’m looking forward to (Friday) again.” The teams have another joint practice Friday and then meet in a preseason game Sunday at Allegiant Stadium. Raiders coach Josh McDaniels didn’t rule out playing Garoppolo on Sunday, but the chances don’t appear likely. So these two practice days against the 49ers are especially important. Garoppolo played the previous 5 1/2 seasons in San Francisco before signing with the Raiders in the offseason. He didn’t have the easiest transition, a broken left foot delaying his signing by a day and then forcing him to miss organized team activities and minicamp. When training camp began, Garoppolo often didn’t look close to the quarterback who helped the 49ers reach the Super Bowl in 2019 and the NFC title game in 2021. But now he’s starting to come around, and on Thursday was especially sharp during two late-practice scrimmage drives. He went 3 for 4 on one drive while connecting with three different receivers — his solo miss a sideline pass to Davante Adams in which the receiver was just barely out of bounds. Then in a 2-minute drive, Garoppolo completed five of seven passes to three receivers, including a touchdown in double coverage to tight end Austin Hooper. “I think it’s moving in the right direction,” Garoppolo said. “I obviously started getting my feet under me, literally and figuratively.” Garoppolo said on the first play that Niners linebacker Dre Greenlaw started playfully yapping at him, calling it an enjoyable experiencing facing a group of players he called his “brothers.” That’s despite how it ended in the Bay Area. The 49ers had planned to trade Garoppolo before the 2022 season and start Trey Lance, the third overall pick in the 2021 draft whom San Francisco gave up three first-round picks to acquire. But when Garoppolo underwent offseason shoulder surgery, that eliminated outside trade interest in him, prompting the 49ers to re-sign him at a reduced deal. When Lance was injured two games into last season, Garoppolo again took over as the starter. He was having his best year, throwing 16 touchdown passes and four interceptions in 10 games, before going down with a season-ending foot injury. In February, Niners coach Kyle Shanahan said he didn’t see how Garoppolo would return to the club next season. “I think that was a simple question: Is there scenario he can be back here next year?” Shanahan said. “I gave a common-sense answer: ‘No.’ I think that was a little overblown on trying to be a shot at him or anything. We knew Jimmy wasn’t coming back on his standpoint and our standpoint, financially, and everything. But any time I’ve been asked about Jimmy and what he meant to us and how he was, I’ve never said it differently. “Jimmy was unbelievable here.” Shanahan said he didn’t get the chance to speak with Garoppolo on Thursday because the teams were on separate practice fields. “I think he’s an interesting guy because he doesn’t promote himself ever, but he could,” San Francisco running back Christian McCaffrey said of Garoppolo. “He won a lot of games. He’s obviously a great quarterback who’s been successful in the past. Always has a smile on his face, always has a great attitude and is just a really great guy to be around.” Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. Garoppolo said to not mistake his easygoing demeanor for a lack of competitiveness. “It’s in there,” Garoppolo said. “Everyone has different ways of dealing with stuff. Some people like to vocalize it and put it out there. Some people like to keep it in and just let their play do the talk. There are different ways to go about it, but that’s kind of how I’ve always been. I’m not changing.” NOTES: 49ers wide receiver and return specialist Ray-Ray McCloud will be out about eight weeks because of a broken wrist. He is expected to undergo surgery Friday. McCloud caught 14 passes for 243 yards and a touchdown last season and averaged 10.8 yards on punt returns and 23.0 on kickoff returns. … San Francisco TE George Kittle is out this week with an adductor strain. Greenlaw left early because of a hamstring injury. ___ AP NFL: https://apnews.com/hub/nfl Advertisement","pubDate":"2023-08-10 23:47:01","image_url":null,"source_id":"winnipegfreepress","category":["sports"],"country":["canada"],"language":"english"},{"title":"World Cup 2023 TV schedule: How to look at each match at present","link":"https://www.businesslend.com/sports/world-cup-2023-tv-schedule-how-to-watch-every-match-today-5/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as Miguel Delaney’s Reading the Game publication despatched straight to your inbox free of charge Sign as much as Miguel’s Delaney’s free weekly publication The quarter-finals of the Women’s World Cup are set as England proceed their preparations for Saturday’s conflict with Colombia in Sydney. After a bunch stage of shocks and [...] The post World Cup 2023 TV schedule: How to look at each match at present appeared first on BusinessLend.","content":"The quarter-finals of the Women’s World Cup are set as England proceed their preparations for Saturday’s conflict with Colombia in Sydney. After a bunch stage of shocks and surprises, the event has reached its enterprise finish with a number of huge names nonetheless standing. The Lionesses survived a scare to defeat Nigeria on penalties as Sarina Wiegman’s facet reached the final eight, however they’ve now acquired information that star ahead Lauren James is banned for 2 video games after her purple card within the final spherical, when she stamped on Michelle Alozie. The quarter-final motion resumes on Friday with a blockbuster pair of matches. First Spain will play Netherlands in an all-European conflict, earlier than Sweden face Japan, who’ve been the standout group on the World Cup to date. It’s England’s activate Saturday as they face Colombia, after co-hosts Australia play France on what is ready to be an electrical night time in Brisbane. Here is every part you might want to learn about the way to watch the Women’s World Cup. How can I watch the Women’s World Cup? For UK viewers, each sport will likely be obtainable to look at on the BBC and ITV. For the BBC, there will likely be reside protection on tv in addition to the BBC Sport web site with reside audio commentary obtainable on BBC Radio 5 Live, 5 Sports Extra and the BBC Sounds app. For ITV, reside protection will likely be obtainable on tv in addition to on-line through ITVX. Full knockout stage TV schedule Friday 11 August QF1: Spain vs Netherlands (02:00, Wellington) – ITV 1 QF2: Japan vs Sweden (08:30, Auckland) – BBC One Saturday 12 August QF3: Australia vs France (08:00, Brisbane) – ITV 1 QF4: England vs Colombia (11:30, Sydney) – ITV 1 Tuesday 15 August SF1: Winner QF1 vs Winner QF2 (09:00, Auckland) Wednesday 16 August SF2: Winner QF3 vs Winner QF4 (11:00, Sydney) Saturday 19 August third place play-off: Loser SF1 vs Loser SF2 (09:00, Brisbane) Sunday 20 August Final: Winner SF1 vs Winner SF2 (11:00, Sydney) Last-16 outcomes Saturday 5 August Match 49: Switzerland 1-5 Spain (06:00, Auckland) – BBC One Match 50: Japan 3-1 Norway (09:00, Wellington) – ITV 1 Sunday 6 August Match 51: Netherlands 2-0 South Africa (03:00, Sydney) – BBC One Match 52: Sweden 0-0 United States – Sweden win 5-4 on penalties (10:00, Melbourne) – ITV 1 Monday 7 August Match 54: England 0-0 Nigeria – England win 4-2 on penalties (08:30, Brisbane) – BBC One Match 53: Australia 2-0 Denmark (11:30, Sydney) – BBC One Tuesday 8 August Match 56: Colombia 1-0 Jamaica (09:00, Melbourne) – ITV 1 Match 55: France 4-0 Morocco (12:00, Adelaide) – BBC One Group Stage outcomes (All kick-off occasions BST ) Thursday 20 July Group A: New Zealand 1-0 Norway (08:00, Auckland) – BBC One Group B: Australia 1-0 Republic of Ireland (11:00, Sydney) – ITV 1 Friday 21 July Group B: Nigeria 0-0 Canada (03:30, Melbourne) – BBC Two Group A: Philippines 0-2 Switzerland (06:00, Dunedin) – ITV 1 Group C: Spain 3-0 Costa Rica (08:30, Wellington) – BBC Two Saturday 22 July Group E: USA 3-0 Vietnam (02:00, Auckland) – BBC One Group C: Zambia 0-5 Japan (08:00 Hamilton) – BBC Two Group D: England 1-0 Haiti (10:30, Brisbane) – ITV 1 Group D: Denmark 1-0 China (13:00, Perth) – BBC Two Sunday 23 July Group G: Sweden 2-1 South Africa (06:00, Wellington) – BBC Two Group E: Netherlands 1-0 Portugal (08:30, Dunedin) – BBC One Group F: France 0-0 Jamaica (11:00, Sydney) – ITV 1 Monday 24 July Group G: Italy 1-0 Argentina (07:00, Auckland) – ITV 1 Group H: Germany 6-0 Morocco (09:30, Melbourne) – ITV 1 Group F: Brazil 4-0 Panama (12:00, Adelaide) – ITV 1 Tuesday 25 July Group H: Colombia 2-0 Korea Republic (03:00, Sydney) – BBC 2 Group A: New Zealand 0-1 Philippines (06:30, Dunedin) – ITV 1 Group A: Switzerland 0-0 Norway (09:00, Hamilton) – ITV 1 Wednesday 26 July Group C: Japan 2-0 Costa Rica (06:00, Dunedin) – ITV 1 Group C: Spain 5-0 Zambia (08:30, Auckland) – BBC Two Group B: Canada 2-1 Republic of Ireland (13:00, Perth) – ITV 1 Thursday 27 July Group E: USA 1-1 Netherlands (02:00, Wellington) – BBC One Group E: Portugal 2-0 Vietnam (08:30, Hamilton) – ITV 1 Group B: Australia 2-3 Nigeria (11:00, Brisbane) – BBC Two Friday 28 July Group G: Argentina 2-2 South Africa (01:00, Dunedin) – ITV 1 Group D: England 1-0 Denmark (09:30, Sydney) – BBC One Group D: China 1-0 Haiti (12:00, Adelaide) – ITV 1 Saturday 29 July Group G: Sweden 5-0 Italy (08:30, Wellington) – BBC Two Group F: France 2-1 Brazil (11:00, Brisbane) – BBC One Group F: Panama 0-1 Jamaica (13:30, Perth) – ITV 4 Sunday 30 July Group H: Korea Republic 0-1 Morocco (05:30, Adelaide) – BBC Two Group A: Norway 6-0 Philippines (08:00, Auckland) – BBC iPlayer Group A: Switzerland 0-0 New Zealand (08:00, Dunedin) – BBC Two Group H: Germany 1-2 Colombia (10:30, Sydney) – ITV 1 Monday 31 July Group C: Costa Rica 1-3 Zambia (08:00, Hamilton) – ITV 4 Group C: Japan 4-0 Spain (08:00, Wellington) – ITV 1 Group B: Ireland 0-0 Nigeria (11:00, Brisbane) – BBC iPlayer Group B: Canada 0-4 Australia (11:00, Melbourne) – BBC Two Tuesday 1 August Group E: Vietnam 0-7 Netherlands (08:00, Dunedin) – ITV 4 Group E: Portugal 0-0 USA (08:00, Auckland) – ITV 1 Group D: Haiti 0-2 Denmark (12:00, Perth) – ITV 4 Group D: China 1-6 England (12:00, Adelaide) – ITV 1 Wednesday 2 August Group G: South Africa 3-2 Italy (08:00, Wellington) – BBC Two Group G: Argentina 0-2 Sweden (08:00, Hamilton) – BBC iPlayer Group F: Jamaica 0-0 Brazil (11:00, Melbourne) – ITV 1 Group F: Panama 3-6 France (11:00, Sydney) – ITV 4 Thursday 3 August Group H: Korea Republic 1-1 Germany (11:00, Brisbane) – BBC Two Group H: Morocco 1-0 Colombia (11:00, Perth) – BBC iPlayer Sydney (Stadium Australia, 83,500) Sydney (Sydney Football Stadium, 42,512) Brisbane (Lang Park, 52,263) Melbourne (Melbourne Rectangular Stadium, 30,000) Perth (Perth Rectangular Stadium, 22,225) Adelaide (Hindmarsh Stadium, 16,500) Auckland (Eden Park, 48,276) Wellington (Wellington Regional Stadium, 39,000) Dunedin (Forsyth Barr Stadium, 28,744) Hamilton (Waikato Stadium, 25,111) Harry Kane given permission to journey to Munich for medical – reviews","pubDate":"2023-08-10 23:43:25","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"Bradford (Park Avenue) look able to cope with new challenge","link":"https://www.thetelegraphandargus.co.uk/sport/23711857.bradford-park-avenue-look-able-cope-new-challenge/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"BRADFORD (Park Avenue) finally get their league campaign underway this weekend and should be well placed to go up from the Northern Premier League","content":"After watching the neighbouring Bantams get going last weekend, and tenants Albion Sports start their season two weeks ago, Bradford (Park Avenue) finally get their league campaign underway this weekend. As we know, it is the first time in over a decade that Avenue have been down at this level, after a rollercoaster ride in the sixth tier. Play-off near misses and relegation great escapes have both featured in that spell, but the club’s time finally ran out at the end of April, as they slipped into the Northern Premier League Premier Division. But for years, long-serving manager Mark Bower has insisted that Avenue’s goal, first and foremost, was to stay in National League North. Avenue will have a new experience this season, having narrowly failed to survive in National League North. (Image: John Rhodes.) All of a sudden, Bradford are big fish in a new division, so a successful season suddenly looks very different. Speaking to Simon Parker last month, Bower said: “The onus now will be on us to dictate games and dominate, be the better team. “It will be tough, don’t get me wrong. There are obviously more big budgets in the Conference North but there are still a fair few in this league as well.” And reflecting on what Avenue can achieve, he said: “We have been punching above our weight for the last few years in that league. “When the luck goes against you, like it did when we had 11 or 12 players injured in one spell when we were playing every Saturday and midweek, it really did cause us problems. “We’ve kept some good players for the level. If we can keep people fit and get near to our best 11 out on the pitch every week, then we should be competing in the top half of the table. George Sykes-Kenworthy was at City only recently, and many might have expected him to move on from Avenue after their relegation. (Image: Thomas Gadd.) “Do that and you’re looking to get into the top five and hopefully back to where we’ve just come from. “We’ve definitely got a few more bodies to bring in. “We won’t have a squad full of depth. We’re going to have a core of decent quality, experienced players for that level.” Crucially for Avenue, who remember were only relegated on the final day of last term, they have retained an impressive number of players, including the likes of Luca Havern, Oli Johnson and Jamie Spencer , who have tasted relative success at the club. While many sides find themselves picked apart, or simply have players no longer wanting to stay, after going down, Bower has been rewarded for fostering a fine team spirit over the last few years, with many happy to help him try and guide the side back up. From all of Steps 1 to 6 in the Non-League system (Avenue now find themselves in Step 3), promotion has been standardised, to ensure the champions go up and the four teams below them enter the play-offs. Four also go down from Steps 1 to 3, as Avenue know all too well from last year, while some of their neighbours in and around Bradford are more fortunate, with two relegated from Step 4, only one from Step 5, and three being liable to drop from Step 6, depending on the suitability of the amateur teams primed to replace them. But for once, Avenue are surely looking at that top end of the table, rather than avoiding that dreaded trapdoor. Ultimately, a couple of moves have been made that should improve Avenue regardless. Avenue owner Gareth Roberts wrote off £1.8m of the club’s £2.1m debt in June , turning that into equity/shares, meaning the financial constraints that have held the club back for a long time should be much less severe. And in addition to their ever-growing academy, the Horsfall outfit are now moving to a hybrid structure, meaning they will finally have full-time players and coaches among their set-up as well as part-time ones. Oli Johnson is now a strength and conditioning coach at Avenue as well as a striker. (Image: John Rhodes.) That should offer a step up in the level of professionalism for the club, and allow them to dedicate the time and energy needed to some of the brightest talents in BD6. Avenue have a reputation for notoriously sluggish starts to league seasons, and that is one drawback of this league, the unpredictable nature of the teams in it, given many will be all-new to the club. Ever-growing phoenix club Macclesfield FC, Avenue’s opening day opponents, are a case in point. Having been formed just three years ago, they have won back-to-back promotions, with famous pundit and Welsh international Robbie Savage as their director of football. Who knows whether this will prove a step too far for them or whether their epic rise will continue. But after an early wobble in pre-season saw them trounced by Campion, Avenue have played well in beating the Bantams and Chorley, and pushing Blackpool all the way, since. It gives them some momentum heading into 2023/24 and with a settled squad and a sense of stability off the field, Avenue really should have no excuses other than to challenge towards the top.","pubDate":"2023-08-10 23:25:00","image_url":"https://www.thetelegraphandargus.co.uk/resources/images/17040912/?type=app&htype=0","source_id":"thetelegraphandargus","category":["sports"],"country":["united kingdom"],"language":"english"}]}