{"newsArray":[{"title":"‘Spice Boys tag still follows us around’ – Robbie Fowler admits frustration in his ambition to manage in UK","link":"https://www.independent.ie/sport/soccer/spice-boys-tag-still-follows-us-around-robbie-fowler-admits-frustration-in-his-ambition-to-manage-in-uk-42332546.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"It is Robbie Fowler himself who raises it. And right at the start of our interview.","content":"It is Robbie Fowler himself who raises it. And right at the start of our interview. I liken it to the movie ,” he says of the iconic Monty Python film from the late Seventies. “They are all stood around the cross talking about names and say, ‘Brian’s a good one’. People thought, we will throw that [at us]: the ‘Spice Boys’. And it stuck.” Ah, the “Spice Boys”. The pejorative term applied to the Liverpool team of the mid-Nineties, with Fowler, Jamie Redknapp, Steve McManaman, Jason McAteer and David James at their heart. They donned their sunglasses and cream suits for the 1996 FA Cup final, but did not win. Fowler hated the label. Not least because it was never true. “The Spice Boy thing was a nickname and the fact that we never won anything played a big part in it,” he says. “Stories have grown arms and legs and I have tried to get rid of that.” Yes, he was the “joker” in the dressing-room, but only to “lighten the mood”. He could not have been a more serious footballer. ​“Nobody knows anything about me and that’s something I am quite proud of. People have this perceived idea,” Fowler says. “What I am now is probably quite boring. I understood what a dressing-room needed years ago, but people still have that idea of me as laughing and joking and not to be taken seriously. “That’s my perception … I wore my heart on my sleeve, I wanted to be better than anyone else and there were times when I got carried away on a football pitch.” Fowler is 47. He is the holder of the highest coaching badge, the UEFA Pro-Licence, and has succeeded in management in Thailand, Australia and India. He is deadly serious about being a manager. And yet he cannot get a job in his native country. Fowler’s frustration is as evident as his desire and determination, although it begs the question – given his success as a player, the wealth he has accrued, the hugely impressive Fowler Education and Football Academy he set up – why does he remain so driven? “You know why?” Fowler says. “It’s a simple answer and it’s exactly why I got into the game of football. I feel I have so much to give. I love football and it’s the only thing I want to do. Don’t get me wrong, I have been successful in other aspects of my life. But does it make me happy? Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. “I am a football man. If you sat in a room full of kids and they say, ‘I want to be a footballer’, what do they say when you ask why? They want to be rich. My answer was because I love football. It’s the same with wanting to be a coach or a manager. I want to stay in football. “I have done all my badges, I am halfway through an LMA [League Managers Association] diploma and I am forever learning and wanting to better myself and it’s exactly what I was like as a footballer. You practise because you want to get better. It’s the same as a coach. It’s massively important you keep learning.” We are talking at Melwood, Liverpool’s iconic former training ground which the club left in November 2020 and which he took over. It is where FEFA, which offers an intensive football programme with an academic curriculum for 16- to 19-year-olds, is now based. Fowler started it with his brother Scott near to where they grew up in Toxteth and is concerned that I might think we are meeting there as a deliberate ploy. “This isn’t about changing perceptions. This was always in the pipeline,” he says of the academy. “And the fact that I am at Melwood now speaks volumes of having a good relationship with the club, with the foundation. It’s not because I want to show people I am serious. It’s just what I am like. But it’s an example of showing that people don’t really know me.” For Liverpool fans, Fowler will always be “God”. He is a club legend. The England international was a sensation from the moment he scored on his debut against Fulham, in the League Cup in September 1993. In the return game, at Anfield, he scored five. He was 18. Fowler became the fastest Liverpool player in history to 100 goals; he would go on to score 183 in 369 games for the club, even though hampered by injury. “What was I like as a player?” Fowler asks rhetorically. “I worked harder than anyone. I hate using this, because it sounds egotistical, but I was always deemed as one of the most ‘naturally gifted’ strikers. Quite frankly, it annoys me because of the hours of practice I put in, the monotony of doing the repetition to make it look natural. It’s like second nature. If you are doing something all the time it makes it looks natural, but it was only because I did hours of practice. “As a kid, there was a grass pitch across the road and I was there every night practising with my right foot. I could not use my right foot and now people say they do not know which foot I favoured. And that’s a huge compliment. It showed those hours worked for me. I know if I have to do things better I will work at it and it’s the same as a manager now.” And he is fully committed to being a manager. “No one can throw at me that I’m afraid or will shirk anything,” Fowler says. In 2012, he went straight from being a player to acting head coach – because he was the most experienced – at Muangthong United in Thailand and took them to their equivalent of the FA Cup final. It gave him a taste for management, but he was determined to get his coaching badges and returned to the UK, working at Liverpool’s academy and then with clubs such as MK Dons. Fowler “held off” applying for jobs to make sure he was fully qualified. In 2019, he signed a two-year contract to take over Brisbane Roar with assistant Tony Grant, the former Everton midfielder. They hauled the club into the top four of the A-League, which was some achievement, not least because the season before they arrived Brisbane conceded 77 goals. Under Fowler it was just 24 and they were the form team when the pandemic struck. “One of the proudest things for me – and that includes all the goals I scored and trophies I won – is we had the best defensive record,” Fowler says. “A lot of people called it ‘Fowlerball’ and I was delighted with that because it showed we had a real identity. “The pandemic ruined us. I think we would have won it [the league] but sponsors were pulling out and there was no money and I told the club I needed to go home. I think I got the last flight out of Australia.” Fowler wanted to return, but Brisbane said they could not afford to keep Grant so he quit on a point of principle and then “achieved more” in India, where he was appointed manager of Super League club East Bengal in 2020. “I took a team that had just gone into the ISL – it was essentially like the owners of Accrington Stanley going into the Premier League having bought the rights but with the same players – and I had 10 days before the season started,” Fowler says before the club eventually became stymied in a dispute with their former owner. “If the opportunity comes up here, and it’s the right one, then of course I would love to take it. Chairmen and prospective owners might ask, why has he only done it abroad? But they are the only ones who have taken a chance,” Fowler explains. “I have done everything right. I have had my learning curve. I have proven to people I am willing to travel and take a chance and the big one is going out of my comfort zone. In terms of the experience of managing teams, I have covered a lot of ground and it’s now waiting for the one. I’m confident to keep going and do what I need to do.” Now he wants a job in the UK. “I am waiting for an opportunity,” he says. “I have been in touch for various people and sometimes you don’t get phone calls back, you don’t get anything back.” How does that feel? “Rude, for a start,” he says. “Maybe the fact I don’t have an agent matters. But I never had one as a player. I had an adviser, but I was comfortable doing what I was doing. I want to be the best. I want to go up the leagues. But my ego is not so big I wouldn’t go down the leagues. Just have the conversation with me,” he says. “Look at Mark Hughes and [League Two] Bradford. That makes sense because you see what they have achieved in the past. It’s no different for me. “I don’t want to put my name forward for every job that comes up as I don’t want to get stereotyped. I have to choose the right opportunity. It’s having the club with the right ambition because I think I have proven what I can do. In fact, I don’t think, I know.” Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/dee2d/42332544.ece/AUTOCROP/w1240h700/tyImages_1213659698","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Chris Armas catapulted out of his comfort zone again on his return to Old Trafford","link":"https://www.independent.ie/sport/soccer/premier-league/chris-armas-catapulted-out-of-his-comfort-zone-again-on-his-return-to-old-trafford-42332543.html","keywords":["Premier League"],"creator":null,"video_url":null,"description":"He had been compared unkindly with American comic figure Ted Lasso during his brief, unproductive time at Manchester United, but one thing Chris Armas has in common with the fictitious manager is the chance for a rerun.","content":"He had been compared unkindly with American comic figure Ted Lasso during his brief, unproductive time at Manchester United, but one thing Chris Armas has in common with the fictitious manager is the chance for a rerun. I t will come at Old Trafford tonight (8.0pm), when the 50-year-old American will be part of the interim team appointed to replace compatriot Jesse Marsch, who was dismissed on Monday with the club in 17th place in the Premier League. Armas spent five months on the coaching staff at United last season, under interim manager Ralf Rangnick; a period of dysfunction that ended with the summer arrival of Erik ten Hag. A former United States and Chicago Fire team-mate of Marsch, Armas moved to Elland Road last month and will now, barely two weeks later, be back at the scene of an unhappy period in his, and United’s, recent history. His record as a manager – his last job a spell of two wins in 15 games with Major League Soccer side FC Toronto in 2021 – raised eyebrows when he joined United’s coaching staff last season. Armas had also been blamed for the decline of New York Red Bulls after stepping up from Marsch’s assistant to head coach in 2018. Armas had been out of work for five months, after his sacking by Toronto, when he received the call from United in December 2021. Rangnick knew Armas from the latter’s time in New York – part of the Red Bull football portfolio which the German had been supervising. It did not take long for reports to surface of players’ dislike of Armas’s coaching methods, said to be focused on 11 against 11 routines, rather than more refined drills. The American could be seen on the United bench with wireless earphones in place, relaying information to Rangnick, drawing further unfortunate comparisons with Lasso, a US coach catapulted out of his comfort zone. After his departure from United, Armas was offered the chance to join Marsch at Leeds, before opting to return to the US, but in January Marsch brought him to Elland Road. That brief reunion ended after Saturday’s loss at Nottingham Forest spelt the end of Marsch’s tenure. Leeds will for now be managed by the three senior coaches on the staff – Armas, Paco Gallardo, a former reserve manager with Sevilla, and Michael Skubala, the club’s U-21 head coach. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up Lasso is about to feature in a third season on Apple TV. Whether Armas himself ever has a third season in English football is doubtful. Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/premier-league/b4d0c/42332542.ece/AUTOCROP/w1240h700/Manchester%20United%20v%20Brighton%20and%20Hove%20Albion%20-%20Premier%20League%20-%20Old%20Trafford...Manchester%20United%20assistant%20manager%20Chris%20Armas%20left%20and%20manager%20Ralf%20Rangnick%20on%20the%20touchli","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"That dream, playing for Ireland, will always be there, insists Bohemians ace Jonathan Afolabi","link":"https://www.independent.ie/sport/soccer/league-of-ireland/that-dream-playing-for-ireland-will-always-be-there-insists-bohemians-ace-jonathan-afolabi-42332565.html","keywords":["League of Ireland"],"creator":null,"video_url":null,"description":"Some of those young players who were named as Best In Class by the experts have wasted little time in the three-and-a-half years since they made their mark.","content":"Some of those young players who were named as Best In Class by the experts have wasted little time in the three-and-a-half years since they made their mark. O f the XI footballers selected by UEFA’s technical staff as the overall team of the tournament at the U-19 Euro finals in Armenia in 2019, four have gone on to play for Spain’s senior side (and Fabio Vieira has yet to win a senior cap with Portugal but is an important player for a title-chasing Arsenal this season while senior caps await the two French representatives). Ireland’s entrant on that best XI list has been treading water more than making waves, as Jonathan Afolabi is now 23 but has yet to start a top-flight game at club level and is way, way down the pecking order with his international team. But after a three-year spell spent in cold storage with Celtic, and then a promising start back home in Ireland with Bohemians which was ruined last year by injury after just one start, the striker says his ambitions and goals remain the same. “That dream, playing for Ireland, will always be there for me,” says Afolabi, taking a break from an intense pre-season training programme with Bohs ahead of the 2023 season. “I've put on that green shirt since I was a kid, playing up an age group for the U-19s, going to the Euro finals with the U19s, playing for the U21s. It will always be there for me to try and do that and I wouldn't sell myself short, I have played for Stephen Kenny before with the U-21s and he knows what I am capable of, it's up to me to show it. Everyone knows I have the ability, I just need to show that. “That’s why this season is such a big year for me with Bohemians. I'm 23 now and I have a lot of time to make up for, trying to get back to the levels I was at, to show what I can do. I think everyone knows what I can do, it's a matter of showcasing it for everyone.” The former St Joseph’s Boys man impressed for that Ireland side at the U-19 Euro finals in 2019 as Tom Mohan’s outfit reached the last four (though Afolabi missed the semi-final loss to Portugal due to suspension), even though he was a free agent, having been released by Southampton before departure. “Spain had six players in the team of the tournament like Fernan Torres. They had all these lads from clubs like Barcelona and Real Madrid, and I was the only player with ‘unattached’ beside their name,” he laughs. Hot property in the summer of 2019, Afolabi opted for a move to Celtic, high hopes of making the most of his three-year deal, but that was ill-fated and despite four loan spells in Scotland’s lower leagues, he got nowhere near the first team. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up “After two years I think I knew I wasn't going to make the first team, I had planned to get into the first team, that's why I went there but there are very high expectations at a club like Celtic, they expect to win every game and you need to be at the top of your level to even have a sniff,” he says, one of many young Irish players (Luca Connell, Lee O’Connor) who had youthful progress blocked at Celtic “I read that Celtic was bad for a lot of young Irish players, us not breaking through but there are two sides to it, if the players don't perform, they have no reason to put you into the first team. We had different pathways and we're making our way now in different ways. “I take responsibility for stuff I could have done better, been more professional, I didn't do anything wrong as such but there were steps I needed to take to improve, if I had taken all of my opportunities it could have been a different story for me at Celtic, you have to be ready when it happens.” ​“I can’t say it was three wasted years, I learned the levels you need to be at, how professional you need to be, what hard work you need to put that Celtic shirt,” added Afolabi, happy to see close friend and fellow Dubliner Bosun Lawal make his debut for the Bhoys last month. Keith Long, familiar with Afolabi from the days at nursery club Joey’s, took Afolabi to Bohs. He was upping his fitness after three sub appearances and made the most of his first start by scoring in an FAI Cup tie against Lucan United, but didn’t see out that game due to injury and didn’t play again, while Long was sacked four days later. As for Bohs’ prospects for the new season, Afolabi adds: “Everyone is fired up, new staff and new players, it should be a good season for us. We are still working on stuff but we know the way we will play, with the crop we have, we have no excuses for not being in and around the top, we have to aim for Europe.”","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/league-of-ireland/efc92/42332564.ece/AUTOCROP/w1240h700/20220826SD1038","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Easy to lose sight of the key fact that Glen did nothing wrong","link":"https://www.independent.ie/sport/gaelic-games/gaelic-football/easy-to-lose-sight-of-the-key-fact-that-glen-did-nothing-wrong-42332539.html","keywords":["Gaelic Football"],"creator":null,"video_url":null,"description":"When the GAA’s decision-making body felt it was appropriate, indeed the only course of action open to them, they ordered a replay of the All-Ireland club SFC final.","content":"When the GAA’s decision-making body felt it was appropriate, indeed the only course of action open to them, they ordered a replay of the All-Ireland club SFC final. N ot to go over it all once more, but because winners Kilmacud Crokes had an extra player on the pitch for the closing play of the final against Glen, they were in clear breach of the rules. Glen made the appeal, but the Kilmacud response was to object to this process. Much like Alan Partridge said as he was having an argument with a former teacher who struck him: “See you in Strasbourg!” Kilmacud’s response is typical of how these things play out in the GAA now, where everyone is the victim and nobody accepts responsibility. Their reaction was to produce a lengthy document that attempted to obfuscate the situation. The Central Competition Controls Committee (CCCC) heard them out patiently like a frazzled parent when their child asks them the 487th question of the day, before ordering the replay. Their response? To appeal again. Glen decided at that point that they wanted no more to do with the process and pulled out of proceedings. You cannot blame them. If an opposition team breaks the rules and has no interest in playing you to the rules of the game, then what can you do? And yet the backlash from some quarters has been astonishing, with the view that somehow Glen were culpable for the farce that has unfolded since the final. Here’s the thing – many people made mistakes on All-Ireland final day. Referee Derek O’Mahoney didn’t run the final play again, as requested by Glen management. Kilmacud should have ensured that they had the correct number of players on the pitch at all times. The only party that did not commit a mistake was Glen. They are completely innocent in all of this. Now, there are a couple of argument offshoots that are puzzling. Kilmacud’s efforts in reaching the All-Ireland final after having lost it in dramatic circumstances the previous year to Kilcoo were admirable. It showed great character. It did not, however, entitle them to have another man on the line for the final play of the 2023 game. Those arguing the numerical supremacy only happened for a short period of time also miss the point. The argument is paper-thin when you consider how Kilmacud lost the previous year’s decider — a goal in extra-time injury time scored by Jerome Johnston. How long was the ball in play for those last four minutes? It was 48 seconds, because of the usual mess that the conclusion of games has become. This irritating behaviour is almost universally accepted because our tolerance has been stretched to accommodate it. But, again, Glen did nothing wrong here either. In the days to follow, there was no appetite from the GAA to make any kind of comment. Eventually, they did — but only because Ard Stiúrthóir Tom Ryan was asked directly about it after the publication of his annual report. Ryan’s reasoning for the sudden turn of Greta Garbo syndrome was to reason that the process of all of this was key. And no, there would be no exception just because it was the All-Ireland final. People will make of that what they like. A striking element of the process was how well the wider club of Glen conducted themselves in all of this. While manager Malachy O’Rourke initially felt there would be no appeal, the players had to have their voice in all of this. Trying to marry that all in with the view of the committee, and indeed the club membership, would have been torturous. This thing was big, perhaps the biggest thing to ever affect the club. Marty Morrissey was in town looking for any locals to trade quips with for a quirky broadcast. And yet there were no leaks from the club, no tip-off to curry favour. The integrity was there. Infuriatingly so, as a journalist. Because at the back of all of this is a club that means a great deal to the people. The senior team is the icing on the cake but it would be nothing without everything else. They had indefatigable club volunteers such as Jim McGuigan, John J McKenna, John Tunney and Enda Gormley. Christmas night in their clubhouse hoovered up everyone in the surrounding parishes for festive fun. Long before any club had a minibus, Glen had one. In quieter times, games of 45 in the members’ bar helped stave off loneliness for the elderly and James Devlin’s Sunday night quizzes were another staple. In the meantime, their Lotto continues every Monday in the club rooms. The jackpot is up to £7,500.","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/gaelic-games/gaelic-football/eb5a3/42332537.ece/AUTOCROP/w1240h700/22012023POMb005975","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Manchester United facing summer dilemma over £100m Harry Kane or Victor Osimhen","link":"https://www.independent.ie/sport/soccer/manchester-united-facing-summer-dilemma-over-100m-harry-kane-or-victor-osimhen-42332534.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"Erik ten Hag is facing a £100 million (€112m) striker dilemma at Manchester United this summer as he weighs up whether to move for Tottenham’s Harry Kane or Napoli’s rising star Victor Osimhen.","content":"Erik ten Hag is facing a £100 million (€112m) striker dilemma at Manchester United this summer as he weighs up whether to move for Tottenham’s Harry Kane or Napoli’s rising star Victor Osimhen. S igning a top striker is United’s priority and Ten Hag must decide whether to go for a Premier League proven shorter-term fix in Kane – and with it a virtual guarantee of goals – or take a calculated gamble on Osimhen developing into a world-beater for years to come. Old Trafford sources have indicated that Osimhen better fits Ten Hag’s profile of wanting a more mobile striker who offers pace, strength and pressing, as well as goals. Ten Hag has watched extensive footage of Osimhen since last summer and, while there are elements of the striker’s game the Dutchman is unsure about and he has had injury problems, it has been noted that his improvement has continued to gather pace this season. Osimhen has been central to Napoli’s relentless pursuit of a first Serie A title for 33 years and scored twice in their 3-0 win over Spezia on Saturday, which took his tally to 16 in 17 league matches as they moved 13 points clear at the top. Napoli owner Aurelio De Laurentiis is a notoriously tough negotiator, though, and with Paris Saint-Germain and Chelsea also showing interest in Osimhen, the price for the Nigeria striker is likely to exceed £100m given the Italian club paid Lille a projected €80m for his services three years ago. Neither deal would be straight forward, however. Daniel Levy, the Tottenham chairman, will demand £100m from any English club for Kane should he fail to persuade the England captain – due to enter the final 12 months of his contract this summer – to sign a new deal. Levy is unlikely to make any negotiation process easy and if forced to offload Kane, his strong preference would be to sell overseas. Kane became Tottenham’s all-time top scorer on Sunday when his goal in the 1-0 win over Manchester City made it 267 for the club and saw him surpass Jimmy Greaves’ 53-year record. Spurs are hoping to convince Kane to sign a new contract but their hopes may hinge on the club winning a trophy this term and qualifying for the Champions League. Bayern Munich – who are still looking for a replacement for Robert Lewandowski – have been linked with Kane and Levy may also hope other foreign suitors come to the table if the player wants to leave. Kane is desperate to win trophies first and foremost but having become Tottenham’s record scorer, he also has his sights set on eclipsing Alan Shearer’s record of 260 Premier League goals. He is currently on 200. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up ​Ten Hag recognises Kane offers a unique skill-set, creates as well as scores as a hybrid No 9 and No 10, knows the Premier League inside out, is a strong character accustomed to dealing with pressure and has never been dependent on pace. ​United are also fully conscious of the impact Kane has had on Son Heung-min’s game and vice-versa at Spurs and believe he could be a potent foil for Marcus Rashford, his England team-mate who is in the form of his life at Old Trafford. ​ Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/ffeb5/42332533.ece/AUTOCROP/w1240h700/SOCCER-ENGLAND-TOT-MCIREPORT","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Forget Mikel Arteta v Pep Guardiola – this is a battle for the soul of the game","link":"https://www.independent.ie/sport/soccer/premier-league/forget-mikel-arteta-v-pep-guardiola-this-is-a-battle-for-the-soul-of-the-game-42332541.html","keywords":["Premier League"],"creator":null,"video_url":null,"description":"The biggest legal case in Premier League history – with huge consequences for Manchester City and English football – will be fought out by the two sides’ respective legal counsels and at least one KC who can command hourly rates comparable with the best-paid footballers.","content":"The biggest legal case in Premier League history – with huge consequences for Manchester City and English football – will be fought out by the two sides’ respective legal counsels and at least one KC who can command hourly rates comparable with the best-paid footballers. N ot quite the glamour or the theatre of Pep Guardiola v Jurgen Klopp or Erling Haaland v Virgil van Dijk, but Kevin Plumb v Simon Cliff, with some big-name KCs on both sides, is shaping up to be the clash that could define the Premier League’s future, as well as its past. Plumb is the Premier League’s general counsel and has been at the head of the legal operation that worked intensively for almost four years before announcing its 115 charges against City on Monday. Cliff advised Sheikh Mansour bin Zayed Al Nahyan’s Abu Dhabi United Group on its acquisition of City in 2008 and has since fought other financial fair play legal cases involving the club, who deny wrongdoing. At stake is the integrity of the Premier League’s rules on how much owner wealth clubs can spend, the sanctity of sponsorship contracts and compliance by clubs with rules of disclosure when it is suspected that those laws have been broken. For City, it is the battle to preserve their Premier League status and possibly the six titles they have won since 2012. Plumb, who has been at the Premier League since September 2015, has faced more than one legal crisis since the investigation into City began. First, there was the Premier League shutdown over Covid during 2020, which meant the negotiation of rebates for broadcasters and amending the profit and sustainability rules for clubs. In April 2021, the Premier League faced the breakaway of six of its members, including City, with the European Super League (ESL). In that time, the City investigation has come under scrutiny from the Premier League’s board. It began when Claudia Arney was the interim chair of the Premier League, through Gary Hoffman’s tenure and now into that of new chair Alison Brittain. The progress of the investigation has been discussed among the directors for its duration. The 19 clubs other than City in the League in any one season have been told that any lobbying on their part is unwelcome. The case against City was built by Plumb and the Premier League’s external legal firm Bird & Bird. The battle the Premier League has been through to gain full disclosure was reflected in the 115 charges brought by Plumb’s legal team against City. The Premier League has charged City under rule B.15 of its handbook, which obliges all clubs to act “with the utmost good faith”. The Premier League rules state that, by way of example, breaking that can mean for a club to “act dishonestly towards the league or another club” or “engage in conduct that is intended to circumvent these rules or obstruct the board’s investigation of compliance with them”. Plumb has already had to fight Cliff and City’s legal team in court in July 2021 to get the case to this point. That was when City tried to challenge the jurisdiction of the Premier League rules themselves. Cliff himself featured prominently in the allegations made by German magazine Der Spiegel in its original revelations about City’s finances in November 2018 that prompted the Premier League investigation. It was alleged that in seeking to find ways that City could keep pumping Sheikh Mansour’s wealth into the club without attracting sanctions from UEFA under its financial fair play regulations, Cliff invoked the Battle of Agincourt. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up The UEFA FFP (Financial Fair Play) revolution had been driven by the former France international and then UEFA president Michel Platini, prompting Cliff to call City’s attempts to circumvent it ‘Project Longbow’, Der Spiegel alleged. In an internal email, Cliff said it was appropriate because the longbow was “the weapon the English used to beat the French at Crecy and Agincourt”. ​Cliff and Plumb have recruited some expensive team-mates. The Lawyer magazine reports that Lord Pannick KC will represent City. He can earn up to £80,000 (€90,000) a day, which would be equal – pro rata – to Haaland’s City deal, believed to make him the highest-earning player at the club. City will hope Pannick will not have to be contracted for a similar five-year deal. Pannick, The Lawyer reports, will face a Blackstone Chambers colleague for the Premier League, Adam Lewis KC. Blackstone’s Andrew Hunter KC and Jason Pobjoy will appear alongside Lewis. On Pannick’s side for City will be Monckton Chambers’ Paul Harris KC. Cliff and the City legal team rolled back the UEFA sanctions that flowed from the Der Spiegel revelations. UEFA banned City from its competitions for two years and fined the club €30m for alleged FFP breaches. In 2020, the Court of Arbitration for Sport annulled the ban and reduced the fine to €10m for not co-operating with UEFA’s investigation. That represented a major victory for City, and they will now go into battle once again – with even more at stake.","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/premier-league/6da63/42332540.ece/AUTOCROP/w1240h700/GettyImages_1460059957","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Ex-Munster coach Aled Walters joins England backroom","link":"https://www.independent.ie/sport/rugby/six-nations/ex-munster-coach-aled-walters-joins-england-backroom-42332559.html","keywords":["Six Nations"],"creator":null,"video_url":null,"description":"England have recruited two more coaches from Leicester as Steve Borthwick continues to assemble his management team.","content":"England have recruited two more coaches from Leicester as Steve Borthwick continues to assemble his management team. O n the day it was confirmed Richard Cockerill would step down at the end of the Guinness Six Nations to join Montpellier, the Rugby Football Union announced the appointment of interim Tigers boss Richard Wigglesworth and Aled Walters. Wigglesworth joins as an assistant coach, most likely overseeing the attack which is currently being directed by Nick Evans. Meanwhile Walters will become head of strength and conditioning – a position similar to the one he held at Munster – in the wake of Jon Clarke’s departure. The duo will take up their posts at the end of the club season, making them available for the build-up to this autumn’s World Cup in France. Wigglesworth had only just been appointed to the interim head coach’s role with Leicester which was vacated by Borthwick when he replaced Eddie Jones in December. “Richard and Aled are two outstanding coaches in their fields who I know very well,” Borthwick said. “Richard has been a proven winner throughout his playing career and has carried this into his coaching career. “He already has international coaching experience, from the 2019 World Cup, alongside a hugely successful playing career and has amassed a wealth of knowledge. “Few people have such an in-depth, wide-ranging view and understanding of the tactical element of the game. “Aled is an excellent performance coach who had an incredible impact with the World Cup holders South Africa. “Wherever he has worked, players improve. I have never met anyone who is able to get more out of players than he does.”","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/rugby/six-nations/13ae7/42332558.ece/AUTOCROP/w1240h700/260218DG0564","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Pac-12 commissioner George Kliavkoff reportedly visiting SMU","link":"https://www.deseret.com/2023/2/7/23590297/conference-realignment-pac-12-george-kliavkoff-reportedly-visiting-smu","keywords":null,"creator":["Ryan McDonald"],"video_url":null,"description":null,"content":"It’s been pretty quiet recently on the conference realignment front, but on Tuesday evening, Action Network’s Brett McMurphy reported that those winds are still blowing. McMurphy reported that Pac-12 Conference commissioner George Kliavkoff will visit SMU on Wednesday as he eyes potential expansion candidates. McMurphy added that SMU and San Diego State “are top Pac-12 expansion candidates.” He furthermore said that the Pac-12 “needs more members & more inventory for new media rights deal, which is expected to rely heavily on digital streaming services.” Pac-12 commish George Kliavkoff visiting SMU Wednesday, sources told @ActionNetworkHQ . San Diego State & SMU are top Pac-12 expansion candidates. Pac-12 needs more members & more inventory for new media rights deal, which is expected to rely heavily on digital streaming services Adding SMU, which currently plays in the American Athletic Conference, would give the Pac-12 a market in Dallas, Texas. Adding San Diego State would give the conference a market in Southern California after the departures of UCLA and USC to the Big Ten Conference. Adding both would restore the number of conference teams to 12 once UCLA and USC leave in 2024. Last July at the Pac-12’s football media days, which came a month after UCLA and USC announced their departure for the Big Ten, Kliavkoff said the conference was “actively exploring expansion opportunities.” He listed market/media value, athletic value, academic and cultural fit, and the effects on student-athletes as criteria for an expansion candidate, adding that the goal is to get invitations to the College Football Playoff, which at the time had not yet expanded to 12 teams. The College Football Playoff will expand in the 2024 season. Kliavkoff said then that media rights negotiations would be “accelerating,” although the conference has yet to finalize any sort of deal, as McMurphy indicated.","pubDate":"2023-02-08 01:54:45","image_url":null,"source_id":"deseret","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"York City boss understands the frustrations of angry supporters","link":"https://www.yorkpress.co.uk/sport/23306379.york-city-boss-understands-frustrations-angry-supporters/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"DAVID WEBB has assured supporters that he does ‘understand their frustration’.","content":"DAVID WEBB has assured supporters that he does ‘understand their frustration’, after York City slid to 18th in the Vanarama National League table following defeat to Solihull Moors. York did originally lead through Shaq Forde, before two goals in the space of two minutes from Joe Sbarra and Andrew Dallas saw the Moors take the advantage. Olly Dyson quickly drew the scores level again, before ex-York man Mark Beck powered home a header in the 82nd minute to gift Neal Ardley’s side all three points. Supporters made their feelings towards Webb and majority owner Glen Henderson well-known, with chants for the pair to leave the club and booing that Webb couldn’t ignore. “I understand their frustrations because if any manager is in a bad situation and doesn’t win football games you are under pressure.” Webb explained. “It’s up and down the country, I get it. “So I get their frustrations, we were just disappointed we couldn’t get a win tonight because we felt coming into the first half we could do it. “We’re here to win football games and if we don’t win football games then we have got to take criticism. “It’s part of life, any football manager would tell you that and I’m no different. “The fans are going to voice their frustartions if we lose and obviously the position we are in at the minute. So of course, I am going to be upset. Webb won’t have the opportunity to rectify York’s dismal league position next weekend, as the Minstermen return to Essex to face Southend United for the second time in seven days in the Isuzu FA Trophy fifth round. “We’ve got to keep going, we have got to keep going.” Webb rallied. “We’ve definitely got enough in the squad and we’re starting to score, like the two goals tonight, but we’ve got to stop conceding soft goals. “To be honest it would be better if we had another league game so we can put it right really quick. Just to try and get the points. “If we can win on Saturday and get ourselves through to the next stages of the FA Trophy then at least it gives us a bit of momentum.”","pubDate":"2023-02-07 23:43:41","image_url":"https://www.yorkpress.co.uk/resources/images/16435184/?type=app&htype=0","source_id":"yorkpress","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Finidi hails Enyimba after El-Kanemi win","link":"https://punchng.com/finidi-hails-enyimba-after-el-kanemi-win/","keywords":["Sports"],"creator":["Anthony Nlebem"],"video_url":null,"description":"Following Enyimba’s convincing 2-0 home win over El-Kanemi Warriors on Sunday, head coach Finidi George has praised the team’s spirit for delivering an impressive performance in match-day six of the 2022/23 Nigeria Professional Football League. The Aba Elephant returned to winning ways after they lost 1-0 to Remo Stars in their matchday five fixture. A Read More","content":"Following Enyimba’s convincing 2-0 home win over El-Kanemi Warriors on Sunday, head coach Finidi George has praised the team’s spirit for delivering an impressive performance in match-day six of the 2022/23 Nigeria Professional Football League. The Aba Elephant returned to winning ways after they lost 1-0 to Remo Stars in their matchday five fixture. A brace from Chukuwemeka Obioma sealed a comfortable win as the two-time African champions comfortably dispatched the visiting Maiduguri side. Emeka who scored a brace in Enyimba’s 3-0 win over Kwara United in NPFL matchday four takes his goal tally to four. In his post-match comments, the 51-year-old tactician, who also doubles as Super Eagles assistant manager, hailed his side for keeping a clean sheet, on the way to grabbing the important win in Aba. Related News NFF yet to offer Finidi, Shorunmu contracts Eagles in rebuilding process – Finidi Seedorf relishes 1996 UCL win with Finidi, Kanu “It’s always good to score in the first half, you know in the Nigerian league, if you don’t score in the first half, the opponents will start using delay tactics or whatever can be done to achieve the result,” Finidi told Enyimba’s official website. “But when you score, they will come out more. We could have won the game with more goals, but we didn’t take our chances. “At the end of the day, we won 2-0 and I’m happy with our performance. Two goals and three points.” Enyimba with three wins, one draw and two defeats are third in Group A standings, two points behind Remo Stars, who are second on the log and six points behind Bendel Insurance, who top the Group with 16 points, winning five of their six matches. The Aba warriors will hope to continue with their winning form as they play Gombe United in an away fixture on Sunday at the 12,000-capacity Pantami Stadium.","pubDate":"2023-02-07 23:41:30","image_url":"https://cdn.punchng.com/wp-content/uploads/2022/11/20214223/FINIDI.jpg","source_id":"punchng","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"‘Spice Boys tag still follows us around’ – Robbie Fowler admits frustration in his ambition to manage in UK","link":"https://www.independent.ie/sport/soccer/spice-boys-tag-still-follows-us-around-robbie-fowler-admits-frustration-in-his-ambition-to-manage-in-uk-42332546.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"It is Robbie Fowler himself who raises it. And right at the start of our interview.","content":"It is Robbie Fowler himself who raises it. And right at the start of our interview. I liken it to the movie ,” he says of the iconic Monty Python film from the late Seventies. “They are all stood around the cross talking about names and say, ‘Brian’s a good one’. People thought, we will throw that [at us]: the ‘Spice Boys’. And it stuck.” Ah, the “Spice Boys”. The pejorative term applied to the Liverpool team of the mid-Nineties, with Fowler, Jamie Redknapp, Steve McManaman, Jason McAteer and David James at their heart. They donned their sunglasses and cream suits for the 1996 FA Cup final, but did not win. Fowler hated the label. Not least because it was never true. “The Spice Boy thing was a nickname and the fact that we never won anything played a big part in it,” he says. “Stories have grown arms and legs and I have tried to get rid of that.” Yes, he was the “joker” in the dressing-room, but only to “lighten the mood”. He could not have been a more serious footballer. ​“Nobody knows anything about me and that’s something I am quite proud of. People have this perceived idea,” Fowler says. “What I am now is probably quite boring. I understood what a dressing-room needed years ago, but people still have that idea of me as laughing and joking and not to be taken seriously. “That’s my perception … I wore my heart on my sleeve, I wanted to be better than anyone else and there were times when I got carried away on a football pitch.” Fowler is 47. He is the holder of the highest coaching badge, the UEFA Pro-Licence, and has succeeded in management in Thailand, Australia and India. He is deadly serious about being a manager. And yet he cannot get a job in his native country. Fowler’s frustration is as evident as his desire and determination, although it begs the question – given his success as a player, the wealth he has accrued, the hugely impressive Fowler Education and Football Academy he set up – why does he remain so driven? “You know why?” Fowler says. “It’s a simple answer and it’s exactly why I got into the game of football. I feel I have so much to give. I love football and it’s the only thing I want to do. Don’t get me wrong, I have been successful in other aspects of my life. But does it make me happy? Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. “I am a football man. If you sat in a room full of kids and they say, ‘I want to be a footballer’, what do they say when you ask why? They want to be rich. My answer was because I love football. It’s the same with wanting to be a coach or a manager. I want to stay in football. “I have done all my badges, I am halfway through an LMA [League Managers Association] diploma and I am forever learning and wanting to better myself and it’s exactly what I was like as a footballer. You practise because you want to get better. It’s the same as a coach. It’s massively important you keep learning.” We are talking at Melwood, Liverpool’s iconic former training ground which the club left in November 2020 and which he took over. It is where FEFA, which offers an intensive football programme with an academic curriculum for 16- to 19-year-olds, is now based. Fowler started it with his brother Scott near to where they grew up in Toxteth and is concerned that I might think we are meeting there as a deliberate ploy. “This isn’t about changing perceptions. This was always in the pipeline,” he says of the academy. “And the fact that I am at Melwood now speaks volumes of having a good relationship with the club, with the foundation. It’s not because I want to show people I am serious. It’s just what I am like. But it’s an example of showing that people don’t really know me.” For Liverpool fans, Fowler will always be “God”. He is a club legend. The England international was a sensation from the moment he scored on his debut against Fulham, in the League Cup in September 1993. In the return game, at Anfield, he scored five. He was 18. Fowler became the fastest Liverpool player in history to 100 goals; he would go on to score 183 in 369 games for the club, even though hampered by injury. “What was I like as a player?” Fowler asks rhetorically. “I worked harder than anyone. I hate using this, because it sounds egotistical, but I was always deemed as one of the most ‘naturally gifted’ strikers. Quite frankly, it annoys me because of the hours of practice I put in, the monotony of doing the repetition to make it look natural. It’s like second nature. If you are doing something all the time it makes it looks natural, but it was only because I did hours of practice. “As a kid, there was a grass pitch across the road and I was there every night practising with my right foot. I could not use my right foot and now people say they do not know which foot I favoured. And that’s a huge compliment. It showed those hours worked for me. I know if I have to do things better I will work at it and it’s the same as a manager now.” And he is fully committed to being a manager. “No one can throw at me that I’m afraid or will shirk anything,” Fowler says. In 2012, he went straight from being a player to acting head coach – because he was the most experienced – at Muangthong United in Thailand and took them to their equivalent of the FA Cup final. It gave him a taste for management, but he was determined to get his coaching badges and returned to the UK, working at Liverpool’s academy and then with clubs such as MK Dons. Fowler “held off” applying for jobs to make sure he was fully qualified. In 2019, he signed a two-year contract to take over Brisbane Roar with assistant Tony Grant, the former Everton midfielder. They hauled the club into the top four of the A-League, which was some achievement, not least because the season before they arrived Brisbane conceded 77 goals. Under Fowler it was just 24 and they were the form team when the pandemic struck. “One of the proudest things for me – and that includes all the goals I scored and trophies I won – is we had the best defensive record,” Fowler says. “A lot of people called it ‘Fowlerball’ and I was delighted with that because it showed we had a real identity. “The pandemic ruined us. I think we would have won it [the league] but sponsors were pulling out and there was no money and I told the club I needed to go home. I think I got the last flight out of Australia.” Fowler wanted to return, but Brisbane said they could not afford to keep Grant so he quit on a point of principle and then “achieved more” in India, where he was appointed manager of Super League club East Bengal in 2020. “I took a team that had just gone into the ISL – it was essentially like the owners of Accrington Stanley going into the Premier League having bought the rights but with the same players – and I had 10 days before the season started,” Fowler says before the club eventually became stymied in a dispute with their former owner. “If the opportunity comes up here, and it’s the right one, then of course I would love to take it. Chairmen and prospective owners might ask, why has he only done it abroad? But they are the only ones who have taken a chance,” Fowler explains. “I have done everything right. I have had my learning curve. I have proven to people I am willing to travel and take a chance and the big one is going out of my comfort zone. In terms of the experience of managing teams, I have covered a lot of ground and it’s now waiting for the one. I’m confident to keep going and do what I need to do.” Now he wants a job in the UK. “I am waiting for an opportunity,” he says. “I have been in touch for various people and sometimes you don’t get phone calls back, you don’t get anything back.” How does that feel? “Rude, for a start,” he says. “Maybe the fact I don’t have an agent matters. But I never had one as a player. I had an adviser, but I was comfortable doing what I was doing. I want to be the best. I want to go up the leagues. But my ego is not so big I wouldn’t go down the leagues. Just have the conversation with me,” he says. “Look at Mark Hughes and [League Two] Bradford. That makes sense because you see what they have achieved in the past. It’s no different for me. “I don’t want to put my name forward for every job that comes up as I don’t want to get stereotyped. I have to choose the right opportunity. It’s having the club with the right ambition because I think I have proven what I can do. In fact, I don’t think, I know.” Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/dee2d/42332544.ece/AUTOCROP/w1240h700/tyImages_1213659698","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Chris Armas catapulted out of his comfort zone again on his return to Old Trafford","link":"https://www.independent.ie/sport/soccer/premier-league/chris-armas-catapulted-out-of-his-comfort-zone-again-on-his-return-to-old-trafford-42332543.html","keywords":["Premier League"],"creator":null,"video_url":null,"description":"He had been compared unkindly with American comic figure Ted Lasso during his brief, unproductive time at Manchester United, but one thing Chris Armas has in common with the fictitious manager is the chance for a rerun.","content":"He had been compared unkindly with American comic figure Ted Lasso during his brief, unproductive time at Manchester United, but one thing Chris Armas has in common with the fictitious manager is the chance for a rerun. I t will come at Old Trafford tonight (8.0pm), when the 50-year-old American will be part of the interim team appointed to replace compatriot Jesse Marsch, who was dismissed on Monday with the club in 17th place in the Premier League. Armas spent five months on the coaching staff at United last season, under interim manager Ralf Rangnick; a period of dysfunction that ended with the summer arrival of Erik ten Hag. A former United States and Chicago Fire team-mate of Marsch, Armas moved to Elland Road last month and will now, barely two weeks later, be back at the scene of an unhappy period in his, and United’s, recent history. His record as a manager – his last job a spell of two wins in 15 games with Major League Soccer side FC Toronto in 2021 – raised eyebrows when he joined United’s coaching staff last season. Armas had also been blamed for the decline of New York Red Bulls after stepping up from Marsch’s assistant to head coach in 2018. Armas had been out of work for five months, after his sacking by Toronto, when he received the call from United in December 2021. Rangnick knew Armas from the latter’s time in New York – part of the Red Bull football portfolio which the German had been supervising. It did not take long for reports to surface of players’ dislike of Armas’s coaching methods, said to be focused on 11 against 11 routines, rather than more refined drills. The American could be seen on the United bench with wireless earphones in place, relaying information to Rangnick, drawing further unfortunate comparisons with Lasso, a US coach catapulted out of his comfort zone. After his departure from United, Armas was offered the chance to join Marsch at Leeds, before opting to return to the US, but in January Marsch brought him to Elland Road. That brief reunion ended after Saturday’s loss at Nottingham Forest spelt the end of Marsch’s tenure. Leeds will for now be managed by the three senior coaches on the staff – Armas, Paco Gallardo, a former reserve manager with Sevilla, and Michael Skubala, the club’s U-21 head coach. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up Lasso is about to feature in a third season on Apple TV. Whether Armas himself ever has a third season in English football is doubtful. Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/premier-league/b4d0c/42332542.ece/AUTOCROP/w1240h700/Manchester%20United%20v%20Brighton%20and%20Hove%20Albion%20-%20Premier%20League%20-%20Old%20Trafford...Manchester%20United%20assistant%20manager%20Chris%20Armas%20left%20and%20manager%20Ralf%20Rangnick%20on%20the%20touchli","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"That dream, playing for Ireland, will always be there, insists Bohemians ace Jonathan Afolabi","link":"https://www.independent.ie/sport/soccer/league-of-ireland/that-dream-playing-for-ireland-will-always-be-there-insists-bohemians-ace-jonathan-afolabi-42332565.html","keywords":["League of Ireland"],"creator":null,"video_url":null,"description":"Some of those young players who were named as Best In Class by the experts have wasted little time in the three-and-a-half years since they made their mark.","content":"Some of those young players who were named as Best In Class by the experts have wasted little time in the three-and-a-half years since they made their mark. O f the XI footballers selected by UEFA’s technical staff as the overall team of the tournament at the U-19 Euro finals in Armenia in 2019, four have gone on to play for Spain’s senior side (and Fabio Vieira has yet to win a senior cap with Portugal but is an important player for a title-chasing Arsenal this season while senior caps await the two French representatives). Ireland’s entrant on that best XI list has been treading water more than making waves, as Jonathan Afolabi is now 23 but has yet to start a top-flight game at club level and is way, way down the pecking order with his international team. But after a three-year spell spent in cold storage with Celtic, and then a promising start back home in Ireland with Bohemians which was ruined last year by injury after just one start, the striker says his ambitions and goals remain the same. “That dream, playing for Ireland, will always be there for me,” says Afolabi, taking a break from an intense pre-season training programme with Bohs ahead of the 2023 season. “I've put on that green shirt since I was a kid, playing up an age group for the U-19s, going to the Euro finals with the U19s, playing for the U21s. It will always be there for me to try and do that and I wouldn't sell myself short, I have played for Stephen Kenny before with the U-21s and he knows what I am capable of, it's up to me to show it. Everyone knows I have the ability, I just need to show that. “That’s why this season is such a big year for me with Bohemians. I'm 23 now and I have a lot of time to make up for, trying to get back to the levels I was at, to show what I can do. I think everyone knows what I can do, it's a matter of showcasing it for everyone.” The former St Joseph’s Boys man impressed for that Ireland side at the U-19 Euro finals in 2019 as Tom Mohan’s outfit reached the last four (though Afolabi missed the semi-final loss to Portugal due to suspension), even though he was a free agent, having been released by Southampton before departure. “Spain had six players in the team of the tournament like Fernan Torres. They had all these lads from clubs like Barcelona and Real Madrid, and I was the only player with ‘unattached’ beside their name,” he laughs. Hot property in the summer of 2019, Afolabi opted for a move to Celtic, high hopes of making the most of his three-year deal, but that was ill-fated and despite four loan spells in Scotland’s lower leagues, he got nowhere near the first team. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up “After two years I think I knew I wasn't going to make the first team, I had planned to get into the first team, that's why I went there but there are very high expectations at a club like Celtic, they expect to win every game and you need to be at the top of your level to even have a sniff,” he says, one of many young Irish players (Luca Connell, Lee O’Connor) who had youthful progress blocked at Celtic “I read that Celtic was bad for a lot of young Irish players, us not breaking through but there are two sides to it, if the players don't perform, they have no reason to put you into the first team. We had different pathways and we're making our way now in different ways. “I take responsibility for stuff I could have done better, been more professional, I didn't do anything wrong as such but there were steps I needed to take to improve, if I had taken all of my opportunities it could have been a different story for me at Celtic, you have to be ready when it happens.” ​“I can’t say it was three wasted years, I learned the levels you need to be at, how professional you need to be, what hard work you need to put that Celtic shirt,” added Afolabi, happy to see close friend and fellow Dubliner Bosun Lawal make his debut for the Bhoys last month. Keith Long, familiar with Afolabi from the days at nursery club Joey’s, took Afolabi to Bohs. He was upping his fitness after three sub appearances and made the most of his first start by scoring in an FAI Cup tie against Lucan United, but didn’t see out that game due to injury and didn’t play again, while Long was sacked four days later. As for Bohs’ prospects for the new season, Afolabi adds: “Everyone is fired up, new staff and new players, it should be a good season for us. We are still working on stuff but we know the way we will play, with the crop we have, we have no excuses for not being in and around the top, we have to aim for Europe.”","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/league-of-ireland/efc92/42332564.ece/AUTOCROP/w1240h700/20220826SD1038","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Easy to lose sight of the key fact that Glen did nothing wrong","link":"https://www.independent.ie/sport/gaelic-games/gaelic-football/easy-to-lose-sight-of-the-key-fact-that-glen-did-nothing-wrong-42332539.html","keywords":["Gaelic Football"],"creator":null,"video_url":null,"description":"When the GAA’s decision-making body felt it was appropriate, indeed the only course of action open to them, they ordered a replay of the All-Ireland club SFC final.","content":"When the GAA’s decision-making body felt it was appropriate, indeed the only course of action open to them, they ordered a replay of the All-Ireland club SFC final. N ot to go over it all once more, but because winners Kilmacud Crokes had an extra player on the pitch for the closing play of the final against Glen, they were in clear breach of the rules. Glen made the appeal, but the Kilmacud response was to object to this process. Much like Alan Partridge said as he was having an argument with a former teacher who struck him: “See you in Strasbourg!” Kilmacud’s response is typical of how these things play out in the GAA now, where everyone is the victim and nobody accepts responsibility. Their reaction was to produce a lengthy document that attempted to obfuscate the situation. The Central Competition Controls Committee (CCCC) heard them out patiently like a frazzled parent when their child asks them the 487th question of the day, before ordering the replay. Their response? To appeal again. Glen decided at that point that they wanted no more to do with the process and pulled out of proceedings. You cannot blame them. If an opposition team breaks the rules and has no interest in playing you to the rules of the game, then what can you do? And yet the backlash from some quarters has been astonishing, with the view that somehow Glen were culpable for the farce that has unfolded since the final. Here’s the thing – many people made mistakes on All-Ireland final day. Referee Derek O’Mahoney didn’t run the final play again, as requested by Glen management. Kilmacud should have ensured that they had the correct number of players on the pitch at all times. The only party that did not commit a mistake was Glen. They are completely innocent in all of this. Now, there are a couple of argument offshoots that are puzzling. Kilmacud’s efforts in reaching the All-Ireland final after having lost it in dramatic circumstances the previous year to Kilcoo were admirable. It showed great character. It did not, however, entitle them to have another man on the line for the final play of the 2023 game. Those arguing the numerical supremacy only happened for a short period of time also miss the point. The argument is paper-thin when you consider how Kilmacud lost the previous year’s decider — a goal in extra-time injury time scored by Jerome Johnston. How long was the ball in play for those last four minutes? It was 48 seconds, because of the usual mess that the conclusion of games has become. This irritating behaviour is almost universally accepted because our tolerance has been stretched to accommodate it. But, again, Glen did nothing wrong here either. In the days to follow, there was no appetite from the GAA to make any kind of comment. Eventually, they did — but only because Ard Stiúrthóir Tom Ryan was asked directly about it after the publication of his annual report. Ryan’s reasoning for the sudden turn of Greta Garbo syndrome was to reason that the process of all of this was key. And no, there would be no exception just because it was the All-Ireland final. People will make of that what they like. A striking element of the process was how well the wider club of Glen conducted themselves in all of this. While manager Malachy O’Rourke initially felt there would be no appeal, the players had to have their voice in all of this. Trying to marry that all in with the view of the committee, and indeed the club membership, would have been torturous. This thing was big, perhaps the biggest thing to ever affect the club. Marty Morrissey was in town looking for any locals to trade quips with for a quirky broadcast. And yet there were no leaks from the club, no tip-off to curry favour. The integrity was there. Infuriatingly so, as a journalist. Because at the back of all of this is a club that means a great deal to the people. The senior team is the icing on the cake but it would be nothing without everything else. They had indefatigable club volunteers such as Jim McGuigan, John J McKenna, John Tunney and Enda Gormley. Christmas night in their clubhouse hoovered up everyone in the surrounding parishes for festive fun. Long before any club had a minibus, Glen had one. In quieter times, games of 45 in the members’ bar helped stave off loneliness for the elderly and James Devlin’s Sunday night quizzes were another staple. In the meantime, their Lotto continues every Monday in the club rooms. The jackpot is up to £7,500.","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/gaelic-games/gaelic-football/eb5a3/42332537.ece/AUTOCROP/w1240h700/22012023POMb005975","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Manchester United facing summer dilemma over £100m Harry Kane or Victor Osimhen","link":"https://www.independent.ie/sport/soccer/manchester-united-facing-summer-dilemma-over-100m-harry-kane-or-victor-osimhen-42332534.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"Erik ten Hag is facing a £100 million (€112m) striker dilemma at Manchester United this summer as he weighs up whether to move for Tottenham’s Harry Kane or Napoli’s rising star Victor Osimhen.","content":"Erik ten Hag is facing a £100 million (€112m) striker dilemma at Manchester United this summer as he weighs up whether to move for Tottenham’s Harry Kane or Napoli’s rising star Victor Osimhen. S igning a top striker is United’s priority and Ten Hag must decide whether to go for a Premier League proven shorter-term fix in Kane – and with it a virtual guarantee of goals – or take a calculated gamble on Osimhen developing into a world-beater for years to come. Old Trafford sources have indicated that Osimhen better fits Ten Hag’s profile of wanting a more mobile striker who offers pace, strength and pressing, as well as goals. Ten Hag has watched extensive footage of Osimhen since last summer and, while there are elements of the striker’s game the Dutchman is unsure about and he has had injury problems, it has been noted that his improvement has continued to gather pace this season. Osimhen has been central to Napoli’s relentless pursuit of a first Serie A title for 33 years and scored twice in their 3-0 win over Spezia on Saturday, which took his tally to 16 in 17 league matches as they moved 13 points clear at the top. Napoli owner Aurelio De Laurentiis is a notoriously tough negotiator, though, and with Paris Saint-Germain and Chelsea also showing interest in Osimhen, the price for the Nigeria striker is likely to exceed £100m given the Italian club paid Lille a projected €80m for his services three years ago. Neither deal would be straight forward, however. Daniel Levy, the Tottenham chairman, will demand £100m from any English club for Kane should he fail to persuade the England captain – due to enter the final 12 months of his contract this summer – to sign a new deal. Levy is unlikely to make any negotiation process easy and if forced to offload Kane, his strong preference would be to sell overseas. Kane became Tottenham’s all-time top scorer on Sunday when his goal in the 1-0 win over Manchester City made it 267 for the club and saw him surpass Jimmy Greaves’ 53-year record. Spurs are hoping to convince Kane to sign a new contract but their hopes may hinge on the club winning a trophy this term and qualifying for the Champions League. Bayern Munich – who are still looking for a replacement for Robert Lewandowski – have been linked with Kane and Levy may also hope other foreign suitors come to the table if the player wants to leave. Kane is desperate to win trophies first and foremost but having become Tottenham’s record scorer, he also has his sights set on eclipsing Alan Shearer’s record of 260 Premier League goals. He is currently on 200. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up ​Ten Hag recognises Kane offers a unique skill-set, creates as well as scores as a hybrid No 9 and No 10, knows the Premier League inside out, is a strong character accustomed to dealing with pressure and has never been dependent on pace. ​United are also fully conscious of the impact Kane has had on Son Heung-min’s game and vice-versa at Spurs and believe he could be a potent foil for Marcus Rashford, his England team-mate who is in the form of his life at Old Trafford. ​ Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/ffeb5/42332533.ece/AUTOCROP/w1240h700/SOCCER-ENGLAND-TOT-MCIREPORT","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Forget Mikel Arteta v Pep Guardiola – this is a battle for the soul of the game","link":"https://www.independent.ie/sport/soccer/premier-league/forget-mikel-arteta-v-pep-guardiola-this-is-a-battle-for-the-soul-of-the-game-42332541.html","keywords":["Premier League"],"creator":null,"video_url":null,"description":"The biggest legal case in Premier League history – with huge consequences for Manchester City and English football – will be fought out by the two sides’ respective legal counsels and at least one KC who can command hourly rates comparable with the best-paid footballers.","content":"The biggest legal case in Premier League history – with huge consequences for Manchester City and English football – will be fought out by the two sides’ respective legal counsels and at least one KC who can command hourly rates comparable with the best-paid footballers. N ot quite the glamour or the theatre of Pep Guardiola v Jurgen Klopp or Erling Haaland v Virgil van Dijk, but Kevin Plumb v Simon Cliff, with some big-name KCs on both sides, is shaping up to be the clash that could define the Premier League’s future, as well as its past. Plumb is the Premier League’s general counsel and has been at the head of the legal operation that worked intensively for almost four years before announcing its 115 charges against City on Monday. Cliff advised Sheikh Mansour bin Zayed Al Nahyan’s Abu Dhabi United Group on its acquisition of City in 2008 and has since fought other financial fair play legal cases involving the club, who deny wrongdoing. At stake is the integrity of the Premier League’s rules on how much owner wealth clubs can spend, the sanctity of sponsorship contracts and compliance by clubs with rules of disclosure when it is suspected that those laws have been broken. For City, it is the battle to preserve their Premier League status and possibly the six titles they have won since 2012. Plumb, who has been at the Premier League since September 2015, has faced more than one legal crisis since the investigation into City began. First, there was the Premier League shutdown over Covid during 2020, which meant the negotiation of rebates for broadcasters and amending the profit and sustainability rules for clubs. In April 2021, the Premier League faced the breakaway of six of its members, including City, with the European Super League (ESL). In that time, the City investigation has come under scrutiny from the Premier League’s board. It began when Claudia Arney was the interim chair of the Premier League, through Gary Hoffman’s tenure and now into that of new chair Alison Brittain. The progress of the investigation has been discussed among the directors for its duration. The 19 clubs other than City in the League in any one season have been told that any lobbying on their part is unwelcome. The case against City was built by Plumb and the Premier League’s external legal firm Bird & Bird. The battle the Premier League has been through to gain full disclosure was reflected in the 115 charges brought by Plumb’s legal team against City. The Premier League has charged City under rule B.15 of its handbook, which obliges all clubs to act “with the utmost good faith”. The Premier League rules state that, by way of example, breaking that can mean for a club to “act dishonestly towards the league or another club” or “engage in conduct that is intended to circumvent these rules or obstruct the board’s investigation of compliance with them”. Plumb has already had to fight Cliff and City’s legal team in court in July 2021 to get the case to this point. That was when City tried to challenge the jurisdiction of the Premier League rules themselves. Cliff himself featured prominently in the allegations made by German magazine Der Spiegel in its original revelations about City’s finances in November 2018 that prompted the Premier League investigation. It was alleged that in seeking to find ways that City could keep pumping Sheikh Mansour’s wealth into the club without attracting sanctions from UEFA under its financial fair play regulations, Cliff invoked the Battle of Agincourt. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up The UEFA FFP (Financial Fair Play) revolution had been driven by the former France international and then UEFA president Michel Platini, prompting Cliff to call City’s attempts to circumvent it ‘Project Longbow’, Der Spiegel alleged. In an internal email, Cliff said it was appropriate because the longbow was “the weapon the English used to beat the French at Crecy and Agincourt”. ​Cliff and Plumb have recruited some expensive team-mates. The Lawyer magazine reports that Lord Pannick KC will represent City. He can earn up to £80,000 (€90,000) a day, which would be equal – pro rata – to Haaland’s City deal, believed to make him the highest-earning player at the club. City will hope Pannick will not have to be contracted for a similar five-year deal. Pannick, The Lawyer reports, will face a Blackstone Chambers colleague for the Premier League, Adam Lewis KC. Blackstone’s Andrew Hunter KC and Jason Pobjoy will appear alongside Lewis. On Pannick’s side for City will be Monckton Chambers’ Paul Harris KC. Cliff and the City legal team rolled back the UEFA sanctions that flowed from the Der Spiegel revelations. UEFA banned City from its competitions for two years and fined the club €30m for alleged FFP breaches. In 2020, the Court of Arbitration for Sport annulled the ban and reduced the fine to €10m for not co-operating with UEFA’s investigation. That represented a major victory for City, and they will now go into battle once again – with even more at stake.","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/premier-league/6da63/42332540.ece/AUTOCROP/w1240h700/GettyImages_1460059957","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Ex-Munster coach Aled Walters joins England backroom","link":"https://www.independent.ie/sport/rugby/six-nations/ex-munster-coach-aled-walters-joins-england-backroom-42332559.html","keywords":["Six Nations"],"creator":null,"video_url":null,"description":"England have recruited two more coaches from Leicester as Steve Borthwick continues to assemble his management team.","content":"England have recruited two more coaches from Leicester as Steve Borthwick continues to assemble his management team. O n the day it was confirmed Richard Cockerill would step down at the end of the Guinness Six Nations to join Montpellier, the Rugby Football Union announced the appointment of interim Tigers boss Richard Wigglesworth and Aled Walters. Wigglesworth joins as an assistant coach, most likely overseeing the attack which is currently being directed by Nick Evans. Meanwhile Walters will become head of strength and conditioning – a position similar to the one he held at Munster – in the wake of Jon Clarke’s departure. The duo will take up their posts at the end of the club season, making them available for the build-up to this autumn’s World Cup in France. Wigglesworth had only just been appointed to the interim head coach’s role with Leicester which was vacated by Borthwick when he replaced Eddie Jones in December. “Richard and Aled are two outstanding coaches in their fields who I know very well,” Borthwick said. “Richard has been a proven winner throughout his playing career and has carried this into his coaching career. “He already has international coaching experience, from the 2019 World Cup, alongside a hugely successful playing career and has amassed a wealth of knowledge. “Few people have such an in-depth, wide-ranging view and understanding of the tactical element of the game. “Aled is an excellent performance coach who had an incredible impact with the World Cup holders South Africa. “Wherever he has worked, players improve. I have never met anyone who is able to get more out of players than he does.”","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/rugby/six-nations/13ae7/42332558.ece/AUTOCROP/w1240h700/260218DG0564","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Pac-12 commissioner George Kliavkoff reportedly visiting SMU","link":"https://www.deseret.com/2023/2/7/23590297/conference-realignment-pac-12-george-kliavkoff-reportedly-visiting-smu","keywords":null,"creator":["Ryan McDonald"],"video_url":null,"description":null,"content":"It’s been pretty quiet recently on the conference realignment front, but on Tuesday evening, Action Network’s Brett McMurphy reported that those winds are still blowing. McMurphy reported that Pac-12 Conference commissioner George Kliavkoff will visit SMU on Wednesday as he eyes potential expansion candidates. McMurphy added that SMU and San Diego State “are top Pac-12 expansion candidates.” He furthermore said that the Pac-12 “needs more members & more inventory for new media rights deal, which is expected to rely heavily on digital streaming services.” Pac-12 commish George Kliavkoff visiting SMU Wednesday, sources told @ActionNetworkHQ . San Diego State & SMU are top Pac-12 expansion candidates. Pac-12 needs more members & more inventory for new media rights deal, which is expected to rely heavily on digital streaming services Adding SMU, which currently plays in the American Athletic Conference, would give the Pac-12 a market in Dallas, Texas. Adding San Diego State would give the conference a market in Southern California after the departures of UCLA and USC to the Big Ten Conference. Adding both would restore the number of conference teams to 12 once UCLA and USC leave in 2024. Last July at the Pac-12’s football media days, which came a month after UCLA and USC announced their departure for the Big Ten, Kliavkoff said the conference was “actively exploring expansion opportunities.” He listed market/media value, athletic value, academic and cultural fit, and the effects on student-athletes as criteria for an expansion candidate, adding that the goal is to get invitations to the College Football Playoff, which at the time had not yet expanded to 12 teams. The College Football Playoff will expand in the 2024 season. Kliavkoff said then that media rights negotiations would be “accelerating,” although the conference has yet to finalize any sort of deal, as McMurphy indicated.","pubDate":"2023-02-08 01:54:45","image_url":null,"source_id":"deseret","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"York City boss understands the frustrations of angry supporters","link":"https://www.yorkpress.co.uk/sport/23306379.york-city-boss-understands-frustrations-angry-supporters/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"DAVID WEBB has assured supporters that he does ‘understand their frustration’.","content":"DAVID WEBB has assured supporters that he does ‘understand their frustration’, after York City slid to 18th in the Vanarama National League table following defeat to Solihull Moors. York did originally lead through Shaq Forde, before two goals in the space of two minutes from Joe Sbarra and Andrew Dallas saw the Moors take the advantage. Olly Dyson quickly drew the scores level again, before ex-York man Mark Beck powered home a header in the 82nd minute to gift Neal Ardley’s side all three points. Supporters made their feelings towards Webb and majority owner Glen Henderson well-known, with chants for the pair to leave the club and booing that Webb couldn’t ignore. “I understand their frustrations because if any manager is in a bad situation and doesn’t win football games you are under pressure.” Webb explained. “It’s up and down the country, I get it. “So I get their frustrations, we were just disappointed we couldn’t get a win tonight because we felt coming into the first half we could do it. “We’re here to win football games and if we don’t win football games then we have got to take criticism. “It’s part of life, any football manager would tell you that and I’m no different. “The fans are going to voice their frustartions if we lose and obviously the position we are in at the minute. So of course, I am going to be upset. Webb won’t have the opportunity to rectify York’s dismal league position next weekend, as the Minstermen return to Essex to face Southend United for the second time in seven days in the Isuzu FA Trophy fifth round. “We’ve got to keep going, we have got to keep going.” Webb rallied. “We’ve definitely got enough in the squad and we’re starting to score, like the two goals tonight, but we’ve got to stop conceding soft goals. “To be honest it would be better if we had another league game so we can put it right really quick. Just to try and get the points. “If we can win on Saturday and get ourselves through to the next stages of the FA Trophy then at least it gives us a bit of momentum.”","pubDate":"2023-02-07 23:43:41","image_url":"https://www.yorkpress.co.uk/resources/images/16435184/?type=app&htype=0","source_id":"yorkpress","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Finidi hails Enyimba after El-Kanemi win","link":"https://punchng.com/finidi-hails-enyimba-after-el-kanemi-win/","keywords":["Sports"],"creator":["Anthony Nlebem"],"video_url":null,"description":"Following Enyimba’s convincing 2-0 home win over El-Kanemi Warriors on Sunday, head coach Finidi George has praised the team’s spirit for delivering an impressive performance in match-day six of the 2022/23 Nigeria Professional Football League. The Aba Elephant returned to winning ways after they lost 1-0 to Remo Stars in their matchday five fixture. A Read More","content":"Following Enyimba’s convincing 2-0 home win over El-Kanemi Warriors on Sunday, head coach Finidi George has praised the team’s spirit for delivering an impressive performance in match-day six of the 2022/23 Nigeria Professional Football League. The Aba Elephant returned to winning ways after they lost 1-0 to Remo Stars in their matchday five fixture. A brace from Chukuwemeka Obioma sealed a comfortable win as the two-time African champions comfortably dispatched the visiting Maiduguri side. Emeka who scored a brace in Enyimba’s 3-0 win over Kwara United in NPFL matchday four takes his goal tally to four. In his post-match comments, the 51-year-old tactician, who also doubles as Super Eagles assistant manager, hailed his side for keeping a clean sheet, on the way to grabbing the important win in Aba. Related News NFF yet to offer Finidi, Shorunmu contracts Eagles in rebuilding process – Finidi Seedorf relishes 1996 UCL win with Finidi, Kanu “It’s always good to score in the first half, you know in the Nigerian league, if you don’t score in the first half, the opponents will start using delay tactics or whatever can be done to achieve the result,” Finidi told Enyimba’s official website. “But when you score, they will come out more. We could have won the game with more goals, but we didn’t take our chances. “At the end of the day, we won 2-0 and I’m happy with our performance. Two goals and three points.” Enyimba with three wins, one draw and two defeats are third in Group A standings, two points behind Remo Stars, who are second on the log and six points behind Bendel Insurance, who top the Group with 16 points, winning five of their six matches. The Aba warriors will hope to continue with their winning form as they play Gombe United in an away fixture on Sunday at the 12,000-capacity Pantami Stadium.","pubDate":"2023-02-07 23:41:30","image_url":"https://cdn.punchng.com/wp-content/uploads/2022/11/20214223/FINIDI.jpg","source_id":"punchng","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"‘Spice Boys tag still follows us around’ – Robbie Fowler admits frustration in his ambition to manage in UK","link":"https://www.independent.ie/sport/soccer/spice-boys-tag-still-follows-us-around-robbie-fowler-admits-frustration-in-his-ambition-to-manage-in-uk-42332546.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"It is Robbie Fowler himself who raises it. And right at the start of our interview.","content":"It is Robbie Fowler himself who raises it. And right at the start of our interview. I liken it to the movie ,” he says of the iconic Monty Python film from the late Seventies. “They are all stood around the cross talking about names and say, ‘Brian’s a good one’. People thought, we will throw that [at us]: the ‘Spice Boys’. And it stuck.” Ah, the “Spice Boys”. The pejorative term applied to the Liverpool team of the mid-Nineties, with Fowler, Jamie Redknapp, Steve McManaman, Jason McAteer and David James at their heart. They donned their sunglasses and cream suits for the 1996 FA Cup final, but did not win. Fowler hated the label. Not least because it was never true. “The Spice Boy thing was a nickname and the fact that we never won anything played a big part in it,” he says. “Stories have grown arms and legs and I have tried to get rid of that.” Yes, he was the “joker” in the dressing-room, but only to “lighten the mood”. He could not have been a more serious footballer. ​“Nobody knows anything about me and that’s something I am quite proud of. People have this perceived idea,” Fowler says. “What I am now is probably quite boring. I understood what a dressing-room needed years ago, but people still have that idea of me as laughing and joking and not to be taken seriously. “That’s my perception … I wore my heart on my sleeve, I wanted to be better than anyone else and there were times when I got carried away on a football pitch.” Fowler is 47. He is the holder of the highest coaching badge, the UEFA Pro-Licence, and has succeeded in management in Thailand, Australia and India. He is deadly serious about being a manager. And yet he cannot get a job in his native country. Fowler’s frustration is as evident as his desire and determination, although it begs the question – given his success as a player, the wealth he has accrued, the hugely impressive Fowler Education and Football Academy he set up – why does he remain so driven? “You know why?” Fowler says. “It’s a simple answer and it’s exactly why I got into the game of football. I feel I have so much to give. I love football and it’s the only thing I want to do. Don’t get me wrong, I have been successful in other aspects of my life. But does it make me happy? Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. “I am a football man. If you sat in a room full of kids and they say, ‘I want to be a footballer’, what do they say when you ask why? They want to be rich. My answer was because I love football. It’s the same with wanting to be a coach or a manager. I want to stay in football. “I have done all my badges, I am halfway through an LMA [League Managers Association] diploma and I am forever learning and wanting to better myself and it’s exactly what I was like as a footballer. You practise because you want to get better. It’s the same as a coach. It’s massively important you keep learning.” We are talking at Melwood, Liverpool’s iconic former training ground which the club left in November 2020 and which he took over. It is where FEFA, which offers an intensive football programme with an academic curriculum for 16- to 19-year-olds, is now based. Fowler started it with his brother Scott near to where they grew up in Toxteth and is concerned that I might think we are meeting there as a deliberate ploy. “This isn’t about changing perceptions. This was always in the pipeline,” he says of the academy. “And the fact that I am at Melwood now speaks volumes of having a good relationship with the club, with the foundation. It’s not because I want to show people I am serious. It’s just what I am like. But it’s an example of showing that people don’t really know me.” For Liverpool fans, Fowler will always be “God”. He is a club legend. The England international was a sensation from the moment he scored on his debut against Fulham, in the League Cup in September 1993. In the return game, at Anfield, he scored five. He was 18. Fowler became the fastest Liverpool player in history to 100 goals; he would go on to score 183 in 369 games for the club, even though hampered by injury. “What was I like as a player?” Fowler asks rhetorically. “I worked harder than anyone. I hate using this, because it sounds egotistical, but I was always deemed as one of the most ‘naturally gifted’ strikers. Quite frankly, it annoys me because of the hours of practice I put in, the monotony of doing the repetition to make it look natural. It’s like second nature. If you are doing something all the time it makes it looks natural, but it was only because I did hours of practice. “As a kid, there was a grass pitch across the road and I was there every night practising with my right foot. I could not use my right foot and now people say they do not know which foot I favoured. And that’s a huge compliment. It showed those hours worked for me. I know if I have to do things better I will work at it and it’s the same as a manager now.” And he is fully committed to being a manager. “No one can throw at me that I’m afraid or will shirk anything,” Fowler says. In 2012, he went straight from being a player to acting head coach – because he was the most experienced – at Muangthong United in Thailand and took them to their equivalent of the FA Cup final. It gave him a taste for management, but he was determined to get his coaching badges and returned to the UK, working at Liverpool’s academy and then with clubs such as MK Dons. Fowler “held off” applying for jobs to make sure he was fully qualified. In 2019, he signed a two-year contract to take over Brisbane Roar with assistant Tony Grant, the former Everton midfielder. They hauled the club into the top four of the A-League, which was some achievement, not least because the season before they arrived Brisbane conceded 77 goals. Under Fowler it was just 24 and they were the form team when the pandemic struck. “One of the proudest things for me – and that includes all the goals I scored and trophies I won – is we had the best defensive record,” Fowler says. “A lot of people called it ‘Fowlerball’ and I was delighted with that because it showed we had a real identity. “The pandemic ruined us. I think we would have won it [the league] but sponsors were pulling out and there was no money and I told the club I needed to go home. I think I got the last flight out of Australia.” Fowler wanted to return, but Brisbane said they could not afford to keep Grant so he quit on a point of principle and then “achieved more” in India, where he was appointed manager of Super League club East Bengal in 2020. “I took a team that had just gone into the ISL – it was essentially like the owners of Accrington Stanley going into the Premier League having bought the rights but with the same players – and I had 10 days before the season started,” Fowler says before the club eventually became stymied in a dispute with their former owner. “If the opportunity comes up here, and it’s the right one, then of course I would love to take it. Chairmen and prospective owners might ask, why has he only done it abroad? But they are the only ones who have taken a chance,” Fowler explains. “I have done everything right. I have had my learning curve. I have proven to people I am willing to travel and take a chance and the big one is going out of my comfort zone. In terms of the experience of managing teams, I have covered a lot of ground and it’s now waiting for the one. I’m confident to keep going and do what I need to do.” Now he wants a job in the UK. “I am waiting for an opportunity,” he says. “I have been in touch for various people and sometimes you don’t get phone calls back, you don’t get anything back.” How does that feel? “Rude, for a start,” he says. “Maybe the fact I don’t have an agent matters. But I never had one as a player. I had an adviser, but I was comfortable doing what I was doing. I want to be the best. I want to go up the leagues. But my ego is not so big I wouldn’t go down the leagues. Just have the conversation with me,” he says. “Look at Mark Hughes and [League Two] Bradford. That makes sense because you see what they have achieved in the past. It’s no different for me. “I don’t want to put my name forward for every job that comes up as I don’t want to get stereotyped. I have to choose the right opportunity. It’s having the club with the right ambition because I think I have proven what I can do. In fact, I don’t think, I know.” Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/dee2d/42332544.ece/AUTOCROP/w1240h700/tyImages_1213659698","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Chris Armas catapulted out of his comfort zone again on his return to Old Trafford","link":"https://www.independent.ie/sport/soccer/premier-league/chris-armas-catapulted-out-of-his-comfort-zone-again-on-his-return-to-old-trafford-42332543.html","keywords":["Premier League"],"creator":null,"video_url":null,"description":"He had been compared unkindly with American comic figure Ted Lasso during his brief, unproductive time at Manchester United, but one thing Chris Armas has in common with the fictitious manager is the chance for a rerun.","content":"He had been compared unkindly with American comic figure Ted Lasso during his brief, unproductive time at Manchester United, but one thing Chris Armas has in common with the fictitious manager is the chance for a rerun. I t will come at Old Trafford tonight (8.0pm), when the 50-year-old American will be part of the interim team appointed to replace compatriot Jesse Marsch, who was dismissed on Monday with the club in 17th place in the Premier League. Armas spent five months on the coaching staff at United last season, under interim manager Ralf Rangnick; a period of dysfunction that ended with the summer arrival of Erik ten Hag. A former United States and Chicago Fire team-mate of Marsch, Armas moved to Elland Road last month and will now, barely two weeks later, be back at the scene of an unhappy period in his, and United’s, recent history. His record as a manager – his last job a spell of two wins in 15 games with Major League Soccer side FC Toronto in 2021 – raised eyebrows when he joined United’s coaching staff last season. Armas had also been blamed for the decline of New York Red Bulls after stepping up from Marsch’s assistant to head coach in 2018. Armas had been out of work for five months, after his sacking by Toronto, when he received the call from United in December 2021. Rangnick knew Armas from the latter’s time in New York – part of the Red Bull football portfolio which the German had been supervising. It did not take long for reports to surface of players’ dislike of Armas’s coaching methods, said to be focused on 11 against 11 routines, rather than more refined drills. The American could be seen on the United bench with wireless earphones in place, relaying information to Rangnick, drawing further unfortunate comparisons with Lasso, a US coach catapulted out of his comfort zone. After his departure from United, Armas was offered the chance to join Marsch at Leeds, before opting to return to the US, but in January Marsch brought him to Elland Road. That brief reunion ended after Saturday’s loss at Nottingham Forest spelt the end of Marsch’s tenure. Leeds will for now be managed by the three senior coaches on the staff – Armas, Paco Gallardo, a former reserve manager with Sevilla, and Michael Skubala, the club’s U-21 head coach. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up Lasso is about to feature in a third season on Apple TV. Whether Armas himself ever has a third season in English football is doubtful. Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/premier-league/b4d0c/42332542.ece/AUTOCROP/w1240h700/Manchester%20United%20v%20Brighton%20and%20Hove%20Albion%20-%20Premier%20League%20-%20Old%20Trafford...Manchester%20United%20assistant%20manager%20Chris%20Armas%20left%20and%20manager%20Ralf%20Rangnick%20on%20the%20touchli","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"That dream, playing for Ireland, will always be there, insists Bohemians ace Jonathan Afolabi","link":"https://www.independent.ie/sport/soccer/league-of-ireland/that-dream-playing-for-ireland-will-always-be-there-insists-bohemians-ace-jonathan-afolabi-42332565.html","keywords":["League of Ireland"],"creator":null,"video_url":null,"description":"Some of those young players who were named as Best In Class by the experts have wasted little time in the three-and-a-half years since they made their mark.","content":"Some of those young players who were named as Best In Class by the experts have wasted little time in the three-and-a-half years since they made their mark. O f the XI footballers selected by UEFA’s technical staff as the overall team of the tournament at the U-19 Euro finals in Armenia in 2019, four have gone on to play for Spain’s senior side (and Fabio Vieira has yet to win a senior cap with Portugal but is an important player for a title-chasing Arsenal this season while senior caps await the two French representatives). Ireland’s entrant on that best XI list has been treading water more than making waves, as Jonathan Afolabi is now 23 but has yet to start a top-flight game at club level and is way, way down the pecking order with his international team. But after a three-year spell spent in cold storage with Celtic, and then a promising start back home in Ireland with Bohemians which was ruined last year by injury after just one start, the striker says his ambitions and goals remain the same. “That dream, playing for Ireland, will always be there for me,” says Afolabi, taking a break from an intense pre-season training programme with Bohs ahead of the 2023 season. “I've put on that green shirt since I was a kid, playing up an age group for the U-19s, going to the Euro finals with the U19s, playing for the U21s. It will always be there for me to try and do that and I wouldn't sell myself short, I have played for Stephen Kenny before with the U-21s and he knows what I am capable of, it's up to me to show it. Everyone knows I have the ability, I just need to show that. “That’s why this season is such a big year for me with Bohemians. I'm 23 now and I have a lot of time to make up for, trying to get back to the levels I was at, to show what I can do. I think everyone knows what I can do, it's a matter of showcasing it for everyone.” The former St Joseph’s Boys man impressed for that Ireland side at the U-19 Euro finals in 2019 as Tom Mohan’s outfit reached the last four (though Afolabi missed the semi-final loss to Portugal due to suspension), even though he was a free agent, having been released by Southampton before departure. “Spain had six players in the team of the tournament like Fernan Torres. They had all these lads from clubs like Barcelona and Real Madrid, and I was the only player with ‘unattached’ beside their name,” he laughs. Hot property in the summer of 2019, Afolabi opted for a move to Celtic, high hopes of making the most of his three-year deal, but that was ill-fated and despite four loan spells in Scotland’s lower leagues, he got nowhere near the first team. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up “After two years I think I knew I wasn't going to make the first team, I had planned to get into the first team, that's why I went there but there are very high expectations at a club like Celtic, they expect to win every game and you need to be at the top of your level to even have a sniff,” he says, one of many young Irish players (Luca Connell, Lee O’Connor) who had youthful progress blocked at Celtic “I read that Celtic was bad for a lot of young Irish players, us not breaking through but there are two sides to it, if the players don't perform, they have no reason to put you into the first team. We had different pathways and we're making our way now in different ways. “I take responsibility for stuff I could have done better, been more professional, I didn't do anything wrong as such but there were steps I needed to take to improve, if I had taken all of my opportunities it could have been a different story for me at Celtic, you have to be ready when it happens.” ​“I can’t say it was three wasted years, I learned the levels you need to be at, how professional you need to be, what hard work you need to put that Celtic shirt,” added Afolabi, happy to see close friend and fellow Dubliner Bosun Lawal make his debut for the Bhoys last month. Keith Long, familiar with Afolabi from the days at nursery club Joey’s, took Afolabi to Bohs. He was upping his fitness after three sub appearances and made the most of his first start by scoring in an FAI Cup tie against Lucan United, but didn’t see out that game due to injury and didn’t play again, while Long was sacked four days later. As for Bohs’ prospects for the new season, Afolabi adds: “Everyone is fired up, new staff and new players, it should be a good season for us. We are still working on stuff but we know the way we will play, with the crop we have, we have no excuses for not being in and around the top, we have to aim for Europe.”","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/league-of-ireland/efc92/42332564.ece/AUTOCROP/w1240h700/20220826SD1038","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Easy to lose sight of the key fact that Glen did nothing wrong","link":"https://www.independent.ie/sport/gaelic-games/gaelic-football/easy-to-lose-sight-of-the-key-fact-that-glen-did-nothing-wrong-42332539.html","keywords":["Gaelic Football"],"creator":null,"video_url":null,"description":"When the GAA’s decision-making body felt it was appropriate, indeed the only course of action open to them, they ordered a replay of the All-Ireland club SFC final.","content":"When the GAA’s decision-making body felt it was appropriate, indeed the only course of action open to them, they ordered a replay of the All-Ireland club SFC final. N ot to go over it all once more, but because winners Kilmacud Crokes had an extra player on the pitch for the closing play of the final against Glen, they were in clear breach of the rules. Glen made the appeal, but the Kilmacud response was to object to this process. Much like Alan Partridge said as he was having an argument with a former teacher who struck him: “See you in Strasbourg!” Kilmacud’s response is typical of how these things play out in the GAA now, where everyone is the victim and nobody accepts responsibility. Their reaction was to produce a lengthy document that attempted to obfuscate the situation. The Central Competition Controls Committee (CCCC) heard them out patiently like a frazzled parent when their child asks them the 487th question of the day, before ordering the replay. Their response? To appeal again. Glen decided at that point that they wanted no more to do with the process and pulled out of proceedings. You cannot blame them. If an opposition team breaks the rules and has no interest in playing you to the rules of the game, then what can you do? And yet the backlash from some quarters has been astonishing, with the view that somehow Glen were culpable for the farce that has unfolded since the final. Here’s the thing – many people made mistakes on All-Ireland final day. Referee Derek O’Mahoney didn’t run the final play again, as requested by Glen management. Kilmacud should have ensured that they had the correct number of players on the pitch at all times. The only party that did not commit a mistake was Glen. They are completely innocent in all of this. Now, there are a couple of argument offshoots that are puzzling. Kilmacud’s efforts in reaching the All-Ireland final after having lost it in dramatic circumstances the previous year to Kilcoo were admirable. It showed great character. It did not, however, entitle them to have another man on the line for the final play of the 2023 game. Those arguing the numerical supremacy only happened for a short period of time also miss the point. The argument is paper-thin when you consider how Kilmacud lost the previous year’s decider — a goal in extra-time injury time scored by Jerome Johnston. How long was the ball in play for those last four minutes? It was 48 seconds, because of the usual mess that the conclusion of games has become. This irritating behaviour is almost universally accepted because our tolerance has been stretched to accommodate it. But, again, Glen did nothing wrong here either. In the days to follow, there was no appetite from the GAA to make any kind of comment. Eventually, they did — but only because Ard Stiúrthóir Tom Ryan was asked directly about it after the publication of his annual report. Ryan’s reasoning for the sudden turn of Greta Garbo syndrome was to reason that the process of all of this was key. And no, there would be no exception just because it was the All-Ireland final. People will make of that what they like. A striking element of the process was how well the wider club of Glen conducted themselves in all of this. While manager Malachy O’Rourke initially felt there would be no appeal, the players had to have their voice in all of this. Trying to marry that all in with the view of the committee, and indeed the club membership, would have been torturous. This thing was big, perhaps the biggest thing to ever affect the club. Marty Morrissey was in town looking for any locals to trade quips with for a quirky broadcast. And yet there were no leaks from the club, no tip-off to curry favour. The integrity was there. Infuriatingly so, as a journalist. Because at the back of all of this is a club that means a great deal to the people. The senior team is the icing on the cake but it would be nothing without everything else. They had indefatigable club volunteers such as Jim McGuigan, John J McKenna, John Tunney and Enda Gormley. Christmas night in their clubhouse hoovered up everyone in the surrounding parishes for festive fun. Long before any club had a minibus, Glen had one. In quieter times, games of 45 in the members’ bar helped stave off loneliness for the elderly and James Devlin’s Sunday night quizzes were another staple. In the meantime, their Lotto continues every Monday in the club rooms. The jackpot is up to £7,500.","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/gaelic-games/gaelic-football/eb5a3/42332537.ece/AUTOCROP/w1240h700/22012023POMb005975","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Manchester United facing summer dilemma over £100m Harry Kane or Victor Osimhen","link":"https://www.independent.ie/sport/soccer/manchester-united-facing-summer-dilemma-over-100m-harry-kane-or-victor-osimhen-42332534.html","keywords":["Soccer"],"creator":null,"video_url":null,"description":"Erik ten Hag is facing a £100 million (€112m) striker dilemma at Manchester United this summer as he weighs up whether to move for Tottenham’s Harry Kane or Napoli’s rising star Victor Osimhen.","content":"Erik ten Hag is facing a £100 million (€112m) striker dilemma at Manchester United this summer as he weighs up whether to move for Tottenham’s Harry Kane or Napoli’s rising star Victor Osimhen. S igning a top striker is United’s priority and Ten Hag must decide whether to go for a Premier League proven shorter-term fix in Kane – and with it a virtual guarantee of goals – or take a calculated gamble on Osimhen developing into a world-beater for years to come. Old Trafford sources have indicated that Osimhen better fits Ten Hag’s profile of wanting a more mobile striker who offers pace, strength and pressing, as well as goals. Ten Hag has watched extensive footage of Osimhen since last summer and, while there are elements of the striker’s game the Dutchman is unsure about and he has had injury problems, it has been noted that his improvement has continued to gather pace this season. Osimhen has been central to Napoli’s relentless pursuit of a first Serie A title for 33 years and scored twice in their 3-0 win over Spezia on Saturday, which took his tally to 16 in 17 league matches as they moved 13 points clear at the top. Napoli owner Aurelio De Laurentiis is a notoriously tough negotiator, though, and with Paris Saint-Germain and Chelsea also showing interest in Osimhen, the price for the Nigeria striker is likely to exceed £100m given the Italian club paid Lille a projected €80m for his services three years ago. Neither deal would be straight forward, however. Daniel Levy, the Tottenham chairman, will demand £100m from any English club for Kane should he fail to persuade the England captain – due to enter the final 12 months of his contract this summer – to sign a new deal. Levy is unlikely to make any negotiation process easy and if forced to offload Kane, his strong preference would be to sell overseas. Kane became Tottenham’s all-time top scorer on Sunday when his goal in the 1-0 win over Manchester City made it 267 for the club and saw him surpass Jimmy Greaves’ 53-year record. Spurs are hoping to convince Kane to sign a new contract but their hopes may hinge on the club winning a trophy this term and qualifying for the Champions League. Bayern Munich – who are still looking for a replacement for Robert Lewandowski – have been linked with Kane and Levy may also hope other foreign suitors come to the table if the player wants to leave. Kane is desperate to win trophies first and foremost but having become Tottenham’s record scorer, he also has his sights set on eclipsing Alan Shearer’s record of 260 Premier League goals. He is currently on 200. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up ​Ten Hag recognises Kane offers a unique skill-set, creates as well as scores as a hybrid No 9 and No 10, knows the Premier League inside out, is a strong character accustomed to dealing with pressure and has never been dependent on pace. ​United are also fully conscious of the impact Kane has had on Son Heung-min’s game and vice-versa at Spurs and believe he could be a potent foil for Marcus Rashford, his England team-mate who is in the form of his life at Old Trafford. ​ Telegraph Media Group Limited [2023]","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/ffeb5/42332533.ece/AUTOCROP/w1240h700/SOCCER-ENGLAND-TOT-MCIREPORT","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Forget Mikel Arteta v Pep Guardiola – this is a battle for the soul of the game","link":"https://www.independent.ie/sport/soccer/premier-league/forget-mikel-arteta-v-pep-guardiola-this-is-a-battle-for-the-soul-of-the-game-42332541.html","keywords":["Premier League"],"creator":null,"video_url":null,"description":"The biggest legal case in Premier League history – with huge consequences for Manchester City and English football – will be fought out by the two sides’ respective legal counsels and at least one KC who can command hourly rates comparable with the best-paid footballers.","content":"The biggest legal case in Premier League history – with huge consequences for Manchester City and English football – will be fought out by the two sides’ respective legal counsels and at least one KC who can command hourly rates comparable with the best-paid footballers. N ot quite the glamour or the theatre of Pep Guardiola v Jurgen Klopp or Erling Haaland v Virgil van Dijk, but Kevin Plumb v Simon Cliff, with some big-name KCs on both sides, is shaping up to be the clash that could define the Premier League’s future, as well as its past. Plumb is the Premier League’s general counsel and has been at the head of the legal operation that worked intensively for almost four years before announcing its 115 charges against City on Monday. Cliff advised Sheikh Mansour bin Zayed Al Nahyan’s Abu Dhabi United Group on its acquisition of City in 2008 and has since fought other financial fair play legal cases involving the club, who deny wrongdoing. At stake is the integrity of the Premier League’s rules on how much owner wealth clubs can spend, the sanctity of sponsorship contracts and compliance by clubs with rules of disclosure when it is suspected that those laws have been broken. For City, it is the battle to preserve their Premier League status and possibly the six titles they have won since 2012. Plumb, who has been at the Premier League since September 2015, has faced more than one legal crisis since the investigation into City began. First, there was the Premier League shutdown over Covid during 2020, which meant the negotiation of rebates for broadcasters and amending the profit and sustainability rules for clubs. In April 2021, the Premier League faced the breakaway of six of its members, including City, with the European Super League (ESL). In that time, the City investigation has come under scrutiny from the Premier League’s board. It began when Claudia Arney was the interim chair of the Premier League, through Gary Hoffman’s tenure and now into that of new chair Alison Brittain. The progress of the investigation has been discussed among the directors for its duration. The 19 clubs other than City in the League in any one season have been told that any lobbying on their part is unwelcome. The case against City was built by Plumb and the Premier League’s external legal firm Bird & Bird. The battle the Premier League has been through to gain full disclosure was reflected in the 115 charges brought by Plumb’s legal team against City. The Premier League has charged City under rule B.15 of its handbook, which obliges all clubs to act “with the utmost good faith”. The Premier League rules state that, by way of example, breaking that can mean for a club to “act dishonestly towards the league or another club” or “engage in conduct that is intended to circumvent these rules or obstruct the board’s investigation of compliance with them”. Plumb has already had to fight Cliff and City’s legal team in court in July 2021 to get the case to this point. That was when City tried to challenge the jurisdiction of the Premier League rules themselves. Cliff himself featured prominently in the allegations made by German magazine Der Spiegel in its original revelations about City’s finances in November 2018 that prompted the Premier League investigation. It was alleged that in seeking to find ways that City could keep pumping Sheikh Mansour’s wealth into the club without attracting sanctions from UEFA under its financial fair play regulations, Cliff invoked the Battle of Agincourt. The Halfway Line Newsletter Get the lowdown on the Irish football scene with our soccer correspondent Daniel McDonnell and expert team of writers with our free weekly newsletter. Enter email address This field is required Sign Up The UEFA FFP (Financial Fair Play) revolution had been driven by the former France international and then UEFA president Michel Platini, prompting Cliff to call City’s attempts to circumvent it ‘Project Longbow’, Der Spiegel alleged. In an internal email, Cliff said it was appropriate because the longbow was “the weapon the English used to beat the French at Crecy and Agincourt”. ​Cliff and Plumb have recruited some expensive team-mates. The Lawyer magazine reports that Lord Pannick KC will represent City. He can earn up to £80,000 (€90,000) a day, which would be equal – pro rata – to Haaland’s City deal, believed to make him the highest-earning player at the club. City will hope Pannick will not have to be contracted for a similar five-year deal. Pannick, The Lawyer reports, will face a Blackstone Chambers colleague for the Premier League, Adam Lewis KC. Blackstone’s Andrew Hunter KC and Jason Pobjoy will appear alongside Lewis. On Pannick’s side for City will be Monckton Chambers’ Paul Harris KC. Cliff and the City legal team rolled back the UEFA sanctions that flowed from the Der Spiegel revelations. UEFA banned City from its competitions for two years and fined the club €30m for alleged FFP breaches. In 2020, the Court of Arbitration for Sport annulled the ban and reduced the fine to €10m for not co-operating with UEFA’s investigation. That represented a major victory for City, and they will now go into battle once again – with even more at stake.","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/soccer/premier-league/6da63/42332540.ece/AUTOCROP/w1240h700/GettyImages_1460059957","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Ex-Munster coach Aled Walters joins England backroom","link":"https://www.independent.ie/sport/rugby/six-nations/ex-munster-coach-aled-walters-joins-england-backroom-42332559.html","keywords":["Six Nations"],"creator":null,"video_url":null,"description":"England have recruited two more coaches from Leicester as Steve Borthwick continues to assemble his management team.","content":"England have recruited two more coaches from Leicester as Steve Borthwick continues to assemble his management team. O n the day it was confirmed Richard Cockerill would step down at the end of the Guinness Six Nations to join Montpellier, the Rugby Football Union announced the appointment of interim Tigers boss Richard Wigglesworth and Aled Walters. Wigglesworth joins as an assistant coach, most likely overseeing the attack which is currently being directed by Nick Evans. Meanwhile Walters will become head of strength and conditioning – a position similar to the one he held at Munster – in the wake of Jon Clarke’s departure. The duo will take up their posts at the end of the club season, making them available for the build-up to this autumn’s World Cup in France. Wigglesworth had only just been appointed to the interim head coach’s role with Leicester which was vacated by Borthwick when he replaced Eddie Jones in December. “Richard and Aled are two outstanding coaches in their fields who I know very well,” Borthwick said. “Richard has been a proven winner throughout his playing career and has carried this into his coaching career. “He already has international coaching experience, from the 2019 World Cup, alongside a hugely successful playing career and has amassed a wealth of knowledge. “Few people have such an in-depth, wide-ranging view and understanding of the tactical element of the game. “Aled is an excellent performance coach who had an incredible impact with the World Cup holders South Africa. “Wherever he has worked, players improve. I have never met anyone who is able to get more out of players than he does.”","pubDate":"2023-02-08 02:30:00","image_url":"https://www.independent.ie/sport/rugby/six-nations/13ae7/42332558.ece/AUTOCROP/w1240h700/260218DG0564","source_id":"independent","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Pac-12 commissioner George Kliavkoff reportedly visiting SMU","link":"https://www.deseret.com/2023/2/7/23590297/conference-realignment-pac-12-george-kliavkoff-reportedly-visiting-smu","keywords":null,"creator":["Ryan McDonald"],"video_url":null,"description":null,"content":"It’s been pretty quiet recently on the conference realignment front, but on Tuesday evening, Action Network’s Brett McMurphy reported that those winds are still blowing. McMurphy reported that Pac-12 Conference commissioner George Kliavkoff will visit SMU on Wednesday as he eyes potential expansion candidates. McMurphy added that SMU and San Diego State “are top Pac-12 expansion candidates.” He furthermore said that the Pac-12 “needs more members & more inventory for new media rights deal, which is expected to rely heavily on digital streaming services.” Pac-12 commish George Kliavkoff visiting SMU Wednesday, sources told @ActionNetworkHQ . San Diego State & SMU are top Pac-12 expansion candidates. Pac-12 needs more members & more inventory for new media rights deal, which is expected to rely heavily on digital streaming services Adding SMU, which currently plays in the American Athletic Conference, would give the Pac-12 a market in Dallas, Texas. Adding San Diego State would give the conference a market in Southern California after the departures of UCLA and USC to the Big Ten Conference. Adding both would restore the number of conference teams to 12 once UCLA and USC leave in 2024. Last July at the Pac-12’s football media days, which came a month after UCLA and USC announced their departure for the Big Ten, Kliavkoff said the conference was “actively exploring expansion opportunities.” He listed market/media value, athletic value, academic and cultural fit, and the effects on student-athletes as criteria for an expansion candidate, adding that the goal is to get invitations to the College Football Playoff, which at the time had not yet expanded to 12 teams. The College Football Playoff will expand in the 2024 season. Kliavkoff said then that media rights negotiations would be “accelerating,” although the conference has yet to finalize any sort of deal, as McMurphy indicated.","pubDate":"2023-02-08 01:54:45","image_url":null,"source_id":"deseret","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"York City boss understands the frustrations of angry supporters","link":"https://www.yorkpress.co.uk/sport/23306379.york-city-boss-understands-frustrations-angry-supporters/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"DAVID WEBB has assured supporters that he does ‘understand their frustration’.","content":"DAVID WEBB has assured supporters that he does ‘understand their frustration’, after York City slid to 18th in the Vanarama National League table following defeat to Solihull Moors. York did originally lead through Shaq Forde, before two goals in the space of two minutes from Joe Sbarra and Andrew Dallas saw the Moors take the advantage. Olly Dyson quickly drew the scores level again, before ex-York man Mark Beck powered home a header in the 82nd minute to gift Neal Ardley’s side all three points. Supporters made their feelings towards Webb and majority owner Glen Henderson well-known, with chants for the pair to leave the club and booing that Webb couldn’t ignore. “I understand their frustrations because if any manager is in a bad situation and doesn’t win football games you are under pressure.” Webb explained. “It’s up and down the country, I get it. “So I get their frustrations, we were just disappointed we couldn’t get a win tonight because we felt coming into the first half we could do it. “We’re here to win football games and if we don’t win football games then we have got to take criticism. “It’s part of life, any football manager would tell you that and I’m no different. “The fans are going to voice their frustartions if we lose and obviously the position we are in at the minute. So of course, I am going to be upset. Webb won’t have the opportunity to rectify York’s dismal league position next weekend, as the Minstermen return to Essex to face Southend United for the second time in seven days in the Isuzu FA Trophy fifth round. “We’ve got to keep going, we have got to keep going.” Webb rallied. “We’ve definitely got enough in the squad and we’re starting to score, like the two goals tonight, but we’ve got to stop conceding soft goals. “To be honest it would be better if we had another league game so we can put it right really quick. Just to try and get the points. “If we can win on Saturday and get ourselves through to the next stages of the FA Trophy then at least it gives us a bit of momentum.”","pubDate":"2023-02-07 23:43:41","image_url":"https://www.yorkpress.co.uk/resources/images/16435184/?type=app&htype=0","source_id":"yorkpress","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Finidi hails Enyimba after El-Kanemi win","link":"https://punchng.com/finidi-hails-enyimba-after-el-kanemi-win/","keywords":["Sports"],"creator":["Anthony Nlebem"],"video_url":null,"description":"Following Enyimba’s convincing 2-0 home win over El-Kanemi Warriors on Sunday, head coach Finidi George has praised the team’s spirit for delivering an impressive performance in match-day six of the 2022/23 Nigeria Professional Football League. The Aba Elephant returned to winning ways after they lost 1-0 to Remo Stars in their matchday five fixture. A Read More","content":"Following Enyimba’s convincing 2-0 home win over El-Kanemi Warriors on Sunday, head coach Finidi George has praised the team’s spirit for delivering an impressive performance in match-day six of the 2022/23 Nigeria Professional Football League. The Aba Elephant returned to winning ways after they lost 1-0 to Remo Stars in their matchday five fixture. A brace from Chukuwemeka Obioma sealed a comfortable win as the two-time African champions comfortably dispatched the visiting Maiduguri side. Emeka who scored a brace in Enyimba’s 3-0 win over Kwara United in NPFL matchday four takes his goal tally to four. In his post-match comments, the 51-year-old tactician, who also doubles as Super Eagles assistant manager, hailed his side for keeping a clean sheet, on the way to grabbing the important win in Aba. Related News NFF yet to offer Finidi, Shorunmu contracts Eagles in rebuilding process – Finidi Seedorf relishes 1996 UCL win with Finidi, Kanu “It’s always good to score in the first half, you know in the Nigerian league, if you don’t score in the first half, the opponents will start using delay tactics or whatever can be done to achieve the result,” Finidi told Enyimba’s official website. “But when you score, they will come out more. We could have won the game with more goals, but we didn’t take our chances. “At the end of the day, we won 2-0 and I’m happy with our performance. Two goals and three points.” Enyimba with three wins, one draw and two defeats are third in Group A standings, two points behind Remo Stars, who are second on the log and six points behind Bendel Insurance, who top the Group with 16 points, winning five of their six matches. The Aba warriors will hope to continue with their winning form as they play Gombe United in an away fixture on Sunday at the 12,000-capacity Pantami Stadium.","pubDate":"2023-02-07 23:41:30","image_url":"https://cdn.punchng.com/wp-content/uploads/2022/11/20214223/FINIDI.jpg","source_id":"punchng","category":["sports"],"country":["nigeria"],"language":"english"}]}