{"newsArray":[{"title":"Wellington Phoenix lose another lead against lowly Melbourne Victory in A-League","link":"https://www.nzherald.co.nz/sport/wellington-phoenix-lose-another-lead-against-lowly-melbourne-victory-in-a-league/PUWLHN3PDBCTROWOKA2YATLYQA/","keywords":null,"creator":null,"video_url":null,"description":"The Wellington Phoenix have once more squandered a lead.","content":"The Wellington Phoenix have once more squandered a lead to lose to the lowly Melbourne Victory. Oskar Zawada put his side ahead midway through the first half at Sky Stadium but the Phoenix spurned chances for a second goal and eventually fell to a potentially pivotal 2-1 defeat. While fifth-placed Wellington still have a bit of breathing room in their bid to qualify for the six-team playoffs, the dropped points could prove costly in their quest to host finals football. If they are indeed forced on the road, Ufuk Talay’s side will rue their two clashes against the Victory. Advertisement Advertise with NZME. Just as in February, Melbourne entered today’s match on the bottom rung of the A-League Men ladder. And after an early Zawada strike was also overturned across the Tasman, the Phoenix were helpless to prevent history repeating in Wellington. The Polish striker needed 25 minutes to rediscover his scoring touch after missing the 5-1 thrashing by Adelaide for the birth of his child. Zawada pounced on a defensive mistake from Damien Da Silva to lob goalkeeper Paul Izzo, finding the net in his fifth straight game while taking his season total to 13. But after Izzo produced a couple of crucial saves to deny Yan Sasse and Steven Ugarkovic, Melbourne made their opponents pay for lapses in set-piece concentration. First, the Phoenix failed to track Bruno Fornaroli’s run and allowed him to nod in an equaliser on the hour mark. Then, Da Silva atoned for his error by heading home another corner in the 76th minute, leaving captain Alex Rufer frustrated. Advertisement Advertise with NZME. “We were poor from set pieces and they punished us,” he told Sky Sport. “We switched off. It’s not an individual; it’s collectively. “We need to be better from those moments and we let ourselves down massively.” Rufer remained hopeful his side could earn the top-four finish they required to host a playoff game, despite having to head across the Tasman for three of their final four matches. “It’s a big blow, but we’ve got four games left,” he said. “We know where we are. Yes, it’s disappointing, but we go again. We believe in ourselves, we’re a good team, and it’s down to us now.” The Phoenix women, meanwhile, have earned the wooden spoon for the second straight season, with a 99th-minute equaliser against Melbourne Victory not enough to climb out of 11th place. Wellington required a win over the defending champions to have any hope of avoiding that unwanted prize, but those chances were grim when the visitors scored two superb goals in the first 26 minutes. Alana Murphy put Melbourne in front by putting a free kick in the top corner from the edge of the box, before Melina Ayres turned Marisa van der Meer and fired high into the net from a tight angle. The Phoenix pulled back a goal with 15 minutes to play when Victory custodian Casey Dumont couldn’t clean up trouble outside the area, leaving her goal unguarded for Ava Pritchard to make it 2-1. Grace Wisnewski then managed to bundle home a leveller with virtually the last kick of the game, ending the campaign on a positive note. Having finished their inaugural season with two wins, seven points and a goal difference of minus-23, the Phoenix at least improved on each count, collecting three wins, 13 points and finishing on minus-10. Advertisement Advertise with NZME. But with the final position the same, Wellington will have to content themselves by playing potential spoiler for Melbourne, leaving the Victory relying on other results to remain in the top four and sneak into the semifinals. Melbourne Victory men 2 (Bruno Fornaroli 58, Damien Da Silva 76) Wellington Phoenix men 1 (Oskar Zawada 25) Wellington Phoenix women 2 (Ava Pritchard 75, Grace Wisnewski 90+9) Melbourne Victory women 2 (Alana Murphy 4, Melina Ayres 26) Advertisement Advertise with NZME. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-04-01 05:45:00","image_url":"https://www.nzherald.co.nz/resizer/eWafAgks8LBkrtju-XdOUs_YbZ4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/BHIMCALVLJAXDGVCJTDR5DCQJI.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Fútbol: ranking de los 10 mejores jugadores de la historia del deporte rey","link":"https://www.eltiempo.com/deportes/futbol-internacional/futbol-los-10-mejores-jugadores-de-todos-los-tiempos-755610","keywords":["Fútbol Internacional"],"creator":null,"video_url":null,"description":"La historia del fútbol ha tenido verdaderos campeones que maracron época ¿quiénes son?","content":"Es muy difícil hablar de los jugadores que han marcado una época en el fútbol mundial, son muchos los futbolistas que deleitaron a los aficionados del mundo y se hicieron un nombre en los libros dorados del deporte rey. Acá rememoramos algunos que pasaron a la historia. (Lea aquí: Ni Maradona, ni Pelé: polémica clasificación de los mejores de la historia ) Lionel Messi junto a Rodrigo de Paul con la Copa del Mundo en Qatar 2022. Instagram: rodridepaul Sin duda alguna el nombre del astro argentino debía estar en el ranking de los mejores jugadores del fútbol mundial. En las últimas dos décadas Lionel ha logrado batir todos los récords posibles y ha maravillado a los hinchas con jugadas imposibles de realizar. Messi fue clave en la mejor etapa en la historia del Barcelona de España en donde conquistó todo lo que un jugador podía ganar: 10 ligas, 8 supercopas, 3 Mundiales de Clubes, 7 Copas del Rey, 4 Champions y 3 Supercopas de Europa. El eterno 10 ha dejado su huella tras ganar 6 Balones de Oro, una Copa América, 1 Finallissima y la tan anhelada Copa del Mundo de la FIFA que logró en Qatar 2022 con la Selección Argentina. El portugués ha marcado una era inolvidable junto con Messi, el luso ha conquistado títulos en Inglaterra, Portugal, España e Italia, dejando su marca en cada uno de los clubes donde jugó. CR7 tiene en sus vitrinas 5 Balones de Oro, 5 Champions, siendo el máximo goleador de la competición. Pero los títulos no paran ahí, Cristiano Ronaldo posee un palmarés único con 7 títulos de liga, 4 copas, 7 supercopas, 4 Mundiales de Clubes y una Eurocopa con la Selección de Portugal. Cristiano Ronaldo acumula cinco trofeos del Balón de Oro. EFE La ‘sonrisa del fútbol’ descrestó con sus jugadas a la generación de principios del Siglo XXI, ‘Dinho’ asombró al mundo del fútbol con pura magia y es de los pocos jugadores en conquistar una Champions League, un Mundial de la FIFA, un Balón de Oro, una Copa América y una Copa Libertadores. Fue Ronaldinho en el 2005 el que ganó las dos distinciones. El Balon de Oro de 'France Football' y Mejor Jugador Mundial de la Fifa. Archivo / EL TIEMPO El ‘Pelusa’ no podía faltar en el ranking debido a sus hazañas tanto dentro como fuera del campo, el ‘10’ se convirtió en la bandera de la Selección Argentina y fue clave para que la albiceleste conquistara el Mundial de México 86. Diego Armando Maradona también pasó a la historia en Italia luego de llevar a un equipo como el Napoli a levantar 2 títulos de la Liga italiana y competirle mano a mano a los colosos del norte como Milan Inter y Juventus. En Nápoles el argentino es considerado un dios. Maradona EFE Pelé Archivo / EL TIEMPO El astro brasileño cambió la historia de la Selección de Brasil y fue el responsable de que el pueblo de su país olvidara el famoso Maracanazo. Pelé es la máxima leyenda de su nación tras levantar 3 títulos de la Copa del Mundo (1958, 1962 y 1970). Además, el eterno 10 logró triunfar con la casaca del Santos, club de sus amores con el que ganó en todas las competencias donde jugó. Según los libros del fútbol, ‘O rei’ es el máximo artillero del deporte con 1282 tantos. El ‘Gordo’ Ronaldo es sin duda alguna el número 9 más intimidante del mundo, su potencia, sus arranques y sus goles lo convirtieron en el mejor del mundo en 1997 y 2002 donde ganó sus dos Balones de Oro. (También le puede interesar: Luis Díaz, entre los 10 jugadores más caros del mundo, por millonaria cifra ) Ronaldo Nazario tiene en sus vitrinas dos Copas del Mundo, siendo clave en la conquistada ante Alemania en el 2002. Además, es el único jugador en la historia en jugar en el Real Madrid, el Barcelona, el Milan y el Inter, equipos con rivales históricas y donde él tiene un cariño y recuerdo especial. El holandés, mítico jugador de Ajax y Barcelona, fue subcampeón con su selección en el Mundial de 1974, el cual se disputó en Alemania Occidental. Archivo El neerlandés es el responsable de cambiar la historia del fútbol desplegando un fútbol total jamás visto en el mundo durante la década de los 70. Johan Cruyff es el símbolo de aquella Selección de Holanda que quedó en la historia como la Naranja Mecánica. Es la elegancia y la clase del fútbol, el francés maravilló con sus ‘pasos de baile’ dentro del terreno de juego a los aficionados que lo vieron levantar la Copa del Mundo con su país en 1998. En cuanto a clubes, Zinedine Zidane es leyenda indiscutida de la Juventus de Italia y el Real Madrid , club con el que se consagró en la Champions League. Zinedine Zidane como entrenador del Real Madrid. EFE El ‘Káiser’ es sin duda uno de los mejores jugadores de la historia de Alemania, su estilo de juego en la defensa le permitieron a los teutones levantar la Copa del Mundo de 1974. En su país es el máximo ídolo del Bayern Mínich. El histórico delantero argentino del Real Madrid, Alfredo Di Stéfano, protagonizó en 1956 con la película 'La Saeta Rubia' en la que se interpretó a sí mismo. EFE El colombo-argentino se convirtió en el primer futbolista en ser estrella mundial gracias a su estilo único de juego. Di Stéfano marcó una historia imborrable en Millonarios Y Real Madrid en la década de los 50. Con el conjunto blanco, el histórico jugador logró ganar 5 Copa de Europa consecutivas, todo un récord el cual va a ser muy difícil de superar. Falcao García, papá por quinta vez: 'El amor se multiplica y nosotros también' Deportes Tolima: los récords que marcaron su historia en el fútbol colombiano Luis Díaz: ‘baldado de agua fría’ tras su regreso a entrenamientos en Liverpool Harold Yepes REDACCIÓN ÚLTIMAS NOTICIAS","pubDate":"2023-04-01 00:04:12","image_url":null,"source_id":"eltiempocl","category":["sports"],"country":["singapore"],"language":"spanish"},{"title":"Boos or no Boos, Bowes is an all-in Cat before Suns return","link":"https://www.themercury.com.au/sport/afl/jack-bowes-allin-at-geelong-ahead-of-return-to-gold-coast/news-story/2f663027c1a6d7f28b933dab375f16a5","keywords":["AFL","Geelong"],"creator":null,"video_url":null,"description":"Jack Bowes may have circled his homecoming on the calendar weeks out from the start of his first season with Geelong but the reception he will receive when playing his old club remains unknown.","content":"Unlike the chorus of jeers that took over the MCG in round 1 when Ollie Henry played for the Cats against his old side Collingwood, Bowes may receive a quiet reception when he runs out in the hoops against Gold Coast on Sunday.The Cairns native didn’t have any plans of leaving the Suns until the club came to him and revealed its plan to shed his salary by offloading him elsewhere, a move that left Bowes “gutted”.Even Suns co-captain Touk Miller said this week that the move wasn’t on Bowes.“I hope the crowd doesn’t boo him because he’s done a lot for the club,” Miller said.“I know it’s part of football, but you’ve got to respect that he was in a situation that wasn’t in his favour in the end … I’m looking forward to seeing him.”While he is keen to face up to his old team, since picking Geelong as his trade destination of choice, Bowes has been all-in on Geelong.Like many recruits or draftees, he had dinner at former club vice-president Bob Gartland’s house to check out his extensive collection of Cats memorabilia.After 83 games with the Suns, Bowes was handed a Geelong jumper to debut against Carlton in round 2.“I just feel honoured to be able to pull on the jersey,” he said.“It meant a lot, it was an absolute privilege. This club has so much history and I am just glad to be part of it.”Bowes was sent to the half-back flank to start his first game with Geelong after not training there at all throughout pre-season.With the Cats missing a plethora of defenders – Tom Stewart, Jack Henry, Mitch Duncan and Jake Kolodjashnij – Bowes was happy to be sent where he was needed.In unfamiliar surrounds, Bowes was one of Geelong’s best early in the loss to Carlton, showing off the shrewd kicking that impressed coaches in his first pre-season with the club.He went at 80 per cent efficiency with his 20 disposals – 15 of them kicks – but fluffed a simple shot at goal as Geelong was making a late comeback.“I haven’t done any training at half-back all pre-season, it was sort of in the middle and half-forward,” he said.“I am in a position where I can play a few different roles for the team and wherever I am called upon, I can play those roles.“I think wherever I am playing my footy, I am going to try and help in any role I can for the team.”Defence not up to it: BowesFirst-game Cat Jack Bowes says Geelong’s defence wasn’t on the same page in Thursday’s tight loss to Carlton as the reigning premiers iron out some kinks in their game.For the second week running, the Cats battled to get their hands on the ball and were well beaten on the outside as the Blues gathered 36 more uncontested possessions just six days after Collingwood had 63 more than Geelong.In both those losses, the Cats struggled to stem the flow as the Blues and Pies moved the ball with ease, with the 215 combined points the most Geelong has conceded in a two-game span since early 2017.Bowes said the Cats were off early before some tweaks made at half-time swung the game in their favour.AFL: Carlton have picked up a big win in front of a huge crowd against the Geelong Cats at the MCG.“Full credit to Carlton, I think they were fantastic in the way they approached the game,” he said.“They chipped the ball around on us a bit early and got a lot of uncontested marks and we weren’t able to stop that.“We sort of got the game on our terms in the second half but probably left our run a little bit too late.“It’s easier to stop (an opponent) when we are all on the same page and connected but we just felt like our defensive system wasn’t on from the start. But once we were able to turn that around after half-time, we were able to keep that to a minimum.“It was just the start of the game that let us down.”Geelong will take a 10-day break to tinker with its game before meeting Gold Coast next Sunday.Bowes, who didn’t experience Geelong’s run to the flag last year and was traded in from the Suns over the off-season, said he had no concerns about his side competing at the highest level this year, despite an 0-2 start.“We are confident our best footy can beat everyone, we are going to do whatever we can and keep working on those things that we can tinker at and play our best footy,” he said.","pubDate":"2023-04-01 00:00:00","image_url":null,"source_id":"mercury","category":["sports"],"country":["australia"],"language":"english"},{"title":"Michigan basketball star Hunter Dickinson enters transfer portal","link":"http://rssfeeds.freep.com/~/733368791/0/freep/sports~Michigan-basketball-star-Hunter-Dickinson-enters-transfer-portal/","keywords":null,"creator":["Tony Garcia"," Detroit Free Press"],"video_url":null,"description":"Michigan basketball's Hunter Dickinson, an All-Big Ten big man who averaged 18.5 points and 9.0 rebounds this year, is entering the transfer portal.       ","content":"Hunter Dickinson has led Michigan basketball in scoring and rebounding for three consecutive seasons. He likely will not do so for a fourth straight season. The 7-foot-1 center has entered the transfer portal for his senior season, another significant loss for the Wolverines, who already lost one starter to the NBA draft in freshman Jett Howard. 'MOORE' OF THE SAME: Don't expect Michigan football's offensive identity to change with Sherrone in charge Dickinson, named All-Big Ten first team and Associated Press All-American honorable mention this year, averaged 18.5 points and a career-best 9.0 rebounds while starting in all 34 games he played this season. The junior had 14 double-doubles and scored in double figures 31 times as he became the eighth Wolverine ever to score at least 1,500 points and grab more than 750 rebounds in a career. “Today is bittersweet,\" Michigan coach Juwan Howard said in a statement. \"While Hunter Dickinson's departure is unfortunate, there are so many reasons to be thankful for and celebrate. This young man has accomplished so much in his three seasons. Statistics aside, Hunter helped us to a Big Ten title, back-to-back Sweet 16s, as well as a memorable Elite Eight run. These are memories that will last a lifetime.\" Dickinson finishes his three years at Michigan 12th in career points (1,617) and ninth in rebounds (787). Had he stayed and matched his totals from a season ago, he would've moved into third all-time on the school's scoring list and first all-time in rebounding. For all of his talent, the NBA no longer desires a traditional, back-to-the-basket big man and although he has significantly improved his 3-point shooting — he made 42.1% of his attempts (24-for-57) last year after shooting 32.8% the season prior — he is not currently projected to be a first-round NBA draft pick. Beyond that, he's still set to continue to make some decent money in college via his NIL deals. RELATED: How Michigan hockey went through hell and back to return to Frozen Four Earlier this season, Dickinson's NIL value was as high as $800,000, per On3 Sports. For perspective, only Blake Corum ($1.1 million) and J.J. McCarthy ($837,000) are currently higher than that among U-M athletes. But as much as anything, it appears Dickinson wants to ensure he goes out as a winner. Dickinson won a national championship in AAU in high school, was an All-American playing in the Elite Eight his freshman season and then a dominant center who made the Sweet 16 as a sophomore. This season, as a junior, seemed an anomaly. Michigan didn't win a single significant non-conference game and made a habit of finding ways to snatch defeat from the jaws of victory. Of U-M's 16 losses, 13 came within six points or in overtime. “I feel like that’s the moral of the season so far,\" Dickinson said after a particularly tough one-point loss to Indiana in mid-February. \"Just not capitalizing on those opportunities that we get.” U-M limped down the finish, lost its final three games and missed the NCAA tournament for the first time since 2015. But the cherry on top came when U-M led by eight points in the final minute of a second-round NIT game at Vanderbilt before turning the ball over three times and allowing nine straight points in a season-ending loss . \"We just gave them the game,\" said a dejected Dickinson afterwards. There were tough times personally for Dickinson, too. He wore a ski mask into Kohl Center in Madison to signify U-M was going to \"steal\" a victory, before U-M fell, 64-59. Twice he found himself in hot water after making comments on the \"Roundball Podcast\" (part of his NIL dealings with Barstool Sports), once when he called Wisconsin's basketball team \"scumbags,\" the other when he said students only go to Michigan State if they \"don't get into Michigan.\" \"I know as a Michigan man, no Michigan State fan is ever going to like you, so it’s like, why even try?,\" he said before the season. \"I’d rather just have them hate me than be average. For me, it’s funny. I try to be funny, and I have a great time with it.\" But there were also highs. He had a 32-point, 12-rebound day in a bounce-back win over Maryland, a 31-point performance at Little Caesars Arena and though it came in a loss, his 31-point, 16-rebound night at Illinois in early March may have been the best of his career. However nothing matched his game-tying 3-pointer to force overtime against the Badgers in late February in a comeback 87-79 overtime win. \"Hunter has never wavered, never one foot in, one foot out,\" said an emotional Juwan Howard after that win. \"He's shown he's a true Michigan man. He's dialed in to represent what this team is all about. I'm all in with Hunter and I support him because I know where his heart is. He wants that attention so he can be the bad guy. It's unfair because Hunter, he's really a lovable person. \"I love being around him. I've learned a lot from him.\" It does create a domino effect as far how it impacts the rest of the roster. Tarris Reed Jr.'s development was one of the bright spots this season; now he's primed to become the team's starting center, but the experience or talent in the frontcourt is limited. The trio of power forwards — Terrance Williams II, Will Tschetter and Jace Howard — all struggled last season. There's also redshirt freshman Gregg Glenn and incoming freshman Papa Kante, but neither has collegiate experience. The best iterations of Michigan's team next season had Dickinson on the roster. Now, Howard will likely need to go to the portal to help fill the void left in the middle of the court. Contact Tony Garcia at apgarcia@freepress.com . Follow him on Twitter at @realtonygarcia.","pubDate":"2023-03-31 23:28:40","image_url":"https://www.gannett-cdn.com/presto/2023/02/26/PDTF/f9853758-662e-4d31-a802-7d2f7a4e70ed-02262023_umbball-58.jpg","source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Newcastle stars to give Man Utd a guard of honour for winning the Carabao Cup when they meet in huge Prem clash","link":"https://www.thescottishsun.co.uk/sport/football/10452963/newcastle-carabao-cup-guard-of-honour-man-united/","keywords":["Football","Sport","EFL Cup"],"creator":["Kiro Evans"],"video_url":null,"description":null,"content":"NEWCASTLE are planning to give Manchester United a guard of honour tomorrow recognising their Carabao Cup triumph. February’s loss in the Wembley final means Toon fans are still without a domestic trophy since 1955. AlamyNewcastle fans took over Trafalgar Square as they descended upon London for February’s domestic cup final[/caption] That has not stopped Newcastle giving the green light to a grand gesture to the Red Devils when they visit St James’ Park. The idea was proposed by Toon supporters group Trophies Don’t Matter, which boasts Newcastle having the best fans in the world is more important than silverware. TDM spokesman Lipra Olof said: “It is only right we salute our friends from Manchester. They were deserved winners. “We had a lovely day at Wembley and took over Trafalgar Square before the match, which is the most important thing.” Players will line up by the tunnel as their rivals walk out and boss Eddie Howe is to present Erik ten Hag with a plaque and flowers. The match is a key clash in the race for the Champions League spots with Newcastle in fifth, three points behind third-placed United.  The pair are scrapping for the spots alongside managerless Tottenham and overachievers Brighton and Brentford, who meet tomorrow. Just eight points separate the six sides as the season reaches its penultimate month. HOW TO GET FREE BETS ON FOOTBALL United are looking for silverware in other competitions. The Red Devils face a Europa League quarter-final tie with Sevilla later this month as well as another trip to Wembley to take on Brighton in the FA Cup.","pubDate":"2023-03-31 23:01:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘Big opportunity’: Record numbers boost start of Football NSW year","link":"https://www.themercury.com.au/sport/football/the-2023-nsw-football-season-kicks-off-with-record-numbers-of-participation-across-all-associations/news-story/21e15da2eacd04e34a71b14c003954ac","keywords":["Football","Swoop"],"creator":null,"video_url":null,"description":"ON THE back of the success of the Socceroos’ FIFA World Cup success and the upcoming Women’s World Cup on home soil, excitement for football has never been bigger.","content":"Football NSW has benefited massively from this hype, with a record number of 5-12 year olds signing up for the season which kicks off today.Head of women’s and schools’ football at Football NSW, Hayley Todd, said the increase in junior registrations has been incredible, with 176,000 sign-ups across 660 clubs.“We’ve had a five per cent growth on the 2022 numbers, and we’ve still got registrations coming in,” she said.“So we’re really proud that football is heading in a really good direction.”The Western Sydney association has seen the largest growth, up 6.1 per cent on 2022 numbers and a year-to-date growth of 20 per cent.“Western Sydney associations have led the way with the growth,” Todd said.“The year-to-date numbers are just phenomenal.”Macarthur Association club Eschol Park FC has been one of the top growth clubs in NSW, and has seen a nine per cent increase in girls registrations for this year.Club secretary Aimee Besgrove has been involved with the club for over 25 years, and has been a passionate advocate for getting more young girls into the sport.“Five years ago, we only had 550 members, and only six female teams,” she explained.“This year, we have 957 members, and we have 16 all female teams, pure female teams ranging from under sixes all the way up.”Besgrove said ensuring young girls have the opportunity to play with and against all-girl teams is so important to building a love for the sport.“We were finding that at the age of 12, when we were about to make those all girls teams, we didn’t quite have the numbers, because you’re pulling from five different teams to build an all girls team,” Besgrove said.“So we made a decision as a club and as a community in the MacArthur football, to try and start building from the ages of five and six, just all girls teams.“And now it‘s it’s really been like pushed against all clubs, and all communities and numbers are rising.”Todd said Football NSW has a lot of participation and community initiatives running throughout the year to ensure passion for the sport continues to grow even after the Women’s World Cup later this year.“I think this is our biggest opportunity to really drive the growth of the game, both on and off the field,” Todd said.“We’re driving a number of programs targeted at specific age groups that can help set a bridging program between the Women’s World Cup and being able to register for community football in 2024. “And some of those programs such as Miniroos, Kick-On for Girls and the Girls Love Football program will help with providing an opportunity for participants to breach the game and experience the game in a non competitive and soulful environment before they then can transition into community football.”Todd said these initiatives are hoped to build love for football from grassroots all the way to our national teams, with support only set to grow throughout 2023.“It’s an exciting time for female football and football in general.”","pubDate":"2023-03-31 23:00:00","image_url":null,"source_id":"mercury","category":["sports"],"country":["australia"],"language":"english"},{"title":"FA asks UEFA to look into treatment of England fans at Italy Euro 2024 qualifier","link":"https://www.independent.co.uk/sport/football/england-uefa-harry-kane-naples-italian-b2312149.html","keywords":["Football","Sport"],"creator":["Simon Peach"],"video_url":null,"description":"The FA-run England Supporters Travel Club has contacted European football’s governing body.","content":null,"pubDate":"2023-03-31 22:56:13","image_url":"https://static.independent.co.uk/2023/04/01/00/4535e46606cd2ca464f961993e39ddb9Y29udGVudHNlYXJjaGFwaSwxNjgwMzg5MzI1-2.71492549.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ex-Barcelona star’s stunning Wag goes topless on the beach on holiday and shows off bum as he makes cheeky comment","link":"https://www.thescottishsun.co.uk/sport/football/10452906/barcelona-wag-topless-bum-beach-holiday-instagram/","keywords":["Football","Sport","Barcelona transfer news","Holidays","Instagram"],"creator":["Ian Tuckey"],"video_url":null,"description":null,"content":"EX-BARCELONA star Marc Bartra was almost as cheeky as his girlfriend after the model posted a topless photo and showed off her bottom on holiday. Bartra couldn’t resist chipping in on Instagram when Jessica Goicoechea shared revealing shots from a beach in the Maldives with her 1.8million followers. https://www.instagram.com/goicoechea/Jessica Goicoechea went for the almost all-over tan in the Maldives[/caption] https://www.instagram.com/goicoechea/Jessica was more modest when she fronted up for another snap[/caption] Instagram / @goicoecheaIn some ways Spanish model Jessica revealed even more at the Idolo Awards[/caption] Linking his message to Jessica and a glamour photographer, the defender wrote: “@pepeherreros @goi need someone to help you with the next@joan6six6shoot ?? I’m in ” Fashion designer Jessica had let emojis do the talking in her own Instagram message with her pictures. She simply posted: “” One photo had the 26-year-old posing with a naked back and a minimalist bikini bottom. Other pics, from the front, were more modest, although in one snap she had to hold an untied bikini top down to cover her chest. And her followers weere quick to show their appreciation. One wrote: “Maldives+you=”. Another posted: “Insane ” It comes just weeks after she wore slightly more but also displayed a lot more – at a red-carpet event. An apparent wardrobe malfunction at the Idolo Awards left her wearing a dress with beaded strips that left little of her top half to the imagination. That drew replies on Instagram like “Holy moly ” and “This dress just wow.” In contrast, partner Bartra has been out of the spotlight since the 14-cap Spaniard, 32, moved to Trabzonspor for this season. He was with Barca from 2010-2016 before spells with Borussia Dortmund and then Real Betis. GettyThe fashion designer chose her own slant on a classic look at a gala[/caption] PA:Empics SportJessica’s partner Marc Bartra spent six years at Barcelona and moved to Turkey with Trabzonspor this season[/caption]","pubDate":"2023-03-31 22:54:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"'Good things are going to happen to Colton': Lebanon senior pitcher Colton Hartman excels in the spotlight","link":"https://www.wcpo.com/sports/high-school-sports/good-things-are-going-to-happen-to-colton-lebanon-senior-pitcher-colton-hartman-excels-in-the-spotlight","keywords":null,"creator":null,"video_url":null,"description":"Lebanon senior pitcher Colton Hartman excelled in his season debut in front of an estimated 30 baseball scouts on Wednesday. The Louisville signee is rated Ohio's No. 2 player overall in his class.","content":"LEBANON, Ohio — Colton Hartman couldn't help but notice the estimated 30 baseball scouts watch him take the mound during Lebanon High School's season opener this past Wednesday. A natural adrenaline rush accompanies the Lebanon High School senior left-handed pitcher knowing the scouts' eyes, cameras, radar guns and smartphones are centered on him. Hartman enjoys the opportunity to thrive in the spotlight. The difference is in the fact that he doesn't let the attention become a distraction. \"You know I grew up playing in this environment,\" Hartman said. \"A lot of people watching so I kind of just blur them out — just me and the catcher when I'm up there.\" Hartman, a University of Louisville signee, is rated Ohio's second-best player overall (regardless of position) in the 2023 class by Prep Baseball Report. He was the only Ohio player selected to participate in the Perfect Game All-American Classic in August. That prestigious event was hosted by Chase Field in Arizona and televised on ESPNU. Nearly a year after that event, Hartman may have an opportunity to be selected in the Major League Baseball Draft in July. The dozens of baseball scouts stood behind the backstop or in the Lebanon press box Wednesday afternoon as Hartman allowed no hits and struck out nine in five innings in a victory over Milford. Jordan Chiero, Prep Baseball Report Ohio's director of scouting, said Hartman's fastball, slider and changeup are very impressive. Chiero said Hartman would also be a Power Five college signee as a position player given his offensive ability. \"What I tell everyone about Colton is he is a great pitcher but even a better individual,\" Lebanon baseball coach Larry Price said. \"He's so high character. I don't think I've ever coached a kid that has higher character and I've had some great kids. But, Colton is special. Good things are going to happen to Colton. He's got some tough decisions — whether to go to college or sign.\" Hartman, 18, admits he's thought about the draft but he isn't focused on any hypothetical baseball matters. He's not looking at any mock drafts. He simply wants to focus on this high school season. \"I grew up with all these guys,\" Hartman said. \"They're all my best buddies. And coming out here and winning games with them, it's the best feeling in the world.\" Lebanon earned its first district title in program history in 2022 and the Warriors want to capture a regional championship this spring. \"I'm super excited for the season,\" Hartman said. \"The team is looking great. As long as we hit and play good defense we'll be great.\" That team-first mentality is why Hartman has earned the respect of his teammates, Price said. \"He's just as humble as can be,\" Price said. \"And the kids love him. He loves the kids.\" That connectivity with his teammates also occurred in football and basketball when Hartman was younger. Hartman also enjoys fishing every other day as a favorite hobby. \"I love being outside; it's a peaceful thing to do,\" said Hartman. \"The adrenaline rush when you get a bite — it's not like anything else. It's like hitting a home run kind of.\" SIGN UP: Subscribe to our high school sports newsletter","pubDate":"2023-03-31 22:33:23","image_url":null,"source_id":"wcpo","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Rangers and SPFL heading for ‘nuclear’ SECOND sponsorship row as Ibrox chiefs ‘call for league bosses’ heads’","link":"https://www.thescottishsun.co.uk/sport/football/10452713/rangers-spfl-nuclear-second-sponsorship-row-glens-vodka/","keywords":["Football","Scottish Premiership","Sport"],"creator":["Ryan Rowe"],"video_url":null,"description":null,"content":"RANGERS and the SPFL are going to be at loggerheads once again over sponsorship deals, and this time it could go ‘nuclear’, according to a report. The Ibrox club and the league have been embroiled in a bitter row over the contract with car dealer cinch for much of the past year. Andrew BarrSPFL chief executive Neil Doncaster[/caption] SNSRangers’ managing director Stewart Robertson[/caption] The controversy kicked off last season when Gers chiefs claimed that they were unable comply with the terms of the cinch and SPFL contract because they already had an agreement with Park’s Motor Group, owned by Ibrox chairman Douglas Park. It led to the SPFL coming up with a new resolution and it excused Rangers from having to carry the company’s branding within their stadium, on any advertising or on club merchandise. The Ibrox outfit subsequently demanded an investigation and claimed they were INSULTED by the SPFL. Then Aberdeen and Hearts also voiced separate concerns, claiming that the new agreement put the revenue structure which underpinned the top flight at risk. A summit at Hampden to hold crisis talks over the ongoing spat last year never came to fruition. This latest dispute, according to the Daily Mail, has arisen now because the league’s contract with the Loch Lomond Group, producers of Glen’s Vodka, is close to being renewed. The report states that, just like they did for the cinch deal, Rangers have told other Scottish Premiership clubs that they feel ‘unable to fulfil any aspect of the new agreement’. The Ibrox club argues that the aforementioned revised resolution excuses them not only from promoting cinch, but from promoting ANY sponsorship deals agreed by the SPFL before the end of the cinch contract in 2026. The latest twist has the potential, according to the Mail, to have ‘nuclear’ ramifications. It’s being said that Ibrox chiefs have called for the heads of SPFL bosses including chief executive Neil Doncaster, chairman Murdoch MacLennan and legal adviser Rod McKenzie. And Gers managing director Stewart Robertson has reportedly warned all 42 senior teams of sky-rocketing legal costs should the debate rumble on. Should Rangers opt out of the agreement with Glen’s/the Loch Lomond Group, it’s likely the money put on the table by the distilling company in a new deal would be less than previously expected. In addition to Glen’s Vodk,a the Loch Lomond Group also produce Bem Lomond Scottish Gin, Glen Scotia Whisky and Loch Lomond Whisky. Tennent Caledonian, the brewers of Scotland’s biggest-selling lager Tennents, is listed as one of Rangers’ commercial parnters. Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-03-31 22:25:51","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Wellington Phoenix lose another lead against lowly Melbourne Victory in A-League","link":"https://www.nzherald.co.nz/sport/wellington-phoenix-lose-another-lead-against-lowly-melbourne-victory-in-a-league/PUWLHN3PDBCTROWOKA2YATLYQA/","keywords":null,"creator":null,"video_url":null,"description":"The Wellington Phoenix have once more squandered a lead.","content":"The Wellington Phoenix have once more squandered a lead to lose to the lowly Melbourne Victory. Oskar Zawada put his side ahead midway through the first half at Sky Stadium but the Phoenix spurned chances for a second goal and eventually fell to a potentially pivotal 2-1 defeat. While fifth-placed Wellington still have a bit of breathing room in their bid to qualify for the six-team playoffs, the dropped points could prove costly in their quest to host finals football. If they are indeed forced on the road, Ufuk Talay’s side will rue their two clashes against the Victory. Advertisement Advertise with NZME. Just as in February, Melbourne entered today’s match on the bottom rung of the A-League Men ladder. And after an early Zawada strike was also overturned across the Tasman, the Phoenix were helpless to prevent history repeating in Wellington. The Polish striker needed 25 minutes to rediscover his scoring touch after missing the 5-1 thrashing by Adelaide for the birth of his child. Zawada pounced on a defensive mistake from Damien Da Silva to lob goalkeeper Paul Izzo, finding the net in his fifth straight game while taking his season total to 13. But after Izzo produced a couple of crucial saves to deny Yan Sasse and Steven Ugarkovic, Melbourne made their opponents pay for lapses in set-piece concentration. First, the Phoenix failed to track Bruno Fornaroli’s run and allowed him to nod in an equaliser on the hour mark. Then, Da Silva atoned for his error by heading home another corner in the 76th minute, leaving captain Alex Rufer frustrated. Advertisement Advertise with NZME. “We were poor from set pieces and they punished us,” he told Sky Sport. “We switched off. It’s not an individual; it’s collectively. “We need to be better from those moments and we let ourselves down massively.” Rufer remained hopeful his side could earn the top-four finish they required to host a playoff game, despite having to head across the Tasman for three of their final four matches. “It’s a big blow, but we’ve got four games left,” he said. “We know where we are. Yes, it’s disappointing, but we go again. We believe in ourselves, we’re a good team, and it’s down to us now.” The Phoenix women, meanwhile, have earned the wooden spoon for the second straight season, with a 99th-minute equaliser against Melbourne Victory not enough to climb out of 11th place. Wellington required a win over the defending champions to have any hope of avoiding that unwanted prize, but those chances were grim when the visitors scored two superb goals in the first 26 minutes. Alana Murphy put Melbourne in front by putting a free kick in the top corner from the edge of the box, before Melina Ayres turned Marisa van der Meer and fired high into the net from a tight angle. The Phoenix pulled back a goal with 15 minutes to play when Victory custodian Casey Dumont couldn’t clean up trouble outside the area, leaving her goal unguarded for Ava Pritchard to make it 2-1. Grace Wisnewski then managed to bundle home a leveller with virtually the last kick of the game, ending the campaign on a positive note. Having finished their inaugural season with two wins, seven points and a goal difference of minus-23, the Phoenix at least improved on each count, collecting three wins, 13 points and finishing on minus-10. Advertisement Advertise with NZME. But with the final position the same, Wellington will have to content themselves by playing potential spoiler for Melbourne, leaving the Victory relying on other results to remain in the top four and sneak into the semifinals. Melbourne Victory men 2 (Bruno Fornaroli 58, Damien Da Silva 76) Wellington Phoenix men 1 (Oskar Zawada 25) Wellington Phoenix women 2 (Ava Pritchard 75, Grace Wisnewski 90+9) Melbourne Victory women 2 (Alana Murphy 4, Melina Ayres 26) Advertisement Advertise with NZME. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-04-01 05:45:00","image_url":"https://www.nzherald.co.nz/resizer/eWafAgks8LBkrtju-XdOUs_YbZ4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/BHIMCALVLJAXDGVCJTDR5DCQJI.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Fútbol: ranking de los 10 mejores jugadores de la historia del deporte rey","link":"https://www.eltiempo.com/deportes/futbol-internacional/futbol-los-10-mejores-jugadores-de-todos-los-tiempos-755610","keywords":["Fútbol Internacional"],"creator":null,"video_url":null,"description":"La historia del fútbol ha tenido verdaderos campeones que maracron época ¿quiénes son?","content":"Es muy difícil hablar de los jugadores que han marcado una época en el fútbol mundial, son muchos los futbolistas que deleitaron a los aficionados del mundo y se hicieron un nombre en los libros dorados del deporte rey. Acá rememoramos algunos que pasaron a la historia. (Lea aquí: Ni Maradona, ni Pelé: polémica clasificación de los mejores de la historia ) Lionel Messi junto a Rodrigo de Paul con la Copa del Mundo en Qatar 2022. Instagram: rodridepaul Sin duda alguna el nombre del astro argentino debía estar en el ranking de los mejores jugadores del fútbol mundial. En las últimas dos décadas Lionel ha logrado batir todos los récords posibles y ha maravillado a los hinchas con jugadas imposibles de realizar. Messi fue clave en la mejor etapa en la historia del Barcelona de España en donde conquistó todo lo que un jugador podía ganar: 10 ligas, 8 supercopas, 3 Mundiales de Clubes, 7 Copas del Rey, 4 Champions y 3 Supercopas de Europa. El eterno 10 ha dejado su huella tras ganar 6 Balones de Oro, una Copa América, 1 Finallissima y la tan anhelada Copa del Mundo de la FIFA que logró en Qatar 2022 con la Selección Argentina. El portugués ha marcado una era inolvidable junto con Messi, el luso ha conquistado títulos en Inglaterra, Portugal, España e Italia, dejando su marca en cada uno de los clubes donde jugó. CR7 tiene en sus vitrinas 5 Balones de Oro, 5 Champions, siendo el máximo goleador de la competición. Pero los títulos no paran ahí, Cristiano Ronaldo posee un palmarés único con 7 títulos de liga, 4 copas, 7 supercopas, 4 Mundiales de Clubes y una Eurocopa con la Selección de Portugal. Cristiano Ronaldo acumula cinco trofeos del Balón de Oro. EFE La ‘sonrisa del fútbol’ descrestó con sus jugadas a la generación de principios del Siglo XXI, ‘Dinho’ asombró al mundo del fútbol con pura magia y es de los pocos jugadores en conquistar una Champions League, un Mundial de la FIFA, un Balón de Oro, una Copa América y una Copa Libertadores. Fue Ronaldinho en el 2005 el que ganó las dos distinciones. El Balon de Oro de 'France Football' y Mejor Jugador Mundial de la Fifa. Archivo / EL TIEMPO El ‘Pelusa’ no podía faltar en el ranking debido a sus hazañas tanto dentro como fuera del campo, el ‘10’ se convirtió en la bandera de la Selección Argentina y fue clave para que la albiceleste conquistara el Mundial de México 86. Diego Armando Maradona también pasó a la historia en Italia luego de llevar a un equipo como el Napoli a levantar 2 títulos de la Liga italiana y competirle mano a mano a los colosos del norte como Milan Inter y Juventus. En Nápoles el argentino es considerado un dios. Maradona EFE Pelé Archivo / EL TIEMPO El astro brasileño cambió la historia de la Selección de Brasil y fue el responsable de que el pueblo de su país olvidara el famoso Maracanazo. Pelé es la máxima leyenda de su nación tras levantar 3 títulos de la Copa del Mundo (1958, 1962 y 1970). Además, el eterno 10 logró triunfar con la casaca del Santos, club de sus amores con el que ganó en todas las competencias donde jugó. Según los libros del fútbol, ‘O rei’ es el máximo artillero del deporte con 1282 tantos. El ‘Gordo’ Ronaldo es sin duda alguna el número 9 más intimidante del mundo, su potencia, sus arranques y sus goles lo convirtieron en el mejor del mundo en 1997 y 2002 donde ganó sus dos Balones de Oro. (También le puede interesar: Luis Díaz, entre los 10 jugadores más caros del mundo, por millonaria cifra ) Ronaldo Nazario tiene en sus vitrinas dos Copas del Mundo, siendo clave en la conquistada ante Alemania en el 2002. Además, es el único jugador en la historia en jugar en el Real Madrid, el Barcelona, el Milan y el Inter, equipos con rivales históricas y donde él tiene un cariño y recuerdo especial. El holandés, mítico jugador de Ajax y Barcelona, fue subcampeón con su selección en el Mundial de 1974, el cual se disputó en Alemania Occidental. Archivo El neerlandés es el responsable de cambiar la historia del fútbol desplegando un fútbol total jamás visto en el mundo durante la década de los 70. Johan Cruyff es el símbolo de aquella Selección de Holanda que quedó en la historia como la Naranja Mecánica. Es la elegancia y la clase del fútbol, el francés maravilló con sus ‘pasos de baile’ dentro del terreno de juego a los aficionados que lo vieron levantar la Copa del Mundo con su país en 1998. En cuanto a clubes, Zinedine Zidane es leyenda indiscutida de la Juventus de Italia y el Real Madrid , club con el que se consagró en la Champions League. Zinedine Zidane como entrenador del Real Madrid. EFE El ‘Káiser’ es sin duda uno de los mejores jugadores de la historia de Alemania, su estilo de juego en la defensa le permitieron a los teutones levantar la Copa del Mundo de 1974. En su país es el máximo ídolo del Bayern Mínich. El histórico delantero argentino del Real Madrid, Alfredo Di Stéfano, protagonizó en 1956 con la película 'La Saeta Rubia' en la que se interpretó a sí mismo. EFE El colombo-argentino se convirtió en el primer futbolista en ser estrella mundial gracias a su estilo único de juego. Di Stéfano marcó una historia imborrable en Millonarios Y Real Madrid en la década de los 50. Con el conjunto blanco, el histórico jugador logró ganar 5 Copa de Europa consecutivas, todo un récord el cual va a ser muy difícil de superar. Falcao García, papá por quinta vez: 'El amor se multiplica y nosotros también' Deportes Tolima: los récords que marcaron su historia en el fútbol colombiano Luis Díaz: ‘baldado de agua fría’ tras su regreso a entrenamientos en Liverpool Harold Yepes REDACCIÓN ÚLTIMAS NOTICIAS","pubDate":"2023-04-01 00:04:12","image_url":null,"source_id":"eltiempocl","category":["sports"],"country":["singapore"],"language":"spanish"},{"title":"Boos or no Boos, Bowes is an all-in Cat before Suns return","link":"https://www.themercury.com.au/sport/afl/jack-bowes-allin-at-geelong-ahead-of-return-to-gold-coast/news-story/2f663027c1a6d7f28b933dab375f16a5","keywords":["AFL","Geelong"],"creator":null,"video_url":null,"description":"Jack Bowes may have circled his homecoming on the calendar weeks out from the start of his first season with Geelong but the reception he will receive when playing his old club remains unknown.","content":"Unlike the chorus of jeers that took over the MCG in round 1 when Ollie Henry played for the Cats against his old side Collingwood, Bowes may receive a quiet reception when he runs out in the hoops against Gold Coast on Sunday.The Cairns native didn’t have any plans of leaving the Suns until the club came to him and revealed its plan to shed his salary by offloading him elsewhere, a move that left Bowes “gutted”.Even Suns co-captain Touk Miller said this week that the move wasn’t on Bowes.“I hope the crowd doesn’t boo him because he’s done a lot for the club,” Miller said.“I know it’s part of football, but you’ve got to respect that he was in a situation that wasn’t in his favour in the end … I’m looking forward to seeing him.”While he is keen to face up to his old team, since picking Geelong as his trade destination of choice, Bowes has been all-in on Geelong.Like many recruits or draftees, he had dinner at former club vice-president Bob Gartland’s house to check out his extensive collection of Cats memorabilia.After 83 games with the Suns, Bowes was handed a Geelong jumper to debut against Carlton in round 2.“I just feel honoured to be able to pull on the jersey,” he said.“It meant a lot, it was an absolute privilege. This club has so much history and I am just glad to be part of it.”Bowes was sent to the half-back flank to start his first game with Geelong after not training there at all throughout pre-season.With the Cats missing a plethora of defenders – Tom Stewart, Jack Henry, Mitch Duncan and Jake Kolodjashnij – Bowes was happy to be sent where he was needed.In unfamiliar surrounds, Bowes was one of Geelong’s best early in the loss to Carlton, showing off the shrewd kicking that impressed coaches in his first pre-season with the club.He went at 80 per cent efficiency with his 20 disposals – 15 of them kicks – but fluffed a simple shot at goal as Geelong was making a late comeback.“I haven’t done any training at half-back all pre-season, it was sort of in the middle and half-forward,” he said.“I am in a position where I can play a few different roles for the team and wherever I am called upon, I can play those roles.“I think wherever I am playing my footy, I am going to try and help in any role I can for the team.”Defence not up to it: BowesFirst-game Cat Jack Bowes says Geelong’s defence wasn’t on the same page in Thursday’s tight loss to Carlton as the reigning premiers iron out some kinks in their game.For the second week running, the Cats battled to get their hands on the ball and were well beaten on the outside as the Blues gathered 36 more uncontested possessions just six days after Collingwood had 63 more than Geelong.In both those losses, the Cats struggled to stem the flow as the Blues and Pies moved the ball with ease, with the 215 combined points the most Geelong has conceded in a two-game span since early 2017.Bowes said the Cats were off early before some tweaks made at half-time swung the game in their favour.AFL: Carlton have picked up a big win in front of a huge crowd against the Geelong Cats at the MCG.“Full credit to Carlton, I think they were fantastic in the way they approached the game,” he said.“They chipped the ball around on us a bit early and got a lot of uncontested marks and we weren’t able to stop that.“We sort of got the game on our terms in the second half but probably left our run a little bit too late.“It’s easier to stop (an opponent) when we are all on the same page and connected but we just felt like our defensive system wasn’t on from the start. But once we were able to turn that around after half-time, we were able to keep that to a minimum.“It was just the start of the game that let us down.”Geelong will take a 10-day break to tinker with its game before meeting Gold Coast next Sunday.Bowes, who didn’t experience Geelong’s run to the flag last year and was traded in from the Suns over the off-season, said he had no concerns about his side competing at the highest level this year, despite an 0-2 start.“We are confident our best footy can beat everyone, we are going to do whatever we can and keep working on those things that we can tinker at and play our best footy,” he said.","pubDate":"2023-04-01 00:00:00","image_url":null,"source_id":"mercury","category":["sports"],"country":["australia"],"language":"english"},{"title":"Michigan basketball star Hunter Dickinson enters transfer portal","link":"http://rssfeeds.freep.com/~/733368791/0/freep/sports~Michigan-basketball-star-Hunter-Dickinson-enters-transfer-portal/","keywords":null,"creator":["Tony Garcia"," Detroit Free Press"],"video_url":null,"description":"Michigan basketball's Hunter Dickinson, an All-Big Ten big man who averaged 18.5 points and 9.0 rebounds this year, is entering the transfer portal.       ","content":"Hunter Dickinson has led Michigan basketball in scoring and rebounding for three consecutive seasons. He likely will not do so for a fourth straight season. The 7-foot-1 center has entered the transfer portal for his senior season, another significant loss for the Wolverines, who already lost one starter to the NBA draft in freshman Jett Howard. 'MOORE' OF THE SAME: Don't expect Michigan football's offensive identity to change with Sherrone in charge Dickinson, named All-Big Ten first team and Associated Press All-American honorable mention this year, averaged 18.5 points and a career-best 9.0 rebounds while starting in all 34 games he played this season. The junior had 14 double-doubles and scored in double figures 31 times as he became the eighth Wolverine ever to score at least 1,500 points and grab more than 750 rebounds in a career. “Today is bittersweet,\" Michigan coach Juwan Howard said in a statement. \"While Hunter Dickinson's departure is unfortunate, there are so many reasons to be thankful for and celebrate. This young man has accomplished so much in his three seasons. Statistics aside, Hunter helped us to a Big Ten title, back-to-back Sweet 16s, as well as a memorable Elite Eight run. These are memories that will last a lifetime.\" Dickinson finishes his three years at Michigan 12th in career points (1,617) and ninth in rebounds (787). Had he stayed and matched his totals from a season ago, he would've moved into third all-time on the school's scoring list and first all-time in rebounding. For all of his talent, the NBA no longer desires a traditional, back-to-the-basket big man and although he has significantly improved his 3-point shooting — he made 42.1% of his attempts (24-for-57) last year after shooting 32.8% the season prior — he is not currently projected to be a first-round NBA draft pick. Beyond that, he's still set to continue to make some decent money in college via his NIL deals. RELATED: How Michigan hockey went through hell and back to return to Frozen Four Earlier this season, Dickinson's NIL value was as high as $800,000, per On3 Sports. For perspective, only Blake Corum ($1.1 million) and J.J. McCarthy ($837,000) are currently higher than that among U-M athletes. But as much as anything, it appears Dickinson wants to ensure he goes out as a winner. Dickinson won a national championship in AAU in high school, was an All-American playing in the Elite Eight his freshman season and then a dominant center who made the Sweet 16 as a sophomore. This season, as a junior, seemed an anomaly. Michigan didn't win a single significant non-conference game and made a habit of finding ways to snatch defeat from the jaws of victory. Of U-M's 16 losses, 13 came within six points or in overtime. “I feel like that’s the moral of the season so far,\" Dickinson said after a particularly tough one-point loss to Indiana in mid-February. \"Just not capitalizing on those opportunities that we get.” U-M limped down the finish, lost its final three games and missed the NCAA tournament for the first time since 2015. But the cherry on top came when U-M led by eight points in the final minute of a second-round NIT game at Vanderbilt before turning the ball over three times and allowing nine straight points in a season-ending loss . \"We just gave them the game,\" said a dejected Dickinson afterwards. There were tough times personally for Dickinson, too. He wore a ski mask into Kohl Center in Madison to signify U-M was going to \"steal\" a victory, before U-M fell, 64-59. Twice he found himself in hot water after making comments on the \"Roundball Podcast\" (part of his NIL dealings with Barstool Sports), once when he called Wisconsin's basketball team \"scumbags,\" the other when he said students only go to Michigan State if they \"don't get into Michigan.\" \"I know as a Michigan man, no Michigan State fan is ever going to like you, so it’s like, why even try?,\" he said before the season. \"I’d rather just have them hate me than be average. For me, it’s funny. I try to be funny, and I have a great time with it.\" But there were also highs. He had a 32-point, 12-rebound day in a bounce-back win over Maryland, a 31-point performance at Little Caesars Arena and though it came in a loss, his 31-point, 16-rebound night at Illinois in early March may have been the best of his career. However nothing matched his game-tying 3-pointer to force overtime against the Badgers in late February in a comeback 87-79 overtime win. \"Hunter has never wavered, never one foot in, one foot out,\" said an emotional Juwan Howard after that win. \"He's shown he's a true Michigan man. He's dialed in to represent what this team is all about. I'm all in with Hunter and I support him because I know where his heart is. He wants that attention so he can be the bad guy. It's unfair because Hunter, he's really a lovable person. \"I love being around him. I've learned a lot from him.\" It does create a domino effect as far how it impacts the rest of the roster. Tarris Reed Jr.'s development was one of the bright spots this season; now he's primed to become the team's starting center, but the experience or talent in the frontcourt is limited. The trio of power forwards — Terrance Williams II, Will Tschetter and Jace Howard — all struggled last season. There's also redshirt freshman Gregg Glenn and incoming freshman Papa Kante, but neither has collegiate experience. The best iterations of Michigan's team next season had Dickinson on the roster. Now, Howard will likely need to go to the portal to help fill the void left in the middle of the court. Contact Tony Garcia at apgarcia@freepress.com . Follow him on Twitter at @realtonygarcia.","pubDate":"2023-03-31 23:28:40","image_url":"https://www.gannett-cdn.com/presto/2023/02/26/PDTF/f9853758-662e-4d31-a802-7d2f7a4e70ed-02262023_umbball-58.jpg","source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Newcastle stars to give Man Utd a guard of honour for winning the Carabao Cup when they meet in huge Prem clash","link":"https://www.thescottishsun.co.uk/sport/football/10452963/newcastle-carabao-cup-guard-of-honour-man-united/","keywords":["Football","Sport","EFL Cup"],"creator":["Kiro Evans"],"video_url":null,"description":null,"content":"NEWCASTLE are planning to give Manchester United a guard of honour tomorrow recognising their Carabao Cup triumph. February’s loss in the Wembley final means Toon fans are still without a domestic trophy since 1955. AlamyNewcastle fans took over Trafalgar Square as they descended upon London for February’s domestic cup final[/caption] That has not stopped Newcastle giving the green light to a grand gesture to the Red Devils when they visit St James’ Park. The idea was proposed by Toon supporters group Trophies Don’t Matter, which boasts Newcastle having the best fans in the world is more important than silverware. TDM spokesman Lipra Olof said: “It is only right we salute our friends from Manchester. They were deserved winners. “We had a lovely day at Wembley and took over Trafalgar Square before the match, which is the most important thing.” Players will line up by the tunnel as their rivals walk out and boss Eddie Howe is to present Erik ten Hag with a plaque and flowers. The match is a key clash in the race for the Champions League spots with Newcastle in fifth, three points behind third-placed United.  The pair are scrapping for the spots alongside managerless Tottenham and overachievers Brighton and Brentford, who meet tomorrow. Just eight points separate the six sides as the season reaches its penultimate month. HOW TO GET FREE BETS ON FOOTBALL United are looking for silverware in other competitions. The Red Devils face a Europa League quarter-final tie with Sevilla later this month as well as another trip to Wembley to take on Brighton in the FA Cup.","pubDate":"2023-03-31 23:01:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘Big opportunity’: Record numbers boost start of Football NSW year","link":"https://www.themercury.com.au/sport/football/the-2023-nsw-football-season-kicks-off-with-record-numbers-of-participation-across-all-associations/news-story/21e15da2eacd04e34a71b14c003954ac","keywords":["Football","Swoop"],"creator":null,"video_url":null,"description":"ON THE back of the success of the Socceroos’ FIFA World Cup success and the upcoming Women’s World Cup on home soil, excitement for football has never been bigger.","content":"Football NSW has benefited massively from this hype, with a record number of 5-12 year olds signing up for the season which kicks off today.Head of women’s and schools’ football at Football NSW, Hayley Todd, said the increase in junior registrations has been incredible, with 176,000 sign-ups across 660 clubs.“We’ve had a five per cent growth on the 2022 numbers, and we’ve still got registrations coming in,” she said.“So we’re really proud that football is heading in a really good direction.”The Western Sydney association has seen the largest growth, up 6.1 per cent on 2022 numbers and a year-to-date growth of 20 per cent.“Western Sydney associations have led the way with the growth,” Todd said.“The year-to-date numbers are just phenomenal.”Macarthur Association club Eschol Park FC has been one of the top growth clubs in NSW, and has seen a nine per cent increase in girls registrations for this year.Club secretary Aimee Besgrove has been involved with the club for over 25 years, and has been a passionate advocate for getting more young girls into the sport.“Five years ago, we only had 550 members, and only six female teams,” she explained.“This year, we have 957 members, and we have 16 all female teams, pure female teams ranging from under sixes all the way up.”Besgrove said ensuring young girls have the opportunity to play with and against all-girl teams is so important to building a love for the sport.“We were finding that at the age of 12, when we were about to make those all girls teams, we didn’t quite have the numbers, because you’re pulling from five different teams to build an all girls team,” Besgrove said.“So we made a decision as a club and as a community in the MacArthur football, to try and start building from the ages of five and six, just all girls teams.“And now it‘s it’s really been like pushed against all clubs, and all communities and numbers are rising.”Todd said Football NSW has a lot of participation and community initiatives running throughout the year to ensure passion for the sport continues to grow even after the Women’s World Cup later this year.“I think this is our biggest opportunity to really drive the growth of the game, both on and off the field,” Todd said.“We’re driving a number of programs targeted at specific age groups that can help set a bridging program between the Women’s World Cup and being able to register for community football in 2024. “And some of those programs such as Miniroos, Kick-On for Girls and the Girls Love Football program will help with providing an opportunity for participants to breach the game and experience the game in a non competitive and soulful environment before they then can transition into community football.”Todd said these initiatives are hoped to build love for football from grassroots all the way to our national teams, with support only set to grow throughout 2023.“It’s an exciting time for female football and football in general.”","pubDate":"2023-03-31 23:00:00","image_url":null,"source_id":"mercury","category":["sports"],"country":["australia"],"language":"english"},{"title":"FA asks UEFA to look into treatment of England fans at Italy Euro 2024 qualifier","link":"https://www.independent.co.uk/sport/football/england-uefa-harry-kane-naples-italian-b2312149.html","keywords":["Football","Sport"],"creator":["Simon Peach"],"video_url":null,"description":"The FA-run England Supporters Travel Club has contacted European football’s governing body.","content":null,"pubDate":"2023-03-31 22:56:13","image_url":"https://static.independent.co.uk/2023/04/01/00/4535e46606cd2ca464f961993e39ddb9Y29udGVudHNlYXJjaGFwaSwxNjgwMzg5MzI1-2.71492549.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ex-Barcelona star’s stunning Wag goes topless on the beach on holiday and shows off bum as he makes cheeky comment","link":"https://www.thescottishsun.co.uk/sport/football/10452906/barcelona-wag-topless-bum-beach-holiday-instagram/","keywords":["Football","Sport","Barcelona transfer news","Holidays","Instagram"],"creator":["Ian Tuckey"],"video_url":null,"description":null,"content":"EX-BARCELONA star Marc Bartra was almost as cheeky as his girlfriend after the model posted a topless photo and showed off her bottom on holiday. Bartra couldn’t resist chipping in on Instagram when Jessica Goicoechea shared revealing shots from a beach in the Maldives with her 1.8million followers. https://www.instagram.com/goicoechea/Jessica Goicoechea went for the almost all-over tan in the Maldives[/caption] https://www.instagram.com/goicoechea/Jessica was more modest when she fronted up for another snap[/caption] Instagram / @goicoecheaIn some ways Spanish model Jessica revealed even more at the Idolo Awards[/caption] Linking his message to Jessica and a glamour photographer, the defender wrote: “@pepeherreros @goi need someone to help you with the next@joan6six6shoot ?? I’m in ” Fashion designer Jessica had let emojis do the talking in her own Instagram message with her pictures. She simply posted: “” One photo had the 26-year-old posing with a naked back and a minimalist bikini bottom. Other pics, from the front, were more modest, although in one snap she had to hold an untied bikini top down to cover her chest. And her followers weere quick to show their appreciation. One wrote: “Maldives+you=”. Another posted: “Insane ” It comes just weeks after she wore slightly more but also displayed a lot more – at a red-carpet event. An apparent wardrobe malfunction at the Idolo Awards left her wearing a dress with beaded strips that left little of her top half to the imagination. That drew replies on Instagram like “Holy moly ” and “This dress just wow.” In contrast, partner Bartra has been out of the spotlight since the 14-cap Spaniard, 32, moved to Trabzonspor for this season. He was with Barca from 2010-2016 before spells with Borussia Dortmund and then Real Betis. GettyThe fashion designer chose her own slant on a classic look at a gala[/caption] PA:Empics SportJessica’s partner Marc Bartra spent six years at Barcelona and moved to Turkey with Trabzonspor this season[/caption]","pubDate":"2023-03-31 22:54:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"'Good things are going to happen to Colton': Lebanon senior pitcher Colton Hartman excels in the spotlight","link":"https://www.wcpo.com/sports/high-school-sports/good-things-are-going-to-happen-to-colton-lebanon-senior-pitcher-colton-hartman-excels-in-the-spotlight","keywords":null,"creator":null,"video_url":null,"description":"Lebanon senior pitcher Colton Hartman excelled in his season debut in front of an estimated 30 baseball scouts on Wednesday. The Louisville signee is rated Ohio's No. 2 player overall in his class.","content":"LEBANON, Ohio — Colton Hartman couldn't help but notice the estimated 30 baseball scouts watch him take the mound during Lebanon High School's season opener this past Wednesday. A natural adrenaline rush accompanies the Lebanon High School senior left-handed pitcher knowing the scouts' eyes, cameras, radar guns and smartphones are centered on him. Hartman enjoys the opportunity to thrive in the spotlight. The difference is in the fact that he doesn't let the attention become a distraction. \"You know I grew up playing in this environment,\" Hartman said. \"A lot of people watching so I kind of just blur them out — just me and the catcher when I'm up there.\" Hartman, a University of Louisville signee, is rated Ohio's second-best player overall (regardless of position) in the 2023 class by Prep Baseball Report. He was the only Ohio player selected to participate in the Perfect Game All-American Classic in August. That prestigious event was hosted by Chase Field in Arizona and televised on ESPNU. Nearly a year after that event, Hartman may have an opportunity to be selected in the Major League Baseball Draft in July. The dozens of baseball scouts stood behind the backstop or in the Lebanon press box Wednesday afternoon as Hartman allowed no hits and struck out nine in five innings in a victory over Milford. Jordan Chiero, Prep Baseball Report Ohio's director of scouting, said Hartman's fastball, slider and changeup are very impressive. Chiero said Hartman would also be a Power Five college signee as a position player given his offensive ability. \"What I tell everyone about Colton is he is a great pitcher but even a better individual,\" Lebanon baseball coach Larry Price said. \"He's so high character. I don't think I've ever coached a kid that has higher character and I've had some great kids. But, Colton is special. Good things are going to happen to Colton. He's got some tough decisions — whether to go to college or sign.\" Hartman, 18, admits he's thought about the draft but he isn't focused on any hypothetical baseball matters. He's not looking at any mock drafts. He simply wants to focus on this high school season. \"I grew up with all these guys,\" Hartman said. \"They're all my best buddies. And coming out here and winning games with them, it's the best feeling in the world.\" Lebanon earned its first district title in program history in 2022 and the Warriors want to capture a regional championship this spring. \"I'm super excited for the season,\" Hartman said. \"The team is looking great. As long as we hit and play good defense we'll be great.\" That team-first mentality is why Hartman has earned the respect of his teammates, Price said. \"He's just as humble as can be,\" Price said. \"And the kids love him. He loves the kids.\" That connectivity with his teammates also occurred in football and basketball when Hartman was younger. Hartman also enjoys fishing every other day as a favorite hobby. \"I love being outside; it's a peaceful thing to do,\" said Hartman. \"The adrenaline rush when you get a bite — it's not like anything else. It's like hitting a home run kind of.\" SIGN UP: Subscribe to our high school sports newsletter","pubDate":"2023-03-31 22:33:23","image_url":null,"source_id":"wcpo","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Rangers and SPFL heading for ‘nuclear’ SECOND sponsorship row as Ibrox chiefs ‘call for league bosses’ heads’","link":"https://www.thescottishsun.co.uk/sport/football/10452713/rangers-spfl-nuclear-second-sponsorship-row-glens-vodka/","keywords":["Football","Scottish Premiership","Sport"],"creator":["Ryan Rowe"],"video_url":null,"description":null,"content":"RANGERS and the SPFL are going to be at loggerheads once again over sponsorship deals, and this time it could go ‘nuclear’, according to a report. The Ibrox club and the league have been embroiled in a bitter row over the contract with car dealer cinch for much of the past year. Andrew BarrSPFL chief executive Neil Doncaster[/caption] SNSRangers’ managing director Stewart Robertson[/caption] The controversy kicked off last season when Gers chiefs claimed that they were unable comply with the terms of the cinch and SPFL contract because they already had an agreement with Park’s Motor Group, owned by Ibrox chairman Douglas Park. It led to the SPFL coming up with a new resolution and it excused Rangers from having to carry the company’s branding within their stadium, on any advertising or on club merchandise. The Ibrox outfit subsequently demanded an investigation and claimed they were INSULTED by the SPFL. Then Aberdeen and Hearts also voiced separate concerns, claiming that the new agreement put the revenue structure which underpinned the top flight at risk. A summit at Hampden to hold crisis talks over the ongoing spat last year never came to fruition. This latest dispute, according to the Daily Mail, has arisen now because the league’s contract with the Loch Lomond Group, producers of Glen’s Vodka, is close to being renewed. The report states that, just like they did for the cinch deal, Rangers have told other Scottish Premiership clubs that they feel ‘unable to fulfil any aspect of the new agreement’. The Ibrox club argues that the aforementioned revised resolution excuses them not only from promoting cinch, but from promoting ANY sponsorship deals agreed by the SPFL before the end of the cinch contract in 2026. The latest twist has the potential, according to the Mail, to have ‘nuclear’ ramifications. It’s being said that Ibrox chiefs have called for the heads of SPFL bosses including chief executive Neil Doncaster, chairman Murdoch MacLennan and legal adviser Rod McKenzie. And Gers managing director Stewart Robertson has reportedly warned all 42 senior teams of sky-rocketing legal costs should the debate rumble on. Should Rangers opt out of the agreement with Glen’s/the Loch Lomond Group, it’s likely the money put on the table by the distilling company in a new deal would be less than previously expected. In addition to Glen’s Vodk,a the Loch Lomond Group also produce Bem Lomond Scottish Gin, Glen Scotia Whisky and Loch Lomond Whisky. Tennent Caledonian, the brewers of Scotland’s biggest-selling lager Tennents, is listed as one of Rangers’ commercial parnters. Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-03-31 22:25:51","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Wellington Phoenix lose another lead against lowly Melbourne Victory in A-League","link":"https://www.nzherald.co.nz/sport/wellington-phoenix-lose-another-lead-against-lowly-melbourne-victory-in-a-league/PUWLHN3PDBCTROWOKA2YATLYQA/","keywords":null,"creator":null,"video_url":null,"description":"The Wellington Phoenix have once more squandered a lead.","content":"The Wellington Phoenix have once more squandered a lead to lose to the lowly Melbourne Victory. Oskar Zawada put his side ahead midway through the first half at Sky Stadium but the Phoenix spurned chances for a second goal and eventually fell to a potentially pivotal 2-1 defeat. While fifth-placed Wellington still have a bit of breathing room in their bid to qualify for the six-team playoffs, the dropped points could prove costly in their quest to host finals football. If they are indeed forced on the road, Ufuk Talay’s side will rue their two clashes against the Victory. Advertisement Advertise with NZME. Just as in February, Melbourne entered today’s match on the bottom rung of the A-League Men ladder. And after an early Zawada strike was also overturned across the Tasman, the Phoenix were helpless to prevent history repeating in Wellington. The Polish striker needed 25 minutes to rediscover his scoring touch after missing the 5-1 thrashing by Adelaide for the birth of his child. Zawada pounced on a defensive mistake from Damien Da Silva to lob goalkeeper Paul Izzo, finding the net in his fifth straight game while taking his season total to 13. But after Izzo produced a couple of crucial saves to deny Yan Sasse and Steven Ugarkovic, Melbourne made their opponents pay for lapses in set-piece concentration. First, the Phoenix failed to track Bruno Fornaroli’s run and allowed him to nod in an equaliser on the hour mark. Then, Da Silva atoned for his error by heading home another corner in the 76th minute, leaving captain Alex Rufer frustrated. Advertisement Advertise with NZME. “We were poor from set pieces and they punished us,” he told Sky Sport. “We switched off. It’s not an individual; it’s collectively. “We need to be better from those moments and we let ourselves down massively.” Rufer remained hopeful his side could earn the top-four finish they required to host a playoff game, despite having to head across the Tasman for three of their final four matches. “It’s a big blow, but we’ve got four games left,” he said. “We know where we are. Yes, it’s disappointing, but we go again. We believe in ourselves, we’re a good team, and it’s down to us now.” The Phoenix women, meanwhile, have earned the wooden spoon for the second straight season, with a 99th-minute equaliser against Melbourne Victory not enough to climb out of 11th place. Wellington required a win over the defending champions to have any hope of avoiding that unwanted prize, but those chances were grim when the visitors scored two superb goals in the first 26 minutes. Alana Murphy put Melbourne in front by putting a free kick in the top corner from the edge of the box, before Melina Ayres turned Marisa van der Meer and fired high into the net from a tight angle. The Phoenix pulled back a goal with 15 minutes to play when Victory custodian Casey Dumont couldn’t clean up trouble outside the area, leaving her goal unguarded for Ava Pritchard to make it 2-1. Grace Wisnewski then managed to bundle home a leveller with virtually the last kick of the game, ending the campaign on a positive note. Having finished their inaugural season with two wins, seven points and a goal difference of minus-23, the Phoenix at least improved on each count, collecting three wins, 13 points and finishing on minus-10. Advertisement Advertise with NZME. But with the final position the same, Wellington will have to content themselves by playing potential spoiler for Melbourne, leaving the Victory relying on other results to remain in the top four and sneak into the semifinals. Melbourne Victory men 2 (Bruno Fornaroli 58, Damien Da Silva 76) Wellington Phoenix men 1 (Oskar Zawada 25) Wellington Phoenix women 2 (Ava Pritchard 75, Grace Wisnewski 90+9) Melbourne Victory women 2 (Alana Murphy 4, Melina Ayres 26) Advertisement Advertise with NZME. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-04-01 05:45:00","image_url":"https://www.nzherald.co.nz/resizer/eWafAgks8LBkrtju-XdOUs_YbZ4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/BHIMCALVLJAXDGVCJTDR5DCQJI.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Fútbol: ranking de los 10 mejores jugadores de la historia del deporte rey","link":"https://www.eltiempo.com/deportes/futbol-internacional/futbol-los-10-mejores-jugadores-de-todos-los-tiempos-755610","keywords":["Fútbol Internacional"],"creator":null,"video_url":null,"description":"La historia del fútbol ha tenido verdaderos campeones que maracron época ¿quiénes son?","content":"Es muy difícil hablar de los jugadores que han marcado una época en el fútbol mundial, son muchos los futbolistas que deleitaron a los aficionados del mundo y se hicieron un nombre en los libros dorados del deporte rey. Acá rememoramos algunos que pasaron a la historia. (Lea aquí: Ni Maradona, ni Pelé: polémica clasificación de los mejores de la historia ) Lionel Messi junto a Rodrigo de Paul con la Copa del Mundo en Qatar 2022. Instagram: rodridepaul Sin duda alguna el nombre del astro argentino debía estar en el ranking de los mejores jugadores del fútbol mundial. En las últimas dos décadas Lionel ha logrado batir todos los récords posibles y ha maravillado a los hinchas con jugadas imposibles de realizar. Messi fue clave en la mejor etapa en la historia del Barcelona de España en donde conquistó todo lo que un jugador podía ganar: 10 ligas, 8 supercopas, 3 Mundiales de Clubes, 7 Copas del Rey, 4 Champions y 3 Supercopas de Europa. El eterno 10 ha dejado su huella tras ganar 6 Balones de Oro, una Copa América, 1 Finallissima y la tan anhelada Copa del Mundo de la FIFA que logró en Qatar 2022 con la Selección Argentina. El portugués ha marcado una era inolvidable junto con Messi, el luso ha conquistado títulos en Inglaterra, Portugal, España e Italia, dejando su marca en cada uno de los clubes donde jugó. CR7 tiene en sus vitrinas 5 Balones de Oro, 5 Champions, siendo el máximo goleador de la competición. Pero los títulos no paran ahí, Cristiano Ronaldo posee un palmarés único con 7 títulos de liga, 4 copas, 7 supercopas, 4 Mundiales de Clubes y una Eurocopa con la Selección de Portugal. Cristiano Ronaldo acumula cinco trofeos del Balón de Oro. EFE La ‘sonrisa del fútbol’ descrestó con sus jugadas a la generación de principios del Siglo XXI, ‘Dinho’ asombró al mundo del fútbol con pura magia y es de los pocos jugadores en conquistar una Champions League, un Mundial de la FIFA, un Balón de Oro, una Copa América y una Copa Libertadores. Fue Ronaldinho en el 2005 el que ganó las dos distinciones. El Balon de Oro de 'France Football' y Mejor Jugador Mundial de la Fifa. Archivo / EL TIEMPO El ‘Pelusa’ no podía faltar en el ranking debido a sus hazañas tanto dentro como fuera del campo, el ‘10’ se convirtió en la bandera de la Selección Argentina y fue clave para que la albiceleste conquistara el Mundial de México 86. Diego Armando Maradona también pasó a la historia en Italia luego de llevar a un equipo como el Napoli a levantar 2 títulos de la Liga italiana y competirle mano a mano a los colosos del norte como Milan Inter y Juventus. En Nápoles el argentino es considerado un dios. Maradona EFE Pelé Archivo / EL TIEMPO El astro brasileño cambió la historia de la Selección de Brasil y fue el responsable de que el pueblo de su país olvidara el famoso Maracanazo. Pelé es la máxima leyenda de su nación tras levantar 3 títulos de la Copa del Mundo (1958, 1962 y 1970). Además, el eterno 10 logró triunfar con la casaca del Santos, club de sus amores con el que ganó en todas las competencias donde jugó. Según los libros del fútbol, ‘O rei’ es el máximo artillero del deporte con 1282 tantos. El ‘Gordo’ Ronaldo es sin duda alguna el número 9 más intimidante del mundo, su potencia, sus arranques y sus goles lo convirtieron en el mejor del mundo en 1997 y 2002 donde ganó sus dos Balones de Oro. (También le puede interesar: Luis Díaz, entre los 10 jugadores más caros del mundo, por millonaria cifra ) Ronaldo Nazario tiene en sus vitrinas dos Copas del Mundo, siendo clave en la conquistada ante Alemania en el 2002. Además, es el único jugador en la historia en jugar en el Real Madrid, el Barcelona, el Milan y el Inter, equipos con rivales históricas y donde él tiene un cariño y recuerdo especial. El holandés, mítico jugador de Ajax y Barcelona, fue subcampeón con su selección en el Mundial de 1974, el cual se disputó en Alemania Occidental. Archivo El neerlandés es el responsable de cambiar la historia del fútbol desplegando un fútbol total jamás visto en el mundo durante la década de los 70. Johan Cruyff es el símbolo de aquella Selección de Holanda que quedó en la historia como la Naranja Mecánica. Es la elegancia y la clase del fútbol, el francés maravilló con sus ‘pasos de baile’ dentro del terreno de juego a los aficionados que lo vieron levantar la Copa del Mundo con su país en 1998. En cuanto a clubes, Zinedine Zidane es leyenda indiscutida de la Juventus de Italia y el Real Madrid , club con el que se consagró en la Champions League. Zinedine Zidane como entrenador del Real Madrid. EFE El ‘Káiser’ es sin duda uno de los mejores jugadores de la historia de Alemania, su estilo de juego en la defensa le permitieron a los teutones levantar la Copa del Mundo de 1974. En su país es el máximo ídolo del Bayern Mínich. El histórico delantero argentino del Real Madrid, Alfredo Di Stéfano, protagonizó en 1956 con la película 'La Saeta Rubia' en la que se interpretó a sí mismo. EFE El colombo-argentino se convirtió en el primer futbolista en ser estrella mundial gracias a su estilo único de juego. Di Stéfano marcó una historia imborrable en Millonarios Y Real Madrid en la década de los 50. Con el conjunto blanco, el histórico jugador logró ganar 5 Copa de Europa consecutivas, todo un récord el cual va a ser muy difícil de superar. Falcao García, papá por quinta vez: 'El amor se multiplica y nosotros también' Deportes Tolima: los récords que marcaron su historia en el fútbol colombiano Luis Díaz: ‘baldado de agua fría’ tras su regreso a entrenamientos en Liverpool Harold Yepes REDACCIÓN ÚLTIMAS NOTICIAS","pubDate":"2023-04-01 00:04:12","image_url":null,"source_id":"eltiempocl","category":["sports"],"country":["singapore"],"language":"spanish"},{"title":"Boos or no Boos, Bowes is an all-in Cat before Suns return","link":"https://www.themercury.com.au/sport/afl/jack-bowes-allin-at-geelong-ahead-of-return-to-gold-coast/news-story/2f663027c1a6d7f28b933dab375f16a5","keywords":["AFL","Geelong"],"creator":null,"video_url":null,"description":"Jack Bowes may have circled his homecoming on the calendar weeks out from the start of his first season with Geelong but the reception he will receive when playing his old club remains unknown.","content":"Unlike the chorus of jeers that took over the MCG in round 1 when Ollie Henry played for the Cats against his old side Collingwood, Bowes may receive a quiet reception when he runs out in the hoops against Gold Coast on Sunday.The Cairns native didn’t have any plans of leaving the Suns until the club came to him and revealed its plan to shed his salary by offloading him elsewhere, a move that left Bowes “gutted”.Even Suns co-captain Touk Miller said this week that the move wasn’t on Bowes.“I hope the crowd doesn’t boo him because he’s done a lot for the club,” Miller said.“I know it’s part of football, but you’ve got to respect that he was in a situation that wasn’t in his favour in the end … I’m looking forward to seeing him.”While he is keen to face up to his old team, since picking Geelong as his trade destination of choice, Bowes has been all-in on Geelong.Like many recruits or draftees, he had dinner at former club vice-president Bob Gartland’s house to check out his extensive collection of Cats memorabilia.After 83 games with the Suns, Bowes was handed a Geelong jumper to debut against Carlton in round 2.“I just feel honoured to be able to pull on the jersey,” he said.“It meant a lot, it was an absolute privilege. This club has so much history and I am just glad to be part of it.”Bowes was sent to the half-back flank to start his first game with Geelong after not training there at all throughout pre-season.With the Cats missing a plethora of defenders – Tom Stewart, Jack Henry, Mitch Duncan and Jake Kolodjashnij – Bowes was happy to be sent where he was needed.In unfamiliar surrounds, Bowes was one of Geelong’s best early in the loss to Carlton, showing off the shrewd kicking that impressed coaches in his first pre-season with the club.He went at 80 per cent efficiency with his 20 disposals – 15 of them kicks – but fluffed a simple shot at goal as Geelong was making a late comeback.“I haven’t done any training at half-back all pre-season, it was sort of in the middle and half-forward,” he said.“I am in a position where I can play a few different roles for the team and wherever I am called upon, I can play those roles.“I think wherever I am playing my footy, I am going to try and help in any role I can for the team.”Defence not up to it: BowesFirst-game Cat Jack Bowes says Geelong’s defence wasn’t on the same page in Thursday’s tight loss to Carlton as the reigning premiers iron out some kinks in their game.For the second week running, the Cats battled to get their hands on the ball and were well beaten on the outside as the Blues gathered 36 more uncontested possessions just six days after Collingwood had 63 more than Geelong.In both those losses, the Cats struggled to stem the flow as the Blues and Pies moved the ball with ease, with the 215 combined points the most Geelong has conceded in a two-game span since early 2017.Bowes said the Cats were off early before some tweaks made at half-time swung the game in their favour.AFL: Carlton have picked up a big win in front of a huge crowd against the Geelong Cats at the MCG.“Full credit to Carlton, I think they were fantastic in the way they approached the game,” he said.“They chipped the ball around on us a bit early and got a lot of uncontested marks and we weren’t able to stop that.“We sort of got the game on our terms in the second half but probably left our run a little bit too late.“It’s easier to stop (an opponent) when we are all on the same page and connected but we just felt like our defensive system wasn’t on from the start. But once we were able to turn that around after half-time, we were able to keep that to a minimum.“It was just the start of the game that let us down.”Geelong will take a 10-day break to tinker with its game before meeting Gold Coast next Sunday.Bowes, who didn’t experience Geelong’s run to the flag last year and was traded in from the Suns over the off-season, said he had no concerns about his side competing at the highest level this year, despite an 0-2 start.“We are confident our best footy can beat everyone, we are going to do whatever we can and keep working on those things that we can tinker at and play our best footy,” he said.","pubDate":"2023-04-01 00:00:00","image_url":null,"source_id":"mercury","category":["sports"],"country":["australia"],"language":"english"},{"title":"Michigan basketball star Hunter Dickinson enters transfer portal","link":"http://rssfeeds.freep.com/~/733368791/0/freep/sports~Michigan-basketball-star-Hunter-Dickinson-enters-transfer-portal/","keywords":null,"creator":["Tony Garcia"," Detroit Free Press"],"video_url":null,"description":"Michigan basketball's Hunter Dickinson, an All-Big Ten big man who averaged 18.5 points and 9.0 rebounds this year, is entering the transfer portal.       ","content":"Hunter Dickinson has led Michigan basketball in scoring and rebounding for three consecutive seasons. He likely will not do so for a fourth straight season. The 7-foot-1 center has entered the transfer portal for his senior season, another significant loss for the Wolverines, who already lost one starter to the NBA draft in freshman Jett Howard. 'MOORE' OF THE SAME: Don't expect Michigan football's offensive identity to change with Sherrone in charge Dickinson, named All-Big Ten first team and Associated Press All-American honorable mention this year, averaged 18.5 points and a career-best 9.0 rebounds while starting in all 34 games he played this season. The junior had 14 double-doubles and scored in double figures 31 times as he became the eighth Wolverine ever to score at least 1,500 points and grab more than 750 rebounds in a career. “Today is bittersweet,\" Michigan coach Juwan Howard said in a statement. \"While Hunter Dickinson's departure is unfortunate, there are so many reasons to be thankful for and celebrate. This young man has accomplished so much in his three seasons. Statistics aside, Hunter helped us to a Big Ten title, back-to-back Sweet 16s, as well as a memorable Elite Eight run. These are memories that will last a lifetime.\" Dickinson finishes his three years at Michigan 12th in career points (1,617) and ninth in rebounds (787). Had he stayed and matched his totals from a season ago, he would've moved into third all-time on the school's scoring list and first all-time in rebounding. For all of his talent, the NBA no longer desires a traditional, back-to-the-basket big man and although he has significantly improved his 3-point shooting — he made 42.1% of his attempts (24-for-57) last year after shooting 32.8% the season prior — he is not currently projected to be a first-round NBA draft pick. Beyond that, he's still set to continue to make some decent money in college via his NIL deals. RELATED: How Michigan hockey went through hell and back to return to Frozen Four Earlier this season, Dickinson's NIL value was as high as $800,000, per On3 Sports. For perspective, only Blake Corum ($1.1 million) and J.J. McCarthy ($837,000) are currently higher than that among U-M athletes. But as much as anything, it appears Dickinson wants to ensure he goes out as a winner. Dickinson won a national championship in AAU in high school, was an All-American playing in the Elite Eight his freshman season and then a dominant center who made the Sweet 16 as a sophomore. This season, as a junior, seemed an anomaly. Michigan didn't win a single significant non-conference game and made a habit of finding ways to snatch defeat from the jaws of victory. Of U-M's 16 losses, 13 came within six points or in overtime. “I feel like that’s the moral of the season so far,\" Dickinson said after a particularly tough one-point loss to Indiana in mid-February. \"Just not capitalizing on those opportunities that we get.” U-M limped down the finish, lost its final three games and missed the NCAA tournament for the first time since 2015. But the cherry on top came when U-M led by eight points in the final minute of a second-round NIT game at Vanderbilt before turning the ball over three times and allowing nine straight points in a season-ending loss . \"We just gave them the game,\" said a dejected Dickinson afterwards. There were tough times personally for Dickinson, too. He wore a ski mask into Kohl Center in Madison to signify U-M was going to \"steal\" a victory, before U-M fell, 64-59. Twice he found himself in hot water after making comments on the \"Roundball Podcast\" (part of his NIL dealings with Barstool Sports), once when he called Wisconsin's basketball team \"scumbags,\" the other when he said students only go to Michigan State if they \"don't get into Michigan.\" \"I know as a Michigan man, no Michigan State fan is ever going to like you, so it’s like, why even try?,\" he said before the season. \"I’d rather just have them hate me than be average. For me, it’s funny. I try to be funny, and I have a great time with it.\" But there were also highs. He had a 32-point, 12-rebound day in a bounce-back win over Maryland, a 31-point performance at Little Caesars Arena and though it came in a loss, his 31-point, 16-rebound night at Illinois in early March may have been the best of his career. However nothing matched his game-tying 3-pointer to force overtime against the Badgers in late February in a comeback 87-79 overtime win. \"Hunter has never wavered, never one foot in, one foot out,\" said an emotional Juwan Howard after that win. \"He's shown he's a true Michigan man. He's dialed in to represent what this team is all about. I'm all in with Hunter and I support him because I know where his heart is. He wants that attention so he can be the bad guy. It's unfair because Hunter, he's really a lovable person. \"I love being around him. I've learned a lot from him.\" It does create a domino effect as far how it impacts the rest of the roster. Tarris Reed Jr.'s development was one of the bright spots this season; now he's primed to become the team's starting center, but the experience or talent in the frontcourt is limited. The trio of power forwards — Terrance Williams II, Will Tschetter and Jace Howard — all struggled last season. There's also redshirt freshman Gregg Glenn and incoming freshman Papa Kante, but neither has collegiate experience. The best iterations of Michigan's team next season had Dickinson on the roster. Now, Howard will likely need to go to the portal to help fill the void left in the middle of the court. Contact Tony Garcia at apgarcia@freepress.com . Follow him on Twitter at @realtonygarcia.","pubDate":"2023-03-31 23:28:40","image_url":"https://www.gannett-cdn.com/presto/2023/02/26/PDTF/f9853758-662e-4d31-a802-7d2f7a4e70ed-02262023_umbball-58.jpg","source_id":"freep","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Newcastle stars to give Man Utd a guard of honour for winning the Carabao Cup when they meet in huge Prem clash","link":"https://www.thescottishsun.co.uk/sport/football/10452963/newcastle-carabao-cup-guard-of-honour-man-united/","keywords":["Football","Sport","EFL Cup"],"creator":["Kiro Evans"],"video_url":null,"description":null,"content":"NEWCASTLE are planning to give Manchester United a guard of honour tomorrow recognising their Carabao Cup triumph. February’s loss in the Wembley final means Toon fans are still without a domestic trophy since 1955. AlamyNewcastle fans took over Trafalgar Square as they descended upon London for February’s domestic cup final[/caption] That has not stopped Newcastle giving the green light to a grand gesture to the Red Devils when they visit St James’ Park. The idea was proposed by Toon supporters group Trophies Don’t Matter, which boasts Newcastle having the best fans in the world is more important than silverware. TDM spokesman Lipra Olof said: “It is only right we salute our friends from Manchester. They were deserved winners. “We had a lovely day at Wembley and took over Trafalgar Square before the match, which is the most important thing.” Players will line up by the tunnel as their rivals walk out and boss Eddie Howe is to present Erik ten Hag with a plaque and flowers. The match is a key clash in the race for the Champions League spots with Newcastle in fifth, three points behind third-placed United.  The pair are scrapping for the spots alongside managerless Tottenham and overachievers Brighton and Brentford, who meet tomorrow. Just eight points separate the six sides as the season reaches its penultimate month. HOW TO GET FREE BETS ON FOOTBALL United are looking for silverware in other competitions. The Red Devils face a Europa League quarter-final tie with Sevilla later this month as well as another trip to Wembley to take on Brighton in the FA Cup.","pubDate":"2023-03-31 23:01:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘Big opportunity’: Record numbers boost start of Football NSW year","link":"https://www.themercury.com.au/sport/football/the-2023-nsw-football-season-kicks-off-with-record-numbers-of-participation-across-all-associations/news-story/21e15da2eacd04e34a71b14c003954ac","keywords":["Football","Swoop"],"creator":null,"video_url":null,"description":"ON THE back of the success of the Socceroos’ FIFA World Cup success and the upcoming Women’s World Cup on home soil, excitement for football has never been bigger.","content":"Football NSW has benefited massively from this hype, with a record number of 5-12 year olds signing up for the season which kicks off today.Head of women’s and schools’ football at Football NSW, Hayley Todd, said the increase in junior registrations has been incredible, with 176,000 sign-ups across 660 clubs.“We’ve had a five per cent growth on the 2022 numbers, and we’ve still got registrations coming in,” she said.“So we’re really proud that football is heading in a really good direction.”The Western Sydney association has seen the largest growth, up 6.1 per cent on 2022 numbers and a year-to-date growth of 20 per cent.“Western Sydney associations have led the way with the growth,” Todd said.“The year-to-date numbers are just phenomenal.”Macarthur Association club Eschol Park FC has been one of the top growth clubs in NSW, and has seen a nine per cent increase in girls registrations for this year.Club secretary Aimee Besgrove has been involved with the club for over 25 years, and has been a passionate advocate for getting more young girls into the sport.“Five years ago, we only had 550 members, and only six female teams,” she explained.“This year, we have 957 members, and we have 16 all female teams, pure female teams ranging from under sixes all the way up.”Besgrove said ensuring young girls have the opportunity to play with and against all-girl teams is so important to building a love for the sport.“We were finding that at the age of 12, when we were about to make those all girls teams, we didn’t quite have the numbers, because you’re pulling from five different teams to build an all girls team,” Besgrove said.“So we made a decision as a club and as a community in the MacArthur football, to try and start building from the ages of five and six, just all girls teams.“And now it‘s it’s really been like pushed against all clubs, and all communities and numbers are rising.”Todd said Football NSW has a lot of participation and community initiatives running throughout the year to ensure passion for the sport continues to grow even after the Women’s World Cup later this year.“I think this is our biggest opportunity to really drive the growth of the game, both on and off the field,” Todd said.“We’re driving a number of programs targeted at specific age groups that can help set a bridging program between the Women’s World Cup and being able to register for community football in 2024. “And some of those programs such as Miniroos, Kick-On for Girls and the Girls Love Football program will help with providing an opportunity for participants to breach the game and experience the game in a non competitive and soulful environment before they then can transition into community football.”Todd said these initiatives are hoped to build love for football from grassroots all the way to our national teams, with support only set to grow throughout 2023.“It’s an exciting time for female football and football in general.”","pubDate":"2023-03-31 23:00:00","image_url":null,"source_id":"mercury","category":["sports"],"country":["australia"],"language":"english"},{"title":"FA asks UEFA to look into treatment of England fans at Italy Euro 2024 qualifier","link":"https://www.independent.co.uk/sport/football/england-uefa-harry-kane-naples-italian-b2312149.html","keywords":["Football","Sport"],"creator":["Simon Peach"],"video_url":null,"description":"The FA-run England Supporters Travel Club has contacted European football’s governing body.","content":null,"pubDate":"2023-03-31 22:56:13","image_url":"https://static.independent.co.uk/2023/04/01/00/4535e46606cd2ca464f961993e39ddb9Y29udGVudHNlYXJjaGFwaSwxNjgwMzg5MzI1-2.71492549.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ex-Barcelona star’s stunning Wag goes topless on the beach on holiday and shows off bum as he makes cheeky comment","link":"https://www.thescottishsun.co.uk/sport/football/10452906/barcelona-wag-topless-bum-beach-holiday-instagram/","keywords":["Football","Sport","Barcelona transfer news","Holidays","Instagram"],"creator":["Ian Tuckey"],"video_url":null,"description":null,"content":"EX-BARCELONA star Marc Bartra was almost as cheeky as his girlfriend after the model posted a topless photo and showed off her bottom on holiday. Bartra couldn’t resist chipping in on Instagram when Jessica Goicoechea shared revealing shots from a beach in the Maldives with her 1.8million followers. https://www.instagram.com/goicoechea/Jessica Goicoechea went for the almost all-over tan in the Maldives[/caption] https://www.instagram.com/goicoechea/Jessica was more modest when she fronted up for another snap[/caption] Instagram / @goicoecheaIn some ways Spanish model Jessica revealed even more at the Idolo Awards[/caption] Linking his message to Jessica and a glamour photographer, the defender wrote: “@pepeherreros @goi need someone to help you with the next@joan6six6shoot ?? I’m in ” Fashion designer Jessica had let emojis do the talking in her own Instagram message with her pictures. She simply posted: “” One photo had the 26-year-old posing with a naked back and a minimalist bikini bottom. Other pics, from the front, were more modest, although in one snap she had to hold an untied bikini top down to cover her chest. And her followers weere quick to show their appreciation. One wrote: “Maldives+you=”. Another posted: “Insane ” It comes just weeks after she wore slightly more but also displayed a lot more – at a red-carpet event. An apparent wardrobe malfunction at the Idolo Awards left her wearing a dress with beaded strips that left little of her top half to the imagination. That drew replies on Instagram like “Holy moly ” and “This dress just wow.” In contrast, partner Bartra has been out of the spotlight since the 14-cap Spaniard, 32, moved to Trabzonspor for this season. He was with Barca from 2010-2016 before spells with Borussia Dortmund and then Real Betis. GettyThe fashion designer chose her own slant on a classic look at a gala[/caption] PA:Empics SportJessica’s partner Marc Bartra spent six years at Barcelona and moved to Turkey with Trabzonspor this season[/caption]","pubDate":"2023-03-31 22:54:00","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"'Good things are going to happen to Colton': Lebanon senior pitcher Colton Hartman excels in the spotlight","link":"https://www.wcpo.com/sports/high-school-sports/good-things-are-going-to-happen-to-colton-lebanon-senior-pitcher-colton-hartman-excels-in-the-spotlight","keywords":null,"creator":null,"video_url":null,"description":"Lebanon senior pitcher Colton Hartman excelled in his season debut in front of an estimated 30 baseball scouts on Wednesday. The Louisville signee is rated Ohio's No. 2 player overall in his class.","content":"LEBANON, Ohio — Colton Hartman couldn't help but notice the estimated 30 baseball scouts watch him take the mound during Lebanon High School's season opener this past Wednesday. A natural adrenaline rush accompanies the Lebanon High School senior left-handed pitcher knowing the scouts' eyes, cameras, radar guns and smartphones are centered on him. Hartman enjoys the opportunity to thrive in the spotlight. The difference is in the fact that he doesn't let the attention become a distraction. \"You know I grew up playing in this environment,\" Hartman said. \"A lot of people watching so I kind of just blur them out — just me and the catcher when I'm up there.\" Hartman, a University of Louisville signee, is rated Ohio's second-best player overall (regardless of position) in the 2023 class by Prep Baseball Report. He was the only Ohio player selected to participate in the Perfect Game All-American Classic in August. That prestigious event was hosted by Chase Field in Arizona and televised on ESPNU. Nearly a year after that event, Hartman may have an opportunity to be selected in the Major League Baseball Draft in July. The dozens of baseball scouts stood behind the backstop or in the Lebanon press box Wednesday afternoon as Hartman allowed no hits and struck out nine in five innings in a victory over Milford. Jordan Chiero, Prep Baseball Report Ohio's director of scouting, said Hartman's fastball, slider and changeup are very impressive. Chiero said Hartman would also be a Power Five college signee as a position player given his offensive ability. \"What I tell everyone about Colton is he is a great pitcher but even a better individual,\" Lebanon baseball coach Larry Price said. \"He's so high character. I don't think I've ever coached a kid that has higher character and I've had some great kids. But, Colton is special. Good things are going to happen to Colton. He's got some tough decisions — whether to go to college or sign.\" Hartman, 18, admits he's thought about the draft but he isn't focused on any hypothetical baseball matters. He's not looking at any mock drafts. He simply wants to focus on this high school season. \"I grew up with all these guys,\" Hartman said. \"They're all my best buddies. And coming out here and winning games with them, it's the best feeling in the world.\" Lebanon earned its first district title in program history in 2022 and the Warriors want to capture a regional championship this spring. \"I'm super excited for the season,\" Hartman said. \"The team is looking great. As long as we hit and play good defense we'll be great.\" That team-first mentality is why Hartman has earned the respect of his teammates, Price said. \"He's just as humble as can be,\" Price said. \"And the kids love him. He loves the kids.\" That connectivity with his teammates also occurred in football and basketball when Hartman was younger. Hartman also enjoys fishing every other day as a favorite hobby. \"I love being outside; it's a peaceful thing to do,\" said Hartman. \"The adrenaline rush when you get a bite — it's not like anything else. It's like hitting a home run kind of.\" SIGN UP: Subscribe to our high school sports newsletter","pubDate":"2023-03-31 22:33:23","image_url":null,"source_id":"wcpo","category":["sports"],"country":["united states of america"],"language":"english"},{"title":"Rangers and SPFL heading for ‘nuclear’ SECOND sponsorship row as Ibrox chiefs ‘call for league bosses’ heads’","link":"https://www.thescottishsun.co.uk/sport/football/10452713/rangers-spfl-nuclear-second-sponsorship-row-glens-vodka/","keywords":["Football","Scottish Premiership","Sport"],"creator":["Ryan Rowe"],"video_url":null,"description":null,"content":"RANGERS and the SPFL are going to be at loggerheads once again over sponsorship deals, and this time it could go ‘nuclear’, according to a report. The Ibrox club and the league have been embroiled in a bitter row over the contract with car dealer cinch for much of the past year. Andrew BarrSPFL chief executive Neil Doncaster[/caption] SNSRangers’ managing director Stewart Robertson[/caption] The controversy kicked off last season when Gers chiefs claimed that they were unable comply with the terms of the cinch and SPFL contract because they already had an agreement with Park’s Motor Group, owned by Ibrox chairman Douglas Park. It led to the SPFL coming up with a new resolution and it excused Rangers from having to carry the company’s branding within their stadium, on any advertising or on club merchandise. The Ibrox outfit subsequently demanded an investigation and claimed they were INSULTED by the SPFL. Then Aberdeen and Hearts also voiced separate concerns, claiming that the new agreement put the revenue structure which underpinned the top flight at risk. A summit at Hampden to hold crisis talks over the ongoing spat last year never came to fruition. This latest dispute, according to the Daily Mail, has arisen now because the league’s contract with the Loch Lomond Group, producers of Glen’s Vodka, is close to being renewed. The report states that, just like they did for the cinch deal, Rangers have told other Scottish Premiership clubs that they feel ‘unable to fulfil any aspect of the new agreement’. The Ibrox club argues that the aforementioned revised resolution excuses them not only from promoting cinch, but from promoting ANY sponsorship deals agreed by the SPFL before the end of the cinch contract in 2026. The latest twist has the potential, according to the Mail, to have ‘nuclear’ ramifications. It’s being said that Ibrox chiefs have called for the heads of SPFL bosses including chief executive Neil Doncaster, chairman Murdoch MacLennan and legal adviser Rod McKenzie. And Gers managing director Stewart Robertson has reportedly warned all 42 senior teams of sky-rocketing legal costs should the debate rumble on. Should Rangers opt out of the agreement with Glen’s/the Loch Lomond Group, it’s likely the money put on the table by the distilling company in a new deal would be less than previously expected. In addition to Glen’s Vodk,a the Loch Lomond Group also produce Bem Lomond Scottish Gin, Glen Scotia Whisky and Loch Lomond Whisky. Tennent Caledonian, the brewers of Scotland’s biggest-selling lager Tennents, is listed as one of Rangers’ commercial parnters. Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-03-31 22:25:51","image_url":null,"source_id":"thescottishsun","category":["sports"],"country":["united kingdom"],"language":"english"}]}