{"newsArray":[{"title":"Lionel Messi Dinobatkan sebagai Pemain Terbaik FIFA 2022","link":"https://sports.sindonews.com/read/1034111/11/lionel-messi-dinobatkan-sebagai-pemain-terbaik-fifa-2022-1677542565","keywords":null,"creator":["Yova Adhiansyah"],"video_url":null,"description":"Lionel Messi dinobatkan sebagai pemain terbaik FIFA 2022 dalam acara penghargaan The Best FIFA Football Awards 2022, Selasa (28/2/2023) dini hari WIB. Megabintang Paris Saint Germain (PSG) itu mengalahkan....","content":"PARIS - Lionel Messi dinobatkan sebagai pemain terbaik FIFA 2022 dalam acara penghargaan The Best FIFA Football Awards 2022, Selasa (28/2/2023) dini hari WIB. Megabintang Paris Saint Germain (PSG) itu mengalahkan rekan setimnya Kylian Mbappe dan Karim Benzema. Pada malam penghargaan tersebut Messi mendapatkan 52 poin suara. Sementara Mbappe 44 suara dan Benzema 34 suara. Keberhasilan Messi merebut penghargaan ini tak lepas dari penampilannya di musim lalu. Yang paling mencolok adalah Messi sukses membawa Argentina menjuarai Piala Dunia 2022. Itu merupakan pertama kalinya ia mengangkat trofi bergengsi tersebut. BACA JUGA: Irak U-20 Berambisi Juara di Piala Asia U-20 dan Lolos Piala Dunia U-20 2023 Total, sepanjang musim lalu, Messi berhasil mencetak 27 gol dalam 49 pertandingan untuk klub dan timnas Argentina. Beralih ke penghargaan, ini menjadi gelar pemain terbaik dunia ketujuh yang diraih Messi. Dia berada di jajaran teratas perebut gelar terbaik FIFA, di atas Cristiano Ronaldo dengan lima gelar. \"Sungguh menakjubkan. Ini merupakan tahun yang luar biasa dan merupakan kehormatan bagi saya untuk berada di sini dan memenangkan penghargaan ini. Tanpa rekan satu tim saya, saya tidak akan berada di sini. Saya mencapai impian yang sudah lama saya harapkan. Sangat sedikit orang yang bisa mencapainya dan saya beruntung bisa melakukannya,\" ungkap Messi dikutip dari BBC Sport. Daftar Lengkap Penerima Penghargaan The Best FIFA Football Awards 2022: The Best FIFA Men’s Player - Lionel Messi (Paris Saint-Germain/Argentina) The Best FIFA Women’s Player - Alexia Puttelas (Barcelona/Spanyol) The Best FIFA Men’s Coach - Lionel Scaloni (timnas Argentina) The Best FIFA Women's Coach - Sarina Wiegman (timnas Inggris) The Best FIFA Men’s Goalkeeper - Emiliano Martinez (Aston Villa/Argentina) The Best FIFA Women’s Goalkeeper - Mary Earps (Man United/Inggris) FIFA Puskas Award - Marcin Oleksy (Polandia): Warta Poznan vs Stal Rzeszow (Ekstraklasa, 6 November 2022) FIFA Fair Play Award - Luka Lochoshvili (Cremonese/Georgia) The Best FIFA Fan Award - Suporter Argentina FIFA FIFPro Men's World XI Thibaut Courtois; Achraf Hakimi, Virgil van Dijk, Joao Cancelo; Kevin De Bruyne, Luka Modric, Casemiro; Lionel Messi, Kylian Mbappe, Karim Benzema, Erling Haaland FIFA FIFPro Women's World XI Christiane Endler; Lucy Bronze, Leah Williamson, Wendie Renard, Mapi Leon; Alexia Putellas, Keira Walsh, Lena Oberdorf, Alex Morgan, Sam Kerr, Beth Mead Lihat Juga: Lionel Messi Wujudkan Mimpi Ibunya Lisandro Martinez: Terima Kasih Master Sepak Bola (yov)","pubDate":"2023-02-28 00:59:47","image_url":"https://pict.sindonews.net/dyn/850/pena/news/2023/02/28/11/1034111/lionel-messi-dinobatkan-sebagai-pemain-terbaik-fifa-2022-rdm.jpg","source_id":"sindonews","category":["sports"],"country":["indonesia"],"language":"indonesian"},{"title":"Cinderella story? Off-contract McGovern brothers consider future","link":"https://www.watoday.com.au/sport/afl/cinderella-story-off-contract-mcgovern-brothers-consider-future-20230228-p5co3o.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Carlton’s Mitch McGovern and his brother Jeremy, of West Coast premiership fame, are off contract this year. Their managers have not ruled out the pair playing together in 2024.","content":"Off-contract Carlton defender Mitch McGovern and his free-agent West Coast brother Jeremy could try and play together next season, as each weighs up their footballing futures. Mitch McGovern, 28, is coming to the end of a five-year deal with the Blues worth about $800,000 a season, while Jeremy, the 30-year-old premiership player with the Eagles, is one of the league’s hottest free agents. The McGovern brothers’ management team, Colin Young and Andrew McDougall, of Corporate Sports Australia, told The Age the two Perth-born defenders have a big call to make. Mitch McGovern is in the final year of his contract with the Blues. Could he pair up with his brother Jeremy next season? Credit: Getty Images “That could be quite interesting. We’ll wait and see,” McDougall said of a possible one-club pairing. “Mitch is out of contract. He has got a year to run. He is really enjoying it at Carlton and has settled in really well, but he is only 28, so it will be interesting to see how this year plays out. Loading “‘Vossy’ [Blues coach Michael Voss] really likes him, he knows he is a great player, standing up in the back line.” Added Young: “I am not saying it. Jeremy said it on a podcast – it would be ideal if they did [play together] one day – but sometimes Cinderella stories don’t work.” Mitch McGovern has battled several injury issues, having been restricted to 33 games since leaving the Crows with two years left on his contract, and linking with the Blues ahead of the 2019 season. He managed only seven games last year because of injury – enjoying a new role in defence – but played in the final five, reinforcing that he is in the Blues’ best 22.","pubDate":"2023-02-28 00:52:14","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sports club votes to skip 2023 season after floods","link":"https://www.perthnow.com.au/sport/afl/sports-club-votes-to-skip-2023-season-after-floods-c-9891432","keywords":null,"creator":["Adrian Black"],"video_url":null,"description":"A sports club on the NSW-Victorian border will not field senior football and netball teams in 2023, after being devastated by flood damage and player losses.","content":"A historic country footy and netball club devastated by floods and player shortages will not field senior teams this year, in the hopes it can regroup in 2024. The Corowa-Rutherglen Football Netball Club's facilities were completely inundated when floodwaters breached the Murray River's banks in November. In a meeting on Monday night, a majority of members voted to forgo the 2023 season, while still fielding teams in the under-15s, under-17s and C-grade. Secretary Rowena Black said the decision had not been taken lightly by the club, which has produced several AFL players and coaches. \"There were past players there who have been connected to the club for decades that ... had a tear in their eye, they were really heartbroken,\" Ms Black told ABC Radio. Former club players include Coleman Medallist and North Melbourne flag winner turned Sydney Swans premiership coach John Longmire, ex-Carlton coach David Teague, Collingwood premiership defender Mick Gayfer, and Carlton 201-gamer Ryan Houlihan. Ms Black said shifting demographics in the NSW-Victoria border region had contributed to the decision. \"There are too many player spots, not enough players,\" she said. \"The population base is obviously ageing and ... we're really looking at how do we keep that young group of people in our area that want to play here.\" Ms Black said the club will contact sponsors that had signed up for two-year deals. \"We will definitely be going to them and having a conversation and saying, 'Look, we will ... pause the sponsorship this year and we would love to see you guys get back on board next year',\" she said. \"Our sponsors are fantastic.\" The club, formed in 1979 when the Corowa Spiders and Rutherglen Redlegs merged, was founded as the Border United Football Club in 1877, and has produced numerous VFL and AFL stars.","pubDate":"2023-02-28 00:15:39","image_url":"https://images.perthnow.com.au/publication/C-9891432/9fb6151f765272784a6a1534c99817d929561a0a-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"\"ลิโอเนล เมสซี\" คว้ารางวัลนักเตะชายยอดเยี่ยมของฟีฟ่า 2022","link":"https://www.thaipbs.or.th/news/content/325027","keywords":["กีฬา"],"creator":["webmaster@thaipbs.or.th"],"video_url":null,"description":"เมื่อวันที่ 27 ก.พ.2566 ลิโอเนล เมสซี กองหน้าทีมชาติอาร์เจนตินา ของปารีส แซงต์-แชร์กแมง ได้รับเลือกให้คว้ารางวัลนักฟุตบอลชายยอดเยี่ยมของฟีฟ่า หรือ The Best FIFA Men's Player 2022 หลังจากที่มีการประกาศมอบรางวัลอย่างเป็นทางการ ที่กรุงปารีส ประเทศฝรั่งเศส  เมสซี วัย 35 ปี ได้รับการโหวตเป็นอันดับ 1 ตามคาด โดยชนะคีเลียน เอ็มบัปเป้ เพื่อนร่วมสโมสร ปารีส แซงต์-แชร์กแมง และ คาริม เบนเซมา กัปตันทีมเรอัล มาดริด จากผลงานสำคัญคือ ช่วยทีมชาติอาร์เจนตินา คว้าแชมป์ฟุตบอลโลกเมื่อช่วงปลายปีที่แล้ว ซึ่งเมสซีได้รางวัลผู้เล่นยอดเยี่ยมประจำทัวร์นาเมนต์ฟุตบอลโลกด้วย สำหรับ เมสซี ได้รางวัลนี้เป็นสมัยที่ 2 ต่อจากปี 2019 มากสุดเทียบเท่ากับ คริสเตียโน โรนัลโด และโรเบิร์ต เลวานดอฟสกี้ ส่วนรางวัลผู้รักษาประตูยอดเยี่ยมเป็นของเอมิเลียโน มาร์ติเนซ ผู้รักษาประตูทีมชาติอาร์เจนตินา ของแอสตัน วิลล่า ที่ช่วยเซฟประตูสำคัญช่วยทีมคว้าแชมป์โลก และโค้ชยอดเยี่ยมฟีฟ่า เป็นของลิโอเนล สกาโลนี่ โค้ชทีมชาติอาร์เจนตินาเช่นกัน ขณะที่นักเตะหญิงยอดเยี่ยมฟีฟ่าเป็นของอเล็กเซีย ปูเตร์ยาส แข้งสาวทีมชาติสเปน จากบาร์เซโลนา เจ้าของรางวัลบัลลงดอร์คนล่าสุด และรางวัลปุสกัส อวอร์ด หรือประตูสุดสวยประจำปีของฟีฟ่า เป็นของมาร์ซิน โอเล็กซี่ แข้งคนพิการของทีมวาร์ตา พอซแนน ที่กลายเป็นนักเตะคนพิการคนแรกที่คว้ารางวัลนี้ไปครอง สำหรับรางวัล ธ และ Ballon d'Or หรือ บัลลงดอร์ เป็นคนละรางวัลกัน โดยรางวัล The Best FIFA Football Awards เริ่มต้นในปี 2016 ที่ผ่านมา แยกออกมาจาก Ballon d'Or โดยจะให้สิทธิ์ตัวแทนผู้สื่อข่าวจากประเทศต่าง ๆ ที่มีสิทธิ์โหวต แตกต่างกับบัลลงดอร์ ที่ให้กัปตันทีมและโค้ชแต่ละชาติร่วมโหวตด้วย  ","content":"เมื่อวันที่ 27 ก.พ.2566 ลิโอเนล เมสซี กองหน้าทีมชาติอาร์เจนตินา ของปารีส แซงต์-แชร์กแมง ได้รับเลือกให้คว้ารางวัลนักฟุตบอลชายยอดเยี่ยมของฟีฟ่า หรือ The Best FIFA Men's Player 2022 หลังจากที่มีการประกาศมอบรางวัลอย่างเป็นทางการ ที่กรุงปารีส ประเทศฝรั่งเศส เมสซี วัย 35 ปี ได้รับการโหวตเป็นอันดับ 1 ตามคาด โดยชนะคีเลียน เอ็มบัปเป้ เพื่อนร่วมสโมสร ปารีส แซงต์-แชร์กแมง และ คาริม เบนเซมา กัปตันทีมเรอัล มาดริด จากผลงานสำคัญคือ ช่วยทีมชาติอาร์เจนตินา คว้าแชมป์ฟุตบอลโลกเมื่อช่วงปลายปีที่แล้ว ซึ่งเมสซีได้รางวัลผู้เล่นยอดเยี่ยมประจำทัวร์นาเมนต์ฟุตบอลโลกด้วย สำหรับ เมสซี ได้รางวัลนี้เป็นสมัยที่ 2 ต่อจากปี 2019 มากสุดเทียบเท่ากับ คริสเตียโน โรนัลโด และโรเบิร์ต เลวานดอฟสกี้ ส่วนรางวัลผู้รักษาประตูยอดเยี่ยมเป็นของเอมิเลียโน มาร์ติเนซ ผู้รักษาประตูทีมชาติอาร์เจนตินา ของแอสตัน วิลล่า ที่ช่วยเซฟประตูสำคัญช่วยทีมคว้าแชมป์โลก และโค้ชยอดเยี่ยมฟีฟ่า เป็นของลิโอเนล สกาโลนี่ โค้ชทีมชาติอาร์เจนตินาเช่นกัน ขณะที่นักเตะหญิงยอดเยี่ยมฟีฟ่าเป็นของอเล็กเซีย ปูเตร์ยาส แข้งสาวทีมชาติสเปน จากบาร์เซโลนา เจ้าของรางวัลบัลลงดอร์คนล่าสุด และรางวัลปุสกัส อวอร์ด หรือประตูสุดสวยประจำปีของฟีฟ่า เป็นของมาร์ซิน โอเล็กซี่ แข้งคนพิการของทีมวาร์ตา พอซแนน ที่กลายเป็นนักเตะคนพิการคนแรกที่คว้ารางวัลนี้ไปครอง สำหรับรางวัล ธ และ Ballon d'Or หรือ บัลลงดอร์ เป็นคนละรางวัลกัน โดยรางวัล The Best FIFA Football Awards เริ่มต้นในปี 2016 ที่ผ่านมา แยกออกมาจาก Ballon d'Or โดยจะให้สิทธิ์ตัวแทนผู้สื่อข่าวจากประเทศต่าง ๆ ที่มีสิทธิ์โหวต แตกต่างกับบัลลงดอร์ ที่ให้กัปตันทีมและโค้ชแต่ละชาติร่วมโหวตด้วย","pubDate":"2023-02-28 00:00:41","image_url":"https://news.thaipbs.or.th/media/G0DL5oPyrtt5HBAivUwlRLMjYwKi9FJiGBVVvdbAh3aBLGG4kgEXJi.jpg","source_id":"thaipbs","category":["sports"],"country":["thailand"],"language":"thai"},{"title":"Fécafoot : Le président Samuel Eto’o annonce le décès de son 2e vice-président","link":"https://senego.com/fecafoot-le-president-samuel-etoo-annonce-le-deces-de-son-2e-vice-president_1521779.html","keywords":["Sénégal","Sports","Cameroun","fécafoot"],"creator":["Ankou SODJAGO"],"video_url":null,"description":"Le président de la fédération camerounaise de football, Samuel Eto’o Fils, a annoncé le décès d’un de ses vice-présidents. Boubakary Bello représentait la région de l’extrême-nord au sein du Comité Exécutif. Le décès est survenu ce lundi 27 février 2023 à Maroua des suites de maladie. Ce lundi 27 février, Boubakary Bello alias Kariwa, 2e […]","content":"Le président de la fédération camerounaise de football, Samuel Eto’o Fils, a annoncé le décès d’un de ses vice-présidents. Boubakary Bello représentait la région de l’extrême-nord au sein du Comité Exécutif. Le décès est survenu ce lundi 27 février 2023 à Maroua des suites de maladie. Ce lundi 27 février, Boubakary Bello alias Kariwa, 2e Vice-président de la Fecafoot est décédé des suites de maladie à l’hôpital de la CNPS de Maroua où il était hospitalisé depuis quelques jours. Boubakary Bello était une figure importante dans le landerneau économique et politique de Maroua. Il avait d’ailleurs été maire de Maroua 3 il y a quelques années. Son implication dans le football était entier, puisqu’il a dirigé pendant longtemps la Ligue Régionale de football de l’extrême-nord. C’est une perte immense pour le football camerounais. Et pour la Fécafoot, il était le plus expérimenté au sein du Comité Exécutif. Samuel Eto’o Fils a rendu hommage à l’illustre disparu qui a consacré une bonne partie de sa vie au service du football et à son développement au Cameroun. Il a également présenté ses condoléances à la famille du défunt.","pubDate":"2023-02-27 23:04:24","image_url":null,"source_id":"senego","category":["sports"],"country":["senegal"],"language":"french"},{"title":"Man Utd bắt đầu hành động với Harry Kane","link":"https://www.bongda.com.vn/man-utd-bat-dau-hanh-dong-voi-harry-kane-d674132.html","keywords":null,"creator":null,"video_url":null,"description":"Harry Kane được đánh giá là mục tiêu chuyển nhượng hàng đầu của Man Utd trong hè 2023.","content":"bắt đầu tiến hành \"quan tâm tích cực\" đến việc ký hợp đồng với Harry Kane của Tottenham Hotspurs vào mùa hè năm nay, khi HLV Erik ten Hag tìm cách cải thiện hàng tiền đạo đội bóng. Theo nguồn tin từ Football Insider, Tottenham đã mở cuộc đàm phán với cầu thủ đội trưởng về một hợp đồng mới. Nhưng United đang theo dõi chặt chẽ bởi hợp đồng hiện tại của ngôi sao người Anh sẽ hết hạn vào năm 2024. Man Utd bắt đầu tìm hiểu khả năng chiêu mộ Kane. Điều đó đồng nghĩa nếu không ra đi vào mùa hè này, và trong trường hợp không đồng ý ký vào bản giao kèo mới, Spurs sẽ có nguy cơ mất trắng Kane theo dạng chuyển nhượng tự do. Đây là cơ hội tốt cho Quỷ đỏ khi họ đang tìm cách ký hợp đồng với một tiền đạo trước khi bắt đầu mùa giải mới. Man Utd coi việc chiêu mộ Wout Weghorst chỉ là phương án ngắn hạn, khó có thể đảm nhiệm vai trò dẫn dắt hàng công. Trong khi cầu thủ người Hà Lan gây ấn tượng với khả năng làm việc không biết mệt mỏi của mình, rõ ràng Quỷ đỏ đang rất cần những ngôi sao chất lượng ở tuyến trên để có thể cạnh tranh thực sự cho ngôi vô địch Premier League. Anthony Martial là tiền đạo tài năng nhưng cầu thủ người Pháp thường xuyên dính chấn thương trong mùa giải này. Martial cũng không có phong độ ổn định trong những năm qua. Vì thế, Ở Kane, United chắc chắn sẽ tìm thấy một số 9 có khả năng cải thiện đội bóng ngay lập tức. Với đẳng cấp đã được thể hiện, tiền đạo này sẽ là một cầu thủ lý tưởng để nâng cấp hàng tấn công. Kane sớm đạt mốc 20 bàn thắng ở mùa giải năm nay, với pha dứt điểm tung lưới Chelsea. Ngoài bản năng sát thủ vốn có, Kane cũng rất giỏi trong việc liên kết lối chơi. Anh sẵn sàng hy sinh vì tập thể khi cần. Kane có thể đổi bến đỗ trong hè 2023. Với việc Tottenham đang trong giai đoạn đầu đàm phán và Bayern Munich cũng quan tâm, Kane sẽ phải đưa ra một số quyết định khó khăn trong những tháng tới. Tuy nhiên, United có quyền hy vọng rằng họ sẽ thuyết phục được Kane cập bến Old Trafford. Kane đang đặt mục tiêu vượt kỷ lục 260 bàn của Alan Shearer ở Premier League nên có thể không ra nước ngoài thi đấu. Gần đây, Kane trở thành cầu thủ ghi bàn hàng đầu mọi thời đại của Tottenham, vượt qua thành tích 266 bàn thắng của Jimmy Greaves trên mọi đấu trường. Spurs muốn giữ chân sút chủ lực của mình, nhưng Kane không còn nhiều thời gian. Anh cần tìm kiếm bến đỗ mới để có cơ hội chinh phục chức vô địch. Đây là sự lãng phí rất lớn. Cần biết rằng Manchester United đang dần thay đổi theo chiều hướng tốt hơn. . Và Kane có thể hứng thú với một dự án đầy hứa hẹn tại Old Trafford. Nếu thất bại trong nỗ lực ký hợp đồng với Harry Kane, Man Utd có thể chuyển sự chú ý sang Victor Osimhen.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/hai.phan/2023/02/27/ras-talksport-harry-kane-2301.jpg","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"Đội hình tiêu biểu nam năm 2022: Hàng công 4 người","link":"https://www.bongda.com.vn/doi-hinh-tieu-bieu-nam-nam-2022-hang-cong-4-nguoi-d674137.html","keywords":null,"creator":null,"video_url":null,"description":"FIFA gây bất ngờ khi công bố đội hình 11 cầu thủ nam xuất sắc nhất năm 2022 (Men's FIFPRO World XI) khi có đến 4 tiền đạo hiện diện.","content":"Sau thời gian chờ đợi, gala The Best FIFA Football Awards 2022 đã diễn ra tại thủ đô Paris, nước Pháp. Những cá nhân có màn trình diễn xuất sắc nhất trong khoảng thời gian từ tháng 08/2021 đến hết tháng 12/2022 sẽ được vinh danh ở nhiều hạng mục khác nhau. FIFA cũng công bố bao gồm: Thibaut Courtois, Achraf Hakimi, Virgil van Dijk, Joao Cancelo, Kevin de Bruyne, Casemiro, Luka Modric, Lionel Messi, Erling Haaland, Karim Benzema, Kylian Mbappe. trải qua năm 2022 thành công khi đoạt cú đúp danh hiệu La Liga và Champions League trong màu áo Real Madrid. Đứng trước Courtois là bộ ba ngôi sao phòng ngự Hakimi, Van Dijk và Cancelo. FIFA công bố đội hình tiêu biểu nam năm 2022. Trong khi đó, khu vực trung tuyến vinh danh ba gương mặt Casemiro - De Bruyne - . Bộ đôi Casemiro và Modric cùng vô địch La Liga và Champions League trong màu áo Real Madrid. Ở cấp độ ĐTQG, Modric cùng Croatia về thứ 3 tại World Cup 2022. Bốn gương mặt trên hàng công bao gồm Messi - Benzema - Haaland - Mbappe. Bộ đôi Messi và Mbappe đoạt cú đúp quốc nội Ligue 1, Siêu cúp Pháp trong màu áo PSG. Ở cấp độ ĐTQG, , trong khi Mbappe về nhì trên đất Qatar cùng tuyển Pháp. Haaland trải qua nửa mùa giải 2022/2023 bùng nổ cùng Man City. Gương mặt còn lại, Benzema góp công lớn trên hành trình Los Blancos vô địch La Liga và Champions League.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/02/28/van-dijk-0530.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"CHÍNH THỨC! Messi chiến thắng FIFA The Best","link":"https://www.bongda.com.vn/chinh-thuc-messi-chien-thang-fifa-the-best-d674135.html","keywords":null,"creator":null,"video_url":null,"description":"Siêu sao người Argentina đoạt giải thưởng cá nhân danh giá sau một năm 2022 thành công rực rỡ. Kết quả không nằm ngoài dự đoán của giới chuyên môn.","content":"Rạng sáng nay, gala giải thưởng The Best FIFA Football Awards 2022 đã diễn ra tại nhà hát Salle Pleyel (Paris, Pháp). Liên đoàn bóng đá thế giới (FIFA) bầu chọn cầu thủ nam và nữ xuất sắc nhất dựa trên thành tích từ tháng 08 năm 2021 đến hết tháng 12 năm 2022. Đúng như dự đoán của phần đông giới chuyên môn, siêu sao . Messi trải qua năm 2022 thành công rực rỡ với danh hiệu World Cup 2022 trong màu áo ĐTQG Argentina. Tổng cộng, sau 74 trận đấu, đóng góp 45 bàn thắng, 34 kiến tạo. Ở cấp độ CLB, tiền đạo 35 tuổi vô địch Ligue 1, Siêu cúp nước Pháp cùng PSG. Trong màu áo đội tuyển, Messi nâng cao danh hiệu World Cup 2022 và Siêu cúp liên lục địa. Messi được bầu chọn là Cầu thủ nam xuất sắc nhất năm 2022. Hai đối thủ nặng ký còn lại trong danh sách rút gọn The Best Men's Player là Karim Benzema và Kylian Mbappe. Tiền đạo người Pháp, đoạt cú đúp vô địch La Liga và Champions League cùng Real Madrid. Trong màu áo ĐTQG, Benzema vô địch UEFA Nations League. với danh hiệu Ligue 1, Siêu cúp nước Pháp cùng PSG. Trong màu áo ĐTQG, Mbappe về nhì tại World Cup 2022.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/02/28/messi-0455.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"Messi, Putellas again voted best players at FIFA awards","link":"https://www.perthnow.com.au/sport/soccer/messi-putellas-again-voted-best-players-at-fifa-awards-c-9890530","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Football's world governing body FIFA have named Argentina star Lionel Messi and Spain's Alexia Putellas as their men's and women's players of the year.","content":"Lionel Messi has been named FIFA's player of the year for 2022 as Argentina scooped all of the major men's awards after winning a vintage World Cup final last December. Spain and Barcelona forward Alexia Putellas picked up the women's award. The 35-year-old Messi scored twice in the final against France, as the South Americans emerged triumphant on penalties following a 3-3 draw after extra time in Qatar. \"It's amazing. It was a tremendous year and it is an honour for me to be here tonight and win this award\", said Messi, who sat next to France forward and Paris St Germain teammate Kylian Mbappe throughout Monday's glittering ceremony at Paris' Salle Pleyel. Mbappe, also nominated for the award, netted a hat-trick in the World Cup final but was overshadowed as Messi capped his success-studded career by winning the most coveted trophy in world football. \"I want to express my thanks to (coach Lionel) Scaloni and my teammates, without them I would not be here,\" Messi said. \"It's a dream for any player, very few people can achieve that and I was lucky enough to do so.\" His compatriots Lionel Scaloni and Emiliano Martinez won the coach of the year and goalkeeper of the year awards respectively, and their supporters even got the 'best fans' prize. In the women's game, Matildas captain Sam Kerr - last year's runner-up but controversially missing out on the shortlist for the 2022 player of the year award - was named in FIFA's World XI. Widely regarded as the finest striker in the world, Kerr finished last season as the top scorer in England's WSL competition on her way to leading club side Chelsea to a domestic league and cup double. She also finished tournament top scorer in Australia's Asian Cup campaign. Spain's Alexia Putellas, who won the Ballon d'Or last year, was named women's player of the year after inspiring Barcelona to a third consecutive national title in 2022. England's Beth Mead and US forward Alex Morgan made up the rest of the top three. England were rewarded for their success in being crowned Euro 2022 champions. Mary Earps was named goalkeeper of the year and England's Dutch coach Sarina Wiegman received the accolade for best coach having guided a team which had four players alongside Kerr in the year's World XI - Beth Mead, Lucy Bronze, Leah Williamson and Keira Walsh. Polish amputee Marcin Oleksy won the Puskas prize for best goal of the year for his spectacular acrobatic volley for Warta Poznan against Stal Rzeszow.","pubDate":"2023-02-27 22:51:51","image_url":"https://images.perthnow.com.au/publication/C-9890530/d195c318e518072c4e4b5520a3639baa66fbfd02-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Alexia Putellas é eleita pela segunda vez a melhor jogadora do mundo","link":"https://www.mg.superesportes.com.br/app/noticias/futebol/futebol-internacional/2023/02/27/noticia_futebol_internacional,3989417/alexia-putellas-e-eleita-pela-segunda-vez-a-melhor-jogadora-do-mundo.shtml","keywords":["Futebol Internacional"],"creator":null,"video_url":null,"description":"Alexia Putellas, 29, jogadora do Barcelona e da seleção da Espanha, foi eleita nesta segunda-feira (27) pela segunda vez consecutiva como a vencedora do prêmio The Best, da Fifa, como melhor jogadora de futebol do mundo em 2022.Putellas, que também é a atual Bola de Ouro feminina, honraria entregue pela revista francesa France Football, superou a inglesa Beth Mead e a americana Alex Morgan na votação da Fifa.\"Eu não estava preparada para receber esse prêmio, muito obrigada a todos que votaram em mim. Eu gostaria também de dar os parabéns à Alex [Morgan] e Beth Mead, vocês merecem esse troféu também. Gostaria de agradecer minhas companheiras, corpo técnico, clube. Todos aqueles que trabalham no clube\", afirmou a jogadora.Putellas conquistou o campeonato e a Copa da Espanha na última temporada com o Barcelona, clube com o qual também chegou à final da Champions League feminina --na decisão, perdeu para o Lyon, da França.A espanhola, no entanto, acabou fora da disputa da Eurocopa com sua seleção por causa de uma lesão grave no ligamento do joelho esquerdo.Criado pela Fifa em 2001, o prêmio de melhor do ano no futebol feminino tem a brasileira Marta como a maior vencedora, com seis troféus, sendo o primeiro deles conquistado em 2006 e o último em 2018.As jogadoras vencedora do prêmio Fifa The Best2022 - Alexia Putellas (ESP)2021 - Alexia Putellas (ESP)2020 - Lucy Bronze (ING)2019 - Megan Rapinoe (EUA)2018 - Marta (BRA)2017 - Lieke Martens (HOL)2016 - Carli Lloyd (EUA)2015 - Carli Lloyd (EUA)2014 - Nadine Kessler (ALE)2013 - Nadine Angerer (ALE)2012 - Abby Wambach (EUA)2011 - Homare Sawa (JAP)2010 - Marta (BRA)2009 - Marta (BRA)2008 - Marta (BRA)2007 - Marta (BRA)2006 - Marta (BRA)2005 - Birgit Prinz (ALE)2004 - Birgit Prinz (ALE)2003 - Birgit Prinz (ALE)2002 - Mia Hamm (EUA)2001 - Mia Hamm (EUA)","content":"foto: FRANCK FIFE Alexia Putellas foi eleita a melhor jogadora do mundo Alexia Putellas, 29, jogadora do Barcelona e da seleção da Espanha, foi eleita nesta segunda-feira (27) pela segunda vez consecutiva como a vencedora do prêmio The Best, da Fifa, como melhor jogadora de futebol do mundo em 2022. Putellas, que também é a atual Bola de Ouro feminina, honraria entregue pela revista francesa France Football, superou a inglesa Beth Mead e a americana Alex Morgan na votação da Fifa. \"Eu não estava preparada para receber esse prêmio, muito obrigada a todos que votaram em mim. Eu gostaria também de dar os parabéns à Alex [Morgan] e Beth Mead, vocês merecem esse troféu também. Gostaria de agradecer minhas companheiras, corpo técnico, clube. Todos aqueles que trabalham no clube\", afirmou a jogadora. Putellas conquistou o campeonato e a Copa da Espanha na última temporada com o Barcelona, clube com o qual também chegou à final da Champions League feminina --na decisão, perdeu para o Lyon, da França. A espanhola, no entanto, acabou fora da disputa da Eurocopa com sua seleção por causa de uma lesão grave no ligamento do joelho esquerdo. Criado pela Fifa em 2001, o prêmio de melhor do ano no futebol feminino tem a brasileira Marta como a maior vencedora, com seis troféus, sendo o primeiro deles conquistado em 2006 e o último em 2018. 2022 - Alexia Putellas (ESP) 2021 - Alexia Putellas (ESP) 2020 - Lucy Bronze (ING) 2019 - Megan Rapinoe (EUA) 2018 - Marta (BRA) 2017 - Lieke Martens (HOL) 2016 - Carli Lloyd (EUA) 2015 - Carli Lloyd (EUA) 2014 - Nadine Kessler (ALE) 2013 - Nadine Angerer (ALE) 2012 - Abby Wambach (EUA) 2011 - Homare Sawa (JAP) 2010 - Marta (BRA) 2009 - Marta (BRA) 2008 - Marta (BRA) 2007 - Marta (BRA) 2006 - Marta (BRA) 2005 - Birgit Prinz (ALE) 2004 - Birgit Prinz (ALE) 2003 - Birgit Prinz (ALE) 2002 - Mia Hamm (EUA) 2001 - Mia Hamm (EUA)","pubDate":"2023-02-27 22:45:00","image_url":null,"source_id":"superesportes","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"Lionel Messi Dinobatkan sebagai Pemain Terbaik FIFA 2022","link":"https://sports.sindonews.com/read/1034111/11/lionel-messi-dinobatkan-sebagai-pemain-terbaik-fifa-2022-1677542565","keywords":null,"creator":["Yova Adhiansyah"],"video_url":null,"description":"Lionel Messi dinobatkan sebagai pemain terbaik FIFA 2022 dalam acara penghargaan The Best FIFA Football Awards 2022, Selasa (28/2/2023) dini hari WIB. Megabintang Paris Saint Germain (PSG) itu mengalahkan....","content":"PARIS - Lionel Messi dinobatkan sebagai pemain terbaik FIFA 2022 dalam acara penghargaan The Best FIFA Football Awards 2022, Selasa (28/2/2023) dini hari WIB. Megabintang Paris Saint Germain (PSG) itu mengalahkan rekan setimnya Kylian Mbappe dan Karim Benzema. Pada malam penghargaan tersebut Messi mendapatkan 52 poin suara. Sementara Mbappe 44 suara dan Benzema 34 suara. Keberhasilan Messi merebut penghargaan ini tak lepas dari penampilannya di musim lalu. Yang paling mencolok adalah Messi sukses membawa Argentina menjuarai Piala Dunia 2022. Itu merupakan pertama kalinya ia mengangkat trofi bergengsi tersebut. BACA JUGA: Irak U-20 Berambisi Juara di Piala Asia U-20 dan Lolos Piala Dunia U-20 2023 Total, sepanjang musim lalu, Messi berhasil mencetak 27 gol dalam 49 pertandingan untuk klub dan timnas Argentina. Beralih ke penghargaan, ini menjadi gelar pemain terbaik dunia ketujuh yang diraih Messi. Dia berada di jajaran teratas perebut gelar terbaik FIFA, di atas Cristiano Ronaldo dengan lima gelar. \"Sungguh menakjubkan. Ini merupakan tahun yang luar biasa dan merupakan kehormatan bagi saya untuk berada di sini dan memenangkan penghargaan ini. Tanpa rekan satu tim saya, saya tidak akan berada di sini. Saya mencapai impian yang sudah lama saya harapkan. Sangat sedikit orang yang bisa mencapainya dan saya beruntung bisa melakukannya,\" ungkap Messi dikutip dari BBC Sport. Daftar Lengkap Penerima Penghargaan The Best FIFA Football Awards 2022: The Best FIFA Men’s Player - Lionel Messi (Paris Saint-Germain/Argentina) The Best FIFA Women’s Player - Alexia Puttelas (Barcelona/Spanyol) The Best FIFA Men’s Coach - Lionel Scaloni (timnas Argentina) The Best FIFA Women's Coach - Sarina Wiegman (timnas Inggris) The Best FIFA Men’s Goalkeeper - Emiliano Martinez (Aston Villa/Argentina) The Best FIFA Women’s Goalkeeper - Mary Earps (Man United/Inggris) FIFA Puskas Award - Marcin Oleksy (Polandia): Warta Poznan vs Stal Rzeszow (Ekstraklasa, 6 November 2022) FIFA Fair Play Award - Luka Lochoshvili (Cremonese/Georgia) The Best FIFA Fan Award - Suporter Argentina FIFA FIFPro Men's World XI Thibaut Courtois; Achraf Hakimi, Virgil van Dijk, Joao Cancelo; Kevin De Bruyne, Luka Modric, Casemiro; Lionel Messi, Kylian Mbappe, Karim Benzema, Erling Haaland FIFA FIFPro Women's World XI Christiane Endler; Lucy Bronze, Leah Williamson, Wendie Renard, Mapi Leon; Alexia Putellas, Keira Walsh, Lena Oberdorf, Alex Morgan, Sam Kerr, Beth Mead Lihat Juga: Lionel Messi Wujudkan Mimpi Ibunya Lisandro Martinez: Terima Kasih Master Sepak Bola (yov)","pubDate":"2023-02-28 00:59:47","image_url":"https://pict.sindonews.net/dyn/850/pena/news/2023/02/28/11/1034111/lionel-messi-dinobatkan-sebagai-pemain-terbaik-fifa-2022-rdm.jpg","source_id":"sindonews","category":["sports"],"country":["indonesia"],"language":"indonesian"},{"title":"Cinderella story? Off-contract McGovern brothers consider future","link":"https://www.watoday.com.au/sport/afl/cinderella-story-off-contract-mcgovern-brothers-consider-future-20230228-p5co3o.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Carlton’s Mitch McGovern and his brother Jeremy, of West Coast premiership fame, are off contract this year. Their managers have not ruled out the pair playing together in 2024.","content":"Off-contract Carlton defender Mitch McGovern and his free-agent West Coast brother Jeremy could try and play together next season, as each weighs up their footballing futures. Mitch McGovern, 28, is coming to the end of a five-year deal with the Blues worth about $800,000 a season, while Jeremy, the 30-year-old premiership player with the Eagles, is one of the league’s hottest free agents. The McGovern brothers’ management team, Colin Young and Andrew McDougall, of Corporate Sports Australia, told The Age the two Perth-born defenders have a big call to make. Mitch McGovern is in the final year of his contract with the Blues. Could he pair up with his brother Jeremy next season? Credit: Getty Images “That could be quite interesting. We’ll wait and see,” McDougall said of a possible one-club pairing. “Mitch is out of contract. He has got a year to run. He is really enjoying it at Carlton and has settled in really well, but he is only 28, so it will be interesting to see how this year plays out. Loading “‘Vossy’ [Blues coach Michael Voss] really likes him, he knows he is a great player, standing up in the back line.” Added Young: “I am not saying it. Jeremy said it on a podcast – it would be ideal if they did [play together] one day – but sometimes Cinderella stories don’t work.” Mitch McGovern has battled several injury issues, having been restricted to 33 games since leaving the Crows with two years left on his contract, and linking with the Blues ahead of the 2019 season. He managed only seven games last year because of injury – enjoying a new role in defence – but played in the final five, reinforcing that he is in the Blues’ best 22.","pubDate":"2023-02-28 00:52:14","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sports club votes to skip 2023 season after floods","link":"https://www.perthnow.com.au/sport/afl/sports-club-votes-to-skip-2023-season-after-floods-c-9891432","keywords":null,"creator":["Adrian Black"],"video_url":null,"description":"A sports club on the NSW-Victorian border will not field senior football and netball teams in 2023, after being devastated by flood damage and player losses.","content":"A historic country footy and netball club devastated by floods and player shortages will not field senior teams this year, in the hopes it can regroup in 2024. The Corowa-Rutherglen Football Netball Club's facilities were completely inundated when floodwaters breached the Murray River's banks in November. In a meeting on Monday night, a majority of members voted to forgo the 2023 season, while still fielding teams in the under-15s, under-17s and C-grade. Secretary Rowena Black said the decision had not been taken lightly by the club, which has produced several AFL players and coaches. \"There were past players there who have been connected to the club for decades that ... had a tear in their eye, they were really heartbroken,\" Ms Black told ABC Radio. Former club players include Coleman Medallist and North Melbourne flag winner turned Sydney Swans premiership coach John Longmire, ex-Carlton coach David Teague, Collingwood premiership defender Mick Gayfer, and Carlton 201-gamer Ryan Houlihan. Ms Black said shifting demographics in the NSW-Victoria border region had contributed to the decision. \"There are too many player spots, not enough players,\" she said. \"The population base is obviously ageing and ... we're really looking at how do we keep that young group of people in our area that want to play here.\" Ms Black said the club will contact sponsors that had signed up for two-year deals. \"We will definitely be going to them and having a conversation and saying, 'Look, we will ... pause the sponsorship this year and we would love to see you guys get back on board next year',\" she said. \"Our sponsors are fantastic.\" The club, formed in 1979 when the Corowa Spiders and Rutherglen Redlegs merged, was founded as the Border United Football Club in 1877, and has produced numerous VFL and AFL stars.","pubDate":"2023-02-28 00:15:39","image_url":"https://images.perthnow.com.au/publication/C-9891432/9fb6151f765272784a6a1534c99817d929561a0a-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"\"ลิโอเนล เมสซี\" คว้ารางวัลนักเตะชายยอดเยี่ยมของฟีฟ่า 2022","link":"https://www.thaipbs.or.th/news/content/325027","keywords":["กีฬา"],"creator":["webmaster@thaipbs.or.th"],"video_url":null,"description":"เมื่อวันที่ 27 ก.พ.2566 ลิโอเนล เมสซี กองหน้าทีมชาติอาร์เจนตินา ของปารีส แซงต์-แชร์กแมง ได้รับเลือกให้คว้ารางวัลนักฟุตบอลชายยอดเยี่ยมของฟีฟ่า หรือ The Best FIFA Men's Player 2022 หลังจากที่มีการประกาศมอบรางวัลอย่างเป็นทางการ ที่กรุงปารีส ประเทศฝรั่งเศส  เมสซี วัย 35 ปี ได้รับการโหวตเป็นอันดับ 1 ตามคาด โดยชนะคีเลียน เอ็มบัปเป้ เพื่อนร่วมสโมสร ปารีส แซงต์-แชร์กแมง และ คาริม เบนเซมา กัปตันทีมเรอัล มาดริด จากผลงานสำคัญคือ ช่วยทีมชาติอาร์เจนตินา คว้าแชมป์ฟุตบอลโลกเมื่อช่วงปลายปีที่แล้ว ซึ่งเมสซีได้รางวัลผู้เล่นยอดเยี่ยมประจำทัวร์นาเมนต์ฟุตบอลโลกด้วย สำหรับ เมสซี ได้รางวัลนี้เป็นสมัยที่ 2 ต่อจากปี 2019 มากสุดเทียบเท่ากับ คริสเตียโน โรนัลโด และโรเบิร์ต เลวานดอฟสกี้ ส่วนรางวัลผู้รักษาประตูยอดเยี่ยมเป็นของเอมิเลียโน มาร์ติเนซ ผู้รักษาประตูทีมชาติอาร์เจนตินา ของแอสตัน วิลล่า ที่ช่วยเซฟประตูสำคัญช่วยทีมคว้าแชมป์โลก และโค้ชยอดเยี่ยมฟีฟ่า เป็นของลิโอเนล สกาโลนี่ โค้ชทีมชาติอาร์เจนตินาเช่นกัน ขณะที่นักเตะหญิงยอดเยี่ยมฟีฟ่าเป็นของอเล็กเซีย ปูเตร์ยาส แข้งสาวทีมชาติสเปน จากบาร์เซโลนา เจ้าของรางวัลบัลลงดอร์คนล่าสุด และรางวัลปุสกัส อวอร์ด หรือประตูสุดสวยประจำปีของฟีฟ่า เป็นของมาร์ซิน โอเล็กซี่ แข้งคนพิการของทีมวาร์ตา พอซแนน ที่กลายเป็นนักเตะคนพิการคนแรกที่คว้ารางวัลนี้ไปครอง สำหรับรางวัล ธ และ Ballon d'Or หรือ บัลลงดอร์ เป็นคนละรางวัลกัน โดยรางวัล The Best FIFA Football Awards เริ่มต้นในปี 2016 ที่ผ่านมา แยกออกมาจาก Ballon d'Or โดยจะให้สิทธิ์ตัวแทนผู้สื่อข่าวจากประเทศต่าง ๆ ที่มีสิทธิ์โหวต แตกต่างกับบัลลงดอร์ ที่ให้กัปตันทีมและโค้ชแต่ละชาติร่วมโหวตด้วย  ","content":"เมื่อวันที่ 27 ก.พ.2566 ลิโอเนล เมสซี กองหน้าทีมชาติอาร์เจนตินา ของปารีส แซงต์-แชร์กแมง ได้รับเลือกให้คว้ารางวัลนักฟุตบอลชายยอดเยี่ยมของฟีฟ่า หรือ The Best FIFA Men's Player 2022 หลังจากที่มีการประกาศมอบรางวัลอย่างเป็นทางการ ที่กรุงปารีส ประเทศฝรั่งเศส เมสซี วัย 35 ปี ได้รับการโหวตเป็นอันดับ 1 ตามคาด โดยชนะคีเลียน เอ็มบัปเป้ เพื่อนร่วมสโมสร ปารีส แซงต์-แชร์กแมง และ คาริม เบนเซมา กัปตันทีมเรอัล มาดริด จากผลงานสำคัญคือ ช่วยทีมชาติอาร์เจนตินา คว้าแชมป์ฟุตบอลโลกเมื่อช่วงปลายปีที่แล้ว ซึ่งเมสซีได้รางวัลผู้เล่นยอดเยี่ยมประจำทัวร์นาเมนต์ฟุตบอลโลกด้วย สำหรับ เมสซี ได้รางวัลนี้เป็นสมัยที่ 2 ต่อจากปี 2019 มากสุดเทียบเท่ากับ คริสเตียโน โรนัลโด และโรเบิร์ต เลวานดอฟสกี้ ส่วนรางวัลผู้รักษาประตูยอดเยี่ยมเป็นของเอมิเลียโน มาร์ติเนซ ผู้รักษาประตูทีมชาติอาร์เจนตินา ของแอสตัน วิลล่า ที่ช่วยเซฟประตูสำคัญช่วยทีมคว้าแชมป์โลก และโค้ชยอดเยี่ยมฟีฟ่า เป็นของลิโอเนล สกาโลนี่ โค้ชทีมชาติอาร์เจนตินาเช่นกัน ขณะที่นักเตะหญิงยอดเยี่ยมฟีฟ่าเป็นของอเล็กเซีย ปูเตร์ยาส แข้งสาวทีมชาติสเปน จากบาร์เซโลนา เจ้าของรางวัลบัลลงดอร์คนล่าสุด และรางวัลปุสกัส อวอร์ด หรือประตูสุดสวยประจำปีของฟีฟ่า เป็นของมาร์ซิน โอเล็กซี่ แข้งคนพิการของทีมวาร์ตา พอซแนน ที่กลายเป็นนักเตะคนพิการคนแรกที่คว้ารางวัลนี้ไปครอง สำหรับรางวัล ธ และ Ballon d'Or หรือ บัลลงดอร์ เป็นคนละรางวัลกัน โดยรางวัล The Best FIFA Football Awards เริ่มต้นในปี 2016 ที่ผ่านมา แยกออกมาจาก Ballon d'Or โดยจะให้สิทธิ์ตัวแทนผู้สื่อข่าวจากประเทศต่าง ๆ ที่มีสิทธิ์โหวต แตกต่างกับบัลลงดอร์ ที่ให้กัปตันทีมและโค้ชแต่ละชาติร่วมโหวตด้วย","pubDate":"2023-02-28 00:00:41","image_url":"https://news.thaipbs.or.th/media/G0DL5oPyrtt5HBAivUwlRLMjYwKi9FJiGBVVvdbAh3aBLGG4kgEXJi.jpg","source_id":"thaipbs","category":["sports"],"country":["thailand"],"language":"thai"},{"title":"Fécafoot : Le président Samuel Eto’o annonce le décès de son 2e vice-président","link":"https://senego.com/fecafoot-le-president-samuel-etoo-annonce-le-deces-de-son-2e-vice-president_1521779.html","keywords":["Sénégal","Sports","Cameroun","fécafoot"],"creator":["Ankou SODJAGO"],"video_url":null,"description":"Le président de la fédération camerounaise de football, Samuel Eto’o Fils, a annoncé le décès d’un de ses vice-présidents. Boubakary Bello représentait la région de l’extrême-nord au sein du Comité Exécutif. Le décès est survenu ce lundi 27 février 2023 à Maroua des suites de maladie. Ce lundi 27 février, Boubakary Bello alias Kariwa, 2e […]","content":"Le président de la fédération camerounaise de football, Samuel Eto’o Fils, a annoncé le décès d’un de ses vice-présidents. Boubakary Bello représentait la région de l’extrême-nord au sein du Comité Exécutif. Le décès est survenu ce lundi 27 février 2023 à Maroua des suites de maladie. Ce lundi 27 février, Boubakary Bello alias Kariwa, 2e Vice-président de la Fecafoot est décédé des suites de maladie à l’hôpital de la CNPS de Maroua où il était hospitalisé depuis quelques jours. Boubakary Bello était une figure importante dans le landerneau économique et politique de Maroua. Il avait d’ailleurs été maire de Maroua 3 il y a quelques années. Son implication dans le football était entier, puisqu’il a dirigé pendant longtemps la Ligue Régionale de football de l’extrême-nord. C’est une perte immense pour le football camerounais. Et pour la Fécafoot, il était le plus expérimenté au sein du Comité Exécutif. Samuel Eto’o Fils a rendu hommage à l’illustre disparu qui a consacré une bonne partie de sa vie au service du football et à son développement au Cameroun. Il a également présenté ses condoléances à la famille du défunt.","pubDate":"2023-02-27 23:04:24","image_url":null,"source_id":"senego","category":["sports"],"country":["senegal"],"language":"french"},{"title":"Man Utd bắt đầu hành động với Harry Kane","link":"https://www.bongda.com.vn/man-utd-bat-dau-hanh-dong-voi-harry-kane-d674132.html","keywords":null,"creator":null,"video_url":null,"description":"Harry Kane được đánh giá là mục tiêu chuyển nhượng hàng đầu của Man Utd trong hè 2023.","content":"bắt đầu tiến hành \"quan tâm tích cực\" đến việc ký hợp đồng với Harry Kane của Tottenham Hotspurs vào mùa hè năm nay, khi HLV Erik ten Hag tìm cách cải thiện hàng tiền đạo đội bóng. Theo nguồn tin từ Football Insider, Tottenham đã mở cuộc đàm phán với cầu thủ đội trưởng về một hợp đồng mới. Nhưng United đang theo dõi chặt chẽ bởi hợp đồng hiện tại của ngôi sao người Anh sẽ hết hạn vào năm 2024. Man Utd bắt đầu tìm hiểu khả năng chiêu mộ Kane. Điều đó đồng nghĩa nếu không ra đi vào mùa hè này, và trong trường hợp không đồng ý ký vào bản giao kèo mới, Spurs sẽ có nguy cơ mất trắng Kane theo dạng chuyển nhượng tự do. Đây là cơ hội tốt cho Quỷ đỏ khi họ đang tìm cách ký hợp đồng với một tiền đạo trước khi bắt đầu mùa giải mới. Man Utd coi việc chiêu mộ Wout Weghorst chỉ là phương án ngắn hạn, khó có thể đảm nhiệm vai trò dẫn dắt hàng công. Trong khi cầu thủ người Hà Lan gây ấn tượng với khả năng làm việc không biết mệt mỏi của mình, rõ ràng Quỷ đỏ đang rất cần những ngôi sao chất lượng ở tuyến trên để có thể cạnh tranh thực sự cho ngôi vô địch Premier League. Anthony Martial là tiền đạo tài năng nhưng cầu thủ người Pháp thường xuyên dính chấn thương trong mùa giải này. Martial cũng không có phong độ ổn định trong những năm qua. Vì thế, Ở Kane, United chắc chắn sẽ tìm thấy một số 9 có khả năng cải thiện đội bóng ngay lập tức. Với đẳng cấp đã được thể hiện, tiền đạo này sẽ là một cầu thủ lý tưởng để nâng cấp hàng tấn công. Kane sớm đạt mốc 20 bàn thắng ở mùa giải năm nay, với pha dứt điểm tung lưới Chelsea. Ngoài bản năng sát thủ vốn có, Kane cũng rất giỏi trong việc liên kết lối chơi. Anh sẵn sàng hy sinh vì tập thể khi cần. Kane có thể đổi bến đỗ trong hè 2023. Với việc Tottenham đang trong giai đoạn đầu đàm phán và Bayern Munich cũng quan tâm, Kane sẽ phải đưa ra một số quyết định khó khăn trong những tháng tới. Tuy nhiên, United có quyền hy vọng rằng họ sẽ thuyết phục được Kane cập bến Old Trafford. Kane đang đặt mục tiêu vượt kỷ lục 260 bàn của Alan Shearer ở Premier League nên có thể không ra nước ngoài thi đấu. Gần đây, Kane trở thành cầu thủ ghi bàn hàng đầu mọi thời đại của Tottenham, vượt qua thành tích 266 bàn thắng của Jimmy Greaves trên mọi đấu trường. Spurs muốn giữ chân sút chủ lực của mình, nhưng Kane không còn nhiều thời gian. Anh cần tìm kiếm bến đỗ mới để có cơ hội chinh phục chức vô địch. Đây là sự lãng phí rất lớn. Cần biết rằng Manchester United đang dần thay đổi theo chiều hướng tốt hơn. . Và Kane có thể hứng thú với một dự án đầy hứa hẹn tại Old Trafford. Nếu thất bại trong nỗ lực ký hợp đồng với Harry Kane, Man Utd có thể chuyển sự chú ý sang Victor Osimhen.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/hai.phan/2023/02/27/ras-talksport-harry-kane-2301.jpg","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"Đội hình tiêu biểu nam năm 2022: Hàng công 4 người","link":"https://www.bongda.com.vn/doi-hinh-tieu-bieu-nam-nam-2022-hang-cong-4-nguoi-d674137.html","keywords":null,"creator":null,"video_url":null,"description":"FIFA gây bất ngờ khi công bố đội hình 11 cầu thủ nam xuất sắc nhất năm 2022 (Men's FIFPRO World XI) khi có đến 4 tiền đạo hiện diện.","content":"Sau thời gian chờ đợi, gala The Best FIFA Football Awards 2022 đã diễn ra tại thủ đô Paris, nước Pháp. Những cá nhân có màn trình diễn xuất sắc nhất trong khoảng thời gian từ tháng 08/2021 đến hết tháng 12/2022 sẽ được vinh danh ở nhiều hạng mục khác nhau. FIFA cũng công bố bao gồm: Thibaut Courtois, Achraf Hakimi, Virgil van Dijk, Joao Cancelo, Kevin de Bruyne, Casemiro, Luka Modric, Lionel Messi, Erling Haaland, Karim Benzema, Kylian Mbappe. trải qua năm 2022 thành công khi đoạt cú đúp danh hiệu La Liga và Champions League trong màu áo Real Madrid. Đứng trước Courtois là bộ ba ngôi sao phòng ngự Hakimi, Van Dijk và Cancelo. FIFA công bố đội hình tiêu biểu nam năm 2022. Trong khi đó, khu vực trung tuyến vinh danh ba gương mặt Casemiro - De Bruyne - . Bộ đôi Casemiro và Modric cùng vô địch La Liga và Champions League trong màu áo Real Madrid. Ở cấp độ ĐTQG, Modric cùng Croatia về thứ 3 tại World Cup 2022. Bốn gương mặt trên hàng công bao gồm Messi - Benzema - Haaland - Mbappe. Bộ đôi Messi và Mbappe đoạt cú đúp quốc nội Ligue 1, Siêu cúp Pháp trong màu áo PSG. Ở cấp độ ĐTQG, , trong khi Mbappe về nhì trên đất Qatar cùng tuyển Pháp. Haaland trải qua nửa mùa giải 2022/2023 bùng nổ cùng Man City. Gương mặt còn lại, Benzema góp công lớn trên hành trình Los Blancos vô địch La Liga và Champions League.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/02/28/van-dijk-0530.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"CHÍNH THỨC! Messi chiến thắng FIFA The Best","link":"https://www.bongda.com.vn/chinh-thuc-messi-chien-thang-fifa-the-best-d674135.html","keywords":null,"creator":null,"video_url":null,"description":"Siêu sao người Argentina đoạt giải thưởng cá nhân danh giá sau một năm 2022 thành công rực rỡ. Kết quả không nằm ngoài dự đoán của giới chuyên môn.","content":"Rạng sáng nay, gala giải thưởng The Best FIFA Football Awards 2022 đã diễn ra tại nhà hát Salle Pleyel (Paris, Pháp). Liên đoàn bóng đá thế giới (FIFA) bầu chọn cầu thủ nam và nữ xuất sắc nhất dựa trên thành tích từ tháng 08 năm 2021 đến hết tháng 12 năm 2022. Đúng như dự đoán của phần đông giới chuyên môn, siêu sao . Messi trải qua năm 2022 thành công rực rỡ với danh hiệu World Cup 2022 trong màu áo ĐTQG Argentina. Tổng cộng, sau 74 trận đấu, đóng góp 45 bàn thắng, 34 kiến tạo. Ở cấp độ CLB, tiền đạo 35 tuổi vô địch Ligue 1, Siêu cúp nước Pháp cùng PSG. Trong màu áo đội tuyển, Messi nâng cao danh hiệu World Cup 2022 và Siêu cúp liên lục địa. Messi được bầu chọn là Cầu thủ nam xuất sắc nhất năm 2022. Hai đối thủ nặng ký còn lại trong danh sách rút gọn The Best Men's Player là Karim Benzema và Kylian Mbappe. Tiền đạo người Pháp, đoạt cú đúp vô địch La Liga và Champions League cùng Real Madrid. Trong màu áo ĐTQG, Benzema vô địch UEFA Nations League. với danh hiệu Ligue 1, Siêu cúp nước Pháp cùng PSG. Trong màu áo ĐTQG, Mbappe về nhì tại World Cup 2022.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/02/28/messi-0455.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"Messi, Putellas again voted best players at FIFA awards","link":"https://www.perthnow.com.au/sport/soccer/messi-putellas-again-voted-best-players-at-fifa-awards-c-9890530","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Football's world governing body FIFA have named Argentina star Lionel Messi and Spain's Alexia Putellas as their men's and women's players of the year.","content":"Lionel Messi has been named FIFA's player of the year for 2022 as Argentina scooped all of the major men's awards after winning a vintage World Cup final last December. Spain and Barcelona forward Alexia Putellas picked up the women's award. The 35-year-old Messi scored twice in the final against France, as the South Americans emerged triumphant on penalties following a 3-3 draw after extra time in Qatar. \"It's amazing. It was a tremendous year and it is an honour for me to be here tonight and win this award\", said Messi, who sat next to France forward and Paris St Germain teammate Kylian Mbappe throughout Monday's glittering ceremony at Paris' Salle Pleyel. Mbappe, also nominated for the award, netted a hat-trick in the World Cup final but was overshadowed as Messi capped his success-studded career by winning the most coveted trophy in world football. \"I want to express my thanks to (coach Lionel) Scaloni and my teammates, without them I would not be here,\" Messi said. \"It's a dream for any player, very few people can achieve that and I was lucky enough to do so.\" His compatriots Lionel Scaloni and Emiliano Martinez won the coach of the year and goalkeeper of the year awards respectively, and their supporters even got the 'best fans' prize. In the women's game, Matildas captain Sam Kerr - last year's runner-up but controversially missing out on the shortlist for the 2022 player of the year award - was named in FIFA's World XI. Widely regarded as the finest striker in the world, Kerr finished last season as the top scorer in England's WSL competition on her way to leading club side Chelsea to a domestic league and cup double. She also finished tournament top scorer in Australia's Asian Cup campaign. Spain's Alexia Putellas, who won the Ballon d'Or last year, was named women's player of the year after inspiring Barcelona to a third consecutive national title in 2022. England's Beth Mead and US forward Alex Morgan made up the rest of the top three. England were rewarded for their success in being crowned Euro 2022 champions. Mary Earps was named goalkeeper of the year and England's Dutch coach Sarina Wiegman received the accolade for best coach having guided a team which had four players alongside Kerr in the year's World XI - Beth Mead, Lucy Bronze, Leah Williamson and Keira Walsh. Polish amputee Marcin Oleksy won the Puskas prize for best goal of the year for his spectacular acrobatic volley for Warta Poznan against Stal Rzeszow.","pubDate":"2023-02-27 22:51:51","image_url":"https://images.perthnow.com.au/publication/C-9890530/d195c318e518072c4e4b5520a3639baa66fbfd02-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Alexia Putellas é eleita pela segunda vez a melhor jogadora do mundo","link":"https://www.mg.superesportes.com.br/app/noticias/futebol/futebol-internacional/2023/02/27/noticia_futebol_internacional,3989417/alexia-putellas-e-eleita-pela-segunda-vez-a-melhor-jogadora-do-mundo.shtml","keywords":["Futebol Internacional"],"creator":null,"video_url":null,"description":"Alexia Putellas, 29, jogadora do Barcelona e da seleção da Espanha, foi eleita nesta segunda-feira (27) pela segunda vez consecutiva como a vencedora do prêmio The Best, da Fifa, como melhor jogadora de futebol do mundo em 2022.Putellas, que também é a atual Bola de Ouro feminina, honraria entregue pela revista francesa France Football, superou a inglesa Beth Mead e a americana Alex Morgan na votação da Fifa.\"Eu não estava preparada para receber esse prêmio, muito obrigada a todos que votaram em mim. Eu gostaria também de dar os parabéns à Alex [Morgan] e Beth Mead, vocês merecem esse troféu também. Gostaria de agradecer minhas companheiras, corpo técnico, clube. Todos aqueles que trabalham no clube\", afirmou a jogadora.Putellas conquistou o campeonato e a Copa da Espanha na última temporada com o Barcelona, clube com o qual também chegou à final da Champions League feminina --na decisão, perdeu para o Lyon, da França.A espanhola, no entanto, acabou fora da disputa da Eurocopa com sua seleção por causa de uma lesão grave no ligamento do joelho esquerdo.Criado pela Fifa em 2001, o prêmio de melhor do ano no futebol feminino tem a brasileira Marta como a maior vencedora, com seis troféus, sendo o primeiro deles conquistado em 2006 e o último em 2018.As jogadoras vencedora do prêmio Fifa The Best2022 - Alexia Putellas (ESP)2021 - Alexia Putellas (ESP)2020 - Lucy Bronze (ING)2019 - Megan Rapinoe (EUA)2018 - Marta (BRA)2017 - Lieke Martens (HOL)2016 - Carli Lloyd (EUA)2015 - Carli Lloyd (EUA)2014 - Nadine Kessler (ALE)2013 - Nadine Angerer (ALE)2012 - Abby Wambach (EUA)2011 - Homare Sawa (JAP)2010 - Marta (BRA)2009 - Marta (BRA)2008 - Marta (BRA)2007 - Marta (BRA)2006 - Marta (BRA)2005 - Birgit Prinz (ALE)2004 - Birgit Prinz (ALE)2003 - Birgit Prinz (ALE)2002 - Mia Hamm (EUA)2001 - Mia Hamm (EUA)","content":"foto: FRANCK FIFE Alexia Putellas foi eleita a melhor jogadora do mundo Alexia Putellas, 29, jogadora do Barcelona e da seleção da Espanha, foi eleita nesta segunda-feira (27) pela segunda vez consecutiva como a vencedora do prêmio The Best, da Fifa, como melhor jogadora de futebol do mundo em 2022. Putellas, que também é a atual Bola de Ouro feminina, honraria entregue pela revista francesa France Football, superou a inglesa Beth Mead e a americana Alex Morgan na votação da Fifa. \"Eu não estava preparada para receber esse prêmio, muito obrigada a todos que votaram em mim. Eu gostaria também de dar os parabéns à Alex [Morgan] e Beth Mead, vocês merecem esse troféu também. Gostaria de agradecer minhas companheiras, corpo técnico, clube. Todos aqueles que trabalham no clube\", afirmou a jogadora. Putellas conquistou o campeonato e a Copa da Espanha na última temporada com o Barcelona, clube com o qual também chegou à final da Champions League feminina --na decisão, perdeu para o Lyon, da França. A espanhola, no entanto, acabou fora da disputa da Eurocopa com sua seleção por causa de uma lesão grave no ligamento do joelho esquerdo. Criado pela Fifa em 2001, o prêmio de melhor do ano no futebol feminino tem a brasileira Marta como a maior vencedora, com seis troféus, sendo o primeiro deles conquistado em 2006 e o último em 2018. 2022 - Alexia Putellas (ESP) 2021 - Alexia Putellas (ESP) 2020 - Lucy Bronze (ING) 2019 - Megan Rapinoe (EUA) 2018 - Marta (BRA) 2017 - Lieke Martens (HOL) 2016 - Carli Lloyd (EUA) 2015 - Carli Lloyd (EUA) 2014 - Nadine Kessler (ALE) 2013 - Nadine Angerer (ALE) 2012 - Abby Wambach (EUA) 2011 - Homare Sawa (JAP) 2010 - Marta (BRA) 2009 - Marta (BRA) 2008 - Marta (BRA) 2007 - Marta (BRA) 2006 - Marta (BRA) 2005 - Birgit Prinz (ALE) 2004 - Birgit Prinz (ALE) 2003 - Birgit Prinz (ALE) 2002 - Mia Hamm (EUA) 2001 - Mia Hamm (EUA)","pubDate":"2023-02-27 22:45:00","image_url":null,"source_id":"superesportes","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"Lionel Messi Dinobatkan sebagai Pemain Terbaik FIFA 2022","link":"https://sports.sindonews.com/read/1034111/11/lionel-messi-dinobatkan-sebagai-pemain-terbaik-fifa-2022-1677542565","keywords":null,"creator":["Yova Adhiansyah"],"video_url":null,"description":"Lionel Messi dinobatkan sebagai pemain terbaik FIFA 2022 dalam acara penghargaan The Best FIFA Football Awards 2022, Selasa (28/2/2023) dini hari WIB. Megabintang Paris Saint Germain (PSG) itu mengalahkan....","content":"PARIS - Lionel Messi dinobatkan sebagai pemain terbaik FIFA 2022 dalam acara penghargaan The Best FIFA Football Awards 2022, Selasa (28/2/2023) dini hari WIB. Megabintang Paris Saint Germain (PSG) itu mengalahkan rekan setimnya Kylian Mbappe dan Karim Benzema. Pada malam penghargaan tersebut Messi mendapatkan 52 poin suara. Sementara Mbappe 44 suara dan Benzema 34 suara. Keberhasilan Messi merebut penghargaan ini tak lepas dari penampilannya di musim lalu. Yang paling mencolok adalah Messi sukses membawa Argentina menjuarai Piala Dunia 2022. Itu merupakan pertama kalinya ia mengangkat trofi bergengsi tersebut. BACA JUGA: Irak U-20 Berambisi Juara di Piala Asia U-20 dan Lolos Piala Dunia U-20 2023 Total, sepanjang musim lalu, Messi berhasil mencetak 27 gol dalam 49 pertandingan untuk klub dan timnas Argentina. Beralih ke penghargaan, ini menjadi gelar pemain terbaik dunia ketujuh yang diraih Messi. Dia berada di jajaran teratas perebut gelar terbaik FIFA, di atas Cristiano Ronaldo dengan lima gelar. \"Sungguh menakjubkan. Ini merupakan tahun yang luar biasa dan merupakan kehormatan bagi saya untuk berada di sini dan memenangkan penghargaan ini. Tanpa rekan satu tim saya, saya tidak akan berada di sini. Saya mencapai impian yang sudah lama saya harapkan. Sangat sedikit orang yang bisa mencapainya dan saya beruntung bisa melakukannya,\" ungkap Messi dikutip dari BBC Sport. Daftar Lengkap Penerima Penghargaan The Best FIFA Football Awards 2022: The Best FIFA Men’s Player - Lionel Messi (Paris Saint-Germain/Argentina) The Best FIFA Women’s Player - Alexia Puttelas (Barcelona/Spanyol) The Best FIFA Men’s Coach - Lionel Scaloni (timnas Argentina) The Best FIFA Women's Coach - Sarina Wiegman (timnas Inggris) The Best FIFA Men’s Goalkeeper - Emiliano Martinez (Aston Villa/Argentina) The Best FIFA Women’s Goalkeeper - Mary Earps (Man United/Inggris) FIFA Puskas Award - Marcin Oleksy (Polandia): Warta Poznan vs Stal Rzeszow (Ekstraklasa, 6 November 2022) FIFA Fair Play Award - Luka Lochoshvili (Cremonese/Georgia) The Best FIFA Fan Award - Suporter Argentina FIFA FIFPro Men's World XI Thibaut Courtois; Achraf Hakimi, Virgil van Dijk, Joao Cancelo; Kevin De Bruyne, Luka Modric, Casemiro; Lionel Messi, Kylian Mbappe, Karim Benzema, Erling Haaland FIFA FIFPro Women's World XI Christiane Endler; Lucy Bronze, Leah Williamson, Wendie Renard, Mapi Leon; Alexia Putellas, Keira Walsh, Lena Oberdorf, Alex Morgan, Sam Kerr, Beth Mead Lihat Juga: Lionel Messi Wujudkan Mimpi Ibunya Lisandro Martinez: Terima Kasih Master Sepak Bola (yov)","pubDate":"2023-02-28 00:59:47","image_url":"https://pict.sindonews.net/dyn/850/pena/news/2023/02/28/11/1034111/lionel-messi-dinobatkan-sebagai-pemain-terbaik-fifa-2022-rdm.jpg","source_id":"sindonews","category":["sports"],"country":["indonesia"],"language":"indonesian"},{"title":"Cinderella story? Off-contract McGovern brothers consider future","link":"https://www.watoday.com.au/sport/afl/cinderella-story-off-contract-mcgovern-brothers-consider-future-20230228-p5co3o.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Carlton’s Mitch McGovern and his brother Jeremy, of West Coast premiership fame, are off contract this year. Their managers have not ruled out the pair playing together in 2024.","content":"Off-contract Carlton defender Mitch McGovern and his free-agent West Coast brother Jeremy could try and play together next season, as each weighs up their footballing futures. Mitch McGovern, 28, is coming to the end of a five-year deal with the Blues worth about $800,000 a season, while Jeremy, the 30-year-old premiership player with the Eagles, is one of the league’s hottest free agents. The McGovern brothers’ management team, Colin Young and Andrew McDougall, of Corporate Sports Australia, told The Age the two Perth-born defenders have a big call to make. Mitch McGovern is in the final year of his contract with the Blues. Could he pair up with his brother Jeremy next season? Credit: Getty Images “That could be quite interesting. We’ll wait and see,” McDougall said of a possible one-club pairing. “Mitch is out of contract. He has got a year to run. He is really enjoying it at Carlton and has settled in really well, but he is only 28, so it will be interesting to see how this year plays out. Loading “‘Vossy’ [Blues coach Michael Voss] really likes him, he knows he is a great player, standing up in the back line.” Added Young: “I am not saying it. Jeremy said it on a podcast – it would be ideal if they did [play together] one day – but sometimes Cinderella stories don’t work.” Mitch McGovern has battled several injury issues, having been restricted to 33 games since leaving the Crows with two years left on his contract, and linking with the Blues ahead of the 2019 season. He managed only seven games last year because of injury – enjoying a new role in defence – but played in the final five, reinforcing that he is in the Blues’ best 22.","pubDate":"2023-02-28 00:52:14","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sports club votes to skip 2023 season after floods","link":"https://www.perthnow.com.au/sport/afl/sports-club-votes-to-skip-2023-season-after-floods-c-9891432","keywords":null,"creator":["Adrian Black"],"video_url":null,"description":"A sports club on the NSW-Victorian border will not field senior football and netball teams in 2023, after being devastated by flood damage and player losses.","content":"A historic country footy and netball club devastated by floods and player shortages will not field senior teams this year, in the hopes it can regroup in 2024. The Corowa-Rutherglen Football Netball Club's facilities were completely inundated when floodwaters breached the Murray River's banks in November. In a meeting on Monday night, a majority of members voted to forgo the 2023 season, while still fielding teams in the under-15s, under-17s and C-grade. Secretary Rowena Black said the decision had not been taken lightly by the club, which has produced several AFL players and coaches. \"There were past players there who have been connected to the club for decades that ... had a tear in their eye, they were really heartbroken,\" Ms Black told ABC Radio. Former club players include Coleman Medallist and North Melbourne flag winner turned Sydney Swans premiership coach John Longmire, ex-Carlton coach David Teague, Collingwood premiership defender Mick Gayfer, and Carlton 201-gamer Ryan Houlihan. Ms Black said shifting demographics in the NSW-Victoria border region had contributed to the decision. \"There are too many player spots, not enough players,\" she said. \"The population base is obviously ageing and ... we're really looking at how do we keep that young group of people in our area that want to play here.\" Ms Black said the club will contact sponsors that had signed up for two-year deals. \"We will definitely be going to them and having a conversation and saying, 'Look, we will ... pause the sponsorship this year and we would love to see you guys get back on board next year',\" she said. \"Our sponsors are fantastic.\" The club, formed in 1979 when the Corowa Spiders and Rutherglen Redlegs merged, was founded as the Border United Football Club in 1877, and has produced numerous VFL and AFL stars.","pubDate":"2023-02-28 00:15:39","image_url":"https://images.perthnow.com.au/publication/C-9891432/9fb6151f765272784a6a1534c99817d929561a0a-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"\"ลิโอเนล เมสซี\" คว้ารางวัลนักเตะชายยอดเยี่ยมของฟีฟ่า 2022","link":"https://www.thaipbs.or.th/news/content/325027","keywords":["กีฬา"],"creator":["webmaster@thaipbs.or.th"],"video_url":null,"description":"เมื่อวันที่ 27 ก.พ.2566 ลิโอเนล เมสซี กองหน้าทีมชาติอาร์เจนตินา ของปารีส แซงต์-แชร์กแมง ได้รับเลือกให้คว้ารางวัลนักฟุตบอลชายยอดเยี่ยมของฟีฟ่า หรือ The Best FIFA Men's Player 2022 หลังจากที่มีการประกาศมอบรางวัลอย่างเป็นทางการ ที่กรุงปารีส ประเทศฝรั่งเศส  เมสซี วัย 35 ปี ได้รับการโหวตเป็นอันดับ 1 ตามคาด โดยชนะคีเลียน เอ็มบัปเป้ เพื่อนร่วมสโมสร ปารีส แซงต์-แชร์กแมง และ คาริม เบนเซมา กัปตันทีมเรอัล มาดริด จากผลงานสำคัญคือ ช่วยทีมชาติอาร์เจนตินา คว้าแชมป์ฟุตบอลโลกเมื่อช่วงปลายปีที่แล้ว ซึ่งเมสซีได้รางวัลผู้เล่นยอดเยี่ยมประจำทัวร์นาเมนต์ฟุตบอลโลกด้วย สำหรับ เมสซี ได้รางวัลนี้เป็นสมัยที่ 2 ต่อจากปี 2019 มากสุดเทียบเท่ากับ คริสเตียโน โรนัลโด และโรเบิร์ต เลวานดอฟสกี้ ส่วนรางวัลผู้รักษาประตูยอดเยี่ยมเป็นของเอมิเลียโน มาร์ติเนซ ผู้รักษาประตูทีมชาติอาร์เจนตินา ของแอสตัน วิลล่า ที่ช่วยเซฟประตูสำคัญช่วยทีมคว้าแชมป์โลก และโค้ชยอดเยี่ยมฟีฟ่า เป็นของลิโอเนล สกาโลนี่ โค้ชทีมชาติอาร์เจนตินาเช่นกัน ขณะที่นักเตะหญิงยอดเยี่ยมฟีฟ่าเป็นของอเล็กเซีย ปูเตร์ยาส แข้งสาวทีมชาติสเปน จากบาร์เซโลนา เจ้าของรางวัลบัลลงดอร์คนล่าสุด และรางวัลปุสกัส อวอร์ด หรือประตูสุดสวยประจำปีของฟีฟ่า เป็นของมาร์ซิน โอเล็กซี่ แข้งคนพิการของทีมวาร์ตา พอซแนน ที่กลายเป็นนักเตะคนพิการคนแรกที่คว้ารางวัลนี้ไปครอง สำหรับรางวัล ธ และ Ballon d'Or หรือ บัลลงดอร์ เป็นคนละรางวัลกัน โดยรางวัล The Best FIFA Football Awards เริ่มต้นในปี 2016 ที่ผ่านมา แยกออกมาจาก Ballon d'Or โดยจะให้สิทธิ์ตัวแทนผู้สื่อข่าวจากประเทศต่าง ๆ ที่มีสิทธิ์โหวต แตกต่างกับบัลลงดอร์ ที่ให้กัปตันทีมและโค้ชแต่ละชาติร่วมโหวตด้วย  ","content":"เมื่อวันที่ 27 ก.พ.2566 ลิโอเนล เมสซี กองหน้าทีมชาติอาร์เจนตินา ของปารีส แซงต์-แชร์กแมง ได้รับเลือกให้คว้ารางวัลนักฟุตบอลชายยอดเยี่ยมของฟีฟ่า หรือ The Best FIFA Men's Player 2022 หลังจากที่มีการประกาศมอบรางวัลอย่างเป็นทางการ ที่กรุงปารีส ประเทศฝรั่งเศส เมสซี วัย 35 ปี ได้รับการโหวตเป็นอันดับ 1 ตามคาด โดยชนะคีเลียน เอ็มบัปเป้ เพื่อนร่วมสโมสร ปารีส แซงต์-แชร์กแมง และ คาริม เบนเซมา กัปตันทีมเรอัล มาดริด จากผลงานสำคัญคือ ช่วยทีมชาติอาร์เจนตินา คว้าแชมป์ฟุตบอลโลกเมื่อช่วงปลายปีที่แล้ว ซึ่งเมสซีได้รางวัลผู้เล่นยอดเยี่ยมประจำทัวร์นาเมนต์ฟุตบอลโลกด้วย สำหรับ เมสซี ได้รางวัลนี้เป็นสมัยที่ 2 ต่อจากปี 2019 มากสุดเทียบเท่ากับ คริสเตียโน โรนัลโด และโรเบิร์ต เลวานดอฟสกี้ ส่วนรางวัลผู้รักษาประตูยอดเยี่ยมเป็นของเอมิเลียโน มาร์ติเนซ ผู้รักษาประตูทีมชาติอาร์เจนตินา ของแอสตัน วิลล่า ที่ช่วยเซฟประตูสำคัญช่วยทีมคว้าแชมป์โลก และโค้ชยอดเยี่ยมฟีฟ่า เป็นของลิโอเนล สกาโลนี่ โค้ชทีมชาติอาร์เจนตินาเช่นกัน ขณะที่นักเตะหญิงยอดเยี่ยมฟีฟ่าเป็นของอเล็กเซีย ปูเตร์ยาส แข้งสาวทีมชาติสเปน จากบาร์เซโลนา เจ้าของรางวัลบัลลงดอร์คนล่าสุด และรางวัลปุสกัส อวอร์ด หรือประตูสุดสวยประจำปีของฟีฟ่า เป็นของมาร์ซิน โอเล็กซี่ แข้งคนพิการของทีมวาร์ตา พอซแนน ที่กลายเป็นนักเตะคนพิการคนแรกที่คว้ารางวัลนี้ไปครอง สำหรับรางวัล ธ และ Ballon d'Or หรือ บัลลงดอร์ เป็นคนละรางวัลกัน โดยรางวัล The Best FIFA Football Awards เริ่มต้นในปี 2016 ที่ผ่านมา แยกออกมาจาก Ballon d'Or โดยจะให้สิทธิ์ตัวแทนผู้สื่อข่าวจากประเทศต่าง ๆ ที่มีสิทธิ์โหวต แตกต่างกับบัลลงดอร์ ที่ให้กัปตันทีมและโค้ชแต่ละชาติร่วมโหวตด้วย","pubDate":"2023-02-28 00:00:41","image_url":"https://news.thaipbs.or.th/media/G0DL5oPyrtt5HBAivUwlRLMjYwKi9FJiGBVVvdbAh3aBLGG4kgEXJi.jpg","source_id":"thaipbs","category":["sports"],"country":["thailand"],"language":"thai"},{"title":"Fécafoot : Le président Samuel Eto’o annonce le décès de son 2e vice-président","link":"https://senego.com/fecafoot-le-president-samuel-etoo-annonce-le-deces-de-son-2e-vice-president_1521779.html","keywords":["Sénégal","Sports","Cameroun","fécafoot"],"creator":["Ankou SODJAGO"],"video_url":null,"description":"Le président de la fédération camerounaise de football, Samuel Eto’o Fils, a annoncé le décès d’un de ses vice-présidents. Boubakary Bello représentait la région de l’extrême-nord au sein du Comité Exécutif. Le décès est survenu ce lundi 27 février 2023 à Maroua des suites de maladie. Ce lundi 27 février, Boubakary Bello alias Kariwa, 2e […]","content":"Le président de la fédération camerounaise de football, Samuel Eto’o Fils, a annoncé le décès d’un de ses vice-présidents. Boubakary Bello représentait la région de l’extrême-nord au sein du Comité Exécutif. Le décès est survenu ce lundi 27 février 2023 à Maroua des suites de maladie. Ce lundi 27 février, Boubakary Bello alias Kariwa, 2e Vice-président de la Fecafoot est décédé des suites de maladie à l’hôpital de la CNPS de Maroua où il était hospitalisé depuis quelques jours. Boubakary Bello était une figure importante dans le landerneau économique et politique de Maroua. Il avait d’ailleurs été maire de Maroua 3 il y a quelques années. Son implication dans le football était entier, puisqu’il a dirigé pendant longtemps la Ligue Régionale de football de l’extrême-nord. C’est une perte immense pour le football camerounais. Et pour la Fécafoot, il était le plus expérimenté au sein du Comité Exécutif. Samuel Eto’o Fils a rendu hommage à l’illustre disparu qui a consacré une bonne partie de sa vie au service du football et à son développement au Cameroun. Il a également présenté ses condoléances à la famille du défunt.","pubDate":"2023-02-27 23:04:24","image_url":null,"source_id":"senego","category":["sports"],"country":["senegal"],"language":"french"},{"title":"Man Utd bắt đầu hành động với Harry Kane","link":"https://www.bongda.com.vn/man-utd-bat-dau-hanh-dong-voi-harry-kane-d674132.html","keywords":null,"creator":null,"video_url":null,"description":"Harry Kane được đánh giá là mục tiêu chuyển nhượng hàng đầu của Man Utd trong hè 2023.","content":"bắt đầu tiến hành \"quan tâm tích cực\" đến việc ký hợp đồng với Harry Kane của Tottenham Hotspurs vào mùa hè năm nay, khi HLV Erik ten Hag tìm cách cải thiện hàng tiền đạo đội bóng. Theo nguồn tin từ Football Insider, Tottenham đã mở cuộc đàm phán với cầu thủ đội trưởng về một hợp đồng mới. Nhưng United đang theo dõi chặt chẽ bởi hợp đồng hiện tại của ngôi sao người Anh sẽ hết hạn vào năm 2024. Man Utd bắt đầu tìm hiểu khả năng chiêu mộ Kane. Điều đó đồng nghĩa nếu không ra đi vào mùa hè này, và trong trường hợp không đồng ý ký vào bản giao kèo mới, Spurs sẽ có nguy cơ mất trắng Kane theo dạng chuyển nhượng tự do. Đây là cơ hội tốt cho Quỷ đỏ khi họ đang tìm cách ký hợp đồng với một tiền đạo trước khi bắt đầu mùa giải mới. Man Utd coi việc chiêu mộ Wout Weghorst chỉ là phương án ngắn hạn, khó có thể đảm nhiệm vai trò dẫn dắt hàng công. Trong khi cầu thủ người Hà Lan gây ấn tượng với khả năng làm việc không biết mệt mỏi của mình, rõ ràng Quỷ đỏ đang rất cần những ngôi sao chất lượng ở tuyến trên để có thể cạnh tranh thực sự cho ngôi vô địch Premier League. Anthony Martial là tiền đạo tài năng nhưng cầu thủ người Pháp thường xuyên dính chấn thương trong mùa giải này. Martial cũng không có phong độ ổn định trong những năm qua. Vì thế, Ở Kane, United chắc chắn sẽ tìm thấy một số 9 có khả năng cải thiện đội bóng ngay lập tức. Với đẳng cấp đã được thể hiện, tiền đạo này sẽ là một cầu thủ lý tưởng để nâng cấp hàng tấn công. Kane sớm đạt mốc 20 bàn thắng ở mùa giải năm nay, với pha dứt điểm tung lưới Chelsea. Ngoài bản năng sát thủ vốn có, Kane cũng rất giỏi trong việc liên kết lối chơi. Anh sẵn sàng hy sinh vì tập thể khi cần. Kane có thể đổi bến đỗ trong hè 2023. Với việc Tottenham đang trong giai đoạn đầu đàm phán và Bayern Munich cũng quan tâm, Kane sẽ phải đưa ra một số quyết định khó khăn trong những tháng tới. Tuy nhiên, United có quyền hy vọng rằng họ sẽ thuyết phục được Kane cập bến Old Trafford. Kane đang đặt mục tiêu vượt kỷ lục 260 bàn của Alan Shearer ở Premier League nên có thể không ra nước ngoài thi đấu. Gần đây, Kane trở thành cầu thủ ghi bàn hàng đầu mọi thời đại của Tottenham, vượt qua thành tích 266 bàn thắng của Jimmy Greaves trên mọi đấu trường. Spurs muốn giữ chân sút chủ lực của mình, nhưng Kane không còn nhiều thời gian. Anh cần tìm kiếm bến đỗ mới để có cơ hội chinh phục chức vô địch. Đây là sự lãng phí rất lớn. Cần biết rằng Manchester United đang dần thay đổi theo chiều hướng tốt hơn. . Và Kane có thể hứng thú với một dự án đầy hứa hẹn tại Old Trafford. Nếu thất bại trong nỗ lực ký hợp đồng với Harry Kane, Man Utd có thể chuyển sự chú ý sang Victor Osimhen.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/hai.phan/2023/02/27/ras-talksport-harry-kane-2301.jpg","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"Đội hình tiêu biểu nam năm 2022: Hàng công 4 người","link":"https://www.bongda.com.vn/doi-hinh-tieu-bieu-nam-nam-2022-hang-cong-4-nguoi-d674137.html","keywords":null,"creator":null,"video_url":null,"description":"FIFA gây bất ngờ khi công bố đội hình 11 cầu thủ nam xuất sắc nhất năm 2022 (Men's FIFPRO World XI) khi có đến 4 tiền đạo hiện diện.","content":"Sau thời gian chờ đợi, gala The Best FIFA Football Awards 2022 đã diễn ra tại thủ đô Paris, nước Pháp. Những cá nhân có màn trình diễn xuất sắc nhất trong khoảng thời gian từ tháng 08/2021 đến hết tháng 12/2022 sẽ được vinh danh ở nhiều hạng mục khác nhau. FIFA cũng công bố bao gồm: Thibaut Courtois, Achraf Hakimi, Virgil van Dijk, Joao Cancelo, Kevin de Bruyne, Casemiro, Luka Modric, Lionel Messi, Erling Haaland, Karim Benzema, Kylian Mbappe. trải qua năm 2022 thành công khi đoạt cú đúp danh hiệu La Liga và Champions League trong màu áo Real Madrid. Đứng trước Courtois là bộ ba ngôi sao phòng ngự Hakimi, Van Dijk và Cancelo. FIFA công bố đội hình tiêu biểu nam năm 2022. Trong khi đó, khu vực trung tuyến vinh danh ba gương mặt Casemiro - De Bruyne - . Bộ đôi Casemiro và Modric cùng vô địch La Liga và Champions League trong màu áo Real Madrid. Ở cấp độ ĐTQG, Modric cùng Croatia về thứ 3 tại World Cup 2022. Bốn gương mặt trên hàng công bao gồm Messi - Benzema - Haaland - Mbappe. Bộ đôi Messi và Mbappe đoạt cú đúp quốc nội Ligue 1, Siêu cúp Pháp trong màu áo PSG. Ở cấp độ ĐTQG, , trong khi Mbappe về nhì trên đất Qatar cùng tuyển Pháp. Haaland trải qua nửa mùa giải 2022/2023 bùng nổ cùng Man City. Gương mặt còn lại, Benzema góp công lớn trên hành trình Los Blancos vô địch La Liga và Champions League.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/02/28/van-dijk-0530.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"CHÍNH THỨC! Messi chiến thắng FIFA The Best","link":"https://www.bongda.com.vn/chinh-thuc-messi-chien-thang-fifa-the-best-d674135.html","keywords":null,"creator":null,"video_url":null,"description":"Siêu sao người Argentina đoạt giải thưởng cá nhân danh giá sau một năm 2022 thành công rực rỡ. Kết quả không nằm ngoài dự đoán của giới chuyên môn.","content":"Rạng sáng nay, gala giải thưởng The Best FIFA Football Awards 2022 đã diễn ra tại nhà hát Salle Pleyel (Paris, Pháp). Liên đoàn bóng đá thế giới (FIFA) bầu chọn cầu thủ nam và nữ xuất sắc nhất dựa trên thành tích từ tháng 08 năm 2021 đến hết tháng 12 năm 2022. Đúng như dự đoán của phần đông giới chuyên môn, siêu sao . Messi trải qua năm 2022 thành công rực rỡ với danh hiệu World Cup 2022 trong màu áo ĐTQG Argentina. Tổng cộng, sau 74 trận đấu, đóng góp 45 bàn thắng, 34 kiến tạo. Ở cấp độ CLB, tiền đạo 35 tuổi vô địch Ligue 1, Siêu cúp nước Pháp cùng PSG. Trong màu áo đội tuyển, Messi nâng cao danh hiệu World Cup 2022 và Siêu cúp liên lục địa. Messi được bầu chọn là Cầu thủ nam xuất sắc nhất năm 2022. Hai đối thủ nặng ký còn lại trong danh sách rút gọn The Best Men's Player là Karim Benzema và Kylian Mbappe. Tiền đạo người Pháp, đoạt cú đúp vô địch La Liga và Champions League cùng Real Madrid. Trong màu áo ĐTQG, Benzema vô địch UEFA Nations League. với danh hiệu Ligue 1, Siêu cúp nước Pháp cùng PSG. Trong màu áo ĐTQG, Mbappe về nhì tại World Cup 2022.","pubDate":"2023-02-27 22:59:48","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/02/28/messi-0455.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"Messi, Putellas again voted best players at FIFA awards","link":"https://www.perthnow.com.au/sport/soccer/messi-putellas-again-voted-best-players-at-fifa-awards-c-9890530","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Football's world governing body FIFA have named Argentina star Lionel Messi and Spain's Alexia Putellas as their men's and women's players of the year.","content":"Lionel Messi has been named FIFA's player of the year for 2022 as Argentina scooped all of the major men's awards after winning a vintage World Cup final last December. Spain and Barcelona forward Alexia Putellas picked up the women's award. The 35-year-old Messi scored twice in the final against France, as the South Americans emerged triumphant on penalties following a 3-3 draw after extra time in Qatar. \"It's amazing. It was a tremendous year and it is an honour for me to be here tonight and win this award\", said Messi, who sat next to France forward and Paris St Germain teammate Kylian Mbappe throughout Monday's glittering ceremony at Paris' Salle Pleyel. Mbappe, also nominated for the award, netted a hat-trick in the World Cup final but was overshadowed as Messi capped his success-studded career by winning the most coveted trophy in world football. \"I want to express my thanks to (coach Lionel) Scaloni and my teammates, without them I would not be here,\" Messi said. \"It's a dream for any player, very few people can achieve that and I was lucky enough to do so.\" His compatriots Lionel Scaloni and Emiliano Martinez won the coach of the year and goalkeeper of the year awards respectively, and their supporters even got the 'best fans' prize. In the women's game, Matildas captain Sam Kerr - last year's runner-up but controversially missing out on the shortlist for the 2022 player of the year award - was named in FIFA's World XI. Widely regarded as the finest striker in the world, Kerr finished last season as the top scorer in England's WSL competition on her way to leading club side Chelsea to a domestic league and cup double. She also finished tournament top scorer in Australia's Asian Cup campaign. Spain's Alexia Putellas, who won the Ballon d'Or last year, was named women's player of the year after inspiring Barcelona to a third consecutive national title in 2022. England's Beth Mead and US forward Alex Morgan made up the rest of the top three. England were rewarded for their success in being crowned Euro 2022 champions. Mary Earps was named goalkeeper of the year and England's Dutch coach Sarina Wiegman received the accolade for best coach having guided a team which had four players alongside Kerr in the year's World XI - Beth Mead, Lucy Bronze, Leah Williamson and Keira Walsh. Polish amputee Marcin Oleksy won the Puskas prize for best goal of the year for his spectacular acrobatic volley for Warta Poznan against Stal Rzeszow.","pubDate":"2023-02-27 22:51:51","image_url":"https://images.perthnow.com.au/publication/C-9890530/d195c318e518072c4e4b5520a3639baa66fbfd02-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Alexia Putellas é eleita pela segunda vez a melhor jogadora do mundo","link":"https://www.mg.superesportes.com.br/app/noticias/futebol/futebol-internacional/2023/02/27/noticia_futebol_internacional,3989417/alexia-putellas-e-eleita-pela-segunda-vez-a-melhor-jogadora-do-mundo.shtml","keywords":["Futebol Internacional"],"creator":null,"video_url":null,"description":"Alexia Putellas, 29, jogadora do Barcelona e da seleção da Espanha, foi eleita nesta segunda-feira (27) pela segunda vez consecutiva como a vencedora do prêmio The Best, da Fifa, como melhor jogadora de futebol do mundo em 2022.Putellas, que também é a atual Bola de Ouro feminina, honraria entregue pela revista francesa France Football, superou a inglesa Beth Mead e a americana Alex Morgan na votação da Fifa.\"Eu não estava preparada para receber esse prêmio, muito obrigada a todos que votaram em mim. Eu gostaria também de dar os parabéns à Alex [Morgan] e Beth Mead, vocês merecem esse troféu também. Gostaria de agradecer minhas companheiras, corpo técnico, clube. Todos aqueles que trabalham no clube\", afirmou a jogadora.Putellas conquistou o campeonato e a Copa da Espanha na última temporada com o Barcelona, clube com o qual também chegou à final da Champions League feminina --na decisão, perdeu para o Lyon, da França.A espanhola, no entanto, acabou fora da disputa da Eurocopa com sua seleção por causa de uma lesão grave no ligamento do joelho esquerdo.Criado pela Fifa em 2001, o prêmio de melhor do ano no futebol feminino tem a brasileira Marta como a maior vencedora, com seis troféus, sendo o primeiro deles conquistado em 2006 e o último em 2018.As jogadoras vencedora do prêmio Fifa The Best2022 - Alexia Putellas (ESP)2021 - Alexia Putellas (ESP)2020 - Lucy Bronze (ING)2019 - Megan Rapinoe (EUA)2018 - Marta (BRA)2017 - Lieke Martens (HOL)2016 - Carli Lloyd (EUA)2015 - Carli Lloyd (EUA)2014 - Nadine Kessler (ALE)2013 - Nadine Angerer (ALE)2012 - Abby Wambach (EUA)2011 - Homare Sawa (JAP)2010 - Marta (BRA)2009 - Marta (BRA)2008 - Marta (BRA)2007 - Marta (BRA)2006 - Marta (BRA)2005 - Birgit Prinz (ALE)2004 - Birgit Prinz (ALE)2003 - Birgit Prinz (ALE)2002 - Mia Hamm (EUA)2001 - Mia Hamm (EUA)","content":"foto: FRANCK FIFE Alexia Putellas foi eleita a melhor jogadora do mundo Alexia Putellas, 29, jogadora do Barcelona e da seleção da Espanha, foi eleita nesta segunda-feira (27) pela segunda vez consecutiva como a vencedora do prêmio The Best, da Fifa, como melhor jogadora de futebol do mundo em 2022. Putellas, que também é a atual Bola de Ouro feminina, honraria entregue pela revista francesa France Football, superou a inglesa Beth Mead e a americana Alex Morgan na votação da Fifa. \"Eu não estava preparada para receber esse prêmio, muito obrigada a todos que votaram em mim. Eu gostaria também de dar os parabéns à Alex [Morgan] e Beth Mead, vocês merecem esse troféu também. Gostaria de agradecer minhas companheiras, corpo técnico, clube. Todos aqueles que trabalham no clube\", afirmou a jogadora. Putellas conquistou o campeonato e a Copa da Espanha na última temporada com o Barcelona, clube com o qual também chegou à final da Champions League feminina --na decisão, perdeu para o Lyon, da França. A espanhola, no entanto, acabou fora da disputa da Eurocopa com sua seleção por causa de uma lesão grave no ligamento do joelho esquerdo. Criado pela Fifa em 2001, o prêmio de melhor do ano no futebol feminino tem a brasileira Marta como a maior vencedora, com seis troféus, sendo o primeiro deles conquistado em 2006 e o último em 2018. 2022 - Alexia Putellas (ESP) 2021 - Alexia Putellas (ESP) 2020 - Lucy Bronze (ING) 2019 - Megan Rapinoe (EUA) 2018 - Marta (BRA) 2017 - Lieke Martens (HOL) 2016 - Carli Lloyd (EUA) 2015 - Carli Lloyd (EUA) 2014 - Nadine Kessler (ALE) 2013 - Nadine Angerer (ALE) 2012 - Abby Wambach (EUA) 2011 - Homare Sawa (JAP) 2010 - Marta (BRA) 2009 - Marta (BRA) 2008 - Marta (BRA) 2007 - Marta (BRA) 2006 - Marta (BRA) 2005 - Birgit Prinz (ALE) 2004 - Birgit Prinz (ALE) 2003 - Birgit Prinz (ALE) 2002 - Mia Hamm (EUA) 2001 - Mia Hamm (EUA)","pubDate":"2023-02-27 22:45:00","image_url":null,"source_id":"superesportes","category":["sports"],"country":["brazil"],"language":"portuguese"}]}