{"newsArray":[{"article_id":"2243d69e66bf3c991e72b28166bd195f","title":"Tense Brian Daboll-Wink Martindale relationship has yet to reach dysfunctional level","link":"https://nypost.com/2023/12/06/sports/brian-daboll-wink-martindale-relationship-not-yet-dysfunctional/","keywords":null,"creator":["Paul Schwartz"],"video_url":null,"description":"What is going on with the Giants, Brian Daboll and Wink Martindale is not dysfunctional.","content":"There is plenty of dysfunction in the NFL. It is akin to what Supreme Court Justice Potter Stewart in 1964 said of his test for obscenity: “I know it when I see it.’’ What is going on with the Giants, Brian Daboll and Wink Martindale is not dysfunctional. You know that when you see it and this ain’t it. That does not mean it is all simpatico with the head coach and his defensive coordinator. Nothing that has transpired this season between the most important and second-most important coach in the building means there will definitely be a parting of the ways once the Giants put the footballs away. Could it happen? Sure. Will it? Too soon to tell. The winning the Giants experienced in Year 1 of the Daboll regime reinforced the desire to keep things together. The return of all three coordinators in 2023 was considered a boon to Daboll’s program. The losing the Giants are doing in Year 2 could lead to changes in the upper-reaches of Daboll’s staff. Perhaps Daboll will feel pressure to act. Maybe offensive coordinator Mike Kafka is the collateral damage for the scoring ineptitude. Daboll might want to shake things up with longtime special teams coordinator Thomas McGaughey. There is a chance ownership pushes for Daboll to make moves. There is certainly a chance Kafka and McGaughey return and Daboll concentrates more on the continued building of the roster. And then there is Martindale. A Fox Sports report surfaced 11 games into the season stating the relationship between Daboll and Martindale is in a “bad place’’ and this could lead to Martindale leaving the team before the end of this season and more likely after this season. Daboll made a few cracks and downplayed all of it. Martindale’s first chance to comment on this comes Friday, when the Giants coordinators meet with the media for the first time since before the bye week. What Martindale says should be quite revealing, as he is not known as someone who keeps his thoughts hidden. If he is strong in his rebuttal that anything is brewing with Daboll it will go a long way in putting this to bed, at least until the season ends. If Martindale leaves any wiggle room, the insinuation of unrest lingers as the Giants at 4-8 prepare for their Monday night meeting with the Packers at MetLife Stadium. Was there tension? Is there tension? Much of this noise came to the surface after Daboll could be seen having an animated discussion with Martindale at halftime of the Week 10 game in Dallas. By the time the 49-17 rout by the Cowboys was over and done with, Martindale’s defense had allowed 640 total yards, the second-highest total in the 99-year history of the franchise. The Giants allowed two players to surpass 150 receiving yards in a game for the first time in franchise history. If you think this sort of abysmal performance does not engender tension between the head coach and the defensive coordinator you have not been around too many NFL coaching staffs. That this stinker came in the first game after Martindale unloaded on safety Xavier McKinney for his comments after the 30-6 loss in Las Vegas was not lost on individuals inside the building. McKinney complained there was not enough communication between the leaders on defense and the coaches and, if true, that did not reflect kindly on Martindale . No other player picked up on that accusation and there was no real controversy brewing — until Martindale expressed how hurt he was by McKinney’s words. Daboll’s preference was for Martindale to keep all this inside the team; going public only created further distraction and the head coach is all about minimizing distraction. Daboll saw fit to alert the players that there is nothing wrong with his relationship with Martindale. “First time I heard it was when [Daboll] addressed it to us,’’ Dexter Lawrence told The Post. “I honestly don’t feel any tension, he says there’s no tension. He said the only thing they argue about is a slice of pizza .’’ You want dysfunction? Recall how Joe Judge and his offensive line coach, Marc Colombo, nearly came to blows in Judge’s office . You want dysfunction? Judge and the general manager, Dave Gettleman, basically ignored each other down the stretch of the 2021 season — a situation that ownership never should have tolerated. Daboll, 48, is demanding and believes in direct communication. He does not let things fester. He is aggressive in his fact-finding missions. Thin-skinned individuals will not do well in his sphere of influence. Despite a few hiccups, Martindale’s defense has far outperformed the mostly-feeble offense. He is 60 years old and has made no secret of his desire to be an NFL head coach. The Giants made the playoffs in his first year in the New York/New Jersey media market and Martindale received plenty of credit for the turnaround — but only one interview (Colts) for a head-coaching position. Time is not on his side, with the Giants destined to watch this season’s postseason action from home. That can breed tension, too.","pubDate":"2023-12-07 03:22:48","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-7me201o9l-1701917764757.jpg?quality=90&strip=all&1701899797","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"8446795d7eef4e1c86a0873f0cce4bc2","title":"Тен Хаг — о победе над «Челси»: «В первые 30 минут на поле у «МЮ» все получалось»","link":"https://www.sport-express.ru/football/england/news/glavnyy-trener-manchester-yunayted-erik-ten-hag-prokommentiroval-pobedu-nad-chelsi-2154554/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Главный тренер «Манчестер Юнайтед» Эрик тен Хаг прокомментировал победу над «Челси» (2:1) в 15-м туре АПЛ.","content":"Главный тренер «Манчестер Юнайтед» Эрик тен Хаг прокомментировал победу над «Челси» (2:1) в 15-м туре АПЛ. «У меня всегда могут быть претензии, но мы довольны результатом и игрой. В первые 30 минут на поле у нас все получалось. Но потом не нужно было пропускать гол. Мы выключились из игры. Нам нужно делать развиваться. Мы движемся в правильном направлении. Мактоминей очень хороший игрок. Он остановил «Челси» вместе с Антони. Он забил два гола и мог бы забить еще», — приводит слова тен Хага ВВС. «Манчестер Юнайтед» набрал 27 очков и поднялся на 6-е место в турнирной таблице.","pubDate":"2023-12-07 03:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"35b77d07f5af5598aeb8888c238be42c","title":"New coach Jon Poppe sets Ivy League title goal for Columbia","link":"https://nypost.com/2023/12/06/sports/new-coach-jon-poppe-sets-ivy-league-title-goal-for-columbia/","keywords":null,"creator":["Miles Schachner"],"video_url":null,"description":"Jon Poppe spoke of promises to fulfill, goals to reach and a culture to build, but made one thing clear: he was hired to bring Columbia a championship.","content":"Columbia football has a new coach — and he brings a reunion with lofty expectations. When an energetic, impassioned Jon Poppe approached the podium inside Columbia’s gymnasium on Wednesday, he spoke of promises to fulfill, goals to reach and a culture to build, but made one thing clear: he was hired to bring Columbia a championship. For a Columbia football program with a singular Ivy League title — won back in 1961 — championships are hard to come by. But Poppe, who spent three seasons at Columbia as a secondary coach and recruiting coordinator from 2015-17, appeared ready to accept that challenge. “We will never be complacent,” Poppe said. “The hunger is always going to exist. We’re going to focus on recruiting efforts on the best and brightest. … We want young people here that desire to be challenged.” The 38-year-old New Jersey native returns to Morningside Heights after successful stints at Harvard as a secondary and special teams coach and one year as a head coach at Union College. Poppe led the Garnet Chargers to a 10-2 record and the second round of the Division III Tournament last season, adding four wins to the team’s record and earning him a look when the Columbia job became available. He succeeds interim head coach Mark Fabish, a former offensive coordinator who stepped into the head-coaching role unexpectedly in 2023 when Al Bagnoli, a nine-time Ivy champion, retired six weeks before the season opener due to health concerns. Bagnoli, who served as a head coach for 40 years and compiled 274 wins, was coaxed out of retirement in 2015 to resurrect a Columbia program that had finished winless in consecutive seasons. \"You can make history here.\" – @Coach_Poppe #RoarLionRoar // #OnlyHere 🗽🦁 pic.twitter.com/TgTtKBVx7Y He did just that, the team’s best season during his tenure coming in 2017 when the Lions went 8-2 and came within one win of a sought-after conference championship. “We’ve come close here in my time,” Poppe, who helped recruit members of the 2017 team, said. “And sometimes the football bounces a funny way. So hopefully we’re preparing our young men right in practice, to get that ball to bounce the right way. We’ve got to get Lady Karma on our side, that’s a big part of football sometimes.” Poppe inherits a team that stumbled during a transitional 2023 campaign, posting a 1-6 Ivy League record for its worst year since 2015. Fortunately for Columbia, Poppe has reached the Ivy League mountaintop before. During Poppe’s initial three-year stint at Harvard from 2011-14, the Crimson took home three conference championships as he led its secondary and special teams groups. Now, Columbia will look to Poppe to take the school where it hasn’t been in over 60 years.","pubDate":"2023-12-07 03:15:22","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-qlbn0aru3-1701916253235.jpg?quality=90&strip=all&1701898288","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"19398ad7cc65358996ac0ea4eaf5d2e7","title":"L’OM enfonce Lyon sur fond de protestations des groupes de supporteurs","link":"https://www.lemonde.fr/sport/article/2023/12/07/l-om-enfonce-lyon-sur-fond-de-protestations-des-groupes-de-supporteurs_6204287_3242.html","keywords":null,"creator":null,"video_url":null,"description":"Reportée après les incidents du 29 octobre, la rencontre de mercredi a été marquée par un festival offensif phocéen (3-0) et un début de grogne des ultras marseillais contre les interdictions de déplacement.","content":"Cette fois, le match entre l’Olympique de Marseille (OM) et l’Olympique lyonnais (OL) version 2023-2024 a bien eu lieu. Reportée le 29 octobre, après les attaques par des supporteurs marseillais de plusieurs bus des visiteurs, dont celui transportant les joueurs de l’OL, la rencontre entre ces deux rivaux historiques du championnat de France s’est tenue sans incident, mercredi 6 décembre, au Stade-Vélodrome, à Marseille. Mais elle marque aussi le début d’une grogne du milieu ultra, qui s’oppose à la volonté des pouvoirs publics d’interdire temporairement tout déplacement lors de matches classés « à risque » par la division nationale de lutte contre le hooliganisme. Devant 54 238 spectateurs, qui ont quitté l’enceinte ravis, l’OM s’est imposée facilement (3-0) , mercredi. L’équipe signe ainsi sa troisième victoire d’affilée en autant de sorties sur sa pelouse, et a disputé, de l’avis général, son meilleur match de la saison. Avec deux passes décisives et un but, l’attaquant Pierre-Emerick Aubameyang confirme son renouveau ; après ses quatre buts en deux rencontres, la recrue phare de l’intersaison de l’OM, bien aidée par la présence du Portugais Vitinha – un but, une passe décisive — titularisé à ses côtés, a fait taire les sifflets qui l’avaient accueilli une semaine plus tôt lors de la confrontation contre l’Ajax d’Amsterdam en Ligue Europa. « On ne doit pas croire qu’on a tout résolu », a relativisé l’entraîneur marseillais, l’Italien Gennaro Gattuso, après la rencontre, rappelant que son équipe avait peiné dans les matches précédents. L’équipe lyonnaise, elle, poursuit son annus horribilis . La présence sur le banc de l’OL de Pierre Sage, entraîneur intérimaire , n’a rien changé aux errements d’une formation inoffensive et fragile défensivement. « Nous avons été en non-maîtrise tout au long du match », a reconnu le coach lyonnais. Avec sept points en quatorze matches, l’OL se traîne en queue de classement et semble, plus que jamais, sous la menace d’une relégation en Ligue 2. « Nous avons conscience d’être en danger », confirme Pierre Sage. Ce match entre Marseille et Lyon n’a pas été un sommet de football. Mais il était surtout scruté pour ses à-côtés. Le contexte de ces retrouvailles, pesant depuis l’annulation du premier face-à-face, s’est encore alourdi avec la mort, dimanche, d’un supporteur nantais , poignardé par un chauffeur de VTC en amont de la rencontre entre Nantes et Nice. Mercredi, l’arrivée du bus de l’OL était sûrement la plus attendue de la saison en Ligue 1. A 19 h 30, précédé de motards, d’une voiture et de deux fourgons de police, le véhicule transportant les joueurs et le staff technique lyonnais, un autocar classique loué à un transporteur vauclusien, a pénétré dans les entrailles du Stade-Vélodrome. « Sans incident », a précisé la préfecture de police, qui avait mobilisé près de 700 policiers et gendarmes pour éviter tout débordement. Un véhicule blindé avec un canon à eau trônait même à l’entrée du stade alors que des drones surplombaient la scène.","pubDate":"2023-12-07 03:15:15","image_url":"https://img.lemde.fr/2023/12/06/1347/0/8078/4039/644/322/60/0/b36ac77_1dea1d613c054911ab059df855c785ed-0-035f492235a345d09d6eb0d9c7b4f344.jpg","source_id":"lemonde","source_priority":12566,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"4ee668543e1d1346c57cde7e64e6d822","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.perthnow.com.au/sport/soccer/teen-spirit-drives-brisbane-roar-towards-alm-nirvana-c-12819212","keywords":null,"creator":["Joel Gould"],"video_url":null,"description":"Brisbane Roar coach Ross Aloisi has given A-League debuts to teenagers Tom Waddingham, Shae Cahill, Quinn MacNicol and Rylan Brownlie this season.","content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday.","pubDate":"2023-12-07 03:14:59","image_url":"https://images.perthnow.com.au/publication/C-12819212/c785e30da91e70aa28e7a8b81ca09a1b68e07e5d-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3a11dc15a19cb93d5a6ae0556ea3c377","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.busseltonmail.com.au/story/8451709/teen-spirit-drives-brisbane-roar-towards-alm-nirvana/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday. Australian Associated Press","pubDate":"2023-12-07 03:12:10","image_url":"https://www.busseltonmail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/b932b1fa-d072-4797-a174-650a9d848f79.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail","source_priority":6251187,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0ae9e10bd3f29b30ad1daabdf72c80af","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.blayneychronicle.com.au/story/8451709/teen-spirit-drives-brisbane-roar-towards-alm-nirvana/?src=rss","keywords":null,"creator":["Joel Gould"],"video_url":null,"description":null,"content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. / (min cost $ 8 ) Login or signup to continue reading The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-12-07 03:12:10","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/b932b1fa-d072-4797-a174-650a9d848f79.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cf16ad88ec24c81e76a8073b86859b49","title":"Санчес — первый за 2,5 года вратарь «Челси», отбивший пенальти в матче АПЛ","link":"https://www.sport-express.ru/football/england/news/sanches-pervyy-za-2-5-goda-vratar-chelsi-otbivshiy-penalti-v-matche-apl-2154552/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Голкипер «Челси» Роберт Санчес стал первым вратарем клуба за 2,5 года, отбивший пенальти в матче АПЛ.","content":"Голкипер «Челси» Роберт Санчес стал первым вратарем клуба за 2,5 года, отбивший пенальти в матче АПЛ. Санчес отразил удар Бруну Фернандеша с 11-метрового на 9-й минуте встречи 15-го тура АПЛ с «Манчестер Юнайтед» (1:2). При этом предыдущие 10 пенальти в ворота «Челси» в лиге были реализованы. Последний раз пенальти отбивал Эдуар Менди в мае 2021 года в игре «Челси» с «Сити». Лондонцы с 19 очками занимают 10-е место в турнирной таблице АПЛ. 10 декабря команда сыграет с «Эвертоном».","pubDate":"2023-12-07 03:10:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"7b330e184970bb968fabf249d2a75ffb","title":"Тоттенгем - Ньюкасл: де і коли дивитися онлайн матч 16 туру АПЛ 10.12.2023","link":"https://champion.com.ua/football/2023/12/07/945060/tottenhem-nyukasl-de-dyvytysya-match-apl","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі 16-го туру АПЛ Тоттенгем зіграє з Ньюкаслом.Підключитися до МегогоМатч відбудеться у неділю, 10 грудня. Початок матчу о 18:30 за київським часом.Дивитися поєдинок можна на ОТТ-платформі Setanta Sport та телеканалі Setanta Sport....","content":"#Ньюкасл , #Тоттенгем Джерело - Чемпіон . У матчі 16-го туру АПЛ Тоттенгем зіграє з Ньюкаслом. Підключитися до Мегого Матч відбудеться у неділю, 10 грудня . Початок матчу о 18:30 за київським часом. Дивитися поєдинок можна на ОТТ-платформі Setanta Sport та телеканалі Setanta Sport.","pubDate":"2023-12-07 03:10:00","image_url":"https://champion.com.ua/storage/news/main/regular/5f4e80447d51b1db671eb501678f1c3b.jpg","source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"4fbb37da0039be327f1fe02b6e37b74d","title":"Soccer-Pochettino 'not disappointed' in Chelsea performance despite Man United loss","link":"https://www.thestar.com.my/sport/football/2023/12/07/soccer-pochettino-039not-disappointed039-in-chelsea-performance-despite-man-united-loss","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Chelsea manager Mauricio Pochettino said he was not disappointed in their performance in Wednesday's 2-1 loss at Manchester United because his players \"gave everything.\" Read full story","content":"(Reuters) - Chelsea manager Mauricio Pochettino said he was not disappointed in their performance in Wednesday's 2-1 loss at Manchester United because his players \"gave everything.\" Pochettino said Chelsea had played well enough to get a draw but could not match the hosts' energy and aggression. \"A few days ago we were talking about a fantastic performance and how we were going well,\" he told reporters, referring to their win over Brighton on Sunday. \"Today because we didn’t get what we wanted here, we cannot change what we say now.\" Pochettino had predicted a tough outing at Old Trafford, saying it was not a good time to face Manchester United as they had a point to prove after losing at Newcastle United. \"I am not disappointed because the players gave everything, but maybe we didn’t match the energy. They were a little bit more aggressive than us,\" he added. \"But we were competitive because we made chances and maybe enough to draw the game. But when the result is 2-1 you get nothing. I think we need to be calm and keep going, trying to help the players to be ready for Sunday.\" Chelsea, who are 10th in the league with 19 points from 15 games, visit Everton on Sunday. (Reporting by Chiranjit Ojha in Bengaluru; Editing by Peter Rutherford)","pubDate":"2023-12-07 03:10:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/12/07/2426602.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"2243d69e66bf3c991e72b28166bd195f","title":"Tense Brian Daboll-Wink Martindale relationship has yet to reach dysfunctional level","link":"https://nypost.com/2023/12/06/sports/brian-daboll-wink-martindale-relationship-not-yet-dysfunctional/","keywords":null,"creator":["Paul Schwartz"],"video_url":null,"description":"What is going on with the Giants, Brian Daboll and Wink Martindale is not dysfunctional.","content":"There is plenty of dysfunction in the NFL. It is akin to what Supreme Court Justice Potter Stewart in 1964 said of his test for obscenity: “I know it when I see it.’’ What is going on with the Giants, Brian Daboll and Wink Martindale is not dysfunctional. You know that when you see it and this ain’t it. That does not mean it is all simpatico with the head coach and his defensive coordinator. Nothing that has transpired this season between the most important and second-most important coach in the building means there will definitely be a parting of the ways once the Giants put the footballs away. Could it happen? Sure. Will it? Too soon to tell. The winning the Giants experienced in Year 1 of the Daboll regime reinforced the desire to keep things together. The return of all three coordinators in 2023 was considered a boon to Daboll’s program. The losing the Giants are doing in Year 2 could lead to changes in the upper-reaches of Daboll’s staff. Perhaps Daboll will feel pressure to act. Maybe offensive coordinator Mike Kafka is the collateral damage for the scoring ineptitude. Daboll might want to shake things up with longtime special teams coordinator Thomas McGaughey. There is a chance ownership pushes for Daboll to make moves. There is certainly a chance Kafka and McGaughey return and Daboll concentrates more on the continued building of the roster. And then there is Martindale. A Fox Sports report surfaced 11 games into the season stating the relationship between Daboll and Martindale is in a “bad place’’ and this could lead to Martindale leaving the team before the end of this season and more likely after this season. Daboll made a few cracks and downplayed all of it. Martindale’s first chance to comment on this comes Friday, when the Giants coordinators meet with the media for the first time since before the bye week. What Martindale says should be quite revealing, as he is not known as someone who keeps his thoughts hidden. If he is strong in his rebuttal that anything is brewing with Daboll it will go a long way in putting this to bed, at least until the season ends. If Martindale leaves any wiggle room, the insinuation of unrest lingers as the Giants at 4-8 prepare for their Monday night meeting with the Packers at MetLife Stadium. Was there tension? Is there tension? Much of this noise came to the surface after Daboll could be seen having an animated discussion with Martindale at halftime of the Week 10 game in Dallas. By the time the 49-17 rout by the Cowboys was over and done with, Martindale’s defense had allowed 640 total yards, the second-highest total in the 99-year history of the franchise. The Giants allowed two players to surpass 150 receiving yards in a game for the first time in franchise history. If you think this sort of abysmal performance does not engender tension between the head coach and the defensive coordinator you have not been around too many NFL coaching staffs. That this stinker came in the first game after Martindale unloaded on safety Xavier McKinney for his comments after the 30-6 loss in Las Vegas was not lost on individuals inside the building. McKinney complained there was not enough communication between the leaders on defense and the coaches and, if true, that did not reflect kindly on Martindale . No other player picked up on that accusation and there was no real controversy brewing — until Martindale expressed how hurt he was by McKinney’s words. Daboll’s preference was for Martindale to keep all this inside the team; going public only created further distraction and the head coach is all about minimizing distraction. Daboll saw fit to alert the players that there is nothing wrong with his relationship with Martindale. “First time I heard it was when [Daboll] addressed it to us,’’ Dexter Lawrence told The Post. “I honestly don’t feel any tension, he says there’s no tension. He said the only thing they argue about is a slice of pizza .’’ You want dysfunction? Recall how Joe Judge and his offensive line coach, Marc Colombo, nearly came to blows in Judge’s office . You want dysfunction? Judge and the general manager, Dave Gettleman, basically ignored each other down the stretch of the 2021 season — a situation that ownership never should have tolerated. Daboll, 48, is demanding and believes in direct communication. He does not let things fester. He is aggressive in his fact-finding missions. Thin-skinned individuals will not do well in his sphere of influence. Despite a few hiccups, Martindale’s defense has far outperformed the mostly-feeble offense. He is 60 years old and has made no secret of his desire to be an NFL head coach. The Giants made the playoffs in his first year in the New York/New Jersey media market and Martindale received plenty of credit for the turnaround — but only one interview (Colts) for a head-coaching position. Time is not on his side, with the Giants destined to watch this season’s postseason action from home. That can breed tension, too.","pubDate":"2023-12-07 03:22:48","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-7me201o9l-1701917764757.jpg?quality=90&strip=all&1701899797","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"8446795d7eef4e1c86a0873f0cce4bc2","title":"Тен Хаг — о победе над «Челси»: «В первые 30 минут на поле у «МЮ» все получалось»","link":"https://www.sport-express.ru/football/england/news/glavnyy-trener-manchester-yunayted-erik-ten-hag-prokommentiroval-pobedu-nad-chelsi-2154554/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Главный тренер «Манчестер Юнайтед» Эрик тен Хаг прокомментировал победу над «Челси» (2:1) в 15-м туре АПЛ.","content":"Главный тренер «Манчестер Юнайтед» Эрик тен Хаг прокомментировал победу над «Челси» (2:1) в 15-м туре АПЛ. «У меня всегда могут быть претензии, но мы довольны результатом и игрой. В первые 30 минут на поле у нас все получалось. Но потом не нужно было пропускать гол. Мы выключились из игры. Нам нужно делать развиваться. Мы движемся в правильном направлении. Мактоминей очень хороший игрок. Он остановил «Челси» вместе с Антони. Он забил два гола и мог бы забить еще», — приводит слова тен Хага ВВС. «Манчестер Юнайтед» набрал 27 очков и поднялся на 6-е место в турнирной таблице.","pubDate":"2023-12-07 03:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"35b77d07f5af5598aeb8888c238be42c","title":"New coach Jon Poppe sets Ivy League title goal for Columbia","link":"https://nypost.com/2023/12/06/sports/new-coach-jon-poppe-sets-ivy-league-title-goal-for-columbia/","keywords":null,"creator":["Miles Schachner"],"video_url":null,"description":"Jon Poppe spoke of promises to fulfill, goals to reach and a culture to build, but made one thing clear: he was hired to bring Columbia a championship.","content":"Columbia football has a new coach — and he brings a reunion with lofty expectations. When an energetic, impassioned Jon Poppe approached the podium inside Columbia’s gymnasium on Wednesday, he spoke of promises to fulfill, goals to reach and a culture to build, but made one thing clear: he was hired to bring Columbia a championship. For a Columbia football program with a singular Ivy League title — won back in 1961 — championships are hard to come by. But Poppe, who spent three seasons at Columbia as a secondary coach and recruiting coordinator from 2015-17, appeared ready to accept that challenge. “We will never be complacent,” Poppe said. “The hunger is always going to exist. We’re going to focus on recruiting efforts on the best and brightest. … We want young people here that desire to be challenged.” The 38-year-old New Jersey native returns to Morningside Heights after successful stints at Harvard as a secondary and special teams coach and one year as a head coach at Union College. Poppe led the Garnet Chargers to a 10-2 record and the second round of the Division III Tournament last season, adding four wins to the team’s record and earning him a look when the Columbia job became available. He succeeds interim head coach Mark Fabish, a former offensive coordinator who stepped into the head-coaching role unexpectedly in 2023 when Al Bagnoli, a nine-time Ivy champion, retired six weeks before the season opener due to health concerns. Bagnoli, who served as a head coach for 40 years and compiled 274 wins, was coaxed out of retirement in 2015 to resurrect a Columbia program that had finished winless in consecutive seasons. \"You can make history here.\" – @Coach_Poppe #RoarLionRoar // #OnlyHere 🗽🦁 pic.twitter.com/TgTtKBVx7Y He did just that, the team’s best season during his tenure coming in 2017 when the Lions went 8-2 and came within one win of a sought-after conference championship. “We’ve come close here in my time,” Poppe, who helped recruit members of the 2017 team, said. “And sometimes the football bounces a funny way. So hopefully we’re preparing our young men right in practice, to get that ball to bounce the right way. We’ve got to get Lady Karma on our side, that’s a big part of football sometimes.” Poppe inherits a team that stumbled during a transitional 2023 campaign, posting a 1-6 Ivy League record for its worst year since 2015. Fortunately for Columbia, Poppe has reached the Ivy League mountaintop before. During Poppe’s initial three-year stint at Harvard from 2011-14, the Crimson took home three conference championships as he led its secondary and special teams groups. Now, Columbia will look to Poppe to take the school where it hasn’t been in over 60 years.","pubDate":"2023-12-07 03:15:22","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-qlbn0aru3-1701916253235.jpg?quality=90&strip=all&1701898288","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"19398ad7cc65358996ac0ea4eaf5d2e7","title":"L’OM enfonce Lyon sur fond de protestations des groupes de supporteurs","link":"https://www.lemonde.fr/sport/article/2023/12/07/l-om-enfonce-lyon-sur-fond-de-protestations-des-groupes-de-supporteurs_6204287_3242.html","keywords":null,"creator":null,"video_url":null,"description":"Reportée après les incidents du 29 octobre, la rencontre de mercredi a été marquée par un festival offensif phocéen (3-0) et un début de grogne des ultras marseillais contre les interdictions de déplacement.","content":"Cette fois, le match entre l’Olympique de Marseille (OM) et l’Olympique lyonnais (OL) version 2023-2024 a bien eu lieu. Reportée le 29 octobre, après les attaques par des supporteurs marseillais de plusieurs bus des visiteurs, dont celui transportant les joueurs de l’OL, la rencontre entre ces deux rivaux historiques du championnat de France s’est tenue sans incident, mercredi 6 décembre, au Stade-Vélodrome, à Marseille. Mais elle marque aussi le début d’une grogne du milieu ultra, qui s’oppose à la volonté des pouvoirs publics d’interdire temporairement tout déplacement lors de matches classés « à risque » par la division nationale de lutte contre le hooliganisme. Devant 54 238 spectateurs, qui ont quitté l’enceinte ravis, l’OM s’est imposée facilement (3-0) , mercredi. L’équipe signe ainsi sa troisième victoire d’affilée en autant de sorties sur sa pelouse, et a disputé, de l’avis général, son meilleur match de la saison. Avec deux passes décisives et un but, l’attaquant Pierre-Emerick Aubameyang confirme son renouveau ; après ses quatre buts en deux rencontres, la recrue phare de l’intersaison de l’OM, bien aidée par la présence du Portugais Vitinha – un but, une passe décisive — titularisé à ses côtés, a fait taire les sifflets qui l’avaient accueilli une semaine plus tôt lors de la confrontation contre l’Ajax d’Amsterdam en Ligue Europa. « On ne doit pas croire qu’on a tout résolu », a relativisé l’entraîneur marseillais, l’Italien Gennaro Gattuso, après la rencontre, rappelant que son équipe avait peiné dans les matches précédents. L’équipe lyonnaise, elle, poursuit son annus horribilis . La présence sur le banc de l’OL de Pierre Sage, entraîneur intérimaire , n’a rien changé aux errements d’une formation inoffensive et fragile défensivement. « Nous avons été en non-maîtrise tout au long du match », a reconnu le coach lyonnais. Avec sept points en quatorze matches, l’OL se traîne en queue de classement et semble, plus que jamais, sous la menace d’une relégation en Ligue 2. « Nous avons conscience d’être en danger », confirme Pierre Sage. Ce match entre Marseille et Lyon n’a pas été un sommet de football. Mais il était surtout scruté pour ses à-côtés. Le contexte de ces retrouvailles, pesant depuis l’annulation du premier face-à-face, s’est encore alourdi avec la mort, dimanche, d’un supporteur nantais , poignardé par un chauffeur de VTC en amont de la rencontre entre Nantes et Nice. Mercredi, l’arrivée du bus de l’OL était sûrement la plus attendue de la saison en Ligue 1. A 19 h 30, précédé de motards, d’une voiture et de deux fourgons de police, le véhicule transportant les joueurs et le staff technique lyonnais, un autocar classique loué à un transporteur vauclusien, a pénétré dans les entrailles du Stade-Vélodrome. « Sans incident », a précisé la préfecture de police, qui avait mobilisé près de 700 policiers et gendarmes pour éviter tout débordement. Un véhicule blindé avec un canon à eau trônait même à l’entrée du stade alors que des drones surplombaient la scène.","pubDate":"2023-12-07 03:15:15","image_url":"https://img.lemde.fr/2023/12/06/1347/0/8078/4039/644/322/60/0/b36ac77_1dea1d613c054911ab059df855c785ed-0-035f492235a345d09d6eb0d9c7b4f344.jpg","source_id":"lemonde","source_priority":12566,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"4ee668543e1d1346c57cde7e64e6d822","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.perthnow.com.au/sport/soccer/teen-spirit-drives-brisbane-roar-towards-alm-nirvana-c-12819212","keywords":null,"creator":["Joel Gould"],"video_url":null,"description":"Brisbane Roar coach Ross Aloisi has given A-League debuts to teenagers Tom Waddingham, Shae Cahill, Quinn MacNicol and Rylan Brownlie this season.","content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday.","pubDate":"2023-12-07 03:14:59","image_url":"https://images.perthnow.com.au/publication/C-12819212/c785e30da91e70aa28e7a8b81ca09a1b68e07e5d-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3a11dc15a19cb93d5a6ae0556ea3c377","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.busseltonmail.com.au/story/8451709/teen-spirit-drives-brisbane-roar-towards-alm-nirvana/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday. Australian Associated Press","pubDate":"2023-12-07 03:12:10","image_url":"https://www.busseltonmail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/b932b1fa-d072-4797-a174-650a9d848f79.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail","source_priority":6251187,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0ae9e10bd3f29b30ad1daabdf72c80af","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.blayneychronicle.com.au/story/8451709/teen-spirit-drives-brisbane-roar-towards-alm-nirvana/?src=rss","keywords":null,"creator":["Joel Gould"],"video_url":null,"description":null,"content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. / (min cost $ 8 ) Login or signup to continue reading The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-12-07 03:12:10","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/b932b1fa-d072-4797-a174-650a9d848f79.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cf16ad88ec24c81e76a8073b86859b49","title":"Санчес — первый за 2,5 года вратарь «Челси», отбивший пенальти в матче АПЛ","link":"https://www.sport-express.ru/football/england/news/sanches-pervyy-za-2-5-goda-vratar-chelsi-otbivshiy-penalti-v-matche-apl-2154552/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Голкипер «Челси» Роберт Санчес стал первым вратарем клуба за 2,5 года, отбивший пенальти в матче АПЛ.","content":"Голкипер «Челси» Роберт Санчес стал первым вратарем клуба за 2,5 года, отбивший пенальти в матче АПЛ. Санчес отразил удар Бруну Фернандеша с 11-метрового на 9-й минуте встречи 15-го тура АПЛ с «Манчестер Юнайтед» (1:2). При этом предыдущие 10 пенальти в ворота «Челси» в лиге были реализованы. Последний раз пенальти отбивал Эдуар Менди в мае 2021 года в игре «Челси» с «Сити». Лондонцы с 19 очками занимают 10-е место в турнирной таблице АПЛ. 10 декабря команда сыграет с «Эвертоном».","pubDate":"2023-12-07 03:10:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"7b330e184970bb968fabf249d2a75ffb","title":"Тоттенгем - Ньюкасл: де і коли дивитися онлайн матч 16 туру АПЛ 10.12.2023","link":"https://champion.com.ua/football/2023/12/07/945060/tottenhem-nyukasl-de-dyvytysya-match-apl","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі 16-го туру АПЛ Тоттенгем зіграє з Ньюкаслом.Підключитися до МегогоМатч відбудеться у неділю, 10 грудня. Початок матчу о 18:30 за київським часом.Дивитися поєдинок можна на ОТТ-платформі Setanta Sport та телеканалі Setanta Sport....","content":"#Ньюкасл , #Тоттенгем Джерело - Чемпіон . У матчі 16-го туру АПЛ Тоттенгем зіграє з Ньюкаслом. Підключитися до Мегого Матч відбудеться у неділю, 10 грудня . Початок матчу о 18:30 за київським часом. Дивитися поєдинок можна на ОТТ-платформі Setanta Sport та телеканалі Setanta Sport.","pubDate":"2023-12-07 03:10:00","image_url":"https://champion.com.ua/storage/news/main/regular/5f4e80447d51b1db671eb501678f1c3b.jpg","source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"4fbb37da0039be327f1fe02b6e37b74d","title":"Soccer-Pochettino 'not disappointed' in Chelsea performance despite Man United loss","link":"https://www.thestar.com.my/sport/football/2023/12/07/soccer-pochettino-039not-disappointed039-in-chelsea-performance-despite-man-united-loss","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Chelsea manager Mauricio Pochettino said he was not disappointed in their performance in Wednesday's 2-1 loss at Manchester United because his players \"gave everything.\" Read full story","content":"(Reuters) - Chelsea manager Mauricio Pochettino said he was not disappointed in their performance in Wednesday's 2-1 loss at Manchester United because his players \"gave everything.\" Pochettino said Chelsea had played well enough to get a draw but could not match the hosts' energy and aggression. \"A few days ago we were talking about a fantastic performance and how we were going well,\" he told reporters, referring to their win over Brighton on Sunday. \"Today because we didn’t get what we wanted here, we cannot change what we say now.\" Pochettino had predicted a tough outing at Old Trafford, saying it was not a good time to face Manchester United as they had a point to prove after losing at Newcastle United. \"I am not disappointed because the players gave everything, but maybe we didn’t match the energy. They were a little bit more aggressive than us,\" he added. \"But we were competitive because we made chances and maybe enough to draw the game. But when the result is 2-1 you get nothing. I think we need to be calm and keep going, trying to help the players to be ready for Sunday.\" Chelsea, who are 10th in the league with 19 points from 15 games, visit Everton on Sunday. (Reporting by Chiranjit Ojha in Bengaluru; Editing by Peter Rutherford)","pubDate":"2023-12-07 03:10:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/12/07/2426602.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"2243d69e66bf3c991e72b28166bd195f","title":"Tense Brian Daboll-Wink Martindale relationship has yet to reach dysfunctional level","link":"https://nypost.com/2023/12/06/sports/brian-daboll-wink-martindale-relationship-not-yet-dysfunctional/","keywords":null,"creator":["Paul Schwartz"],"video_url":null,"description":"What is going on with the Giants, Brian Daboll and Wink Martindale is not dysfunctional.","content":"There is plenty of dysfunction in the NFL. It is akin to what Supreme Court Justice Potter Stewart in 1964 said of his test for obscenity: “I know it when I see it.’’ What is going on with the Giants, Brian Daboll and Wink Martindale is not dysfunctional. You know that when you see it and this ain’t it. That does not mean it is all simpatico with the head coach and his defensive coordinator. Nothing that has transpired this season between the most important and second-most important coach in the building means there will definitely be a parting of the ways once the Giants put the footballs away. Could it happen? Sure. Will it? Too soon to tell. The winning the Giants experienced in Year 1 of the Daboll regime reinforced the desire to keep things together. The return of all three coordinators in 2023 was considered a boon to Daboll’s program. The losing the Giants are doing in Year 2 could lead to changes in the upper-reaches of Daboll’s staff. Perhaps Daboll will feel pressure to act. Maybe offensive coordinator Mike Kafka is the collateral damage for the scoring ineptitude. Daboll might want to shake things up with longtime special teams coordinator Thomas McGaughey. There is a chance ownership pushes for Daboll to make moves. There is certainly a chance Kafka and McGaughey return and Daboll concentrates more on the continued building of the roster. And then there is Martindale. A Fox Sports report surfaced 11 games into the season stating the relationship between Daboll and Martindale is in a “bad place’’ and this could lead to Martindale leaving the team before the end of this season and more likely after this season. Daboll made a few cracks and downplayed all of it. Martindale’s first chance to comment on this comes Friday, when the Giants coordinators meet with the media for the first time since before the bye week. What Martindale says should be quite revealing, as he is not known as someone who keeps his thoughts hidden. If he is strong in his rebuttal that anything is brewing with Daboll it will go a long way in putting this to bed, at least until the season ends. If Martindale leaves any wiggle room, the insinuation of unrest lingers as the Giants at 4-8 prepare for their Monday night meeting with the Packers at MetLife Stadium. Was there tension? Is there tension? Much of this noise came to the surface after Daboll could be seen having an animated discussion with Martindale at halftime of the Week 10 game in Dallas. By the time the 49-17 rout by the Cowboys was over and done with, Martindale’s defense had allowed 640 total yards, the second-highest total in the 99-year history of the franchise. The Giants allowed two players to surpass 150 receiving yards in a game for the first time in franchise history. If you think this sort of abysmal performance does not engender tension between the head coach and the defensive coordinator you have not been around too many NFL coaching staffs. That this stinker came in the first game after Martindale unloaded on safety Xavier McKinney for his comments after the 30-6 loss in Las Vegas was not lost on individuals inside the building. McKinney complained there was not enough communication between the leaders on defense and the coaches and, if true, that did not reflect kindly on Martindale . No other player picked up on that accusation and there was no real controversy brewing — until Martindale expressed how hurt he was by McKinney’s words. Daboll’s preference was for Martindale to keep all this inside the team; going public only created further distraction and the head coach is all about minimizing distraction. Daboll saw fit to alert the players that there is nothing wrong with his relationship with Martindale. “First time I heard it was when [Daboll] addressed it to us,’’ Dexter Lawrence told The Post. “I honestly don’t feel any tension, he says there’s no tension. He said the only thing they argue about is a slice of pizza .’’ You want dysfunction? Recall how Joe Judge and his offensive line coach, Marc Colombo, nearly came to blows in Judge’s office . You want dysfunction? Judge and the general manager, Dave Gettleman, basically ignored each other down the stretch of the 2021 season — a situation that ownership never should have tolerated. Daboll, 48, is demanding and believes in direct communication. He does not let things fester. He is aggressive in his fact-finding missions. Thin-skinned individuals will not do well in his sphere of influence. Despite a few hiccups, Martindale’s defense has far outperformed the mostly-feeble offense. He is 60 years old and has made no secret of his desire to be an NFL head coach. The Giants made the playoffs in his first year in the New York/New Jersey media market and Martindale received plenty of credit for the turnaround — but only one interview (Colts) for a head-coaching position. Time is not on his side, with the Giants destined to watch this season’s postseason action from home. That can breed tension, too.","pubDate":"2023-12-07 03:22:48","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-7me201o9l-1701917764757.jpg?quality=90&strip=all&1701899797","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"8446795d7eef4e1c86a0873f0cce4bc2","title":"Тен Хаг — о победе над «Челси»: «В первые 30 минут на поле у «МЮ» все получалось»","link":"https://www.sport-express.ru/football/england/news/glavnyy-trener-manchester-yunayted-erik-ten-hag-prokommentiroval-pobedu-nad-chelsi-2154554/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Главный тренер «Манчестер Юнайтед» Эрик тен Хаг прокомментировал победу над «Челси» (2:1) в 15-м туре АПЛ.","content":"Главный тренер «Манчестер Юнайтед» Эрик тен Хаг прокомментировал победу над «Челси» (2:1) в 15-м туре АПЛ. «У меня всегда могут быть претензии, но мы довольны результатом и игрой. В первые 30 минут на поле у нас все получалось. Но потом не нужно было пропускать гол. Мы выключились из игры. Нам нужно делать развиваться. Мы движемся в правильном направлении. Мактоминей очень хороший игрок. Он остановил «Челси» вместе с Антони. Он забил два гола и мог бы забить еще», — приводит слова тен Хага ВВС. «Манчестер Юнайтед» набрал 27 очков и поднялся на 6-е место в турнирной таблице.","pubDate":"2023-12-07 03:20:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"35b77d07f5af5598aeb8888c238be42c","title":"New coach Jon Poppe sets Ivy League title goal for Columbia","link":"https://nypost.com/2023/12/06/sports/new-coach-jon-poppe-sets-ivy-league-title-goal-for-columbia/","keywords":null,"creator":["Miles Schachner"],"video_url":null,"description":"Jon Poppe spoke of promises to fulfill, goals to reach and a culture to build, but made one thing clear: he was hired to bring Columbia a championship.","content":"Columbia football has a new coach — and he brings a reunion with lofty expectations. When an energetic, impassioned Jon Poppe approached the podium inside Columbia’s gymnasium on Wednesday, he spoke of promises to fulfill, goals to reach and a culture to build, but made one thing clear: he was hired to bring Columbia a championship. For a Columbia football program with a singular Ivy League title — won back in 1961 — championships are hard to come by. But Poppe, who spent three seasons at Columbia as a secondary coach and recruiting coordinator from 2015-17, appeared ready to accept that challenge. “We will never be complacent,” Poppe said. “The hunger is always going to exist. We’re going to focus on recruiting efforts on the best and brightest. … We want young people here that desire to be challenged.” The 38-year-old New Jersey native returns to Morningside Heights after successful stints at Harvard as a secondary and special teams coach and one year as a head coach at Union College. Poppe led the Garnet Chargers to a 10-2 record and the second round of the Division III Tournament last season, adding four wins to the team’s record and earning him a look when the Columbia job became available. He succeeds interim head coach Mark Fabish, a former offensive coordinator who stepped into the head-coaching role unexpectedly in 2023 when Al Bagnoli, a nine-time Ivy champion, retired six weeks before the season opener due to health concerns. Bagnoli, who served as a head coach for 40 years and compiled 274 wins, was coaxed out of retirement in 2015 to resurrect a Columbia program that had finished winless in consecutive seasons. \"You can make history here.\" – @Coach_Poppe #RoarLionRoar // #OnlyHere 🗽🦁 pic.twitter.com/TgTtKBVx7Y He did just that, the team’s best season during his tenure coming in 2017 when the Lions went 8-2 and came within one win of a sought-after conference championship. “We’ve come close here in my time,” Poppe, who helped recruit members of the 2017 team, said. “And sometimes the football bounces a funny way. So hopefully we’re preparing our young men right in practice, to get that ball to bounce the right way. We’ve got to get Lady Karma on our side, that’s a big part of football sometimes.” Poppe inherits a team that stumbled during a transitional 2023 campaign, posting a 1-6 Ivy League record for its worst year since 2015. Fortunately for Columbia, Poppe has reached the Ivy League mountaintop before. During Poppe’s initial three-year stint at Harvard from 2011-14, the Crimson took home three conference championships as he led its secondary and special teams groups. Now, Columbia will look to Poppe to take the school where it hasn’t been in over 60 years.","pubDate":"2023-12-07 03:15:22","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/12/newspress-collage-qlbn0aru3-1701916253235.jpg?quality=90&strip=all&1701898288","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"19398ad7cc65358996ac0ea4eaf5d2e7","title":"L’OM enfonce Lyon sur fond de protestations des groupes de supporteurs","link":"https://www.lemonde.fr/sport/article/2023/12/07/l-om-enfonce-lyon-sur-fond-de-protestations-des-groupes-de-supporteurs_6204287_3242.html","keywords":null,"creator":null,"video_url":null,"description":"Reportée après les incidents du 29 octobre, la rencontre de mercredi a été marquée par un festival offensif phocéen (3-0) et un début de grogne des ultras marseillais contre les interdictions de déplacement.","content":"Cette fois, le match entre l’Olympique de Marseille (OM) et l’Olympique lyonnais (OL) version 2023-2024 a bien eu lieu. Reportée le 29 octobre, après les attaques par des supporteurs marseillais de plusieurs bus des visiteurs, dont celui transportant les joueurs de l’OL, la rencontre entre ces deux rivaux historiques du championnat de France s’est tenue sans incident, mercredi 6 décembre, au Stade-Vélodrome, à Marseille. Mais elle marque aussi le début d’une grogne du milieu ultra, qui s’oppose à la volonté des pouvoirs publics d’interdire temporairement tout déplacement lors de matches classés « à risque » par la division nationale de lutte contre le hooliganisme. Devant 54 238 spectateurs, qui ont quitté l’enceinte ravis, l’OM s’est imposée facilement (3-0) , mercredi. L’équipe signe ainsi sa troisième victoire d’affilée en autant de sorties sur sa pelouse, et a disputé, de l’avis général, son meilleur match de la saison. Avec deux passes décisives et un but, l’attaquant Pierre-Emerick Aubameyang confirme son renouveau ; après ses quatre buts en deux rencontres, la recrue phare de l’intersaison de l’OM, bien aidée par la présence du Portugais Vitinha – un but, une passe décisive — titularisé à ses côtés, a fait taire les sifflets qui l’avaient accueilli une semaine plus tôt lors de la confrontation contre l’Ajax d’Amsterdam en Ligue Europa. « On ne doit pas croire qu’on a tout résolu », a relativisé l’entraîneur marseillais, l’Italien Gennaro Gattuso, après la rencontre, rappelant que son équipe avait peiné dans les matches précédents. L’équipe lyonnaise, elle, poursuit son annus horribilis . La présence sur le banc de l’OL de Pierre Sage, entraîneur intérimaire , n’a rien changé aux errements d’une formation inoffensive et fragile défensivement. « Nous avons été en non-maîtrise tout au long du match », a reconnu le coach lyonnais. Avec sept points en quatorze matches, l’OL se traîne en queue de classement et semble, plus que jamais, sous la menace d’une relégation en Ligue 2. « Nous avons conscience d’être en danger », confirme Pierre Sage. Ce match entre Marseille et Lyon n’a pas été un sommet de football. Mais il était surtout scruté pour ses à-côtés. Le contexte de ces retrouvailles, pesant depuis l’annulation du premier face-à-face, s’est encore alourdi avec la mort, dimanche, d’un supporteur nantais , poignardé par un chauffeur de VTC en amont de la rencontre entre Nantes et Nice. Mercredi, l’arrivée du bus de l’OL était sûrement la plus attendue de la saison en Ligue 1. A 19 h 30, précédé de motards, d’une voiture et de deux fourgons de police, le véhicule transportant les joueurs et le staff technique lyonnais, un autocar classique loué à un transporteur vauclusien, a pénétré dans les entrailles du Stade-Vélodrome. « Sans incident », a précisé la préfecture de police, qui avait mobilisé près de 700 policiers et gendarmes pour éviter tout débordement. Un véhicule blindé avec un canon à eau trônait même à l’entrée du stade alors que des drones surplombaient la scène.","pubDate":"2023-12-07 03:15:15","image_url":"https://img.lemde.fr/2023/12/06/1347/0/8078/4039/644/322/60/0/b36ac77_1dea1d613c054911ab059df855c785ed-0-035f492235a345d09d6eb0d9c7b4f344.jpg","source_id":"lemonde","source_priority":12566,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"4ee668543e1d1346c57cde7e64e6d822","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.perthnow.com.au/sport/soccer/teen-spirit-drives-brisbane-roar-towards-alm-nirvana-c-12819212","keywords":null,"creator":["Joel Gould"],"video_url":null,"description":"Brisbane Roar coach Ross Aloisi has given A-League debuts to teenagers Tom Waddingham, Shae Cahill, Quinn MacNicol and Rylan Brownlie this season.","content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday.","pubDate":"2023-12-07 03:14:59","image_url":"https://images.perthnow.com.au/publication/C-12819212/c785e30da91e70aa28e7a8b81ca09a1b68e07e5d-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"3a11dc15a19cb93d5a6ae0556ea3c377","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.busseltonmail.com.au/story/8451709/teen-spirit-drives-brisbane-roar-towards-alm-nirvana/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday. Australian Associated Press","pubDate":"2023-12-07 03:12:10","image_url":"https://www.busseltonmail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/b932b1fa-d072-4797-a174-650a9d848f79.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail","source_priority":6251187,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0ae9e10bd3f29b30ad1daabdf72c80af","title":"Teen spirit drives Brisbane Roar towards ALM nirvana","link":"https://www.blayneychronicle.com.au/story/8451709/teen-spirit-drives-brisbane-roar-towards-alm-nirvana/?src=rss","keywords":null,"creator":["Joel Gould"],"video_url":null,"description":null,"content":"Brisbane Roar coach Ross Aloisi has an \"if you are good enough, you are old enough\" philosophy about picking young players and it is an ethos he is putting into practice. / (min cost $ 8 ) Login or signup to continue reading The Roar, fourth in the A-League Men, have this season given debuts to 18-year-old Young Socceroos striker Tom Waddingham, midfielders Shae Cahill (18) and Quinn MacNicol (15) and striker Rylan Brownlie (16). Brownlie had a potential late winner disallowed for offside in added time of last week's 2-2 draw against Western Sydney Wanderers, while Cahill marked his debut with a cracking strike that was brilliantly saved in the game's dying minutes. \"I don't look at age, I look at the footballer,\" Aloisi said when asked about backing youth. \"Someone mentioned, 'If (Shae) wasn't Tim Cahill's son, would you have signed him?'. The question is not about whose son it is, that is irrelevant to me. \"I didn't look at Rylan Brownlie and say, 'That's Royce Brownlie's son'. I looked at the footballer. It is the same with Shae Cahill. \"I look at the footballer and who we have available, and we had Flo Berenguer out injured (against the Wanderers). Shae is very quick and has a great eye for goal. \"(Cahill and Brownlie) were not on for very long but both had goalscoring opportunities, which is fantastic. \"Waddingham could have had two in that game and he's had clear-cut chances in other games he has played.\" All the teenagers are projects for the club. Aloisi made the point that they were not signed to slot immediately into the starting side but rather to be moulded into quality footballers suitable for the Roar's playing style. \"They all have different characteristics,\" Aloisi said. \"It is exciting for the club and it can be difficult because they are young, and with young players come inconsistencies. \"But I can't ask any more than what they are giving me. \"We are relying on an 18-year-old boy to lead our front line but the way Tom plays he looks a lot older and more experienced, and he is growing each game.\" Experienced Roar defender Jack Hingert, 33, said the young brigade had earned their opportunity. \"It is exciting for us older players to help these guys continue to improve. As you can see, they are great young players,\" he said. \"They deserve to be here. That is why they are here. If Ross thinks you are ready, no matter how old you are, you will be out there.\" The Roar are away to fifth-placed Adelaide United on Sunday. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-12-07 03:12:10","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/b932b1fa-d072-4797-a174-650a9d848f79.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cf16ad88ec24c81e76a8073b86859b49","title":"Санчес — первый за 2,5 года вратарь «Челси», отбивший пенальти в матче АПЛ","link":"https://www.sport-express.ru/football/england/news/sanches-pervyy-za-2-5-goda-vratar-chelsi-otbivshiy-penalti-v-matche-apl-2154552/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Голкипер «Челси» Роберт Санчес стал первым вратарем клуба за 2,5 года, отбивший пенальти в матче АПЛ.","content":"Голкипер «Челси» Роберт Санчес стал первым вратарем клуба за 2,5 года, отбивший пенальти в матче АПЛ. Санчес отразил удар Бруну Фернандеша с 11-метрового на 9-й минуте встречи 15-го тура АПЛ с «Манчестер Юнайтед» (1:2). При этом предыдущие 10 пенальти в ворота «Челси» в лиге были реализованы. Последний раз пенальти отбивал Эдуар Менди в мае 2021 года в игре «Челси» с «Сити». Лондонцы с 19 очками занимают 10-е место в турнирной таблице АПЛ. 10 декабря команда сыграет с «Эвертоном».","pubDate":"2023-12-07 03:10:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"7b330e184970bb968fabf249d2a75ffb","title":"Тоттенгем - Ньюкасл: де і коли дивитися онлайн матч 16 туру АПЛ 10.12.2023","link":"https://champion.com.ua/football/2023/12/07/945060/tottenhem-nyukasl-de-dyvytysya-match-apl","keywords":["Футбол"],"creator":null,"video_url":null,"description":"У матчі 16-го туру АПЛ Тоттенгем зіграє з Ньюкаслом.Підключитися до МегогоМатч відбудеться у неділю, 10 грудня. Початок матчу о 18:30 за київським часом.Дивитися поєдинок можна на ОТТ-платформі Setanta Sport та телеканалі Setanta Sport....","content":"#Ньюкасл , #Тоттенгем Джерело - Чемпіон . У матчі 16-го туру АПЛ Тоттенгем зіграє з Ньюкаслом. Підключитися до Мегого Матч відбудеться у неділю, 10 грудня . Початок матчу о 18:30 за київським часом. Дивитися поєдинок можна на ОТТ-платформі Setanta Sport та телеканалі Setanta Sport.","pubDate":"2023-12-07 03:10:00","image_url":"https://champion.com.ua/storage/news/main/regular/5f4e80447d51b1db671eb501678f1c3b.jpg","source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"4fbb37da0039be327f1fe02b6e37b74d","title":"Soccer-Pochettino 'not disappointed' in Chelsea performance despite Man United loss","link":"https://www.thestar.com.my/sport/football/2023/12/07/soccer-pochettino-039not-disappointed039-in-chelsea-performance-despite-man-united-loss","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Chelsea manager Mauricio Pochettino said he was not disappointed in their performance in Wednesday's 2-1 loss at Manchester United because his players \"gave everything.\" Read full story","content":"(Reuters) - Chelsea manager Mauricio Pochettino said he was not disappointed in their performance in Wednesday's 2-1 loss at Manchester United because his players \"gave everything.\" Pochettino said Chelsea had played well enough to get a draw but could not match the hosts' energy and aggression. \"A few days ago we were talking about a fantastic performance and how we were going well,\" he told reporters, referring to their win over Brighton on Sunday. \"Today because we didn’t get what we wanted here, we cannot change what we say now.\" Pochettino had predicted a tough outing at Old Trafford, saying it was not a good time to face Manchester United as they had a point to prove after losing at Newcastle United. \"I am not disappointed because the players gave everything, but maybe we didn’t match the energy. They were a little bit more aggressive than us,\" he added. \"But we were competitive because we made chances and maybe enough to draw the game. But when the result is 2-1 you get nothing. I think we need to be calm and keep going, trying to help the players to be ready for Sunday.\" Chelsea, who are 10th in the league with 19 points from 15 games, visit Everton on Sunday. (Reporting by Chiranjit Ojha in Bengaluru; Editing by Peter Rutherford)","pubDate":"2023-12-07 03:10:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/12/07/2426602.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"}]}