{"newsArray":[{"title":"How to watch Manchester United vs Real Betis with TV channel, live stream and kick-off time","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-betis-stream-tv-26407505","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"United welcome Manuel Pellegrini and Real Betis to Old Trafford for the first leg of their Europa League round of 16 tie","content":"Manchester United have the perfect opportunity to respond to their embarrassing 7-0 defeat against Liverpool at Anfield when the Europa League returns on Thursday. Former Manchester City manager Manuel Pellegrini brings a fourth different team to Old Trafford for this first leg round of 16 tie and will be looking to pile more misery onto Erik ten Hag 's side. Across spells at City, Villarreal and West Ham United , the veteran coach has won just one of six matches away against United , which was a 3-0 Manchester derby victory in the 2013/14 season. While Pellegrini knows the northwest well, Betis and United have never previously played each other in a competitive fixture, but the two teams did contest a mid-season friendly during the winter break, which the hosts won 1-0 in Seville. Nabil Fekir scored the only goal of that game just after half time but he won't be facing Ten Hag's team in either leg after sustaining an anterior cruciate ligament injury late last month that has ruled the France World Cup winner out for the season. Here's all the details of how you can watch the contest. READ MORE: Ten Hag can revert to best United attack vs Real Betis What time is kick-off? Thursday's match at Old Trafford kicks off at 8:00pm GMT (3pm ET; noon PT). Where can I watch? BT Sport are broadcasting the match across the United Kingdom on their main BT Sport 1 channel. Coverage starts at 7:15pm, with 45 minutes of build-up before kick-off. How can I stream? The match can also be viewed online by logging into the BT Sport website and navigating to the 1HD channel in the 'Watch' tab. Mobile users can also watch on their devices using the BT Sport app and are also able to cast the coverage onto a Chromecast-compatible device too. Team news For United, there are no fresh injury concerns following the match at Anfield but Anthony Martial , Christian Eriksen and Donny van de Beek all remain out. While their opponents will be without Fekir, fellow midfielder Sergio Canales could be fit to feature in the first leg after missing the last two league outings with a thigh injury. READ NEXT: All the latest United news and views United defender has accidentally solved an unlikely headache for Ten Hag United fans name ideal next captain after Bruno Fernandes criticism United made three tactical errors in Liverpool thrashing Two United youngsters clash as Alvaro Fernandez sends Ten Hag message","pubDate":"2023-03-09 16:10:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article25775130.ece/ALTERNATES/s615/0_GettyImages-1437050320.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Europa League rules on VAR, extra time and yellow cards before Manchester United vs Real Betis","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-betis-europa-rules-26411459","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The Europa League returns to Old Trafford on Thursday as the round of 16 stage starts","content":"Manchester United have reached the last 16 of the Europa League in each of the six occasions that they have competed in UEFA's second-tier competition. Italian giants AC Milan were there most recent opponents at this stage of the 2020/21 edition and were narrowly beaten 2-1 by Ole Gunnar Solskjaer's side on aggregate. United have also previously played Spanish opposition in this round before, back when they were knocked out against Marcelo Bielsa's Athletic Club in 2012. Former Manchester City manager Manuel Pellegrini and Real Betis will hope to take encouragement from that feat when heading to Old Trafford for this week's first leg tie. Much has changed rule-wise over those 11 years, though, and even since Solskjaer's side reached the 2021 final, so the Manchester Evening News have recapped the competition's ever-changing rules before kick-off. READ MORE: Ten Hag can revert to best United attack vs Real Betis Is there VAR? As it has been throughout the group stages and during both legs against Barcelona , video assistant referees will be used during the Europa League round of 16 too. After it was also introduced for the Europa Conference League knockout rounds too, VAR is used across all three UEFA club competitions at least from the the knockout round play-offs onwards. What about away goals and extra time? UEFA announced in late June 2021 that the away goals rule was being abolished across all of their club competitions ahead of the 2021/22 season starting. So, now two teams tied on aggregate at the end of 90 minutes in their second leg play another 30 minutes of extra-time and a penalty shootout if required to decide a winner. Could yellow card accumulation be a worry? It already affected United during the play-offs when Lisandro Martinez and Marcel Sabitzer were both suspended for the first leg against Barcelona, and another key player is a caution away from missing the second leg against Betis. Casemiro was booked in both meetings with Barca and would not be available for the return leg in Seville should he see yellow again at Old Trafford this midweek. READ NEXT: All the latest United news and views United defender has accidentally solved an unlikely headache for Ten Hag United fans name ideal next captain after Bruno Fernandes criticism United made three tactical errors in Liverpool thrashing Two United youngsters clash as Alvaro Fernandez sends Ten Hag message","pubDate":"2023-03-09 16:10:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26412881.ece/ALTERNATES/s615/0_GettyImages-1466781050-2jpgwas.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Manchester United fined by Uefa after Europa League clash vs Barcelona","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/uefa-fine-manchester-united-barcelona-26431022","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Man United ended up progressing 4-3 on aggregate at Old Trafford and next face Real Betis.","content":"European football's governing body UEFA have hit Manchester United with a €6,125 fine following their clash with Barcelona at Camp Nou. The fixture which took place last month saw the Reds and Barca play out an entertaining 2-2 draw. Marcos Alonso gave Xavi's team the lead on 50 minutes but Marcus Rashford equalised for the away side moments later. A Jules Kounde own goal put United in control however an equaliser from former Leeds man Raphinha, 15 minutes from full time, ensured that the game was firmly in the balance. Despite the entertainment on offer on the pitch, an incident in the stands has led to action from UEFA. ALSO READ: United have better options than Kane UEFA's Control, Ethics and Disciplinary body have ruled that the fine should be awarded to United after fans were adjudged to have thrown objects during the match. The penalty for the club totals £5,437. United would go on to progress in the Europa League play offs thanks to a comeback victory at the Theatre of Dreams. Robert Lewandowski had given Barca the lead again from the penalty spot before Fred equalised just after the interval. Antony's well-placed strike in the 73rd minute was enough to win the tie and send Barcelona crashing out of Europe altogether. Erik ten Hag and co's reward for beating the Catalan club is a round of 16 clash with further La Liga opposition in the form of Real Betis. Manuel Pellegrini's side travel to Old Trafford this evening before returning to Spain for the reverse fixture next Thursday, March 16. READ NEXT: Get all the latest United news here United have two months to convince Bellingham and Osimhen How United should line-up vs Real Betis Ten Hag confirms Sabitzer blow Five United players might be fearing Ten Hag team selection","pubDate":"2023-03-09 16:06:45","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26431541.ece/ALTERNATES/s615/0_GettyImages-1247222501.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lionel Messi dig as Cristiano Ronaldo Champions League admission made by Bayern Munich star","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/cristiano-ronaldo-lionel-messi-al-26432000","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Alex James)"],"video_url":null,"description":"Messi and PSG exited the Champions League following defeat by Bayern Munich","content":"Cristiano Ronaldo may not be featuring in the Champions League these days but his impact in the competition has not been forgotten at the highest level. Bayern Munich star Thomas Muller referenced the former Manchester United man, now playing his club football in Saudi Arabia for Al-Nassr, in the wake of his side knocking Paris St-Germain out of the Champions League on Wednesday night - and Lionel Messi was on the end of the German's cheeky dig. Muller featured for Bayern as they beat Messi and Co 2-0 on Wednesday night to complete a 3-0 aggregate victory which moved the German champions into the last eight. For PSG, the wait for European success will go on for at least another season and Muller was confident of progression despite World Cup winner Messi lining up on the opposite side. Read more: Martial returns to full training \"Against Messi, things always go well at all levels in terms of results,\" the Germany international told reporters post-match. \"At club level, Cristiano Ronaldo was our problem when he was at Real Madrid.\" Muller may have cheekily taunted Messi in the aftermath of the game but he also heaped praise on the 35-year-old for leading Argentina to World Cup victory in December. \"I have the greatest respect for Messi's World Cup performance,\" the Bayern man added. \"His individual performance was amazing. He carried the whole squad. It's not so easy to play at a team like PSG. It's difficult to get a really good team balance.\" Read more: Ten Hag makes decision on Fernandes United's training squad vs Betis revealed United confirm Sabitzer blow Rashford hits back at 'nonsense' criticism All the latest United news and views","pubDate":"2023-03-09 16:03:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26432016.ece/ALTERNATES/s615/0_GettyImages-1457735279.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Parution d'”Épopée des Lions de l’Atlas”, un ouvrage qui retrace les exploits de l’équipe nationale de football au Mondial-2022","link":"http://www.mapexpress.ma/actualite/sports/parution-depopee-lions-latlas-ouvrage-retrace-les-exploits-lequipe-nationale-football-au-mondial-2022/","keywords":null,"creator":["MAP"],"video_url":null,"description":"\"Épopée des Lions de l’Atlas\" est l’intitulé d’un ouvrage qui vient d’être édité par \"Première Ligne Edition\", en hommage aux joueurs de l’équipe nationale de football qui ont signé une participation historique au Mondial Qatar-2022. Cet article Parution d'”Épopée des Lions de l’Atlas”, un ouvrage qui retrace les exploits de l’équipe nationale de football au Mondial-2022 est apparu en premier sur MAP Express.","content":"Casablanca – “Épopée des Lions de l’Atlas” est l’intitulé d’un ouvrage qui vient d’être édité par “Première Ligne Edition”, en hommage aux joueurs de l’équipe nationale de football qui ont signé une participation historique au Mondial Qatar-2022. “Ce bel ouvrage de 220 pages retrace toutes les étapes de ce mois magique de décembre 2022 et les répercussions nationales et mondiales de ces exploits footballistiques”, indique un communiqué de “Première Ligne Edition”. Dans un devoir de mémoire, l’ouvrage “Épopée des Lions de l’Atlas” retrace ainsi “les exploits historiques du Onze National, mais aussi de tout le peuple marocain”, note la même source. Il s’agit d'”un livre collector pour perpétuer le rêve et continuer à faire rayonner le Maroc dans le monde”, ajoute-t-on. Par ailleurs, relève le communiqué, l’ouvrage est agrémenté de magnifiques photos provenant pour la majorité de l’agence Maghreb Arabe Presse (MAP) qui a suivi les exploits des Lions de l’Atlas et des Marocains dans le monde entier. Quatre grandes thématiques sont abordées par l’ouvrage : “Epopée d’une équipe vaillante”, “Des valeurs extraordinaires”, “La ferveur d’un peuple” et “Le Maroc célébré dans le Monde”. Pour ce qui est d’”Epopée d’une équipe vaillante”, il s’agit du récit d’une épopée qui a marqué l’histoire du football marocain et de joueurs expérimentés et talentueux qui ont montré un nouveau visage du football nationale. S’agissant de la thématique “Des valeurs extraordinaires”, l’ouvrage met en exergue les magnifiques valeurs véhiculées par les Lions de l’Atlas qui ont ému le monde entier et cassé les codes habituels du football, livrant une image spontanée qui trouve ses fondements dans l’Islam et dans la culture et les traditions marocaines. Quant à “La ferveur d’un peuple”, le livre rappelle que les supporters marocains se sont déplacés en nombre au Mondial 2022 pour soutenir l’équipe nationale. Dans le même temps, dans toutes les villes du Maroc, des marées humaines sont sorties spontanément dans les rues pour célébrer les victoires successives des Lions. Enfin, pour la thématique “Le Maroc célébré dans le monde”, l’ouvrage souligne que les exploits des Lions de l’Atlas ont surpris le monde entier. De grandes personnalités dont Elon Musk ainsi que nombre de Chefs d’Etats ont félicité l’équipe Nationale mettant ainsi un coup de projecteur exceptionnel sur le Maroc. La presse internationale a relayé cet engouement. Jamais le hashtag Maroc n’a autant était utilisé. “Dans la lignée des livres édités par Première Ligne Edition, l’ouvrage “Épopée des Lions de l’Atlas” se veut un ouvrage raffiné et moderne afin de sublimer les exploits des Lions de l’Atlas, la ferveur de tout le peuple marocain et notre drapeau rouge frappé d’une étoile verte”, conclut le communiqué.","pubDate":"2023-03-09 15:51:33","image_url":"http://www.mapexpress.ma/wp-content/uploads/2023/03/Nouveau-projet20-204x120.jpg","source_id":"mapexpress","category":["sports"],"country":["morocco"],"language":"french"},{"title":"Corinne Diacre, l’inévitable éviction","link":"https://www.lefigaro.fr/sports/football/corinne-diacre-l-inevitable-eviction-20230309","keywords":["Football"],"creator":null,"video_url":null,"description":"DÉCRYPTAGE - La Fédération française de football a décidé de se séparer de la sélectionneuse des Bleues, critiquée par certaines de ses joueuses.","content":"DÉCRYPTAGE - La Fédération française de football a décidé de se séparer de la sélectionneuse des Bleues, critiquée par certaines de ses joueuses. La chronique d’une éviction attendue, et rendue inévitable par le contexte extrêmement tendu des dix derniers jours. À 12 h 54, ce jeudi, la Fédération française de football (FFF) a publié un communiqué sur son site afin d’officialiser le départ de Corinne Diacre, démise de ses fonctions de sélectionneuse de l’équipe nationale féminine sur les recommandations d’une commission composée de quatre membres (Laura Georges, Aline Reira, Jean-Michel Aulas et Marc Keller). «Les nombreuses auditions menées ont permis d’établir le constat d’une fracture très importante avec des joueuses cadres et mis en lumière un décalage avec les exigences du très haut niveau , explique l’organe dirigeant. Cette fracture a atteint un point de non-retour qui nuit aux intérêts de la sélection. Si la FFF reconnaît l’implication et le sérieux de Corinne Diacre et son staff dans l’exercice de leur mission, il apparaît que les dysfonctionnements constatés semblent, dans ce contexte, irréversibles. Au regard de ces éléments… Cet article est réservé aux abonnés. Il vous reste 77% à découvrir. Vous avez envie de lire la suite ? Débloquez tous les articles immédiatement. Sans engagement. Déjà abonné ? Connectez-vous","pubDate":"2023-03-09 15:46:48","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Manchester United vs Real Betis LIVE Europa League updates, TV channel information and Marcel Sabitzer latest","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-real-betis-live-26423432","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Samuel Luckhurst, Tyrone Marshall, Steven Railston)"],"video_url":null,"description":"Man United play Real Betis in the Europa League on Thursday and we'll bring you updates throughout the match in our live blog.","content":"Manchester United must respond with a strong performance against Real Betis after a disastrous showing at Anfield. United were defeated 7-0 against fierce rivals Liverpool at the weekend and Erik ten Hag branded the performance as 'unprofessional', whilst Luke Shaw, the first to emerge from the dressing room after the game, admitted he was 'embarrassed'. The defeat was the joint-biggest against Liverpool in the club's history, but the players now have the opportunity to bounce back, just four days later, against Spanish side Real Betis in the first leg of a Europa League Round of 16 tie. Real Betis held Real Madrid to a goalless draw on Sunday and they are currently fifth in La Liga. They are managed by former Man City manager Manuel Pellegrini, who said this week he 'does not know what to expect' from United after Anfield. Regarding the early team news, Anthony Martial remains unavailable for selection as he looks to return from a hip injury. Ten Hag has also confirmed that Marcel Sabizter, who was a late substitute at Anfield, will be unavailable for selection. Follow the blog for live updates from Old Trafford. 16:54 Steven Railston How United should line up vs Real Betis United need to deliver a strong performance against Real Betis tonight. Sunday's performance at Anfield was embarrassing and a response is needed. Our writers have had their say on how United should start. Share Comments 16:54 Steven Railston Europa League winner odds United are the favourites to win the competition. Europa League outright winner 2022/23 Man United 5/2 Arsenal 3/1 Juventus 8/1 Union Berlin 12/1 Roma 16/1 Betis 20/1 Odds via Betway . Daley Blind with the Europa League. Share Comments 16:37 Steven Railston Bet £10 get £40 in bonuses with Betfred Share Comments 16:18 Steven Railston What TV channel is United vs Real Betis on? The match will be shown on BT Sport 1 in the UK and will also be available on the BT Sport app and at bt.com/sport for live streaming. Coverage will get underway an hour before kick-off. But as always, we'll bring you live updates in this matchday blog. (Image: Photo Prestige/Soccrates/Getty Images.) Share Comments 15:50 Steven Railston United training squad for Real Betis revealed Marcel Sabitzer was missing from the United training squad ahead of the first leg of their Europa League last-16 tie against Real Betis, but Anthony Martial was present despite his manager ruling him out of the game. Erik ten Hag's side will be looking to bounce back from their 7-0 thrashing by Liverpool with a much-improved performance against their La Liga opponents on Thursday night. United held their open training session on Wednesday afternoon and hinted at fielding another strong side against Betis with the players who are available. Read the full story here. United train ahead of Real Betis (Image: TyMarshall_MEN) Share Comments Steven Railston Welcome Hello and welcome to today's Manchester United live match blog. Share Comments","pubDate":"2023-03-09 15:39:17","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26423439.ece/ALTERNATES/s615/0_Man-Utd-v-Betis-Blog.png","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | WATCH: What happened to Messi after PSG's UCL exit","link":"https://www.snl24.com/KickOff/WorldNews/UEFA-Champions-League/watch-what-happened-to-leo-messi-after-psgs-champions-league-exit-20230309","keywords":null,"creator":null,"video_url":null,"description":"After Paris Saint-Germain's UEFA Champions League fate was confirmed on Wednesday, Lionel Messi's night almost went from bad to worse because of an overzealous fan. See the incident here!","content":"The Parc des Princes side's search for a UCL title continues after their most recent exit at the hands of Bayern Munich. PSG have spent more than £1 billion (R22 billion) on new signings since their Qatari takeover in 2012, and have won eight league titles and 12 domestic cups under the new ownership, but are yet to taste glory in Europe's premier club competition. On Wednesday, Messi cut a frustrated figure once again as it has been eight years since he last won the tournament, with FC Barcelona in 2015, while reports suggest that the Argentine may have played his last game in the showpiece as he continues to be linked with moves to teams outside of Europe once his contract expires in June. However, things could have actually turned out a lot worse for Messi on Wednesday night when, following the final whistle, a fan proceeded to run towards the footballer at full speed. Just before reaching the player, though, he slipped, narrowly avoiding injuring the South American, before a steward fell into the player too. The supporter was quickly apprehended by a host of stewards as Messi looked on in confusion. Had Messi got hurt during the incident, it would have been another sizable blow for PSG manager Christophe Galtier after Neymar was ruled out for the remainder of the season due to injury earlier this week. You must be to read and post comments.","pubDate":"2023-03-09 15:18:01","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Pogba 'punished' by Juventus","link":"https://www.snl24.com/KickOff/WorldNews/Serie-A/pogba-punished-by-juventus-just-weeks-after-returning-to-action-20230309","keywords":null,"creator":null,"video_url":null,"description":"Paul Pogba has now reportedly been punished by Juventus just weeks after his return to the football pitch.","content":"Pogba is believed to be set to miss the team's upcoming matchday squad for disciplinary reasons. The Frenchman recently made his return to the first team set-up after a lengthy injury lay-off, making his second debut for the Serie A giants late in February following his free-agent departure from Manchester United in July last year. Prior to his return, though, it was claimed that Juventus were ready to part ways with the midfielder after becoming frustrated with the Frenchman for a number of reasons. Now, according to Italian journalist Fabrizio Romano, Pogba has been dropped from the Juventus squad for their UEFA Europa League clash against Freiburg on Thursday, having been punished by the club for arriving late for a team dinner. Earlier this season, Pogba was embroiled in a controversial saga with his brother that involved witchcraft. This led to the 29-year-old admitting to having contacted a witchdoctor but denying any assertion that he had a spell casted on his France teammate Kylian Mbappe. The midfielder also came under fire earlier this campaign when he was seen on a skiing trip despite being injured, and received the ire of his club when he delayed surgery on a knee injury in the hopes of playing for France at the 2022 FIFA World Cup. He would miss the tournament altogether, and has since played only 35 minutes of football to date for Juventus this season. You must be to read and post comments.","pubDate":"2023-03-09 15:18:01","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Djibril Cisse hits back at Manchester United great Wayne Rooney","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/cisse-rooney-man-city-qpr-26427742","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"The Manchester United legend recently questioned why QPR opted to give the ball straight back to Manchester City after City had equalised on the final day of the 2011-12 Premier League season.","content":"Former QPR striker Djibril Cisse has hit back at Wayne Rooney's claims that the London club helped Manchester City win the Premier League in 2012 and has suggested that Manchester United should have wrapped the title up much sooner. Cisse's side lost in dramatic circumstances at the Etihad as striker Sergio Aguero scored a late goal to win the game 3-2 and secure the title over their rivals. Speaking in May, Rooney took aim at Paddy Kenny and Cisse for their actions that day in Manchester and asked why that game was never 'questioned'. The United legend told The Sun : \"Paddy Kenny should have done better for a couple of the goals. City get the second goal and QPR kick it straight back to them and that's never been questioned - I find that strange. ALSO READ: Rooney channels Ferguson approach \"Djibril Cisse celebrating after the game with the City players, but yeah listen it's a historic moment in the Premier League so I'm sure that - if you are not involved as a Manchester United player, that's probably one of the greatest moments in the league.\" Responding to these accusations, the former Liverpool striker explained that Rooney's comments regarding QPR's motives were wrong. Cisse told Lord Ping : \"I understand why Wayne Rooney would question City’s comeback against QPR that day. It was strange. \"Though it was up to Manchester United to win the league during the season and if they left it until the last day, that is not our fault. I like Rooney and feel his pain, but it wasn’t up to us. \"They should have secured the win early on. For us, we were winning 1-0 and then we conceded a red card. We then conceded a goal in the last second, but trust me I was in the squad and no-one said: 'Let’s lose the game for Manchester City .' I would have never let that happen. \"I love football too much and I am a professional.\" Kenny also responded to Rooney at the time of his comments but was a lot more cut-throat with his reply. In a tweet, he posted two pictures of himself and Rooney, appearing to suggest he had aged better than Rooney, with the caption: \"36 v 44. Rooney must of let that Aguero goal get to him.\" READ NEXT: Get all the latest United news here Get all the latest City news here Rooney names three qualities that Rashford has rediscovered Aguero names Messi's next club Haaland takes City record off Aguero","pubDate":"2023-03-09 15:14:46","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26428001.ece/ALTERNATES/s615/0_GettyImages-144305273.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How to watch Manchester United vs Real Betis with TV channel, live stream and kick-off time","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-betis-stream-tv-26407505","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"United welcome Manuel Pellegrini and Real Betis to Old Trafford for the first leg of their Europa League round of 16 tie","content":"Manchester United have the perfect opportunity to respond to their embarrassing 7-0 defeat against Liverpool at Anfield when the Europa League returns on Thursday. Former Manchester City manager Manuel Pellegrini brings a fourth different team to Old Trafford for this first leg round of 16 tie and will be looking to pile more misery onto Erik ten Hag 's side. Across spells at City, Villarreal and West Ham United , the veteran coach has won just one of six matches away against United , which was a 3-0 Manchester derby victory in the 2013/14 season. While Pellegrini knows the northwest well, Betis and United have never previously played each other in a competitive fixture, but the two teams did contest a mid-season friendly during the winter break, which the hosts won 1-0 in Seville. Nabil Fekir scored the only goal of that game just after half time but he won't be facing Ten Hag's team in either leg after sustaining an anterior cruciate ligament injury late last month that has ruled the France World Cup winner out for the season. Here's all the details of how you can watch the contest. READ MORE: Ten Hag can revert to best United attack vs Real Betis What time is kick-off? Thursday's match at Old Trafford kicks off at 8:00pm GMT (3pm ET; noon PT). Where can I watch? BT Sport are broadcasting the match across the United Kingdom on their main BT Sport 1 channel. Coverage starts at 7:15pm, with 45 minutes of build-up before kick-off. How can I stream? The match can also be viewed online by logging into the BT Sport website and navigating to the 1HD channel in the 'Watch' tab. Mobile users can also watch on their devices using the BT Sport app and are also able to cast the coverage onto a Chromecast-compatible device too. Team news For United, there are no fresh injury concerns following the match at Anfield but Anthony Martial , Christian Eriksen and Donny van de Beek all remain out. While their opponents will be without Fekir, fellow midfielder Sergio Canales could be fit to feature in the first leg after missing the last two league outings with a thigh injury. READ NEXT: All the latest United news and views United defender has accidentally solved an unlikely headache for Ten Hag United fans name ideal next captain after Bruno Fernandes criticism United made three tactical errors in Liverpool thrashing Two United youngsters clash as Alvaro Fernandez sends Ten Hag message","pubDate":"2023-03-09 16:10:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article25775130.ece/ALTERNATES/s615/0_GettyImages-1437050320.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Europa League rules on VAR, extra time and yellow cards before Manchester United vs Real Betis","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-betis-europa-rules-26411459","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The Europa League returns to Old Trafford on Thursday as the round of 16 stage starts","content":"Manchester United have reached the last 16 of the Europa League in each of the six occasions that they have competed in UEFA's second-tier competition. Italian giants AC Milan were there most recent opponents at this stage of the 2020/21 edition and were narrowly beaten 2-1 by Ole Gunnar Solskjaer's side on aggregate. United have also previously played Spanish opposition in this round before, back when they were knocked out against Marcelo Bielsa's Athletic Club in 2012. Former Manchester City manager Manuel Pellegrini and Real Betis will hope to take encouragement from that feat when heading to Old Trafford for this week's first leg tie. Much has changed rule-wise over those 11 years, though, and even since Solskjaer's side reached the 2021 final, so the Manchester Evening News have recapped the competition's ever-changing rules before kick-off. READ MORE: Ten Hag can revert to best United attack vs Real Betis Is there VAR? As it has been throughout the group stages and during both legs against Barcelona , video assistant referees will be used during the Europa League round of 16 too. After it was also introduced for the Europa Conference League knockout rounds too, VAR is used across all three UEFA club competitions at least from the the knockout round play-offs onwards. What about away goals and extra time? UEFA announced in late June 2021 that the away goals rule was being abolished across all of their club competitions ahead of the 2021/22 season starting. So, now two teams tied on aggregate at the end of 90 minutes in their second leg play another 30 minutes of extra-time and a penalty shootout if required to decide a winner. Could yellow card accumulation be a worry? It already affected United during the play-offs when Lisandro Martinez and Marcel Sabitzer were both suspended for the first leg against Barcelona, and another key player is a caution away from missing the second leg against Betis. Casemiro was booked in both meetings with Barca and would not be available for the return leg in Seville should he see yellow again at Old Trafford this midweek. READ NEXT: All the latest United news and views United defender has accidentally solved an unlikely headache for Ten Hag United fans name ideal next captain after Bruno Fernandes criticism United made three tactical errors in Liverpool thrashing Two United youngsters clash as Alvaro Fernandez sends Ten Hag message","pubDate":"2023-03-09 16:10:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26412881.ece/ALTERNATES/s615/0_GettyImages-1466781050-2jpgwas.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Manchester United fined by Uefa after Europa League clash vs Barcelona","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/uefa-fine-manchester-united-barcelona-26431022","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Man United ended up progressing 4-3 on aggregate at Old Trafford and next face Real Betis.","content":"European football's governing body UEFA have hit Manchester United with a €6,125 fine following their clash with Barcelona at Camp Nou. The fixture which took place last month saw the Reds and Barca play out an entertaining 2-2 draw. Marcos Alonso gave Xavi's team the lead on 50 minutes but Marcus Rashford equalised for the away side moments later. A Jules Kounde own goal put United in control however an equaliser from former Leeds man Raphinha, 15 minutes from full time, ensured that the game was firmly in the balance. Despite the entertainment on offer on the pitch, an incident in the stands has led to action from UEFA. ALSO READ: United have better options than Kane UEFA's Control, Ethics and Disciplinary body have ruled that the fine should be awarded to United after fans were adjudged to have thrown objects during the match. The penalty for the club totals £5,437. United would go on to progress in the Europa League play offs thanks to a comeback victory at the Theatre of Dreams. Robert Lewandowski had given Barca the lead again from the penalty spot before Fred equalised just after the interval. Antony's well-placed strike in the 73rd minute was enough to win the tie and send Barcelona crashing out of Europe altogether. Erik ten Hag and co's reward for beating the Catalan club is a round of 16 clash with further La Liga opposition in the form of Real Betis. Manuel Pellegrini's side travel to Old Trafford this evening before returning to Spain for the reverse fixture next Thursday, March 16. READ NEXT: Get all the latest United news here United have two months to convince Bellingham and Osimhen How United should line-up vs Real Betis Ten Hag confirms Sabitzer blow Five United players might be fearing Ten Hag team selection","pubDate":"2023-03-09 16:06:45","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26431541.ece/ALTERNATES/s615/0_GettyImages-1247222501.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lionel Messi dig as Cristiano Ronaldo Champions League admission made by Bayern Munich star","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/cristiano-ronaldo-lionel-messi-al-26432000","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Alex James)"],"video_url":null,"description":"Messi and PSG exited the Champions League following defeat by Bayern Munich","content":"Cristiano Ronaldo may not be featuring in the Champions League these days but his impact in the competition has not been forgotten at the highest level. Bayern Munich star Thomas Muller referenced the former Manchester United man, now playing his club football in Saudi Arabia for Al-Nassr, in the wake of his side knocking Paris St-Germain out of the Champions League on Wednesday night - and Lionel Messi was on the end of the German's cheeky dig. Muller featured for Bayern as they beat Messi and Co 2-0 on Wednesday night to complete a 3-0 aggregate victory which moved the German champions into the last eight. For PSG, the wait for European success will go on for at least another season and Muller was confident of progression despite World Cup winner Messi lining up on the opposite side. Read more: Martial returns to full training \"Against Messi, things always go well at all levels in terms of results,\" the Germany international told reporters post-match. \"At club level, Cristiano Ronaldo was our problem when he was at Real Madrid.\" Muller may have cheekily taunted Messi in the aftermath of the game but he also heaped praise on the 35-year-old for leading Argentina to World Cup victory in December. \"I have the greatest respect for Messi's World Cup performance,\" the Bayern man added. \"His individual performance was amazing. He carried the whole squad. It's not so easy to play at a team like PSG. It's difficult to get a really good team balance.\" Read more: Ten Hag makes decision on Fernandes United's training squad vs Betis revealed United confirm Sabitzer blow Rashford hits back at 'nonsense' criticism All the latest United news and views","pubDate":"2023-03-09 16:03:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26432016.ece/ALTERNATES/s615/0_GettyImages-1457735279.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Parution d'”Épopée des Lions de l’Atlas”, un ouvrage qui retrace les exploits de l’équipe nationale de football au Mondial-2022","link":"http://www.mapexpress.ma/actualite/sports/parution-depopee-lions-latlas-ouvrage-retrace-les-exploits-lequipe-nationale-football-au-mondial-2022/","keywords":null,"creator":["MAP"],"video_url":null,"description":"\"Épopée des Lions de l’Atlas\" est l’intitulé d’un ouvrage qui vient d’être édité par \"Première Ligne Edition\", en hommage aux joueurs de l’équipe nationale de football qui ont signé une participation historique au Mondial Qatar-2022. Cet article Parution d'”Épopée des Lions de l’Atlas”, un ouvrage qui retrace les exploits de l’équipe nationale de football au Mondial-2022 est apparu en premier sur MAP Express.","content":"Casablanca – “Épopée des Lions de l’Atlas” est l’intitulé d’un ouvrage qui vient d’être édité par “Première Ligne Edition”, en hommage aux joueurs de l’équipe nationale de football qui ont signé une participation historique au Mondial Qatar-2022. “Ce bel ouvrage de 220 pages retrace toutes les étapes de ce mois magique de décembre 2022 et les répercussions nationales et mondiales de ces exploits footballistiques”, indique un communiqué de “Première Ligne Edition”. Dans un devoir de mémoire, l’ouvrage “Épopée des Lions de l’Atlas” retrace ainsi “les exploits historiques du Onze National, mais aussi de tout le peuple marocain”, note la même source. Il s’agit d'”un livre collector pour perpétuer le rêve et continuer à faire rayonner le Maroc dans le monde”, ajoute-t-on. Par ailleurs, relève le communiqué, l’ouvrage est agrémenté de magnifiques photos provenant pour la majorité de l’agence Maghreb Arabe Presse (MAP) qui a suivi les exploits des Lions de l’Atlas et des Marocains dans le monde entier. Quatre grandes thématiques sont abordées par l’ouvrage : “Epopée d’une équipe vaillante”, “Des valeurs extraordinaires”, “La ferveur d’un peuple” et “Le Maroc célébré dans le Monde”. Pour ce qui est d’”Epopée d’une équipe vaillante”, il s’agit du récit d’une épopée qui a marqué l’histoire du football marocain et de joueurs expérimentés et talentueux qui ont montré un nouveau visage du football nationale. S’agissant de la thématique “Des valeurs extraordinaires”, l’ouvrage met en exergue les magnifiques valeurs véhiculées par les Lions de l’Atlas qui ont ému le monde entier et cassé les codes habituels du football, livrant une image spontanée qui trouve ses fondements dans l’Islam et dans la culture et les traditions marocaines. Quant à “La ferveur d’un peuple”, le livre rappelle que les supporters marocains se sont déplacés en nombre au Mondial 2022 pour soutenir l’équipe nationale. Dans le même temps, dans toutes les villes du Maroc, des marées humaines sont sorties spontanément dans les rues pour célébrer les victoires successives des Lions. Enfin, pour la thématique “Le Maroc célébré dans le monde”, l’ouvrage souligne que les exploits des Lions de l’Atlas ont surpris le monde entier. De grandes personnalités dont Elon Musk ainsi que nombre de Chefs d’Etats ont félicité l’équipe Nationale mettant ainsi un coup de projecteur exceptionnel sur le Maroc. La presse internationale a relayé cet engouement. Jamais le hashtag Maroc n’a autant était utilisé. “Dans la lignée des livres édités par Première Ligne Edition, l’ouvrage “Épopée des Lions de l’Atlas” se veut un ouvrage raffiné et moderne afin de sublimer les exploits des Lions de l’Atlas, la ferveur de tout le peuple marocain et notre drapeau rouge frappé d’une étoile verte”, conclut le communiqué.","pubDate":"2023-03-09 15:51:33","image_url":"http://www.mapexpress.ma/wp-content/uploads/2023/03/Nouveau-projet20-204x120.jpg","source_id":"mapexpress","category":["sports"],"country":["morocco"],"language":"french"},{"title":"Corinne Diacre, l’inévitable éviction","link":"https://www.lefigaro.fr/sports/football/corinne-diacre-l-inevitable-eviction-20230309","keywords":["Football"],"creator":null,"video_url":null,"description":"DÉCRYPTAGE - La Fédération française de football a décidé de se séparer de la sélectionneuse des Bleues, critiquée par certaines de ses joueuses.","content":"DÉCRYPTAGE - La Fédération française de football a décidé de se séparer de la sélectionneuse des Bleues, critiquée par certaines de ses joueuses. La chronique d’une éviction attendue, et rendue inévitable par le contexte extrêmement tendu des dix derniers jours. À 12 h 54, ce jeudi, la Fédération française de football (FFF) a publié un communiqué sur son site afin d’officialiser le départ de Corinne Diacre, démise de ses fonctions de sélectionneuse de l’équipe nationale féminine sur les recommandations d’une commission composée de quatre membres (Laura Georges, Aline Reira, Jean-Michel Aulas et Marc Keller). «Les nombreuses auditions menées ont permis d’établir le constat d’une fracture très importante avec des joueuses cadres et mis en lumière un décalage avec les exigences du très haut niveau , explique l’organe dirigeant. Cette fracture a atteint un point de non-retour qui nuit aux intérêts de la sélection. Si la FFF reconnaît l’implication et le sérieux de Corinne Diacre et son staff dans l’exercice de leur mission, il apparaît que les dysfonctionnements constatés semblent, dans ce contexte, irréversibles. Au regard de ces éléments… Cet article est réservé aux abonnés. Il vous reste 77% à découvrir. Vous avez envie de lire la suite ? Débloquez tous les articles immédiatement. Sans engagement. Déjà abonné ? Connectez-vous","pubDate":"2023-03-09 15:46:48","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Manchester United vs Real Betis LIVE Europa League updates, TV channel information and Marcel Sabitzer latest","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-real-betis-live-26423432","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Samuel Luckhurst, Tyrone Marshall, Steven Railston)"],"video_url":null,"description":"Man United play Real Betis in the Europa League on Thursday and we'll bring you updates throughout the match in our live blog.","content":"Manchester United must respond with a strong performance against Real Betis after a disastrous showing at Anfield. United were defeated 7-0 against fierce rivals Liverpool at the weekend and Erik ten Hag branded the performance as 'unprofessional', whilst Luke Shaw, the first to emerge from the dressing room after the game, admitted he was 'embarrassed'. The defeat was the joint-biggest against Liverpool in the club's history, but the players now have the opportunity to bounce back, just four days later, against Spanish side Real Betis in the first leg of a Europa League Round of 16 tie. Real Betis held Real Madrid to a goalless draw on Sunday and they are currently fifth in La Liga. They are managed by former Man City manager Manuel Pellegrini, who said this week he 'does not know what to expect' from United after Anfield. Regarding the early team news, Anthony Martial remains unavailable for selection as he looks to return from a hip injury. Ten Hag has also confirmed that Marcel Sabizter, who was a late substitute at Anfield, will be unavailable for selection. Follow the blog for live updates from Old Trafford. 16:54 Steven Railston How United should line up vs Real Betis United need to deliver a strong performance against Real Betis tonight. Sunday's performance at Anfield was embarrassing and a response is needed. Our writers have had their say on how United should start. Share Comments 16:54 Steven Railston Europa League winner odds United are the favourites to win the competition. Europa League outright winner 2022/23 Man United 5/2 Arsenal 3/1 Juventus 8/1 Union Berlin 12/1 Roma 16/1 Betis 20/1 Odds via Betway . Daley Blind with the Europa League. Share Comments 16:37 Steven Railston Bet £10 get £40 in bonuses with Betfred Share Comments 16:18 Steven Railston What TV channel is United vs Real Betis on? The match will be shown on BT Sport 1 in the UK and will also be available on the BT Sport app and at bt.com/sport for live streaming. Coverage will get underway an hour before kick-off. But as always, we'll bring you live updates in this matchday blog. (Image: Photo Prestige/Soccrates/Getty Images.) Share Comments 15:50 Steven Railston United training squad for Real Betis revealed Marcel Sabitzer was missing from the United training squad ahead of the first leg of their Europa League last-16 tie against Real Betis, but Anthony Martial was present despite his manager ruling him out of the game. Erik ten Hag's side will be looking to bounce back from their 7-0 thrashing by Liverpool with a much-improved performance against their La Liga opponents on Thursday night. United held their open training session on Wednesday afternoon and hinted at fielding another strong side against Betis with the players who are available. Read the full story here. United train ahead of Real Betis (Image: TyMarshall_MEN) Share Comments Steven Railston Welcome Hello and welcome to today's Manchester United live match blog. Share Comments","pubDate":"2023-03-09 15:39:17","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26423439.ece/ALTERNATES/s615/0_Man-Utd-v-Betis-Blog.png","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | WATCH: What happened to Messi after PSG's UCL exit","link":"https://www.snl24.com/KickOff/WorldNews/UEFA-Champions-League/watch-what-happened-to-leo-messi-after-psgs-champions-league-exit-20230309","keywords":null,"creator":null,"video_url":null,"description":"After Paris Saint-Germain's UEFA Champions League fate was confirmed on Wednesday, Lionel Messi's night almost went from bad to worse because of an overzealous fan. See the incident here!","content":"The Parc des Princes side's search for a UCL title continues after their most recent exit at the hands of Bayern Munich. PSG have spent more than £1 billion (R22 billion) on new signings since their Qatari takeover in 2012, and have won eight league titles and 12 domestic cups under the new ownership, but are yet to taste glory in Europe's premier club competition. On Wednesday, Messi cut a frustrated figure once again as it has been eight years since he last won the tournament, with FC Barcelona in 2015, while reports suggest that the Argentine may have played his last game in the showpiece as he continues to be linked with moves to teams outside of Europe once his contract expires in June. However, things could have actually turned out a lot worse for Messi on Wednesday night when, following the final whistle, a fan proceeded to run towards the footballer at full speed. Just before reaching the player, though, he slipped, narrowly avoiding injuring the South American, before a steward fell into the player too. The supporter was quickly apprehended by a host of stewards as Messi looked on in confusion. Had Messi got hurt during the incident, it would have been another sizable blow for PSG manager Christophe Galtier after Neymar was ruled out for the remainder of the season due to injury earlier this week. You must be to read and post comments.","pubDate":"2023-03-09 15:18:01","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Pogba 'punished' by Juventus","link":"https://www.snl24.com/KickOff/WorldNews/Serie-A/pogba-punished-by-juventus-just-weeks-after-returning-to-action-20230309","keywords":null,"creator":null,"video_url":null,"description":"Paul Pogba has now reportedly been punished by Juventus just weeks after his return to the football pitch.","content":"Pogba is believed to be set to miss the team's upcoming matchday squad for disciplinary reasons. The Frenchman recently made his return to the first team set-up after a lengthy injury lay-off, making his second debut for the Serie A giants late in February following his free-agent departure from Manchester United in July last year. Prior to his return, though, it was claimed that Juventus were ready to part ways with the midfielder after becoming frustrated with the Frenchman for a number of reasons. Now, according to Italian journalist Fabrizio Romano, Pogba has been dropped from the Juventus squad for their UEFA Europa League clash against Freiburg on Thursday, having been punished by the club for arriving late for a team dinner. Earlier this season, Pogba was embroiled in a controversial saga with his brother that involved witchcraft. This led to the 29-year-old admitting to having contacted a witchdoctor but denying any assertion that he had a spell casted on his France teammate Kylian Mbappe. The midfielder also came under fire earlier this campaign when he was seen on a skiing trip despite being injured, and received the ire of his club when he delayed surgery on a knee injury in the hopes of playing for France at the 2022 FIFA World Cup. He would miss the tournament altogether, and has since played only 35 minutes of football to date for Juventus this season. You must be to read and post comments.","pubDate":"2023-03-09 15:18:01","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Djibril Cisse hits back at Manchester United great Wayne Rooney","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/cisse-rooney-man-city-qpr-26427742","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"The Manchester United legend recently questioned why QPR opted to give the ball straight back to Manchester City after City had equalised on the final day of the 2011-12 Premier League season.","content":"Former QPR striker Djibril Cisse has hit back at Wayne Rooney's claims that the London club helped Manchester City win the Premier League in 2012 and has suggested that Manchester United should have wrapped the title up much sooner. Cisse's side lost in dramatic circumstances at the Etihad as striker Sergio Aguero scored a late goal to win the game 3-2 and secure the title over their rivals. Speaking in May, Rooney took aim at Paddy Kenny and Cisse for their actions that day in Manchester and asked why that game was never 'questioned'. The United legend told The Sun : \"Paddy Kenny should have done better for a couple of the goals. City get the second goal and QPR kick it straight back to them and that's never been questioned - I find that strange. ALSO READ: Rooney channels Ferguson approach \"Djibril Cisse celebrating after the game with the City players, but yeah listen it's a historic moment in the Premier League so I'm sure that - if you are not involved as a Manchester United player, that's probably one of the greatest moments in the league.\" Responding to these accusations, the former Liverpool striker explained that Rooney's comments regarding QPR's motives were wrong. Cisse told Lord Ping : \"I understand why Wayne Rooney would question City’s comeback against QPR that day. It was strange. \"Though it was up to Manchester United to win the league during the season and if they left it until the last day, that is not our fault. I like Rooney and feel his pain, but it wasn’t up to us. \"They should have secured the win early on. For us, we were winning 1-0 and then we conceded a red card. We then conceded a goal in the last second, but trust me I was in the squad and no-one said: 'Let’s lose the game for Manchester City .' I would have never let that happen. \"I love football too much and I am a professional.\" Kenny also responded to Rooney at the time of his comments but was a lot more cut-throat with his reply. In a tweet, he posted two pictures of himself and Rooney, appearing to suggest he had aged better than Rooney, with the caption: \"36 v 44. Rooney must of let that Aguero goal get to him.\" READ NEXT: Get all the latest United news here Get all the latest City news here Rooney names three qualities that Rashford has rediscovered Aguero names Messi's next club Haaland takes City record off Aguero","pubDate":"2023-03-09 15:14:46","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26428001.ece/ALTERNATES/s615/0_GettyImages-144305273.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How to watch Manchester United vs Real Betis with TV channel, live stream and kick-off time","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-betis-stream-tv-26407505","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"United welcome Manuel Pellegrini and Real Betis to Old Trafford for the first leg of their Europa League round of 16 tie","content":"Manchester United have the perfect opportunity to respond to their embarrassing 7-0 defeat against Liverpool at Anfield when the Europa League returns on Thursday. Former Manchester City manager Manuel Pellegrini brings a fourth different team to Old Trafford for this first leg round of 16 tie and will be looking to pile more misery onto Erik ten Hag 's side. Across spells at City, Villarreal and West Ham United , the veteran coach has won just one of six matches away against United , which was a 3-0 Manchester derby victory in the 2013/14 season. While Pellegrini knows the northwest well, Betis and United have never previously played each other in a competitive fixture, but the two teams did contest a mid-season friendly during the winter break, which the hosts won 1-0 in Seville. Nabil Fekir scored the only goal of that game just after half time but he won't be facing Ten Hag's team in either leg after sustaining an anterior cruciate ligament injury late last month that has ruled the France World Cup winner out for the season. Here's all the details of how you can watch the contest. READ MORE: Ten Hag can revert to best United attack vs Real Betis What time is kick-off? Thursday's match at Old Trafford kicks off at 8:00pm GMT (3pm ET; noon PT). Where can I watch? BT Sport are broadcasting the match across the United Kingdom on their main BT Sport 1 channel. Coverage starts at 7:15pm, with 45 minutes of build-up before kick-off. How can I stream? The match can also be viewed online by logging into the BT Sport website and navigating to the 1HD channel in the 'Watch' tab. Mobile users can also watch on their devices using the BT Sport app and are also able to cast the coverage onto a Chromecast-compatible device too. Team news For United, there are no fresh injury concerns following the match at Anfield but Anthony Martial , Christian Eriksen and Donny van de Beek all remain out. While their opponents will be without Fekir, fellow midfielder Sergio Canales could be fit to feature in the first leg after missing the last two league outings with a thigh injury. READ NEXT: All the latest United news and views United defender has accidentally solved an unlikely headache for Ten Hag United fans name ideal next captain after Bruno Fernandes criticism United made three tactical errors in Liverpool thrashing Two United youngsters clash as Alvaro Fernandez sends Ten Hag message","pubDate":"2023-03-09 16:10:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article25775130.ece/ALTERNATES/s615/0_GettyImages-1437050320.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Europa League rules on VAR, extra time and yellow cards before Manchester United vs Real Betis","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-betis-europa-rules-26411459","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Matthew Abbott)"],"video_url":null,"description":"The Europa League returns to Old Trafford on Thursday as the round of 16 stage starts","content":"Manchester United have reached the last 16 of the Europa League in each of the six occasions that they have competed in UEFA's second-tier competition. Italian giants AC Milan were there most recent opponents at this stage of the 2020/21 edition and were narrowly beaten 2-1 by Ole Gunnar Solskjaer's side on aggregate. United have also previously played Spanish opposition in this round before, back when they were knocked out against Marcelo Bielsa's Athletic Club in 2012. Former Manchester City manager Manuel Pellegrini and Real Betis will hope to take encouragement from that feat when heading to Old Trafford for this week's first leg tie. Much has changed rule-wise over those 11 years, though, and even since Solskjaer's side reached the 2021 final, so the Manchester Evening News have recapped the competition's ever-changing rules before kick-off. READ MORE: Ten Hag can revert to best United attack vs Real Betis Is there VAR? As it has been throughout the group stages and during both legs against Barcelona , video assistant referees will be used during the Europa League round of 16 too. After it was also introduced for the Europa Conference League knockout rounds too, VAR is used across all three UEFA club competitions at least from the the knockout round play-offs onwards. What about away goals and extra time? UEFA announced in late June 2021 that the away goals rule was being abolished across all of their club competitions ahead of the 2021/22 season starting. So, now two teams tied on aggregate at the end of 90 minutes in their second leg play another 30 minutes of extra-time and a penalty shootout if required to decide a winner. Could yellow card accumulation be a worry? It already affected United during the play-offs when Lisandro Martinez and Marcel Sabitzer were both suspended for the first leg against Barcelona, and another key player is a caution away from missing the second leg against Betis. Casemiro was booked in both meetings with Barca and would not be available for the return leg in Seville should he see yellow again at Old Trafford this midweek. READ NEXT: All the latest United news and views United defender has accidentally solved an unlikely headache for Ten Hag United fans name ideal next captain after Bruno Fernandes criticism United made three tactical errors in Liverpool thrashing Two United youngsters clash as Alvaro Fernandez sends Ten Hag message","pubDate":"2023-03-09 16:10:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26412881.ece/ALTERNATES/s615/0_GettyImages-1466781050-2jpgwas.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Manchester United fined by Uefa after Europa League clash vs Barcelona","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/uefa-fine-manchester-united-barcelona-26431022","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Man United ended up progressing 4-3 on aggregate at Old Trafford and next face Real Betis.","content":"European football's governing body UEFA have hit Manchester United with a €6,125 fine following their clash with Barcelona at Camp Nou. The fixture which took place last month saw the Reds and Barca play out an entertaining 2-2 draw. Marcos Alonso gave Xavi's team the lead on 50 minutes but Marcus Rashford equalised for the away side moments later. A Jules Kounde own goal put United in control however an equaliser from former Leeds man Raphinha, 15 minutes from full time, ensured that the game was firmly in the balance. Despite the entertainment on offer on the pitch, an incident in the stands has led to action from UEFA. ALSO READ: United have better options than Kane UEFA's Control, Ethics and Disciplinary body have ruled that the fine should be awarded to United after fans were adjudged to have thrown objects during the match. The penalty for the club totals £5,437. United would go on to progress in the Europa League play offs thanks to a comeback victory at the Theatre of Dreams. Robert Lewandowski had given Barca the lead again from the penalty spot before Fred equalised just after the interval. Antony's well-placed strike in the 73rd minute was enough to win the tie and send Barcelona crashing out of Europe altogether. Erik ten Hag and co's reward for beating the Catalan club is a round of 16 clash with further La Liga opposition in the form of Real Betis. Manuel Pellegrini's side travel to Old Trafford this evening before returning to Spain for the reverse fixture next Thursday, March 16. READ NEXT: Get all the latest United news here United have two months to convince Bellingham and Osimhen How United should line-up vs Real Betis Ten Hag confirms Sabitzer blow Five United players might be fearing Ten Hag team selection","pubDate":"2023-03-09 16:06:45","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26431541.ece/ALTERNATES/s615/0_GettyImages-1247222501.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Lionel Messi dig as Cristiano Ronaldo Champions League admission made by Bayern Munich star","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/cristiano-ronaldo-lionel-messi-al-26432000","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Alex James)"],"video_url":null,"description":"Messi and PSG exited the Champions League following defeat by Bayern Munich","content":"Cristiano Ronaldo may not be featuring in the Champions League these days but his impact in the competition has not been forgotten at the highest level. Bayern Munich star Thomas Muller referenced the former Manchester United man, now playing his club football in Saudi Arabia for Al-Nassr, in the wake of his side knocking Paris St-Germain out of the Champions League on Wednesday night - and Lionel Messi was on the end of the German's cheeky dig. Muller featured for Bayern as they beat Messi and Co 2-0 on Wednesday night to complete a 3-0 aggregate victory which moved the German champions into the last eight. For PSG, the wait for European success will go on for at least another season and Muller was confident of progression despite World Cup winner Messi lining up on the opposite side. Read more: Martial returns to full training \"Against Messi, things always go well at all levels in terms of results,\" the Germany international told reporters post-match. \"At club level, Cristiano Ronaldo was our problem when he was at Real Madrid.\" Muller may have cheekily taunted Messi in the aftermath of the game but he also heaped praise on the 35-year-old for leading Argentina to World Cup victory in December. \"I have the greatest respect for Messi's World Cup performance,\" the Bayern man added. \"His individual performance was amazing. He carried the whole squad. It's not so easy to play at a team like PSG. It's difficult to get a really good team balance.\" Read more: Ten Hag makes decision on Fernandes United's training squad vs Betis revealed United confirm Sabitzer blow Rashford hits back at 'nonsense' criticism All the latest United news and views","pubDate":"2023-03-09 16:03:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26432016.ece/ALTERNATES/s615/0_GettyImages-1457735279.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Parution d'”Épopée des Lions de l’Atlas”, un ouvrage qui retrace les exploits de l’équipe nationale de football au Mondial-2022","link":"http://www.mapexpress.ma/actualite/sports/parution-depopee-lions-latlas-ouvrage-retrace-les-exploits-lequipe-nationale-football-au-mondial-2022/","keywords":null,"creator":["MAP"],"video_url":null,"description":"\"Épopée des Lions de l’Atlas\" est l’intitulé d’un ouvrage qui vient d’être édité par \"Première Ligne Edition\", en hommage aux joueurs de l’équipe nationale de football qui ont signé une participation historique au Mondial Qatar-2022. Cet article Parution d'”Épopée des Lions de l’Atlas”, un ouvrage qui retrace les exploits de l’équipe nationale de football au Mondial-2022 est apparu en premier sur MAP Express.","content":"Casablanca – “Épopée des Lions de l’Atlas” est l’intitulé d’un ouvrage qui vient d’être édité par “Première Ligne Edition”, en hommage aux joueurs de l’équipe nationale de football qui ont signé une participation historique au Mondial Qatar-2022. “Ce bel ouvrage de 220 pages retrace toutes les étapes de ce mois magique de décembre 2022 et les répercussions nationales et mondiales de ces exploits footballistiques”, indique un communiqué de “Première Ligne Edition”. Dans un devoir de mémoire, l’ouvrage “Épopée des Lions de l’Atlas” retrace ainsi “les exploits historiques du Onze National, mais aussi de tout le peuple marocain”, note la même source. Il s’agit d'”un livre collector pour perpétuer le rêve et continuer à faire rayonner le Maroc dans le monde”, ajoute-t-on. Par ailleurs, relève le communiqué, l’ouvrage est agrémenté de magnifiques photos provenant pour la majorité de l’agence Maghreb Arabe Presse (MAP) qui a suivi les exploits des Lions de l’Atlas et des Marocains dans le monde entier. Quatre grandes thématiques sont abordées par l’ouvrage : “Epopée d’une équipe vaillante”, “Des valeurs extraordinaires”, “La ferveur d’un peuple” et “Le Maroc célébré dans le Monde”. Pour ce qui est d’”Epopée d’une équipe vaillante”, il s’agit du récit d’une épopée qui a marqué l’histoire du football marocain et de joueurs expérimentés et talentueux qui ont montré un nouveau visage du football nationale. S’agissant de la thématique “Des valeurs extraordinaires”, l’ouvrage met en exergue les magnifiques valeurs véhiculées par les Lions de l’Atlas qui ont ému le monde entier et cassé les codes habituels du football, livrant une image spontanée qui trouve ses fondements dans l’Islam et dans la culture et les traditions marocaines. Quant à “La ferveur d’un peuple”, le livre rappelle que les supporters marocains se sont déplacés en nombre au Mondial 2022 pour soutenir l’équipe nationale. Dans le même temps, dans toutes les villes du Maroc, des marées humaines sont sorties spontanément dans les rues pour célébrer les victoires successives des Lions. Enfin, pour la thématique “Le Maroc célébré dans le monde”, l’ouvrage souligne que les exploits des Lions de l’Atlas ont surpris le monde entier. De grandes personnalités dont Elon Musk ainsi que nombre de Chefs d’Etats ont félicité l’équipe Nationale mettant ainsi un coup de projecteur exceptionnel sur le Maroc. La presse internationale a relayé cet engouement. Jamais le hashtag Maroc n’a autant était utilisé. “Dans la lignée des livres édités par Première Ligne Edition, l’ouvrage “Épopée des Lions de l’Atlas” se veut un ouvrage raffiné et moderne afin de sublimer les exploits des Lions de l’Atlas, la ferveur de tout le peuple marocain et notre drapeau rouge frappé d’une étoile verte”, conclut le communiqué.","pubDate":"2023-03-09 15:51:33","image_url":"http://www.mapexpress.ma/wp-content/uploads/2023/03/Nouveau-projet20-204x120.jpg","source_id":"mapexpress","category":["sports"],"country":["morocco"],"language":"french"},{"title":"Corinne Diacre, l’inévitable éviction","link":"https://www.lefigaro.fr/sports/football/corinne-diacre-l-inevitable-eviction-20230309","keywords":["Football"],"creator":null,"video_url":null,"description":"DÉCRYPTAGE - La Fédération française de football a décidé de se séparer de la sélectionneuse des Bleues, critiquée par certaines de ses joueuses.","content":"DÉCRYPTAGE - La Fédération française de football a décidé de se séparer de la sélectionneuse des Bleues, critiquée par certaines de ses joueuses. La chronique d’une éviction attendue, et rendue inévitable par le contexte extrêmement tendu des dix derniers jours. À 12 h 54, ce jeudi, la Fédération française de football (FFF) a publié un communiqué sur son site afin d’officialiser le départ de Corinne Diacre, démise de ses fonctions de sélectionneuse de l’équipe nationale féminine sur les recommandations d’une commission composée de quatre membres (Laura Georges, Aline Reira, Jean-Michel Aulas et Marc Keller). «Les nombreuses auditions menées ont permis d’établir le constat d’une fracture très importante avec des joueuses cadres et mis en lumière un décalage avec les exigences du très haut niveau , explique l’organe dirigeant. Cette fracture a atteint un point de non-retour qui nuit aux intérêts de la sélection. Si la FFF reconnaît l’implication et le sérieux de Corinne Diacre et son staff dans l’exercice de leur mission, il apparaît que les dysfonctionnements constatés semblent, dans ce contexte, irréversibles. Au regard de ces éléments… Cet article est réservé aux abonnés. Il vous reste 77% à découvrir. Vous avez envie de lire la suite ? Débloquez tous les articles immédiatement. Sans engagement. Déjà abonné ? Connectez-vous","pubDate":"2023-03-09 15:46:48","image_url":null,"source_id":"lefigaro","category":["sports"],"country":["france"],"language":"french"},{"title":"Manchester United vs Real Betis LIVE Europa League updates, TV channel information and Marcel Sabitzer latest","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-real-betis-live-26423432","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Samuel Luckhurst, Tyrone Marshall, Steven Railston)"],"video_url":null,"description":"Man United play Real Betis in the Europa League on Thursday and we'll bring you updates throughout the match in our live blog.","content":"Manchester United must respond with a strong performance against Real Betis after a disastrous showing at Anfield. United were defeated 7-0 against fierce rivals Liverpool at the weekend and Erik ten Hag branded the performance as 'unprofessional', whilst Luke Shaw, the first to emerge from the dressing room after the game, admitted he was 'embarrassed'. The defeat was the joint-biggest against Liverpool in the club's history, but the players now have the opportunity to bounce back, just four days later, against Spanish side Real Betis in the first leg of a Europa League Round of 16 tie. Real Betis held Real Madrid to a goalless draw on Sunday and they are currently fifth in La Liga. They are managed by former Man City manager Manuel Pellegrini, who said this week he 'does not know what to expect' from United after Anfield. Regarding the early team news, Anthony Martial remains unavailable for selection as he looks to return from a hip injury. Ten Hag has also confirmed that Marcel Sabizter, who was a late substitute at Anfield, will be unavailable for selection. Follow the blog for live updates from Old Trafford. 16:54 Steven Railston How United should line up vs Real Betis United need to deliver a strong performance against Real Betis tonight. Sunday's performance at Anfield was embarrassing and a response is needed. Our writers have had their say on how United should start. Share Comments 16:54 Steven Railston Europa League winner odds United are the favourites to win the competition. Europa League outright winner 2022/23 Man United 5/2 Arsenal 3/1 Juventus 8/1 Union Berlin 12/1 Roma 16/1 Betis 20/1 Odds via Betway . Daley Blind with the Europa League. Share Comments 16:37 Steven Railston Bet £10 get £40 in bonuses with Betfred Share Comments 16:18 Steven Railston What TV channel is United vs Real Betis on? The match will be shown on BT Sport 1 in the UK and will also be available on the BT Sport app and at bt.com/sport for live streaming. Coverage will get underway an hour before kick-off. But as always, we'll bring you live updates in this matchday blog. (Image: Photo Prestige/Soccrates/Getty Images.) Share Comments 15:50 Steven Railston United training squad for Real Betis revealed Marcel Sabitzer was missing from the United training squad ahead of the first leg of their Europa League last-16 tie against Real Betis, but Anthony Martial was present despite his manager ruling him out of the game. Erik ten Hag's side will be looking to bounce back from their 7-0 thrashing by Liverpool with a much-improved performance against their La Liga opponents on Thursday night. United held their open training session on Wednesday afternoon and hinted at fielding another strong side against Betis with the players who are available. Read the full story here. United train ahead of Real Betis (Image: TyMarshall_MEN) Share Comments Steven Railston Welcome Hello and welcome to today's Manchester United live match blog. Share Comments","pubDate":"2023-03-09 15:39:17","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article26423439.ece/ALTERNATES/s615/0_Man-Utd-v-Betis-Blog.png","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Snl24.com | WATCH: What happened to Messi after PSG's UCL exit","link":"https://www.snl24.com/KickOff/WorldNews/UEFA-Champions-League/watch-what-happened-to-leo-messi-after-psgs-champions-league-exit-20230309","keywords":null,"creator":null,"video_url":null,"description":"After Paris Saint-Germain's UEFA Champions League fate was confirmed on Wednesday, Lionel Messi's night almost went from bad to worse because of an overzealous fan. See the incident here!","content":"The Parc des Princes side's search for a UCL title continues after their most recent exit at the hands of Bayern Munich. PSG have spent more than £1 billion (R22 billion) on new signings since their Qatari takeover in 2012, and have won eight league titles and 12 domestic cups under the new ownership, but are yet to taste glory in Europe's premier club competition. On Wednesday, Messi cut a frustrated figure once again as it has been eight years since he last won the tournament, with FC Barcelona in 2015, while reports suggest that the Argentine may have played his last game in the showpiece as he continues to be linked with moves to teams outside of Europe once his contract expires in June. However, things could have actually turned out a lot worse for Messi on Wednesday night when, following the final whistle, a fan proceeded to run towards the footballer at full speed. Just before reaching the player, though, he slipped, narrowly avoiding injuring the South American, before a steward fell into the player too. The supporter was quickly apprehended by a host of stewards as Messi looked on in confusion. Had Messi got hurt during the incident, it would have been another sizable blow for PSG manager Christophe Galtier after Neymar was ruled out for the remainder of the season due to injury earlier this week. You must be to read and post comments.","pubDate":"2023-03-09 15:18:01","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Pogba 'punished' by Juventus","link":"https://www.snl24.com/KickOff/WorldNews/Serie-A/pogba-punished-by-juventus-just-weeks-after-returning-to-action-20230309","keywords":null,"creator":null,"video_url":null,"description":"Paul Pogba has now reportedly been punished by Juventus just weeks after his return to the football pitch.","content":"Pogba is believed to be set to miss the team's upcoming matchday squad for disciplinary reasons. The Frenchman recently made his return to the first team set-up after a lengthy injury lay-off, making his second debut for the Serie A giants late in February following his free-agent departure from Manchester United in July last year. Prior to his return, though, it was claimed that Juventus were ready to part ways with the midfielder after becoming frustrated with the Frenchman for a number of reasons. Now, according to Italian journalist Fabrizio Romano, Pogba has been dropped from the Juventus squad for their UEFA Europa League clash against Freiburg on Thursday, having been punished by the club for arriving late for a team dinner. Earlier this season, Pogba was embroiled in a controversial saga with his brother that involved witchcraft. This led to the 29-year-old admitting to having contacted a witchdoctor but denying any assertion that he had a spell casted on his France teammate Kylian Mbappe. The midfielder also came under fire earlier this campaign when he was seen on a skiing trip despite being injured, and received the ire of his club when he delayed surgery on a knee injury in the hopes of playing for France at the 2022 FIFA World Cup. He would miss the tournament altogether, and has since played only 35 minutes of football to date for Juventus this season. You must be to read and post comments.","pubDate":"2023-03-09 15:18:01","image_url":"https://scripts.24.co.za/img/sites/kickoff24.png","source_id":"snl24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Djibril Cisse hits back at Manchester United great Wayne Rooney","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/cisse-rooney-man-city-qpr-26427742","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"The Manchester United legend recently questioned why QPR opted to give the ball straight back to Manchester City after City had equalised on the final day of the 2011-12 Premier League season.","content":"Former QPR striker Djibril Cisse has hit back at Wayne Rooney's claims that the London club helped Manchester City win the Premier League in 2012 and has suggested that Manchester United should have wrapped the title up much sooner. Cisse's side lost in dramatic circumstances at the Etihad as striker Sergio Aguero scored a late goal to win the game 3-2 and secure the title over their rivals. Speaking in May, Rooney took aim at Paddy Kenny and Cisse for their actions that day in Manchester and asked why that game was never 'questioned'. The United legend told The Sun : \"Paddy Kenny should have done better for a couple of the goals. City get the second goal and QPR kick it straight back to them and that's never been questioned - I find that strange. ALSO READ: Rooney channels Ferguson approach \"Djibril Cisse celebrating after the game with the City players, but yeah listen it's a historic moment in the Premier League so I'm sure that - if you are not involved as a Manchester United player, that's probably one of the greatest moments in the league.\" Responding to these accusations, the former Liverpool striker explained that Rooney's comments regarding QPR's motives were wrong. Cisse told Lord Ping : \"I understand why Wayne Rooney would question City’s comeback against QPR that day. It was strange. \"Though it was up to Manchester United to win the league during the season and if they left it until the last day, that is not our fault. I like Rooney and feel his pain, but it wasn’t up to us. \"They should have secured the win early on. For us, we were winning 1-0 and then we conceded a red card. We then conceded a goal in the last second, but trust me I was in the squad and no-one said: 'Let’s lose the game for Manchester City .' I would have never let that happen. \"I love football too much and I am a professional.\" Kenny also responded to Rooney at the time of his comments but was a lot more cut-throat with his reply. In a tweet, he posted two pictures of himself and Rooney, appearing to suggest he had aged better than Rooney, with the caption: \"36 v 44. Rooney must of let that Aguero goal get to him.\" READ NEXT: Get all the latest United news here Get all the latest City news here Rooney names three qualities that Rashford has rediscovered Aguero names Messi's next club Haaland takes City record off Aguero","pubDate":"2023-03-09 15:14:46","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26428001.ece/ALTERNATES/s615/0_GettyImages-144305273.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"}]}