{"newsArray":[{"title":"NFL da a conocer las opciones para que se juegue el Bills-Bengals","link":"https://juanfutbol.com/otros/los-escenarios-para-que-se-reanude-el-juego-de-nfl-entre-bills-y-bengals-20230105-JFB-30460.html","keywords":["Otros"],"creator":["Joel Agoitia"],"video_url":null,"description":"Bien sabemos que la salud de Damar Hamlin es la prioridad, pero la NFL analiza los escenarios para que se reanude el juego pendiente Tras lo sucedido con Damar Hamlin en el Monday Night Football del 2 de enero, se tomó la decisión de posponer el juego hasta nuevo aviso. Ahora con un poco más de calma, la NFL analiza las diferentes opciones que se pueden dar para que este partido se reanude. En conferencia de prensa; Troy Vincent, Vicepresidente Ejecutivo de Operaciones de Football de la liga, reconoció que el juego se reanudará, pero hubiera sido más fácil si se hubiera jugado en domingo para moverlo a miércoles. Teams around the league honored Damar Hamlin at their stadiums. ❤️💙 pic.twitter.com/WyMLTqLjJY— NFL (@NFL) January 4, 2023 TAMBIÉN TE PUEDE INTERESAR: Periodista mexa pide que el futbol americano deje de existir El primer escenario, que va ganando, es quitar la semana de descanso que hay entre los partidos de Campeonato de Conferencia y el Super Bowl para que terminando la semana 18, se juegue el encuentro. La otra opción es esperar los resultados de la última semana de temporada regular para ver qué sucede con el juego. En una de esas el New England Patriots @ Buffalo Bills se aplaze. El antecedente en la NFL No es la primera vez que sucede algo similar con un partido de la National Football League. Para esto tenemos que irnos 22 años atrás, cuando el inicio de la temporada regular se tuvo que restrasar una semana por los atentados del 9/11.","content":null,"pubDate":"2023-01-05 04:13:20","image_url":null,"source_id":"juanfutbol","country":["mexico"],"category":["sports"],"language":"spanish"},{"title":"Football : Mabroc sur la mauvaise voie en D1","link":"https://www.ladepeche.fr/2023/01/05/football-mabroc-sur-la-mauvaise-voie-en-d1-10905362.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Difficile, c’est le mot pour décrire la première partie de saison du FC Mabroc en Départemental 1. Les rouges et blancs n’arrivent plus à retrouver leur réussite d’antan.Bilan : une fin d’année décevanteDu moins, le...","content":null,"pubDate":"2023-01-05 04:11:32","image_url":"https://images.ladepeche.fr/api/v1/images/view/63b64f2638e3c945f3788f4d/standard/image.jpg?v=1","source_id":"ladepeche","country":["france"],"category":["sports"],"language":"french"},{"title":"Salies-du-Salat. Robert Keuleyan : le football comme une famille","link":"https://www.ladepeche.fr/2023/01/05/robert-keuleyan-le-football-comme-une-famille-10905361.php","keywords":["Football"],"creator":null,"video_url":null,"description":"\"J’aurai pu dire à l’entraîneur, à l’enseignant, à l’éducateur, mais, Robert Keuleyan était les trois à la fois et tellement plus\" décrit Michel Lafforgue qui souhaite par ces mots rendre hommage à Robert Keuleyan....","content":null,"pubDate":"2023-01-05 04:11:31","image_url":"https://images.ladepeche.fr/api/v1/images/view/63b64f25bd8761187e289e96/standard/image.jpg?v=1","source_id":"ladepeche","country":["france"],"category":["sports"],"language":"french"},{"title":"L’Isle-Jourdain. Football : le FCL prêt à en découdre en 2023","link":"https://www.ladepeche.fr/2023/01/05/lisle-jourdain-football-le-fcl-pret-a-en-decoudre-en-2023-10905345.php","keywords":["Football - Amateurs"],"creator":null,"video_url":null,"description":"L’année 2022 s’est achevée avec une belle reconnaissance pour le FCL, plus précisément pour son école de foot, avec l’obtention de deux labels attribués par le District de football du Gers. Sur le plan sportif et...","content":null,"pubDate":"2023-01-05 04:11:23","image_url":"https://images.ladepeche.fr/api/v1/images/view/63b64f1c354f28065e69eea8/standard/image.jpg?v=1","source_id":"ladepeche","country":["france"],"category":["sports"],"language":"french"},{"title":"IMC presents take-off grant to NPFL clubs today","link":"https://guardian.ng/sport/imc-presents-take-off-grant-to-npfl-clubs-today/","keywords":["Football","Sport","Interim Management Committee (IMC)","NPFL"],"creator":["Guardian Nigeria"],"video_url":null,"description":"The formal public presentation of takeoff grants to the 20 participating Nigeria Professional Football League (NPFL) clubs in the 2022/23 season, will hold today at the Sandralia Hotel, Abuja. The ceremony is holding ahead of the new season, which starts on January 8, with Match day one in Groups A and B of the Abridged […] The post IMC presents take-off grant to NPFL clubs today appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"The formal public presentation of takeoff grants to the 20 participating Nigeria Professional Football League (NPFL) clubs in the 2022/23 season, will hold today at the Sandralia Hotel, Abuja. The ceremony is holding ahead of the new season, which starts on January 8, with Match day one in Groups A and B of the Abridged League format. The Interim Management Committee (IMC) arrived at the date to ensure that the league ends in May to align with the international calendar. Expected at the event are the President of the Nigeria Football Federation (NFF), Ibrahim Gusau, the leadership of the Nigeria Referees Association (NRA) and other stakeholders. According to the IMC Chairman, Gbenga Elegbeleye, the occasion will afford the Gusau-led NFF opportunity to address stakeholders on the support the football house will bring to upgrade the country’s league to international standards. “The presentation ceremony will have in attendance, the NFF President, Ibrahim Gusau, who wants to address all stakeholders ahead of the start of the season to assure them that the football house will support every move to upgrade our league in terms of transparency, level playing ground and improved performance.’’ “It is also a platform for the IMC to make a public presentation of the takeoff grant to our participating clubs to put them on a good pedestal to start the season,” Elegbeleye stated. The Akwa United versus Bendel Insurance fixture in Uyo will be the flagship centre for the commencement of the NPFL. Follow Us","pubDate":"2023-01-05 04:10:24","image_url":null,"source_id":"guardian","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Shorunmu moves to ‘fix’ Eagles’ goalkeeping problem","link":"https://guardian.ng/sport/shorunmu-moves-to-fix-eagles-goalkeeping-problem/","keywords":["Football","Sport","Shorunmu","Super Eagles"],"creator":["Guardian Nigeria"],"video_url":null,"description":"• To recruit new ones from NPFL matches Super Eagles goalkeepers’ trainer, Ike Shorunmu, is set to tour various stadia, where the Nigeria Professional Football League (NPFL) matches will hold to pick eligible goal stoppers to fight for shirt in the national team. Shorunmu told The Guardian that his desire is to ensure that more […] The post Shorunmu moves to ‘fix’ Eagles’ goalkeeping problem appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"• To recruit new ones from NPFL matches Super Eagles goalkeepers’ trainer, Ike Shorunmu, is set to tour various stadia, where the Nigeria Professional Football League (NPFL) matches will hold to pick eligible goal stoppers to fight for shirt in the national team. Shorunmu told The Guardian that his desire is to ensure that more goalkeepers in the domestic league get opportunity to compete alongside their foreign counterparts for the No.1 shirt in the Super Eagles. “The transformation process of the Super Eagles continues, and as the goalkeepers trainer, I have a huge role to play,” he stated. Shorunmu assured that the goalkeeping department would take a better shape. He, however, urged football-loving Nigerians to stop castigating the Super Eagles based on their past mistakes. “The team needs the support and encouragement of every Nigerian to excel. When the league starts on January 8, I will begin the search for more domestic goalkeepers from the NPFL to be invited to the Super Eagles. I don’t understand why some people keep saying that domestic goalkeepers are not respected in the national team. “The league has not started, and you don’t expect a coach to invite a goalkeeper from the NPFL, who has not been active to the national team. It doesn’t work that way. Nigeria league has quality goalkeepers, and my mission is to select the best and give them equal opportunity to fight for shirt with their foreign counterparts.” Shorunmu continues: “I am happy the NPFL league will kick off soon. This will afford me the opportunity to go round the centres and see the performance of keepers in various clubs to be penciled down for a place in the national team.” The Interim Management Committee (IMC) of the Nigeria Professional Football League (NPFL), had fixed January 8 as commencement date of the 2022/23 season. The league will be in abridged format of two groups of 10 clubs in Group A and Group B. Follow Us","pubDate":"2023-01-05 04:10:04","image_url":null,"source_id":"guardian","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Ronaldo urged to highlight human rights issues in Saudi Arabia","link":"https://www.capitalfm.co.ke/sports/2023/01/05/ronaldo-urged-to-highlight-human-rights-issues-in-saudi-arabia/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"RIYADH, Saudi Arabia, Jan 4 – Cristiano Ronaldo has been urged to speak out about human rights issues in Saudi Arabia after completing his big-money move to Al Nassr. The Portugal superstar, who was greeted by fireworks and deafening roars at Al Nassr’s Mrsool Park stadium on Tuesday, said he wanted to “be part of […] The post Ronaldo urged to highlight human rights issues in Saudi Arabia appeared first on Capital Sports.","content":"The Portugal superstar, who was greeted by fireworks and deafening roars at Al Nassr’s Mrsool Park stadium on Tuesday, said he wanted to “be part of the success of the country and the culture of the country”. The 37-year-old left Manchester United in November after an explosive interview in which he criticised the club and manager Erik ten Hag. Amnesty International said Ronaldo’s signing is part of a “wider pattern of sportswashing” in Saudi Arabia. The arrival of the former Real Madrid forward comes against the backdrop of a Saudi push into sports including golf, boxing, tennis and F1 as well as football, following the takeover of English Premier League club Newcastle United in 2021. The Gulf nation is also mulling a joint bid to co-host the 2030 World Cup. “Instead of offering uncritical praise of Saudi Arabia, Ronaldo should use his considerable public platform to draw attention to human rights issues in the country,” said Dana Ahmed, Amnesty’s Middle East researcher. “Saudi Arabia regularly executes people for crimes including murder, rape and drug smuggling. On a single day last year, 81 people were put to death, many of whom were tried in grossly unfair trials. “The authorities are also continuing their crackdown on freedom of expression and association, with heavy prison sentences handed down to human rights defenders, women’s rights activists and other political activists. “Cristiano Ronaldo should not allow his fame and celebrity status to become a tool of Saudi’s sportswashing. He should use his time at Al Nassr to speak out about the myriad of human rights issues in the country.”","pubDate":"2023-01-05 03:39:14","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Pro Football Hall of Fame Class of 2023: Darrelle Revis, Joe Thomas, Dwight Freeney among finalists","link":"https://profootballtalk.nbcsports.com/2023/01/04/pro-football-hall-of-fame-class-of-2023-darrelle-revis-joe-thomas-dwight-freeney-are-first-ballot-finalists/","keywords":["Arizona Cardinals","Atlanta Falcons","Baltimore Ravens","Buffalo Bills","Carolina Panthers","Chicago Bears","Cincinnati Bengals","Cleveland Browns","Dallas Cowboys","Denver Broncos","Detroit Lions","Green Bay Packers","Houston Texans","Indianapolis Colts","Jacksonville Jaguars","Kansas City Chiefs","Las Vegas Raiders","Los Angeles Chargers","Los Angeles Rams","Miami Dolphins","Minnesota Vikings","New England Patriots","New Orleans Saints","New York Giants","New York Jets","Philadelphia Eagles","Pittsburgh Steelers","Rumor Mill","San Francisco 49ers","Seattle Seahawks","Tampa Bay Buccaneers","Tennessee Titans","Top Stories","Washington"],"creator":["Charean Williams"],"video_url":null,"description":"The Pro Football Hall of Fame announced the 15 finalists for the Class of 2023 on Wednesday night, and three first-year-eligible players are on the list. Cornerback Darrelle Revis, offensive tackle Joe Thomas and edge rusher Dwight Freeney made the cut five years after their careers ended. In addition, safety Darren Woodson and cornerback Albert [more]","content":null,"pubDate":"2023-01-05 01:54:12","image_url":"https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2023/01/GettyImages-130595405-e1672880725602.jpg?w=516&h=279&crop=1","source_id":"profootballtalk","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Troy Vincent reiterates his comments on resumption of Bills-Bengals game","link":"https://profootballtalk.nbcsports.com/2023/01/04/troy-vincent-reiterates-his-comments-on-resumption-of-bills-bengals-game/","keywords":["Buffalo Bills","Cincinnati Bengals","Home","Rumor Mill"],"creator":["Mike Florio"],"video_url":null,"description":"Early Tuesday morning, NFL executive V.P. of football operations Troy Vincent drew a line in the sand as to the notion that anyone from the league expressed an intention to resume Monday night’s Bills-Bengals game, after the serious health situation that occurred regarding Bills safety Damar Hamlin. On Wednesday afternoon, Vincent dug that line even [more]","content":null,"pubDate":"2023-01-05 00:46:20","image_url":"https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2023/01/GettyImages-675700660-e1672879201286.jpg?w=1000&h=563&crop=1","source_id":"profootballtalk","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"President Biden speaks with Damar Hamlin’s parents","link":"https://profootballtalk.nbcsports.com/2023/01/04/president-biden-speaks-with-damar-hamlins-parents/","keywords":["Buffalo Bills","Rumor Mill","Top Stories"],"creator":["Mike Florio"],"video_url":null,"description":"Many are paying close attention to the status of Bills safety Damar Hamlin. Those interested include President Joe Biden. Via Brett Samuels of TheHill.com, the President told reporters that he spoke “at length” on Wednesday with Damar’s parents. The President separately was asked about the dangers of football. “I think working like hell on the [more]","content":null,"pubDate":"2023-01-05 00:04:36","image_url":"https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2023/01/GettyImages-1245997722-e1672876990161.jpg?w=885&h=499&crop=1","source_id":"profootballtalk","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Football: Napoli's 11-match winning streak ended by Inter","link":"https://www.straitstimes.com/sport/football/football-napolis-11-match-winning-streak-ended-by-inter","keywords":null,"creator":null,"video_url":null,"description":"January 05, 2023 7:58 AMStriker Edin Dzeko broke the deadlock in the 56th minute when he headed in a cross from Federico DiMarco.","content":"MILAN – Napoli’s 11-match winning streak in Serie A ended on Wednesday when Edin Dzeko’s second-half goal secured Inter Milan a 1-0 victory. While Napoli, who came into the game unbeaten in the league this season, dominated possession in the goalless first half, Inter striker Dzeko broke the deadlock in the 56th minute when he headed in a cross from Federico DiMarco. “Being the first to beat Napoli, who were the only side in Europe’s top leagues without defeat this season, is a big confidence booster. I am very proud of my team because they helped each other out on the field, they were a pleasure to watch and we put in a great performance for the fans,” Inter manager Simone Inzaghi said to DAZN. Napoli top the table with 41 points after 16 games. They lead second-placed AC Milan by five points, while fourth-placed Inter are on 33 points. “We can do more in terms of quality, some of our players were a little below par today,” Napoli coach Luciano Spalletti said. “You are meant to move the ball side to side to pull the opposition out of shape, but that doesn’t work when you do it slowly and without the usual quality.” Inter went close after four minutes when Romelu Lukaku crossed into the box, but the angle was too narrow for DiMarco, who sent his effort wide. Lukaku then shot over after 41 minutes after being played in by a backheel from Nicolo Barella. Barella fed DiMarco in the box a minute later, but Napoli keeper Alex Meret saved his effort before the offside flag was raised. The visitors started to build momentum after Dzeko’s goal but struggled to create opportunities. “Games have different moments, towards the end of the first half, we went deeper and allowed Napoli more possession, but we could’ve scored three goals in the first half,” Inzaghi said. Napoli had their best chance on the 90-minute mark when Giacomo Raspadori managed to get a shot on goal from inside the box, but keeper Andre Onana made a reflex save. REUTERS","pubDate":"2023-01-04 23:58:40","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"NFL chiefs urged to postpone all Sunday games after Damar Hamlin cardiac arrest horror","link":"https://www.irishmirror.ie/sport/other-sport/nfl-damar-hamlin-bills-patriots-28878081","keywords":["Sport"],"creator":["news@irishmirror.ie (Daniel Blackham)"],"video_url":null,"description":"The NFL regular season ends this weekend, but there have been calls for the final round of games to be suspended in light of Damar Hamlin suffering a cardiac arrest during Monday Night Football","content":null,"pubDate":"2023-01-04 23:14:04","image_url":"https://i2-prod.mirror.co.uk/incoming/article28878058.ece/ALTERNATES/s98/0_GettyImages-1453883434-2.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"John Souttar on verge of Rangers return, says Michael Beale -he looks strong and doesn’t have a point to prove to me","link":"https://www.thescottishsun.co.uk/sport/football/10013685/john-souttar-rangers-return-michael-beale/","keywords":["Football","Scottish Premiership","Sport"],"creator":["Stewart Fisher"],"video_url":null,"description":null,"content":"MICHAEL BEALE has backed injury-hit John Souttar to kick-start his Rangers and Scotland career. The Rangers defender has been out for five months and underwent ankle surgery in October. PAMichael Beale can’t wait to work with John Souttar[/caption] Willie VassSouttar hasn’t kicked a ball since the opening day of the season[/caption] Souttar joined Gers from Hearts in the summer but hasn’t been seen since being subbed on his debut against Livingston in July. But Beale has revealed he’s now on the verge of a return — and tipped him to become a key player. He said: “John has had a really rough few seasons with injury. “He has played at a high level but hasn’t had a strong and consistent run. “We feel his rehab coming back has been strong and he has really solid foundations now. “He’s a good player who can step into midfield with the ball and who I had watched in my previous time here, so I was delighted to inherit him. “I would just like to work with him now. “From what I believe, his rehab’s been fantastic and he looks strong. “If anything we’re trying to hold John back because he is pushing. “I thought he’d come to Rangers and kick on to the national team but injury has held him back. “That’s one for the future, but if John can play consistently he’ll be a good player for Rangers, and then onwards and upwards for Scotland. “I like players who are fit and hungry and available all the time, that’s probably the message to all players, don’t be injured too long! “But John doesn’t have a point to prove to me. I really rate him. “He will obviously want to prove it to the fans and his team-mates that he belongs and can have a successful career here. “He’s similar to Tom Lawrence who had a strong start, but then missed an awful lot of football. “Hopefully in January or February we can have both back in the team.” Beale also hailed Souttar’s mentality dealing with his time out.He added: “Like most who are injured, they are disappointed. They are living the dream, then when they can’t do it they wear that around their head. “I’m sure their families see a change in them. “Inside the building, John has been fantastic, very supportive of the team and his team-mates. “So has Filip Helander. But it is hard for them. “They see their mates going on to train and they are stuck inside. I can see in John’s eyes he can’t wait to get out there. “It’s an interesting time, a new manager comes with new ideas and you want to showcase what you have.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-01-04 23:10:02","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Utah football: Micah Bernard reportedly entering transfer portal","link":"https://www.deseret.com/2023/1/4/23539642/utah-running-back-micah-bernard-reportedly-entering-transfer-portal","keywords":null,"creator":["Brandon Judd"],"video_url":null,"description":null,"content":"Utah Utes running back Micah Bernard (2) fights to regain his balance as Utah and Penn State play in the Rose Bowl in Pasadena, California, on Monday, Jan. 2, 2023. Bernard is reportedly entering the transfer portal.Scott G Winterton, Deseret News Utah running back Micah Bernard is reportedly entering the NCAA transfer portal, according to multiple reports Wednesday afternoon.The Athletic’s Max Olson, who first reported the news, said Bernard will enter the portal as a graduate transfer.Bernard finished second on the team in 2022 with 533 rushing yards and had four rushing touchdowns. He added 34 catches for 314 yards and another score.Bernard, who also played cornerback for the Utes last year in the Rose Bowl when injuries limited Utah at the position, rushed for 1,136 yards and six touchdowns in four years in Utah’s program. Related Utah football signs 20 to first top-25 class in program history He caught 64 passes for 590 yards and three touchdowns at Utah.It’s the second expected departure for the Utes’ running backs group, after leading rusher Tavion Thomas declared for the NFL draft.That doesn’t leave the cupboard bare for Utah at the position, though. Ja’Quinden Jackson, a former quarterback, ran for 531 yards and nine touchdowns for the Utes this season, and true freshman Jaylon Glover added 360 rushing yards and four touchdowns.Utah’s 2023 recruiting class also includes a trio of running back signees in John Randle Jr., Dijon Stanley and Mike Mitchell. Randle Jr. and Stanley are both rated four-star prospects in 247 Sports’ composite rankings.","pubDate":"2023-01-04 22:46:43","image_url":null,"source_id":"deseret","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Football : victime de cris racistes face à la Lazio, Samuel Umtiti fond en larmes","link":"https://www.ladepeche.fr/2023/01/04/football-victime-de-cris-racistes-face-a-la-lazio-samuel-umtiti-fond-en-larmes-10904887.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Samuel Umtiti (Lecce) a subi des cris racistes ce mercredi 4 janvier de la part des supporters de la Lazio Rome. Le champion du monde 2018 a n'a pu contenir ses larmes à la fin du match.","content":null,"pubDate":"2023-01-04 22:38:22","image_url":"https://images.ladepeche.fr/api/v1/images/view/63b5ff92f9fefd3880718209/standard/image.jpg?v=1","source_id":"ladepeche","country":["france"],"category":["sports"],"language":"french"},{"title":"Stash of ‘potentially dangerous’ items found by police inside Rangers’ Ibrox stadium before Old Firm clash vs Celtic","link":"https://www.thescottishsun.co.uk/sport/football/10013460/stash-dangerous-items-police-rangers-ibrox-celtic/","keywords":["Football","Scottish Premiership","Sport","Crime","Police"],"creator":["Graham Mann"],"video_url":null,"description":null,"content":"A STASH of “potentially dangerous” items was discovered inside Ibrox Stadium hours before Monday’s Old Firm clash. Cops at the powderkeg fixture found the haul, including a baseball bat, in a bin. Getty700 Celtic fans took their place for the clash[/caption] It came to light after members of ultras fan group the Union Bears were given early access to Rangers’ ground to place banners ahead of the 12.30pm kick-off. They were thrown out by police and club staff after a “cursory search” revealed the items. A source told The Scottish Sun: “There were about a dozen items including a baseball bat. “Who knows why they were there or who put them there but it’s obviously very disturbing. “Cops and club staff deserve credit for making the find and acting so swiftly.” Two men — part of the group allowed in early — were later charged with minor drug offences. Superintendent Emma Croft said last night: “Police engaged with a group of supporters given access to Ibrox in advance of the Rangers v Celtic fixture. “During a cursory search, a number of potentially dangerous items were found secreted in the stadium. “Two men have been reported to the fiscal for minor drug offences. Inquiries are ongoing.” We can also reveal Ibrox staff and locals called cops over clashes in the area on Saturday — with reports of “males with weapons” involved in violence two days BEFORE the first derby of 2023, which ended in a 2-2 draw. Supt Croft added: “Shortly before 4pm on Saturday, police received a number of calls reporting disturbances and males with weapons near Ibrox. “Police attended and there was no trace of any disturbance on arrival.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-01-04 22:30:39","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Football: Forest sink Southampton 1-0 away to move out of the drop zone","link":"https://www.straitstimes.com/sport/football/football-forest-sink-southampton-1-0-away-to-move-out-of-the-drop-zone","keywords":null,"creator":null,"video_url":null,"description":"January 05, 2023 6:29 AMSouthampton remain rooted to the bottom of the table.","content":null,"pubDate":"2023-01-04 22:29:50","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Giorgos Giakoumakis a transfer target for FC Midtjylland as Celtic linked with Said Hamulic and Ardon Jashari","link":"https://www.thescottishsun.co.uk/sport/football/10013558/giorgos-giakoumakis-midtjylland-celtic-said-hamulic-ardon-jashari/","keywords":["Football","Scottish Premiership","Sport"],"creator":["Ryan Rowe"],"video_url":null,"description":null,"content":"CELTIC could cash in on want-away striker Giorgos Giakoumakis to Danish club FC Midtjylland. The £6million rated Greek hitman has become disillusioned under Ange Postecoglou due to his lack of top team starts. Kenny RamsayCeltic striker Giorgos Giakoumakis has found starts hard to come by of late[/caption] GettyArdon Jashari in action for FC Luzern – he’s been linked with Celtic[/caption] And it’s understood Midtjylland have joined a queue of clubs interested in snapping him up during this transfer window. Giakoumakis netted eight goals this season but hasn’t started a game since the winter break as he struggles to dislodge Kyogo Furuhashi from the starting line-up. The 28-year-old has rejected the offer of a new deal at Parkhead as he looks to move on. Celts will more than recoup the £2million they paid VVV-Venlo to sign Giakoumakis last summer – even though there’s a sell-on clause as part of that deal. The Danes – who knocked Celts out of the Champions League qualifiers last season – are looking for a replacement for star man Evander after the Brazilian joined Portland Timbers last month. Meanwhile, Switzerland World Cup starlet Ardon Jashari admits he’s heard the speculation linking him to Celtic. But he insists he is getting on with training with his club Luzern – until he’s told otherwise. The Hoops have been linked with a £6million move for the 20 year old. Europa League winners Eintracht Frankfurt and Bundesliga high-fliers RB Leipzig are also credited with an interest. However, Jashari – who was a surprise inclusion in Switzerland’s squad for Qatar – insists he is only concentrating on returning to league football with his club, where he was made captain as a teenager. He said: “Of course, I have read all the stories about my transfers to other clubs and I am aware of all the speculation. “But I am happy that I am back in training with the club. “For me, my focus right now is only with Luzern so that I can prepare well for the resumption of the league system. Everything else is out of my control. “With regards to any possible transfer, the timing and financial aspect of any deal would have to be right for both me and the club.” Reports in Poland also suggest Celts are leading the chase to sign Bosnian striker Said Hamulic. Hamulic has been the unexpected star of the season in the Polish league so far after netting nine goals and helping with four assists in 17 games for unfancied club Stal Mielec. The Dutch-born 22-year-old was snapped up in the summer from Lithuanian outfit Dainava and has helped his club into the European places in the Ekstraklasa. Celtic were linked with a move for Hamulic, who has made it clear he wants to play for Bosnia in the future and the club want a relatively cut-price fee of £2.2 million to land him. And Stal Mielec president Jacek Klimek accepts they are set to lose their strike sensation this month. He said: “Our top scorer and best player, Said Hamulic, will probably leave us this winter. “His transfer has not yet been agreed upon, but it will be difficult to keep him. He is already thinking about his next move. “We negotiate every day with clubs and just this week, we rejected an offer from a French club. “We have a set price for him of around 2.5million Euros [£2.2m] and the offers we have received are not far away from that. “Remember, we have to pay the club in Lithuania that we bought him from a sell-on fee of around 30 per cent, so our profits won’t be that big when we do sell him.” GettyReports in Poland suggest Said Hamulic of Stal Mielec is a Celtic target[/caption] Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-01-04 22:26:50","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Football: Ings equaliser gives Villa share of spoils against Wolves","link":"https://www.straitstimes.com/sport/football/football-ings-equaliser-gives-villa-share-of-spoils-against-wolves","keywords":null,"creator":null,"video_url":null,"description":"January 05, 2023 6:24 AMIngs nets 12 minutes from time to level after Daniel Podence’s skilful goal hands Wolves an early lead.","content":"BIRMINGHAM, England - Aston Villa substitute Danny Ings grabbed a late equaliser to secure a 1-1 home draw with Midlands rivals Wolverhampton Wanderers after trailing for much of Wednesday’s Premier League tussle. Ings netted 12 minutes from time to level after Daniel Podence’s skilful goal handed Wolves an early lead and hope of moving out of the relegation zone. But they stayed second from bottom after the draw at Villa Park while their hosts moved up one place to 11th position. Podence showed some tricky footwork before firing home a left-footed effort in the 12th minute as Wolves made a bright start in their third league game under new manager Julen Lopetegui. They served early notice of their potential when centre back Nathan Collins had his header cleared off the line by Ezri Konsa in the sixth minute. REUTERS","pubDate":"2023-01-04 22:24:10","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Football: West Ham stop the rot with draw at Leeds","link":"https://www.straitstimes.com/sport/football/football-west-ham-stop-the-rot-with-draw-at-leeds","keywords":null,"creator":null,"video_url":null,"description":"January 05, 2023 6:18 AMBoth sides had chances to win it but had to settle for a point apiece.","content":"LEEDS, England - West Ham United brought an end to a run of five consecutive Premier League defeats as they battled to a 2-2 draw at Leeds United on Wednesday. The writing looked to be on the wall for the visitors after teenage forward Wilfried Gnonto gave Leeds the lead in the 27th minute, but David Moyes’ side responded well and deservedly levelled just before halftime through a Lucas Paqueta penalty. With supporters still taking their seats for the second half, Gianluca Scamacca stunned Elland Road with a second for West Ham 44 seconds after the restart to complete the turnaround. Leeds toiled as the rain came down, but a thunderbolt out of the blue from Rodrigo restored parity once more with 20 minutes to go. Both sides had chances to win it but had to settle for a point apiece, with West Ham remaining 17th in the table, level on 15 points with Everton in the relegation zone, while Leeds are two points clear of the bottom three in 14th. REUTERS","pubDate":"2023-01-04 22:18:27","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Football. Serie A : Samuel Umtiti victime de cris racistes contre la Lazio","link":"https://www.ledauphine.com/sport/2023/01/04/serie-a-samuel-umtiti-victime-de-cris-racistes-contre-la-lazio","keywords":["Sport","Football","Sport national","OL (Olympique Lyonnais)","Fil Info","Faits-divers - Justice"],"creator":null,"video_url":null,"description":"L'ancien joueur de l'OL Samuel Umtiti a été la cible de cris racistes, ce mercredi, lors de la victoire de Lecce face à la Lazio Rome (2-1).","content":null,"pubDate":"2023-01-04 22:18:00","image_url":"https://cdn-s-www.ledauphine.com/images/659FE105-19C3-43BA-8AD8-0FF25CBE0C9F/NW_listB/photo-sipa-1672871270.jpg","source_id":"ledauphine","country":["france"],"category":["sports"],"language":"french"},{"title":"Football: Kane brace catapults Tottenham to 4-0 win at Crystal Palace","link":"https://www.straitstimes.com/sport/football/football-kane-brace-catapults-tottenham-to-4-0-win-at-crystal-palace","keywords":null,"creator":null,"video_url":null,"description":"January 05, 2023 6:12 AMDefender Matt Doherty and Son Heung-min net further goals for the visitors.","content":"LONDON - Striker Harry Kane marked his 300th Premier League appearance with a brace of goals to hand Tottenham Hotspur an emphatic 4-0 victory over Crystal Palace in their London derby at Selhurst Park on Wednesday. Defender Matt Doherty and Son Heung-min netted further goals for the visitors as Palace capitulated in the second half having been the better side in the opening period when the teams went to the break at 0-0. The win moves Tottenham to 33 points from their 18 matches and to within two points of fourth-placed Manchester United, though they have played a game more. Palace are in 12th position with 22 points from 17 games. After a quiet first half, Kane rose highest at the back post to head in Ivan Perisic’s cross on 48 minutes, and shortly afterwards added a second as he collected a pass from Bryan Gil, took a touch and arrowed his shot into the bottom corner to take his career Premier League goals tally to 198. “It was a really important win. We have not come back (from Qatar) and got the best results. It was nice to put that performance in,” Kane told SkySports after Tottenham chalked up their first win since action in the Premier League resumed following the six-week break for the World Cup. “It was about moving the ball quick, getting runs in behind and then quality in the final third. It was great to keep a clean sheet.” The win eases the pressure on Tottenham manager Antonio Conte after his Spurs side had lost four of their previous seven topflight matches, including a demoralising 2-0 home defeat to Aston Villa on Sunday that saw them booed off the pitch by their own supporters. An Eberechi Eze-inspired Palace looked the more dangerous in the first half as Jordan Ayew forced a good low save from Spurs goalkeeper Hugo Lloris and defender Joachim Andersen flashed a 25-yard shot narrowly wide of goal. Chances were few and far between for Tottenham, but Kane sent a header well wide of the goal from their best moment. They started much the brighter in the second half to change the momentum in the game and Kane’s quickfire brace was a blow from which Palace never recovered. Doherty, always looking to get forward from his wingback position, side-footed in a third to make the points safe, before Son drilled home the final goal, a relief to him after some poor form in recent games. “We scored at an important time in the game,” Kane said. “We have done well this season in terms of when we get one goal, a second is not too far behind. It is a really good win.” Both sides now switch focus to FA Cup third round ties as Tottenham host third-tier Portsmouth and Palace welcome Premier League rivals Southampton. Both games will be played on Saturday. REUTERS","pubDate":"2023-01-04 22:12:00","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"'It was heartbreaking': Bucs' head coach discussed moment Bills' Hamlin collapsed on field","link":"https://www.wfla.com/nfl/nfl-tampa-bay/it-was-heartbreaking-bucs-head-coach-discussed-moment-bills-hamlin-collapsed-on-field/","keywords":["NFL Tampa Bay","Buccaneers","Local News","Mobile","News","NFL","Sports","Top Stories","Video"],"creator":["Kaycee Sloan"],"video_url":null,"description":"On Wednesday afternoon, Tampa Bay Buccaneers head coach Todd Bowles addressed the media following the horrific scene that occurred during Monday night's game between the Buffalo Bills and Cincinnati Bengals.","content":"TAMPA, Fla. (WFLA) – On Wednesday afternoon, Tampa Bay Buccaneers head coach Todd Bowles addressed the media following the horrific scene that occurred during Monday night's game between the Buffalo Bills and Cincinnati Bengals. During the first quarter, Bills' safety Damar Hamlin collapsed on the field after tackling Bengals' wide receiver Tee Higgins. Hamlin needed CPR and an AED before he was escorted off the field in an ambulance and taken to UC Medical Center where he remains in critical condition. Bucs players, fans show support for Bills’ Damar Hamlin after he collapsed during Monday’s game The Buffalo Bills later confirmed that Hamlin suffered a cardiac arrest. Although his family said his condition is improving, the moment Hamlin went down will live in the minds of all that were watching – including Bowles. \"I think it rattles you as a person, not just a player,\" Bowles said. \"A coach, a parent, a friend...just looking at the TV rattles you. As a fan in the stands...it rattles you as a person. It doesn't just rattle you as a player.\" \"Monday night, you know, something like that hadn't happened before, that was different.\" Bowles continued. \"It was heartbreaking and it still is.\" \"I have two kids that play football coming up, you know, you think about that part of it, and having played myself, we chose to play this game. It helps you appreciate the little things that you think you have going on in your life when you see something like that happen, so my heart just goes out to the family and I hope he gets better,\" Bowles said. Following Hamlin's' critical injury, fans and NFL players flooded his foundation with donations. The GoFundMe had an initial goal of $2,500; as of Wednesday afternoon, the total sits above $6.5 million. Bucs' quarterback Tom Brady contributed $10,000 to the cause. While fans, NFL players, and teams around the country eagerly wait for updates on the 24-year-old's condition, the family said they are \"deeply moved by the prayers, kind words, and donations from fans around the county.\" Anyone wanting to donate to Hamlin’s foundation can do so by following this link.","pubDate":"2023-01-04 21:31:11","image_url":"https://www.wfla.com/wp-content/uploads/sites/71/2023/01/AP23001738820762.jpg?w=900","source_id":"wfla","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Tony Pollard has a full practice; Leighton Vander Esch limited","link":"https://profootballtalk.nbcsports.com/2023/01/04/tony-pollard-has-a-full-practice-leighton-vander-esch-limited/","keywords":["Dallas Cowboys","Home","Rumor Mill","Washington"],"creator":["Charean Williams"],"video_url":null,"description":"Cowboys running back Tony Pollard returned to practice in a full capacity Wednesday. He missed practice all last week and Thursday Night Football with a thigh injury. Pollard, who made his first Pro Bowl, leads Dallas with 1,359 yards from scrimmage and 12 total touchdowns. He has 988 yards rushing and 39 receptions for 371 [more]","content":null,"pubDate":"2023-01-04 21:28:57","image_url":"https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2023/01/GettyImages-1453546110-e1672867693974.jpg?w=547&h=297&crop=1","source_id":"profootballtalk","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Expert: Hamlin's cardiac arrest shows how access to defibrillators can save lives","link":"https://www.princegeorgecitizen.com/national-sports/expert-hamlins-cardiac-arrest-shows-how-access-to-defibrillators-can-save-lives-6328018","keywords":null,"creator":["John Chidley-Hill"," The Canadian Press"],"video_url":null,"description":"Damar Hamlin's cardiac arrest on the field during Monday Night Football may serve as a wake-up call for many Canadians, says a spokesman for the Heart and Stroke Foundation.","content":null,"pubDate":"2023-01-04 21:28:52","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/01/2023010416014-63b5ea25d8818201fed0356djpeg.jpg;w=960","source_id":"princegeorgecitizen","country":["canada"],"category":["sports"],"language":"english"},{"title":"David Gold: How West Ham co-chairman transformed Ann Summers into sexy brand worth £150M & loved by Love Island stars","link":"https://www.thescottishsun.co.uk/sport/10013415/david-gold-ann-summers-story/","keywords":["Sport","Football","Sex"],"creator":["Tom Hussey"],"video_url":null,"description":null,"content":"WHEN David Gold took over failing Ann Summers in 1971, few would believe the sex shop would one day become a global mega-brand. But the West Ham co-owner, who died on Wednesday aged 86 after a short illness, was picking up good vibrations. AlamyDavid Gold died on Wednesday aged 86, pictured here with daughter Jacqueline[/caption] News Team International/Dave EvettsDavid Gold took over Ann Summers in 1971[/caption] Love Island star Megan Barton-Hanson modelling for Ann SummersAnn Summers It was perhaps unsurprising for a working class boy from London’s East End, a dyed in the wool grafter from day dot. Born 1936 in Stepney to Rose and gangster dad Godfrey ‘Goldy’, who wound up in prison, young David was forced to flog buttons to support his struggling mum. He did this from the family home on Green Street, directly opposite West Ham’s former Boleyn Ground – he’d later play for the youth team, and go onto buy it in 2010. Gold worked as a bricklayer before going into business with brother Ralph, spending £10,000 on the Ann Summers store at London’s Marble Arch. The pair got to work transforming the run-of-the-mill sex shop into a quality lingerie and sex toy boutique worthy of the high street. Business boomed, and in 1979 Gold was joined by 19-year-old daughter Jacqueline who would go on to build the firm into one of Britain’s most iconic brands. Ann Summers grew and grew, banking millions of pounds of profits each year as it expanded into Tupperware-style parties for women. The explosion of his business came alongside ventures into the adult entertainment industry – where he launched Gold Star Productions which ran porno mags Raider and Rustler. He joined forces with West Ham co-owner David Sullivan in 1972, later launching the Sunday Sport newspaper in 1986. The millionaire – who could fly helicopters and planes – also set up Gold Air International which flew the rich and famous, he sold the firm in 2004 for £4.4 million. But Gold – who drove around in a red Rolls Royce complete with a ‘D GOLD’ number plate – was never far from a controversy with his sex empire. In 2006, Muslim groups fumed at the release of a blow up sex doll called Mustafa Shag which shared a name with the Prophet Mohammed. And in 2007 when Ann Summers launched the iGasm – which plugged into iPods – Apple brought in the lawyers. Today Ann Summers has 145 stores across the UK and Republic of Ireland, and an annual turnover of £150m. A string of celebrities, including Love Island favourites Tasha Ghouri and Megan Barton-Hanson, have since modelled for the chain. Gold would go on to embody his namesake amassing a monster £500 million fortune. In an emotional statement following the tycoons Death, David Sullivan said: “On behalf of everyone at the football club, it is with profound sorrow and a heavy heart that we mourn the passing of our colleague and friend, David Gold. “Of all our joint ventures, none gave us more pride and happiness than the day we took ownership of West Ham United, our Club, in January 2010. “David had a long-standing connection with the Hammers, having grown up opposite the Boleyn Ground in Green Street, and represented the Club at junior level. “He always wanted what was best for West Ham United, and his passing is a great loss for all of us.” David Gold, who lived in Surrey, died peacefully with his daughters Jacqueline and Vanessa, and his fiancée Lesley, by his side. The Mega AgencyLove Island star Tasha Ghouri modelling for Ann Summers[/caption] AlamyDavid Gold died peacefully with his daughters Jacqueline and Vanessa, and his fiancée Lesley, by his side[/caption] The Mega AgencyAnn Summers now boasts 145 stores across the UK[/caption]","pubDate":"2023-01-04 21:25:05","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Canal+ / Les rendez-vous à ne pas manquer sur les chaînes Canal+ Sport","link":"https://www.afrikmag.com/canal-rendez-vous-pas-manquer-chaines-canal-sport/","keywords":["Football","Sport","Sports","Golf","MMA","NBA","sports"],"creator":["Lory"],"video_url":null,"description":"Pour l’an 2023, les chaînes Canal+Sport ouvrent le bal d’émotions avec un programme qui promet des sensations en janvier. Le Championnat d’Afrique des Nations TotalEnergies, ALGERIE 2022, à vivre en direct et en intégralité du 13 janvier au 4 février sur CANAL+SPORT 1 et CANAL+SPORT 2. La Tropicale Amissa Bongo. Une soirée MMA avec le combat Figueiredo/ Morenoe, toujours … L’article Canal+ / Les rendez-vous à ne pas manquer sur les chaînes Canal+ Sport est apparu en premier sur AfrikMag.","content":"Début du Championnat d’Afrique des Nations du 13 janvier au 04 février sur et sur Inter Milan / Naples le 2023 Milan AC / As Roma le 2023 Naples / Juventus le 2023 Rennes / PSG le 2023 Marseille / Monaco le 2023 Chelsea / Manchester City, le 2023 Manchester United / Manchester City, le 2023 Tottenham / Arsenal, le 2023 Liverpool / Chelsea, le 2023 Liepzig / Bayern Munich, le La Tropicale Amissa Bongo du 2023 N° Figueiredo / Moreno le 2023 Wilwaukee le 2023 Golden State / Chicago Bulls le 2023 Philadelphia / Denver, le 2023 GOLF sur Canal+ Sport 5 Abu Dhabi HSBC Championshirp du 2023","pubDate":"2023-01-04 21:21:43","image_url":null,"source_id":"afrikmag","country":["burkina fasco"],"category":["sports"],"language":"french"},{"title":"Troy Vincent doesn’t rule out postponement of Patriots-Bills game","link":"https://profootballtalk.nbcsports.com/2023/01/04/troy-vincent-doesnt-rule-out-postponement-of-patriots-bills-game/","keywords":["Buffalo Bills","Cincinnati Bengals","New England Patriots","Rumor Mill","Top Stories"],"creator":["Mike Florio"],"video_url":null,"description":"The NFL still hasn’t decided whether, or when, the Week 17 game between the Bills and Bengals will resume. There’s another dilemma potentially looming for the league. During a Wednesday afternoon conference call regarding the Damar Hamlin situation, NFL executive V.P. of football operations Troy Vincent didn’t rule out the possibility of postponing the Week [more]","content":null,"pubDate":"2023-01-04 21:16:10","image_url":"https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2023/01/GettyImages-1242810053-e1672866775909.jpg?w=957&h=540&crop=1","source_id":"profootballtalk","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Raith Rovers takeover on the rocks as prospective buyers put talks on hold and hit out at current top brass","link":"https://www.thescottishsun.co.uk/sport/football/10013172/raith-rovers-takeover-prospective-buyers-talks-on-hold/","keywords":["Football","Scottish Championship","Sport"],"creator":["Ryan Rowe"],"video_url":null,"description":null,"content":"THE Hong Kong-based group interested in buying Raith Rovers has put talks on hold and sensationally taken aim at current ownership for the breakdown in negotiations. Silverbear Capital, led by Peter Chun, has been looking at the Championship club in recent months and have held talks with owner John Sim and chairman Steven MacDonald. The SunStark’s Park, home of Raith Rovers[/caption] It’s also been claimed that the investors had already lined up FOUR new signings, including two free agents, a Switzerland international player and a loanee from ‘one of the top clubs in world football’. Former SFA chief executive Gordon Smith is also involved in the consortium and the group say he put the players forward to the club and both sides even reached verbal agreements, but the deals all fell through. In a statement seen by The Courier, the firm hit out at Stark’s Park chiefs and left their future interest in the club up in the air. It read: “It is with regret that we are announcing, following two months of applying due diligence, further discussions regarding the acquisition of Raith Rovers are now on hold. “Our representatives were present at Stark’s Park and had talks mainly with the chairman, and some with owner John Sim. “The reasons for this are shortcomings and lack of corporate social responsibility by the Management. “Further, by the way players, who were introduced by Gordon Smith and James Carlin were not employed despite the fact that a verbal agreement to sign them was in place, is not acceptable, as this actually stopped them having talks with other interested clubs. “We hope to resolve these issues, so the talks can resume.” Earlier this week, Raith chairman MacDonald said there had been further interest in the Kirkcaldy club from the USA and Scotland. Elsewhere, Livingston coach Marvin Bartley reckons a lot of clubs will feel “hard done by” after seeing Celtic complain to the SFA about VAR. The Premiership champions are writing to the governing body in the wake of controversy over a potential handball involving Connor Goldson in the Old Firm derby on Monday. Bartley told Clyde 1 Superscoreboard: “Every club will send an email – or a majority of clubs will – if they think they are hard done by. “There is only a big deal being made of it because it was such a high profile game and because it was at Ibrox. “There are plenty of clubs who think they have been hard done by this season.” Keep up to date with ALL the latest news and transfers at the Scottish Sun football page","pubDate":"2023-01-04 21:12:30","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Patriots safety Kyle Dugger named AFC Defensive Player of Week 17","link":"https://www.patspulpit.com/2023/1/4/23539506/patriots-safety-kyle-dugger-afc-defensive-player-of-the-week-dolphins","keywords":null,"creator":["Bernd Buchmasser"],"video_url":null,"description":null,"content":"Kyle Dugger is the new AFC Defensive Player of the Week. The third-year safety received the honor after playing a pivotal role in the New England Patriots ’ 23-21 victory over the Miami Dolphins on Sunday. Dugger, 26, registered five tackles and two pass breakups in the game. His biggest play, however, came in the third quarter: he intercepted a pass by Dolphins quarterback Teddy Bridgewater, and ran the ball back 39 yards for a touchdown. “Just cover-two dropping as the middle player,” Dugger later said about the play. “Got some odd drops, saw my threat was eliminated, so I was able to get my eyes back to the quarterback and get around to the backside vertical. Once I got my hands on the ball, I know I needed to score. It helped the team greatly. That was the goal.” Dugger originally joined the Patriots as a second-round draft pick out of Lenoir-Rhyne in 2020, and is playing the best football of his career this season. A versatile member of the team’s secondary, he has appeared in 14 games and regularly made his presence felt — including on a league-leading three defensive touchdowns. The latest of those has now made Dugger the fifth Patriot to receive Player of the Week honors this season. He is joining linebacker Matthew Judon (Week 5), kicker Nick Folk (Week 8), punt returner Marcus Jones (Week 11) and linebacker Josh Uche (Week 15). Dugger is also the first player ever from Lenoir-Rhyne to be recognized in this manner. Despite his success this season, however, Dugger still sees plenty of room for improvement in his game. “I still have a ton of things to work on and get better at,” he said. “As far as how far I’ve come, I’m a lot better now than I was then. I’ll say that. I’ve learned a lot. I definitely know I have so much to learn still. I mess up still things. I know I shouldn’t be messing up. Things like being consistent, it’s still huge for me. I got a lot to work on still.”","pubDate":"2023-01-04 21:10:00","image_url":null,"source_id":"patspulpit","country":["united states of america"],"category":["sports"],"language":"english"}]}