{"newsArray":[{"title":"Intercontinental Cup 2023: গোটা টুর্নামেন্টে কোনও গোল না হজম করে চ্যাম্পিয়ন ভারত, সুনীলদের ঘিরে উৎসব","link":"https://bengali.abplive.com/photo-gallery/sports/intercontinental-cup-2023-india-beat-lebanon-after-a-huge-gap-of-46-years-see-in-photos-986538","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":null,"content":"দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে। গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ছবি সৌ - AIFF West Bengal News Live: সাতসকালে নামল আঁধার, আষাঢ়ের শুরুতে শহরজুড়ে প্রবল বৃষ্টি","pubDate":"2023-06-19 03:18:26","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/7df665bc59040c86f3206b0159e12580168714433857350_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Why it’s time for All Blacks to move on from stale Beauden Barrett - Chris Rattue’s winners and losers","link":"https://www.nzherald.co.nz/sport/why-its-time-for-all-blacks-to-move-on-from-stale-beauden-barrett-chris-rattues-winners-and-losers/T7ARI74EK5DHJNFPN7EKIBI3CA/","keywords":null,"creator":null,"video_url":null,"description":"OPINION: I’d like to find a way of leaving Barrett out of the World Cup squad.","content":"OPINION: LOSER: My fandom…Beauden Barrett’s All Black worth Beauden Barrett’s uninspiring performance for the Blues in Christchurch made a startling contrast to what was going on with the other team. The half-hearted Blues semifinal “effort” was summed up by Barrett’s early kickoffs that kept zooming straight to his brother Scott, who was in magnificent form (again) and clutched these tricky gifts with aplomb. Scott Barrett’s perfect early kickoff receptions provided the launching pad for an 80-minute Crusaders assault of rare quality. It was breathtaking. But why the heck keep kicking it to him? The Crusaders, full of men on the rise, were so unified and energetic. This was one of their finest hours, and they’ve had plenty of those. I’ve been among Beauden Barrett’s biggest fans over the years – at his best he was virtually beyond compare. But it’s getting harder to sustain the fandom even though Barrett Lite can still scuttle through a half gap. Advertisement Advertise with NZME. This is never going to happen but in all seriousness, I’d like to find a way of leaving Barrett out of the World Cup squad on the basis that his playmaking axis with Richie Mo’unga has struggled to find a truly happy place. It’s not a disaster, but it doesn’t have the feel of being a history-making winner either at a time when the All Blacks have melted back into the international pack. And it may be blocking a glorious way forward. There’s a lot of focus on a squad bolter of course, and some newcomers, but the big call for Ian Foster to make in terms of having faith in the future was moving on from the Beauden Barrett era. It’s hard to criticise him for not doing it, yet there’s staleness to Barrett’s game that has become very frustrating. Give Mo’unga the No 10 mantle without any confusion, and stick Will Jordan in his best place – fullback. Then let this little Crusaders combo loose on the world unencumbered…that’s my theory for the day. As for Scott Barrett, what a fantastic footballer he has been for a number of seasons, and is now proving to be a great Crusaders captain. And if his brother should prove me very wrong, well, I’d be happy about that. WINNER/LOSER: The Super Rugby final/music Damian McKenzie of the Chiefs in action against the Brumbies. Photo / Photosport An all New Zealand battle, full of All Blacks, with the champs having to travel to Hamilton. Super Rugby has reached a terrific conclusion. Advertisement Advertise with NZME. The Brumbies were very credible in the playoffs, but from a New Zealand perspective their presence would have dumbed down the final so it was a relief to see the Chiefs hold them off. The Chiefs aren’t firing on all cylinders though, and the Crusaders are. My money is firmly on the red and black machine. A final (forlorn) plea: please turn off that annoying music – at least for the big matches – at Waikato Stadium. LOSERS: The Blues and Leon MacDonald’s status Fair play to the mighty Crusaders. I never doubted they would win the Super Rugby semifinal in Christchurch. But even after decades of watching the Blues splutter along, it was still a shock to seem them play that badly. The Crusaders were missing half a team of All Blacks and won by zillion. HALF A TEAM OF ALL BLACKS. A ZILLION. Ultimately, the five-year Leon MacDonald/Tom Coventry coaching era at the Blues has gone almost nowhere. This semifinal performance was downright embarrassing, amongst the worst in the franchise’s often horrible history. If MacDonald wasn’t joining the All Black set up, a new coach was probably needed anyway after watching that dross. Yet MacDonald claimed: “There’s been a lot of progress.” No, there hasn’t, not after watching that semifinal debacle. WINNER: Toutai Kefu’s attitude Love the World Cup confidence, after the Tonga rugby coach declared “we have the cattle now”. Under rugby’s much-needed regulation change, the longtime Australian No 8′s squad includes former Wallabies Israel Folau and Adam Coleman, plus five former All Blacks. LOSER: England’s declaration England coach Brendon McCullum. Photo / Photosport Yes, we get it. Everyone is in love with Bazball. Coach Brendon McCullum and captain Ben Stokes can do no wrong even when the mistake is obvious. England’s first innings declaration in the opening Ashes cricket test, with ace batsman Joe Root still at the crease, was bizarre. They had a foot on Australia’s throat, then wandered off. But wait, there’s more. Legendary Kiwi captain McCullum was once lauded for promoting civilised cricket in a sea of sledging, but his England fast bowler Ollie Robinson must have missed the memo. Robinson farewelled century maker Usman Khawaja with a pathetic foul-mouthed rant (according to ‘social media lip readers’) at Edgbaston. The worst thing about modern sledging is it lacks the wit of old – it’s just silly when delivered by a boofhead like Robinson. To be fair to McCullum, his ‘spirit of cricket’ stance always appeared to be about the best way New Zealand could succeed and he was probably right. But the accolades for his attitude kept coming, and he didn’t exactly whack them to the boundary. Moving on…McCullum’s recalled England spinner Moeen Ali was fined for illegal application of spray to his hand during the Edgbaston battle. It’s not been a great match for the spirit of cricket. WINNER: Steve Hansen Surely rugby bosses will listen to this guy. The former All Black coach said the NRL was had superior product largely because league bosses listened to what fans want. “[League] is a better game to watch on TV than rugby is, because it’s not stop-start. They apply a lot of common sense to how they adjudicate things and make sure the game keeps some form of flow to it,” he said. “Our game over the last five years has got slower and slower and slower.” WINNER: Vinicius Junior Real Madrid's Vinicius Junior (right). Photo / AP Crowd abuse victim Vinicius Junior of Real Madrid has been given a top role on a Fifa anti-racism committee, while Brazil and Spain have organised a friendly match for the same cause. At least football has acted quickly this time after the Brazilian was abused by Valencia fans. The appalling racism problem runs so deep in football though that it’s difficult to see how it can be fully excised. But Vinicius is emerging as a leader in trying to force football to go the extra mile in combating this horror. LOSER: Jay Monahan The suddenly unpopular PGA commissioner went on medical leave after his major u-turn enabled a truce with the Saudi-backed LIV tour. It’s hard to see him coming back. WINNER: India’s Olympic wrestlers Brave and lengthy protest has led to the arrest of their federation’s boss on charges of sexual harassment and stalking. WINNERS: Warriors… …without even playing in the latest round. The already-battling Dragons – their opponents on Friday – are neck deep in a major drama with State of Origin playmaker Ben Hunt demanding a release from the Sydney league club, which is standing firm. And the two teams leading the chase for a top eight spot – the Roosters and Sea Eagles – continued to struggle with form and/or major injuries in the latest round of games. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 02:30:00","image_url":"https://www.nzherald.co.nz/resizer/O-1Kva758hCkMDFRxawXI5-PhSI=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/MFN3VLO4YNGD5PAOKMHL73MVFQ.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Lionel Messi, Saudi Arabia and the deal that paid off for both sides","link":"https://www.nzherald.co.nz/sport/lionel-messi-saudi-arabia-and-the-deal-that-paid-off-for-both-sides/F7BGK3B4TFHYLDN2W3LZFJZAIQ/","keywords":null,"creator":null,"video_url":null,"description":"New York Times: Contract offers glimpse at details of multimillion-dollar relationship.","content":"A contract between Messi and Saudi Arabia’s tourism authority offers a glimpse at the details of their multimillion-dollar relationship. As the sun set over a seemingly endless expanse of open sea, Lionel Messi took a seat at the edge of a boat, stretched out a leg and posed for the photograph that would announce the beginning of his public partnership with Saudi Arabia. The image, shared with Messi’s 400 million-plus followers on Instagram on May 9, 2022, was accompanied by a dual-language caption that read, “Discovering the Red Sea #VisitSaudi.” Hours earlier, he had been welcomed to the kingdom by Saudi Arabia’s tourism minister, who had boasted on Twitter that while it was Messi’s first visit to the country, “it will not be the last.” Messi, who is regarded perhaps as global football’s greatest player, was starting to cash in on the new partnership: His photo-op in the Red Sea likely earned him approximately US$2 million ($3.2 million), the first step in fulfilling his agreement with the kingdom that is worth millions more. View this post on Instagram A post shared by Leo Messi (@leomessi) The details of Messi’s role as a well-compensated pitchman for Saudi Arabia are contained in a previously undisclosed version of his contract with the tourism authority that was reviewed by the The New York Times. The contract shows that Messi could receive as much as 22.5 million euros, about $39.5 million, over three years for little actual work: a few commercial appearances, a handful of social media posts and some all-expenses-paid vacations to the kingdom with his family and children. He is expected to share images of those trips — marked with a Saudi-approved hashtag — with his vast online following. But the document also contains a condition important to Saudi officials: Messi cannot say anything that might “tarnish” Saudi Arabia, a country that has faced widespread criticism for its human rights record. Those details of the arrangement with Messi, who won the World Cup with Argentina in December, offer an inside glimpse of the oil-rich kingdom’s use of its wealth to enlist marquee athletes in its effort to burnish its global image. Saudi Arabia’s critics deride the strategy as sportswashing: using sports and sports figures to whitewash the country’s human rights record, its treatment of women, its killing of Washington Post columnist Jamal Khashoggi, and other authoritarian actions. Advertisement Advertise with NZME. For the past few years, Saudi Arabia has spent billions to take big stakes in professional sports: The purchase of a Premier League football team. Championship boxing matches. A stop on the Formula One auto racing schedule. And, most recently, a brazen incursion into professional golf. The kingdom has offered hundreds of millions of dollars more to lure Cristiano Ronaldo, Karim Benzema and dozens of other football stars to play in the country’s domestic league. Messi recently declined a similar offer, choosing instead to join Inter Miami of Major League Soccer in the United States. But there’s no sign so far that the decision has affected his relationship with the Saudis. Indeed, he has seemed eager to stay in their good graces. Related articles Sport Secrecy, cigars and a Venetian wedding: How the PGA Tour made a deal with Saudi Arabia 11 Jun 11:23 PM World Saudi Arabia relishes a triumph that transcends sports 07 Jun 11:10 PM Sport | Sailing Team NZ to make big decision after Am Cup rival's Saudi appeal rejected 31 May 03:05 AM In February 2021, just weeks after he signed his contract, Messi wrote a letter to Saudi’s tourism minister, apologising for being unable to make a scheduled visit. In the previously unreported letter, Messi addressed the tourism minister, Ahmed al-Khateeb, as “Your Excellency” and, in unusually flowery prose, expressed his “deepest regrets” for his absence. Messi was then playing for FC Barcelona, and he wrote that as “a sportsman,” he had obligations that were impossible to skip: a league game against Real Betis followed by a match in the Spanish cup. Messi was suspended from Paris St.-Germain after he took a trip to Saudi Arabia that was not authorized by the team. Photo / AP The Saudis got their visits eventually. The most recent came last month, a year after his first Saudi tourism post on Instagram, when Messi took a quick, midseason vacation to the kingdom — which, like all of his previous visits, would have yielded him a seven-figure payday under the terms of his Saudi tourism contract. By then, Messi had left Barcelona and was playing for the French team Paris St.-Germain. When he returned from his Saudi sojourn, the French club suspended him for what it deemed an unauthorized absence from training. Messi apologised to his team and its fans with an explanation that suggested the trip was not optional: “I couldn’t cancel it.” Until now, the details of Messi’s contract with the tourism authority have been a closely held secret. It is not clear if the contract reviewed by the Times is the current version of the deal. It was shared by someone with direct knowledge of the arrangement between Messi and the Saudis on the condition of anonymity because the person was not authorised to divulge details of the deal. The document, dated Jan. 1, 2021, was signed by Messi and his brother Rodrigo, who serves as his business manager, but it is not signed by Saudi officials. The terms outlined in the document are consistent with the way Messi has used his social media accounts to promote the kingdom, and also with the promotional visits he has made to the country. The contract is specific about Messi’s obligations, and about the money to be paid for fulfilling each one: Advertisement Advertise with NZME. About US$2 million ($3.2 million) for a minimum of one family vacation annually lasting five days, or alternately two annual vacations of three days each. The travel expenses and five-star accommodations were to be paid by the Saudi government for Messi and up to 20 family members and friends. Another US$2 million for promoting Saudi Arabia on his social media accounts 10 times a year, separately from the promotion of his vacations to the kingdom. About US$2 million more to participate in an annual tourism campaign. (He and the Saudi authority shared the first campaign, an elaborately shot desert video, in November.) Another US$2 million for charitable work and appearances. Few people were willing to discuss the terms of Messi’s deal. Pablo Negre Abello, who is responsible for Messi’s commercial deals, cited confidentiality clauses written into all of Messi’s contracts. Abello suggested that a Times reporter contact the tourism authority. Officials there did not respond to multiple requests for comment. Rayco García Cabrera, a former football player who brokered the meeting between Messi’s management and Saudi officials, including the minister of tourism, said the deal was worth “a small amount” compared with the huge salaries the country is paying stars like Ronaldo and Benzema. But, García said, Messi agreed to be a tourism spokesperson because “he believes in Saudi and the vision of Saudi.” “I was in the middle of this,” García added, “and I was so surprised when Messi didn’t ask for a huge amount.” García said he did not know the precise terms of the agreement. A review of Messi’s social media postings and travel show him seemingly fulfilling the terms of his contract. His Instagram account — with 470 million followers, it is one of the largest on the platform — has featured a regular stream of Saudi messaging and photographs. On his visit in May, Messi was photographed with his wife and children participating in a variety of family activities: petting horses with his sons, playing games at an arcade and sitting with a craft artist while holding a woven hat. In 2021, amid news reports linking Messi and Saudi Arabia, family members of Saudi dissidents urged the player to reject the endorsement offer that he eventually accepted. In an open letter, they pleaded with him by writing, “The Saudi regime wants to use you to launder its reputation.” Saudi officials have rejected that charge. Messi, meanwhile, has made no mention of it. Instead, he has expressed wonder at the natural beauty to be found in Saudi Arabia. One of Messi’s recent posts is a picture of the kingdom’s date palm groves and other natural attractions. The caption reads: “Who thought Saudi has so much green?” This article originally appeared in The New York Times. Written by: Karim Zidan and Tariq Panja ©2023 THE NEW YORK TIMES Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 02:24:10","image_url":"https://www.nzherald.co.nz/resizer/rJNSr08Q_FnLM7_dZkzeih5ucvc=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/ELJGZVAFOJH2FIB7MOVEWZTBBU.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"India vs Lebanon: লেবাননের বিরুদ্ধে ৪৬ বছরের শৃঙ্খল ভাঙল ভারত, গোল না খেয়ে চ্যাম্পিয়ন ব্লু টাইগার্স","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-india-beat-lebanon-after-a-huge-gap-of-46-years-know-in-details-986522","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।'             View this post on Instagram                       A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?  ","content":"ভুবনেশ্বর: দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' View this post on Instagram A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 02:11:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/12f7e6a19c050b77971ac53d83ef13fc168713963478250_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Зінченко: Україні зараз потрібна вогнепальна зброя","link":"https://champion.com.ua/football/2023/06/19/932039/zinchenko-ukrayini-zaraz-potribna-vohnepalna-zbroya","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Сполучене Королівство та США, які далеко, дають Україні багато зброї та можливість виграти війну з росією.Про це заявив Олександр Зінченко у токшоу \"Uncensored\" Пірса Моргана.\"Чи вірю у перемогу України? Я не вірю - я знаю. Я знаю, що ми переможемо. ...","content":"#Олександр Зінченко Джерело - Чемпіон . Сполучене Королівство та США, які далеко, дають Україні багато зброї та можливість виграти війну з росією. Про це заявив Олександр Зінченко у токшоу \"Uncensored\" Пірса Моргана. \"Чи вірю у перемогу України? Я не вірю - я знаю. Я знаю, що ми переможемо. Ми вже перемогли. Вони не очікували такого від нас. Вони думали, що за три дні проведуть парад у центрі Києва. Ми не можемо віддати свою Батьківщину, місце де ми народилися та зросли, й поїхати. Актуально: \"Люди, яких я знав, загинули\": велика розмова Олександра Зінченка з Пірсом Морганом Україні зараз потрібна вогнепальна зброя. Ми бачимо країни, наприклад, Сполучене Королівство та США, які далеко, але дають Україні багато зброї та можливість виграти цю війну. Мені дуже приємно бачити це, але в той же час, ми не можемо знати чи це все, чи не все, що вони роблять. Я хочу висловити величезну подяку всім, хто допомагає Україні та підтримує і продовжує підтримувати кожного дня\", - сказав Зінченко.","pubDate":"2023-06-19 02:00:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Sunil Chhetri: চ্যাম্পিয়ন হওয়ার পর স্ত্রীর হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল, ভাইরাল হল ছবি","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-sunil-chhetri-makes-his-wife-sonam-bhattacharya-wear-the-captain-s-armband-after-win-over-lebanon-986515","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: ভানুয়াটুর বিরুদ্ধে জয়সূচক গোলের পরই সুখবর দিয়েছিলেন সুনীল ছেত্রী (Sunil Chhetri)। জানিয়েছিলেন, তাঁর স্ত্রী সোনম সন্তানসম্ভবা। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup 2023) জেতার পর স্ত্রী সোনমের হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল। ভারতের জয়ের পরই ডাগ আউটে এসে দাঁড়িয়েছিলেন সোনম। সম্পর্কে যিনি কিংবদন্তি ফুটবলার সুব্রত ভট্টাচার্যের কন্যা। আর ম্যাচ শেষ হতেই বাংলার জামাই এগিয়ে গেলেন স্ত্রীর দিকে। তাঁকে আলিঙ্গন করলেন। হাত নিজের কোমরের পিছনে রাখলেন। যেন বোঝা গেল, উত্তেজনার বশে স্ত্রীর যাতে আঘাত না লেগে যায়, সে ব্যাপারে সতর্ক ভারত অধিনায়ক। তারপরই নিজের হাত থেকে ক্যাপ্টেন্স আর্মব্যান্ড খুলে পরিয়ে দিলেন সুনীল। সেই ছবি ভাইরাল হয়ে গেল সোশ্যাল মিডিয়ায়। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।'             View this post on Instagram                       A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই।  ম্যাচের সেরাও হয়েছেন তিনি। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?","content":"ভুবনেশ্বর: ভানুয়াটুর বিরুদ্ধে জয়সূচক গোলের পরই সুখবর দিয়েছিলেন সুনীল ছেত্রী (Sunil Chhetri)। জানিয়েছিলেন, তাঁর স্ত্রী সোনম সন্তানসম্ভবা। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup 2023) জেতার পর স্ত্রী সোনমের হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল। ভারতের জয়ের পরই ডাগ আউটে এসে দাঁড়িয়েছিলেন সোনম। সম্পর্কে যিনি কিংবদন্তি ফুটবলার সুব্রত ভট্টাচার্যের কন্যা। আর ম্যাচ শেষ হতেই বাংলার জামাই এগিয়ে গেলেন স্ত্রীর দিকে। তাঁকে আলিঙ্গন করলেন। হাত নিজের কোমরের পিছনে রাখলেন। যেন বোঝা গেল, উত্তেজনার বশে স্ত্রীর যাতে আঘাত না লেগে যায়, সে ব্যাপারে সতর্ক ভারত অধিনায়ক। তারপরই নিজের হাত থেকে ক্যাপ্টেন্স আর্মব্যান্ড খুলে পরিয়ে দিলেন সুনীল। সেই ছবি ভাইরাল হয়ে গেল সোশ্যাল মিডিয়ায়। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); View this post on Instagram A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই। ম্যাচের সেরাও হয়েছেন তিনি। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 01:40:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/d0d535ffe2c015b658ac549c48f6f294168713817347050_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Intercontinental Cup 2023: লেবাননকে হারানোর পরই সুনীলদের জন্য সুখবর, বিরাট অঙ্কের পুরস্কার অর্থের ঘোষণা","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-odisha-cm-naveen-patnaik-announces-1-crore-reward-for-india-who-beat-lebanon-2-0-986510","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ফিফা ব়্যাঙ্কিংয়ে দুই ধাপ এগিয়ে থাকা লেবাননের বিরুদ্ধে ফাইনালে ভারতের লড়াইটা যে হাড্ডাহাড্ডি হবে, সেই সম্ভাবনা ছিলই। হলও তাই। প্রথমার্ধে দুই দলই আক্রমণ শানালেও, গোলের দরজা খুলতে পারেননি কেউই। ভারতীয় দলের হয়ে প্রথমার্ধে উইং ধরে সাহাল আব্দুল সামাদ বেশ কিছু আক্রমণ গড়ে তুললেও লাভের লাভ কিছুই হয়নি। গোল করা তো দূর, ভারতীয় দল একটি শট লেবাননের তেকাঠির মধ্যেও রাখতে পারেনি। এমন পরিস্থিতিতে ভারতীয় অনুরাগীদের মনে গত ম্যাচের স্মৃতি ভেসে আসাটাই স্বাভাবিক। ফাইনালের আগে গ্রুপ পর্বে নিজেদের শেষ ম্যাচে লেবাননের বিরুদ্ধে গোলশূন্য ড্র করেছিল ভারত। গোলের সুযোগ হাতছাড়া করেছিলেন সুনীলও। কিন্তু দ্বিতীয়ার্ধ শুরু হতেই ছবিটা বদলে গেল। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই।   আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?  ","content":"ভুবনেশ্বর: লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ফিফা ব়্যাঙ্কিংয়ে দুই ধাপ এগিয়ে থাকা লেবাননের বিরুদ্ধে ফাইনালে ভারতের লড়াইটা যে হাড্ডাহাড্ডি হবে, সেই সম্ভাবনা ছিলই। হলও তাই। প্রথমার্ধে দুই দলই আক্রমণ শানালেও, গোলের দরজা খুলতে পারেননি কেউই। ভারতীয় দলের হয়ে প্রথমার্ধে উইং ধরে সাহাল আব্দুল সামাদ বেশ কিছু আক্রমণ গড়ে তুললেও লাভের লাভ কিছুই হয়নি। গোল করা তো দূর, ভারতীয় দল একটি শট লেবাননের তেকাঠির মধ্যেও রাখতে পারেনি। এমন পরিস্থিতিতে ভারতীয় অনুরাগীদের মনে গত ম্যাচের স্মৃতি ভেসে আসাটাই স্বাভাবিক। ফাইনালের আগে গ্রুপ পর্বে নিজেদের শেষ ম্যাচে লেবাননের বিরুদ্ধে গোলশূন্য ড্র করেছিল ভারত। গোলের সুযোগ হাতছাড়া করেছিলেন সুনীলও। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); কিন্তু দ্বিতীয়ার্ধ শুরু হতেই ছবিটা বদলে গেল। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 01:23:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/d418046c7fbbfef150786854ed9f92f3168713774940750_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Western Springs Football Club and top female players reach agreement over gender equity issues","link":"https://www.nzherald.co.nz/sport/western-springs-football-club-and-top-female-players-reach-agreement-over-gender-equity-issues/WY7HB6MXJ5DBDMCOXQV4VWRBLI/","keywords":null,"creator":null,"video_url":null,"description":"The club apologised for failures in communication.","content":"Senior female players at Western Springs Football Club have reached an agreement with the board on plans to address their concerns about gender equity at the club. Following a protracted mediation which began on 30 May, a joint statement released today by the top Auckland club and the Premier Women’s Team said: “We agreed a way forward that’s resolved many of the concerns raised by the players and their supporters and the team will keep playing at Western Springs.” In the statement posted on their website, the club acknowledged there had “been issues” and apologised for “failures in communication and understanding that contributed to the situation”. “Everyone involved committed to the mediation process in good faith, which led to a successful resolution.” Advertisement Advertise with NZME. It comes after an ongoing Herald investigation into the concerns of senior women’s players over inequality disputes at one of the country’s top football clubs. The Herald revealed: Player and staff walkouts ; details of funding the club received for the upcoming Fifa Women’s World Cup ; allegations of “highly misogynistic behaviour”; concerns about a phallic logo; unequal spending between the top male and female squads. Since the Herald first broke the story on 13 May, club leaders have not responded to Herald requests for comment. Today’s statement said: “The club respects the stand taken by the players and the opportunity it’s provided to learn and further improve our approach to women’s football.” Advertisement Advertise with NZME. The statement said a number of changes have been agreed to “which are all about making sure Western Springs sets the standard for not just football clubs in Auckland but for sports clubs nationwide”. The changes included: The Premier Women’s teams’ expense budget will be increased to be equal with the Premier Men; A process is underway to recruit a new Head of Girls’ and Women’s Football; Changes to the constitution will be recommended to embed a commitment to equality, diversity and player representation across their committees; An appointment process is underway for an independent advisor to develop a Girls’ and Women’s Programme Development Strategy; The club will increase efforts to attract more women to Senior and Executive Committees; The executive agreed to develop a clear pathway for raising and resolving members’ concerns and issues. The statement noted the club’s Junior Committee now has 50 per cent female representation. When the Herald first broke the story, the club’s website listed three women among the 10 people on that board. The club has called in Kereyn Smith, former CEO of the NZ Olympic committee, who will act as Transition Director to implement these changes and will also act as a conduit between the Women’s Premier team and the club. Related articles Sport Western Springs' phallic logo to be replaced as special meeting called 12 Jun 12:35 AM Sport Documents reveal gender-equity funding conditions for Western Springs Football Club 03 Jun 03:00 AM Sport Western Springs women's team take to the pitch again - in different kit 29 May 05:30 AM Sport 'I felt shame': Mass exodus at top football club after women players 'disrespected' 12 May 05:00 PM They will also have the support of Northern Region Football and New Zealand Football. Western Springs women who were runners-up in the New Zealand National League last year, played four matches while mediation underway. Two were regular league games and two Kate Sheppard Cup matches – all of which they won. Western Springs premier women's team played two games in black, unbranded kit during the dispute. Photo / Alex Burton The club provided an unbranded kit for two of those games after the players felt uncomfortable wearing a phallic-looking logo. The Herald last week reported the club had called in an artist to redesign the 34-year-old emblem . Today’s post-mediation statement did not mention the logo. The statement said, “despite our size as one of the largest sporting clubs in New Zealand, we’re largely run by volunteers”. “We recognise this has been an unsettling time for members.” Advertisement Advertise with NZME. The club thanked their members for their patience and assured them they’ll be kept informed as the changes progress. “We look forward to returning focus to playing football – and of course, we’d like to see all Western Springs whānau supporting the Premier Women’s team here at Seddon and away.” The players said in a separate statement they were relieved to have reached an agreement with the club – thanking and acknowledging the club’s executives on the changes made. “Pushing for change has been tough on us as a playing group and has taken a personal toll, but we’ve gained strength from each other and have stayed tight as a group,” the players said. “We’ve also had amazing support from men and women around us, particularly in the legal space with Maria Dew KC and Maria Clarke and we couldn’t have achieved this without their help.” The players were “really proud” of what they achieved, adding: “We hope that WSAFC can lead the way for other clubs to ensure equity and fairness and a culture which supports and grows women’s teams. “We can’t wait to concentrate on football knowing that our voices have been heard and that other women may be inspired to stand up for what they believe in.” Advertisement Advertise with NZME. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 00:47:00","image_url":"https://www.nzherald.co.nz/resizer/SX7uw8_MOUxzxp6L1u9BHndj1-I=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/ZNJEQXBDONCCBGWLLFYCVBMGYQ.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Tom Brady expresses importance of his kids in life on Father's Day - “Being a Dad is the best thing in my life”","link":"https://www.sportskeeda.com/nfl/news-tom-brady-expresses-importance-kids-life-father-s-day-being-dad-best-thing-in-my-life","keywords":["NFL"],"creator":["Rit Nanda"],"video_url":null,"description":null,"content":"Tom Brady was feeling sentimental on Father's Day as he expressed his gratitude to his own father and his own journey as a father. He called his children his angels, in whose growth he takes immense pleasure. Despite his many ahievements on the field, he said being a Dad is the best thing happening in his life. He posted pictures of himself with his dad and his children. Writing on Instagram, he said: He continued with thanking his father and all that he learned from him and how he is able to pass that on to his own children. He said that family is what matters the most to him: Tom Brady finished by saying how proud he is of his children and that their good qualities are a reflection of everyone who raises them: Instagram Post Tom Brady's personal life has been under scrutiny over the past year. He famously retired and then unretired, coming back to play for the Tampa Bay Buccaneers for one extra season last year. It was also when his marriage with Gisele Bundchen fell apart after more than a decade being together. There were insinuations that it happened because he was putting his career over his family. But now that he is retired , it seems he is finding his joy beyond his career in football. That stems from his own children and his parents, who have taken the void left behind from his stepping away from football. How has Nikola Jokic changed the NBA forever? His crazy life and career is one for the ages! Poll : 0 votes Quick Links","pubDate":"2023-06-19 00:01:05","image_url":"https://staticc.sportskeeda.com/editor/2023/06/5063f-16871132097418-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Liverpool need £95m to complete dream summer transfer window with three signings","link":"https://www.liverpoolecho.co.uk/sport/football/transfer-news/liverpool-need-95m-complete-dream-27147387","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool have already identified Khephren Thuram as a target with Gabri Veiga and Levi Colwill also among the players monitored","content":"The transfer window is barely a week old and Liverpool have a number of things on their agenda as they look to bolster their squad this summer. deal was concluded without a hitch as the Brighton & Hove Albion midfielder signed on to become the latest Argentine to line up at Anfield. The objective doesn't stop there as continue to eye further improvements to their squad ahead of the players reuniting at the beginning of July for their 2023-24 Premier League and Europa League preparations. After their disappointing campaign last time out, the focus is on defensive and midfield acquisitions as the goalkeeper and attacking options remain stocked. Should Caoimhin Kelleher exit Anfield this summer, the Reds may have their arms twisted into movement between the sticks. But the priority remains in the engine room as well as a left-sided defender, should one become available. Questions were sparked throughout the campaign about the quality of Liverpool's midfield as they were exposed during their difficult spells before dropping to their lowest Premier League finish since 2016. Options in midfield were few and far between with injuries hampering options as well as lack of investment in recent years. In the lowest finish of reign in a full Premier League calendar, there hasn't been a season with more chastening defeats as the Reds fell off the boil just a matter of months after chasing the quadruple. By comparison to recent seasons, there is no financial cushion from qualifying for the Champions League or prize money from their runs in various other competitions. They scored a reported £105.7m from their pursuit of a seventh European crown at the end of the 2021/22 term with an estimated £71m received from their last-16 exit to Real Madrid in March. The German has already argued that the lack of European football can't be used as an excuse to not open their wallets in the transfer window. \"It is a fantastic club with a really good football team and even better, hopefully, next year. I've barely faced the situation where you talk with a player and everything is great and he says, 'okay see you if...' That doesn't happen really often,\" he said in May. \"We are still Liverpool and we are really attractive for a lot of players, we should not forget that. That's why I'm not concerned about that fact. \"Everything is of course more difficult without the Champions League, especially in long term, and we have to not do these things more often. \"But apart from that, it's okay the situation we are in from a talking point of view and convincing point of view.\" The ECHO understands that the with a number of factors contributing to that, none more so than the departure of engine room options James Milner, Alex Oxlade-Chamberlain and Naby Keita - who both struggled with injuries in the last 18 months of their Liverpool careers. Khephren Thuram is under real consideration, it is understood. , Thuram, who has There is a possibility that the 22-year-old will be holding the Liverpool shirt before the start of the Premier League season against Chelsea. According to his current market value is said to be in the region of £27.3m. He is likely to cost more than the reported £35m for Mac Allister - likely to be in the region of £50m - but should Thuram express his intentions of leaving the Allianz Riviera this summer, it might force Nice to part ways. Meanwhile, Borussia Monchengladbach's Manu Kone and Gabri Veiga are also on the list, while Southampton's 19-year-old Romeo Lavia has his admirers but Arsenal have reportedly steered ahead in the race for the Belgian. Ryan Gravenberch emerged as a key target earlier this year and reports claimed in April that Liverpool met with the player's agent, Rafaela Pimenta, who also represents Thuram. Although, there is a reluctance to sell from Bayern Munich, despite the Ajax academy prospect being a peripheral figure at the Allianz Arena last season. Of course, it remains to be seen whether the model of selling-to-buy remains at Anfield after recent seasons and the addition of Jorg Schmadtke, who succeeded Julian Ward as the sporting director at the beginning of June. A player who is attracting interest, who Reds will be able to catch at the U21 European Championships in Georgia and Romania, is the aforementioned Veiga. The Spanish youngster has courted interest from his homeland and from the Premier League with Chelsea and Newcastle joining Liverpool in the pursuit, according to reports. This summer could be the final one for him at his boyhood club and what a way it could be for him to sign off. His goalscoring exploits on the final day of the season not only saw them see off Barcelona but also stay in La Liga thanks to the win. Reports suggest he could be available for £32m this summer due to his release clause and with the Reds among the clubs front of the queue. In an ideal summer, this would be perfect business to continue the overhaul in midfield. and staked their claims for Liverpool starting positions in various parts of the season, the Liverpool-born man enjoyed an extended run in the first-team towards the end of the term as he featured in 11 successive games. Jones's rich vein of form coincided with the Reds securing Europa League football with an 11-game unbeaten run. It's believed Jordan Henderson will endure a slightly reduced role which adds three more options to the two that could join Mac Allister on Merseyside next season. with Virgil van Dijk and Joel Matip both in their 30s. A wildcard exit has been mooted for the Cameroon defender, who arrived as a free agent from Schalke in 2016, with a year remaining on his term and his injury problems at the back end of the season, he could be headed for an Anfield exit. There has been no indication of that so far this summer, however. Netherlands captain Van Dijk , he explained how the finish to the season plus the incoming signings have contributed to motivating him. For that reason, Levi Colwill, valued at £13m according to Transfer Markt, could be the right addition to the Liverpool backline. Having cut his teeth in the professional game during a loan spell with Huddersfield Town, Colwill shone in Brighton's historic season that saw them qualify for Europe for the first time in their history. Prising the defender away from Chelsea will be a difficult task but not entirely impossible as they look to deflate their bloated squad. The Londoners aren't shying away from business as they continue to monitor talents across the world but Liverpool targeting Colwill, who was called up to the England senior squad for the first time this month, would be a significant piece of business to inject youth alongside Konate in the backline. In the scenario that Liverpool can work their magic and get their hands on Thuram, Veiga and Colwill, it would be a big step to completing the first steps of the overhaul at Anfield with a dangerous blend already up front.","pubDate":"2023-06-19 00:00:00","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27091545.ece/ALTERNATES/s98/0_GettyImages-1492645875.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Intercontinental Cup 2023: গোটা টুর্নামেন্টে কোনও গোল না হজম করে চ্যাম্পিয়ন ভারত, সুনীলদের ঘিরে উৎসব","link":"https://bengali.abplive.com/photo-gallery/sports/intercontinental-cup-2023-india-beat-lebanon-after-a-huge-gap-of-46-years-see-in-photos-986538","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":null,"content":"দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে। গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ছবি সৌ - AIFF West Bengal News Live: সাতসকালে নামল আঁধার, আষাঢ়ের শুরুতে শহরজুড়ে প্রবল বৃষ্টি","pubDate":"2023-06-19 03:18:26","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/7df665bc59040c86f3206b0159e12580168714433857350_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Why it’s time for All Blacks to move on from stale Beauden Barrett - Chris Rattue’s winners and losers","link":"https://www.nzherald.co.nz/sport/why-its-time-for-all-blacks-to-move-on-from-stale-beauden-barrett-chris-rattues-winners-and-losers/T7ARI74EK5DHJNFPN7EKIBI3CA/","keywords":null,"creator":null,"video_url":null,"description":"OPINION: I’d like to find a way of leaving Barrett out of the World Cup squad.","content":"OPINION: LOSER: My fandom…Beauden Barrett’s All Black worth Beauden Barrett’s uninspiring performance for the Blues in Christchurch made a startling contrast to what was going on with the other team. The half-hearted Blues semifinal “effort” was summed up by Barrett’s early kickoffs that kept zooming straight to his brother Scott, who was in magnificent form (again) and clutched these tricky gifts with aplomb. Scott Barrett’s perfect early kickoff receptions provided the launching pad for an 80-minute Crusaders assault of rare quality. It was breathtaking. But why the heck keep kicking it to him? The Crusaders, full of men on the rise, were so unified and energetic. This was one of their finest hours, and they’ve had plenty of those. I’ve been among Beauden Barrett’s biggest fans over the years – at his best he was virtually beyond compare. But it’s getting harder to sustain the fandom even though Barrett Lite can still scuttle through a half gap. Advertisement Advertise with NZME. This is never going to happen but in all seriousness, I’d like to find a way of leaving Barrett out of the World Cup squad on the basis that his playmaking axis with Richie Mo’unga has struggled to find a truly happy place. It’s not a disaster, but it doesn’t have the feel of being a history-making winner either at a time when the All Blacks have melted back into the international pack. And it may be blocking a glorious way forward. There’s a lot of focus on a squad bolter of course, and some newcomers, but the big call for Ian Foster to make in terms of having faith in the future was moving on from the Beauden Barrett era. It’s hard to criticise him for not doing it, yet there’s staleness to Barrett’s game that has become very frustrating. Give Mo’unga the No 10 mantle without any confusion, and stick Will Jordan in his best place – fullback. Then let this little Crusaders combo loose on the world unencumbered…that’s my theory for the day. As for Scott Barrett, what a fantastic footballer he has been for a number of seasons, and is now proving to be a great Crusaders captain. And if his brother should prove me very wrong, well, I’d be happy about that. WINNER/LOSER: The Super Rugby final/music Damian McKenzie of the Chiefs in action against the Brumbies. Photo / Photosport An all New Zealand battle, full of All Blacks, with the champs having to travel to Hamilton. Super Rugby has reached a terrific conclusion. Advertisement Advertise with NZME. The Brumbies were very credible in the playoffs, but from a New Zealand perspective their presence would have dumbed down the final so it was a relief to see the Chiefs hold them off. The Chiefs aren’t firing on all cylinders though, and the Crusaders are. My money is firmly on the red and black machine. A final (forlorn) plea: please turn off that annoying music – at least for the big matches – at Waikato Stadium. LOSERS: The Blues and Leon MacDonald’s status Fair play to the mighty Crusaders. I never doubted they would win the Super Rugby semifinal in Christchurch. But even after decades of watching the Blues splutter along, it was still a shock to seem them play that badly. The Crusaders were missing half a team of All Blacks and won by zillion. HALF A TEAM OF ALL BLACKS. A ZILLION. Ultimately, the five-year Leon MacDonald/Tom Coventry coaching era at the Blues has gone almost nowhere. This semifinal performance was downright embarrassing, amongst the worst in the franchise’s often horrible history. If MacDonald wasn’t joining the All Black set up, a new coach was probably needed anyway after watching that dross. Yet MacDonald claimed: “There’s been a lot of progress.” No, there hasn’t, not after watching that semifinal debacle. WINNER: Toutai Kefu’s attitude Love the World Cup confidence, after the Tonga rugby coach declared “we have the cattle now”. Under rugby’s much-needed regulation change, the longtime Australian No 8′s squad includes former Wallabies Israel Folau and Adam Coleman, plus five former All Blacks. LOSER: England’s declaration England coach Brendon McCullum. Photo / Photosport Yes, we get it. Everyone is in love with Bazball. Coach Brendon McCullum and captain Ben Stokes can do no wrong even when the mistake is obvious. England’s first innings declaration in the opening Ashes cricket test, with ace batsman Joe Root still at the crease, was bizarre. They had a foot on Australia’s throat, then wandered off. But wait, there’s more. Legendary Kiwi captain McCullum was once lauded for promoting civilised cricket in a sea of sledging, but his England fast bowler Ollie Robinson must have missed the memo. Robinson farewelled century maker Usman Khawaja with a pathetic foul-mouthed rant (according to ‘social media lip readers’) at Edgbaston. The worst thing about modern sledging is it lacks the wit of old – it’s just silly when delivered by a boofhead like Robinson. To be fair to McCullum, his ‘spirit of cricket’ stance always appeared to be about the best way New Zealand could succeed and he was probably right. But the accolades for his attitude kept coming, and he didn’t exactly whack them to the boundary. Moving on…McCullum’s recalled England spinner Moeen Ali was fined for illegal application of spray to his hand during the Edgbaston battle. It’s not been a great match for the spirit of cricket. WINNER: Steve Hansen Surely rugby bosses will listen to this guy. The former All Black coach said the NRL was had superior product largely because league bosses listened to what fans want. “[League] is a better game to watch on TV than rugby is, because it’s not stop-start. They apply a lot of common sense to how they adjudicate things and make sure the game keeps some form of flow to it,” he said. “Our game over the last five years has got slower and slower and slower.” WINNER: Vinicius Junior Real Madrid's Vinicius Junior (right). Photo / AP Crowd abuse victim Vinicius Junior of Real Madrid has been given a top role on a Fifa anti-racism committee, while Brazil and Spain have organised a friendly match for the same cause. At least football has acted quickly this time after the Brazilian was abused by Valencia fans. The appalling racism problem runs so deep in football though that it’s difficult to see how it can be fully excised. But Vinicius is emerging as a leader in trying to force football to go the extra mile in combating this horror. LOSER: Jay Monahan The suddenly unpopular PGA commissioner went on medical leave after his major u-turn enabled a truce with the Saudi-backed LIV tour. It’s hard to see him coming back. WINNER: India’s Olympic wrestlers Brave and lengthy protest has led to the arrest of their federation’s boss on charges of sexual harassment and stalking. WINNERS: Warriors… …without even playing in the latest round. The already-battling Dragons – their opponents on Friday – are neck deep in a major drama with State of Origin playmaker Ben Hunt demanding a release from the Sydney league club, which is standing firm. And the two teams leading the chase for a top eight spot – the Roosters and Sea Eagles – continued to struggle with form and/or major injuries in the latest round of games. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 02:30:00","image_url":"https://www.nzherald.co.nz/resizer/O-1Kva758hCkMDFRxawXI5-PhSI=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/MFN3VLO4YNGD5PAOKMHL73MVFQ.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Lionel Messi, Saudi Arabia and the deal that paid off for both sides","link":"https://www.nzherald.co.nz/sport/lionel-messi-saudi-arabia-and-the-deal-that-paid-off-for-both-sides/F7BGK3B4TFHYLDN2W3LZFJZAIQ/","keywords":null,"creator":null,"video_url":null,"description":"New York Times: Contract offers glimpse at details of multimillion-dollar relationship.","content":"A contract between Messi and Saudi Arabia’s tourism authority offers a glimpse at the details of their multimillion-dollar relationship. As the sun set over a seemingly endless expanse of open sea, Lionel Messi took a seat at the edge of a boat, stretched out a leg and posed for the photograph that would announce the beginning of his public partnership with Saudi Arabia. The image, shared with Messi’s 400 million-plus followers on Instagram on May 9, 2022, was accompanied by a dual-language caption that read, “Discovering the Red Sea #VisitSaudi.” Hours earlier, he had been welcomed to the kingdom by Saudi Arabia’s tourism minister, who had boasted on Twitter that while it was Messi’s first visit to the country, “it will not be the last.” Messi, who is regarded perhaps as global football’s greatest player, was starting to cash in on the new partnership: His photo-op in the Red Sea likely earned him approximately US$2 million ($3.2 million), the first step in fulfilling his agreement with the kingdom that is worth millions more. View this post on Instagram A post shared by Leo Messi (@leomessi) The details of Messi’s role as a well-compensated pitchman for Saudi Arabia are contained in a previously undisclosed version of his contract with the tourism authority that was reviewed by the The New York Times. The contract shows that Messi could receive as much as 22.5 million euros, about $39.5 million, over three years for little actual work: a few commercial appearances, a handful of social media posts and some all-expenses-paid vacations to the kingdom with his family and children. He is expected to share images of those trips — marked with a Saudi-approved hashtag — with his vast online following. But the document also contains a condition important to Saudi officials: Messi cannot say anything that might “tarnish” Saudi Arabia, a country that has faced widespread criticism for its human rights record. Those details of the arrangement with Messi, who won the World Cup with Argentina in December, offer an inside glimpse of the oil-rich kingdom’s use of its wealth to enlist marquee athletes in its effort to burnish its global image. Saudi Arabia’s critics deride the strategy as sportswashing: using sports and sports figures to whitewash the country’s human rights record, its treatment of women, its killing of Washington Post columnist Jamal Khashoggi, and other authoritarian actions. Advertisement Advertise with NZME. For the past few years, Saudi Arabia has spent billions to take big stakes in professional sports: The purchase of a Premier League football team. Championship boxing matches. A stop on the Formula One auto racing schedule. And, most recently, a brazen incursion into professional golf. The kingdom has offered hundreds of millions of dollars more to lure Cristiano Ronaldo, Karim Benzema and dozens of other football stars to play in the country’s domestic league. Messi recently declined a similar offer, choosing instead to join Inter Miami of Major League Soccer in the United States. But there’s no sign so far that the decision has affected his relationship with the Saudis. Indeed, he has seemed eager to stay in their good graces. Related articles Sport Secrecy, cigars and a Venetian wedding: How the PGA Tour made a deal with Saudi Arabia 11 Jun 11:23 PM World Saudi Arabia relishes a triumph that transcends sports 07 Jun 11:10 PM Sport | Sailing Team NZ to make big decision after Am Cup rival's Saudi appeal rejected 31 May 03:05 AM In February 2021, just weeks after he signed his contract, Messi wrote a letter to Saudi’s tourism minister, apologising for being unable to make a scheduled visit. In the previously unreported letter, Messi addressed the tourism minister, Ahmed al-Khateeb, as “Your Excellency” and, in unusually flowery prose, expressed his “deepest regrets” for his absence. Messi was then playing for FC Barcelona, and he wrote that as “a sportsman,” he had obligations that were impossible to skip: a league game against Real Betis followed by a match in the Spanish cup. Messi was suspended from Paris St.-Germain after he took a trip to Saudi Arabia that was not authorized by the team. Photo / AP The Saudis got their visits eventually. The most recent came last month, a year after his first Saudi tourism post on Instagram, when Messi took a quick, midseason vacation to the kingdom — which, like all of his previous visits, would have yielded him a seven-figure payday under the terms of his Saudi tourism contract. By then, Messi had left Barcelona and was playing for the French team Paris St.-Germain. When he returned from his Saudi sojourn, the French club suspended him for what it deemed an unauthorized absence from training. Messi apologised to his team and its fans with an explanation that suggested the trip was not optional: “I couldn’t cancel it.” Until now, the details of Messi’s contract with the tourism authority have been a closely held secret. It is not clear if the contract reviewed by the Times is the current version of the deal. It was shared by someone with direct knowledge of the arrangement between Messi and the Saudis on the condition of anonymity because the person was not authorised to divulge details of the deal. The document, dated Jan. 1, 2021, was signed by Messi and his brother Rodrigo, who serves as his business manager, but it is not signed by Saudi officials. The terms outlined in the document are consistent with the way Messi has used his social media accounts to promote the kingdom, and also with the promotional visits he has made to the country. The contract is specific about Messi’s obligations, and about the money to be paid for fulfilling each one: Advertisement Advertise with NZME. About US$2 million ($3.2 million) for a minimum of one family vacation annually lasting five days, or alternately two annual vacations of three days each. The travel expenses and five-star accommodations were to be paid by the Saudi government for Messi and up to 20 family members and friends. Another US$2 million for promoting Saudi Arabia on his social media accounts 10 times a year, separately from the promotion of his vacations to the kingdom. About US$2 million more to participate in an annual tourism campaign. (He and the Saudi authority shared the first campaign, an elaborately shot desert video, in November.) Another US$2 million for charitable work and appearances. Few people were willing to discuss the terms of Messi’s deal. Pablo Negre Abello, who is responsible for Messi’s commercial deals, cited confidentiality clauses written into all of Messi’s contracts. Abello suggested that a Times reporter contact the tourism authority. Officials there did not respond to multiple requests for comment. Rayco García Cabrera, a former football player who brokered the meeting between Messi’s management and Saudi officials, including the minister of tourism, said the deal was worth “a small amount” compared with the huge salaries the country is paying stars like Ronaldo and Benzema. But, García said, Messi agreed to be a tourism spokesperson because “he believes in Saudi and the vision of Saudi.” “I was in the middle of this,” García added, “and I was so surprised when Messi didn’t ask for a huge amount.” García said he did not know the precise terms of the agreement. A review of Messi’s social media postings and travel show him seemingly fulfilling the terms of his contract. His Instagram account — with 470 million followers, it is one of the largest on the platform — has featured a regular stream of Saudi messaging and photographs. On his visit in May, Messi was photographed with his wife and children participating in a variety of family activities: petting horses with his sons, playing games at an arcade and sitting with a craft artist while holding a woven hat. In 2021, amid news reports linking Messi and Saudi Arabia, family members of Saudi dissidents urged the player to reject the endorsement offer that he eventually accepted. In an open letter, they pleaded with him by writing, “The Saudi regime wants to use you to launder its reputation.” Saudi officials have rejected that charge. Messi, meanwhile, has made no mention of it. Instead, he has expressed wonder at the natural beauty to be found in Saudi Arabia. One of Messi’s recent posts is a picture of the kingdom’s date palm groves and other natural attractions. The caption reads: “Who thought Saudi has so much green?” This article originally appeared in The New York Times. Written by: Karim Zidan and Tariq Panja ©2023 THE NEW YORK TIMES Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 02:24:10","image_url":"https://www.nzherald.co.nz/resizer/rJNSr08Q_FnLM7_dZkzeih5ucvc=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/ELJGZVAFOJH2FIB7MOVEWZTBBU.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"India vs Lebanon: লেবাননের বিরুদ্ধে ৪৬ বছরের শৃঙ্খল ভাঙল ভারত, গোল না খেয়ে চ্যাম্পিয়ন ব্লু টাইগার্স","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-india-beat-lebanon-after-a-huge-gap-of-46-years-know-in-details-986522","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।'             View this post on Instagram                       A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?  ","content":"ভুবনেশ্বর: দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' View this post on Instagram A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 02:11:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/12f7e6a19c050b77971ac53d83ef13fc168713963478250_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Зінченко: Україні зараз потрібна вогнепальна зброя","link":"https://champion.com.ua/football/2023/06/19/932039/zinchenko-ukrayini-zaraz-potribna-vohnepalna-zbroya","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Сполучене Королівство та США, які далеко, дають Україні багато зброї та можливість виграти війну з росією.Про це заявив Олександр Зінченко у токшоу \"Uncensored\" Пірса Моргана.\"Чи вірю у перемогу України? Я не вірю - я знаю. Я знаю, що ми переможемо. ...","content":"#Олександр Зінченко Джерело - Чемпіон . Сполучене Королівство та США, які далеко, дають Україні багато зброї та можливість виграти війну з росією. Про це заявив Олександр Зінченко у токшоу \"Uncensored\" Пірса Моргана. \"Чи вірю у перемогу України? Я не вірю - я знаю. Я знаю, що ми переможемо. Ми вже перемогли. Вони не очікували такого від нас. Вони думали, що за три дні проведуть парад у центрі Києва. Ми не можемо віддати свою Батьківщину, місце де ми народилися та зросли, й поїхати. Актуально: \"Люди, яких я знав, загинули\": велика розмова Олександра Зінченка з Пірсом Морганом Україні зараз потрібна вогнепальна зброя. Ми бачимо країни, наприклад, Сполучене Королівство та США, які далеко, але дають Україні багато зброї та можливість виграти цю війну. Мені дуже приємно бачити це, але в той же час, ми не можемо знати чи це все, чи не все, що вони роблять. Я хочу висловити величезну подяку всім, хто допомагає Україні та підтримує і продовжує підтримувати кожного дня\", - сказав Зінченко.","pubDate":"2023-06-19 02:00:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Sunil Chhetri: চ্যাম্পিয়ন হওয়ার পর স্ত্রীর হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল, ভাইরাল হল ছবি","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-sunil-chhetri-makes-his-wife-sonam-bhattacharya-wear-the-captain-s-armband-after-win-over-lebanon-986515","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: ভানুয়াটুর বিরুদ্ধে জয়সূচক গোলের পরই সুখবর দিয়েছিলেন সুনীল ছেত্রী (Sunil Chhetri)। জানিয়েছিলেন, তাঁর স্ত্রী সোনম সন্তানসম্ভবা। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup 2023) জেতার পর স্ত্রী সোনমের হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল। ভারতের জয়ের পরই ডাগ আউটে এসে দাঁড়িয়েছিলেন সোনম। সম্পর্কে যিনি কিংবদন্তি ফুটবলার সুব্রত ভট্টাচার্যের কন্যা। আর ম্যাচ শেষ হতেই বাংলার জামাই এগিয়ে গেলেন স্ত্রীর দিকে। তাঁকে আলিঙ্গন করলেন। হাত নিজের কোমরের পিছনে রাখলেন। যেন বোঝা গেল, উত্তেজনার বশে স্ত্রীর যাতে আঘাত না লেগে যায়, সে ব্যাপারে সতর্ক ভারত অধিনায়ক। তারপরই নিজের হাত থেকে ক্যাপ্টেন্স আর্মব্যান্ড খুলে পরিয়ে দিলেন সুনীল। সেই ছবি ভাইরাল হয়ে গেল সোশ্যাল মিডিয়ায়। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।'             View this post on Instagram                       A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই।  ম্যাচের সেরাও হয়েছেন তিনি। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?","content":"ভুবনেশ্বর: ভানুয়াটুর বিরুদ্ধে জয়সূচক গোলের পরই সুখবর দিয়েছিলেন সুনীল ছেত্রী (Sunil Chhetri)। জানিয়েছিলেন, তাঁর স্ত্রী সোনম সন্তানসম্ভবা। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup 2023) জেতার পর স্ত্রী সোনমের হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল। ভারতের জয়ের পরই ডাগ আউটে এসে দাঁড়িয়েছিলেন সোনম। সম্পর্কে যিনি কিংবদন্তি ফুটবলার সুব্রত ভট্টাচার্যের কন্যা। আর ম্যাচ শেষ হতেই বাংলার জামাই এগিয়ে গেলেন স্ত্রীর দিকে। তাঁকে আলিঙ্গন করলেন। হাত নিজের কোমরের পিছনে রাখলেন। যেন বোঝা গেল, উত্তেজনার বশে স্ত্রীর যাতে আঘাত না লেগে যায়, সে ব্যাপারে সতর্ক ভারত অধিনায়ক। তারপরই নিজের হাত থেকে ক্যাপ্টেন্স আর্মব্যান্ড খুলে পরিয়ে দিলেন সুনীল। সেই ছবি ভাইরাল হয়ে গেল সোশ্যাল মিডিয়ায়। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); View this post on Instagram A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই। ম্যাচের সেরাও হয়েছেন তিনি। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 01:40:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/d0d535ffe2c015b658ac549c48f6f294168713817347050_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Intercontinental Cup 2023: লেবাননকে হারানোর পরই সুনীলদের জন্য সুখবর, বিরাট অঙ্কের পুরস্কার অর্থের ঘোষণা","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-odisha-cm-naveen-patnaik-announces-1-crore-reward-for-india-who-beat-lebanon-2-0-986510","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ফিফা ব়্যাঙ্কিংয়ে দুই ধাপ এগিয়ে থাকা লেবাননের বিরুদ্ধে ফাইনালে ভারতের লড়াইটা যে হাড্ডাহাড্ডি হবে, সেই সম্ভাবনা ছিলই। হলও তাই। প্রথমার্ধে দুই দলই আক্রমণ শানালেও, গোলের দরজা খুলতে পারেননি কেউই। ভারতীয় দলের হয়ে প্রথমার্ধে উইং ধরে সাহাল আব্দুল সামাদ বেশ কিছু আক্রমণ গড়ে তুললেও লাভের লাভ কিছুই হয়নি। গোল করা তো দূর, ভারতীয় দল একটি শট লেবাননের তেকাঠির মধ্যেও রাখতে পারেনি। এমন পরিস্থিতিতে ভারতীয় অনুরাগীদের মনে গত ম্যাচের স্মৃতি ভেসে আসাটাই স্বাভাবিক। ফাইনালের আগে গ্রুপ পর্বে নিজেদের শেষ ম্যাচে লেবাননের বিরুদ্ধে গোলশূন্য ড্র করেছিল ভারত। গোলের সুযোগ হাতছাড়া করেছিলেন সুনীলও। কিন্তু দ্বিতীয়ার্ধ শুরু হতেই ছবিটা বদলে গেল। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই।   আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?  ","content":"ভুবনেশ্বর: লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ফিফা ব়্যাঙ্কিংয়ে দুই ধাপ এগিয়ে থাকা লেবাননের বিরুদ্ধে ফাইনালে ভারতের লড়াইটা যে হাড্ডাহাড্ডি হবে, সেই সম্ভাবনা ছিলই। হলও তাই। প্রথমার্ধে দুই দলই আক্রমণ শানালেও, গোলের দরজা খুলতে পারেননি কেউই। ভারতীয় দলের হয়ে প্রথমার্ধে উইং ধরে সাহাল আব্দুল সামাদ বেশ কিছু আক্রমণ গড়ে তুললেও লাভের লাভ কিছুই হয়নি। গোল করা তো দূর, ভারতীয় দল একটি শট লেবাননের তেকাঠির মধ্যেও রাখতে পারেনি। এমন পরিস্থিতিতে ভারতীয় অনুরাগীদের মনে গত ম্যাচের স্মৃতি ভেসে আসাটাই স্বাভাবিক। ফাইনালের আগে গ্রুপ পর্বে নিজেদের শেষ ম্যাচে লেবাননের বিরুদ্ধে গোলশূন্য ড্র করেছিল ভারত। গোলের সুযোগ হাতছাড়া করেছিলেন সুনীলও। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); কিন্তু দ্বিতীয়ার্ধ শুরু হতেই ছবিটা বদলে গেল। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 01:23:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/d418046c7fbbfef150786854ed9f92f3168713774940750_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Western Springs Football Club and top female players reach agreement over gender equity issues","link":"https://www.nzherald.co.nz/sport/western-springs-football-club-and-top-female-players-reach-agreement-over-gender-equity-issues/WY7HB6MXJ5DBDMCOXQV4VWRBLI/","keywords":null,"creator":null,"video_url":null,"description":"The club apologised for failures in communication.","content":"Senior female players at Western Springs Football Club have reached an agreement with the board on plans to address their concerns about gender equity at the club. Following a protracted mediation which began on 30 May, a joint statement released today by the top Auckland club and the Premier Women’s Team said: “We agreed a way forward that’s resolved many of the concerns raised by the players and their supporters and the team will keep playing at Western Springs.” In the statement posted on their website, the club acknowledged there had “been issues” and apologised for “failures in communication and understanding that contributed to the situation”. “Everyone involved committed to the mediation process in good faith, which led to a successful resolution.” Advertisement Advertise with NZME. It comes after an ongoing Herald investigation into the concerns of senior women’s players over inequality disputes at one of the country’s top football clubs. The Herald revealed: Player and staff walkouts ; details of funding the club received for the upcoming Fifa Women’s World Cup ; allegations of “highly misogynistic behaviour”; concerns about a phallic logo; unequal spending between the top male and female squads. Since the Herald first broke the story on 13 May, club leaders have not responded to Herald requests for comment. Today’s statement said: “The club respects the stand taken by the players and the opportunity it’s provided to learn and further improve our approach to women’s football.” Advertisement Advertise with NZME. The statement said a number of changes have been agreed to “which are all about making sure Western Springs sets the standard for not just football clubs in Auckland but for sports clubs nationwide”. The changes included: The Premier Women’s teams’ expense budget will be increased to be equal with the Premier Men; A process is underway to recruit a new Head of Girls’ and Women’s Football; Changes to the constitution will be recommended to embed a commitment to equality, diversity and player representation across their committees; An appointment process is underway for an independent advisor to develop a Girls’ and Women’s Programme Development Strategy; The club will increase efforts to attract more women to Senior and Executive Committees; The executive agreed to develop a clear pathway for raising and resolving members’ concerns and issues. The statement noted the club’s Junior Committee now has 50 per cent female representation. When the Herald first broke the story, the club’s website listed three women among the 10 people on that board. The club has called in Kereyn Smith, former CEO of the NZ Olympic committee, who will act as Transition Director to implement these changes and will also act as a conduit between the Women’s Premier team and the club. Related articles Sport Western Springs' phallic logo to be replaced as special meeting called 12 Jun 12:35 AM Sport Documents reveal gender-equity funding conditions for Western Springs Football Club 03 Jun 03:00 AM Sport Western Springs women's team take to the pitch again - in different kit 29 May 05:30 AM Sport 'I felt shame': Mass exodus at top football club after women players 'disrespected' 12 May 05:00 PM They will also have the support of Northern Region Football and New Zealand Football. Western Springs women who were runners-up in the New Zealand National League last year, played four matches while mediation underway. Two were regular league games and two Kate Sheppard Cup matches – all of which they won. Western Springs premier women's team played two games in black, unbranded kit during the dispute. Photo / Alex Burton The club provided an unbranded kit for two of those games after the players felt uncomfortable wearing a phallic-looking logo. The Herald last week reported the club had called in an artist to redesign the 34-year-old emblem . Today’s post-mediation statement did not mention the logo. The statement said, “despite our size as one of the largest sporting clubs in New Zealand, we’re largely run by volunteers”. “We recognise this has been an unsettling time for members.” Advertisement Advertise with NZME. The club thanked their members for their patience and assured them they’ll be kept informed as the changes progress. “We look forward to returning focus to playing football – and of course, we’d like to see all Western Springs whānau supporting the Premier Women’s team here at Seddon and away.” The players said in a separate statement they were relieved to have reached an agreement with the club – thanking and acknowledging the club’s executives on the changes made. “Pushing for change has been tough on us as a playing group and has taken a personal toll, but we’ve gained strength from each other and have stayed tight as a group,” the players said. “We’ve also had amazing support from men and women around us, particularly in the legal space with Maria Dew KC and Maria Clarke and we couldn’t have achieved this without their help.” The players were “really proud” of what they achieved, adding: “We hope that WSAFC can lead the way for other clubs to ensure equity and fairness and a culture which supports and grows women’s teams. “We can’t wait to concentrate on football knowing that our voices have been heard and that other women may be inspired to stand up for what they believe in.” Advertisement Advertise with NZME. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 00:47:00","image_url":"https://www.nzherald.co.nz/resizer/SX7uw8_MOUxzxp6L1u9BHndj1-I=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/ZNJEQXBDONCCBGWLLFYCVBMGYQ.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Tom Brady expresses importance of his kids in life on Father's Day - “Being a Dad is the best thing in my life”","link":"https://www.sportskeeda.com/nfl/news-tom-brady-expresses-importance-kids-life-father-s-day-being-dad-best-thing-in-my-life","keywords":["NFL"],"creator":["Rit Nanda"],"video_url":null,"description":null,"content":"Tom Brady was feeling sentimental on Father's Day as he expressed his gratitude to his own father and his own journey as a father. He called his children his angels, in whose growth he takes immense pleasure. Despite his many ahievements on the field, he said being a Dad is the best thing happening in his life. He posted pictures of himself with his dad and his children. Writing on Instagram, he said: He continued with thanking his father and all that he learned from him and how he is able to pass that on to his own children. He said that family is what matters the most to him: Tom Brady finished by saying how proud he is of his children and that their good qualities are a reflection of everyone who raises them: Instagram Post Tom Brady's personal life has been under scrutiny over the past year. He famously retired and then unretired, coming back to play for the Tampa Bay Buccaneers for one extra season last year. It was also when his marriage with Gisele Bundchen fell apart after more than a decade being together. There were insinuations that it happened because he was putting his career over his family. But now that he is retired , it seems he is finding his joy beyond his career in football. That stems from his own children and his parents, who have taken the void left behind from his stepping away from football. How has Nikola Jokic changed the NBA forever? His crazy life and career is one for the ages! Poll : 0 votes Quick Links","pubDate":"2023-06-19 00:01:05","image_url":"https://staticc.sportskeeda.com/editor/2023/06/5063f-16871132097418-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Liverpool need £95m to complete dream summer transfer window with three signings","link":"https://www.liverpoolecho.co.uk/sport/football/transfer-news/liverpool-need-95m-complete-dream-27147387","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool have already identified Khephren Thuram as a target with Gabri Veiga and Levi Colwill also among the players monitored","content":"The transfer window is barely a week old and Liverpool have a number of things on their agenda as they look to bolster their squad this summer. deal was concluded without a hitch as the Brighton & Hove Albion midfielder signed on to become the latest Argentine to line up at Anfield. The objective doesn't stop there as continue to eye further improvements to their squad ahead of the players reuniting at the beginning of July for their 2023-24 Premier League and Europa League preparations. After their disappointing campaign last time out, the focus is on defensive and midfield acquisitions as the goalkeeper and attacking options remain stocked. Should Caoimhin Kelleher exit Anfield this summer, the Reds may have their arms twisted into movement between the sticks. But the priority remains in the engine room as well as a left-sided defender, should one become available. Questions were sparked throughout the campaign about the quality of Liverpool's midfield as they were exposed during their difficult spells before dropping to their lowest Premier League finish since 2016. Options in midfield were few and far between with injuries hampering options as well as lack of investment in recent years. In the lowest finish of reign in a full Premier League calendar, there hasn't been a season with more chastening defeats as the Reds fell off the boil just a matter of months after chasing the quadruple. By comparison to recent seasons, there is no financial cushion from qualifying for the Champions League or prize money from their runs in various other competitions. They scored a reported £105.7m from their pursuit of a seventh European crown at the end of the 2021/22 term with an estimated £71m received from their last-16 exit to Real Madrid in March. The German has already argued that the lack of European football can't be used as an excuse to not open their wallets in the transfer window. \"It is a fantastic club with a really good football team and even better, hopefully, next year. I've barely faced the situation where you talk with a player and everything is great and he says, 'okay see you if...' That doesn't happen really often,\" he said in May. \"We are still Liverpool and we are really attractive for a lot of players, we should not forget that. That's why I'm not concerned about that fact. \"Everything is of course more difficult without the Champions League, especially in long term, and we have to not do these things more often. \"But apart from that, it's okay the situation we are in from a talking point of view and convincing point of view.\" The ECHO understands that the with a number of factors contributing to that, none more so than the departure of engine room options James Milner, Alex Oxlade-Chamberlain and Naby Keita - who both struggled with injuries in the last 18 months of their Liverpool careers. Khephren Thuram is under real consideration, it is understood. , Thuram, who has There is a possibility that the 22-year-old will be holding the Liverpool shirt before the start of the Premier League season against Chelsea. According to his current market value is said to be in the region of £27.3m. He is likely to cost more than the reported £35m for Mac Allister - likely to be in the region of £50m - but should Thuram express his intentions of leaving the Allianz Riviera this summer, it might force Nice to part ways. Meanwhile, Borussia Monchengladbach's Manu Kone and Gabri Veiga are also on the list, while Southampton's 19-year-old Romeo Lavia has his admirers but Arsenal have reportedly steered ahead in the race for the Belgian. Ryan Gravenberch emerged as a key target earlier this year and reports claimed in April that Liverpool met with the player's agent, Rafaela Pimenta, who also represents Thuram. Although, there is a reluctance to sell from Bayern Munich, despite the Ajax academy prospect being a peripheral figure at the Allianz Arena last season. Of course, it remains to be seen whether the model of selling-to-buy remains at Anfield after recent seasons and the addition of Jorg Schmadtke, who succeeded Julian Ward as the sporting director at the beginning of June. A player who is attracting interest, who Reds will be able to catch at the U21 European Championships in Georgia and Romania, is the aforementioned Veiga. The Spanish youngster has courted interest from his homeland and from the Premier League with Chelsea and Newcastle joining Liverpool in the pursuit, according to reports. This summer could be the final one for him at his boyhood club and what a way it could be for him to sign off. His goalscoring exploits on the final day of the season not only saw them see off Barcelona but also stay in La Liga thanks to the win. Reports suggest he could be available for £32m this summer due to his release clause and with the Reds among the clubs front of the queue. In an ideal summer, this would be perfect business to continue the overhaul in midfield. and staked their claims for Liverpool starting positions in various parts of the season, the Liverpool-born man enjoyed an extended run in the first-team towards the end of the term as he featured in 11 successive games. Jones's rich vein of form coincided with the Reds securing Europa League football with an 11-game unbeaten run. It's believed Jordan Henderson will endure a slightly reduced role which adds three more options to the two that could join Mac Allister on Merseyside next season. with Virgil van Dijk and Joel Matip both in their 30s. A wildcard exit has been mooted for the Cameroon defender, who arrived as a free agent from Schalke in 2016, with a year remaining on his term and his injury problems at the back end of the season, he could be headed for an Anfield exit. There has been no indication of that so far this summer, however. Netherlands captain Van Dijk , he explained how the finish to the season plus the incoming signings have contributed to motivating him. For that reason, Levi Colwill, valued at £13m according to Transfer Markt, could be the right addition to the Liverpool backline. Having cut his teeth in the professional game during a loan spell with Huddersfield Town, Colwill shone in Brighton's historic season that saw them qualify for Europe for the first time in their history. Prising the defender away from Chelsea will be a difficult task but not entirely impossible as they look to deflate their bloated squad. The Londoners aren't shying away from business as they continue to monitor talents across the world but Liverpool targeting Colwill, who was called up to the England senior squad for the first time this month, would be a significant piece of business to inject youth alongside Konate in the backline. In the scenario that Liverpool can work their magic and get their hands on Thuram, Veiga and Colwill, it would be a big step to completing the first steps of the overhaul at Anfield with a dangerous blend already up front.","pubDate":"2023-06-19 00:00:00","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27091545.ece/ALTERNATES/s98/0_GettyImages-1492645875.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Intercontinental Cup 2023: গোটা টুর্নামেন্টে কোনও গোল না হজম করে চ্যাম্পিয়ন ভারত, সুনীলদের ঘিরে উৎসব","link":"https://bengali.abplive.com/photo-gallery/sports/intercontinental-cup-2023-india-beat-lebanon-after-a-huge-gap-of-46-years-see-in-photos-986538","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":null,"content":"দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে। গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ছবি সৌ - AIFF West Bengal News Live: সাতসকালে নামল আঁধার, আষাঢ়ের শুরুতে শহরজুড়ে প্রবল বৃষ্টি","pubDate":"2023-06-19 03:18:26","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/7df665bc59040c86f3206b0159e12580168714433857350_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Why it’s time for All Blacks to move on from stale Beauden Barrett - Chris Rattue’s winners and losers","link":"https://www.nzherald.co.nz/sport/why-its-time-for-all-blacks-to-move-on-from-stale-beauden-barrett-chris-rattues-winners-and-losers/T7ARI74EK5DHJNFPN7EKIBI3CA/","keywords":null,"creator":null,"video_url":null,"description":"OPINION: I’d like to find a way of leaving Barrett out of the World Cup squad.","content":"OPINION: LOSER: My fandom…Beauden Barrett’s All Black worth Beauden Barrett’s uninspiring performance for the Blues in Christchurch made a startling contrast to what was going on with the other team. The half-hearted Blues semifinal “effort” was summed up by Barrett’s early kickoffs that kept zooming straight to his brother Scott, who was in magnificent form (again) and clutched these tricky gifts with aplomb. Scott Barrett’s perfect early kickoff receptions provided the launching pad for an 80-minute Crusaders assault of rare quality. It was breathtaking. But why the heck keep kicking it to him? The Crusaders, full of men on the rise, were so unified and energetic. This was one of their finest hours, and they’ve had plenty of those. I’ve been among Beauden Barrett’s biggest fans over the years – at his best he was virtually beyond compare. But it’s getting harder to sustain the fandom even though Barrett Lite can still scuttle through a half gap. Advertisement Advertise with NZME. This is never going to happen but in all seriousness, I’d like to find a way of leaving Barrett out of the World Cup squad on the basis that his playmaking axis with Richie Mo’unga has struggled to find a truly happy place. It’s not a disaster, but it doesn’t have the feel of being a history-making winner either at a time when the All Blacks have melted back into the international pack. And it may be blocking a glorious way forward. There’s a lot of focus on a squad bolter of course, and some newcomers, but the big call for Ian Foster to make in terms of having faith in the future was moving on from the Beauden Barrett era. It’s hard to criticise him for not doing it, yet there’s staleness to Barrett’s game that has become very frustrating. Give Mo’unga the No 10 mantle without any confusion, and stick Will Jordan in his best place – fullback. Then let this little Crusaders combo loose on the world unencumbered…that’s my theory for the day. As for Scott Barrett, what a fantastic footballer he has been for a number of seasons, and is now proving to be a great Crusaders captain. And if his brother should prove me very wrong, well, I’d be happy about that. WINNER/LOSER: The Super Rugby final/music Damian McKenzie of the Chiefs in action against the Brumbies. Photo / Photosport An all New Zealand battle, full of All Blacks, with the champs having to travel to Hamilton. Super Rugby has reached a terrific conclusion. Advertisement Advertise with NZME. The Brumbies were very credible in the playoffs, but from a New Zealand perspective their presence would have dumbed down the final so it was a relief to see the Chiefs hold them off. The Chiefs aren’t firing on all cylinders though, and the Crusaders are. My money is firmly on the red and black machine. A final (forlorn) plea: please turn off that annoying music – at least for the big matches – at Waikato Stadium. LOSERS: The Blues and Leon MacDonald’s status Fair play to the mighty Crusaders. I never doubted they would win the Super Rugby semifinal in Christchurch. But even after decades of watching the Blues splutter along, it was still a shock to seem them play that badly. The Crusaders were missing half a team of All Blacks and won by zillion. HALF A TEAM OF ALL BLACKS. A ZILLION. Ultimately, the five-year Leon MacDonald/Tom Coventry coaching era at the Blues has gone almost nowhere. This semifinal performance was downright embarrassing, amongst the worst in the franchise’s often horrible history. If MacDonald wasn’t joining the All Black set up, a new coach was probably needed anyway after watching that dross. Yet MacDonald claimed: “There’s been a lot of progress.” No, there hasn’t, not after watching that semifinal debacle. WINNER: Toutai Kefu’s attitude Love the World Cup confidence, after the Tonga rugby coach declared “we have the cattle now”. Under rugby’s much-needed regulation change, the longtime Australian No 8′s squad includes former Wallabies Israel Folau and Adam Coleman, plus five former All Blacks. LOSER: England’s declaration England coach Brendon McCullum. Photo / Photosport Yes, we get it. Everyone is in love with Bazball. Coach Brendon McCullum and captain Ben Stokes can do no wrong even when the mistake is obvious. England’s first innings declaration in the opening Ashes cricket test, with ace batsman Joe Root still at the crease, was bizarre. They had a foot on Australia’s throat, then wandered off. But wait, there’s more. Legendary Kiwi captain McCullum was once lauded for promoting civilised cricket in a sea of sledging, but his England fast bowler Ollie Robinson must have missed the memo. Robinson farewelled century maker Usman Khawaja with a pathetic foul-mouthed rant (according to ‘social media lip readers’) at Edgbaston. The worst thing about modern sledging is it lacks the wit of old – it’s just silly when delivered by a boofhead like Robinson. To be fair to McCullum, his ‘spirit of cricket’ stance always appeared to be about the best way New Zealand could succeed and he was probably right. But the accolades for his attitude kept coming, and he didn’t exactly whack them to the boundary. Moving on…McCullum’s recalled England spinner Moeen Ali was fined for illegal application of spray to his hand during the Edgbaston battle. It’s not been a great match for the spirit of cricket. WINNER: Steve Hansen Surely rugby bosses will listen to this guy. The former All Black coach said the NRL was had superior product largely because league bosses listened to what fans want. “[League] is a better game to watch on TV than rugby is, because it’s not stop-start. They apply a lot of common sense to how they adjudicate things and make sure the game keeps some form of flow to it,” he said. “Our game over the last five years has got slower and slower and slower.” WINNER: Vinicius Junior Real Madrid's Vinicius Junior (right). Photo / AP Crowd abuse victim Vinicius Junior of Real Madrid has been given a top role on a Fifa anti-racism committee, while Brazil and Spain have organised a friendly match for the same cause. At least football has acted quickly this time after the Brazilian was abused by Valencia fans. The appalling racism problem runs so deep in football though that it’s difficult to see how it can be fully excised. But Vinicius is emerging as a leader in trying to force football to go the extra mile in combating this horror. LOSER: Jay Monahan The suddenly unpopular PGA commissioner went on medical leave after his major u-turn enabled a truce with the Saudi-backed LIV tour. It’s hard to see him coming back. WINNER: India’s Olympic wrestlers Brave and lengthy protest has led to the arrest of their federation’s boss on charges of sexual harassment and stalking. WINNERS: Warriors… …without even playing in the latest round. The already-battling Dragons – their opponents on Friday – are neck deep in a major drama with State of Origin playmaker Ben Hunt demanding a release from the Sydney league club, which is standing firm. And the two teams leading the chase for a top eight spot – the Roosters and Sea Eagles – continued to struggle with form and/or major injuries in the latest round of games. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 02:30:00","image_url":"https://www.nzherald.co.nz/resizer/O-1Kva758hCkMDFRxawXI5-PhSI=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/MFN3VLO4YNGD5PAOKMHL73MVFQ.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Lionel Messi, Saudi Arabia and the deal that paid off for both sides","link":"https://www.nzherald.co.nz/sport/lionel-messi-saudi-arabia-and-the-deal-that-paid-off-for-both-sides/F7BGK3B4TFHYLDN2W3LZFJZAIQ/","keywords":null,"creator":null,"video_url":null,"description":"New York Times: Contract offers glimpse at details of multimillion-dollar relationship.","content":"A contract between Messi and Saudi Arabia’s tourism authority offers a glimpse at the details of their multimillion-dollar relationship. As the sun set over a seemingly endless expanse of open sea, Lionel Messi took a seat at the edge of a boat, stretched out a leg and posed for the photograph that would announce the beginning of his public partnership with Saudi Arabia. The image, shared with Messi’s 400 million-plus followers on Instagram on May 9, 2022, was accompanied by a dual-language caption that read, “Discovering the Red Sea #VisitSaudi.” Hours earlier, he had been welcomed to the kingdom by Saudi Arabia’s tourism minister, who had boasted on Twitter that while it was Messi’s first visit to the country, “it will not be the last.” Messi, who is regarded perhaps as global football’s greatest player, was starting to cash in on the new partnership: His photo-op in the Red Sea likely earned him approximately US$2 million ($3.2 million), the first step in fulfilling his agreement with the kingdom that is worth millions more. View this post on Instagram A post shared by Leo Messi (@leomessi) The details of Messi’s role as a well-compensated pitchman for Saudi Arabia are contained in a previously undisclosed version of his contract with the tourism authority that was reviewed by the The New York Times. The contract shows that Messi could receive as much as 22.5 million euros, about $39.5 million, over three years for little actual work: a few commercial appearances, a handful of social media posts and some all-expenses-paid vacations to the kingdom with his family and children. He is expected to share images of those trips — marked with a Saudi-approved hashtag — with his vast online following. But the document also contains a condition important to Saudi officials: Messi cannot say anything that might “tarnish” Saudi Arabia, a country that has faced widespread criticism for its human rights record. Those details of the arrangement with Messi, who won the World Cup with Argentina in December, offer an inside glimpse of the oil-rich kingdom’s use of its wealth to enlist marquee athletes in its effort to burnish its global image. Saudi Arabia’s critics deride the strategy as sportswashing: using sports and sports figures to whitewash the country’s human rights record, its treatment of women, its killing of Washington Post columnist Jamal Khashoggi, and other authoritarian actions. Advertisement Advertise with NZME. For the past few years, Saudi Arabia has spent billions to take big stakes in professional sports: The purchase of a Premier League football team. Championship boxing matches. A stop on the Formula One auto racing schedule. And, most recently, a brazen incursion into professional golf. The kingdom has offered hundreds of millions of dollars more to lure Cristiano Ronaldo, Karim Benzema and dozens of other football stars to play in the country’s domestic league. Messi recently declined a similar offer, choosing instead to join Inter Miami of Major League Soccer in the United States. But there’s no sign so far that the decision has affected his relationship with the Saudis. Indeed, he has seemed eager to stay in their good graces. Related articles Sport Secrecy, cigars and a Venetian wedding: How the PGA Tour made a deal with Saudi Arabia 11 Jun 11:23 PM World Saudi Arabia relishes a triumph that transcends sports 07 Jun 11:10 PM Sport | Sailing Team NZ to make big decision after Am Cup rival's Saudi appeal rejected 31 May 03:05 AM In February 2021, just weeks after he signed his contract, Messi wrote a letter to Saudi’s tourism minister, apologising for being unable to make a scheduled visit. In the previously unreported letter, Messi addressed the tourism minister, Ahmed al-Khateeb, as “Your Excellency” and, in unusually flowery prose, expressed his “deepest regrets” for his absence. Messi was then playing for FC Barcelona, and he wrote that as “a sportsman,” he had obligations that were impossible to skip: a league game against Real Betis followed by a match in the Spanish cup. Messi was suspended from Paris St.-Germain after he took a trip to Saudi Arabia that was not authorized by the team. Photo / AP The Saudis got their visits eventually. The most recent came last month, a year after his first Saudi tourism post on Instagram, when Messi took a quick, midseason vacation to the kingdom — which, like all of his previous visits, would have yielded him a seven-figure payday under the terms of his Saudi tourism contract. By then, Messi had left Barcelona and was playing for the French team Paris St.-Germain. When he returned from his Saudi sojourn, the French club suspended him for what it deemed an unauthorized absence from training. Messi apologised to his team and its fans with an explanation that suggested the trip was not optional: “I couldn’t cancel it.” Until now, the details of Messi’s contract with the tourism authority have been a closely held secret. It is not clear if the contract reviewed by the Times is the current version of the deal. It was shared by someone with direct knowledge of the arrangement between Messi and the Saudis on the condition of anonymity because the person was not authorised to divulge details of the deal. The document, dated Jan. 1, 2021, was signed by Messi and his brother Rodrigo, who serves as his business manager, but it is not signed by Saudi officials. The terms outlined in the document are consistent with the way Messi has used his social media accounts to promote the kingdom, and also with the promotional visits he has made to the country. The contract is specific about Messi’s obligations, and about the money to be paid for fulfilling each one: Advertisement Advertise with NZME. About US$2 million ($3.2 million) for a minimum of one family vacation annually lasting five days, or alternately two annual vacations of three days each. The travel expenses and five-star accommodations were to be paid by the Saudi government for Messi and up to 20 family members and friends. Another US$2 million for promoting Saudi Arabia on his social media accounts 10 times a year, separately from the promotion of his vacations to the kingdom. About US$2 million more to participate in an annual tourism campaign. (He and the Saudi authority shared the first campaign, an elaborately shot desert video, in November.) Another US$2 million for charitable work and appearances. Few people were willing to discuss the terms of Messi’s deal. Pablo Negre Abello, who is responsible for Messi’s commercial deals, cited confidentiality clauses written into all of Messi’s contracts. Abello suggested that a Times reporter contact the tourism authority. Officials there did not respond to multiple requests for comment. Rayco García Cabrera, a former football player who brokered the meeting between Messi’s management and Saudi officials, including the minister of tourism, said the deal was worth “a small amount” compared with the huge salaries the country is paying stars like Ronaldo and Benzema. But, García said, Messi agreed to be a tourism spokesperson because “he believes in Saudi and the vision of Saudi.” “I was in the middle of this,” García added, “and I was so surprised when Messi didn’t ask for a huge amount.” García said he did not know the precise terms of the agreement. A review of Messi’s social media postings and travel show him seemingly fulfilling the terms of his contract. His Instagram account — with 470 million followers, it is one of the largest on the platform — has featured a regular stream of Saudi messaging and photographs. On his visit in May, Messi was photographed with his wife and children participating in a variety of family activities: petting horses with his sons, playing games at an arcade and sitting with a craft artist while holding a woven hat. In 2021, amid news reports linking Messi and Saudi Arabia, family members of Saudi dissidents urged the player to reject the endorsement offer that he eventually accepted. In an open letter, they pleaded with him by writing, “The Saudi regime wants to use you to launder its reputation.” Saudi officials have rejected that charge. Messi, meanwhile, has made no mention of it. Instead, he has expressed wonder at the natural beauty to be found in Saudi Arabia. One of Messi’s recent posts is a picture of the kingdom’s date palm groves and other natural attractions. The caption reads: “Who thought Saudi has so much green?” This article originally appeared in The New York Times. Written by: Karim Zidan and Tariq Panja ©2023 THE NEW YORK TIMES Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 02:24:10","image_url":"https://www.nzherald.co.nz/resizer/rJNSr08Q_FnLM7_dZkzeih5ucvc=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/ELJGZVAFOJH2FIB7MOVEWZTBBU.jpg","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"India vs Lebanon: লেবাননের বিরুদ্ধে ৪৬ বছরের শৃঙ্খল ভাঙল ভারত, গোল না খেয়ে চ্যাম্পিয়ন ব্লু টাইগার্স","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-india-beat-lebanon-after-a-huge-gap-of-46-years-know-in-details-986522","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।'             View this post on Instagram                       A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?  ","content":"ভুবনেশ্বর: দীর্ঘ ৪৬ বছরের শৃঙ্খল ভাঙল ভারত (Indian Football Team)। ৪৬ বছর পর ফুটবল মাঠে লেবাননকে হারাল ভারতীয় দল। জিতে নিল ইন্টারকন্টিনেন্টাল কাপ। ২০১৮ সালে নেহরু কাপের আদলে চারদেশীয় ইন্টারকন্টিনেন্টাল কাপের আয়োজন করেছিল সর্বভারতীয় ফুটবল সংস্থা। প্রথমবারই টুর্নামেন্টে চ্যাম্পিয়ন হয়েছিল ভারত। ২০১৯ সালে অবশ্য ভারতের মাটি থেকে ট্রফি জিতে নিয়ে যায় উত্তর কোরিয়া। করোনা অতিমারীর প্রাদুর্ভাবে এরপর তিন বছর টুর্নামেন্ট বন্ধ ছিল। এবার ফের আয়োজিত হয়েছিল ইন্টারকন্টিনেন্টাল কাপ। আর রবিবারের ফাইনালে লেবাননকে ২-০ গোলে হারিয়ে ট্রফি নিজেদের দেশে ফেরাল ভারত। টুর্নামেন্টের গ্রুপ পর্বের ম্যাচেও ভারত ও লেবানন মুখোমুখি হয়েছিল। কিন্তু সেই ম্যাচ গোলশূন্য় ড্র হয়। নিয়মরক্ষার ম্যাচ ছিল। কোনও দলই গোল করতে পারেনি। রবিবারের ফাইনালে অবশ্য দ্বিতীয়ার্ধের ঝড়ে প্রতিপক্ষকে তছনছ করে দিল ভারত। কোনও গোল না খেয়ে চ্যাম্পিয়ন হল ভারত। দেশের মাটিতে টানা ৬ ম্যাচ কোনও গোল হজম করেনি ভারতের রক্ষণভাগ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' View this post on Instagram A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 02:11:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/12f7e6a19c050b77971ac53d83ef13fc168713963478250_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Зінченко: Україні зараз потрібна вогнепальна зброя","link":"https://champion.com.ua/football/2023/06/19/932039/zinchenko-ukrayini-zaraz-potribna-vohnepalna-zbroya","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Сполучене Королівство та США, які далеко, дають Україні багато зброї та можливість виграти війну з росією.Про це заявив Олександр Зінченко у токшоу \"Uncensored\" Пірса Моргана.\"Чи вірю у перемогу України? Я не вірю - я знаю. Я знаю, що ми переможемо. ...","content":"#Олександр Зінченко Джерело - Чемпіон . Сполучене Королівство та США, які далеко, дають Україні багато зброї та можливість виграти війну з росією. Про це заявив Олександр Зінченко у токшоу \"Uncensored\" Пірса Моргана. \"Чи вірю у перемогу України? Я не вірю - я знаю. Я знаю, що ми переможемо. Ми вже перемогли. Вони не очікували такого від нас. Вони думали, що за три дні проведуть парад у центрі Києва. Ми не можемо віддати свою Батьківщину, місце де ми народилися та зросли, й поїхати. Актуально: \"Люди, яких я знав, загинули\": велика розмова Олександра Зінченка з Пірсом Морганом Україні зараз потрібна вогнепальна зброя. Ми бачимо країни, наприклад, Сполучене Королівство та США, які далеко, але дають Україні багато зброї та можливість виграти цю війну. Мені дуже приємно бачити це, але в той же час, ми не можемо знати чи це все, чи не все, що вони роблять. Я хочу висловити величезну подяку всім, хто допомагає Україні та підтримує і продовжує підтримувати кожного дня\", - сказав Зінченко.","pubDate":"2023-06-19 02:00:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Sunil Chhetri: চ্যাম্পিয়ন হওয়ার পর স্ত্রীর হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল, ভাইরাল হল ছবি","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-sunil-chhetri-makes-his-wife-sonam-bhattacharya-wear-the-captain-s-armband-after-win-over-lebanon-986515","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: ভানুয়াটুর বিরুদ্ধে জয়সূচক গোলের পরই সুখবর দিয়েছিলেন সুনীল ছেত্রী (Sunil Chhetri)। জানিয়েছিলেন, তাঁর স্ত্রী সোনম সন্তানসম্ভবা। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup 2023) জেতার পর স্ত্রী সোনমের হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল। ভারতের জয়ের পরই ডাগ আউটে এসে দাঁড়িয়েছিলেন সোনম। সম্পর্কে যিনি কিংবদন্তি ফুটবলার সুব্রত ভট্টাচার্যের কন্যা। আর ম্যাচ শেষ হতেই বাংলার জামাই এগিয়ে গেলেন স্ত্রীর দিকে। তাঁকে আলিঙ্গন করলেন। হাত নিজের কোমরের পিছনে রাখলেন। যেন বোঝা গেল, উত্তেজনার বশে স্ত্রীর যাতে আঘাত না লেগে যায়, সে ব্যাপারে সতর্ক ভারত অধিনায়ক। তারপরই নিজের হাত থেকে ক্যাপ্টেন্স আর্মব্যান্ড খুলে পরিয়ে দিলেন সুনীল। সেই ছবি ভাইরাল হয়ে গেল সোশ্যাল মিডিয়ায়। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।'             View this post on Instagram                       A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই।  ম্যাচের সেরাও হয়েছেন তিনি। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?","content":"ভুবনেশ্বর: ভানুয়াটুর বিরুদ্ধে জয়সূচক গোলের পরই সুখবর দিয়েছিলেন সুনীল ছেত্রী (Sunil Chhetri)। জানিয়েছিলেন, তাঁর স্ত্রী সোনম সন্তানসম্ভবা। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup 2023) জেতার পর স্ত্রী সোনমের হাতে অধিনায়কের আর্মব্যান্ড পরিয়ে দিলেন সুনীল। ভারতের জয়ের পরই ডাগ আউটে এসে দাঁড়িয়েছিলেন সোনম। সম্পর্কে যিনি কিংবদন্তি ফুটবলার সুব্রত ভট্টাচার্যের কন্যা। আর ম্যাচ শেষ হতেই বাংলার জামাই এগিয়ে গেলেন স্ত্রীর দিকে। তাঁকে আলিঙ্গন করলেন। হাত নিজের কোমরের পিছনে রাখলেন। যেন বোঝা গেল, উত্তেজনার বশে স্ত্রীর যাতে আঘাত না লেগে যায়, সে ব্যাপারে সতর্ক ভারত অধিনায়ক। তারপরই নিজের হাত থেকে ক্যাপ্টেন্স আর্মব্যান্ড খুলে পরিয়ে দিলেন সুনীল। সেই ছবি ভাইরাল হয়ে গেল সোশ্যাল মিডিয়ায়। লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); View this post on Instagram A post shared by Indian Football (@indianfootball) গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই। ম্যাচের সেরাও হয়েছেন তিনি। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 01:40:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/d0d535ffe2c015b658ac549c48f6f294168713817347050_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Intercontinental Cup 2023: লেবাননকে হারানোর পরই সুনীলদের জন্য সুখবর, বিরাট অঙ্কের পুরস্কার অর্থের ঘোষণা","link":"https://bengali.abplive.com/sports/intercontinental-cup-2023-odisha-cm-naveen-patnaik-announces-1-crore-reward-for-india-who-beat-lebanon-2-0-986510","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"ভুবনেশ্বর: লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল। গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ফিফা ব়্যাঙ্কিংয়ে দুই ধাপ এগিয়ে থাকা লেবাননের বিরুদ্ধে ফাইনালে ভারতের লড়াইটা যে হাড্ডাহাড্ডি হবে, সেই সম্ভাবনা ছিলই। হলও তাই। প্রথমার্ধে দুই দলই আক্রমণ শানালেও, গোলের দরজা খুলতে পারেননি কেউই। ভারতীয় দলের হয়ে প্রথমার্ধে উইং ধরে সাহাল আব্দুল সামাদ বেশ কিছু আক্রমণ গড়ে তুললেও লাভের লাভ কিছুই হয়নি। গোল করা তো দূর, ভারতীয় দল একটি শট লেবাননের তেকাঠির মধ্যেও রাখতে পারেনি। এমন পরিস্থিতিতে ভারতীয় অনুরাগীদের মনে গত ম্যাচের স্মৃতি ভেসে আসাটাই স্বাভাবিক। ফাইনালের আগে গ্রুপ পর্বে নিজেদের শেষ ম্যাচে লেবাননের বিরুদ্ধে গোলশূন্য ড্র করেছিল ভারত। গোলের সুযোগ হাতছাড়া করেছিলেন সুনীলও। কিন্তু দ্বিতীয়ার্ধ শুরু হতেই ছবিটা বদলে গেল। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই।   আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে?  ","content":"ভুবনেশ্বর: লেবাননকে হারিয়ে ইন্টারকন্টিনেন্টাল কাপ (Intercontinental Cup) জেতার পরই ভারতীয় ফুটবল (Indian Football Team) দলের জন্য সুখবর। সুনীল ছেত্রীদের (Sunil Chhetri) জন্য বিরাট অঙ্কের পুরস্কার অর্থ ঘোষণা করলেন ওড়িশার (Orissa) মুখ্যমন্ত্রী নবীন পট্টনায়েক (Naveen Patnaik)। রবিবার ভুবনেশ্বরের কলিঙ্গ স্টেড়িয়ামে ভারত বনাম লেবানন ফাইনাল ম্যাচ দেখতে হাজির ছিলেন ওড়িশার মুখ্যমন্ত্রী। ম্যাচের পর সুনীলরা তখন ট্রফি নিয়ে ফটো সেশনে ব্যস্ত। মঞ্চে উঠে নবীন পট্টনায়েক ঘোষণা করেন, 'ভারতীয় দলকে অভিনন্দন। ওড়িশা সরকারের পক্ষ থেকে ১ কোটি টাকা পুরস্কার অর্থ দেওয়া হবে ভারতীয় দলকে।' নবীন আরও বলেন, 'ইন্টারকন্টিনেন্টাল কাপের মতো সম্মানজনক একটা টুর্নামেন্ট ওড়িশায় আয়োজন করতে পেরে আমি গর্বিত। কঠিন প্রতিদ্বন্দ্বিতার মুখে ভারতীয় দল যে নাছোড় মনোভাব দেখিয়েছে, ওদের অভিনন্দন জানাচ্ছি।' গোলশূন্য প্রথমার্ধের পর ইন্টারকন্টিনেন্টাল কাপের (Intercontinental Cup 2023) ফাইনালে লেবাননের বিরুদ্ধে (India vs Lebanon) জ্বলে উঠলেন লালরিনজুয়ালা ছাংতে (Lallianzuala Chhangte)। গোল ও অ্যাসিস্ট করে দলকে জেতালেন তিনি। ২-০ জিতল ভারতীয় দল । গোল পেলেন সুনীল ছেত্রীও (Sunil Chhetri)। ফিফা ব়্যাঙ্কিংয়ে দুই ধাপ এগিয়ে থাকা লেবাননের বিরুদ্ধে ফাইনালে ভারতের লড়াইটা যে হাড্ডাহাড্ডি হবে, সেই সম্ভাবনা ছিলই। হলও তাই। প্রথমার্ধে দুই দলই আক্রমণ শানালেও, গোলের দরজা খুলতে পারেননি কেউই। ভারতীয় দলের হয়ে প্রথমার্ধে উইং ধরে সাহাল আব্দুল সামাদ বেশ কিছু আক্রমণ গড়ে তুললেও লাভের লাভ কিছুই হয়নি। গোল করা তো দূর, ভারতীয় দল একটি শট লেবাননের তেকাঠির মধ্যেও রাখতে পারেনি। এমন পরিস্থিতিতে ভারতীয় অনুরাগীদের মনে গত ম্যাচের স্মৃতি ভেসে আসাটাই স্বাভাবিক। ফাইনালের আগে গ্রুপ পর্বে নিজেদের শেষ ম্যাচে লেবাননের বিরুদ্ধে গোলশূন্য ড্র করেছিল ভারত। গোলের সুযোগ হাতছাড়া করেছিলেন সুনীলও। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); কিন্তু দ্বিতীয়ার্ধ শুরু হতেই ছবিটা বদলে গেল। দ্বিতীয়ার্ধের শুরুতেই লালরিনজুয়ালা ছাংতে জ্বলে উঠেন। তাঁর সুন্দর পাস থেকেই সুনীল ছেত্রী লেবাননের জালে বল জড়িয়ে দেন। ছেত্রীর গোলে ভারত এগিয়ে যাওয়ার পর ম্যাচে রাশ ব্লু টাইগার্সদেরই হাতে চলে আসে। দুরন্ত ফুটবলে সকলেরই নজর কাড়েন ছাংতে। দুরন্ত অ্যাসিস্টের পর বিচক্ষণতার পরিচয় দেখিয়ে ম্যাচের ৬৬ মিনিটে গোলও পেয়ে যান ছাংতে। বাঁ-দিক থেকে মহেশ নাওরেমের শট লেবানন গোলরক্ষক আলি সাবেক বাঁচিয়ে দেন বটে। তবে ফিরত বলে সবার আগে ঝাঁপিয়ে পড়ে তা জালে জড়িয়ে দেন ছাংতেই। আরও পড়ুন: কোঁকড়ানো চুল ধুয়ে পরিষ্কার করার ক্ষেত্রে কী কী নিয়ম অতি অবশ্যই মেনে চলতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-19 01:23:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/19/d418046c7fbbfef150786854ed9f92f3168713774940750_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Western Springs Football Club and top female players reach agreement over gender equity issues","link":"https://www.nzherald.co.nz/sport/western-springs-football-club-and-top-female-players-reach-agreement-over-gender-equity-issues/WY7HB6MXJ5DBDMCOXQV4VWRBLI/","keywords":null,"creator":null,"video_url":null,"description":"The club apologised for failures in communication.","content":"Senior female players at Western Springs Football Club have reached an agreement with the board on plans to address their concerns about gender equity at the club. Following a protracted mediation which began on 30 May, a joint statement released today by the top Auckland club and the Premier Women’s Team said: “We agreed a way forward that’s resolved many of the concerns raised by the players and their supporters and the team will keep playing at Western Springs.” In the statement posted on their website, the club acknowledged there had “been issues” and apologised for “failures in communication and understanding that contributed to the situation”. “Everyone involved committed to the mediation process in good faith, which led to a successful resolution.” Advertisement Advertise with NZME. It comes after an ongoing Herald investigation into the concerns of senior women’s players over inequality disputes at one of the country’s top football clubs. The Herald revealed: Player and staff walkouts ; details of funding the club received for the upcoming Fifa Women’s World Cup ; allegations of “highly misogynistic behaviour”; concerns about a phallic logo; unequal spending between the top male and female squads. Since the Herald first broke the story on 13 May, club leaders have not responded to Herald requests for comment. Today’s statement said: “The club respects the stand taken by the players and the opportunity it’s provided to learn and further improve our approach to women’s football.” Advertisement Advertise with NZME. The statement said a number of changes have been agreed to “which are all about making sure Western Springs sets the standard for not just football clubs in Auckland but for sports clubs nationwide”. The changes included: The Premier Women’s teams’ expense budget will be increased to be equal with the Premier Men; A process is underway to recruit a new Head of Girls’ and Women’s Football; Changes to the constitution will be recommended to embed a commitment to equality, diversity and player representation across their committees; An appointment process is underway for an independent advisor to develop a Girls’ and Women’s Programme Development Strategy; The club will increase efforts to attract more women to Senior and Executive Committees; The executive agreed to develop a clear pathway for raising and resolving members’ concerns and issues. The statement noted the club’s Junior Committee now has 50 per cent female representation. When the Herald first broke the story, the club’s website listed three women among the 10 people on that board. The club has called in Kereyn Smith, former CEO of the NZ Olympic committee, who will act as Transition Director to implement these changes and will also act as a conduit between the Women’s Premier team and the club. Related articles Sport Western Springs' phallic logo to be replaced as special meeting called 12 Jun 12:35 AM Sport Documents reveal gender-equity funding conditions for Western Springs Football Club 03 Jun 03:00 AM Sport Western Springs women's team take to the pitch again - in different kit 29 May 05:30 AM Sport 'I felt shame': Mass exodus at top football club after women players 'disrespected' 12 May 05:00 PM They will also have the support of Northern Region Football and New Zealand Football. Western Springs women who were runners-up in the New Zealand National League last year, played four matches while mediation underway. Two were regular league games and two Kate Sheppard Cup matches – all of which they won. Western Springs premier women's team played two games in black, unbranded kit during the dispute. Photo / Alex Burton The club provided an unbranded kit for two of those games after the players felt uncomfortable wearing a phallic-looking logo. The Herald last week reported the club had called in an artist to redesign the 34-year-old emblem . Today’s post-mediation statement did not mention the logo. The statement said, “despite our size as one of the largest sporting clubs in New Zealand, we’re largely run by volunteers”. “We recognise this has been an unsettling time for members.” Advertisement Advertise with NZME. The club thanked their members for their patience and assured them they’ll be kept informed as the changes progress. “We look forward to returning focus to playing football – and of course, we’d like to see all Western Springs whānau supporting the Premier Women’s team here at Seddon and away.” The players said in a separate statement they were relieved to have reached an agreement with the club – thanking and acknowledging the club’s executives on the changes made. “Pushing for change has been tough on us as a playing group and has taken a personal toll, but we’ve gained strength from each other and have stayed tight as a group,” the players said. “We’ve also had amazing support from men and women around us, particularly in the legal space with Maria Dew KC and Maria Clarke and we couldn’t have achieved this without their help.” The players were “really proud” of what they achieved, adding: “We hope that WSAFC can lead the way for other clubs to ensure equity and fairness and a culture which supports and grows women’s teams. “We can’t wait to concentrate on football knowing that our voices have been heard and that other women may be inspired to stand up for what they believe in.” Advertisement Advertise with NZME. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-06-19 00:47:00","image_url":"https://www.nzherald.co.nz/resizer/SX7uw8_MOUxzxp6L1u9BHndj1-I=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/ZNJEQXBDONCCBGWLLFYCVBMGYQ.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"Tom Brady expresses importance of his kids in life on Father's Day - “Being a Dad is the best thing in my life”","link":"https://www.sportskeeda.com/nfl/news-tom-brady-expresses-importance-kids-life-father-s-day-being-dad-best-thing-in-my-life","keywords":["NFL"],"creator":["Rit Nanda"],"video_url":null,"description":null,"content":"Tom Brady was feeling sentimental on Father's Day as he expressed his gratitude to his own father and his own journey as a father. He called his children his angels, in whose growth he takes immense pleasure. Despite his many ahievements on the field, he said being a Dad is the best thing happening in his life. He posted pictures of himself with his dad and his children. Writing on Instagram, he said: He continued with thanking his father and all that he learned from him and how he is able to pass that on to his own children. He said that family is what matters the most to him: Tom Brady finished by saying how proud he is of his children and that their good qualities are a reflection of everyone who raises them: Instagram Post Tom Brady's personal life has been under scrutiny over the past year. He famously retired and then unretired, coming back to play for the Tampa Bay Buccaneers for one extra season last year. It was also when his marriage with Gisele Bundchen fell apart after more than a decade being together. There were insinuations that it happened because he was putting his career over his family. But now that he is retired , it seems he is finding his joy beyond his career in football. That stems from his own children and his parents, who have taken the void left behind from his stepping away from football. How has Nikola Jokic changed the NBA forever? His crazy life and career is one for the ages! Poll : 0 votes Quick Links","pubDate":"2023-06-19 00:01:05","image_url":"https://staticc.sportskeeda.com/editor/2023/06/5063f-16871132097418-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Liverpool need £95m to complete dream summer transfer window with three signings","link":"https://www.liverpoolecho.co.uk/sport/football/transfer-news/liverpool-need-95m-complete-dream-27147387","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool have already identified Khephren Thuram as a target with Gabri Veiga and Levi Colwill also among the players monitored","content":"The transfer window is barely a week old and Liverpool have a number of things on their agenda as they look to bolster their squad this summer. deal was concluded without a hitch as the Brighton & Hove Albion midfielder signed on to become the latest Argentine to line up at Anfield. The objective doesn't stop there as continue to eye further improvements to their squad ahead of the players reuniting at the beginning of July for their 2023-24 Premier League and Europa League preparations. After their disappointing campaign last time out, the focus is on defensive and midfield acquisitions as the goalkeeper and attacking options remain stocked. Should Caoimhin Kelleher exit Anfield this summer, the Reds may have their arms twisted into movement between the sticks. But the priority remains in the engine room as well as a left-sided defender, should one become available. Questions were sparked throughout the campaign about the quality of Liverpool's midfield as they were exposed during their difficult spells before dropping to their lowest Premier League finish since 2016. Options in midfield were few and far between with injuries hampering options as well as lack of investment in recent years. In the lowest finish of reign in a full Premier League calendar, there hasn't been a season with more chastening defeats as the Reds fell off the boil just a matter of months after chasing the quadruple. By comparison to recent seasons, there is no financial cushion from qualifying for the Champions League or prize money from their runs in various other competitions. They scored a reported £105.7m from their pursuit of a seventh European crown at the end of the 2021/22 term with an estimated £71m received from their last-16 exit to Real Madrid in March. The German has already argued that the lack of European football can't be used as an excuse to not open their wallets in the transfer window. \"It is a fantastic club with a really good football team and even better, hopefully, next year. I've barely faced the situation where you talk with a player and everything is great and he says, 'okay see you if...' That doesn't happen really often,\" he said in May. \"We are still Liverpool and we are really attractive for a lot of players, we should not forget that. That's why I'm not concerned about that fact. \"Everything is of course more difficult without the Champions League, especially in long term, and we have to not do these things more often. \"But apart from that, it's okay the situation we are in from a talking point of view and convincing point of view.\" The ECHO understands that the with a number of factors contributing to that, none more so than the departure of engine room options James Milner, Alex Oxlade-Chamberlain and Naby Keita - who both struggled with injuries in the last 18 months of their Liverpool careers. Khephren Thuram is under real consideration, it is understood. , Thuram, who has There is a possibility that the 22-year-old will be holding the Liverpool shirt before the start of the Premier League season against Chelsea. According to his current market value is said to be in the region of £27.3m. He is likely to cost more than the reported £35m for Mac Allister - likely to be in the region of £50m - but should Thuram express his intentions of leaving the Allianz Riviera this summer, it might force Nice to part ways. Meanwhile, Borussia Monchengladbach's Manu Kone and Gabri Veiga are also on the list, while Southampton's 19-year-old Romeo Lavia has his admirers but Arsenal have reportedly steered ahead in the race for the Belgian. Ryan Gravenberch emerged as a key target earlier this year and reports claimed in April that Liverpool met with the player's agent, Rafaela Pimenta, who also represents Thuram. Although, there is a reluctance to sell from Bayern Munich, despite the Ajax academy prospect being a peripheral figure at the Allianz Arena last season. Of course, it remains to be seen whether the model of selling-to-buy remains at Anfield after recent seasons and the addition of Jorg Schmadtke, who succeeded Julian Ward as the sporting director at the beginning of June. A player who is attracting interest, who Reds will be able to catch at the U21 European Championships in Georgia and Romania, is the aforementioned Veiga. The Spanish youngster has courted interest from his homeland and from the Premier League with Chelsea and Newcastle joining Liverpool in the pursuit, according to reports. This summer could be the final one for him at his boyhood club and what a way it could be for him to sign off. His goalscoring exploits on the final day of the season not only saw them see off Barcelona but also stay in La Liga thanks to the win. Reports suggest he could be available for £32m this summer due to his release clause and with the Reds among the clubs front of the queue. In an ideal summer, this would be perfect business to continue the overhaul in midfield. and staked their claims for Liverpool starting positions in various parts of the season, the Liverpool-born man enjoyed an extended run in the first-team towards the end of the term as he featured in 11 successive games. Jones's rich vein of form coincided with the Reds securing Europa League football with an 11-game unbeaten run. It's believed Jordan Henderson will endure a slightly reduced role which adds three more options to the two that could join Mac Allister on Merseyside next season. with Virgil van Dijk and Joel Matip both in their 30s. A wildcard exit has been mooted for the Cameroon defender, who arrived as a free agent from Schalke in 2016, with a year remaining on his term and his injury problems at the back end of the season, he could be headed for an Anfield exit. There has been no indication of that so far this summer, however. Netherlands captain Van Dijk , he explained how the finish to the season plus the incoming signings have contributed to motivating him. For that reason, Levi Colwill, valued at £13m according to Transfer Markt, could be the right addition to the Liverpool backline. Having cut his teeth in the professional game during a loan spell with Huddersfield Town, Colwill shone in Brighton's historic season that saw them qualify for Europe for the first time in their history. Prising the defender away from Chelsea will be a difficult task but not entirely impossible as they look to deflate their bloated squad. The Londoners aren't shying away from business as they continue to monitor talents across the world but Liverpool targeting Colwill, who was called up to the England senior squad for the first time this month, would be a significant piece of business to inject youth alongside Konate in the backline. In the scenario that Liverpool can work their magic and get their hands on Thuram, Veiga and Colwill, it would be a big step to completing the first steps of the overhaul at Anfield with a dangerous blend already up front.","pubDate":"2023-06-19 00:00:00","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27091545.ece/ALTERNATES/s98/0_GettyImages-1492645875.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"}]}