{"newsArray":[{"article_id":"ba20b01ef5c752d45df62927ed90fbca","title":"Mercato - PSG : À peine arrivé, il prend une claque et déballe tout !","link":"https://le10sport.com/football/mercato/mercato-psg-a-peine-arrive-il-prend-une-claque-et-deballe-tout-677207","keywords":null,"creator":null,"video_url":null,"description":"Milan Skriniar est un joueur du PSG depuis le dernier mercato seulement. Mais il n’en fallait pas plus pour le convaincre de la flamme intérieure des supporters parisiens pour le Paris Saint-Germain.","content":"Milan Skriniar est un joueur du PSG depuis le dernier mercato seulement. Mais il n’en fallait pas plus pour le convaincre de la flamme intérieure des supporters parisiens pour le Paris Saint-Germain. D’ailleurs, Skriniar révèle avoir été impressionné dès ses premiers pas au Parc des princes. Dans l’hexagone, certains publics sont réputés pour être particulièrement investis derrière leurs joueurs. C’est notamment le cas de l’ OM au Vélodrome, du RC Lens à Bollaert, de l’ ASSE à Geoffroy Guichard, mais aussi le PSG avec le Parc des princes. En attestent les divers tifos ingénieux des ultras du PSG lors des rencontres de Ligue des champions entre autres. Recruté par le Paris Saint-Germain à l’intersaison, lui qui a connu l’ Inter et Giuseppe Meazza ou San Siro, Milan Skriniar avoue avoir été bluffé par l’investissement des supporters du PSG dès sa première au Parc des princes. Mercato - PSG : Transfert à 20M€, la mèche est vendue pour ce retour attendu https://t.co/kwAQdEF2Dk pic.twitter.com/7cSqk1vvpN Pour PSG TV , Milan Skriniar s’est enflammé pour l’ambiance et l’atmosphère électrique du Parc des princes. « L’ambiance au Parc des princes. Les supporters du PSG sont fantastiques. Il y avait une atmosphère incroyable pendant le premier match. J’ai vraiment été surpris car ils ont chanté pendant tout le match, pendant 95 minutes. Ils n’ont pas arrêté de chanter. Je sais que les fans du PSG ont joué un rôle très important dans l’histoire. On travaille pour les rendre heureux ». De quoi faire plaisir aux supporters et ultras du PSG .","pubDate":"2023-12-27 13:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0023/233114.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"bf84de8382fb0fbfe25bcf04f94067f1","title":"Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show","link":"https://www.dailymail.co.uk/sport/football/article-12903743/Paddy-McGuinness-DEVASTATED-axe-Question-Sport-BBC.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The broadcasting corporation announced that the programme would be axed after running for more than 50 years and laid the blame at the feet of inflation and dwindling ratings.","content":"Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show The former Top Gear presenter previously called it an 'honor' to take up the role Long-running programme was cancelled in December after over 50 years Ian Ladyman reveals the most BORING manager he's dealt with during his career - It's All Kicking Off By Tamara Prenn For Mailonline Published: 07:59 EST, 27 December 2023 | Updated: 08:14 EST, 27 December 2023 e-mail View comments Paddy McGuinness has revealed he was 'absolutely devastated' when the BBC cancelled A Question of Sport at the start of the month. The broadcasting corporation announced that the programme would be axed after running for more than 50 years and laid the blame at the feet of inflation and dwindling ratings. The show underwent its latest revamp in 2021, when McGuinness was drafted in to front the quiz as a replacement for long-standing host Sue Barker. The former British No 1 tennis player had left the show after 24 years in 2020, and new team captains Ugo Monye and Sam Quek were also called up to replace Matt Dawson and Phil Tufnell. Staff were said to be 'gutted' after the axe fell on the programme two weeks ago, and the former Top Gear presenter echoed their statements whilst hosting Stick to Football's quiz on Wednesday. Paddy McGuinness fronted the show between 2021 and 2023 after replacing Sue Barker The comedian discussed the show's abrupt ending whilst hosting the Stick to Football quiz Long-running host Barker's exit is thought to have heralded a swift drop-off in the ratings Your browser does not support iframes. 'Oh my god,' McGuinness said when prompted on the show's cancellation by Gary Neville. 'Absolutely devastated (it got cancelled). 'It's like in management, football, you go in, do your best, and that's that. But telly, you can be involved with a show and it'll run and run, or it'll finish and you move on, that's just the nature of the beast. 'But when Question of Sport, when they stopped it - and honestly think whether it's captains, me, whatever it is, whatever the reason, they say it's budget stuff, but it's all kind of stuff - I just think, it's going to come back. 'Because I'm a fan of it.' Upon his hiring two years ago, McGuinness said that it had been 'one of his favourite shows' and that he had been 'weaned on it from an early age'. Discussing his favourite aspect of hosting the programme, McGuinness cited the range of people he had been able to meet. 'Being around sportspeople, three lots of shows every day, sportspeople - from sports I wouldn't take much interest in, badminton or whatever - I loved it,' McGuinness continued. 'It's one of those ones where it's a heritage show - it's like Match of the Day, I know other football shows are available - but there are certain shows you watch and you go, 'god'. When I got that call I never hesitated. 'I loved it, and I really hope, whether it's me or anyone else, it comes back.' McGuinness prompted laughter from the assembled panel of Neville, Jamie Carragher, Roy Keane, and Ian Wright when he suggested that the former Arsenal legend should take up hosting duties if the programme was to be resurrected. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, with a show every Monday and Thursday this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement McGuinness took the reins alongside new team captains Sam Quek and Ugo Monye (right) Wright - who has just stepped back from Match of the Day after 27 years - vigorously shook his head at the prospect. Former presenter Barker shared McGuinness' viewpoint when the news broke, saying that she 'truly hoped it would return one day'. Barker had previously questioned how her sacking had been handled by the corporation in 2022, citing how she had 'no problem with being replaced' but learned that 'there is actually no way of leaving a role in a nice, pleasant and helpful manner'. Before Barker's tenure, the show was fronted by David Vine upon its debut in 1970, but became appointment viewing with her at the helm of the programme alongside her first team captains Ally McCoist and John Parrott. BBC Gary Neville Ugo Monye Inflation Share or comment on this article: Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-27 13:14:17","image_url":"https://i.dailymail.co.uk/1s/2023/12/27/13/79368139-0-image-a-6_1703682405207.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"652d1209867af990ac9b24fcba19a760","title":"Football : \"J'avais peur\", le séjour cauchemardesque de James Rodriguez au Qatar lors de son passage à Al-Rayyan","link":"https://www.ladepeche.fr/2023/12/27/football-javais-peur-le-sejour-cauchemardesque-de-james-rodriguez-au-qatar-lors-de-son-passage-a-al-rayyan-11665624.php","keywords":["Football"],"creator":null,"video_url":null,"description":"L'ancien joueur de l'AS Monaco, James Rodriguez est revenu lors d'une interview à télévision brésilienne sur son passage à Al-Rayyan lors de la saison 2020-2021. Il révèle alors le calvaire qu'il a vécu.","content":"Après avoir porté les couleurs d’une poignée de clubs européens tels que le FC Porto, l’AS Monaco, le Real Madrid ou encore le Bayern Munich au cours de la dernière décennie, James Rodriguez optait pour un challenge à mille lieues du vieux continent. Séduit par l’aspect financier et désireux de retrouver du temps en vue de participer, à l’époque, à la Coupe du monde 2022 au Qatar, le milieu offensif colombien s’engageait en faveur d’Al-Rayyan. A lire aussi : Espagne-Colombie, ou la revanche de James Rodriguez Mais l'aventure ne s'est pas très bien déroulée pour le Colombien qui a rompu son contrat avec le club, 6 mois après sa signature. Désormais, joueur du mythique club de São Paulo, James est revenu sur cet épisode tragique lors d'une émission télévisée sur Esporte Globo, une chaîne brésilienne. \"La vie et la culture au Qatar sont très difficiles, c'était un pays où il était difficile de s'adapter. Vous savez que dans le football, tout le monde est nu quand on se douche, mais mes coéquipiers m'ont dit : \"Tu ne peux pas faire ça comme ça\". J'avais peur\", relate l'ancien prodige colombien. A lire aussi : Supercoupe d'Europe: James Rodriguez et Gareth Bale en vedettes Avant de poursuivre : \"Là-bas, tout le monde mange avec ses mains, ce qui était difficile pour moi. Ils l'ont partagé avec moi et j'ai dit : « Non merci ». J'ai demandé des couverts et ils m'ont dit : \"Non, avec ta main\" et j'ai répondu : \"Vous êtes fous, je ne mangerai pas avec ma main\". Le numéro 10 n'a alors disputé que 16 matchs avec Al-Rayyan, marquant cinq buts et réalisant sept passes décisives. Le milieu offensif a ensuite rejoint l'Olympiakos Le Pirée avant de partir vers le soleil et revenir sur son continent mais là-bas aussi le petit colombien a des difficultés a d'adapter. \"Je pensais que le football ici serait moins physique, mais il est très physique. Le jeu est souvent arrêté à cause de fautes et les collisions sont nombreuses. Je pensais que ce serait plus technique. Il y a des joueurs avec beaucoup de qualité, mais le jeu est très dur.\" racontait-il.","pubDate":"2023-12-27 13:13:46","image_url":"https://images.ladepeche.fr/api/v1/images/view/658c139da1b94e117025478a/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"d259c5275f4af27429b51ccc97ecc059","title":"Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas","link":"https://www.dailymail.co.uk/sport/football/article-12903711/Class-92-Salford-City-Neil-Wood-sacked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Salford City have confirmed the sacking of head coach Neil Wood after a 5-1 defeat at home to Tranmere on Boxing Day extended their winless run in the league to eight games.","content":"Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas Salford City are 21st in League Two after losing 5-1 to Tranmere on Boxing Day Neil Wood led the Ammies to the League Two play-offs last season Ian Ladyman reveals the most BORING manager he's dealt with during his career - It's All Kicking Off By Pa Sport Published: 06:56 EST, 27 December 2023 | Updated: 08:13 EST, 27 December 2023 e-mail 9 View comments Salford City have confirmed the sacking of head coach Neil Wood. He leaves the club with the Ammies currently on an eight-game winless league run after being beaten 5-1 by Tranmere on Boxing Day. Wood took charge of the club in May 2022 following the departure of Gary Bowyer and his first season in charge saw Salford reach the Sky Bet League Two play-offs, where they were knocked out by local rivals Stockport in a penalty shootout. However, this season sees the Ammies currently sat just two places above the relegation zone and assistant coach Simon Wiles will be in charge for their game against Grimsby on Friday. A statement on the Salford website said: 'The club would like to thank Neil for his hard work over the last 18 months, including leading the club to our highest-ever finish in Sky Bet League Two last season, and we wish him well in his future role within football. Salford City have confirmed the sacking of head coach Neil Wood Wood (left) was Salford's seventh manager since a consortium led by players Gary Neville, Paul Scholes, Nicky Butt (middle) and Ryan Giggs (second left) took over the club in 2014 Your browser does not support iframes. 'The process of appointing a new manager will commence immediately, with assistant coach Simon Wiles preparing the team for Friday's game against Grimsby.' Wood was Salford's seventh manager since a consortium led by former Manchester United players Gary Neville, Paul Scholes, Nicky Butt and Ryan Giggs took over the club in 2014. Bar Scholes, who was in charge as caretaker, all of his predecessors were relieved of their duties. Harvey Saunders, Kieron Morris, Connor Jennings, Regan Hartley and Josh Hawkes were on target as Tranmere recorded their first away win of the season on Boxing Day. Matthew Lund scored Salford’s only goal which had little impact in the context of an otherwise one-sided performance, while the hosts lost Conor McAleny to a 72nd-minute red card. After defeat, Wood did not speak to the media – leaving such responsibilities to goalkeeper Alex Cairns. Cairns said: 'We need to stick together now more than ever. It wasn’t good enough all over the pitch, we need to bounce back with a much better performance than that and people need to stick their chest out and start putting performances in. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, with a show every Monday and Thursday this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement 'We’ve always been in games, but today we were down and out and that’s the first time I’ve seen that from this group. 'The leaders within that dressing room need to keep this group together and that’s the fundamentals of football. 'We have to expect better and demand better. 'We’ve been very unfortunate with injuries – and that’s not an excuse it’s just a fact. The results haven’t been there.' Gary Neville Share or comment on this article: Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas e-mail Add comment Comments 9 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-27 13:13:14","image_url":"https://i.dailymail.co.uk/1s/2023/12/27/13/79368203-0-image-a-44_1703682780410.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3dec402b2029078a08ad66e95a792735","title":"Арсенал не відпустить Ремсдейла в оренду","link":"https://champion.com.ua/football/2023/12/27/946552/arsenal-ne-vidpustyt-remsdeyla-v-orendu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Арсенал не планує взимку відпускати в оренду голкіпера Аарона Ремсдейла.Про це повідомляє The Athletic.У клубі хочуть, щоб 25-річний англієць залишився до кінця сезону. Якщо він захоче піти, то за його трансфер вимагатимуть чималу суму.Чинний контрак...","content":"#Чемпіонат Англії, АПЛ , #Футбольні трансфери , #Арсенал Лондон , #Аарон Ремсдейл Джерело - theathletic.com . Арсенал не планує взимку відпускати в оренду голкіпера Аарона Ремсдейла. Про це повідомляє The Athletic. У клубі хочуть, щоб 25-річний англієць залишився до кінця сезону. Якщо він захоче піти, то за його трансфер вимагатимуть чималу суму. Чинний контракт Аарона розрахований до 2026 року. У поточному сезоні він програє конкуренцію новачку Давіду Раї – провів лише 9 матчів в усіх турнірах. Самому воротареві потрібно більше грати, щоб потрапити у склад збірної Англії на Євро-2024. Раніше повідомлялося, що Челсі може підписати воротаря Арсенала Рамсдейла.","pubDate":"2023-12-27 13:11:00","image_url":"https://champion.com.ua/storage/news/main/regular/5e8a10045f5a6a855f711cccced27ea8.jpg","source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"0ca4373300120f60e7c0a486b971cae0","title":"Mercato - PSG : Une superstar chargée de gérer un départ à Paris","link":"https://le10sport.com/football/mercato/mercato-psg-une-superstar-chargee-de-gerer-un-depart-a-paris-677215","keywords":null,"creator":null,"video_url":null,"description":"Le PSG va probablement avoir un indésirable de nouveau sur les bras. Les dirigeants de l'AS Rome seraient déçus des performances de Renato Sanches et voudraient le renvoyer à Paris. Le champion de…","content":"Le PSG va probablement avoir un indésirable de nouveau sur les bras. Les dirigeants de l'AS Rome seraient déçus des performances de Renato Sanches et voudraient le renvoyer à Paris. Le champion de France serait prêt à accepter la demande de la formation italienne à condition que son agent Jorge Mendes lui trouve une porte de sortie. À l'été 2022, le PSG faisait le choix d'engager Christophe Galtier comme successeur à Mauricio Pochettino . L'entraîneur français avait alors recruté un de ses anciens joueurs au LOSC , Renato Sanches . Mais cela s'est révélé être un échec et le Portugais a quitté Paris sous la forme d'un prêt cet été. Malheureusement, Renato Sanches n'a pas réussi à se refaire une santé lors de son prêt à l' AS Rome . D'après les informations de Foot Mercato les dirigeants du club italien penseraient même à casser le prêt et à renvoyer le Portugais à Paris . Il faudra donc convaincre le PSG , car le milieu de terrain est normalement prêté jusqu'à la fin de la saison. Mercato : Le PSG boucle son transfert et lui fait vivre un rêve ! https://t.co/xJ2xswTFtP pic.twitter.com/3rhqCN8sbt Toujours d'après Foot Mercato , le PSG pourrait accepter que le prêt soit cassé. Toutefois il y aurait une condition à cela, que le super-agent du Portugais, Jorge Mendes lui trouve un nouveau point de chute. Cela ne sera pas facile vu les dernières prestations du milieu de terrain.","pubDate":"2023-12-27 13:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/227012.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"9cfcd6d7bd97724e8e3e6fe5b769ad8e","title":"Finance Guru: Investors hold cards close to chest, cheap Everton acquisition on cards","link":"https://www.goodisonnews.com/2023/12/27/investors-could-get-cheaper-everton-takeover-with-relegation-finance-expert/","keywords":["Exclusives","Dan Plumley","everton"],"creator":["Dan Plumley"],"video_url":null,"description":"We’re delighted to welcome football finance expert Dr Daniel Plumley as our exclusive columnist. Each week he’ll be giving his views on the biggest talking points at Everton Dan Plumley has insisted that any investors will be holding their cards close to their chest, with a cheaper acquisition on the cards if Everton are relegated. It comes ... The post Finance Guru: Investors hold cards close to chest, cheap Everton acquisition on cards appeared first on Goodison News.","content":"It comes after Everton shared that other options and funding were on the table if 777 Partners dropped out of their agreed takeover of the club this season. The finance expert admitted that was a positive from Goodison Park, although staying in the Premier League is critical to the finances and cash flow of the club. he exclusively told “ “ “ “","pubDate":"2023-12-27 13:10:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2023/10/Untitled-design-1-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c42410f81022370714e2ee529338fd69","title":"«Οξύς πονοκέφαλος» για τον Σα Πίντο","link":"https://www.gazzetta.gr/football/protathlima-cyta/2288362/oxys-ponokefalos-gia-ton-sa-pinto","keywords":["Ποδόσφαιρο","Κύπρος","ΑΠΟΕΛ","Newsroom","Πρωτάθλημα Cyta"],"creator":null,"video_url":null,"description":"Με αρκετές απουσίες αναμένεται να αντιμετωπίσει τον Απόλλων Λεμεσού (2/1/24) ο ΑΠΟΕΛ και ο κόουτς Σα Πίντο μοιάζει προβληματισμένος.","content":"Σε λιγότερο από μία εβδομάδα, ο ΑΠΟΕΛ θα κληθεί να μετρήσει δυνάμεις με τον Απόλλωνα (2/1) στο Στάδιο «Αλφαμέγα» και σε καμία περίπτωση δεν θέλει να εκτροχιαστεί από τις ράγες. Μπορεί οι μέρες που διανύουμε να είναι άκρως γιορτινές και στην ομάδα της Λευκωσίας να έχουν ακόμα πιο έντονο άρωμα λόγω της πολύ καλής πορείας, αλλά αυτό δεν παρασύρει κανέναν. Ξέρουν ότι τίποτα δεν έχουν πετύχει, με τις προκλήσεις να διαδέχονται η μία την άλλη. Στο πρώτο ματς του 2024 , μάλιστα, θα στερηθούν τέσσερις ποδοσφαιριστές που αποτελούν σημείο αναφοράς στη φετινή σεζόν, κάτι που αυτομάτως θα φέρει διαφοροποιήσεις στο αρχικό σχήμα σε σχέση με προηγούμενα παιχνίδια, προκαλώντας «οξύ πονοκέφαλο» στο τεχνικό τιμ. Οι Βιγιαφάνιες , Πέτροβιτς συμπλήρωσαν απαγορευτικό αριθμό καρτών, την ίδια ώρα που ο Ντάλσιο θα απουσιάζει τις επόμενες εβδομάδες λόγω των υποχρεώσεων στο Κόπα Αφρικα . Συν τοις άλλοις, ο Κρέσπο θα παραμείνει στο ιατρικό δελτίο για μεγάλο διάστημα. Ο Σα Πίντο και οι συνεργάτες του, επεξεργάζονται διάφορα σενάρια ώστε να καλύψουν τα κενά που προκύπτουν σε ένα τόσο απαιτητικό ματς. Ο Απόλλων, θέλει να αντιδράσει έχοντας στον πάγκο νέο προπονητή, κάτι που αυξάνει αυτομάτως το στοιχείο του απρόβλεπτου για το τεχνικό τιμ του ΑΠΟΕΛ. Αξίζει να σημειωθεί πως η ΚΟΠ, ενημέρωσε πως μετά από αίτημα της αστυνομίας και σχετική απόφαση της Εκτελεστικής Επιτροπής, ο εν λόγω αγώνας για τη 17η αγωνιστική του πρωταθλήματος Cyta θα αρχίσει στις 17:00 αντί στις 19:00 που ήταν αρχικά ορισμένος.","pubDate":"2023-12-27 13:09:28","image_url":"https://www.gazzetta.gr/sites/default/files/styles/article_main_image/public/2023-12/sa_pinto_1.jpg?itok=wL09tadY","source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"6d927c3d9e57737e8a6870bc26d13be5","title":"Former Premier League star, 42, sacked as manager of non-league club after taking over from Golden Boot winner","link":"https://www.thescottishsun.co.uk/sport/11710453/south-shields-sack-julio-arca-national-league-north/","keywords":["Football","Sport"],"creator":["Gary Stonehouse"],"video_url":null,"description":null,"content":"FORMER Premier League star Julio Arca has endured a Christmas nightmare after being sacked by South Shields. The 42-year-old former Sunderland and Middlesbrough midfielder replaced fellow Black Cats legend Kevin Phillips in the dug-out of the National League North side last summer. 4 South Shields have axed ex-Prem star Julio Arca as manager Credit: Alamy 4 He took over the job after Kevin Phillips left following last season's promotion Credit: PA Arca , who previously came out of retirement to play for South Shields in the formative years of owner Geoff Thompson's reign, named ex-Ipswich and Sunderland star Tommy Miller as his assistant. Having won promotion under Phillips last season, they started their first-ever campaign in the National League North impressively. They were second in the table after beating Southport on November 11 - but they have only won one game since. The ambitious north east side have now decided to axe the Argentine following their recent slump in form. It was the 3-1 Boxing Day derby defeat to Blyth Spartans that proved to be the final straw. That result stretched South Shields’ winless run to six. Arca has now paid the price after they slipped to eighth in the table and outside of the play-off places. A club statement confirmed: “The club expresses its sincere gratitude to Julio and Tommy for their efforts during their time at 1st Cloud Arena and wishes them both well for their future endeavours. Most read in Football BLOOD ON STREETS City centre shops locked down after three stabbed in horror attack MIOFFSKI? Miovski targeted for switch to England as EFL high-flyers rival Celtic interest STAY INDOORS Storm Gerrit to batter Scots with snow, strong winds & heavy rain TODAY BABY JOY Scotland star shares exciting baby news in heartwarming video “Julio has been one of the main catalysts of the club’s growth over the last eight-and-a-half years and will always be regarded as a club legend. CASINO SPECIAL - BEST CASINO WELCOME OFFER S “We regret that his time as first-team manager has come to an end, but this decision has been made as a result of on-pitch performances and results over the last six weeks. “Julio, Tommy and their families will always be welcome at 1st Cloud Arena.” TRANSFER NEWS LIVE: All the latest news, rumours and confirmed switches from the world of football 4 Julio Arca played for both Middlesbrough and Sunderland in the top-flight Credit: Reuters 4 Tommy Miller, who played for Ipswich, has also been axed as his No2 Credit: Getty","pubDate":"2023-12-27 13:07:42","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/mi-news-sport-alamy-live-859834628.jpg?strip=all&w=640","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ae8d32c76958a9e5150e7500f71dff35","title":"Man Utd loanee Mason Greenwood urged to 'learn more Spanish' after Getafe's 'gamble'","link":"https://www.dailystar.co.uk/sport/football/man-utd-mason-greenwood-getafe-31755190","keywords":["Football"],"creator":["staronline@reachplc.com (Dan Burnham)"],"video_url":null,"description":"Mason Greenwood has been told where he can improve by Getafe boss Jose Bordalas after impressing for the La Liga side while on loan from Manchester United","content":"loanee Mason Greenwood has been urged to learn more Spanish by Getafe boss Jose Bordalas. Greenwood has established himself as a regular fixture in Bordalas' starting XI for the side. He's chipped in with five goals and four assists in 15 games across all competitions, and in a 3-3 draw away at last time out. His manager explained how they've re-discovered his form in an interview with , mentioning one improvement he could still make. Bordalas said: “Well, with a lot of patience, with a lot of calm, aware that he had been out of action for a long time without playing and practically without training. \"But we were confident because of the talent, because of the ability he had shown. Being able to go for a player of this level at Getafe is complicated, almost impossible. \"And well, given the situation, we took a gamble on him. We are happy and content because we have a great player, he is a good boy, he has fitted in really well and he just needs to learn a little more Spanish.” Bordalas believes he isn't yet firing on all cylinders, but also tipped him to return to the top of European football down the line - whether that be back at United or elsewhere. “Greenwood is a different player, with a lot of talent but in this football talent is not the main thing,\" he continued. \"It takes more work than talent. When he is at 100% we will be able to see his real level but he has the quality to play at any big club.\" Greenwood is spending the season in Spain after Manchester United's internal investigation into the sexual assault allegations against him determined he should continue his career away from his boyhood club. Touching on how the move came about, Bordalas added: \"There were conversations, he had other possibilities to play like in Serie A, but there were many clubs that did not dare because of what had happened and so on. In the end, with a lot of effort and difficulty, we all managed to get him to come to Getafe.” It remains unclear where Greenwood's future lies beyond the end of the season.","pubDate":"2023-12-27 13:06:51","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31755470.ece/ALTERNATES/s98/0_Getafe-CF-v-Valencia-CF-LaLiga-EA-Sports.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ba20b01ef5c752d45df62927ed90fbca","title":"Mercato - PSG : À peine arrivé, il prend une claque et déballe tout !","link":"https://le10sport.com/football/mercato/mercato-psg-a-peine-arrive-il-prend-une-claque-et-deballe-tout-677207","keywords":null,"creator":null,"video_url":null,"description":"Milan Skriniar est un joueur du PSG depuis le dernier mercato seulement. Mais il n’en fallait pas plus pour le convaincre de la flamme intérieure des supporters parisiens pour le Paris Saint-Germain.","content":"Milan Skriniar est un joueur du PSG depuis le dernier mercato seulement. Mais il n’en fallait pas plus pour le convaincre de la flamme intérieure des supporters parisiens pour le Paris Saint-Germain. D’ailleurs, Skriniar révèle avoir été impressionné dès ses premiers pas au Parc des princes. Dans l’hexagone, certains publics sont réputés pour être particulièrement investis derrière leurs joueurs. C’est notamment le cas de l’ OM au Vélodrome, du RC Lens à Bollaert, de l’ ASSE à Geoffroy Guichard, mais aussi le PSG avec le Parc des princes. En attestent les divers tifos ingénieux des ultras du PSG lors des rencontres de Ligue des champions entre autres. Recruté par le Paris Saint-Germain à l’intersaison, lui qui a connu l’ Inter et Giuseppe Meazza ou San Siro, Milan Skriniar avoue avoir été bluffé par l’investissement des supporters du PSG dès sa première au Parc des princes. Mercato - PSG : Transfert à 20M€, la mèche est vendue pour ce retour attendu https://t.co/kwAQdEF2Dk pic.twitter.com/7cSqk1vvpN Pour PSG TV , Milan Skriniar s’est enflammé pour l’ambiance et l’atmosphère électrique du Parc des princes. « L’ambiance au Parc des princes. Les supporters du PSG sont fantastiques. Il y avait une atmosphère incroyable pendant le premier match. J’ai vraiment été surpris car ils ont chanté pendant tout le match, pendant 95 minutes. Ils n’ont pas arrêté de chanter. Je sais que les fans du PSG ont joué un rôle très important dans l’histoire. On travaille pour les rendre heureux ». De quoi faire plaisir aux supporters et ultras du PSG .","pubDate":"2023-12-27 13:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0023/233114.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"bf84de8382fb0fbfe25bcf04f94067f1","title":"Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show","link":"https://www.dailymail.co.uk/sport/football/article-12903743/Paddy-McGuinness-DEVASTATED-axe-Question-Sport-BBC.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The broadcasting corporation announced that the programme would be axed after running for more than 50 years and laid the blame at the feet of inflation and dwindling ratings.","content":"Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show The former Top Gear presenter previously called it an 'honor' to take up the role Long-running programme was cancelled in December after over 50 years Ian Ladyman reveals the most BORING manager he's dealt with during his career - It's All Kicking Off By Tamara Prenn For Mailonline Published: 07:59 EST, 27 December 2023 | Updated: 08:14 EST, 27 December 2023 e-mail View comments Paddy McGuinness has revealed he was 'absolutely devastated' when the BBC cancelled A Question of Sport at the start of the month. The broadcasting corporation announced that the programme would be axed after running for more than 50 years and laid the blame at the feet of inflation and dwindling ratings. The show underwent its latest revamp in 2021, when McGuinness was drafted in to front the quiz as a replacement for long-standing host Sue Barker. The former British No 1 tennis player had left the show after 24 years in 2020, and new team captains Ugo Monye and Sam Quek were also called up to replace Matt Dawson and Phil Tufnell. Staff were said to be 'gutted' after the axe fell on the programme two weeks ago, and the former Top Gear presenter echoed their statements whilst hosting Stick to Football's quiz on Wednesday. Paddy McGuinness fronted the show between 2021 and 2023 after replacing Sue Barker The comedian discussed the show's abrupt ending whilst hosting the Stick to Football quiz Long-running host Barker's exit is thought to have heralded a swift drop-off in the ratings Your browser does not support iframes. 'Oh my god,' McGuinness said when prompted on the show's cancellation by Gary Neville. 'Absolutely devastated (it got cancelled). 'It's like in management, football, you go in, do your best, and that's that. But telly, you can be involved with a show and it'll run and run, or it'll finish and you move on, that's just the nature of the beast. 'But when Question of Sport, when they stopped it - and honestly think whether it's captains, me, whatever it is, whatever the reason, they say it's budget stuff, but it's all kind of stuff - I just think, it's going to come back. 'Because I'm a fan of it.' Upon his hiring two years ago, McGuinness said that it had been 'one of his favourite shows' and that he had been 'weaned on it from an early age'. Discussing his favourite aspect of hosting the programme, McGuinness cited the range of people he had been able to meet. 'Being around sportspeople, three lots of shows every day, sportspeople - from sports I wouldn't take much interest in, badminton or whatever - I loved it,' McGuinness continued. 'It's one of those ones where it's a heritage show - it's like Match of the Day, I know other football shows are available - but there are certain shows you watch and you go, 'god'. When I got that call I never hesitated. 'I loved it, and I really hope, whether it's me or anyone else, it comes back.' McGuinness prompted laughter from the assembled panel of Neville, Jamie Carragher, Roy Keane, and Ian Wright when he suggested that the former Arsenal legend should take up hosting duties if the programme was to be resurrected. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, with a show every Monday and Thursday this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement McGuinness took the reins alongside new team captains Sam Quek and Ugo Monye (right) Wright - who has just stepped back from Match of the Day after 27 years - vigorously shook his head at the prospect. Former presenter Barker shared McGuinness' viewpoint when the news broke, saying that she 'truly hoped it would return one day'. Barker had previously questioned how her sacking had been handled by the corporation in 2022, citing how she had 'no problem with being replaced' but learned that 'there is actually no way of leaving a role in a nice, pleasant and helpful manner'. Before Barker's tenure, the show was fronted by David Vine upon its debut in 1970, but became appointment viewing with her at the helm of the programme alongside her first team captains Ally McCoist and John Parrott. BBC Gary Neville Ugo Monye Inflation Share or comment on this article: Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-27 13:14:17","image_url":"https://i.dailymail.co.uk/1s/2023/12/27/13/79368139-0-image-a-6_1703682405207.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"652d1209867af990ac9b24fcba19a760","title":"Football : \"J'avais peur\", le séjour cauchemardesque de James Rodriguez au Qatar lors de son passage à Al-Rayyan","link":"https://www.ladepeche.fr/2023/12/27/football-javais-peur-le-sejour-cauchemardesque-de-james-rodriguez-au-qatar-lors-de-son-passage-a-al-rayyan-11665624.php","keywords":["Football"],"creator":null,"video_url":null,"description":"L'ancien joueur de l'AS Monaco, James Rodriguez est revenu lors d'une interview à télévision brésilienne sur son passage à Al-Rayyan lors de la saison 2020-2021. Il révèle alors le calvaire qu'il a vécu.","content":"Après avoir porté les couleurs d’une poignée de clubs européens tels que le FC Porto, l’AS Monaco, le Real Madrid ou encore le Bayern Munich au cours de la dernière décennie, James Rodriguez optait pour un challenge à mille lieues du vieux continent. Séduit par l’aspect financier et désireux de retrouver du temps en vue de participer, à l’époque, à la Coupe du monde 2022 au Qatar, le milieu offensif colombien s’engageait en faveur d’Al-Rayyan. A lire aussi : Espagne-Colombie, ou la revanche de James Rodriguez Mais l'aventure ne s'est pas très bien déroulée pour le Colombien qui a rompu son contrat avec le club, 6 mois après sa signature. Désormais, joueur du mythique club de São Paulo, James est revenu sur cet épisode tragique lors d'une émission télévisée sur Esporte Globo, une chaîne brésilienne. \"La vie et la culture au Qatar sont très difficiles, c'était un pays où il était difficile de s'adapter. Vous savez que dans le football, tout le monde est nu quand on se douche, mais mes coéquipiers m'ont dit : \"Tu ne peux pas faire ça comme ça\". J'avais peur\", relate l'ancien prodige colombien. A lire aussi : Supercoupe d'Europe: James Rodriguez et Gareth Bale en vedettes Avant de poursuivre : \"Là-bas, tout le monde mange avec ses mains, ce qui était difficile pour moi. Ils l'ont partagé avec moi et j'ai dit : « Non merci ». J'ai demandé des couverts et ils m'ont dit : \"Non, avec ta main\" et j'ai répondu : \"Vous êtes fous, je ne mangerai pas avec ma main\". Le numéro 10 n'a alors disputé que 16 matchs avec Al-Rayyan, marquant cinq buts et réalisant sept passes décisives. Le milieu offensif a ensuite rejoint l'Olympiakos Le Pirée avant de partir vers le soleil et revenir sur son continent mais là-bas aussi le petit colombien a des difficultés a d'adapter. \"Je pensais que le football ici serait moins physique, mais il est très physique. Le jeu est souvent arrêté à cause de fautes et les collisions sont nombreuses. Je pensais que ce serait plus technique. Il y a des joueurs avec beaucoup de qualité, mais le jeu est très dur.\" racontait-il.","pubDate":"2023-12-27 13:13:46","image_url":"https://images.ladepeche.fr/api/v1/images/view/658c139da1b94e117025478a/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"d259c5275f4af27429b51ccc97ecc059","title":"Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas","link":"https://www.dailymail.co.uk/sport/football/article-12903711/Class-92-Salford-City-Neil-Wood-sacked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Salford City have confirmed the sacking of head coach Neil Wood after a 5-1 defeat at home to Tranmere on Boxing Day extended their winless run in the league to eight games.","content":"Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas Salford City are 21st in League Two after losing 5-1 to Tranmere on Boxing Day Neil Wood led the Ammies to the League Two play-offs last season Ian Ladyman reveals the most BORING manager he's dealt with during his career - It's All Kicking Off By Pa Sport Published: 06:56 EST, 27 December 2023 | Updated: 08:13 EST, 27 December 2023 e-mail 9 View comments Salford City have confirmed the sacking of head coach Neil Wood. He leaves the club with the Ammies currently on an eight-game winless league run after being beaten 5-1 by Tranmere on Boxing Day. Wood took charge of the club in May 2022 following the departure of Gary Bowyer and his first season in charge saw Salford reach the Sky Bet League Two play-offs, where they were knocked out by local rivals Stockport in a penalty shootout. However, this season sees the Ammies currently sat just two places above the relegation zone and assistant coach Simon Wiles will be in charge for their game against Grimsby on Friday. A statement on the Salford website said: 'The club would like to thank Neil for his hard work over the last 18 months, including leading the club to our highest-ever finish in Sky Bet League Two last season, and we wish him well in his future role within football. Salford City have confirmed the sacking of head coach Neil Wood Wood (left) was Salford's seventh manager since a consortium led by players Gary Neville, Paul Scholes, Nicky Butt (middle) and Ryan Giggs (second left) took over the club in 2014 Your browser does not support iframes. 'The process of appointing a new manager will commence immediately, with assistant coach Simon Wiles preparing the team for Friday's game against Grimsby.' Wood was Salford's seventh manager since a consortium led by former Manchester United players Gary Neville, Paul Scholes, Nicky Butt and Ryan Giggs took over the club in 2014. Bar Scholes, who was in charge as caretaker, all of his predecessors were relieved of their duties. Harvey Saunders, Kieron Morris, Connor Jennings, Regan Hartley and Josh Hawkes were on target as Tranmere recorded their first away win of the season on Boxing Day. Matthew Lund scored Salford’s only goal which had little impact in the context of an otherwise one-sided performance, while the hosts lost Conor McAleny to a 72nd-minute red card. After defeat, Wood did not speak to the media – leaving such responsibilities to goalkeeper Alex Cairns. Cairns said: 'We need to stick together now more than ever. It wasn’t good enough all over the pitch, we need to bounce back with a much better performance than that and people need to stick their chest out and start putting performances in. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, with a show every Monday and Thursday this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement 'We’ve always been in games, but today we were down and out and that’s the first time I’ve seen that from this group. 'The leaders within that dressing room need to keep this group together and that’s the fundamentals of football. 'We have to expect better and demand better. 'We’ve been very unfortunate with injuries – and that’s not an excuse it’s just a fact. The results haven’t been there.' Gary Neville Share or comment on this article: Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas e-mail Add comment Comments 9 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-27 13:13:14","image_url":"https://i.dailymail.co.uk/1s/2023/12/27/13/79368203-0-image-a-44_1703682780410.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3dec402b2029078a08ad66e95a792735","title":"Арсенал не відпустить Ремсдейла в оренду","link":"https://champion.com.ua/football/2023/12/27/946552/arsenal-ne-vidpustyt-remsdeyla-v-orendu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Арсенал не планує взимку відпускати в оренду голкіпера Аарона Ремсдейла.Про це повідомляє The Athletic.У клубі хочуть, щоб 25-річний англієць залишився до кінця сезону. Якщо він захоче піти, то за його трансфер вимагатимуть чималу суму.Чинний контрак...","content":"#Чемпіонат Англії, АПЛ , #Футбольні трансфери , #Арсенал Лондон , #Аарон Ремсдейл Джерело - theathletic.com . Арсенал не планує взимку відпускати в оренду голкіпера Аарона Ремсдейла. Про це повідомляє The Athletic. У клубі хочуть, щоб 25-річний англієць залишився до кінця сезону. Якщо він захоче піти, то за його трансфер вимагатимуть чималу суму. Чинний контракт Аарона розрахований до 2026 року. У поточному сезоні він програє конкуренцію новачку Давіду Раї – провів лише 9 матчів в усіх турнірах. Самому воротареві потрібно більше грати, щоб потрапити у склад збірної Англії на Євро-2024. Раніше повідомлялося, що Челсі може підписати воротаря Арсенала Рамсдейла.","pubDate":"2023-12-27 13:11:00","image_url":"https://champion.com.ua/storage/news/main/regular/5e8a10045f5a6a855f711cccced27ea8.jpg","source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"0ca4373300120f60e7c0a486b971cae0","title":"Mercato - PSG : Une superstar chargée de gérer un départ à Paris","link":"https://le10sport.com/football/mercato/mercato-psg-une-superstar-chargee-de-gerer-un-depart-a-paris-677215","keywords":null,"creator":null,"video_url":null,"description":"Le PSG va probablement avoir un indésirable de nouveau sur les bras. Les dirigeants de l'AS Rome seraient déçus des performances de Renato Sanches et voudraient le renvoyer à Paris. Le champion de…","content":"Le PSG va probablement avoir un indésirable de nouveau sur les bras. Les dirigeants de l'AS Rome seraient déçus des performances de Renato Sanches et voudraient le renvoyer à Paris. Le champion de France serait prêt à accepter la demande de la formation italienne à condition que son agent Jorge Mendes lui trouve une porte de sortie. À l'été 2022, le PSG faisait le choix d'engager Christophe Galtier comme successeur à Mauricio Pochettino . L'entraîneur français avait alors recruté un de ses anciens joueurs au LOSC , Renato Sanches . Mais cela s'est révélé être un échec et le Portugais a quitté Paris sous la forme d'un prêt cet été. Malheureusement, Renato Sanches n'a pas réussi à se refaire une santé lors de son prêt à l' AS Rome . D'après les informations de Foot Mercato les dirigeants du club italien penseraient même à casser le prêt et à renvoyer le Portugais à Paris . Il faudra donc convaincre le PSG , car le milieu de terrain est normalement prêté jusqu'à la fin de la saison. Mercato : Le PSG boucle son transfert et lui fait vivre un rêve ! https://t.co/xJ2xswTFtP pic.twitter.com/3rhqCN8sbt Toujours d'après Foot Mercato , le PSG pourrait accepter que le prêt soit cassé. Toutefois il y aurait une condition à cela, que le super-agent du Portugais, Jorge Mendes lui trouve un nouveau point de chute. Cela ne sera pas facile vu les dernières prestations du milieu de terrain.","pubDate":"2023-12-27 13:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/227012.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"9cfcd6d7bd97724e8e3e6fe5b769ad8e","title":"Finance Guru: Investors hold cards close to chest, cheap Everton acquisition on cards","link":"https://www.goodisonnews.com/2023/12/27/investors-could-get-cheaper-everton-takeover-with-relegation-finance-expert/","keywords":["Exclusives","Dan Plumley","everton"],"creator":["Dan Plumley"],"video_url":null,"description":"We’re delighted to welcome football finance expert Dr Daniel Plumley as our exclusive columnist. Each week he’ll be giving his views on the biggest talking points at Everton Dan Plumley has insisted that any investors will be holding their cards close to their chest, with a cheaper acquisition on the cards if Everton are relegated. It comes ... The post Finance Guru: Investors hold cards close to chest, cheap Everton acquisition on cards appeared first on Goodison News.","content":"It comes after Everton shared that other options and funding were on the table if 777 Partners dropped out of their agreed takeover of the club this season. The finance expert admitted that was a positive from Goodison Park, although staying in the Premier League is critical to the finances and cash flow of the club. he exclusively told “ “ “ “","pubDate":"2023-12-27 13:10:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2023/10/Untitled-design-1-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c42410f81022370714e2ee529338fd69","title":"«Οξύς πονοκέφαλος» για τον Σα Πίντο","link":"https://www.gazzetta.gr/football/protathlima-cyta/2288362/oxys-ponokefalos-gia-ton-sa-pinto","keywords":["Ποδόσφαιρο","Κύπρος","ΑΠΟΕΛ","Newsroom","Πρωτάθλημα Cyta"],"creator":null,"video_url":null,"description":"Με αρκετές απουσίες αναμένεται να αντιμετωπίσει τον Απόλλων Λεμεσού (2/1/24) ο ΑΠΟΕΛ και ο κόουτς Σα Πίντο μοιάζει προβληματισμένος.","content":"Σε λιγότερο από μία εβδομάδα, ο ΑΠΟΕΛ θα κληθεί να μετρήσει δυνάμεις με τον Απόλλωνα (2/1) στο Στάδιο «Αλφαμέγα» και σε καμία περίπτωση δεν θέλει να εκτροχιαστεί από τις ράγες. Μπορεί οι μέρες που διανύουμε να είναι άκρως γιορτινές και στην ομάδα της Λευκωσίας να έχουν ακόμα πιο έντονο άρωμα λόγω της πολύ καλής πορείας, αλλά αυτό δεν παρασύρει κανέναν. Ξέρουν ότι τίποτα δεν έχουν πετύχει, με τις προκλήσεις να διαδέχονται η μία την άλλη. Στο πρώτο ματς του 2024 , μάλιστα, θα στερηθούν τέσσερις ποδοσφαιριστές που αποτελούν σημείο αναφοράς στη φετινή σεζόν, κάτι που αυτομάτως θα φέρει διαφοροποιήσεις στο αρχικό σχήμα σε σχέση με προηγούμενα παιχνίδια, προκαλώντας «οξύ πονοκέφαλο» στο τεχνικό τιμ. Οι Βιγιαφάνιες , Πέτροβιτς συμπλήρωσαν απαγορευτικό αριθμό καρτών, την ίδια ώρα που ο Ντάλσιο θα απουσιάζει τις επόμενες εβδομάδες λόγω των υποχρεώσεων στο Κόπα Αφρικα . Συν τοις άλλοις, ο Κρέσπο θα παραμείνει στο ιατρικό δελτίο για μεγάλο διάστημα. Ο Σα Πίντο και οι συνεργάτες του, επεξεργάζονται διάφορα σενάρια ώστε να καλύψουν τα κενά που προκύπτουν σε ένα τόσο απαιτητικό ματς. Ο Απόλλων, θέλει να αντιδράσει έχοντας στον πάγκο νέο προπονητή, κάτι που αυξάνει αυτομάτως το στοιχείο του απρόβλεπτου για το τεχνικό τιμ του ΑΠΟΕΛ. Αξίζει να σημειωθεί πως η ΚΟΠ, ενημέρωσε πως μετά από αίτημα της αστυνομίας και σχετική απόφαση της Εκτελεστικής Επιτροπής, ο εν λόγω αγώνας για τη 17η αγωνιστική του πρωταθλήματος Cyta θα αρχίσει στις 17:00 αντί στις 19:00 που ήταν αρχικά ορισμένος.","pubDate":"2023-12-27 13:09:28","image_url":"https://www.gazzetta.gr/sites/default/files/styles/article_main_image/public/2023-12/sa_pinto_1.jpg?itok=wL09tadY","source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"6d927c3d9e57737e8a6870bc26d13be5","title":"Former Premier League star, 42, sacked as manager of non-league club after taking over from Golden Boot winner","link":"https://www.thescottishsun.co.uk/sport/11710453/south-shields-sack-julio-arca-national-league-north/","keywords":["Football","Sport"],"creator":["Gary Stonehouse"],"video_url":null,"description":null,"content":"FORMER Premier League star Julio Arca has endured a Christmas nightmare after being sacked by South Shields. The 42-year-old former Sunderland and Middlesbrough midfielder replaced fellow Black Cats legend Kevin Phillips in the dug-out of the National League North side last summer. 4 South Shields have axed ex-Prem star Julio Arca as manager Credit: Alamy 4 He took over the job after Kevin Phillips left following last season's promotion Credit: PA Arca , who previously came out of retirement to play for South Shields in the formative years of owner Geoff Thompson's reign, named ex-Ipswich and Sunderland star Tommy Miller as his assistant. Having won promotion under Phillips last season, they started their first-ever campaign in the National League North impressively. They were second in the table after beating Southport on November 11 - but they have only won one game since. The ambitious north east side have now decided to axe the Argentine following their recent slump in form. It was the 3-1 Boxing Day derby defeat to Blyth Spartans that proved to be the final straw. That result stretched South Shields’ winless run to six. Arca has now paid the price after they slipped to eighth in the table and outside of the play-off places. A club statement confirmed: “The club expresses its sincere gratitude to Julio and Tommy for their efforts during their time at 1st Cloud Arena and wishes them both well for their future endeavours. Most read in Football BLOOD ON STREETS City centre shops locked down after three stabbed in horror attack MIOFFSKI? Miovski targeted for switch to England as EFL high-flyers rival Celtic interest STAY INDOORS Storm Gerrit to batter Scots with snow, strong winds & heavy rain TODAY BABY JOY Scotland star shares exciting baby news in heartwarming video “Julio has been one of the main catalysts of the club’s growth over the last eight-and-a-half years and will always be regarded as a club legend. CASINO SPECIAL - BEST CASINO WELCOME OFFER S “We regret that his time as first-team manager has come to an end, but this decision has been made as a result of on-pitch performances and results over the last six weeks. “Julio, Tommy and their families will always be welcome at 1st Cloud Arena.” TRANSFER NEWS LIVE: All the latest news, rumours and confirmed switches from the world of football 4 Julio Arca played for both Middlesbrough and Sunderland in the top-flight Credit: Reuters 4 Tommy Miller, who played for Ipswich, has also been axed as his No2 Credit: Getty","pubDate":"2023-12-27 13:07:42","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/mi-news-sport-alamy-live-859834628.jpg?strip=all&w=640","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ae8d32c76958a9e5150e7500f71dff35","title":"Man Utd loanee Mason Greenwood urged to 'learn more Spanish' after Getafe's 'gamble'","link":"https://www.dailystar.co.uk/sport/football/man-utd-mason-greenwood-getafe-31755190","keywords":["Football"],"creator":["staronline@reachplc.com (Dan Burnham)"],"video_url":null,"description":"Mason Greenwood has been told where he can improve by Getafe boss Jose Bordalas after impressing for the La Liga side while on loan from Manchester United","content":"loanee Mason Greenwood has been urged to learn more Spanish by Getafe boss Jose Bordalas. Greenwood has established himself as a regular fixture in Bordalas' starting XI for the side. He's chipped in with five goals and four assists in 15 games across all competitions, and in a 3-3 draw away at last time out. His manager explained how they've re-discovered his form in an interview with , mentioning one improvement he could still make. Bordalas said: “Well, with a lot of patience, with a lot of calm, aware that he had been out of action for a long time without playing and practically without training. \"But we were confident because of the talent, because of the ability he had shown. Being able to go for a player of this level at Getafe is complicated, almost impossible. \"And well, given the situation, we took a gamble on him. We are happy and content because we have a great player, he is a good boy, he has fitted in really well and he just needs to learn a little more Spanish.” Bordalas believes he isn't yet firing on all cylinders, but also tipped him to return to the top of European football down the line - whether that be back at United or elsewhere. “Greenwood is a different player, with a lot of talent but in this football talent is not the main thing,\" he continued. \"It takes more work than talent. When he is at 100% we will be able to see his real level but he has the quality to play at any big club.\" Greenwood is spending the season in Spain after Manchester United's internal investigation into the sexual assault allegations against him determined he should continue his career away from his boyhood club. Touching on how the move came about, Bordalas added: \"There were conversations, he had other possibilities to play like in Serie A, but there were many clubs that did not dare because of what had happened and so on. In the end, with a lot of effort and difficulty, we all managed to get him to come to Getafe.” It remains unclear where Greenwood's future lies beyond the end of the season.","pubDate":"2023-12-27 13:06:51","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31755470.ece/ALTERNATES/s98/0_Getafe-CF-v-Valencia-CF-LaLiga-EA-Sports.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ba20b01ef5c752d45df62927ed90fbca","title":"Mercato - PSG : À peine arrivé, il prend une claque et déballe tout !","link":"https://le10sport.com/football/mercato/mercato-psg-a-peine-arrive-il-prend-une-claque-et-deballe-tout-677207","keywords":null,"creator":null,"video_url":null,"description":"Milan Skriniar est un joueur du PSG depuis le dernier mercato seulement. Mais il n’en fallait pas plus pour le convaincre de la flamme intérieure des supporters parisiens pour le Paris Saint-Germain.","content":"Milan Skriniar est un joueur du PSG depuis le dernier mercato seulement. Mais il n’en fallait pas plus pour le convaincre de la flamme intérieure des supporters parisiens pour le Paris Saint-Germain. D’ailleurs, Skriniar révèle avoir été impressionné dès ses premiers pas au Parc des princes. Dans l’hexagone, certains publics sont réputés pour être particulièrement investis derrière leurs joueurs. C’est notamment le cas de l’ OM au Vélodrome, du RC Lens à Bollaert, de l’ ASSE à Geoffroy Guichard, mais aussi le PSG avec le Parc des princes. En attestent les divers tifos ingénieux des ultras du PSG lors des rencontres de Ligue des champions entre autres. Recruté par le Paris Saint-Germain à l’intersaison, lui qui a connu l’ Inter et Giuseppe Meazza ou San Siro, Milan Skriniar avoue avoir été bluffé par l’investissement des supporters du PSG dès sa première au Parc des princes. Mercato - PSG : Transfert à 20M€, la mèche est vendue pour ce retour attendu https://t.co/kwAQdEF2Dk pic.twitter.com/7cSqk1vvpN Pour PSG TV , Milan Skriniar s’est enflammé pour l’ambiance et l’atmosphère électrique du Parc des princes. « L’ambiance au Parc des princes. Les supporters du PSG sont fantastiques. Il y avait une atmosphère incroyable pendant le premier match. J’ai vraiment été surpris car ils ont chanté pendant tout le match, pendant 95 minutes. Ils n’ont pas arrêté de chanter. Je sais que les fans du PSG ont joué un rôle très important dans l’histoire. On travaille pour les rendre heureux ». De quoi faire plaisir aux supporters et ultras du PSG .","pubDate":"2023-12-27 13:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0023/233114.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"bf84de8382fb0fbfe25bcf04f94067f1","title":"Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show","link":"https://www.dailymail.co.uk/sport/football/article-12903743/Paddy-McGuinness-DEVASTATED-axe-Question-Sport-BBC.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The broadcasting corporation announced that the programme would be axed after running for more than 50 years and laid the blame at the feet of inflation and dwindling ratings.","content":"Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show The former Top Gear presenter previously called it an 'honor' to take up the role Long-running programme was cancelled in December after over 50 years Ian Ladyman reveals the most BORING manager he's dealt with during his career - It's All Kicking Off By Tamara Prenn For Mailonline Published: 07:59 EST, 27 December 2023 | Updated: 08:14 EST, 27 December 2023 e-mail View comments Paddy McGuinness has revealed he was 'absolutely devastated' when the BBC cancelled A Question of Sport at the start of the month. The broadcasting corporation announced that the programme would be axed after running for more than 50 years and laid the blame at the feet of inflation and dwindling ratings. The show underwent its latest revamp in 2021, when McGuinness was drafted in to front the quiz as a replacement for long-standing host Sue Barker. The former British No 1 tennis player had left the show after 24 years in 2020, and new team captains Ugo Monye and Sam Quek were also called up to replace Matt Dawson and Phil Tufnell. Staff were said to be 'gutted' after the axe fell on the programme two weeks ago, and the former Top Gear presenter echoed their statements whilst hosting Stick to Football's quiz on Wednesday. Paddy McGuinness fronted the show between 2021 and 2023 after replacing Sue Barker The comedian discussed the show's abrupt ending whilst hosting the Stick to Football quiz Long-running host Barker's exit is thought to have heralded a swift drop-off in the ratings Your browser does not support iframes. 'Oh my god,' McGuinness said when prompted on the show's cancellation by Gary Neville. 'Absolutely devastated (it got cancelled). 'It's like in management, football, you go in, do your best, and that's that. But telly, you can be involved with a show and it'll run and run, or it'll finish and you move on, that's just the nature of the beast. 'But when Question of Sport, when they stopped it - and honestly think whether it's captains, me, whatever it is, whatever the reason, they say it's budget stuff, but it's all kind of stuff - I just think, it's going to come back. 'Because I'm a fan of it.' Upon his hiring two years ago, McGuinness said that it had been 'one of his favourite shows' and that he had been 'weaned on it from an early age'. Discussing his favourite aspect of hosting the programme, McGuinness cited the range of people he had been able to meet. 'Being around sportspeople, three lots of shows every day, sportspeople - from sports I wouldn't take much interest in, badminton or whatever - I loved it,' McGuinness continued. 'It's one of those ones where it's a heritage show - it's like Match of the Day, I know other football shows are available - but there are certain shows you watch and you go, 'god'. When I got that call I never hesitated. 'I loved it, and I really hope, whether it's me or anyone else, it comes back.' McGuinness prompted laughter from the assembled panel of Neville, Jamie Carragher, Roy Keane, and Ian Wright when he suggested that the former Arsenal legend should take up hosting duties if the programme was to be resurrected. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, with a show every Monday and Thursday this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement McGuinness took the reins alongside new team captains Sam Quek and Ugo Monye (right) Wright - who has just stepped back from Match of the Day after 27 years - vigorously shook his head at the prospect. Former presenter Barker shared McGuinness' viewpoint when the news broke, saying that she 'truly hoped it would return one day'. Barker had previously questioned how her sacking had been handled by the corporation in 2022, citing how she had 'no problem with being replaced' but learned that 'there is actually no way of leaving a role in a nice, pleasant and helpful manner'. Before Barker's tenure, the show was fronted by David Vine upon its debut in 1970, but became appointment viewing with her at the helm of the programme alongside her first team captains Ally McCoist and John Parrott. BBC Gary Neville Ugo Monye Inflation Share or comment on this article: Paddy McGuinness admits he's DEVASTATED by the decision to axe A Question of Sport and shares that he would love the programme to come back 'as a fan' as he opens up on the BBC cancelling the iconic show e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-27 13:14:17","image_url":"https://i.dailymail.co.uk/1s/2023/12/27/13/79368139-0-image-a-6_1703682405207.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"652d1209867af990ac9b24fcba19a760","title":"Football : \"J'avais peur\", le séjour cauchemardesque de James Rodriguez au Qatar lors de son passage à Al-Rayyan","link":"https://www.ladepeche.fr/2023/12/27/football-javais-peur-le-sejour-cauchemardesque-de-james-rodriguez-au-qatar-lors-de-son-passage-a-al-rayyan-11665624.php","keywords":["Football"],"creator":null,"video_url":null,"description":"L'ancien joueur de l'AS Monaco, James Rodriguez est revenu lors d'une interview à télévision brésilienne sur son passage à Al-Rayyan lors de la saison 2020-2021. Il révèle alors le calvaire qu'il a vécu.","content":"Après avoir porté les couleurs d’une poignée de clubs européens tels que le FC Porto, l’AS Monaco, le Real Madrid ou encore le Bayern Munich au cours de la dernière décennie, James Rodriguez optait pour un challenge à mille lieues du vieux continent. Séduit par l’aspect financier et désireux de retrouver du temps en vue de participer, à l’époque, à la Coupe du monde 2022 au Qatar, le milieu offensif colombien s’engageait en faveur d’Al-Rayyan. A lire aussi : Espagne-Colombie, ou la revanche de James Rodriguez Mais l'aventure ne s'est pas très bien déroulée pour le Colombien qui a rompu son contrat avec le club, 6 mois après sa signature. Désormais, joueur du mythique club de São Paulo, James est revenu sur cet épisode tragique lors d'une émission télévisée sur Esporte Globo, une chaîne brésilienne. \"La vie et la culture au Qatar sont très difficiles, c'était un pays où il était difficile de s'adapter. Vous savez que dans le football, tout le monde est nu quand on se douche, mais mes coéquipiers m'ont dit : \"Tu ne peux pas faire ça comme ça\". J'avais peur\", relate l'ancien prodige colombien. A lire aussi : Supercoupe d'Europe: James Rodriguez et Gareth Bale en vedettes Avant de poursuivre : \"Là-bas, tout le monde mange avec ses mains, ce qui était difficile pour moi. Ils l'ont partagé avec moi et j'ai dit : « Non merci ». J'ai demandé des couverts et ils m'ont dit : \"Non, avec ta main\" et j'ai répondu : \"Vous êtes fous, je ne mangerai pas avec ma main\". Le numéro 10 n'a alors disputé que 16 matchs avec Al-Rayyan, marquant cinq buts et réalisant sept passes décisives. Le milieu offensif a ensuite rejoint l'Olympiakos Le Pirée avant de partir vers le soleil et revenir sur son continent mais là-bas aussi le petit colombien a des difficultés a d'adapter. \"Je pensais que le football ici serait moins physique, mais il est très physique. Le jeu est souvent arrêté à cause de fautes et les collisions sont nombreuses. Je pensais que ce serait plus technique. Il y a des joueurs avec beaucoup de qualité, mais le jeu est très dur.\" racontait-il.","pubDate":"2023-12-27 13:13:46","image_url":"https://images.ladepeche.fr/api/v1/images/view/658c139da1b94e117025478a/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"d259c5275f4af27429b51ccc97ecc059","title":"Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas","link":"https://www.dailymail.co.uk/sport/football/article-12903711/Class-92-Salford-City-Neil-Wood-sacked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Salford City have confirmed the sacking of head coach Neil Wood after a 5-1 defeat at home to Tranmere on Boxing Day extended their winless run in the league to eight games.","content":"Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas Salford City are 21st in League Two after losing 5-1 to Tranmere on Boxing Day Neil Wood led the Ammies to the League Two play-offs last season Ian Ladyman reveals the most BORING manager he's dealt with during his career - It's All Kicking Off By Pa Sport Published: 06:56 EST, 27 December 2023 | Updated: 08:13 EST, 27 December 2023 e-mail 9 View comments Salford City have confirmed the sacking of head coach Neil Wood. He leaves the club with the Ammies currently on an eight-game winless league run after being beaten 5-1 by Tranmere on Boxing Day. Wood took charge of the club in May 2022 following the departure of Gary Bowyer and his first season in charge saw Salford reach the Sky Bet League Two play-offs, where they were knocked out by local rivals Stockport in a penalty shootout. However, this season sees the Ammies currently sat just two places above the relegation zone and assistant coach Simon Wiles will be in charge for their game against Grimsby on Friday. A statement on the Salford website said: 'The club would like to thank Neil for his hard work over the last 18 months, including leading the club to our highest-ever finish in Sky Bet League Two last season, and we wish him well in his future role within football. Salford City have confirmed the sacking of head coach Neil Wood Wood (left) was Salford's seventh manager since a consortium led by players Gary Neville, Paul Scholes, Nicky Butt (middle) and Ryan Giggs (second left) took over the club in 2014 Your browser does not support iframes. 'The process of appointing a new manager will commence immediately, with assistant coach Simon Wiles preparing the team for Friday's game against Grimsby.' Wood was Salford's seventh manager since a consortium led by former Manchester United players Gary Neville, Paul Scholes, Nicky Butt and Ryan Giggs took over the club in 2014. Bar Scholes, who was in charge as caretaker, all of his predecessors were relieved of their duties. Harvey Saunders, Kieron Morris, Connor Jennings, Regan Hartley and Josh Hawkes were on target as Tranmere recorded their first away win of the season on Boxing Day. Matthew Lund scored Salford’s only goal which had little impact in the context of an otherwise one-sided performance, while the hosts lost Conor McAleny to a 72nd-minute red card. After defeat, Wood did not speak to the media – leaving such responsibilities to goalkeeper Alex Cairns. Cairns said: 'We need to stick together now more than ever. It wasn’t good enough all over the pitch, we need to bounce back with a much better performance than that and people need to stick their chest out and start putting performances in. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, with a show every Monday and Thursday this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Advertisement 'We’ve always been in games, but today we were down and out and that’s the first time I’ve seen that from this group. 'The leaders within that dressing room need to keep this group together and that’s the fundamentals of football. 'We have to expect better and demand better. 'We’ve been very unfortunate with injuries – and that’s not an excuse it’s just a fact. The results haven’t been there.' Gary Neville Share or comment on this article: Class of '92 sack their SIXTH manager in eight years as Salford City boss Neil Wood is fired just TWO DAYS after Christmas e-mail Add comment Comments 9 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-27 13:13:14","image_url":"https://i.dailymail.co.uk/1s/2023/12/27/13/79368203-0-image-a-44_1703682780410.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3dec402b2029078a08ad66e95a792735","title":"Арсенал не відпустить Ремсдейла в оренду","link":"https://champion.com.ua/football/2023/12/27/946552/arsenal-ne-vidpustyt-remsdeyla-v-orendu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Арсенал не планує взимку відпускати в оренду голкіпера Аарона Ремсдейла.Про це повідомляє The Athletic.У клубі хочуть, щоб 25-річний англієць залишився до кінця сезону. Якщо він захоче піти, то за його трансфер вимагатимуть чималу суму.Чинний контрак...","content":"#Чемпіонат Англії, АПЛ , #Футбольні трансфери , #Арсенал Лондон , #Аарон Ремсдейл Джерело - theathletic.com . Арсенал не планує взимку відпускати в оренду голкіпера Аарона Ремсдейла. Про це повідомляє The Athletic. У клубі хочуть, щоб 25-річний англієць залишився до кінця сезону. Якщо він захоче піти, то за його трансфер вимагатимуть чималу суму. Чинний контракт Аарона розрахований до 2026 року. У поточному сезоні він програє конкуренцію новачку Давіду Раї – провів лише 9 матчів в усіх турнірах. Самому воротареві потрібно більше грати, щоб потрапити у склад збірної Англії на Євро-2024. Раніше повідомлялося, що Челсі може підписати воротаря Арсенала Рамсдейла.","pubDate":"2023-12-27 13:11:00","image_url":"https://champion.com.ua/storage/news/main/regular/5e8a10045f5a6a855f711cccced27ea8.jpg","source_id":"champion","source_priority":1419575,"country":["ukraine"],"category":["sports"],"language":"ukrainian"},{"article_id":"0ca4373300120f60e7c0a486b971cae0","title":"Mercato - PSG : Une superstar chargée de gérer un départ à Paris","link":"https://le10sport.com/football/mercato/mercato-psg-une-superstar-chargee-de-gerer-un-depart-a-paris-677215","keywords":null,"creator":null,"video_url":null,"description":"Le PSG va probablement avoir un indésirable de nouveau sur les bras. Les dirigeants de l'AS Rome seraient déçus des performances de Renato Sanches et voudraient le renvoyer à Paris. Le champion de…","content":"Le PSG va probablement avoir un indésirable de nouveau sur les bras. Les dirigeants de l'AS Rome seraient déçus des performances de Renato Sanches et voudraient le renvoyer à Paris. Le champion de France serait prêt à accepter la demande de la formation italienne à condition que son agent Jorge Mendes lui trouve une porte de sortie. À l'été 2022, le PSG faisait le choix d'engager Christophe Galtier comme successeur à Mauricio Pochettino . L'entraîneur français avait alors recruté un de ses anciens joueurs au LOSC , Renato Sanches . Mais cela s'est révélé être un échec et le Portugais a quitté Paris sous la forme d'un prêt cet été. Malheureusement, Renato Sanches n'a pas réussi à se refaire une santé lors de son prêt à l' AS Rome . D'après les informations de Foot Mercato les dirigeants du club italien penseraient même à casser le prêt et à renvoyer le Portugais à Paris . Il faudra donc convaincre le PSG , car le milieu de terrain est normalement prêté jusqu'à la fin de la saison. Mercato : Le PSG boucle son transfert et lui fait vivre un rêve ! https://t.co/xJ2xswTFtP pic.twitter.com/3rhqCN8sbt Toujours d'après Foot Mercato , le PSG pourrait accepter que le prêt soit cassé. Toutefois il y aurait une condition à cela, que le super-agent du Portugais, Jorge Mendes lui trouve un nouveau point de chute. Cela ne sera pas facile vu les dernières prestations du milieu de terrain.","pubDate":"2023-12-27 13:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/227012.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"9cfcd6d7bd97724e8e3e6fe5b769ad8e","title":"Finance Guru: Investors hold cards close to chest, cheap Everton acquisition on cards","link":"https://www.goodisonnews.com/2023/12/27/investors-could-get-cheaper-everton-takeover-with-relegation-finance-expert/","keywords":["Exclusives","Dan Plumley","everton"],"creator":["Dan Plumley"],"video_url":null,"description":"We’re delighted to welcome football finance expert Dr Daniel Plumley as our exclusive columnist. Each week he’ll be giving his views on the biggest talking points at Everton Dan Plumley has insisted that any investors will be holding their cards close to their chest, with a cheaper acquisition on the cards if Everton are relegated. It comes ... The post Finance Guru: Investors hold cards close to chest, cheap Everton acquisition on cards appeared first on Goodison News.","content":"It comes after Everton shared that other options and funding were on the table if 777 Partners dropped out of their agreed takeover of the club this season. The finance expert admitted that was a positive from Goodison Park, although staying in the Premier League is critical to the finances and cash flow of the club. he exclusively told “ “ “ “","pubDate":"2023-12-27 13:10:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2023/10/Untitled-design-1-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c42410f81022370714e2ee529338fd69","title":"«Οξύς πονοκέφαλος» για τον Σα Πίντο","link":"https://www.gazzetta.gr/football/protathlima-cyta/2288362/oxys-ponokefalos-gia-ton-sa-pinto","keywords":["Ποδόσφαιρο","Κύπρος","ΑΠΟΕΛ","Newsroom","Πρωτάθλημα Cyta"],"creator":null,"video_url":null,"description":"Με αρκετές απουσίες αναμένεται να αντιμετωπίσει τον Απόλλων Λεμεσού (2/1/24) ο ΑΠΟΕΛ και ο κόουτς Σα Πίντο μοιάζει προβληματισμένος.","content":"Σε λιγότερο από μία εβδομάδα, ο ΑΠΟΕΛ θα κληθεί να μετρήσει δυνάμεις με τον Απόλλωνα (2/1) στο Στάδιο «Αλφαμέγα» και σε καμία περίπτωση δεν θέλει να εκτροχιαστεί από τις ράγες. Μπορεί οι μέρες που διανύουμε να είναι άκρως γιορτινές και στην ομάδα της Λευκωσίας να έχουν ακόμα πιο έντονο άρωμα λόγω της πολύ καλής πορείας, αλλά αυτό δεν παρασύρει κανέναν. Ξέρουν ότι τίποτα δεν έχουν πετύχει, με τις προκλήσεις να διαδέχονται η μία την άλλη. Στο πρώτο ματς του 2024 , μάλιστα, θα στερηθούν τέσσερις ποδοσφαιριστές που αποτελούν σημείο αναφοράς στη φετινή σεζόν, κάτι που αυτομάτως θα φέρει διαφοροποιήσεις στο αρχικό σχήμα σε σχέση με προηγούμενα παιχνίδια, προκαλώντας «οξύ πονοκέφαλο» στο τεχνικό τιμ. Οι Βιγιαφάνιες , Πέτροβιτς συμπλήρωσαν απαγορευτικό αριθμό καρτών, την ίδια ώρα που ο Ντάλσιο θα απουσιάζει τις επόμενες εβδομάδες λόγω των υποχρεώσεων στο Κόπα Αφρικα . Συν τοις άλλοις, ο Κρέσπο θα παραμείνει στο ιατρικό δελτίο για μεγάλο διάστημα. Ο Σα Πίντο και οι συνεργάτες του, επεξεργάζονται διάφορα σενάρια ώστε να καλύψουν τα κενά που προκύπτουν σε ένα τόσο απαιτητικό ματς. Ο Απόλλων, θέλει να αντιδράσει έχοντας στον πάγκο νέο προπονητή, κάτι που αυξάνει αυτομάτως το στοιχείο του απρόβλεπτου για το τεχνικό τιμ του ΑΠΟΕΛ. Αξίζει να σημειωθεί πως η ΚΟΠ, ενημέρωσε πως μετά από αίτημα της αστυνομίας και σχετική απόφαση της Εκτελεστικής Επιτροπής, ο εν λόγω αγώνας για τη 17η αγωνιστική του πρωταθλήματος Cyta θα αρχίσει στις 17:00 αντί στις 19:00 που ήταν αρχικά ορισμένος.","pubDate":"2023-12-27 13:09:28","image_url":"https://www.gazzetta.gr/sites/default/files/styles/article_main_image/public/2023-12/sa_pinto_1.jpg?itok=wL09tadY","source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"6d927c3d9e57737e8a6870bc26d13be5","title":"Former Premier League star, 42, sacked as manager of non-league club after taking over from Golden Boot winner","link":"https://www.thescottishsun.co.uk/sport/11710453/south-shields-sack-julio-arca-national-league-north/","keywords":["Football","Sport"],"creator":["Gary Stonehouse"],"video_url":null,"description":null,"content":"FORMER Premier League star Julio Arca has endured a Christmas nightmare after being sacked by South Shields. The 42-year-old former Sunderland and Middlesbrough midfielder replaced fellow Black Cats legend Kevin Phillips in the dug-out of the National League North side last summer. 4 South Shields have axed ex-Prem star Julio Arca as manager Credit: Alamy 4 He took over the job after Kevin Phillips left following last season's promotion Credit: PA Arca , who previously came out of retirement to play for South Shields in the formative years of owner Geoff Thompson's reign, named ex-Ipswich and Sunderland star Tommy Miller as his assistant. Having won promotion under Phillips last season, they started their first-ever campaign in the National League North impressively. They were second in the table after beating Southport on November 11 - but they have only won one game since. The ambitious north east side have now decided to axe the Argentine following their recent slump in form. It was the 3-1 Boxing Day derby defeat to Blyth Spartans that proved to be the final straw. That result stretched South Shields’ winless run to six. Arca has now paid the price after they slipped to eighth in the table and outside of the play-off places. A club statement confirmed: “The club expresses its sincere gratitude to Julio and Tommy for their efforts during their time at 1st Cloud Arena and wishes them both well for their future endeavours. Most read in Football BLOOD ON STREETS City centre shops locked down after three stabbed in horror attack MIOFFSKI? Miovski targeted for switch to England as EFL high-flyers rival Celtic interest STAY INDOORS Storm Gerrit to batter Scots with snow, strong winds & heavy rain TODAY BABY JOY Scotland star shares exciting baby news in heartwarming video “Julio has been one of the main catalysts of the club’s growth over the last eight-and-a-half years and will always be regarded as a club legend. CASINO SPECIAL - BEST CASINO WELCOME OFFER S “We regret that his time as first-team manager has come to an end, but this decision has been made as a result of on-pitch performances and results over the last six weeks. “Julio, Tommy and their families will always be welcome at 1st Cloud Arena.” TRANSFER NEWS LIVE: All the latest news, rumours and confirmed switches from the world of football 4 Julio Arca played for both Middlesbrough and Sunderland in the top-flight Credit: Reuters 4 Tommy Miller, who played for Ipswich, has also been axed as his No2 Credit: Getty","pubDate":"2023-12-27 13:07:42","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/mi-news-sport-alamy-live-859834628.jpg?strip=all&w=640","source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ae8d32c76958a9e5150e7500f71dff35","title":"Man Utd loanee Mason Greenwood urged to 'learn more Spanish' after Getafe's 'gamble'","link":"https://www.dailystar.co.uk/sport/football/man-utd-mason-greenwood-getafe-31755190","keywords":["Football"],"creator":["staronline@reachplc.com (Dan Burnham)"],"video_url":null,"description":"Mason Greenwood has been told where he can improve by Getafe boss Jose Bordalas after impressing for the La Liga side while on loan from Manchester United","content":"loanee Mason Greenwood has been urged to learn more Spanish by Getafe boss Jose Bordalas. Greenwood has established himself as a regular fixture in Bordalas' starting XI for the side. He's chipped in with five goals and four assists in 15 games across all competitions, and in a 3-3 draw away at last time out. His manager explained how they've re-discovered his form in an interview with , mentioning one improvement he could still make. Bordalas said: “Well, with a lot of patience, with a lot of calm, aware that he had been out of action for a long time without playing and practically without training. \"But we were confident because of the talent, because of the ability he had shown. Being able to go for a player of this level at Getafe is complicated, almost impossible. \"And well, given the situation, we took a gamble on him. We are happy and content because we have a great player, he is a good boy, he has fitted in really well and he just needs to learn a little more Spanish.” Bordalas believes he isn't yet firing on all cylinders, but also tipped him to return to the top of European football down the line - whether that be back at United or elsewhere. “Greenwood is a different player, with a lot of talent but in this football talent is not the main thing,\" he continued. \"It takes more work than talent. When he is at 100% we will be able to see his real level but he has the quality to play at any big club.\" Greenwood is spending the season in Spain after Manchester United's internal investigation into the sexual assault allegations against him determined he should continue his career away from his boyhood club. Touching on how the move came about, Bordalas added: \"There were conversations, he had other possibilities to play like in Serie A, but there were many clubs that did not dare because of what had happened and so on. In the end, with a lot of effort and difficulty, we all managed to get him to come to Getafe.” It remains unclear where Greenwood's future lies beyond the end of the season.","pubDate":"2023-12-27 13:06:51","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31755470.ece/ALTERNATES/s98/0_Getafe-CF-v-Valencia-CF-LaLiga-EA-Sports.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"}]}