{"newsArray":[{"title":"Struggling Connolly agrees loan move to Championship side","link":"https://connachttribune.ie/struggling-connolly-agrees-loan-move-to-championship-side/","keywords":["CITY TRIBUNE","Sports","galway city tribune","aaron connolly","hull"],"creator":["John McIntyre"],"video_url":null,"description":"GALWAY’S Aaron Connolly will attempt to revive a flagging career after agreeing a loan move to cross channel Championship outfit Hull City until the end of season. The 22-year-old returns to English football after a nightmare spell with Italian Serie B side Venezia where he was restricted to only five appearances and failed to score. […]","content":"GALWAY’S Aaron Connolly will attempt to revive a flagging career after agreeing a loan move to cross channel Championship outfit Hull City until the end of season. The 22-year-old returns to English football after a nightmare spell with Italian Serie B side Venezia where he was restricted to only five appearances and failed to score. The Castlegar native had previously been on loan to Middlesborough last season where he managed to find the net twice in 18 appearances. Still on contract with Brighton, he made a sensational starting debut for the Seagulls by scoring two goals in a league win over Spurs in October of 2021. Connolly has been capped eight times at senior level by the Republic of Ireland.","pubDate":"2023-01-06 06:00:40","image_url":null,"source_id":"connachttribune","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Maigh Cuilinn manager thrilled with attitude of players ahead of big Croker test","link":"https://connachttribune.ie/maigh-cuilinn-manager-thrilled-with-attitude-of-players-ahead-of-big-croker-test/","keywords":["CITY TRIBUNE","Sports","galway city tribune","Maigh Cuilinn"],"creator":["Padraic O'Ciardha"],"video_url":null,"description":"By Pádraic Ó Ciardha WHEN the rest of us were tucking into our turkey sandwiches and selection boxes on Stephen’s Day, the Maigh Cuilinn footballers were being put through their paces on their home pitch in Baile Dóite as they continued their preparations for an All-Ireland semi-final meeting with Derry champions Glen. While it’s usually […]","content":"By Pádraic Ó Ciardha WHEN the rest of us were tucking into our turkey sandwiches and selection boxes on Stephen’s Day, the Maigh Cuilinn footballers were being put through their paces on their home pitch in Baile Dóite as they continued their preparations for an All-Ireland semi-final meeting with Derry champions Glen. While it’s usually a period of indulgence, and overindulgence in most cases, it was a very different Christmas for Don Connellan and his players this time around. After a hectic 2022 campaign which saw them crowned Galway senior football champions for just the second time and which also saw the Connacht title follow the Frank Fox out west in early December, there hasn’t been a whole lot of time for Maigh Cuilinn to sit back and savour their success as this weekend’s trip to Croke Park loomed large. Connellan says the players were given some time after that Connacht final victory over Tourlestrane of Slige to celebrate and recuperate, but it wasn’t long until the bibs and cones were out again and it was back to business as training continued over the holidays. “We did a bit Stephen’s Day, just to keep it going. It’s new territory for us,” says the Roscommon native. “It’s different if you’re Corofin, where maybe they had every winter and Christmas planned down to a tee, but it’s all new to us. We’ll see whether we managed it ok.” Outside of the pitch, Connellan says he was light on the instructions given to his players on how to enjoy their Christmas, believing there wasn’t much need to warn his men off the extra slice of ham or the heavy pour on the wine. For more, read this week’s Galway City Tribune. Connacht Tribune Digital Edition App Download the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play. Or purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE. Get the Connacht Tribune Live app The Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.    ","pubDate":"2023-01-06 06:00:27","image_url":null,"source_id":"connachttribune","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Georgia, TCU, Tulane lead winners and losers from college football bowl season","link":"https://ca.sports.yahoo.com/news/georgia-tcu-tulane-lead-winners-135510647.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-06 05:36:48","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Football: Berhalter wants to stay on as US coach despite recent turmoil","link":"https://www.straitstimes.com/sport/football/football-berhalter-wants-to-stay-on-as-us-coach-despite-recent-turmoil","keywords":null,"creator":null,"video_url":null,"description":"January 06, 2023 1:25 PMLOS ANGELES – Gregg Berhalter on Thursday said he hopes US Soccer will keep him on as head coach of the men’s team despite an ongoing investigation into a domestic violence incident that occurred between him and his now-wife 31 years ago.","content":"LOS ANGELES – Gregg Berhalter on Thursday said he hopes US Soccer will keep him on as head coach of the men’s team despite an ongoing investigation into a domestic violence incident that occurred between him and his now-wife 31 years ago. His remarks came one day after it was reported that Danielle Reyna, the mother of US midfielder Gio Reyna, had informed the federation of the 1991 episode after she became frustrated with Berhalter criticising her son after the World Cup. “When we started in 2018, we wanted to change the way the world views American soccer,” Berhalter, whose contract with the team expired on Dec 31, said in an interview with the Harvard Business Review. “And I think when you ask around the world now about our team, the world sees us in a complete different light. But now it’s about being able to take that next step, and that next step is doing something that no US team has ever done and that’s get to the semi-finals and see what happens from there. “So there’s a lot of great challenges involved and of course I’d like to continue my role.” Berhalter told a conference after returning from Qatar that a player on the team was “clearly not meeting expectations on and off the field” and that he had considered sending that player home. Gio Reyna, 20, later confirmed in an Instagram post that Berhalter was talking about him. Gio is the son of Claudio Reyna, who played alongside Berhalter for the US team at the 2002 World Cup and is now sporting director for MLS (Major League Soccer) side Austin FC. Berhalter said he and his wife of 25 years Rosalind had moved on from the incident where he kicked her legs amid an argument outside of a bar when he was an 18-year-old college student and was sad to have it come up so publicly now. “The events of that night 31 years ago and the lessons learnt from that set the foundation for our relationship moving forward,” he said. “And it’s a loving relationship, a devoted relationship and we have four amazing kids to show for it.” Berhalter led the squad to the round of 16 of the World Cup in Qatar where they were knocked out by the Netherlands. The federation on Wednesday said current assistant coach Anthony Hudson would lead the team during their January camp while a “technical review” of the men’s national team programme was conducted. REUTERS","pubDate":"2023-01-06 05:25:31","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Football : la réserve du Ploërmel FC déjoue les pronostics en R2","link":"https://actu.fr/bretagne/ploermel_56165/football-la-reserve-du-ploermel-fc-dejoue-les-pronostics-en-r2_56351833.html","keywords":null,"creator":null,"video_url":null,"description":"Promue en début de saison en R2, l'équipe réserve du Ploërmel FC, dans le Morbihan, est actuellement deuxième au classement. Une très belle surprise.","content":null,"pubDate":"2023-01-06 04:46:14","image_url":null,"source_id":"actu","country":["france"],"category":["sports"],"language":"french"},{"title":"「とめらんねええええ」三笘薫の美技弾、“全角度”映像で再脚光！「何回見ても良いトラップ」 - サッカーダイジェストWeb","link":"https://news.google.com/__i/rss/rd/articles/CBMiNWh0dHBzOi8vd3d3LnNvY2NlcmRpZ2VzdHdlYi5jb20vbmV3cy9kZXRhaWwvaWQ9MTI0NDk50gFBaHR0cHM6Ly93d3cuc29jY2VyZGlnZXN0d2ViLmNvbS9uZXdzL2RldGFpbC9pZD0xMjQ0OTk_bW9iaWxlYXBwPTE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"「とめらんねええええ」三笘薫の美技弾、“全角度”映像で再脚光！「何回見ても良いトラップ」  サッカーダイジェストWeb三笘薫の負けん気に海外称賛 切り裂く2戦連発に「デンジャラス」 (2023年1月6日掲載) - ライブドアニュース  livedoor三笘は「最新のダイヤモンドの1つ」と絶賛 英メディアが特集、唯一の課題を挙げるも「次の成長の一歩」と楽観的  Football ZONE webGoogle ニュースですべての記事を見る","content":null,"pubDate":"2023-01-06 03:01:34","image_url":null,"source_id":"google","country":["japan"],"category":["sports"],"language":"japanese"},{"title":"Football : Madagascar compte dix-neuf arbitres internationaux","link":"https://midi-madagasikara.mg/2023/01/06/football-madagascar-compte-dix-neuf-arbitres-internationaux/","keywords":["Sports","Arbitres","FIFA","Football","Madagascar"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"La Fédération internationale de football association (FIFA) a dévoilé la liste des arbitres internationaux exerçant en 2023. La Grande île peut être fière des 19 arbitres sélectionnés. Dix-neuf arbitres malgaches pourront officier les matches internationaux pour cette année 2023. L’instance internationale a publié les noms des arbitres internationaux dans le monde. Pour Madagascar, la liste […] L’article Football : Madagascar compte dix-neuf arbitres internationaux est apparu en premier sur Midi Madagasikara.","content":"La Fédération internationale de football association (FIFA) a dévoilé la liste des arbitres internationaux exerçant en 2023. La Grande île peut être fière des 19 arbitres sélectionnés. Dix-neuf arbitres malgaches pourront officier les matches internationaux pour cette année 2023. L’instance internationale a publié les noms des arbitres internationaux dans le monde. Pour Madagascar, la liste est composée de 13 hommes et 6 femmes. Cinq noms sont retenus dont deux femmes et quatre hommes pour les arbitres centraux. Le nom de Andofetra Rakotojaona, l’arbitre international malgache depuis 2014 figure dans la liste. Il est habitué à arbitrer des rencontres internationales et figure parmi les arbitres africains ayant décroché un contrat professionnel avec la CAF. Ses coéquipiers Abdoul Kanoso, Njaka Lovasoa Raharimanantsoa, Ben Ibrahim Tsimanohitsy et les deux femmes entre autres Rosa Dominique Hanjavola et Rosalie Rosalie, complètent la liste. La plupart sont des arbitres assistants qui sont au nombre de 11 en tout. Il n’y a pas de nouvelles têtes car le plus récent est dans ce monde depuis 2019, s’agissant de Dimbiniaina Andriantianarivelo. La Malgache Pélagie Lidwine Rakotozafinoro est la plus ancienne parmi eux, étant arbitre de la FIFA depuis 2004. Elle n’a jamais cessé de progresser. En 25 ans de carrière internationale, Pélagie a tout vu. Elle est la seule arbitre malgache à avoir arbitré les Jeux olympiques, la Coupe du monde, sans parler des finales de la Coupe d’Afrique des Nations (CAN) féminine, les Jeux olympiques de la jeunesse et la CAN U17 chez les garçons. Par ailleurs, deux Malgaches sont retenus dans la discipline Beach soccer à savoir Hachim Said et Maolidy Tsaralaza. Madagascar ne dispose pas encore d’arbitres internationaux de Futsal et de VAR. C’est le même cas pour Seychelles et Comores. Pour l’heure, seule l’île Maurice détient dans sa liste des arbitres internationaux de Futsal et de VAR au niveau de l’Océan Indien. En 2020, 24 arbitres ont réussi au « fitness test », un test d’évaluation des qualités physiques imposé par la Fédération internationale de football association (FIFA) en 2020 aux arbitres internationaux. Arbitres : – Andofetra Rakotojaona – Rosalie rosalie – Dominique Rosa Hanjavola – Abdoul Kanoso – Njaka Lovasoa Raharimanantsoa – Ibrahim Ben Tsimanohitsy. Arbitres assistants : – Dimbiniaina Andrintianarivelo – Pierre Andriavoavonjy – Lionel Hasinjarasoa – Augustin Herinirina – Velomanana Jinoro – Lidwine Rakotozafinoro – Nivo Ramanantsara – Ravonirina Harizo Randrianarivelo – Pauline Rasoanirina – Danison Ravelomandimby – Herilalaina Soarinoro Asom Razafitsalama Arbitres de beach soccer – Saïd Hachim – Tsaralaza Maolidy Manjato Razafy","pubDate":"2023-01-06 03:00:00","image_url":null,"source_id":"madagasikara","country":["madagascar"],"category":["sports"],"language":"french"},{"title":"Football – CHAN : Les Barea contre les Congolais en amical ce jour","link":"https://midi-madagasikara.mg/2023/01/06/football-chan-les-barea-contre-les-congolais-en-amical-ce-jour/","keywords":["Sports","Barea","CHAN","Congo","Football","Madagascar"],"creator":["Rédaction Midi Madagasikara"],"video_url":null,"description":"L’équipe nationale des Barea est au grand complet en Tunisie. Les protégés du coach Romuald Rakotondrabe alias Rôrô joueront contre les Diables Rouges du Congo Brazzaville ce jour au stade Tabarka. Ce match entre dans le cadre de la préparation à la septième édition du Championnat d’Afrique des Nations réservée aux joueurs locaux ou CHAN. […] L’article <strong>Football – CHAN</strong> : <strong>Les Barea contre les Congolais en amical ce jour </strong> est apparu en premier sur Midi Madagasikara.","content":"L’équipe nationale des Barea est au grand complet en Tunisie. Les protégés du coach Romuald Rakotondrabe alias Rôrô joueront contre les Diables Rouges du Congo Brazzaville ce jour au stade Tabarka. Ce match entre dans le cadre de la préparation à la septième édition du Championnat d’Afrique des Nations réservée aux joueurs locaux ou CHAN. La délégation malgache est arrivée sur le sol tunisien, lundi. Tous les jours, la bande à Nina a entamé des séances d’entraînement pour s’adapter au gazon naturel. En effet, deux matches tests de préparation sont au programme des Barea A’. Ils joueront contre le Mena du Soudan ce lundi 9 janvier. Logée dans le groupe C, l’équipe malgache jouera son match inaugural contre les Ghanéens. « C’est un match très important et nous nous devons de le remporter, c’est notre premier objectif », a fait savoir le coach. Les Lions de l’Atlas du Maroc, les tenants du titre, seront au menu des Barea lors de la deuxième journée du 19 avant d’affronter les Crocodiles du Nil du Soudan le 23 janvier. À propos du Maroc, l’incertitude plane toujours au sujet de sa participation au tournoi à huit jours du coup d’envoi. En colère contre son voisin et pays-hôte, l’Algérie, qui a coupé les vols directs en provenance du Royaume en raison des relations diplomatiques tendues, le double tenant du titre menace en effet de boycotter la compétition si sa sélection ne peut pas rejoindre directement Constantine . « Ce problème entre les deux pays ne perturbe pas le moral des Barea. Cela ne change pas également la stratégie du coach. Nous continuons notre préparation, que le Maroc soit présent ou pas. Dans tous les cas, nous serons prêts », a ajouté le coach. Manjato Razafy","pubDate":"2023-01-06 03:00:00","image_url":null,"source_id":"madagasikara","country":["madagascar"],"category":["sports"],"language":"french"},{"title":"FOOTBALL – CHAN – Retrouvailles Barea-Diables rouges ce soir","link":"https://lexpress.mg/06/01/2023/football-chan-retrouvailles-barea-diables-rouges-ce-soir/","keywords":["Sport"],"creator":["Serge Rasanda"],"video_url":null,"description":"Madagascar et le Congo Brazzaville se retrouvent trois mois et demi après le match amical au Maroc, dans le cadre de la préparation à la Coupe d’Afrique des nations. Premier match amical en Tuni­sie. Les Barea de Madagascar affrontent en match amical les Diables Rouge du Congo Brazzaville, une semaine avant le coup d’envoi de la […] L’article FOOTBALL – CHAN – Retrouvailles Barea-Diables rouges ce soir est apparu en premier sur L'Express de Madagascar.","content":"Madagascar et le Congo Brazzaville se retrouvent trois mois et demi après le match amical au Maroc, dans le cadre de la préparation à la Coupe d’Afrique des nations. Premier match amical en Tuni­sie. Les Barea de Madagascar affrontent en match amical les Diables Rouge du Congo Brazzaville, une semaine avant le coup d’envoi de la septième édition du Championnat d’Afri­que des nations (Chan). Les équipes A des deux nations se sont rencontrées au Maroc toujours en amical, il y a trois mois et demi, plus précisément le 24 septembre, dans le cadre de la préparation à la phase qualificative de la Coupe d’Afrique des nations. Les hommes du sélectionneur français, Nicolas Dupuis, y ont été tenus en échec par trois buts partout. Le match amical se tiendra ce jour, à Tunis, capitale tunisienne à 17 heures heure locale, à 19 heures à Madagas­car. Ce sera le troisième match test pour les protégés du sélectionneur Romuald Félix Rakotondrabe alias «Roro». Les Barea ont défait lors du premier match test la sélection des expatriés de La Réunion par 3 buts à 1, le 17 décembre, puis ils se sont imposés par un but à rien face à l’Uscafoot, club en Pro League, le vendredi 30 décembre. L’équipe nationale malgache qui poursuit sa préparation en Tunisie depuis lundi, est à sa cinquième séance d’entrainement jusqu’à hier, dans la ville de Tarabak. «Ces derniers jours, nous avons fignolé le plan et la tactique de jeu en vue de ces deux matchs tests», confie Roro Rakotondrabe. Supérieur sur le papier Madagascar comme le Congo Brazzaville, préparent tous les deux la phase finale du Chan qui s’étalera du 13 janvier au 4 février en Algérie. Comme mentionné ci-dessus, les deux équipes se sont séparées sur le score de 3 buts partout, à la fin septembre de l’an passé. Chanceux, le Congo Brazza­ville a été tiré dans le groupe E, une poule de trois avec le Cameroun et le Niger. Les Diables Rouges sont supérieurs par rapport aux Barea sur le papier. Cette nation est classée 99e mondiale et 21e en Afrique contre respectivement 102e au classement Fifa et 23e dans le continent pour Madagascar. En outre, le Congo compte au moins trois titres continentaux pour ne citer que ceux de la CAN en 1972, la CAN Junior en 2007, les Jeux Africains en 1965, sans oublier sa double médaille d’or aux Jeux de la francophonie en 2009 et 2013. Mais sur le papier toujours, Madagascar a effectué la meilleure récente performance en atteignant les quarts de finale de la CAN en Égypte en 2019. Après le match contre le Congo de ce soir, l’équipe malgache jouera un autre match de préparation contre le Niger ce lundi, toujours à Tunis, avant de rallier l’Algérie, pays hôte du CHAN version 2022.","pubDate":"2023-01-06 02:45:19","image_url":null,"source_id":"lexpress","country":["madagascar"],"category":["sports"],"language":"french"},{"title":"Colombian stadium first in Latin America renamed after Pele","link":"https://www.capitalfm.co.ke/sports/2023/01/06/colombian-stadium-first-in-latin-america-renamed-after-pele/","keywords":["Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"BOGOTA, Colombia, Jan 6 – Colombia is the first Latin American country to meet FIFA president Gianni Infantino’s request to name a stadium after Pele. Infantino on Monday said world football’s governing body would ask all countries to name a stadium after the Brazilian icon, widely regarded as the greatest footballer of all time, who […] The post Colombian stadium first in Latin America renamed after Pele appeared first on Capital Sports.","content":"BOGOTA, Colombia, Jan 6 – Colombia is the first Latin American country to meet FIFA president Gianni Infantino’s request to name a stadium after Pele. Infantino on Monday said world football’s governing body would ask all countries to name a stadium after the Brazilian icon, widely regarded as the greatest footballer of all time, who died last week after a long battle with illness. And late on Wednesday, the governor of Colombia’s southern Meta department, Juan Guillermo Zuluaga announced on Twitter that a stadium in the city of Villavicencio “will be called BELLO HORIZONTE ‘REY PELE’.” “Future generations must know who this world football icon was,” said Zuluaga. The 15,000 capacity stadium inaugurated in 1958 was previously called simply Bello Horizonte, which means “beautiful skyline” in Spanish. It is the home of modest second division Colombian side Llaneros. Pele died on December 29 aged 82 following a long battle with colon cancer. He was buried on Tuesday in Santos, the city where he played most of his football career and made his name. While attending Pele’s wake, Infantino said he would ask all FIFA’s member federations to pay tribute to Pele by renaming a stadium after the three-time World Cup winner. Colombia was beaten to the stadium move by Cape Verde, whose prime minister Jose Ulisses Correia e Silva had announced earlier on Wednesday the renaming of the national stadium in the capital Praia. The northeastern Brazilian city of Maceio has since 1979 had a stadium called “Rei Pele” (King Pele) although it is commonly known as the Trapichao. The post Colombian stadium first in Latin America renamed after Pele appeared first on Capital Sports.","pubDate":"2023-01-06 01:36:48","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"No timescale on Sancho return, says Man Utd boss Ten Hag","link":"https://www.capitalfm.co.ke/sports/2023/01/06/no-timescale-on-sancho-return-says-man-utd-boss-ten-hag/","keywords":["Football","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"MANCHESTER, United Kingdom, Jan 5 – Erik ten Hag says he cannot rush the return of Jadon Sancho, admitting there is no timescale on when the winger will return to action for Manchester United. Sancho, a big-money signing from Borussia Dortmund 18 months ago, has not featured for United since playing 52 minutes of a […] The post No timescale on Sancho return, says Man Utd boss Ten Hag appeared first on Capital Sports.","content":"MANCHESTER, United Kingdom, Jan 5 – Erik ten Hag says he cannot rush the return of Jadon Sancho, admitting there is no timescale on when the winger will return to action for Manchester United. Sancho, a big-money signing from Borussia Dortmund 18 months ago, has not featured for United since playing 52 minutes of a 1-1 draw at Chelsea in October and was left out of England’s World Cup squad. Ten Hag said last month the 22-year-old was “not in the right status or fitness state” and he missed United’s two-match tour of Spain, instead placed on an individual fitness programme in the Netherlands. Sancho has returned to the club’s training ground at Carrington but his involvement has so far been limited to small group sessions as he concentrates on his own personal plan. “I would like to have Jadon back as soon as possible, but I can’t force this process,” Ten Hag said on Thursday. “I will do everything that’s in my power but some processes you can’t force and this is one of them. “I also have to show patience although I don’t have patience because we have a lack of opportunities in the front line, players who are available and capable to contribute not only in the Premier League but on the highest standard in football. “Jadon is one who, when he is fit, he will contribute and we will have an extra option and so we have more chance to win a lot of games.” Ten Hag, speaking ahead of United’s FA Cup third-round tie against Everton on Friday, believes Sancho is heading in the right direction but said there was a long way to go before he could be considered ready for a comeback. “With the physical, there’s also a connection of mental,” he said. “I think he’s now making good progress on the physical part and that will help him. “I hope he can return quickly but I can’t say how long it will be. In this moment, he is not fit enough, no. We have some hurdles to take. I think he’s (heading) in a good direction.” The post No timescale on Sancho return, says Man Utd boss Ten Hag appeared first on Capital Sports.","pubDate":"2023-01-06 01:36:10","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Report: Bayern Munich’s Kingsley Coman switches representation to CAA Base","link":"https://www.bavarianfootballworks.com/2023/1/6/23539523/bayern-munich-kingsley-coman-agent-switch-fabrizio-romano-bundesliga-ucl-caa-base-pini-zahavi-dfb","keywords":null,"creator":["TomAdams71"],"video_url":null,"description":null,"content":"Photo by ANP via Getty Images Could this be a potential sign that Coman wants to be shopped around to other clubs? Per football transfer expert Fabrizio Romano, Bayern Munich’s Kingsley Coman has officially changed his representation to CAA Base, a highly reputed agency for footballers whose main offices are located in London, England. CAA Base also represents a laundry list of superstars across Europe including Heung-Min Son, Richarlison, Jorginho, Raphael Varane, James Maddison, and Gleison Bremer, who Bayern was once linked with, amongst others. Christian Emile of CAA Base, who will be directly representing Coman, was excited at the opportunity to work with the 2018 World Cup winner with France. “Coman is a world class talent, having won 27 trophies by the age of 26. We are excited to support him as he strives to achieve further success,” he said. Emile will also be working alongside Coman’s father, who has always had a big say in the dealings of his son. Official. New agent for FC Bayern and France star Kingsley Coman, he’s now with CAA Base. #transfers“Coman is a world class talent, having won 27 trophies by the age of 26. We are excited to support him as he strives to achieve further success”, said agent Christian Emile. pic.twitter.com/JES3IHadIZ— Fabrizio Romano (@FabrizioRomano) January 3, 2023 After extending his contract at the beginning of 2022, Coman’s current contract with Bayern runs through June 2027, though it is not yet known if his change in representation was an anticipatory move to potentially be shopped around to other clubs. So far this season, he’s made a total of 14 appearances, tallying a goal and five assists in the process. By no means has it been his best season, but he missed a handful of matches through a red card suspension from the last Bundesliga match of last season and injury. It is also worth remembering what Coman did during the fall of 2021. He had temporarily hired Pini Zahavi to try to broker a move away from Bayern to the Premier League. At the time, he was reluctant so sign a new deal with Bayern knowing that there was plenty of interest from Premier League clubs in England. His father had also made it clear that the winger preferred a move to England, but when a move never wound up materializing, with Coman and Zahavi eventually parting ways. Bayern fans don’t need to be reminded of the dealings they’ve had with Zahavi between both Robert Lewandowski and David Alaba, who both wound up leaving Bayern for FC Barcelona and Real Madrid, respectively.","pubDate":"2023-01-06 01:30:00","image_url":null,"source_id":"bavarianfootballworks","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Shorunmu Moves To Recruit New Goalkeepers","link":"https://www.thetidenewsonline.com/2023/01/06/shorunmu-moves-to-recruit-new-goalkeepers/","keywords":["Sports"],"creator":["The Tide"],"video_url":null,"description":"Super Eagles goalkeepers’ trainer, Ike Shorunmu, is set to tour various stadia, where the Nigeria Professional Football League (NPFL) matches will hold to pick eligible goal stoppers to fight for shirt in the national team. Shorunmu told Tidesports source that his desire is to ensure that more goalkeepers in the domestic league get opportunity to […] The post Shorunmu Moves To Recruit New Goalkeepers appeared first on :::...The Tide News Online:::....","content":"Super Eagles goalkeepers’ trainer, Ike Shorunmu, is set to tour various stadia, where the Nigeria Professional Football League (NPFL) matches will hold to pick eligible goal stoppers to fight for shirt in the national team. Shorunmu told Tidesports source that his desire is to ensure that more goalkeepers in the domestic league get opportunity to compete alongside their foreign counterparts for the No.1 shirt in the Super Eagles. “The transformation process of the Super Eagles continues, and as the goalkeepers trainer, I have a huge role to play,” he stated. Shorunmu assured that the goalkeeping department would take a better shape. He, however, urged football-loving Nigerians to stop castigating the Super Eagles based on their past mistakes. “The team needs the support and encouragement of every Nigerian to excel. When the league starts on January 8, I will begin the search for more domestic goalkeepers from the NPFL to be invited to the Super Eagles. I don’t understand why some people keep saying that domestic goalkeepers are not respected in the national team. “The league has not started, and you don’t expect a coach to invite a goalkeeper from the NPFL, who has not been active to the national team. It doesn’t work that way. Nigeria league has quality goalkeepers, and my mission is to select the best and give them equal opportunity to fight for shirt with their foreign counterparts.” Shorunmu continues: “I am happy the NPFL league will kick off soon. This will afford me the opportunity to go round the centres and see the performance of keepers in various clubs to be penciled down for a place in the national team.” The Interim Management Committee (IMC) of the Nigeria Professional Football League (NPFL), had fixed January 8 as commencement date of the 2022/23 season. The league will be in abridged format of two groups of 10 clubs in Group A and Group B. The formal public presentation of takeoff grants to the 20 participating Nigeria Professional Football League (NPFL) clubs in the 2022/23 season, will hold today at the Sandralia Hotel, Abuja. The ceremony is holding ahead of the new season, which starts on January 8, with Match day one in Groups A and B of the Abridged League format. The Interim Management Committee (IMC) arrived at the date to ensure that the league ends in May to align with the international calendar. Expected at the event are the President of the Nigeria Football Federation (NFF), Ibrahim Gusau, the leadership of the Nigeria Referees Association (NRA) and other stakeholders. According to the IMC Chairman, Gbenga Elegbeleye, the occasion will afford the Gusau-led NFF opportunity to address stakeholders on the support the football house will bring to upgrade the country’s league to international standards. “The presentation ceremony will have in attendance, the NFF President, Ibrahim Gusau, who wants to address all stakeholders ahead of the start of the season to assure them that the football house will support every move to upgrade our league in terms of transparency, level playing ground and improved performance.’’ “It is also a platform for the IMC to make a public presentation of the takeoff grant to our participating clubs to put them on a good pedestal to start the season,” Elegbeleye stated. The Akwa United versus Bendel Insurance fixture in Uyo will be the flagship centre for the commencement of the NPFL. The Okporowo-Ogbakiri in Emohua Local Government Area, in Rivers State, Football Tournament tagged” Engr. Temple Orlu Football Compettion” drew to a close at the weekend, at Okporowo Ogbakiri Primary School field. It was witnessed by huge crowd as Bayern Munich and Brussia Dortmund displayed what can be described as football artistry in the finals of the competition. At the end of the match Bayern emerged champions as they defeated Brussia Dortmund 3-1 via penalty shoot out after playing goalless in regulation time. Speaking with sports journalists shortly after the game the sponsor of the tournament Engr. Temple Orlu, expressed joy over the successful completion of the tournament, described the 2022 edition as the best so far. According to him, next edition which will be the seventh edition will be better than previous editions because in every year there will improvement and scholarship will be awarded to deserving students in next edition. “I am grateful to God for seeing us through in this competition. I also thank the community leaders for supporting me to actualize the tournament. “I further appreciate the nine communities that made up Okporowo-Ogbakiri for their participation. In next edition I will introduce female participation and other sporting events. “The overall purpose of this tournament was to unite the people, love and harmonious living, especially to ensure that youths are engaged meaningfully and shun social vices”, Engr. Orlu said. Earlier, the registrar of Rivers State University (RSU) Enyindah Sydney eulogised Engr. Orlu for taken the bold step to unite the people through football. He said the sponsor deserves commendation for spending his hard earned resources on peace and development of the community. He further pledged to support the next edition to sustain the annual event, saying that the development of Okporowo should be paramount to every indigene. Enyimba coach, George Finidi, has promised that the eight-time winners of the Nigeria Professional Football League will perform better than they did last season, Tidesports source reports. Enyimba finished the 2021/22 season in seventh position on 52 points from 38 matches in Finidi’s first season in charge of the team and the Super Eagles assistant coach blamed his side’s abysmal show last season to inconsistency. “Enyimba will be better than last season,” Finidi told Tidesports source. “While I can’t say where we will end up, I can assure you it will be far better than last season. “This club is one of the biggest in Africa and the biggest and best in Nigeria and cannot afford not to play in the continent for too long. Enyimba will bounce back next season and be stronger too. “We played some good football last season but inconsistency in games was our bane. We, at times, went on a winning run of matches that gave the impression that the title was ours to grab, but all of a sudden, we slumped with some bad results both at home and away. “Our form was on and off throughout the season and for a team like Enyimba, that is not acceptable. We pushed to at least get one of the tickets to play in the continent but in the end, it didn’t come to fruition. “We shall give it our best and see how it goes, but we the officials, players, management and fans are disappointed and we shall try to mend things next season.” Finidi also described his first season as a coach in the NPFL as bad, saying he didn’t achieve his objectives. “My first season is an experience for me, I thank the management for the opportunity. I must say it was a bad season for me because we did not achieve our objectives. “It was not a completely failed project because we played good football but could not put the ball in the net. My second season will hopefully be better.” Enyimba will hope to win NPFL title for a ninth time, having last lifted it in 2019.","pubDate":"2023-01-06 00:52:34","image_url":null,"source_id":"thetidenewsonline","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"IMC Presents Take-Off Grant To NPFL Clubs","link":"https://www.thetidenewsonline.com/2023/01/06/imc-presents-take-off-grant-to-npfl-clubs/","keywords":["Sports"],"creator":["The Tide"],"video_url":null,"description":"The formal public presentation of takeoff grants to the 20 participating Nigeria Professional Football League (NPFL) clubs in the 2022/23 season, will hold today at the Sandralia Hotel, Abuja. The ceremony is holding ahead of the new season, which starts on January 8, with Match day one in Groups A and B of the Abridged […] The post IMC Presents Take-Off Grant To NPFL Clubs appeared first on :::...The Tide News Online:::....","content":"The formal public presentation of takeoff grants to the 20 participating Nigeria Professional Football League (NPFL) clubs in the 2022/23 season, will hold today at the Sandralia Hotel, Abuja. The ceremony is holding ahead of the new season, which starts on January 8, with Match day one in Groups A and B of the Abridged League format. The Interim Management Committee (IMC) arrived at the date to ensure that the league ends in May to align with the international calendar. Expected at the event are the President of the Nigeria Football Federation (NFF), Ibrahim Gusau, the leadership of the Nigeria Referees Association (NRA) and other stakeholders. According to the IMC Chairman, Gbenga Elegbeleye, the occasion will afford the Gusau-led NFF opportunity to address stakeholders on the support the football house will bring to upgrade the country’s league to international standards. “The presentation ceremony will have in attendance, the NFF President, Ibrahim Gusau, who wants to address all stakeholders ahead of the start of the season to assure them that the football house will support every move to upgrade our league in terms of transparency, level playing ground and improved performance.’’ “It is also a platform for the IMC to make a public presentation of the takeoff grant to our participating clubs to put them on a good pedestal to start the season,” Elegbeleye stated. The Akwa United versus Bendel Insurance fixture in Uyo will be the flagship centre for the commencement of the NPFL. The post IMC Presents Take-Off Grant To NPFL Clubs appeared first on :::...The Tide News Online:::....","pubDate":"2023-01-06 00:52:04","image_url":null,"source_id":"thetidenewsonline","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Bayern Wins Okporowo-Ogbakiri Football Tournament …Sponsor Assures Improvement","link":"https://www.thetidenewsonline.com/2023/01/06/bayern-wins-okporowo-ogbakiri-football-tournament-sponsor-assures-improvement/","keywords":["Sports"],"creator":["The Tide"],"video_url":null,"description":"The Okporowo-Ogbakiri in Emohua Local Government Area, in Rivers State, Football Tournament tagged” Engr. Temple Orlu Football Compettion” drew to a close at the weekend, at Okporowo Ogbakiri Primary School field. It was witnessed by huge crowd as Bayern Munich and Brussia Dortmund displayed what can be described as football artistry in the finals of the […] The post Bayern Wins Okporowo-Ogbakiri Football Tournament …Sponsor Assures Improvement appeared first on :::...The Tide News Online:::....","content":"The Okporowo-Ogbakiri in Emohua Local Government Area, in Rivers State, Football Tournament tagged” Engr. Temple Orlu Football Compettion” drew to a close at the weekend, at Okporowo Ogbakiri Primary School field. It was witnessed by huge crowd as Bayern Munich and Brussia Dortmund displayed what can be described as football artistry in the finals of the competition. At the end of the match Bayern emerged champions as they defeated Brussia Dortmund 3-1 via penalty shoot out after playing goalless in regulation time. Speaking with sports journalists shortly after the game the sponsor of the tournament Engr. Temple Orlu, expressed joy over the successful completion of the tournament, described the 2022 edition as the best so far. According to him, next edition which will be the seventh edition will be better than previous editions because in every year there will improvement and scholarship will be awarded to deserving students in next edition. “I am grateful to God for seeing us through in this competition. I also thank the community leaders for supporting me to actualize the tournament. “I further appreciate the nine communities that made up Okporowo-Ogbakiri for their participation. In next edition I will introduce female participation and other sporting events. “The overall purpose of this tournament was to unite the people, love and harmonious living, especially to ensure that youths are engaged meaningfully and shun social vices”, Engr. Orlu said. Earlier, the registrar of Rivers State University (RSU) Enyindah Sydney eulogised Engr. Orlu for taken the bold step to unite the people through football. He said the sponsor deserves commendation for spending his hard earned resources on peace and development of the community. He further pledged to support the next edition to sustain the annual event, saying that the development of Okporowo should be paramount to every indigene. The post Bayern Wins Okporowo-Ogbakiri Football Tournament …Sponsor Assures Improvement appeared first on :::...The Tide News Online:::....","pubDate":"2023-01-06 00:51:33","image_url":null,"source_id":"thetidenewsonline","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"NPFL: Finidi Assures Of Better Performance","link":"https://www.thetidenewsonline.com/2023/01/06/npfl-finidi-assures-of-better-performance/","keywords":["Sports"],"creator":["The Tide"],"video_url":null,"description":"Enyimba coach, George Finidi, has promised that the eight-time winners of the Nigeria Professional Football League will perform better than they did last season, Tidesports source reports. Enyimba finished the 2021/22 season in seventh position on 52 points from 38 matches in Finidi’s first season in charge of the team and the Super Eagles assistant coach […] The post NPFL: Finidi Assures Of Better Performance appeared first on :::...The Tide News Online:::....","content":"Enyimba coach, George Finidi, has promised that the eight-time winners of the Nigeria Professional Football League will perform better than they did last season, Tidesports source reports. Enyimba finished the 2021/22 season in seventh position on 52 points from 38 matches in Finidi’s first season in charge of the team and the Super Eagles assistant coach blamed his side’s abysmal show last season to inconsistency. “Enyimba will be better than last season,” Finidi told Tidesports source. “While I can’t say where we will end up, I can assure you it will be far better than last season. “This club is one of the biggest in Africa and the biggest and best in Nigeria and cannot afford not to play in the continent for too long. Enyimba will bounce back next season and be stronger too. “We played some good football last season but inconsistency in games was our bane. We, at times, went on a winning run of matches that gave the impression that the title was ours to grab, but all of a sudden, we slumped with some bad results both at home and away. “Our form was on and off throughout the season and for a team like Enyimba, that is not acceptable. We pushed to at least get one of the tickets to play in the continent but in the end, it didn’t come to fruition. “We shall give it our best and see how it goes, but we the officials, players, management and fans are disappointed and we shall try to mend things next season.” Finidi also described his first season as a coach in the NPFL as bad, saying he didn’t achieve his objectives. “My first season is an experience for me, I thank the management for the opportunity. I must say it was a bad season for me because we did not achieve our objectives. “It was not a completely failed project because we played good football but could not put the ball in the net. My second season will hopefully be better.” Enyimba will hope to win NPFL title for a ninth time, having last lifted it in 2019. The post NPFL: Finidi Assures Of Better Performance appeared first on :::...The Tide News Online:::....","pubDate":"2023-01-06 00:51:00","image_url":null,"source_id":"thetidenewsonline","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"F’ Eagles Coach To Submit AFCON Final List Jan 20","link":"https://www.thetidenewsonline.com/2023/01/06/f-eagles-coach-to-submit-afcon-final-list-jan-20/","keywords":["Sports"],"creator":["The Tide"],"video_url":null,"description":"Flying Eagles head coach, Ladan Bosso, will submit his final squad list of 23 players to the Confederation of African Football latest January 20, ahead of the 2023 Africa U-20 Cup of Nations finals scheduled for Egypt. The tournament is billed to hold from February 19 to March 11 with seven-time champions Nigeria drawn against […] The post F’ Eagles Coach To Submit AFCON Final List Jan 20 appeared first on :::...The Tide News Online:::....","content":"Flying Eagles head coach, Ladan Bosso, will submit his final squad list of 23 players to the Confederation of African Football latest January 20, ahead of the 2023 Africa U-20 Cup of Nations finals scheduled for Egypt. The tournament is billed to hold from February 19 to March 11 with seven-time champions Nigeria drawn against hosts Egypt, Senegal and Mozambique in Group A of the competition. “We expect the list of players for the tournament to be sent in latest January 20th,” a team official told Tidesports source.. Meanwhile, Bosso stated that the team would resume the final phase of camping for the forthcoming tourney on January 7. He also revealed that their preparations for the Africa U-20 Cup of Nations would be in Spain or Morocco. “The camp will resume January 7 and the training tour will either be in Spain or Morocco,” Bosso said. Bosso also disclosed he would be looking to add some experience in defence and attack, with the invitation of more overseas-based professionals. “We need experience in attack and defence and even if any overseas-based player will join the team, they will be from these departments,” he said. He also spoke about the tough-looking U-20 AFCON first-round group, adding that all teams were worthy of their places. “It’s a normal group. Every team that qualifies for the U-20 Africa Cup of Nations is hopeful of qualifying for the World Cup,” Bosso said. “So, whether we are in a tough group or not, if you want to qualify for the World Cup, you must play against the top teams at the Africa Cup of Nations. “We will take it step by step. We won’t put any country first, we must respect every country in our group and we’ll work towards it. “This team is not Bosso’s team, it’s Nigeria’s team. So, I want everyone to pray for the team now that the draws have been made.” Bosso said his target was to reach the semi-finals, which would qualify the Flying Eagles for the U-20 World Cup in Indonesia in May. The post F’ Eagles Coach To Submit AFCON Final List Jan 20 appeared first on :::...The Tide News Online:::....","pubDate":"2023-01-06 00:49:49","image_url":null,"source_id":"thetidenewsonline","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Fans Call On Cadiz To Scout Nigerian Players","link":"https://www.thetidenewsonline.com/2023/01/06/fans-call-on-cadiz-to-scout-nigerian-players/","keywords":["Sports"],"creator":["The Tide"],"video_url":null,"description":"A host of Nigerian football faithful have charged La Liga side Cadiz FC to scout the huge talent pool in the country, saying it will help the club maintain their status in the Spanish topflight, Tidesports source reports. The call to have the Yellow Submarines come to Nigeria came after the club on their Twitter […] The post Fans Call On Cadiz To Scout Nigerian Players appeared first on :::...The Tide News Online:::....","content":"A host of Nigerian football faithful have charged La Liga side Cadiz FC to scout the huge talent pool in the country, saying it will help the club maintain their status in the Spanish topflight, Tidesports source reports. The call to have the Yellow Submarines come to Nigeria came after the club on their Twitter handle sent a celebratory message to the West African country. “Happy New Year 2023 to all our friends from Nigeria. We wish to get the same support from you this year,” the tweet reads. It was not the first time the club had tagged Nigeria in their tweet. The club celebrated the country on the celebration of her independence last year. Reacting to the post, fans called on the club to grab Nigerian talents. Marshal Medusa wrote on twitter, “Come to Lagos, Enugu and Kaduna. There are a lot of talents here that you will get with little spending.” Another Twitter user, Jubilant added, “Come to secondary schools in Nigeria and see talents wasting. Boys who have great future but no sponsor.” “Happy New Year to you too. When are you opening your academy in Nigeria. There’s a talent pool of young Nigerian kids which both parties can benefit from,” Agoziem Midas asked. Olumide Amos wrote, “Don’t just greet us Happy New Year, prove to have a good relationship with Nigeria. Come and scout players in Nigeria.” Majesty MLM also urged the club o sign a Nigerian player. “Sign one of our boys now, we have enough talent scattered all over Europe and also in our local lease. Make it happen.” Ibrahim Deba said, “Thank you, we love you. You have our supports.” The post Fans Call On Cadiz To Scout Nigerian Players appeared first on :::...The Tide News Online:::....","pubDate":"2023-01-06 00:49:21","image_url":null,"source_id":"thetidenewsonline","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"NFL: ESPN host stuns viewers with on-air prayer session","link":"https://www.nzherald.co.nz/sport/nfl-espn-host-stuns-viewers-with-on-air-prayer-session/OPHGX2ZJ5NBIJH6SHNP2XHBMPE/","keywords":null,"creator":null,"video_url":null,"description":"Social media erupted after a football analyst took the bold step on live TV.","content":null,"pubDate":"2023-01-06 00:48:47","image_url":"https://www.nzherald.co.nz/resizer/QZdA7cRTNDI1HfYghNLPJdfHJM8=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/FINTXXZL25CSZLOU64GYEVQRIQ.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Damar Hamlin showing \"remarkable improvement,\" Buffalo Bills say","link":"https://www.cbsnews.com/newyork/news/damar-hamlin-remarkable-improvement-buffalo-bills-statement/","keywords":["U.S.","Sports"],"creator":["Emily Mae Czachor"],"video_url":null,"description":"The Buffalo Bills safety remains hospitalized in critical condition, but \"appears to be neurologically intact,\" the team said in a statement.","content":"Damar Hamlin is \"making steady progress\" and \"appears to be neurologically intact,\" while still hospitalized in critical condition following a cardiac arrest that caused him to collapse on the field during a game in Cincinnati on Monday night, the Buffalo Bills said in a statement Thursday morning. Hamlin, who is 24, is a safety in his second season with the team.\"Per the physicians caring for Damar Hamlin at the University of Cincinnati Medical Center, Damar has shown remarkable improvement over the past 24 hours,\" the Bills said. \"While still critically ill, he has demonstrated that he appears to be neurologically intact. His lungs continue to heal and he is making steady progress.\"The team is \"grateful for the love and support\" that it is has received since Hamlin's televised collapse and hospital transfer earlier this week ushered in an outpouring of concerned messages online. pic.twitter.com/4Fyd2JZVLb— Buffalo Bills (@BuffaloBills) January 5, 2023 Hamlin's teammate Kaiir Elam, a cornerback for the Buffalo Bills, also shared a positive update in a tweet posted minutes before the one from the Bills. Elam said Hamlin was awake and improving.\"Our boy is doing better, awake and showing more signs of improvement,\" Elam wrote, adding, \"Thank you God. Keep the prayers coming please. All love 3!\" Our boy is doing better, awake and showing more signs of improvement. Thank you God. Keep the prayers coming please. All love 3!— Kaiir Elam (@kaiirelam5) January 5, 2023 At a Thursday afternoon press conference, Bills head coach Sean McDermott said the news the team has received is \"very encouraging.\" He noted that the Bills have been getting periodic updates from the doctors at UC Medical Center, who have been relaying information to two of the team's trainers who stayed behind in Cincinnati with Hamlin. The doctors said at a separate briefing Thursday that Hamlin was \"beginning to awaken.\"\"The news we received today in particular was a huge lift,\" McDermott said.  McDermott also praised the actions of team assistant trainer Denny Kellington, who rendered aid to Hamlin on the field. \"For an assistant to find himself at that position and needing to take the action that he did and step up and take charge like he did — and there were others on the field as well — is nothing short of amazing,\" McDermott said. \"And the courage that took, you talk about a real leader, a real hero, in saving Damar's life. I just admire his strength.\"Quarterback Josh Allen also spoke about how the updates on Hamlin's condition over the last day have lifted the team's spirits. \"We're just happy Damar's all right,\" he said, adding later there had been \"a lot of tears of joy.\"Hamlin was admitted to the University of Cincinnati Medical Center after being rushed by ambulance from Monday night's game against the Cincinnati Bengals. With a little over six minutes left in the first quarter, viewers saw Hamlin collapse following a tackle where he appeared to take a hit from the Bengals' wide receiver Tee Higgins. His heart stopped and Hamlin was quickly given CPR on the field before his hospital transport, the Bills said in a statement released early Tuesday. \"Damar Hamlin suffered a cardiac arrest following a hit in the Buffalo Bills' game versus the Cincinnati Bengals,\" the team said at the time. \"His heartbeat was restored on the field and he was transferred to the University of Cincinnati Medical Center for further testing and treatment.\"Hamlin's uncle, Dorrian Glenn, said Tuesday night that Hamlin's heart actually stopped twice — once on the field when they resuscitated him and again at the hospital, \"and they had to hit him with the defibrillator.\"Hamlin's condition was listed as critical, although few additional details were released regarding the player's health status or factors that may have caused the cardiac arrest. CBS News medical contributor Dr. David Agus explained that blunt force trauma to the chest area \"in the exact right spot, at the exact right moment during his heartbeat\" could have led to an arrhythmia, which is an irregular heart rhythm that disrupts the normal flow of blood to the brain.Buffalo Bills player Damar Hamlin on Dec. 1, 2022 Greg M. Cooper / AP The Bills previously reported improvements in Hamlin's condition in an update shared Wednesday afternoon.\"Damar remains in the ICU in critical condition with signs of improvement noted yesterday and overnight,\" the team said at that time. \"He is expected to remain under intensive care as his health care team continues to monitor and treat him.\"The current NFL season was Hamlin's first as a starter with the Buffalo Bills, after playing 14 games during his rookie season in a reserve role. He joined the team by selection during the 2021 NFL Draft, coming off of a successful college football career at the University of Pittsburgh.","pubDate":"2023-01-06 00:29:00","image_url":"https://assets1.cbsnewsstatic.com/hub/i/r/2023/01/03/a20f4929-ef46-41d0-a94c-8e9fe26fc449/thumbnail/1024x576/658d2ae1c5495e3f745df02b3fd14229/ap23003607794613.jpg","source_id":"newyorkcbslocal","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Coupe de France. Avant Monaco-RAF, samedi : le club de Rodez à jamais lié à l'épreuve","link":"https://www.ladepeche.fr/2023/01/06/coupe-de-france-avant-monaco-raf-samedi-le-club-de-rodez-a-jamais-lie-a-lepreuve-10907090.php","keywords":["Rodez Aveyron Football"],"creator":null,"video_url":null,"description":"Il n’y aurait jamais eu de football professionnel à Rodez si le club aveyronnais n’avait pas vécu en 1991 une épopée de Coupe de France qui a greffé dans son ADN une ambition farouche. Rétro alors que, samedi 7...","content":null,"pubDate":"2023-01-06 00:13:08","image_url":"https://images.ladepeche.fr/api/v1/images/view/63b7638f8e307227563e2a99/standard/image.jpg?v=1","source_id":"ladepeche","country":["france"],"category":["sports"],"language":"french"},{"title":"How Oguso Cup has turned into a 'hotbed of talent'","link":"https://www.standardmedia.co.ke/sports/article/2001464570/how-oguso-cup-has-turned-into-a-hotbed-of-talent","keywords":null,"creator":["Standard Digital"],"video_url":null,"description":"Chris Oguso Cup remains one of the best off-season football tournaments in the country if the players it has produced in the recent past is anything to go by.","content":"Chris Oguso Cup remains one of the best off-season football tournaments in the country if the players it has produced in the recent past is anything to go by. With the annual sponsorship of at least Sh4 million from betting firm Betika for the last ten years, the event which is held between November and December appears to have quickly joined the class of the likes of Koth Biro and Butsotso Cultural Festivals among others in nurturing talent. From the current Kenya Police trio of David Simiyu, Reagan Otieno and Job Ochieng to former Nzoia Sugar/Gor Mahia/AFC Leopards defender Joachim Oluoch all of them were either scouted from or revived their careers at the tournament organised by Superintendent of Police and Kenya Police FC CEO Chris Mmbwanga Oguso. Oguso, who featured for Nakuru Police from 1997 to 1999 in the National Super League and FKF Premier League (2000 to 2002) before hanging up his boots in 2003, is also currently serving as the head of security of the Prime Cabinet Secretary Musalia Mudavadi. Lesley Otieno, another product of the tournament which started in 2011, is poised to join Premier League side Police FC. Just like the past tournaments, some exciting and promising talents were unearthed at the recently concluded 12th edition which was claimed by Kidundu United FC at Mahanga Grounds in Vihiga County on December 29. Kidundu saw off Lakers FC 3-0 in the final thanks to the contributions from the influential quartet of captain Mohammed Said, goalkeeper Ian Duncan, Ivorian striker Michael Ake and Vincent Ogola. And for their exploits in the final, Ake, who features for National Super League side Shabana, was named the Most Valuable Player of the tournament, while his Kidundu teammate Ian Duncan walked home with the best goalkeeper award. Sportive’s Benson Kamalik whose side finished third after beating Silver Strikers 1-0 in the playoffs, also had something to smile about after bagging the golden boot. He scored 12 goals in the tournament. The final was also graced by Nzoia Sugar FC chairman Evans Kadenge and Harambee Stars legends Josephat Murila and George Sunguti. For winning the trophy Kidundu received Sh300,000 in prize money while Lakers and Sportive pocketed Sh200,000 and Sh100,000 respectively. Oguso is proud of what the tournament has achieved so far in terms of changing lives and nurturing talent in the five sub-counties (Vihiga, Sabatia, Emuhaya, Hamisi and Luanda) in Vihiga County. “Remember, this is a non-political tournament whose aim is to nurture talent and bring cohesion among the residents of Vihiga County. This is also in line with President William Ruto’s grassroots plan of identifying talent,” said Oguso. “The tournament has produced many great players like David Simiyu, who’s undergone his police training and will be graduating on January 12. Reagan Otieno used to play for KCB but he took part in the 2021 tournament and this is where I scouted him. He’s actually supposed to join the National Police Service this month. “Betika na Community has been sponsoring this tournament for the past 10 years now and the monies given out has helped the winning teams start a few income making projects like rearing chicken and cows.” Though the ladies’ tournament failed to take place last year due to some unavoidable reasons, Oguso says plans are underway to form the Kenya Police women’s football team. But Ake now seems to be the most sought-after player from the 2022 edition with a number of Premier League clubs including Nzoia Sugar chasing for his signature. “Tournaments like this give young players a chance to showcase their talent. I wasn’t disappointed with the quality I saw in the final and just like the past tournaments there are a few players I have scouted,” said Nzoia Sugar FC chairman Evans Kadenge. “Ake is one of the good players I have identified and we are trying to engage him.” Ake said: “I’m glad to have participated in the tournament and named the best player. I thank God for everything, we gave our best and won the trophy.”","pubDate":"2023-01-06 00:06:00","image_url":null,"source_id":"standardmedia","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Football: Man City beat Chelsea to close gap at top of Premier League","link":"https://www.straitstimes.com/sport/football/football-man-city-beat-chelsea-to-close-gap-at-top-of-premier-league","keywords":null,"creator":null,"video_url":null,"description":"January 06, 2023 6:35 AMPep Guardiola’s men were well below par in the first half but were transformed after the break.","content":"LONDON - Defending champions Manchester City beat injury-hit Chelsea 1-0 on Thursday to close the gap on Premier League leaders Arsenal to just five points. Pep Guardiola’s men were well below par in the first half but were transformed after the break, with substitutes Jack Grealish and Riyad Mahrez combining for the only goal, scored by the Algerian in the 63rd minute. Graham Potter’s Chelsea came into game languishing in 10th place in the table and were expected to face a searching examination from second-placed City but they had the better of the first half. Chelsea, however, were up against it from the opening minutes, with forward Raheem Sterling forced off after suffering an apparent hamstring injury, replaced by Pierre-Emerick Aubameyang. Potter was also without a string of senior players including Mason Mount, Reece James, Ben Chilwell and N’Golo Kante. The game at Stamford Bridge was scrappy in the initial stages, with the visitors dominating possession but creating little of note. Chelsea were first to threaten, in the 16th minute, but City defender John Stones came to the rescue as Christian Pulisic bore down on goal, producing a perfectly timed sliding tackle to deny the US forward. The American was injured in the challenge and was forced off minutes later, compounding Chelsea’s problems. Teenager Carney Chukwuemeka, who came on for Pulisic, almost made an instant impact, but his shot was blocked and Hakim Ziyech’s effort was saved by City goalkeeper Ederson. Erling Haaland, who has one more Premier League goal this season – 21, than the entire Chelsea side, smashed a shot wide in the 38th minute. But Chelsea continued to look the more dangerous side and came agonisingly close to breaking the deadlock when Chukwuemeka hit the post in the 44th minute. Guardiola made a double substitution at half-time, bringing on Rico Lewis and Manuel Akanji for Joao Cancelo and Kyle Walker in the search for more control. The visitors immediately settled and began to dictate play, with Nathan Ake heading against the woodwork, but Chelsea responded well and were inches away from taking the lead when Thiago Silva flashed wide. Guardiola brought on Grealish and Mahrez on the hour mark to further freshen up his attack. The decision paid dividends minutes later when Grealish produced an excellent pass from the left and Mahrez prodded home from close range. Potter made changes of his own, including bringing on England forward Conor Gallagher, but they were unable to find an equaliser despite some late pressure. The result leaves City five points behind Arsenal, who dropped points in a 0-0 draw against high-flying Newcastle earlier in the week. Chelsea now have just one win in their past eight league games and remain 10 points off the top four. AFP","pubDate":"2023-01-05 22:35:36","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Damar Hamlin sigue recuperándose de excelente manera","link":"https://juanfutbol.com/otros/la-salud-de-damar-hamlin-sigue-mejorando-20230105-JFB-30631.html","keywords":["Otros"],"creator":["Joel Agoitia"],"video_url":null,"description":"El mundo deportivo sigue estando atento al estado de salud de Damar Hamlin y se han dado a conocer buenas noticias Han pasado tres días desde el trágico accidente que sufrió Damar Hamlin en el Monday Night Football de la semana 17 en la NFL y desde entonces todos hemos estado al pendiente de él. Todos los días hemos tenido una actualización de la salud del safety de los Buffalo Bills y este 5 de enero llegaron grandes noticias. En conferencia de prensa; los doctores del UC Medical Center de Cincinnati que están encargados de cuidarlo dieron a conocer que ha mejorado notablemente desde el 4 de enero. Damar ahora solo necesita del 50% del respirador artificial, puede mover los ojos y se puede comunicar escribiendo. Recap from Damar Hamlin’s doctors:▪ Damar is awake and using a breathing tube▪ Bills staff saved his life▪ Damar is communicating through writing and asked who won the game▪ Best possible outcome is for Damar to return to who he was before the game pic.twitter.com/994h8YIUTf— Bleacher Report (@BleacherReport) January 5, 2023 TAMBIÉN TE PUEDE INTERESAR: Los escenarios para que se reanude el Bills-Bengals Lo mejor de todo es que Hamlin no sufrió ningún daño neurológico, esta era la mayor de las preocupaciones que tenían los médicos. Entonces, al recuperarse al 100%, podrá regresar al emparrillado si así lo quiere. Los héroes de Damar Hamlin En la misma conferencia, los doctores elogiaron al equipo médico de los Bills por su pronta reacción al ver la situación que estaba viviendo el jugador y que gracias a ellos sigue con vida.","content":null,"pubDate":"2023-01-05 22:29:26","image_url":null,"source_id":"juanfutbol","country":["mexico"],"category":["sports"],"language":"spanish"},{"title":"If TCU football upsets Georgia on Monday, here’s where you can get your CFP champions gear","link":"https://ca.sports.yahoo.com/news/tcu-football-upsets-georgia-monday-221925582.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-05 22:19:25","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Daily Schmankerl: Bayern Munich to pay €100M for Bundesliga star?; Borussia Dortmund’s Jude Bellingham staying put for now; Real Madrid eyeing Liverpool defender; Chelsea challenging Arsenal on Mykhaylo Mudryk; West Ham eyeing Man City star; & MORE","link":"https://www.bavarianfootballworks.com/2023/1/5/23537509/bayern-munich-dortmund-bellingham-real-madrid-liverpool-chelsea-arsenal-mudryk-manchester-city-neuer","keywords":null,"creator":["CSmith1919"],"video_url":null,"description":null,"content":"Photo by Alexander Hassenstein/Getty Images This has been quite a week for Bayern Munich, eh? No thanks...(Florian Plettenberg via @iMiaSanMia) Those rumors linking Bayern Munich to Eintracht Frankfurt standout Randal Kolo Muani had some fans excited at the prospect of the talented Frenchman taking the reins as the new No. 9 in Bavaria. If you were one of those folks, you might want to reconsider now that we know the (alleged) asking price from Eintracht Frankfurt: Bayern are monitoring Kolo Muani, but there’s still no contact. The player’s plan is to stay in Frankfurt next season if they qualify to Europe. Otherwise, it would be tough for Eintracht to keep him beyond the summer. Price tag in the summer likely around €100m. For €100 million, I think I want a more established (and frankly better) player. This is not a knock on Kolo Muani, but nine figures is a lot of money. No winter move for Bellingham (Sport1) Whatever eventually happens with Borussia Dortmund star Jude Bellingham remains to be seen, but we do know that he will not leave the club this winter. Liverpool FC, Manchester City, and Real Madrid are considered the top contenders for the BVB midfielder: Which jersey will Jude Bellingham wear next summer? Staying at BVB seems increasingly unlikely, also due to the strong performance at BVB. The Spanish sports newspaper As from Madrid is now writing about an “ultimate summit” that is to be held in the coming days. Accordingly, BVB asked the Bellingham side for a meeting at which the 19-year-old should announce his decision whether he wanted to leave the club at the end of the season. This meeting, in which Dortmund’s boss Hans-Joachim Watzke and sports director Sebastian Kehl are to take part, should take place before January 6th. Then BVB travels to the training camp in Marbella. According to SPORT1 information, the club is now assuming a farewell, but a change in winter is definitely out of the question, regardless of Bellingham’s decision. With Liverpool FC, Manchester City and Real Madrid, three clubs have the highest hopes for one of the greatest talents in world football. According to AS (as captured by 90Min.com), Borussia Dortmund wants to meet with Bellingham to get a feel for what he is thinking regarding his future: Borussia Dortmund will demand a meeting with Jude Bellingham before January 6 for an answer about his future. Liverpool, Manchester City and Real Madrid are the leading suitors for his signature. Ancelotti wants Konate (Media Foot via 90Min.com) Former Bayern Munich manager and current Real Madrid boss Carlo Ancelotti wants Ibrahima Konate for his backline: Carlo Ancelotti also wants Real Madrid to try and sign Liverpool centre-back Ibrahima Konate this summer. Bavarian Podcast Works — Weekend Warm-up Podcast: Season 2, Episode 25 (Bavarian Football Works) It has been a wild holiday week at BFW. There is a ton of Bayern Munich news going on and we have just the platform for you to talk about it all. One way to get your thoughts in motion is to give our Weekend Warm-up Podcast a listen. On this episode we discuss the following topics: Alexander Nübel’s hardline decision to spurn an offer to return from his loan at AS Monaco to Bayern Munich. Bayern Munich’s eagerness to lock up Lucas Hernandez, Alphonso Davies, and Jamal Musiala to long-term deals. Bayern Munich’s ongoing interest in Bayer Leverkusen ace Florian Wirtz and what it might eventually mean for the future of the roster. Is Leroy Sané pondering a move away from Bayern Munich? If so, do you believe that Real Madrid rumor? Matthijs de Ligt needs to be better in the second half of the season and why Bayern Munich’s season might depend on it. Some brief thoughts on Andor. There’s no easy way out for Draxler (Sport1) Julian Draxler has had a helluva ride, eh? Leaving Paris Saint-Germain was supposed to reignite his career, but his loan to Benfica has not worked out...at all: Julian Draxler failed to impress during his loan spell at Benfica Lisbon. According to Portuguese media reports, the 29-year-old should therefore return to his main club Paris Saint-Germain at the end of the season, where he is still under contract until 2024. But even there, coach Christophe Galtier should still not plan with him, just like sports director Luis Campos, who sent Draxler on loan to Lisbon in the summer for that reason alone. Since then, Draxler has made just six league appearances for Benfica and has failed to impress, scoring just once. The fact that he was recently unable to play due to a thigh muscle injury probably reinforces Benfica’s intentions to send Draxler back to France. How it will continue after that is open. PSG will probably want to get rid of him again. However, there could be difficulties on the interested side. Because already this year Paris had to pay 80% of his salary to get rid of the offensive player at all. Draxler’s international career appears to be over and his club career is sputtering. You could really argue that his move to PSG was a career killer. Opening for Hammers to get Phillips? (Football Insider) Did a little prodding from Manchester City boss Pep Guardiola give West Ham United some hope that it would procure Kalvin Phillips? It appears so: West Ham have reignited their interest in Man City star Kalvin Phillips, sources have told Football Insider. The Londoners were linked with a £50million bid for the midfielder, 27, last January when he was still at Leeds United. Now, West Ham have been alerted by City boss Pep Guardiola surprisingly going public to condemn Phillips for being “overweight” and in poor condition when he returned after the World Cup. The Irons expect to lose Declan Rice in the summer window when he will have just a year left on his contract after he rejected multiple offers to extend it. Phillips is highly rated by manager David Moyes and seen as capable of replacing Rice if he leaves. The midfielder could even be available for less than the fee paid by City last summer, of £42m plus £3m add-ons. The former Leeds midfielder has played just one minute of Premier League football since his move to the Etihad in the summer and looks to be falling further and further down in Guardiola’s pecking order. Chelsea trying to challenge Gunners on Mudryk (The Sun) Chelsea FC is looking to challenge Arsenal for Shakhtar Donetsck star Mykhaylo Mudryk: CHELSEA are attempting to hijack Arsenal’s move for Mykhaylo Mudryk and are set for talks with the Blues in London this week. Arsenal’s latest offer for the Shakhtar Donetsk star is £62million, but is still well below the Ukrainian side’s asking price. Despite the Gunners having already agreed personal terms over a five-year deal, worth around £120k-a-week, with Mudryk, Chelsea are set to enter the fray having already started discussions. If the Blues agree to meet the asking price, around £60million with another £20million in add-ons, and offer better terms than the Gunners they could pip the Premier League leaders to the deal. And Shakhtar sporting director, Darijo Srna, is set to travel to London for talks this week. Mudryk has long teased a move to The Emirates, having openly discussed his desire to join the club as well as posting pictures of him watching recent games on social media. Bavarian Podcast Works — Flagship Show: Season 5, Episode 27 (Bavarian Football Works) So 2022 is over and it’s time for a retrospective. Bayern Munich had a very mediocre 2022 which saw a dearth of success domestically and internationally. While the club won a 10th consecutive Bundesliga title, an early exit in the Champions League and poor showing by Bayern players at the World Cup mean that 2022 leaves a very bad taste in the mouth. However, if thing go right, 2023 could be a LOT better. In this episode, Tom and INNN talk about the following: Recapping how 2022 went for Bayern Munich, especially the many (many) lows. How injuries, illness, and outgoing transfers hurt Bayern last year. How, paradoxically, Bayern’s upcoming Champions League opponents (PSG) ended up having a great 2022. Was 2022 worse than 2012? No, but it still feels bad. Moving onto 2023 — do we feel optimistic about what’s coming? Here it starts. A looooooooooong list of reasons why Bayern will have a much better 2023 compared to 2022. If you listened to the whole thing, then can you name every single one? How the uncertainty around Manuel Neuer’s future makes it hard for the club to sign a proper replacement for this season. Closing off our first podcast of our calendar year on an optimistic note.","pubDate":"2023-01-05 22:13:14","image_url":null,"source_id":"bavarianfootballworks","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Hamad Al Mazrouei is a member of the Referees Committee for “Gulf 25”","link":"https://thenewsglory.com/hamad-al-mazrouei-is-a-member-of-the-referees-committee-for-gulf-25/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"The Arab Gulf Football Association, a member of the Referees Committee in the Football Association, chose Hamad bin Dylan Al Mazrouei as a member of the Referees Committee in the “Gulf 25” tournament. The Football Association said in a statement yesterday: “Al-Mazrouei is one of the first national cadres to be approved by the Asian […]","content":"The Arab Gulf Football Association, a member of the Referees Committee in the Football Association, chose Hamad bin Dylan Al Mazrouei as a member of the Referees Committee in the “Gulf 25” tournament. The Football Association said in a statement yesterday: “Al-Mazrouei is one of the first national cadres to be approved by the Asian Football Confederation as part of the list of Asian match observers in 2017.” Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2023-01-05 22:05:00","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Ramsa Gulf 25","link":"https://thenewsglory.com/ramsa-gulf-25/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"championship The media coordinator of the Bahraini national team, Mohammed Abdul Ghaffar, revealed in a press statement that the Bahraini “Al-Ahmar” is ready to compete in the “Gulf 25” competitions, and is looking forward to winning the championship and preserving the title it won in the last session. tickets Ticket prices to attend the “Gulf […]","content":"championship The media coordinator of the Bahraini national team, Mohammed Abdul Ghaffar, revealed in a press statement that the Bahraini “Al-Ahmar” is ready to compete in the “Gulf 25” competitions, and is looking forward to winning the championship and preserving the title it won in the last session. tickets Ticket prices to attend the “Gulf 25” matches ranged between 10 and 30 dollars (35 – 100 dirhams) according to the category: the first 45 thousand Iraqi dinars, the second 30 thousand, the third 20 thousand, and the fourth 15 thousand dinars, while all tickets for the opening match between Iraq were sold out. and Oman. delay There was a delay in issuing the cards of the committees and media professionals who came to the tournament in the last hours and came in large numbers and in record numbers, which prompted the Organizing Committee to expedite the issuance of cards, in order to avoid confusion before the whistle of the first match sounded. Media people The media committee of the “Gulf 25” tournament revealed that the number of journalists and media professionals participating in the coverage of the tournament reached 2475 media professionals and photographers as a total number, while a media center was allocated in each stadium that accommodates 500 media professionals. Vieira The Iraqi Football Association decided to host Brazilian coach Jorvan Vieira, to be among those invited to attend the “Gulf 25” competitions in Basra, in appreciation of his role in Iraq’s victory in the 2007 Asian Championship. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2023-01-05 22:05:00","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Saudi Arabia conclude preparation, training ahead of Arabian Gulf Cup opener against Yemen","link":"https://www.arabnews.com/node/2227511/sport","keywords":null,"creator":["daniel.fountain"],"video_url":null,"description":"Fri, 2023-01-06 00:41 RIYADH: Saudi Arabia completed on Thursday their preparations for their opening Arabian Gulf Cup fixture against Yemen on Friday in the presence of the head of the Saudi Football Association, Yasser Al-Mishal. The Green Falcons get their campaign under way when they meet the Yemenis at the Basra International Stadium in Iraq. The team were training at the stadium under the supervision of technical director, Saad Al-Shehri, who said he hoped to see continued development from the Saudi team following their FIFA World Cup exploits last year.Main category: SportFootballSaudi Sport","content":"RIYADH: Saudi Arabia completed on Thursday their preparations for their opening Arabian Gulf Cup fixture against Yemen on Friday in the presence of the head of the Saudi Football Association, Yasser Al-Mishal. The Green Falcons get their campaign under way when they meet the Yemenis at the Basra International Stadium in Iraq. The team were training at the stadium under the supervision of technical director, Saad Al-Shehri, who said he hoped to see continued development from the Saudi team following their FIFA World Cup exploits last year. “We are very happy to be among our brothers in Iraq, and I thank the Iraqis for their hospitality and the unsurprising reception from them, and we wish them success in hosting and organizing this tournament,” Al-Shehri said. “We will work hard to achieve our technical goals, including winning the championship, as well as the ultimate goal, which is to move forward in technical development that Saudi football is witnessing and achieving,” he added. Player Riyad Sharahili explained during a press conference that the match against Yemen would not be easy and pointed out that he and his teammates were focused on performing at a high level to achieve a positive result.","pubDate":"2023-01-05 22:02:36","image_url":null,"source_id":"arabnews","country":["saudi arabia"],"category":["sports"],"language":"english"},{"title":"Ліверпуль зацікавлений у трансфері хавбека Аталанти Копмейнерса","link":"https://champion.com.ua/football/2023/01/05/919357/liverpul-zatsikavlenyy-u-transferi-khavbeka-atalanty-kopmeynersa","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Півзахисник Аталанти Тьон Копмейнерс потрапив у сферу інтересів Ліверпуля.Про це повідомляє Football Italia.Мерсисайдці розглядають варіант з офіційною пропозицією щодо 24-річного футболіста.Чинний контракт нідерландця розрахований до 2025 року, в іт...","content":"Півзахисник Аталанти Тьон Копмейнерс потрапив у сферу інтересів Ліверпуля.Про це повідомляє Football Italia.Мерсисайдці розглядають варіант з офіційною пропозицією щодо 24-річного футболіста.Чинний контракт нідерландця розрахований до 2025 року, в італійців є опція пролонгації ще на сезон.РанішеАталанта отримала офіційну пропозицію щодо трансферу Маліновського.","pubDate":"2023-01-05 21:22:00","image_url":null,"source_id":"champion","country":["ukraine"],"category":["sports"],"language":"ukrainian"}]}