{"newsArray":[{"article_id":"f3ea464d69db8a65b1dcf24164813b70","title":"F1 fans have Charles Leclerc theory after spotting what Ferrari driver has on his helmet","link":"https://www.dailystar.co.uk/sport/f1/f1-charles-leclerc-red-bull-31522872","keywords":["Sport"],"creator":null,"video_url":null,"description":"With the last race of the 2023 Formula One season upon us, eagled-eyed fans have spotted a message Charles Leclerc has written on his helmet leaving Ferrari fans worrying over his future","content":"Charles Leclerc has worried fans over his future due to the nature of a message he wrote on his helmet. The star is gearing up for the Abu Dhabi Grand Prix on Sunday (November 26) - the last of the season - as the 26-year-old was posing in team photographs on Friday (November 24). Pictures of the Monegasque and his helmet found itself going viral on social media. Fans noticed a message he wrote on it that read: \"Grazie Ferrari\", immediately leading to fears that it could be his last-ever race for the Italian team. One fan was filled with worry as they wrote: \"NGL (not going to lie), this is stressing me out did we manifest too hard?? Or what is happening here??\" Another fan commented: \"The 'grazie Ferrari' feels like goodbye NGL\", following rumours that Leclerc could be heading to Red Bull. Some fans, however, weren't taken in by the suggestive message as one insisted that he's just saying thanks to the team while stating that he has a contract with Ferrari for next year. A fourth fan found the message heartfelt considering the issues he's faced this season with having to retire from three races. \"The fact that he's still thanking Ferrari after everything he went thru this year...i love him grazie Charles Leclerc,\" a fan wrote on X (formerly known as Twitter). Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Leclerc currently sits 7th in the Drivers' Championship but could finish fourth as he's just 12 points away from team-mate Carlos Sainz and Aston Martin's Fernando Alonso. A fourth-placed finish for the Ferrari star he said means \"absolutely nothing\" following a season where's he's failed to build on his five career Grand Prix wins. Despite not caring too much on a fourth-placed finish, he's determined to guide Ferrari to second place in the Constructors' Championship as they sit four points behind Mercedes heading into Abdu Dhabi. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . “Honestly, I would really like the team to be second at the end of this weekend,\" he said. \"We’ve had a tough season and everybody deserves it. They’ve worked like crazy in order to bring the upgrades earlier and it will be deserved to be in second at the end of the year, so we’ll do absolutely everything for that.\"","pubDate":"2023-11-24 18:50:05","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31522982.ece/ALTERNATES/s98/0_F_oJtdCWsAAE7vPjpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f0ec4735b24bdb0d6824538353b3c713","title":"Mines football opens Division II playoffs eyeing another run to the national championship game: “We have an extra chip on our shoulder”","link":"https://www.denverpost.com/2023/11/24/colorado-mines-football-playoff-preview-national-title-run/","keywords":["College Sports","Sports","college football","Colorado School of Mines","John Matocha","NCAA","Pete Sterbick","RMAC"],"creator":["Kyle Newman"],"video_url":null,"description":"Under Pete Sterbick, the Orediggers' third head coach in the last three years after Gregg Brandon retired and Brandon Moore took the head job at San Diego, Mines is back as a favorite in the Division II playoffs after falling in the title game a year ago.","content":"GOLDEN — New coach, same standard. The ultimate goal hasn’t changed for Colorado School of Mines football: national championship or bust. Under Pete Sterbick, the Orediggers’ third head coach in three years following Gregg Brandon retiring and Brandon Moore taking the head job at San Diego, Mines is undefeated and back as a favorite in the NCAA Division II playoffs after falling in the title game a season ago. “The culture’s the same and I think it’s gotten even better,” Sterbick said. “The difference is our experience factor has gotten that much better after a five-game playoff run last year. Our mentality on what we want to accomplish is the same as far as the end goal. “But we have an extra chip on our shoulder with how things ended last year, and we feel like all the time that we have to re-prove ourselves to people. People forget about us, so we’re fired up.” Mines’ Cinderella carriage turned into a pumpkin in the national title game last year, when at McKinney ISD Stadium in McKinney, Texas. But Mines has all the pieces to get back to that same stadium for this year’s championship. The undefeated Orediggers (11-0) have been the top-ranked team in both Division II polls for the latter half of the season, securing a No. 1 seed in the tournament and home-field advantage at up until the championship. “When we get it packed in here, I think it’s an intimidating factor for us,” Sterbick said. “And we’re at 5,700 feet, so we love bringing teams from the Midwest out here.” Their pursuit of the program’s first national title begins Saturday in Golden, where Mines hosts Augustana at noon. The Orediggers boast Division II’s second-ranked scoring offense (51.1 points per game), its fourth-ranked scoring defense (11.5), the reigning Harlon Hill Trophy winner and college football’s active sacks leader in outside linebacker Nolan Reeve. It’s also the fifth consecutive NCAA tournament appearance for , which has “been able to increase the level (of athlete) that we’re looking for” despite the high academic bar to get into the school. “We’re able to battle (for recruits) against a lot of the FCS schools, especially the Ivies and the Pioneer League,” Sterbick said. “The other part about us versus the Ivies is we’re able to go and battle in the playoffs and for a championship every year, and Ivies don’t do that. That’s a big selling point for us. “We’ve been able win some (recruiting) battles that I don’t know that we were winning four, five years ago, against even some scholarship FCS schools. That’s what you need to do at the DII level. We’re not going to get a bunch of D-I bounce-backs, we’re not in the portal a lot, that’s pretty minimal. So we’ve got to get kids who have slipped through and who are about it for the right reasons, because you’ve got to be able to make it academically here.” in their regular season finale in Durango two weeks ago, the Orediggers clinched a fifth straight RMAC title while Matocha became college football’s all-time record-holder for total TDs. The QB threw for three scores and ran for another to push his career TD tally to 181, passing the mark of 178 shared by Case Keenum (Houston) and Blaine Hawkins (Central Iowa). The Orediggers’ offense also established a program record with 798 total yards against Fort Lewis while the defense held the outmatched Skyhawks to negative-33 yards in rushing offense. It was the seventh straight game in which Mines held their opponent under 100 total rushing yards. “We have great synergy as a team,” Reeve said. “We feed off each other’s momentum. It’s not just one side of the ball doing all the work…. We know everyone is going to give us our best shot, so we’ve got to them give our best shot, too. The defense hasn’t had any low points because we don’t need stress on (Matocha). We need him rolling.” Redshirt senior Max McLeod is Matocha’s favorite target. He reached 3,000 career receiving yards and 1,000 yards for the season in the win over Fort Lewis. Adding another dimension to the Orediggers’ offense is a two-headed run game featuring Noah Roper and Landon Walker. Roper, an Erie product, is and his 742 rushing yards this season already surpassed his career output in three seasons with the Big Green, while Walker’s in his first full season as tailback after playing in a hybrid tight end/fullback/running back role in 2022. “I’ve been waiting for this kind of opportunity for my entire college career,” Roper said. “I was originally hoping to transfer to a Power 5 school, but didn’t get that chance. Mines was on my doorstep right away… and I saw what they did in the program last year. I knew I had a chance to come back home, be a part of something special and be close to my family.” After Mines is rested and healthy for Augustana, where Sterbick played receiver and punter from 1998 to 2002. But there won’t be any emotions getting in the way for the head coach, and the Orediggers aren’t looking past the Vikings, a physical and disciplined team that’s coming off its first playoff win since 2010. “I’d like to put up 80 points again, but each week, no matter who we play.. it’s about playing Mines football and playing to our standard. If we’re able to do that, we can come out and play well and dominate,” Matocha said. “The national championship has been the goal since the start, but our motto all year has been 1-0. So there’s no looking past this week.”","pubDate":"2023-11-24 18:31:42","image_url":"https://www.denverpost.com/wp-content/uploads/2023/11/TDP-L-MINES-FOOTBALL-002.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"825ea204f078cbd5be83184d389ee222","title":"Browns top cornerback Denzel Ward to miss Sunday’s game against Denver with shoulder injury","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/11/24/browns-top-cornerback-denzel-ward-to-miss-sundays-game-against-denver-with-shoulder-injury","keywords":["NFL"],"creator":["Tom Withers, The Associated Press"],"video_url":null,"description":"BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Ward missed his third straight practice […]","content":"BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Read this article for free: Already have an account? To continue reading, please subscribe: * BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Ward missed his third straight practice on Friday, and coach Kevin Stefanski said the 26-year-old, who is having a sensational season for the league’s top-ranked defense, will sit against the Broncos (5-5). Stefanski wouldn’t forecast how long Ward, who got hurt in last weekend’s win over Pittsburgh, could be sidelined. Stefanski did not know the exact play in which Ward was injured. Ward’s absence puts extra pressure on Cleveland’s secondary, which has been dealing with several injuries the past two weeks. With Ward out, the Browns likely will start Greg Newsome II and Martin Emerson Jr. at the corners but they have other options. Starting safety Juan Thornhill returned to practice this week after missing two games with a calf injury and is listed as questionable. Stefanski also ruled out wide receiver Marquise Goodwin (concussion). Starting linebacker and captain Anthony Walker Jr. is questionable with a hamstring injury sustained last week. Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. ___ AP NFL: https://apnews.com/hub/NFL Advertisement","pubDate":"2023-11-24 18:30:35","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"97dd1e2389aa4990c53f07abc9cf5480","title":"Packers’ surge raises hopes they could work their way into playoff contention","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/11/24/packers-surge-raises-hopes-they-could-work-their-way-into-playoff-contention","keywords":["NFL"],"creator":["Steve Megargee, The Associated Press"],"video_url":null,"description":"Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. LaFleur said he […]","content":"Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. Read this article for free: Already have an account? To continue reading, please subscribe: * Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. LaFleur said he didn’t “want to go Jim Mora on you,” a reference to the sarcastic response by the former Indianapolis Colts coach to a playoff question during a disappointing 2001 season. LaFleur then added “I think we’re a long way from even thinking about that.” The postseason certainly seemed like a distant possibility after a four-game skid dropped the Packers to 2-5. The Packers seemed to concede as much when they sent veteran cornerback Rasul Douglas to the Buffalo Bills at the trade deadline. Green Bay (5-6) has won three of four since that slide, and the idea that the Packers could play meaningful games around Christmas suddenly doesn’t seem so far-fetched anymore. A surging offense, a resourceful defense and a favorable late-season schedule have created cause for optimism. “We’re trying to leave our mark on the division, on the NFC and in the league,” wide receiver Christian Watson said Thursday after the Packers’ 29-22 victory at Detroit. “A lot of people counted us out today, but we’re not listening to the outside now. We’re just going out there playing our brand of football, and just continue to stack these weeks and stack these days.” The Packers still have lots of work to do, and they face a stern test Dec. 3 when the defending Super Bowl champion Kansas City Chiefs (7-3) visit Lambeau Field for a Sunday night game. But four of their final five games are against teams with losing records. They visit the New York Giants (3-8), host the Tampa Bay Buccaneers (4-6) and have a two-game road swing at Carolina (1-9) and Minnesota (6-5) before hosting the Chicago Bears (3-8) to close the regular season. Jordan Love has sparked the Packers’ surge by throwing for 590 yards and five touchdowns without an interception over his last two games. The Packers also showcased their depth Thursday by beating the NFC North-leading Lions without running back Aaron Jones, cornerback Jaire Alexander, linebacker De’Vondre Campbell and safeties Rudy Ford and Darnell Savage, among others. “We’re taking it week by week right now,” Love said. “We need a win every week is the mindset we have.” WHAT’S WORKING An offense that failed to score a first-half touchdown in five straight games earlier this season scored touchdowns on its first two drives. … The Packers have produced five takeaways without committing a turnover during this two-game win streak. … After allowing five sacks in a 34-20 loss to the Lions at Lambeau on Sept. 28, the Packers didn’t give up a single sack in Thursday’s rematch. … Green Bay’s defense caused the Lions to go 1 of 5 on fourth-down attempts. WHAT NEEDS WORK The Packers gave up 140 yards rushing, though that actually represents an improvement from the 211 they gave up in the first Lions game. STOCK UP Rashan Gary matched a career high with three sacks in his first game at Ford Field since tearing his anterior cruciate ligament there last year. … S Jonathan Owens scored on a 27-yard fumble return and had 12 tackles, matching the second-highest total of his career. … Love has completed over two-thirds of his passes in three of his last four games. … WR Malik Heath, a rookie undrafted free agent with one career catch before Thursday, had four receptions for 46 yards. … RT Zach Tom continued his breakthrough season while helping protect Love. … Watson had a season-high 94 yards receiving and scored a touchdown for a second straight game. STOCK DOWN K Anders Carlson has missed an extra-point attempt in his last three games. He had one blocked in a 23-19 loss at Pittsburgh, sent one wide right in a 23-20 victory over the Los Angeles Chargers and pushed one wide left Thursday. INJURIES DL Devonte Wyatt left the game to get evaluated for a concussion. The list of Packers inactive for the game included Jones (knee), Alexander (shoulder), Campbell (neck), Ford (biceps), TE Josiah Deguara (hip) and WR Dontayvion Wicks (concussion/knee). TE Luke Musgrave (abdomen) and RB Emanuel Wilson (shoulder) were placed on injured reserve the day before the game. KEY NUMBER Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. 3-2: Gary collected three sacks and forced two fumbles Thursday. It was the first time a Packer had compiled three sacks and forced two fumbles in the same game since Aaron Kampman did it in 2006. NEXT STEPS With so many players recovering from injury, the Packers should benefit from the extra recovery time they have before their game with the Chiefs. ___ AP NFL: https://apnews.com/hub/NFL Advertisement Advertisement","pubDate":"2023-11-24 18:14:18","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"15fdcddcd941dffe14268c4265405e3f","title":"«ПСЖ» — «Монако»: смотреть трансляцию матча французской лиги (видео)","link":"https://www.sport-express.ru/football/france/news/pszh-monako-smotret-match-chempionata-francii-pryamaya-translyaciya-igry-onlayn-video-24-noyabrya-besplatno-vo-vkontakte-golovin-2149382/","keywords":["Футбол - Франция"],"creator":null,"video_url":null,"description":"24 ноября «ПСЖ» дома на стадионе «Парк де Пренс» в Париже сыграет против «Монако» в матче 13-го тура чемпионата Франции по футболу.","content":"24 ноября «ПСЖ» дома на стадионе «Парк де Пренс» в Париже сыграет против «Монако» в матче 13-го тура чемпионата Франции по футболу. Встреча начнется в 23.00 по московскому времени. Смотреть бесплатную видеотрансляцию матча «ПСЖ» — «Монако» в прямом эфире можно будет в соцсети «ВКонтакте» . «СЭ» проведет онлайн-трансляцию ключевых событий игры в своем матч-центре . Монегаски с 24 очками занимают третье место в турнирной таблице лиги 1. Парижане с 27 баллами лидируют в чемпионате Франции. За «Монако» выступает российский полузащитник Александр Головин. В текущем сезоне 27-летний футболист провел за команду 11 игр, забил пять мячей и сделал две результативные передачи. В последний раз «Монако» играл с «ПСЖ» 11 февраля 2023 года. Тогда монегаски обыграли соперника со счетом 3:1 в матче 23-го тура лиги 1 прошлого сезона.","pubDate":"2023-11-24 18:00:01","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"35cab23f69172e2c9d887d756253747f","title":"Deion Sanders says Pro Football Hall of Famer joining Colorado staff","link":"https://www.foxnews.com/sports/deion-sanders-says-pro-football-hall-famer-joining-colorado-staff","keywords":null,"creator":null,"video_url":null,"description":"Colorado head coach Deion Sanders said he was \"excited\" about Pro Football Hall of Famer Warren Sapp joining his staff. The school has not announced the hire.","content":"close Video Fox News Flash top sports headlines for November 24 Fox News Flash top sports headlines are here. Check out what's clicking on Foxnews.com. Help appears to be on the way for Colorado Buffaloes head football coach Deion Sanders , as there will now be two Pro Football Hall of Famers on the staff in Boulder. On his weekly radio show before his Buffaloes play their final game of the season, Sanders was asked about former NFL star Warren Sapp coming onto the coaching staff \"this year.\" Former Tampa Bay Buccaneers Warren Sapp looks on from the sidelines before a game against the Philadelphia Eagles at Raymond James Stadium in Tampa, Florida, Sept. 25, 2023. (Nathan Ray Seebeck-USA TODAY Sports) \"I’m excited about Coach Sapp. He’s a dear friend and I love to life. He’s going to be invaluable to what he brings to the table. The kids are going to love him. As far as the recruits as well. They’re going to love him,\" Sanders said \"The Colorado Football Coaches Show\" when asked about Sapp. Colorado has not announced Sapp’s addition, but he has been around the team in an unofficial capacity this season. DEION SANDERS' ROLLER-COASTER FIRST YEAR AT COLORADO: A TIMELINE Sapp appeared to confirm the news when he responded to a video on X of Sanders discussing his arrival. \"Reinforcement is On The Way!!\" Sapp posted. Sapp was selected to the Pro Football Hall of Fame in 2013 after 13 seasons in the NFL, seven of which resulted in Pro Bowl selections. He finished his career with 96.5 sacks and won a Super Bowl with the Tampa Bay Buccaneers . Tampa Bay Buccaneers former cornerback Ronde Barber poses with his bust along with Warren Sapp, Tony Dungy, Derrick Brooks and John Lynch during the 2023 Pro Football Hall of Fame Enshrinement at Tom Benson Hall of Fame Stadium in Canton, Ohio, Aug. 5, 2023. (Kirby Lee-USA TODAY Sports) \"First of all, he’s a technician,\" Sanders said when asked what he sees in Sapp. \"Great players, the commonality that most people don’t understand, they have a serious level of intellect about the game that’s tremendous. You may not see it or hear them articulate it, but it’s a certain level of intellect that when you get together, you’re like ‘Wow.’\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"I think the most beautiful moment I’ve seen is after practice he was in the hot tub with the whole darn defensive line,\" Sanders continued. \"And he was just going over stuff. It was just unbelievable. Like, Warren Sapp is in the hot tub. There’s probably 4,000 pounds in the hot tub right now.\" Colorado has had an up-and-down season, jumping out to a 3-0 start in Sanders’ first year as head coach. However, the Buffaloes are in the midst of a brutal stretch, losing seven of their last eight games, including a blowout loss to Washington State in Week 12. Colorado Buffaloes head coach Deion Sanders looks on prior to a game against the UCLA Bruins at Rose Bowl Stadium on Oct. 28, 2023 in Pasadena, California. (Sean M. Haffey/Getty Images) \"We didn’t accomplish what we wanted, but we accomplished what we needed,\" Sanders said Tuesday when asked how he would rate his first season if they defeat Utah on Saturday. \"I think hope is instilled tremendously in the city, in the student body, within this team, within this building, and you see the direction that we’re heading. CLICK HERE TO GET THE FOX NEWS APP \"So, the things that you look to as a loss, some kind of way I see it as a win. We didn’t do certainly what I wanted to do. But, we’re doing tremendously, much more than what was done. So, you’ve got to put it in perspective.\" Colorado will not be bowl-eligible in Sanders’ first season but will have a chance to get to five wins in its final regular season game against Utah on Saturday. Joe Morgan is a Sports Reporter for Fox News.","pubDate":"2023-11-24 17:59:09","image_url":null,"source_id":"foxnews","source_priority":59,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"bd3a85eed2623f15618de657cde50dfb","title":"РФС рассматривает команды из Европы в качестве соперников сборной России","link":"https://www.sport-express.ru/football/rusteam/news/rfs-rassmatrivaet-komandy-iz-evropy-v-kachestve-sopernikov-sbornoy-rossii-2149586/","keywords":["Футбол - Сборная России"],"creator":null,"video_url":null,"description":"Российский футбольный союз (РФС) рассматривает европейские сборные в качестве соперников сборной России по товарищеским матчам.","content":"Генеральный секретарь Российского футбольного союза (РФС) Максим Митрофанов сообщил, что РФС рассматривает европейские сборные в качестве соперников сборной России по товарищеским матчам. «Действительно, ведутся переговоры с достаточно большим количеством сборных, сейчас просто немного другая ситуация, с учетом того что ряд европейских команд, которые вышли на Евро, тоже будут проводить товарищеские матчи. Сейчас соперники, видимо, определяются раньше, потому что все заинтересованы в том, чтобы март сформировать уже сейчас, а не ближе к марту. Надеемся, что немного времени займет это принятие решений, здесь не только от нас зависит, но и от других стран. Нами всегда рассматривались команды из Европы, но, во-первых, готовы ли они играть, а во-вторых, они были заняты. Сейчас кто-то освободился, поэтому посмотрим», — цитирует Митрофанова ТАСС. 28 февраля 2022 года Международная федерация футбола (ФИФА) и Союз европейских футбольных ассоциаций (УЕФА) отстранили российские клубы и сборные от участия в международных соревнованиях из-за ситуации на Украине.","pubDate":"2023-11-24 17:57:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"70479dd6b4bf08ed9e71a53699de44c8","title":"Гвардиола сравнил обвинение в адрес «Ман Сити» и бан «Эвертона» за нарушение ФФП","link":"https://www.sport-express.ru/football/england/news/gvardiola-sravnil-obvinenie-v-adres-man-siti-i-ban-evertona-za-narushenie-ffp-2149591/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Главный тренер «Манчестер Сити» Хосеп Гвардиола прокомментировал лишение «Эвертона» 10 очков за нарушение правил финансового фейр-плей.","content":"Главный тренер «Манчестер Сити» Хосеп Гвардиола прокомментировал лишение «Эвертона» 10 очков за нарушение правил финансового фейр-плей. Ранее в финансовых нарушениях обвиняли «Ман Сити». Гвардиола отметил, что не собирается защищать клуб, а делать это должны юристы. « Не скажу ни слова об «Эвертоне», потому что не знаю, что в действительности произошло. Это два совершенно разных дела. Знаю, людей интересует, почему «Сити» не понижают в классе, но давайте подождем. Я уже говорил месяц назад: давайте подождем, если мы виноваты, нас накажут. Что бы ни случилось, я останусь здесь, а по поводу дела «Эвертона» я ничего не знаю, но это совершенно другой случай. Вот почему сравнивать их нельзя», — цитирует Гвардиолу Manchester Evening News. После 12 туров «Эвертон» с 4 очками занимает 19-е место в турнирной таблице и отстает от 17-й строчки, позволяющей избежать вылета во второй дивизион, на 2 очка. В следующем туре 26 ноября команда дома сыграет против «Манчестер Юнайтед».","pubDate":"2023-11-24 17:51:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"1eeb411449ee3abe3ebbd4f59616f9a7","title":"Gary Lineker 'disappointed' as poo podcast shut down after he was one and only guest","link":"https://www.dailystar.co.uk/sport/football/gary-linker-joe-lycett-podcast-31522646","keywords":["Sport"],"creator":null,"video_url":null,"description":"England football icon Gary Lineker was the first guest on a unique new podcast called the Turdcast, only for the show to be flushed down the toilet, presenter Joe Lycett has announced","content":"shared his disappointment after he proved to be the only guest on a cancelled podcast. Comedian Joe Lycett had launched the new Turdcast podcast which involves celebrities literally “talking s***”. The show managed to secure a big-name first guest in Lineker while a giant inflatable toilet, called The Turdis, was due to be unveiled at Liverpool’s Albert Docks as part of a marketing campaign. However, it appears the show has gone down the pan after just one episode. Lycett, perhaps using a little toilet humour, took to social media to announce on X (formerly Twitter): “Following the incident yesterday at Liverpool Albert Docks and an ongoing investigation into the sewage spilled into the waters, it has been concluded that it would be inappropriate to launch the podcast today, and we’ve therefore made the decision to cancel to podcast indefinitely.” The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . He added: “I’ve very sorry to disappoint and hope we can launch soon. I’d like to reiterate that it was entirely safe and managed by the team very swiftly. I’ll be releasing more information in due course.” Meanwhile, Lineker has admitted his disappointment after the lid was closed on the podcast. The Match of the Day host and former England striker posted: “As Joe’s first guest on the podcast, this is all extremely disappointing. I agreed to it in good faith, but can’t help but feel somewhat let down. S*** happens, I guess.” However, the situation has left fans smelling something iffy, with one replying: “Nah, you are both up to something.” Another quipped: “I guess it's what happens when you drop the kids off at the pool.” A third suggested: “Looking forward to the big reveal on this. 100% something going on.” A fourth simply asked: “What is this s***?”","pubDate":"2023-11-24 17:48:27","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31522456.ece/ALTERNATES/s98/0_LINKER1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ec2970edf2cb1749ed894454092e25aa","title":"Агент Раконьяца: «О зимнем выкупе речи не идет»","link":"https://www.sport-express.ru/football/foreign/news/agent-rakonyaca-zayavil-chto-o-vykupe-futbolista-mozhno-budet-govorit-blizhe-k-letu-2149590/","keywords":["Футбол - Зарубежные"],"creator":null,"video_url":null,"description":"Футбольный агент Игор Глушевич рассказал, возможен ли выкуп форварда Марко Раконьяца «Бачка-Тополой» у «Локомотива».","content":"Футбольный агент Игор Глушевич рассказал, возможен ли выкуп форварда Марко Раконьяца «Бачка-Тополой» у «Локомотива». «О зимнем выкупе речи не идет, аренда рассчитана до лета. Там и можно будет обсуждать эту тему», — приводит «РБ Спорт» слова Глушевича. Раконьяц стал игроком «Локомотива» в 2022 году. 23-летний футболист арендован сербским клубом «Бачка-Топола» до конца сезона. За железнодорожников форвард провел 15 матчей, в которых отметился 1 результативной передачей.","pubDate":"2023-11-24 17:47:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"f3ea464d69db8a65b1dcf24164813b70","title":"F1 fans have Charles Leclerc theory after spotting what Ferrari driver has on his helmet","link":"https://www.dailystar.co.uk/sport/f1/f1-charles-leclerc-red-bull-31522872","keywords":["Sport"],"creator":null,"video_url":null,"description":"With the last race of the 2023 Formula One season upon us, eagled-eyed fans have spotted a message Charles Leclerc has written on his helmet leaving Ferrari fans worrying over his future","content":"Charles Leclerc has worried fans over his future due to the nature of a message he wrote on his helmet. The star is gearing up for the Abu Dhabi Grand Prix on Sunday (November 26) - the last of the season - as the 26-year-old was posing in team photographs on Friday (November 24). Pictures of the Monegasque and his helmet found itself going viral on social media. Fans noticed a message he wrote on it that read: \"Grazie Ferrari\", immediately leading to fears that it could be his last-ever race for the Italian team. One fan was filled with worry as they wrote: \"NGL (not going to lie), this is stressing me out did we manifest too hard?? Or what is happening here??\" Another fan commented: \"The 'grazie Ferrari' feels like goodbye NGL\", following rumours that Leclerc could be heading to Red Bull. Some fans, however, weren't taken in by the suggestive message as one insisted that he's just saying thanks to the team while stating that he has a contract with Ferrari for next year. A fourth fan found the message heartfelt considering the issues he's faced this season with having to retire from three races. \"The fact that he's still thanking Ferrari after everything he went thru this year...i love him grazie Charles Leclerc,\" a fan wrote on X (formerly known as Twitter). Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Leclerc currently sits 7th in the Drivers' Championship but could finish fourth as he's just 12 points away from team-mate Carlos Sainz and Aston Martin's Fernando Alonso. A fourth-placed finish for the Ferrari star he said means \"absolutely nothing\" following a season where's he's failed to build on his five career Grand Prix wins. Despite not caring too much on a fourth-placed finish, he's determined to guide Ferrari to second place in the Constructors' Championship as they sit four points behind Mercedes heading into Abdu Dhabi. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . “Honestly, I would really like the team to be second at the end of this weekend,\" he said. \"We’ve had a tough season and everybody deserves it. They’ve worked like crazy in order to bring the upgrades earlier and it will be deserved to be in second at the end of the year, so we’ll do absolutely everything for that.\"","pubDate":"2023-11-24 18:50:05","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31522982.ece/ALTERNATES/s98/0_F_oJtdCWsAAE7vPjpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f0ec4735b24bdb0d6824538353b3c713","title":"Mines football opens Division II playoffs eyeing another run to the national championship game: “We have an extra chip on our shoulder”","link":"https://www.denverpost.com/2023/11/24/colorado-mines-football-playoff-preview-national-title-run/","keywords":["College Sports","Sports","college football","Colorado School of Mines","John Matocha","NCAA","Pete Sterbick","RMAC"],"creator":["Kyle Newman"],"video_url":null,"description":"Under Pete Sterbick, the Orediggers' third head coach in the last three years after Gregg Brandon retired and Brandon Moore took the head job at San Diego, Mines is back as a favorite in the Division II playoffs after falling in the title game a year ago.","content":"GOLDEN — New coach, same standard. The ultimate goal hasn’t changed for Colorado School of Mines football: national championship or bust. Under Pete Sterbick, the Orediggers’ third head coach in three years following Gregg Brandon retiring and Brandon Moore taking the head job at San Diego, Mines is undefeated and back as a favorite in the NCAA Division II playoffs after falling in the title game a season ago. “The culture’s the same and I think it’s gotten even better,” Sterbick said. “The difference is our experience factor has gotten that much better after a five-game playoff run last year. Our mentality on what we want to accomplish is the same as far as the end goal. “But we have an extra chip on our shoulder with how things ended last year, and we feel like all the time that we have to re-prove ourselves to people. People forget about us, so we’re fired up.” Mines’ Cinderella carriage turned into a pumpkin in the national title game last year, when at McKinney ISD Stadium in McKinney, Texas. But Mines has all the pieces to get back to that same stadium for this year’s championship. The undefeated Orediggers (11-0) have been the top-ranked team in both Division II polls for the latter half of the season, securing a No. 1 seed in the tournament and home-field advantage at up until the championship. “When we get it packed in here, I think it’s an intimidating factor for us,” Sterbick said. “And we’re at 5,700 feet, so we love bringing teams from the Midwest out here.” Their pursuit of the program’s first national title begins Saturday in Golden, where Mines hosts Augustana at noon. The Orediggers boast Division II’s second-ranked scoring offense (51.1 points per game), its fourth-ranked scoring defense (11.5), the reigning Harlon Hill Trophy winner and college football’s active sacks leader in outside linebacker Nolan Reeve. It’s also the fifth consecutive NCAA tournament appearance for , which has “been able to increase the level (of athlete) that we’re looking for” despite the high academic bar to get into the school. “We’re able to battle (for recruits) against a lot of the FCS schools, especially the Ivies and the Pioneer League,” Sterbick said. “The other part about us versus the Ivies is we’re able to go and battle in the playoffs and for a championship every year, and Ivies don’t do that. That’s a big selling point for us. “We’ve been able win some (recruiting) battles that I don’t know that we were winning four, five years ago, against even some scholarship FCS schools. That’s what you need to do at the DII level. We’re not going to get a bunch of D-I bounce-backs, we’re not in the portal a lot, that’s pretty minimal. So we’ve got to get kids who have slipped through and who are about it for the right reasons, because you’ve got to be able to make it academically here.” in their regular season finale in Durango two weeks ago, the Orediggers clinched a fifth straight RMAC title while Matocha became college football’s all-time record-holder for total TDs. The QB threw for three scores and ran for another to push his career TD tally to 181, passing the mark of 178 shared by Case Keenum (Houston) and Blaine Hawkins (Central Iowa). The Orediggers’ offense also established a program record with 798 total yards against Fort Lewis while the defense held the outmatched Skyhawks to negative-33 yards in rushing offense. It was the seventh straight game in which Mines held their opponent under 100 total rushing yards. “We have great synergy as a team,” Reeve said. “We feed off each other’s momentum. It’s not just one side of the ball doing all the work…. We know everyone is going to give us our best shot, so we’ve got to them give our best shot, too. The defense hasn’t had any low points because we don’t need stress on (Matocha). We need him rolling.” Redshirt senior Max McLeod is Matocha’s favorite target. He reached 3,000 career receiving yards and 1,000 yards for the season in the win over Fort Lewis. Adding another dimension to the Orediggers’ offense is a two-headed run game featuring Noah Roper and Landon Walker. Roper, an Erie product, is and his 742 rushing yards this season already surpassed his career output in three seasons with the Big Green, while Walker’s in his first full season as tailback after playing in a hybrid tight end/fullback/running back role in 2022. “I’ve been waiting for this kind of opportunity for my entire college career,” Roper said. “I was originally hoping to transfer to a Power 5 school, but didn’t get that chance. Mines was on my doorstep right away… and I saw what they did in the program last year. I knew I had a chance to come back home, be a part of something special and be close to my family.” After Mines is rested and healthy for Augustana, where Sterbick played receiver and punter from 1998 to 2002. But there won’t be any emotions getting in the way for the head coach, and the Orediggers aren’t looking past the Vikings, a physical and disciplined team that’s coming off its first playoff win since 2010. “I’d like to put up 80 points again, but each week, no matter who we play.. it’s about playing Mines football and playing to our standard. If we’re able to do that, we can come out and play well and dominate,” Matocha said. “The national championship has been the goal since the start, but our motto all year has been 1-0. So there’s no looking past this week.”","pubDate":"2023-11-24 18:31:42","image_url":"https://www.denverpost.com/wp-content/uploads/2023/11/TDP-L-MINES-FOOTBALL-002.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"825ea204f078cbd5be83184d389ee222","title":"Browns top cornerback Denzel Ward to miss Sunday’s game against Denver with shoulder injury","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/11/24/browns-top-cornerback-denzel-ward-to-miss-sundays-game-against-denver-with-shoulder-injury","keywords":["NFL"],"creator":["Tom Withers, The Associated Press"],"video_url":null,"description":"BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Ward missed his third straight practice […]","content":"BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Read this article for free: Already have an account? To continue reading, please subscribe: * BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Ward missed his third straight practice on Friday, and coach Kevin Stefanski said the 26-year-old, who is having a sensational season for the league’s top-ranked defense, will sit against the Broncos (5-5). Stefanski wouldn’t forecast how long Ward, who got hurt in last weekend’s win over Pittsburgh, could be sidelined. Stefanski did not know the exact play in which Ward was injured. Ward’s absence puts extra pressure on Cleveland’s secondary, which has been dealing with several injuries the past two weeks. With Ward out, the Browns likely will start Greg Newsome II and Martin Emerson Jr. at the corners but they have other options. Starting safety Juan Thornhill returned to practice this week after missing two games with a calf injury and is listed as questionable. Stefanski also ruled out wide receiver Marquise Goodwin (concussion). Starting linebacker and captain Anthony Walker Jr. is questionable with a hamstring injury sustained last week. Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. ___ AP NFL: https://apnews.com/hub/NFL Advertisement","pubDate":"2023-11-24 18:30:35","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"97dd1e2389aa4990c53f07abc9cf5480","title":"Packers’ surge raises hopes they could work their way into playoff contention","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/11/24/packers-surge-raises-hopes-they-could-work-their-way-into-playoff-contention","keywords":["NFL"],"creator":["Steve Megargee, The Associated Press"],"video_url":null,"description":"Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. LaFleur said he […]","content":"Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. Read this article for free: Already have an account? To continue reading, please subscribe: * Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. LaFleur said he didn’t “want to go Jim Mora on you,” a reference to the sarcastic response by the former Indianapolis Colts coach to a playoff question during a disappointing 2001 season. LaFleur then added “I think we’re a long way from even thinking about that.” The postseason certainly seemed like a distant possibility after a four-game skid dropped the Packers to 2-5. The Packers seemed to concede as much when they sent veteran cornerback Rasul Douglas to the Buffalo Bills at the trade deadline. Green Bay (5-6) has won three of four since that slide, and the idea that the Packers could play meaningful games around Christmas suddenly doesn’t seem so far-fetched anymore. A surging offense, a resourceful defense and a favorable late-season schedule have created cause for optimism. “We’re trying to leave our mark on the division, on the NFC and in the league,” wide receiver Christian Watson said Thursday after the Packers’ 29-22 victory at Detroit. “A lot of people counted us out today, but we’re not listening to the outside now. We’re just going out there playing our brand of football, and just continue to stack these weeks and stack these days.” The Packers still have lots of work to do, and they face a stern test Dec. 3 when the defending Super Bowl champion Kansas City Chiefs (7-3) visit Lambeau Field for a Sunday night game. But four of their final five games are against teams with losing records. They visit the New York Giants (3-8), host the Tampa Bay Buccaneers (4-6) and have a two-game road swing at Carolina (1-9) and Minnesota (6-5) before hosting the Chicago Bears (3-8) to close the regular season. Jordan Love has sparked the Packers’ surge by throwing for 590 yards and five touchdowns without an interception over his last two games. The Packers also showcased their depth Thursday by beating the NFC North-leading Lions without running back Aaron Jones, cornerback Jaire Alexander, linebacker De’Vondre Campbell and safeties Rudy Ford and Darnell Savage, among others. “We’re taking it week by week right now,” Love said. “We need a win every week is the mindset we have.” WHAT’S WORKING An offense that failed to score a first-half touchdown in five straight games earlier this season scored touchdowns on its first two drives. … The Packers have produced five takeaways without committing a turnover during this two-game win streak. … After allowing five sacks in a 34-20 loss to the Lions at Lambeau on Sept. 28, the Packers didn’t give up a single sack in Thursday’s rematch. … Green Bay’s defense caused the Lions to go 1 of 5 on fourth-down attempts. WHAT NEEDS WORK The Packers gave up 140 yards rushing, though that actually represents an improvement from the 211 they gave up in the first Lions game. STOCK UP Rashan Gary matched a career high with three sacks in his first game at Ford Field since tearing his anterior cruciate ligament there last year. … S Jonathan Owens scored on a 27-yard fumble return and had 12 tackles, matching the second-highest total of his career. … Love has completed over two-thirds of his passes in three of his last four games. … WR Malik Heath, a rookie undrafted free agent with one career catch before Thursday, had four receptions for 46 yards. … RT Zach Tom continued his breakthrough season while helping protect Love. … Watson had a season-high 94 yards receiving and scored a touchdown for a second straight game. STOCK DOWN K Anders Carlson has missed an extra-point attempt in his last three games. He had one blocked in a 23-19 loss at Pittsburgh, sent one wide right in a 23-20 victory over the Los Angeles Chargers and pushed one wide left Thursday. INJURIES DL Devonte Wyatt left the game to get evaluated for a concussion. The list of Packers inactive for the game included Jones (knee), Alexander (shoulder), Campbell (neck), Ford (biceps), TE Josiah Deguara (hip) and WR Dontayvion Wicks (concussion/knee). TE Luke Musgrave (abdomen) and RB Emanuel Wilson (shoulder) were placed on injured reserve the day before the game. KEY NUMBER Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. 3-2: Gary collected three sacks and forced two fumbles Thursday. It was the first time a Packer had compiled three sacks and forced two fumbles in the same game since Aaron Kampman did it in 2006. NEXT STEPS With so many players recovering from injury, the Packers should benefit from the extra recovery time they have before their game with the Chiefs. ___ AP NFL: https://apnews.com/hub/NFL Advertisement Advertisement","pubDate":"2023-11-24 18:14:18","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"15fdcddcd941dffe14268c4265405e3f","title":"«ПСЖ» — «Монако»: смотреть трансляцию матча французской лиги (видео)","link":"https://www.sport-express.ru/football/france/news/pszh-monako-smotret-match-chempionata-francii-pryamaya-translyaciya-igry-onlayn-video-24-noyabrya-besplatno-vo-vkontakte-golovin-2149382/","keywords":["Футбол - Франция"],"creator":null,"video_url":null,"description":"24 ноября «ПСЖ» дома на стадионе «Парк де Пренс» в Париже сыграет против «Монако» в матче 13-го тура чемпионата Франции по футболу.","content":"24 ноября «ПСЖ» дома на стадионе «Парк де Пренс» в Париже сыграет против «Монако» в матче 13-го тура чемпионата Франции по футболу. Встреча начнется в 23.00 по московскому времени. Смотреть бесплатную видеотрансляцию матча «ПСЖ» — «Монако» в прямом эфире можно будет в соцсети «ВКонтакте» . «СЭ» проведет онлайн-трансляцию ключевых событий игры в своем матч-центре . Монегаски с 24 очками занимают третье место в турнирной таблице лиги 1. Парижане с 27 баллами лидируют в чемпионате Франции. За «Монако» выступает российский полузащитник Александр Головин. В текущем сезоне 27-летний футболист провел за команду 11 игр, забил пять мячей и сделал две результативные передачи. В последний раз «Монако» играл с «ПСЖ» 11 февраля 2023 года. Тогда монегаски обыграли соперника со счетом 3:1 в матче 23-го тура лиги 1 прошлого сезона.","pubDate":"2023-11-24 18:00:01","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"35cab23f69172e2c9d887d756253747f","title":"Deion Sanders says Pro Football Hall of Famer joining Colorado staff","link":"https://www.foxnews.com/sports/deion-sanders-says-pro-football-hall-famer-joining-colorado-staff","keywords":null,"creator":null,"video_url":null,"description":"Colorado head coach Deion Sanders said he was \"excited\" about Pro Football Hall of Famer Warren Sapp joining his staff. The school has not announced the hire.","content":"close Video Fox News Flash top sports headlines for November 24 Fox News Flash top sports headlines are here. Check out what's clicking on Foxnews.com. Help appears to be on the way for Colorado Buffaloes head football coach Deion Sanders , as there will now be two Pro Football Hall of Famers on the staff in Boulder. On his weekly radio show before his Buffaloes play their final game of the season, Sanders was asked about former NFL star Warren Sapp coming onto the coaching staff \"this year.\" Former Tampa Bay Buccaneers Warren Sapp looks on from the sidelines before a game against the Philadelphia Eagles at Raymond James Stadium in Tampa, Florida, Sept. 25, 2023. (Nathan Ray Seebeck-USA TODAY Sports) \"I’m excited about Coach Sapp. He’s a dear friend and I love to life. He’s going to be invaluable to what he brings to the table. The kids are going to love him. As far as the recruits as well. They’re going to love him,\" Sanders said \"The Colorado Football Coaches Show\" when asked about Sapp. Colorado has not announced Sapp’s addition, but he has been around the team in an unofficial capacity this season. DEION SANDERS' ROLLER-COASTER FIRST YEAR AT COLORADO: A TIMELINE Sapp appeared to confirm the news when he responded to a video on X of Sanders discussing his arrival. \"Reinforcement is On The Way!!\" Sapp posted. Sapp was selected to the Pro Football Hall of Fame in 2013 after 13 seasons in the NFL, seven of which resulted in Pro Bowl selections. He finished his career with 96.5 sacks and won a Super Bowl with the Tampa Bay Buccaneers . Tampa Bay Buccaneers former cornerback Ronde Barber poses with his bust along with Warren Sapp, Tony Dungy, Derrick Brooks and John Lynch during the 2023 Pro Football Hall of Fame Enshrinement at Tom Benson Hall of Fame Stadium in Canton, Ohio, Aug. 5, 2023. (Kirby Lee-USA TODAY Sports) \"First of all, he’s a technician,\" Sanders said when asked what he sees in Sapp. \"Great players, the commonality that most people don’t understand, they have a serious level of intellect about the game that’s tremendous. You may not see it or hear them articulate it, but it’s a certain level of intellect that when you get together, you’re like ‘Wow.’\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"I think the most beautiful moment I’ve seen is after practice he was in the hot tub with the whole darn defensive line,\" Sanders continued. \"And he was just going over stuff. It was just unbelievable. Like, Warren Sapp is in the hot tub. There’s probably 4,000 pounds in the hot tub right now.\" Colorado has had an up-and-down season, jumping out to a 3-0 start in Sanders’ first year as head coach. However, the Buffaloes are in the midst of a brutal stretch, losing seven of their last eight games, including a blowout loss to Washington State in Week 12. Colorado Buffaloes head coach Deion Sanders looks on prior to a game against the UCLA Bruins at Rose Bowl Stadium on Oct. 28, 2023 in Pasadena, California. (Sean M. Haffey/Getty Images) \"We didn’t accomplish what we wanted, but we accomplished what we needed,\" Sanders said Tuesday when asked how he would rate his first season if they defeat Utah on Saturday. \"I think hope is instilled tremendously in the city, in the student body, within this team, within this building, and you see the direction that we’re heading. CLICK HERE TO GET THE FOX NEWS APP \"So, the things that you look to as a loss, some kind of way I see it as a win. We didn’t do certainly what I wanted to do. But, we’re doing tremendously, much more than what was done. So, you’ve got to put it in perspective.\" Colorado will not be bowl-eligible in Sanders’ first season but will have a chance to get to five wins in its final regular season game against Utah on Saturday. Joe Morgan is a Sports Reporter for Fox News.","pubDate":"2023-11-24 17:59:09","image_url":null,"source_id":"foxnews","source_priority":59,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"bd3a85eed2623f15618de657cde50dfb","title":"РФС рассматривает команды из Европы в качестве соперников сборной России","link":"https://www.sport-express.ru/football/rusteam/news/rfs-rassmatrivaet-komandy-iz-evropy-v-kachestve-sopernikov-sbornoy-rossii-2149586/","keywords":["Футбол - Сборная России"],"creator":null,"video_url":null,"description":"Российский футбольный союз (РФС) рассматривает европейские сборные в качестве соперников сборной России по товарищеским матчам.","content":"Генеральный секретарь Российского футбольного союза (РФС) Максим Митрофанов сообщил, что РФС рассматривает европейские сборные в качестве соперников сборной России по товарищеским матчам. «Действительно, ведутся переговоры с достаточно большим количеством сборных, сейчас просто немного другая ситуация, с учетом того что ряд европейских команд, которые вышли на Евро, тоже будут проводить товарищеские матчи. Сейчас соперники, видимо, определяются раньше, потому что все заинтересованы в том, чтобы март сформировать уже сейчас, а не ближе к марту. Надеемся, что немного времени займет это принятие решений, здесь не только от нас зависит, но и от других стран. Нами всегда рассматривались команды из Европы, но, во-первых, готовы ли они играть, а во-вторых, они были заняты. Сейчас кто-то освободился, поэтому посмотрим», — цитирует Митрофанова ТАСС. 28 февраля 2022 года Международная федерация футбола (ФИФА) и Союз европейских футбольных ассоциаций (УЕФА) отстранили российские клубы и сборные от участия в международных соревнованиях из-за ситуации на Украине.","pubDate":"2023-11-24 17:57:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"70479dd6b4bf08ed9e71a53699de44c8","title":"Гвардиола сравнил обвинение в адрес «Ман Сити» и бан «Эвертона» за нарушение ФФП","link":"https://www.sport-express.ru/football/england/news/gvardiola-sravnil-obvinenie-v-adres-man-siti-i-ban-evertona-za-narushenie-ffp-2149591/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Главный тренер «Манчестер Сити» Хосеп Гвардиола прокомментировал лишение «Эвертона» 10 очков за нарушение правил финансового фейр-плей.","content":"Главный тренер «Манчестер Сити» Хосеп Гвардиола прокомментировал лишение «Эвертона» 10 очков за нарушение правил финансового фейр-плей. Ранее в финансовых нарушениях обвиняли «Ман Сити». Гвардиола отметил, что не собирается защищать клуб, а делать это должны юристы. « Не скажу ни слова об «Эвертоне», потому что не знаю, что в действительности произошло. Это два совершенно разных дела. Знаю, людей интересует, почему «Сити» не понижают в классе, но давайте подождем. Я уже говорил месяц назад: давайте подождем, если мы виноваты, нас накажут. Что бы ни случилось, я останусь здесь, а по поводу дела «Эвертона» я ничего не знаю, но это совершенно другой случай. Вот почему сравнивать их нельзя», — цитирует Гвардиолу Manchester Evening News. После 12 туров «Эвертон» с 4 очками занимает 19-е место в турнирной таблице и отстает от 17-й строчки, позволяющей избежать вылета во второй дивизион, на 2 очка. В следующем туре 26 ноября команда дома сыграет против «Манчестер Юнайтед».","pubDate":"2023-11-24 17:51:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"1eeb411449ee3abe3ebbd4f59616f9a7","title":"Gary Lineker 'disappointed' as poo podcast shut down after he was one and only guest","link":"https://www.dailystar.co.uk/sport/football/gary-linker-joe-lycett-podcast-31522646","keywords":["Sport"],"creator":null,"video_url":null,"description":"England football icon Gary Lineker was the first guest on a unique new podcast called the Turdcast, only for the show to be flushed down the toilet, presenter Joe Lycett has announced","content":"shared his disappointment after he proved to be the only guest on a cancelled podcast. Comedian Joe Lycett had launched the new Turdcast podcast which involves celebrities literally “talking s***”. The show managed to secure a big-name first guest in Lineker while a giant inflatable toilet, called The Turdis, was due to be unveiled at Liverpool’s Albert Docks as part of a marketing campaign. However, it appears the show has gone down the pan after just one episode. Lycett, perhaps using a little toilet humour, took to social media to announce on X (formerly Twitter): “Following the incident yesterday at Liverpool Albert Docks and an ongoing investigation into the sewage spilled into the waters, it has been concluded that it would be inappropriate to launch the podcast today, and we’ve therefore made the decision to cancel to podcast indefinitely.” The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . He added: “I’ve very sorry to disappoint and hope we can launch soon. I’d like to reiterate that it was entirely safe and managed by the team very swiftly. I’ll be releasing more information in due course.” Meanwhile, Lineker has admitted his disappointment after the lid was closed on the podcast. The Match of the Day host and former England striker posted: “As Joe’s first guest on the podcast, this is all extremely disappointing. I agreed to it in good faith, but can’t help but feel somewhat let down. S*** happens, I guess.” However, the situation has left fans smelling something iffy, with one replying: “Nah, you are both up to something.” Another quipped: “I guess it's what happens when you drop the kids off at the pool.” A third suggested: “Looking forward to the big reveal on this. 100% something going on.” A fourth simply asked: “What is this s***?”","pubDate":"2023-11-24 17:48:27","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31522456.ece/ALTERNATES/s98/0_LINKER1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ec2970edf2cb1749ed894454092e25aa","title":"Агент Раконьяца: «О зимнем выкупе речи не идет»","link":"https://www.sport-express.ru/football/foreign/news/agent-rakonyaca-zayavil-chto-o-vykupe-futbolista-mozhno-budet-govorit-blizhe-k-letu-2149590/","keywords":["Футбол - Зарубежные"],"creator":null,"video_url":null,"description":"Футбольный агент Игор Глушевич рассказал, возможен ли выкуп форварда Марко Раконьяца «Бачка-Тополой» у «Локомотива».","content":"Футбольный агент Игор Глушевич рассказал, возможен ли выкуп форварда Марко Раконьяца «Бачка-Тополой» у «Локомотива». «О зимнем выкупе речи не идет, аренда рассчитана до лета. Там и можно будет обсуждать эту тему», — приводит «РБ Спорт» слова Глушевича. Раконьяц стал игроком «Локомотива» в 2022 году. 23-летний футболист арендован сербским клубом «Бачка-Топола» до конца сезона. За железнодорожников форвард провел 15 матчей, в которых отметился 1 результативной передачей.","pubDate":"2023-11-24 17:47:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"f3ea464d69db8a65b1dcf24164813b70","title":"F1 fans have Charles Leclerc theory after spotting what Ferrari driver has on his helmet","link":"https://www.dailystar.co.uk/sport/f1/f1-charles-leclerc-red-bull-31522872","keywords":["Sport"],"creator":null,"video_url":null,"description":"With the last race of the 2023 Formula One season upon us, eagled-eyed fans have spotted a message Charles Leclerc has written on his helmet leaving Ferrari fans worrying over his future","content":"Charles Leclerc has worried fans over his future due to the nature of a message he wrote on his helmet. The star is gearing up for the Abu Dhabi Grand Prix on Sunday (November 26) - the last of the season - as the 26-year-old was posing in team photographs on Friday (November 24). Pictures of the Monegasque and his helmet found itself going viral on social media. Fans noticed a message he wrote on it that read: \"Grazie Ferrari\", immediately leading to fears that it could be his last-ever race for the Italian team. One fan was filled with worry as they wrote: \"NGL (not going to lie), this is stressing me out did we manifest too hard?? Or what is happening here??\" Another fan commented: \"The 'grazie Ferrari' feels like goodbye NGL\", following rumours that Leclerc could be heading to Red Bull. Some fans, however, weren't taken in by the suggestive message as one insisted that he's just saying thanks to the team while stating that he has a contract with Ferrari for next year. A fourth fan found the message heartfelt considering the issues he's faced this season with having to retire from three races. \"The fact that he's still thanking Ferrari after everything he went thru this year...i love him grazie Charles Leclerc,\" a fan wrote on X (formerly known as Twitter). Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month Leclerc currently sits 7th in the Drivers' Championship but could finish fourth as he's just 12 points away from team-mate Carlos Sainz and Aston Martin's Fernando Alonso. A fourth-placed finish for the Ferrari star he said means \"absolutely nothing\" following a season where's he's failed to build on his five career Grand Prix wins. Despite not caring too much on a fourth-placed finish, he's determined to guide Ferrari to second place in the Constructors' Championship as they sit four points behind Mercedes heading into Abdu Dhabi. The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . “Honestly, I would really like the team to be second at the end of this weekend,\" he said. \"We’ve had a tough season and everybody deserves it. They’ve worked like crazy in order to bring the upgrades earlier and it will be deserved to be in second at the end of the year, so we’ll do absolutely everything for that.\"","pubDate":"2023-11-24 18:50:05","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31522982.ece/ALTERNATES/s98/0_F_oJtdCWsAAE7vPjpeg.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f0ec4735b24bdb0d6824538353b3c713","title":"Mines football opens Division II playoffs eyeing another run to the national championship game: “We have an extra chip on our shoulder”","link":"https://www.denverpost.com/2023/11/24/colorado-mines-football-playoff-preview-national-title-run/","keywords":["College Sports","Sports","college football","Colorado School of Mines","John Matocha","NCAA","Pete Sterbick","RMAC"],"creator":["Kyle Newman"],"video_url":null,"description":"Under Pete Sterbick, the Orediggers' third head coach in the last three years after Gregg Brandon retired and Brandon Moore took the head job at San Diego, Mines is back as a favorite in the Division II playoffs after falling in the title game a year ago.","content":"GOLDEN — New coach, same standard. The ultimate goal hasn’t changed for Colorado School of Mines football: national championship or bust. Under Pete Sterbick, the Orediggers’ third head coach in three years following Gregg Brandon retiring and Brandon Moore taking the head job at San Diego, Mines is undefeated and back as a favorite in the NCAA Division II playoffs after falling in the title game a season ago. “The culture’s the same and I think it’s gotten even better,” Sterbick said. “The difference is our experience factor has gotten that much better after a five-game playoff run last year. Our mentality on what we want to accomplish is the same as far as the end goal. “But we have an extra chip on our shoulder with how things ended last year, and we feel like all the time that we have to re-prove ourselves to people. People forget about us, so we’re fired up.” Mines’ Cinderella carriage turned into a pumpkin in the national title game last year, when at McKinney ISD Stadium in McKinney, Texas. But Mines has all the pieces to get back to that same stadium for this year’s championship. The undefeated Orediggers (11-0) have been the top-ranked team in both Division II polls for the latter half of the season, securing a No. 1 seed in the tournament and home-field advantage at up until the championship. “When we get it packed in here, I think it’s an intimidating factor for us,” Sterbick said. “And we’re at 5,700 feet, so we love bringing teams from the Midwest out here.” Their pursuit of the program’s first national title begins Saturday in Golden, where Mines hosts Augustana at noon. The Orediggers boast Division II’s second-ranked scoring offense (51.1 points per game), its fourth-ranked scoring defense (11.5), the reigning Harlon Hill Trophy winner and college football’s active sacks leader in outside linebacker Nolan Reeve. It’s also the fifth consecutive NCAA tournament appearance for , which has “been able to increase the level (of athlete) that we’re looking for” despite the high academic bar to get into the school. “We’re able to battle (for recruits) against a lot of the FCS schools, especially the Ivies and the Pioneer League,” Sterbick said. “The other part about us versus the Ivies is we’re able to go and battle in the playoffs and for a championship every year, and Ivies don’t do that. That’s a big selling point for us. “We’ve been able win some (recruiting) battles that I don’t know that we were winning four, five years ago, against even some scholarship FCS schools. That’s what you need to do at the DII level. We’re not going to get a bunch of D-I bounce-backs, we’re not in the portal a lot, that’s pretty minimal. So we’ve got to get kids who have slipped through and who are about it for the right reasons, because you’ve got to be able to make it academically here.” in their regular season finale in Durango two weeks ago, the Orediggers clinched a fifth straight RMAC title while Matocha became college football’s all-time record-holder for total TDs. The QB threw for three scores and ran for another to push his career TD tally to 181, passing the mark of 178 shared by Case Keenum (Houston) and Blaine Hawkins (Central Iowa). The Orediggers’ offense also established a program record with 798 total yards against Fort Lewis while the defense held the outmatched Skyhawks to negative-33 yards in rushing offense. It was the seventh straight game in which Mines held their opponent under 100 total rushing yards. “We have great synergy as a team,” Reeve said. “We feed off each other’s momentum. It’s not just one side of the ball doing all the work…. We know everyone is going to give us our best shot, so we’ve got to them give our best shot, too. The defense hasn’t had any low points because we don’t need stress on (Matocha). We need him rolling.” Redshirt senior Max McLeod is Matocha’s favorite target. He reached 3,000 career receiving yards and 1,000 yards for the season in the win over Fort Lewis. Adding another dimension to the Orediggers’ offense is a two-headed run game featuring Noah Roper and Landon Walker. Roper, an Erie product, is and his 742 rushing yards this season already surpassed his career output in three seasons with the Big Green, while Walker’s in his first full season as tailback after playing in a hybrid tight end/fullback/running back role in 2022. “I’ve been waiting for this kind of opportunity for my entire college career,” Roper said. “I was originally hoping to transfer to a Power 5 school, but didn’t get that chance. Mines was on my doorstep right away… and I saw what they did in the program last year. I knew I had a chance to come back home, be a part of something special and be close to my family.” After Mines is rested and healthy for Augustana, where Sterbick played receiver and punter from 1998 to 2002. But there won’t be any emotions getting in the way for the head coach, and the Orediggers aren’t looking past the Vikings, a physical and disciplined team that’s coming off its first playoff win since 2010. “I’d like to put up 80 points again, but each week, no matter who we play.. it’s about playing Mines football and playing to our standard. If we’re able to do that, we can come out and play well and dominate,” Matocha said. “The national championship has been the goal since the start, but our motto all year has been 1-0. So there’s no looking past this week.”","pubDate":"2023-11-24 18:31:42","image_url":"https://www.denverpost.com/wp-content/uploads/2023/11/TDP-L-MINES-FOOTBALL-002.jpg?w=1400px&strip=all","source_id":"denverpost","source_priority":3130,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"825ea204f078cbd5be83184d389ee222","title":"Browns top cornerback Denzel Ward to miss Sunday’s game against Denver with shoulder injury","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/11/24/browns-top-cornerback-denzel-ward-to-miss-sundays-game-against-denver-with-shoulder-injury","keywords":["NFL"],"creator":["Tom Withers, The Associated Press"],"video_url":null,"description":"BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Ward missed his third straight practice […]","content":"BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Read this article for free: Already have an account? To continue reading, please subscribe: * BEREA, Ohio (AP) — The Cleveland Browns will be without Pro Bowl cornerback Denzel Ward on Sunday against Denver due to a shoulder injury. Ward missed his third straight practice on Friday, and coach Kevin Stefanski said the 26-year-old, who is having a sensational season for the league’s top-ranked defense, will sit against the Broncos (5-5). Stefanski wouldn’t forecast how long Ward, who got hurt in last weekend’s win over Pittsburgh, could be sidelined. Stefanski did not know the exact play in which Ward was injured. Ward’s absence puts extra pressure on Cleveland’s secondary, which has been dealing with several injuries the past two weeks. With Ward out, the Browns likely will start Greg Newsome II and Martin Emerson Jr. at the corners but they have other options. Starting safety Juan Thornhill returned to practice this week after missing two games with a calf injury and is listed as questionable. Stefanski also ruled out wide receiver Marquise Goodwin (concussion). Starting linebacker and captain Anthony Walker Jr. is questionable with a hamstring injury sustained last week. Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. ___ AP NFL: https://apnews.com/hub/NFL Advertisement","pubDate":"2023-11-24 18:30:35","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"97dd1e2389aa4990c53f07abc9cf5480","title":"Packers’ surge raises hopes they could work their way into playoff contention","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/11/24/packers-surge-raises-hopes-they-could-work-their-way-into-playoff-contention","keywords":["NFL"],"creator":["Steve Megargee, The Associated Press"],"video_url":null,"description":"Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. LaFleur said he […]","content":"Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. Read this article for free: Already have an account? To continue reading, please subscribe: * Green Bay Packers coach Matt LaFleur took issue this week when he was asked whether he’s reminding players about the possibility of making a late-season playoff run. LaFleur said he didn’t “want to go Jim Mora on you,” a reference to the sarcastic response by the former Indianapolis Colts coach to a playoff question during a disappointing 2001 season. LaFleur then added “I think we’re a long way from even thinking about that.” The postseason certainly seemed like a distant possibility after a four-game skid dropped the Packers to 2-5. The Packers seemed to concede as much when they sent veteran cornerback Rasul Douglas to the Buffalo Bills at the trade deadline. Green Bay (5-6) has won three of four since that slide, and the idea that the Packers could play meaningful games around Christmas suddenly doesn’t seem so far-fetched anymore. A surging offense, a resourceful defense and a favorable late-season schedule have created cause for optimism. “We’re trying to leave our mark on the division, on the NFC and in the league,” wide receiver Christian Watson said Thursday after the Packers’ 29-22 victory at Detroit. “A lot of people counted us out today, but we’re not listening to the outside now. We’re just going out there playing our brand of football, and just continue to stack these weeks and stack these days.” The Packers still have lots of work to do, and they face a stern test Dec. 3 when the defending Super Bowl champion Kansas City Chiefs (7-3) visit Lambeau Field for a Sunday night game. But four of their final five games are against teams with losing records. They visit the New York Giants (3-8), host the Tampa Bay Buccaneers (4-6) and have a two-game road swing at Carolina (1-9) and Minnesota (6-5) before hosting the Chicago Bears (3-8) to close the regular season. Jordan Love has sparked the Packers’ surge by throwing for 590 yards and five touchdowns without an interception over his last two games. The Packers also showcased their depth Thursday by beating the NFC North-leading Lions without running back Aaron Jones, cornerback Jaire Alexander, linebacker De’Vondre Campbell and safeties Rudy Ford and Darnell Savage, among others. “We’re taking it week by week right now,” Love said. “We need a win every week is the mindset we have.” WHAT’S WORKING An offense that failed to score a first-half touchdown in five straight games earlier this season scored touchdowns on its first two drives. … The Packers have produced five takeaways without committing a turnover during this two-game win streak. … After allowing five sacks in a 34-20 loss to the Lions at Lambeau on Sept. 28, the Packers didn’t give up a single sack in Thursday’s rematch. … Green Bay’s defense caused the Lions to go 1 of 5 on fourth-down attempts. WHAT NEEDS WORK The Packers gave up 140 yards rushing, though that actually represents an improvement from the 211 they gave up in the first Lions game. STOCK UP Rashan Gary matched a career high with three sacks in his first game at Ford Field since tearing his anterior cruciate ligament there last year. … S Jonathan Owens scored on a 27-yard fumble return and had 12 tackles, matching the second-highest total of his career. … Love has completed over two-thirds of his passes in three of his last four games. … WR Malik Heath, a rookie undrafted free agent with one career catch before Thursday, had four receptions for 46 yards. … RT Zach Tom continued his breakthrough season while helping protect Love. … Watson had a season-high 94 yards receiving and scored a touchdown for a second straight game. STOCK DOWN K Anders Carlson has missed an extra-point attempt in his last three games. He had one blocked in a 23-19 loss at Pittsburgh, sent one wide right in a 23-20 victory over the Los Angeles Chargers and pushed one wide left Thursday. INJURIES DL Devonte Wyatt left the game to get evaluated for a concussion. The list of Packers inactive for the game included Jones (knee), Alexander (shoulder), Campbell (neck), Ford (biceps), TE Josiah Deguara (hip) and WR Dontayvion Wicks (concussion/knee). TE Luke Musgrave (abdomen) and RB Emanuel Wilson (shoulder) were placed on injured reserve the day before the game. KEY NUMBER Winnipeg Jets Game Days On Winnipeg Jets game days, hockey writers Mike McIntyre and Ken Wiebe send news, notes and quotes from the morning skate, as well as injury updates and lineup decisions. Arrives a few hours prior to puck drop. 3-2: Gary collected three sacks and forced two fumbles Thursday. It was the first time a Packer had compiled three sacks and forced two fumbles in the same game since Aaron Kampman did it in 2006. NEXT STEPS With so many players recovering from injury, the Packers should benefit from the extra recovery time they have before their game with the Chiefs. ___ AP NFL: https://apnews.com/hub/NFL Advertisement Advertisement","pubDate":"2023-11-24 18:14:18","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"15fdcddcd941dffe14268c4265405e3f","title":"«ПСЖ» — «Монако»: смотреть трансляцию матча французской лиги (видео)","link":"https://www.sport-express.ru/football/france/news/pszh-monako-smotret-match-chempionata-francii-pryamaya-translyaciya-igry-onlayn-video-24-noyabrya-besplatno-vo-vkontakte-golovin-2149382/","keywords":["Футбол - Франция"],"creator":null,"video_url":null,"description":"24 ноября «ПСЖ» дома на стадионе «Парк де Пренс» в Париже сыграет против «Монако» в матче 13-го тура чемпионата Франции по футболу.","content":"24 ноября «ПСЖ» дома на стадионе «Парк де Пренс» в Париже сыграет против «Монако» в матче 13-го тура чемпионата Франции по футболу. Встреча начнется в 23.00 по московскому времени. Смотреть бесплатную видеотрансляцию матча «ПСЖ» — «Монако» в прямом эфире можно будет в соцсети «ВКонтакте» . «СЭ» проведет онлайн-трансляцию ключевых событий игры в своем матч-центре . Монегаски с 24 очками занимают третье место в турнирной таблице лиги 1. Парижане с 27 баллами лидируют в чемпионате Франции. За «Монако» выступает российский полузащитник Александр Головин. В текущем сезоне 27-летний футболист провел за команду 11 игр, забил пять мячей и сделал две результативные передачи. В последний раз «Монако» играл с «ПСЖ» 11 февраля 2023 года. Тогда монегаски обыграли соперника со счетом 3:1 в матче 23-го тура лиги 1 прошлого сезона.","pubDate":"2023-11-24 18:00:01","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"35cab23f69172e2c9d887d756253747f","title":"Deion Sanders says Pro Football Hall of Famer joining Colorado staff","link":"https://www.foxnews.com/sports/deion-sanders-says-pro-football-hall-famer-joining-colorado-staff","keywords":null,"creator":null,"video_url":null,"description":"Colorado head coach Deion Sanders said he was \"excited\" about Pro Football Hall of Famer Warren Sapp joining his staff. The school has not announced the hire.","content":"close Video Fox News Flash top sports headlines for November 24 Fox News Flash top sports headlines are here. Check out what's clicking on Foxnews.com. Help appears to be on the way for Colorado Buffaloes head football coach Deion Sanders , as there will now be two Pro Football Hall of Famers on the staff in Boulder. On his weekly radio show before his Buffaloes play their final game of the season, Sanders was asked about former NFL star Warren Sapp coming onto the coaching staff \"this year.\" Former Tampa Bay Buccaneers Warren Sapp looks on from the sidelines before a game against the Philadelphia Eagles at Raymond James Stadium in Tampa, Florida, Sept. 25, 2023. (Nathan Ray Seebeck-USA TODAY Sports) \"I’m excited about Coach Sapp. He’s a dear friend and I love to life. He’s going to be invaluable to what he brings to the table. The kids are going to love him. As far as the recruits as well. They’re going to love him,\" Sanders said \"The Colorado Football Coaches Show\" when asked about Sapp. Colorado has not announced Sapp’s addition, but he has been around the team in an unofficial capacity this season. DEION SANDERS' ROLLER-COASTER FIRST YEAR AT COLORADO: A TIMELINE Sapp appeared to confirm the news when he responded to a video on X of Sanders discussing his arrival. \"Reinforcement is On The Way!!\" Sapp posted. Sapp was selected to the Pro Football Hall of Fame in 2013 after 13 seasons in the NFL, seven of which resulted in Pro Bowl selections. He finished his career with 96.5 sacks and won a Super Bowl with the Tampa Bay Buccaneers . Tampa Bay Buccaneers former cornerback Ronde Barber poses with his bust along with Warren Sapp, Tony Dungy, Derrick Brooks and John Lynch during the 2023 Pro Football Hall of Fame Enshrinement at Tom Benson Hall of Fame Stadium in Canton, Ohio, Aug. 5, 2023. (Kirby Lee-USA TODAY Sports) \"First of all, he’s a technician,\" Sanders said when asked what he sees in Sapp. \"Great players, the commonality that most people don’t understand, they have a serious level of intellect about the game that’s tremendous. You may not see it or hear them articulate it, but it’s a certain level of intellect that when you get together, you’re like ‘Wow.’\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"I think the most beautiful moment I’ve seen is after practice he was in the hot tub with the whole darn defensive line,\" Sanders continued. \"And he was just going over stuff. It was just unbelievable. Like, Warren Sapp is in the hot tub. There’s probably 4,000 pounds in the hot tub right now.\" Colorado has had an up-and-down season, jumping out to a 3-0 start in Sanders’ first year as head coach. However, the Buffaloes are in the midst of a brutal stretch, losing seven of their last eight games, including a blowout loss to Washington State in Week 12. Colorado Buffaloes head coach Deion Sanders looks on prior to a game against the UCLA Bruins at Rose Bowl Stadium on Oct. 28, 2023 in Pasadena, California. (Sean M. Haffey/Getty Images) \"We didn’t accomplish what we wanted, but we accomplished what we needed,\" Sanders said Tuesday when asked how he would rate his first season if they defeat Utah on Saturday. \"I think hope is instilled tremendously in the city, in the student body, within this team, within this building, and you see the direction that we’re heading. CLICK HERE TO GET THE FOX NEWS APP \"So, the things that you look to as a loss, some kind of way I see it as a win. We didn’t do certainly what I wanted to do. But, we’re doing tremendously, much more than what was done. So, you’ve got to put it in perspective.\" Colorado will not be bowl-eligible in Sanders’ first season but will have a chance to get to five wins in its final regular season game against Utah on Saturday. Joe Morgan is a Sports Reporter for Fox News.","pubDate":"2023-11-24 17:59:09","image_url":null,"source_id":"foxnews","source_priority":59,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"bd3a85eed2623f15618de657cde50dfb","title":"РФС рассматривает команды из Европы в качестве соперников сборной России","link":"https://www.sport-express.ru/football/rusteam/news/rfs-rassmatrivaet-komandy-iz-evropy-v-kachestve-sopernikov-sbornoy-rossii-2149586/","keywords":["Футбол - Сборная России"],"creator":null,"video_url":null,"description":"Российский футбольный союз (РФС) рассматривает европейские сборные в качестве соперников сборной России по товарищеским матчам.","content":"Генеральный секретарь Российского футбольного союза (РФС) Максим Митрофанов сообщил, что РФС рассматривает европейские сборные в качестве соперников сборной России по товарищеским матчам. «Действительно, ведутся переговоры с достаточно большим количеством сборных, сейчас просто немного другая ситуация, с учетом того что ряд европейских команд, которые вышли на Евро, тоже будут проводить товарищеские матчи. Сейчас соперники, видимо, определяются раньше, потому что все заинтересованы в том, чтобы март сформировать уже сейчас, а не ближе к марту. Надеемся, что немного времени займет это принятие решений, здесь не только от нас зависит, но и от других стран. Нами всегда рассматривались команды из Европы, но, во-первых, готовы ли они играть, а во-вторых, они были заняты. Сейчас кто-то освободился, поэтому посмотрим», — цитирует Митрофанова ТАСС. 28 февраля 2022 года Международная федерация футбола (ФИФА) и Союз европейских футбольных ассоциаций (УЕФА) отстранили российские клубы и сборные от участия в международных соревнованиях из-за ситуации на Украине.","pubDate":"2023-11-24 17:57:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"70479dd6b4bf08ed9e71a53699de44c8","title":"Гвардиола сравнил обвинение в адрес «Ман Сити» и бан «Эвертона» за нарушение ФФП","link":"https://www.sport-express.ru/football/england/news/gvardiola-sravnil-obvinenie-v-adres-man-siti-i-ban-evertona-za-narushenie-ffp-2149591/","keywords":["Футбол - Англия"],"creator":null,"video_url":null,"description":"Главный тренер «Манчестер Сити» Хосеп Гвардиола прокомментировал лишение «Эвертона» 10 очков за нарушение правил финансового фейр-плей.","content":"Главный тренер «Манчестер Сити» Хосеп Гвардиола прокомментировал лишение «Эвертона» 10 очков за нарушение правил финансового фейр-плей. Ранее в финансовых нарушениях обвиняли «Ман Сити». Гвардиола отметил, что не собирается защищать клуб, а делать это должны юристы. « Не скажу ни слова об «Эвертоне», потому что не знаю, что в действительности произошло. Это два совершенно разных дела. Знаю, людей интересует, почему «Сити» не понижают в классе, но давайте подождем. Я уже говорил месяц назад: давайте подождем, если мы виноваты, нас накажут. Что бы ни случилось, я останусь здесь, а по поводу дела «Эвертона» я ничего не знаю, но это совершенно другой случай. Вот почему сравнивать их нельзя», — цитирует Гвардиолу Manchester Evening News. После 12 туров «Эвертон» с 4 очками занимает 19-е место в турнирной таблице и отстает от 17-й строчки, позволяющей избежать вылета во второй дивизион, на 2 очка. В следующем туре 26 ноября команда дома сыграет против «Манчестер Юнайтед».","pubDate":"2023-11-24 17:51:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"},{"article_id":"1eeb411449ee3abe3ebbd4f59616f9a7","title":"Gary Lineker 'disappointed' as poo podcast shut down after he was one and only guest","link":"https://www.dailystar.co.uk/sport/football/gary-linker-joe-lycett-podcast-31522646","keywords":["Sport"],"creator":null,"video_url":null,"description":"England football icon Gary Lineker was the first guest on a unique new podcast called the Turdcast, only for the show to be flushed down the toilet, presenter Joe Lycett has announced","content":"shared his disappointment after he proved to be the only guest on a cancelled podcast. Comedian Joe Lycett had launched the new Turdcast podcast which involves celebrities literally “talking s***”. The show managed to secure a big-name first guest in Lineker while a giant inflatable toilet, called The Turdis, was due to be unveiled at Liverpool’s Albert Docks as part of a marketing campaign. However, it appears the show has gone down the pan after just one episode. Lycett, perhaps using a little toilet humour, took to social media to announce on X (formerly Twitter): “Following the incident yesterday at Liverpool Albert Docks and an ongoing investigation into the sewage spilled into the waters, it has been concluded that it would be inappropriate to launch the podcast today, and we’ve therefore made the decision to cancel to podcast indefinitely.” The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . He added: “I’ve very sorry to disappoint and hope we can launch soon. I’d like to reiterate that it was entirely safe and managed by the team very swiftly. I’ll be releasing more information in due course.” Meanwhile, Lineker has admitted his disappointment after the lid was closed on the podcast. The Match of the Day host and former England striker posted: “As Joe’s first guest on the podcast, this is all extremely disappointing. I agreed to it in good faith, but can’t help but feel somewhat let down. S*** happens, I guess.” However, the situation has left fans smelling something iffy, with one replying: “Nah, you are both up to something.” Another quipped: “I guess it's what happens when you drop the kids off at the pool.” A third suggested: “Looking forward to the big reveal on this. 100% something going on.” A fourth simply asked: “What is this s***?”","pubDate":"2023-11-24 17:48:27","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31522456.ece/ALTERNATES/s98/0_LINKER1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ec2970edf2cb1749ed894454092e25aa","title":"Агент Раконьяца: «О зимнем выкупе речи не идет»","link":"https://www.sport-express.ru/football/foreign/news/agent-rakonyaca-zayavil-chto-o-vykupe-futbolista-mozhno-budet-govorit-blizhe-k-letu-2149590/","keywords":["Футбол - Зарубежные"],"creator":null,"video_url":null,"description":"Футбольный агент Игор Глушевич рассказал, возможен ли выкуп форварда Марко Раконьяца «Бачка-Тополой» у «Локомотива».","content":"Футбольный агент Игор Глушевич рассказал, возможен ли выкуп форварда Марко Раконьяца «Бачка-Тополой» у «Локомотива». «О зимнем выкупе речи не идет, аренда рассчитана до лета. Там и можно будет обсуждать эту тему», — приводит «РБ Спорт» слова Глушевича. Раконьяц стал игроком «Локомотива» в 2022 году. 23-летний футболист арендован сербским клубом «Бачка-Топола» до конца сезона. За железнодорожников форвард провел 15 матчей, в которых отметился 1 результативной передачей.","pubDate":"2023-11-24 17:47:00","image_url":null,"source_id":"sport_express","source_priority":81120,"country":["russia"],"category":["sports"],"language":"russian"}]}