{"newsArray":[{"title":"Football: Lions coach Nishigaya wants all-round improvement after ‘painful’ AFF C’ship result","link":"https://www.straitstimes.com/sport/football/football-lions-coach-nishigaya-wants-all-round-improvement-after-painful-aff-c-ship-result","keywords":null,"creator":null,"video_url":null,"description":"January 04, 2023 7:09 PM'I can be better, and the players can be better. There is a lot of room to grow,' he told ST.","content":null,"pubDate":"2023-01-04 11:09:23","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Mercato : Sadio Mané parmi les 10 transferts marquants de l’année 2022","link":"https://senego.com/mercato-sadio-mane-parmi-les-10-transferts-marquants-de-lannee-2022_1502201.html","keywords":["Actualités","Football","Sénégal","Sports","Mercato","Sadio Mané","transferts marquants de l’année 2022"],"creator":["Diéry DIALLO"],"video_url":null,"description":"L’année 2022 a touché à sa fin, place à 2023. L’occasion parfaite pour nos confrères de 10 sport de se remémorer les faits marquants du football durant cette année qui aura notamment vu Karim Benzema soulever son premier Ballon d’Or et Leo Messi sa première Coupe du monde. Au niveau du mercato, 10 gros transferts […]","content":null,"pubDate":"2023-01-04 11:01:53","image_url":null,"source_id":"senego","country":["senegal"],"category":["sports"],"language":"french"},{"title":"“Who doesn’t know Pele?” Ababu honours football legend as a gamechanger","link":"https://www.capitalfm.co.ke/sports/2023/01/04/who-doesnt-know-pele-ababu-honours-football-legend-as-a-gamechanger/","keywords":["Football","Kenyan Premier League","featured"],"creator":["Omondi Onyatta"],"video_url":null,"description":"NAIROBI, Kenya, Jan 4 – Sports Cabinet Secretary Ababu Namwamba says Brazilian football legend Pele has left an indelible mark on the global society through his achievements on the pitch. The 82-year-old three-time World Cup winner, who passed on last week after a long battle with cancer, was laid to rest on Wednesday in his […] The post “Who doesn’t know Pele?” Ababu honours football legend as a gamechanger appeared first on Capital Sports.","content":"NAIROBI, Kenya, Jan 4 – Sports Cabinet Secretary Ababu Namwamba says Brazilian football legend Pele has left an indelible mark on the global society through his achievements on the pitch. The 82-year-old three-time World Cup winner, who passed on last week after a long battle with cancer, was laid to rest on Wednesday in his Southeastern port city of Santos after wake and funeral service attended by thousands of football fans. Commenting on the Brazilian who made it to the worldwide limelight at the age of 17, Namwamba said Pele had uncovered the power of football to make the universe a better place. “Who doesn’t know Pele…even those of us born many years after he played know that football is synonymous with Pele. He was not just an incredibly gifted football who did mesmerizing things with the ball but was also a player who personified the power of football…power to unite, break the barriers of race, language, region and of class,” Namwamba said. Tribute to Legend #Pele pic.twitter.com/K6rQ7YYVFS— Hon Ababu-Namwamba, EGH (@AbabuNamwamba) January 4, 2023 The CS described the former Santos man as a symbol of sportsmanship and an example to many generations of sportspersons, including in Kenya, on the power of sports. “He was a gentleman who rose from nowhere to become the single most potent symbol of sportsmanship. Even as we celebrate this great icon, we also celebrate him for what he has done to elevate sports to what it is currently. Pele demonstrated that whether you are black or white, American or African…sports is a language we can all understand,” Namwamba said. During the funeral service for the legend, Fifa president Gianni Infantino requested federations across the globe to name at least one stadium in their geographical territories after the Brazilian. It remains to be seen whether Kenya will agree to the same considering the previous calls for the government to honour the country’s own sporting heroes by naming various stadia after them. The post “Who doesn’t know Pele?” Ababu honours football legend as a gamechanger appeared first on Capital Sports.","pubDate":"2023-01-04 10:57:22","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Mercato : Ghoulam se rapproche d’Angers ?","link":"https://www.dzfoot.com/verts-deurope/mercato-ghoulam-se-rapproche-dangers-236446.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Transferts","Verts du Monde"],"creator":null,"video_url":null,"description":"Le latéral gauche algérien, Faouzi Ghoulam, serait dans le viseur des dirigeants du SCO Angers, depuis plusieurs jours, à en croire les informations du quotidien français Ouest-France. En quête d’un nouveau club depuis la fin de son bail avec Naples, l’été dernier, le défenseur de 31 ans s’est entrainé quelques semaines avec son club formateur […] The post Mercato : Ghoulam se rapproche d’Angers ? appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-04 10:45:32","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"CHAN 2022 : L’Ouganda dévoile sa liste de 25 joueurs","link":"https://www.dzfoot.com/divers/chan-2022-louganda-devoile-sa-liste-de-25-joueurs-236443.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Divers","Football en Algérie"],"creator":null,"video_url":null,"description":"Le sélectionneur de l'équipe A' d'Ouganda, le Serbe Milutin Sredojevic \"Micho\" a dévoilé la liste des 25 joueurs retenus pour défendre les chances du pays, lors du Championnat d’Afrique des nations de football (CHAN-2022) que l'Algérie abritera du 13 janvier au 4 février en Algérie, a indiqué la fédération ougandaise de football. L'équipe ougandaise qui […] The post CHAN 2022 : L’Ouganda dévoile sa liste de 25 joueurs appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-04 10:32:35","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"CHAN 2022 : Les 28 congolais sélectionnés pour le tournoi connus","link":"https://www.dzfoot.com/divers/chan-2022-les-28-congolais-selectionnes-pour-le-tournoi-connus-236441.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Divers","Football en Algérie"],"creator":null,"video_url":null,"description":"La Fédération congolaise de football (FECOFA) a rendu public, la liste des 28 joueurs de l'équipe nationale A', en plus de trois réservistes, retenus, par le sélectionneur Otis Ngoma Kondi, pour la phase finale du 7e Championnat d’Afrique des Nations, abrité par l'Algérie du 13 janvier au 4 février 2023. La liste des 28 Léopards […] The post CHAN 2022 : Les 28 congolais sélectionnés pour le tournoi connus appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-04 10:29:13","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"CHAN 2022 : L’équipe ghanéenne arrive à Alger","link":"https://www.dzfoot.com/divers/chan-2022-lequipe-ghaneenne-arrive-a-alger-236438.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Divers","Football en Algérie"],"creator":null,"video_url":null,"description":"La délégation de l'équipe ghanéenne de football a rallié Alger mardi, en vue du Championnat d'Afrique des nations CHAN-2022 (reporté à 2023), prévu en Algérie du 13 janvier au 4 février. L'équipe du Ghana qui signe son retour au CHAN après huit ans d'absence, a été accueillie à son arrivée à l'aéroport international Houari-Boumediene d'Alger, […] The post CHAN 2022 : L’équipe ghanéenne arrive à Alger appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-04 10:26:18","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"CHAN 2022 : La liste du Cameroun dévoilée","link":"https://www.dzfoot.com/divers/chan-2022-la-liste-du-cameroun-devoilee-236434.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Divers","Football en Algérie"],"creator":null,"video_url":null,"description":"Le sélectionneur de l'équipe camerounaise de football A', composée de joueurs locaux Alioum Saidou, a retenu 25 joueurs pour prendre part au Championnat d’Afrique des Nations CHAN-2022 (reporté à 2023), prévu en Algérie (13 janvier - 4 février), a annoncé la Fédération camerounaise (Fécafoot) mardi sur son site officiel. Les \"Lions Indomptables\" locaux ont rallié […] The post CHAN 2022 : La liste du Cameroun dévoilée appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-04 10:24:15","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"EN A’ : Algérie-Ghana délocalisé au stade de Baraki","link":"https://www.dzfoot.com/divers/en-a-algerie-ghana-delocalise-au-stade-de-baraki-236431.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Divers","Football en Algérie"],"creator":null,"video_url":null,"description":"Le match amical entre l'équipe algérienne de football A', composée de joueurs locaux, et son homologue ghanéenne, prévu initialement samedi au stade Miloud-Hadefi d'Oran (20h00), se jouera finalement au stade de Baraki (20h00), en vue du Championnat d'Afrique des nations CHAN-2022 (reporté à 2023) en Algérie du 13 janvier au 4 février, a annoncé la […] The post EN A’ : Algérie-Ghana délocalisé au stade de Baraki appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-04 10:22:13","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"Terrier donne de ses nouvelles, un départ à Nice, Bordeaux veut dégraisser","link":"https://www.butfootballclub.fr/angers-sco/le-sco-d-angers-vise-par-une-enquete-801931","keywords":null,"creator":null,"video_url":null,"description":"Si But! Football Club traite en premier lieu l'actualité de certaines équipes de l'élite, nous avons décidé de vous faire un résumé de ce qu'il s'est passé aujourd'hui dans l'autre partie - moins médiatique - du football français.","content":null,"pubDate":"2023-01-04 10:20:00","image_url":"https://static.butfootballclub.fr/16/2023/01/photo_article/801931/318322/1200-L-le-sco-d-angers-vis-par-une-enqute.jpg","source_id":"butfootballclub","country":["france"],"category":["sports"],"language":"french"},{"title":"CHAN 2022 : Le sélectionneur de Madagascar dévoile sa liste","link":"https://www.dzfoot.com/football-en-algerie/chan-2022-le-selectionneur-de-madagascar-devoile-sa-liste-236428.html?utm_source=rss_feed&utm_medium=link&utm_campaign=unknown","keywords":["Divers","Football en Algérie"],"creator":null,"video_url":null,"description":"La liste des 25 joueurs de la sélection nationale A' de Madagascar pour le Championnat d'Afrique des Nations de football (CHAN), réservé aux joueurs locaux, prévu en Algérie (13 jan-4 fév 2023), a été annoncée par le sélectionneur national malgache, Romuald Rakotondrabe \"Roro\", à la veille du déplacement de l'équipe pour la Tunisie pour le […] The post CHAN 2022 : Le sélectionneur de Madagascar dévoile sa liste appeared first on Football Algérien - DZFOOT.COM.","content":null,"pubDate":"2023-01-04 10:19:27","image_url":null,"source_id":"dzfoot","country":["algeria"],"category":["sports"],"language":"french"},{"title":"Football legend Pele buried on 9th floor of world's tallest vertical cemetery","link":"https://www.standardmedia.co.ke/sports/article/2001464447/football-legend-pele-buried-on-9th-floor-of-world-s-tallest-vertical-cemetery","keywords":null,"creator":["Standard Digital"],"video_url":null,"description":"Pele buried on ninth floor of a cemetery in Santos - in tribute to his father who wore the number 9 shirt as a player.","content":null,"pubDate":"2023-01-04 09:47:40","image_url":null,"source_id":"standardmedia","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Mercato en direct : le fil du mercredi 4 janvier","link":"https://www.butfootballclub.fr/mercato-en-direct-le-fil-du-mercredi-4-janvier","keywords":null,"creator":null,"video_url":null,"description":"Chaque jour, lors de ce Mercato de janvier 2023, l'équipe de But! Football Club vous propose un fil rouge de l'actualité des transferts en France, au Real Madrid et au FC Barcelone. Officialisations, déclarations, rumeurs... Ne manquez rien de l'actualité de vos clubs favoris.","content":null,"pubDate":"2023-01-04 09:30:00","image_url":"https://static.butfootballclub.fr/16/2023/01/photo_article/801969/318340/1200-L-mercato-en-direct-le-fil-du-mercredi-4-janvier.jpg","source_id":"butfootballclub","country":["france"],"category":["sports"],"language":"french"},{"title":"Football : A peine présenté à sa nouvelle équipe, Ronaldo reçoit une mauvaise nouvelle","link":"https://www.afrikmag.com/peine-presente-nouvelle-equipe-ronaldo-recoit-mauvaise-nouvelle/","keywords":["Sport","Uncategorized","Al Nassr","compagne","mauvaise nouvelle","Ronaldo"],"creator":["Jean Marc Ehoué"],"video_url":null,"description":"Après avoir dit oui au club saoudien d’Al Nassr, Cristiano Ronaldo a été présenté ce mardi à la presse en Arabie Saoudite. Dans les coulisses, on apprend qu’il est en délicatesse dans son couple. Et vient de recevoir une mauvaise nouvelle de sa compagne. Cristiano Ronaldo est actuellement au cœur de l’actualité. Tous ses faits … L’article Football : A peine présenté à sa nouvelle équipe, Ronaldo reçoit une mauvaise nouvelle est apparu en premier sur AfrikMag.","content":"Après avoir dit oui au club saoudien d’Al Nassr, Cristiano Ronaldo a été présenté ce mardi à la presse en Arabie Saoudite. Dans les coulisses, on apprend qu’il est en délicatesse dans son couple. Et vient de recevoir une mauvaise nouvelle de sa compagne. Cristiano Ronaldo est actuellement au cœur de l’actualité. Tous ses faits et gestes sont scrutés par les médias. Au niveau de son couple, Georgina et lui traverseraient une grosse crise. Selon nos sources, Cristiano Ronaldo et Georgina Rodriguez traverseraient leur pire crise et leur couple ne tiendrait qu’en raison des nombreuses intérêts… commerciaux qu’ils ont ensemble. De quoi dessiner un nouveau changement de taille dans la vie de CR7 ? Leurs comptes bancaires pourraient également être prochainement séparés. Présent aux côtés de CR7 partout où il se retrouve, Georgina Rodriguez avait tout de même offert une voiture de luxe à son homme en guise de cadeau de Noël… Mais actuellement le torchon brûle entre les deux. Uni à elle depuis 2016, le couple a donné la vie à deux enfants. L’article Football : A peine présenté à sa nouvelle équipe, Ronaldo reçoit une mauvaise nouvelle est apparu en premier sur AfrikMag.","pubDate":"2023-01-04 09:12:40","image_url":null,"source_id":"afrikmag","country":["burkina fasco"],"category":["sports"],"language":"french"},{"title":"Football: Time to revamp entire squad after Lions’ meek AFF C’ship exit, urge coaches","link":"https://www.straitstimes.com/sport/football-time-to-revamp-entire-squad-after-lions-meek-aff-c-ship-exit-urge-coaches","keywords":null,"creator":null,"video_url":null,"description":"January 04, 2023 5:06 PMIn Singapore's 23-man squad, 13 players are aged 30 and above.","content":null,"pubDate":"2023-01-04 09:06:38","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Jurgen Klopp warned over Liverpool's \"lacklustre\" midfield as three players pose problem","link":"https://www.irishmirror.ie/sport/soccer/liverpool-transfers-central-midfielder-klopp-28869729","keywords":["Sport"],"creator":["news@irishmirror.ie (Tom Blow)"],"video_url":null,"description":"Jurgen Klopp's Liverpool are a whopping 16 points behind leaders Arsenal in the Premier League table and in danger of missing out on Champions League football next season","content":"Ex-Liverpool star Jermaine Pennant believes Jurgen Klopp's ageing midfield needs revamping - describing it as \"lacklustre\". The Reds suffered a 3-1 defeat at Brentford on Monday night and face an uphill battle to finish in the top four of the Premier League . Klopp's side are currently sixth in the table - seven points behind Manchester United in fourth and 16 behind leaders Arsenal . Klopp was urged to sign a new midfielder last summer due to his ageing side. Jordan Henderson (32), Thiago Alcantara (31) and Fabinho (29) are past their theoretical peaks, while James Milner, Naby Keita and Alex Oxlade-Chamberlain are out of contract in June. Pennant is particularly concerned about Fabinho, Thiago and Elliott. The ex-winger believes Fabinho is no longer a top player and has questioned whether Thiago offers enough defensive protection. He also thinks Elliott isn't ready to be a starter for Liverpool . \"Fabinho, now, we've seen the best of him - we've used the best of Fabinho,\" Pennant told talkSPORT after Liverpool's loss to Brentford. \"He's just fell off that little cliff. Thiago, he's great on the ball, but he's not going to give you that protection. \"I think Elliott, one for the future [but] right now won't get in many top 10 midfields - never mind Liverpool's to start [his career with]. So, with them three players there, it's lacklustre. We definitely need to strengthen in those areas, for sure.\" Who do you think Liverpool should sign in the January transfer window? Let us know in the comments below! Liverpool have been linked with Borussia Dortmund's Jude Bellingham and Benfica's Enzo Fernandez - as well as Brighton pair Alexis Mac Allister and Moises Caicedo - in recent weeks. All four players would cost a small fortune in January, however. Pennant, who played for Liverpool between 2006 and 2009, is not the only former Reds star to urge Klopp to improve his midfield. Jamie Carragher think his ex-employers need to sign three central midfielders and must splash the cash in the near future. Carragher told Sky Sports: \"They’ve got a lot of players who are either in their 30s or coming into their 30s... Liverpool year in, year out have sort of sold someone, bought someone but I think this is a case of Liverpool needing to spend about £200million. \"Liverpool need to sign three midfield players I would say, not necessarily all to play but Naby Keita and Alex Oxlade-Chamberlain are all out of contract, so is James Milner. The age of Thiago Alcantara, who’s injured quite a lot, Jordan Henderson, Fabinho [etc].\" Carragher added: \"I think Liverpool need three midfield players and when you’re talking about real quality you’re talking at least £40m to £50m, those type of players. \"People keep talking about Jude Bellingham, and rightly so... but if Liverpool don’t get top four that will be a problem. But for me, which I think is as important as a Bellingham-type midfielder, would be a Georginio Wijnaldum-type. \"A type of player, who alongside Fabinho, could just protect that back four and stop players running through towards that defence. We talk about Virgil van Dijk being one of the best centre-backs in the world in the last five years but this season isn’t at his best... if you haven't got protection in front of you, it's very, very difficult.\"","pubDate":"2023-01-04 08:27:39","image_url":"https://i2-prod.mirror.co.uk/incoming/article28869723.ece/ALTERNATES/s98/0_Screenshot-2023-01-04-at-082603.jpg","source_id":"irishmirror","country":["ireland"],"category":["sports"],"language":"english"},{"title":"“My Works In Europe Is Done”- Ronaldo On Saudi Move","link":"https://www.informationng.com/2023/01/my-works-in-europe-is-done-ronaldo-on-saudi-move.html","keywords":["Sports","Uncategorized","ronaldo","saudi arabia","Transfer Market"],"creator":["Alex Adedamola"],"video_url":null,"description":"Cristiano Ronaldo says his work in Europe is done, but he had “many opportunities” from other clubs before joining Saudi Arabian side Al Nassr. He joined Al Nassr as a free agent on Friday after leaving Manchester United, following a controversial interview in which he criticized the club. The Portugal captain, 37, said he had […] The post “My Works In Europe Is Done”- Ronaldo On Saudi Move appeared first on Information Nigeria.","content":"Cristiano Ronaldo says his work in Europe is done, but he had “many opportunities” from other clubs before joining Saudi Arabian side Al Nassr. He joined Al Nassr as a free agent on Friday after leaving Manchester United, following a controversial interview in which he criticized the club. The Portugal captain, 37, said he had offers from clubs in Brazil, Australia, the United States and Portugal. “I gave my word for this club,” he said at his unveiling on Tuesday. “I won everything, I played for the most important clubs in Europe and now it is a new challenge in Asia.” Ronaldo is reportedly set to receive the biggest football salary at more than £177m per year in a deal that runs until 2025. “As nobody knows, I can say now I had many opportunities in Europe, many clubs in Brazil, Australia, the US, even in Portugal, many clubs tried to sign me,” Ronaldo told reporters at his first media conference. The five-time Ballon d’Or winner was greeted with applause and shouts of his trademark ‘Siu’ celebration as he spoke. He answered questions from a club official but took none from reporters. Speaking about his contract with the nine-time Saudi Pro League champions, Ronaldo said: “This contract is unique but I’m a unique player, so for me it’s normal. “I know the league is very competitive, I saw many games. I hope to play after [Wednesday] if the coach thinks there’s a chance. I’m ready to keep playing football.” Al Nassr head coach Rudi Garcia said signing Ronaldo was “fantastic” for Saudi Arabia. “In my life, I’ve seen that great players like Cristiano are the simplest to manage, because there’s nothing I can teach him,” the Frenchman said. “My goal, my objective for Cristiano is to make him happy. I want him to enjoy playing with Al Nassr and winning with Al Nassr.” Following the media conference he posed in his new Al Nassr kit on the club’s pitch in front of thousands of fans. The post “My Works In Europe Is Done”- Ronaldo On Saudi Move appeared first on Information Nigeria.","pubDate":"2023-01-04 08:21:19","image_url":null,"source_id":"informationng","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Football: US Soccer investigating Berhalter over 1991 domestic violence incident","link":"https://www.straitstimes.com/sport/football/football-us-soccer-investigating-berhalter-over-1991-domestic-violence-incident","keywords":null,"creator":null,"video_url":null,"description":"January 04, 2023 3:16 PMLOS ANGELES – US Soccer on Tuesday said that it had launched an investigation into its men’s national team head coach Gregg Berhalter over an incident in 1991 where he kicked his wife in the legs.","content":null,"pubDate":"2023-01-04 07:16:09","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Ireland underage ace Deji Sotona returns to Nice after disappointing loan spell with Kilmarnock","link":"https://www.thesun.ie/sport/football/9995307/deji-sotona-returns-to-nice-after-loan-spell-kilmarnock/","keywords":["Football","Sport","Scottish Premiership"],"creator":["Niall McGrath"],"video_url":null,"description":null,"content":"DEJI SOTONA has returned to Nice after a ­disappointing spell with Kilmarnock. Killie announced the completion of a loan deal at Rugby Park but, when he was signed in August, the club had described it as a one-year stay. Sotona has returned to Nice after a ­disappointing spell with Kilmarnock Deji Sotona has been capped by Ireland at Under-15 and Under-16 level The winger did get his first taste of senior football with two substitute run-outs in the Scottish Premiership but the most recent of those was in September. Born in Waterford, ­Sotona, 20, moved to Westmeath where he played for Mullingar ­Athletic as well as ­showing promise as a sprinter. He signed for Manchester United where he was recorded as the fastest player on the club’s books but left in 2020 after turning down a three-year deal. Patrick Vieira signed him for Nice but his prospects of a breakthrough were hit when the ex-Arsenal star was sacked later in the year. Sotona joined Brentford on loan 12 months ago and featured for their B team but the club did not exercise an option to buy. Capped by Ireland at Under-15 and Under-16 level, Sotona won a recall to the international fold last March when Jim Crawford called him in for an Under-20 game against the Ireland Amateur team. But he was not released for the fixture.","pubDate":"2023-01-04 07:00:00","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Ireland ace John Egan praised by Sheffield United boss Paul Heckingbottom for bouncing back with leveller after mistake","link":"https://www.thesun.ie/sport/football/9995393/john-egan-praised-sheffield-united-boss-paul-heckingbottom/","keywords":["Football","Sport","Championship"],"creator":["Niall McGrath"],"video_url":null,"description":null,"content":"JOHN EGAN has been praised by Sheffield United boss Paul Heckingbottom for bouncing back from a mistake. The Ireland defender netted his second goal in three games when he nabbed an injury-time equaliser away to QPR on Monday night. John Egan of Sheffield United celebrates with Billy Sharp after the late equaliser Sheffield United’s John Egan celebrates scoring in second goal in the three games for the Blades BETTING OFFERS: FREE BETS AND BEST NEW CUSTOMER DEALS It was a case of going from zero to hero as Egan — who was back after serving a one-match ban — had given away the ball for Ilias Chair’s opener. But Heckingbottom came to Egan’s defence for both his willingness to try to play out from the back and his response to his error. Heckingbottom said: “I’ve got to accept mistakes and we’ll make more between now and the end of the season. “I’m not bothered about mistakes — I’m more bothered when people don’t want the ball. Read More On Football LEO LANDS Messi 'back in Paris' as private jet touches down after World Cup celebrations FINAL ROUND Ronaldo ‘will take on Messi one last time as PSG face combined XI in 2023’ “It’s about how we behave when we make mistakes. Run more, be braver — that’s how we have climbed the league. “We didn’t take the ball enough and were not brave enough on the ball in the first half. “He was the one taking it and being brave but made the wrong selection. “We were disappointed with the way we conceded the first goal and it changed the dynamic of the game — but we worked our way back into it. Most read in The Irish Sun RALLY STAR DEAD Top Gear's Ken Block, 55, posted tragic message before snowmobile death ring a ding ding! I'm A Celeb star David Haye sparks dating rumours on hol with Una Healy DECLARATION OF WAR Harry 'attacks Kate in book & won't be able to reconcile with William' CANCEL CULTURE Gerry Ryan was mad & said outrageous things - he’d be cancelled today UNISEX RANGE I'm a fashion fan and Dunnes Stores is my new fave for comfy lounging clothes MAUR HOLS Maura Derrane's fans all say same as she shares jaw-dropping snap in Germany “We were brave and kept wanting the ball and kept pushing, so I don’t want any fear from our players. “We weren’t at our best with the ball and QPR are always good on the counter-attack. “Then in the second half we got more possession, won the ball back and had chances. “We pushed and pushed and I thought we more than deserved it in the end. “We felt it was coming. We were really pushing towards the end.” The Blades remain second in the Championship, five points behind leaders Burnley, but — more importantly — nine clear of Blackburn Rovers in third.","pubDate":"2023-01-04 06:45:00","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Pele funeral – live: Football legend transported to cemetery after funeral in Santos","link":"https://www.independent.co.uk/sport/football/pele-funeral-news-latest-updates-b2255087.html","keywords":["Football","Sport"],"creator":["Alex Pattle"],"video_url":null,"description":"Pelé, whose full name was Edson Arantes do Nascimento, will be buried at the Memorial Necropole Ecumenical, a vertical cemetery in Santos, with only his family present","content":null,"pubDate":"2023-01-04 06:34:37","image_url":"https://static.independent.co.uk/2023/01/03/17/newFile-5.jpg?width=1200&auto=webp","source_id":"independentuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Football. Avant Ronaldo, ces stars aux exils dorés et inattendus","link":"https://www.bienpublic.com/sport/2023/01/04/avant-ronaldo-ces-stars-aux-exils-dores-et-inattendus","keywords":["Sport","Football","Sport national","Fil Info"],"creator":null,"video_url":null,"description":"De Beckham à Cristiano Ronaldo en passant par Oscar ou Ibrahimovic, de nombreuses stars du football ont quitté l'Europe pour tenté un exil doré.","content":null,"pubDate":"2023-01-04 06:32:00","image_url":"https://cdn-s-www.bienpublic.com/images/7AEA440C-D78F-4A04-BC08-A994FE5A5DD4/NW_listB/en-2007-a-seulement-31-ans-david-beckham-cree-la-surprise-en-quittant-le-real-madrid-pour-rejoindre-les-los-angeles-galaxy-contre-un-cheque-de-250-millions-de-dollars-sur-5-ans-photo-sipa-nick-ut-1672763390.jpg","source_id":"bienpublic","country":["france"],"category":["sports"],"language":"french"},{"title":"Offaly legend Niall McNamee is set to retire from inter-county football, according to boss Liam Kearns","link":"https://www.thesun.ie/sport/gaa-football/9994685/offaly-legend-niall-mcnamee-to-retire-inter-county-football/","keywords":["GAA Football","MMA","Sport","GAA","Gaelic Football"],"creator":["Niall McGrath"],"video_url":null,"description":null,"content":"OFFALY legend Niall McNamee is set to retire from inter-county football, according to boss Liam Kearns. The Rhode stalwart, 37, made his SFC debut against Laois at 17. Niall McNamee is set to retire from inter-county football, according to boss Liam Kearns Niall McNamee in action against Wexford last year He retired from intercounty football in 2017, but the hitman returned when John Maughan took the reins ahead of the 2019 campaign. McNamee won his 12th county title with his club this summer and Kearns admits his inter-county days look to be over. He told the Offaly Express: “Niall McNamee is 95 per cent sure not to be returning. “There is still a 5 per cent chance that he will but he is away on honeymoon and will more than likely not be featuring. Read More On Football CHEEKY DIG TG4 brutally troll Cristiano Ronaldo after ex-Man U ace's mega-money Saudi move KERR FREE David Clifford all smiles as he cheers on Munster in URC defeat to Leinster “We have left the door open but it looks like he is gone. “He is 37, he has just got married and he has a new business. “There is a new management here and it is an obvious time to go.”Kearns took the reins from Maughan after they were relegated to Division 3 of the NFL last season — which means Offaly will play Tailteann Cup this summer unless they reach a Leinster final. Most read in The Irish Sun RALLY STAR DEAD Top Gear's Ken Block, 55, posted tragic message before snowmobile death ring a ding ding! I'm A Celeb star David Haye sparks dating rumours on hol with Una Healy DECLARATION OF WAR Harry 'attacks Kate in book & won't be able to reconcile with William' CANCEL CULTURE Gerry Ryan was mad & said outrageous things - he’d be cancelled today UNISEX RANGE I'm a fashion fan and Dunnes Stores is my new fave for comfy lounging clothes MAUR HOLS Maura Derrane's fans all say same as she shares jaw-dropping snap in Germany The former Limerick, Laois and Tipperary boss could also be without former skipper Johnny Moloney for the upcoming campaign due to work commitments. Offaly open their O’Byrne Cup campaign against Wicklow on Saturday but Kearns faces another headache ahead of their clash with Dublin on January 11. The Sigerson Cup begins that week, meaning he will be without a host of regulars for the trip to Parnell Park — and he insists something has to give when it comes to new-year fixture chaos. Kearns said: “The first game against Wicklow will be a useful workout but the game against Dublin is not worth a lot. “There is a full round of the Sigerson Cup that Tuesday, Wednesday and Thursday. “And we will be missing at least ten players. “They should either get rid of pre-season competitions or move the Sigerson before Christmas. “Do one or the other but you can’t do both. It is not fair on players or managements. BETTING OFFERS: FREE BETS AND BEST NEW CUSTOMER DEALS “The pre-season competitions are supposed to be preparation for the National League. “But if you are not allowed to play your full team, you are not preparing.”","pubDate":"2023-01-04 06:30:00","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Football. Lukaku, Pogba, Ibra, Chiesa... des revenants très attendus en Serie A","link":"https://www.bienpublic.com/sport/2023/01/04/lukaku-pogba-ibra-chiesa-des-revenants-tres-attendus-en-serie-a","keywords":["Sport","Football","Sport national","Fil Info"],"creator":null,"video_url":null,"description":"Plusieurs stars de la Serie A sont très attendues lors de la seconde partie de saison après avoir peu ou pas joué jusqu'ici, tels Paul Pogba, Romelu Lukaku, Zlatan Ibrahimovic ou Federico Chiesa.","content":"Lukaku veut oublier le Qatar Le Mondial de Lukaku a été à l'image de sa première partie de saison: à oublier. Arrivé blessé au Qatar, « Big Rom » n'avait ni le rythme ni la confiance pour empêcher les Belges de sombrer au 1er tour. Entré à la pause lors du match décisif contre le Croatie (0-0), l'attaquant de l'Inter Milan s'est principalement illustré par sa maladresse et un coup de poing rageur contre un banc de touche en quittant le terrain, éliminé. « On m'a massacré à juste titre, mais à partir de maintenant, parlons du terrain! », a-t-il affirmé ce week-end à Sky Sport . Le Belge espère que 2023 va lui permettre de retrouver le sourire, lui qui n'a disputé que quatre matches de Serie A cette saison, trois en août avant sa blessure à une cuisse puis un autre fin octobre avant de rechuter. Revanchard, le buteur de 29 ans pourrait être titulaire mercredi pour le choc de reprise contre le leader Naples. Pogba fait patienter les tifosi « La patience, ce n'est pas savoir attendre, mais savoir conserver une bonne attitude pendant l'attente », a philosophé la star des Bleus la semaine dernière dans un message sur Instagram. Toujours contraint aux fastidieux exercices de renforcement musculaire et aux courses en solitaire, à l'écart de ses partenaires, Pogba a répondu ainsi aux tifosi qui lui ont reproché d'être allé à la montagne lors des derniers jours de 2022. Et à ceux qui l'ont accusé d'avoir pris des risques sur la neige, bien qu'on ne voie nullement la « Pioche » skier sur les photos qu'il a mises en ligne, le joueur a répondu dans une autre vidéo où il fait semblant de skier, hilare: « Je suis un pro du ski! » Cette polémique traduit l'immense impatience des supporters bianconeri de voir Pogba, recrue star et premier salaire du vestiaire selon la presse, briller enfin sur le gazon six ans après son départ de la Juve. Mais le champion du monde 2018 a été rattrapé par un physique devenu fragile ces trois dernières saisons à Manchester United . Avec la Juve, il n'a ainsi joué qu'une mi-temps lors d'un match amical de pré-saison fin juillet avant de retourner à l'infirmerie, touché au ménisque latéral du genou droit. Il a d'abord refusé l'opération préconisée par l'équipe médicale du club avant de devoir s'y résoudre début septembre, en raison de douleurs récurrentes. Juste avant Noël, la « Pioche » a pu tâter à nouveau le ballon, mais en solitaire, sans prendre part pour le moment aux séances collectives. Son entraîneur Massimiliano Allegri a assuré la semaine dernière ne pas encore pouvoir dire quand il pourrait compter sur Pogba, alimentant les spéculations dans la presse italienne. Selon la Gazzetta dello Sport , l'objectif principal du club est de compter sur un Pogba en forme pour les barrages de Ligue Europa contre Nantes, les 16 et 23 février. Ce contenu est bloqué car vous n'avez pas accepté les cookies et autres traceurs. En cliquant sur « J’accepte » , les cookies et autres traceurs seront déposés et vous pourrez visualiser les contenus ( plus d'informations ). En cliquant sur « J’accepte tous les cookies » , vous autorisez des dépôts de cookies et autres traceurs pour le stockage de vos données sur nos sites et applications à des fins de personnalisation et de ciblage publicitaire. Vous gardez la possibilité de retirer votre consentement à tout moment en consultant notre politique de protection des données . Gérer mes choix J'accepte J'accepte tous les cookies Voir cette publication sur Instagram Chiesa en quête de rythme L'ascension de Federico Chiesa s'est brutalement arrêtée il y a un an, en janvier 2022, avec une grave blessure au genou gauche. Resté dix mois éloigné des terrains, l'ailier de 25 ans a pu entrer en jeu à trois reprises avec les Bianconeri en novembre, avant la trêve, puis deux fois avec l'équipe d'Italie en amical, contre l'Albanie (3-1) puis l'Autriche (0-2). Mais le feu follet est encore en quête de rythme, attendant une première titularisation et surtout un premier but pour clore cette période sombre. Peut-être mercredi contre la Cremonese? Zlatan pas encore prêt A 41 ans, Zlatan Ibrahimovic n'en a pas fini avec le haut niveau: opéré du genou gauche en mai, juste après le titre de l'AC Milan, le géant suédois met les bouchées doubles pour retrouver les terrains en ce début 2023. Aucune date n'a encore été annoncée et il n'est pas certain que « Ibra » aura repris quand sortira au cinéma, le 1er février, le prochain « Astérix » où il tient le rôle d'un légionnaire romain. Certains médias évoquent sa volonté de retrouver la forme en vue des huitièmes de finale aller de Ligue des champions contre Tottenham, le 14 février à San Siro. Une compétition où il peut battre un record: s'il marque, il deviendrait le buteur le plus âgé de l'histoire de la C1. Maignan dans l'incertitude Mike Maignan a lui aussi été l'un des grands absents de la première moitié de saison en Serie A, absent depuis la mi-septembre et une blessure à un mollet avec l'équipe de France . Après une rechute en novembre, qui a privé l'ex-Lillois du Mondial, l'AC Milan se garde bien d'annoncer une date de reprise: « Son mollet n'est pas encore guéri. Les examens dont nous disposons nous disent qu'on doit avancer avec précaution », indique une source interne au club. Signe de l'incertitude planant encore sur le cas Maignan, Milan pourrait recruter au mercato le portier de l'Atalanta Bergame Marco Sportiello, 30 ans, selon des médias. Sport Football Sport national Fil Info","pubDate":"2023-01-04 06:01:00","image_url":"https://cdn-s-www.bienpublic.com/images/82338AEA-0CB5-4F5F-AEED-E5406CCB5A10/NW_listB/romelu-lukaku-et-zlatan-ibrahimovic-ici-lors-d-un-derby-milanais-en-2020-font-partie-des-retours-attendus-en-2023-photo-sipa-adil-benayache-1672748094.jpg","source_id":"bienpublic","country":["france"],"category":["sports"],"language":"french"},{"title":"Gabriel breaks silence on Newcastle penalty shout as Mikel Arteta makes Arsenal transfer promise - Football.London","link":"https://news.google.com/__i/rss/rd/articles/CBMiaWh0dHBzOi8vd3d3LmZvb3RiYWxsLmxvbmRvbi9hcnNlbmFsLWZjL2ZpeHR1cmVzLXJlc3VsdHMvZ2FicmllbC1icmVha3Mtc2lsZW5jZS1uZXdjYXN0bGUtcGVuYWx0eS0yNTg4OTk3N9IBbWh0dHBzOi8vd3d3LmZvb3RiYWxsLmxvbmRvbi9hcnNlbmFsLWZjL2ZpeHR1cmVzLXJlc3VsdHMvZ2FicmllbC1icmVha3Mtc2lsZW5jZS1uZXdjYXN0bGUtcGVuYWx0eS0yNTg4OTk3Ny5hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Gabriel breaks silence on Newcastle penalty shout as Mikel Arteta makes Arsenal transfer promise  Football.London\"Two SCANDALOUS penalties!\" | Arsenal 0-0 Newcastle | Mikel Arteta  HaytersTVNewcastle player ratings vs Arsenal FC  NothingButNewcastle.comCan Arsenal go on to win the Premier League? | MOTD2  BBC SportArsenal's need for January signings is still clear: Winners, losers and ratings as Newcastle frustrate table-topping Gunners  Goal.comView Full coverage on Google News","content":null,"pubDate":"2023-01-04 06:00:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Kerry coach Pat Bennett knows it will be another year of progress for Kingdom’s hurlers","link":"https://www.thesun.ie/sport/9994539/kerry-coach-pat-bennett-year-progress-kingdoms-hurlers/","keywords":["GAA Hurling","Sport","GAA","Hurling"],"creator":["Niall McGrath"],"video_url":null,"description":null,"content":"PAT BENNETT knows it will be no pain, no gain for Kerry ­hurling again this year. The Kingdom are All-Ireland football champions but are itching for a big breakthrough when it comes to the small ball. Bennett is now part of Stephen Molumphy’s ticket in Kerry Bennett was part of Fitzgerald’s management team in his first coming with Waterford Stephen Molumphy’s men missed out on promotion to Division 1 of the NHL last year when they lost to Westmeath in the Division 2A semi-finals. The Lake County were promoted to the top tier and held their own in the Leinster SHC against the cream of the crop in the province. Kerry were beaten 5-22 to 4-24 in a thrilling Joe McDonagh Cup final against Antrim and coach Bennett feels something special is brewing. They stunned Tipperary in the Munster SHL last year and it was a huge shot in the arm for hurling in a county where football rules the roost. He knows the beatings will come whenever they face the big guns as they host Cork tomorrow night in Tralee, but it is the only way they will get better. Read More On GAA JOB DOON Clare legend David Tubridy retires after 15 years as highest ever league scorer JONN HIS WAY Dublin star Jonny Cooper retires after 11 years and seven All-Ireland titles Bennett said: “Cork coming to town, it is great. “They will come and they know what happened to Tipp last year. “It is not about respect or anything like that, all of a sudden they are saying, ‘We need to go down there and win this.’ “They are going to come with a decent team to beat us and that is what we want. We want to get the hammerings. Most read in The Irish Sun RALLY STAR DEAD Top Gear's Ken Block, 55, posted tragic message before snowmobile death ring a ding ding! I'm A Celeb star David Haye sparks dating rumours on hol with Una Healy DECLARATION OF WAR Harry 'attacks Kate in book & won't be able to reconcile with William' CANCEL CULTURE Gerry Ryan was mad & said outrageous things - he’d be cancelled today UNISEX RANGE I'm a fashion fan and Dunnes Stores is my new fave for comfy lounging clothes MAUR HOLS Maura Derrane's fans all say same as she shares jaw-dropping snap in Germany “The likes of Laois, Westmeath, Antrim, they have all gone up and played in Division 1. “They have got hammerings, won games, drawn games. We have to do that in Kerry. “The only way you will improve is get there. Try to win those games. “If you are playing the Corks and the Waterfords, the Limericks, Clare and Tipp, then you are going to get better. That is the whole idea.”And Bennett is demanding Joe McDonagh Cup glory too. The former Waterford coach knows what it takes to reach the top level as his sons Stephen, Kieran and Shane all hurled for the Déise in 2022. Kieran and Shane have opted out for the upcoming season to go travelling but he knows first-hand what the elite are doing. He insists Kerry can get there and dreams of the day where they will play Munster Championship hurling — which will happen next year if they win the second-tier competition this summer. Reaching the final opened up an All-Ireland preliminary quarter-final against Wexford last season. They were gunned down 0-18 to 3-30 but it gave them a taste of the spotlight they crave. He added: “For us to get into Munster, where we want to be, we have to win a Joe McDonagh. No one will give it to us. “At some stage we have to go and win a Joe McDonagh. “In fairness to the Munster council, when they asked if we won a Joe McDonagh would we come into Munster. “Kerry is in Munster. Why would you want to go and play with Leinster? I didn’t get that. To me it is a no-brainer. “We played Wexford in the Liam MacCarthy last year, the first time in 17 years they played. We lost, but the boys loved it. BETTING OFFERS: FREE BETS AND BEST NEW CUSTOMER DEALS “How are you going to get to that level? By going up and playing them. “You are going to get your trimmings but you have to play them. That is how you are going to do it and build it. “These guys are passionate. They work as hard as any of the other inter-county teams, they train as hard. They do everything. “It is just to get over the line, that is what they have to do.”","pubDate":"2023-01-04 06:00:00","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Football: Lampard under pressure as Everton slump to Brighton defeat","link":"https://www.straitstimes.com/sport/football/football-lampard-under-pressure-as-everton-slump-to-brighton-defeat","keywords":null,"creator":null,"video_url":null,"description":"January 04, 2023 1:57 PMBookmakers are offering odds of 1/5 on him becoming the next Premier League manager to get the sack.","content":"LONDON - The odds on Everton manager Frank Lampard getting the sack tumbled on Tuesday after a dismal 4-1 home defeat by Brighton & Hove Albion left them just above the Premier League relegation zone. Bookmakers William Hill were offering odds of 1/5 on the former England international and ex-Chelsea boss becoming the next Premier League manager to be axed after a dire performance that saw his team booed by the home fans at Goodison Park. “You are not going to win every week. We have to get back to the work. It is as simple as that. I am a Premier League football manager, there is pressure in the job wherever you are,” Lampard told Sky Sports following the defeat. With his team in 16th place on 15 points, three ahead of bottom side Southampton before their clash against Nottingham Forest, Lampard and his players had a long discussion about what went wrong against the Seagulls at full-time, but he remained tight-lipped about what was said. “I won’t go through what was said in the dressing room afterwards, it’s up to us to put it right and we go again against Manchester United (in the FA Cup) in a few days,” the 44-year-old said. The four teams below Everton – West Ham (14 points), Forest (14), Wolverhampton Wanderers (13) and Southampton (12) – all played on Wednesday, with their results not available at press time, so it is possible that the Toffees could find themselves in the relegation zone on Thursday. After holding champions Manchester City to a 1-1 draw in their last game, Everton were booed off by the Goodison Park faithful at half-time when they went in 1-0 down to Brighton, who scored via Kaoru Mitoma, but the worst was yet to come. A woeful spell saw the visitors net three goals from Evan Ferguson, Solly March and Pascal Grob between the 51st and 57th minutes, with Everton’s only response coming from a Demarai Gray penalty in second-half stoppage time. “Very disappointing. It was even in the first half I would say, in general play it was pretty even, (then) three goals in six minutes, defensive mistakes, finishes the game,” Lampard said. The former England midfielder did not rule out adding players to his squad in the January transfer window as he tried to hold on to his job. “We are trying to help the squad. We will look at that,” he said. REUTERS","pubDate":"2023-01-04 05:57:56","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Qatar 2022: Real reason Argentina won World Cup – Man United boss, Erik ten Hag","link":"https://dailypost.ng/2023/01/04/qatar-2022-real-reason-argentina-won-world-cup-man-united-boss-erik-ten-hag/","keywords":["Sport","Argentina","Erik ten Hag","Man United","Qatar 2022","World Cup"],"creator":["John Owen Nwachukwu"],"video_url":null,"description":"Manchester United boss, Erik ten Hag has explained why Argentina was able to win the 2022 World Cup in Qatar last month. Lionel Scaloni’s side conquered the World in Qatar despite losing their first game of the tournament to Saudi Arabia. Lionel Messi and his teammates went all the way and defeated France 4-2 in […] Qatar 2022: Real reason Argentina won World Cup – Man United boss, Erik ten Hag","content":"Manchester United boss, Erik ten Hag has explained why Argentina was able to win the 2022 World Cup in Qatar last month. Lionel Scaloni’s side conquered the World in Qatar despite losing their first game of the tournament to Saudi Arabia. Lionel Messi and his teammates went all the way and defeated France 4-2 in a penalty shootout in the final. Ten Hag hailed Argentina, adding that they were able to achieve great success because they acted as a team and played proactive football and had a winning attitude. Ten said this while speaking on why he gave Lisandro Martinez more time to rest after the showpiece. The defender was named on the bench for their Premier League clash against Bournemouth on Tuesday after returning from the World Cup with a winners’ medal. “It’s a reward and I think he deserves it. I think it was a great performance from the Argentines at the World Cup and it showed when you act as a team, when you play proactive football and you have a winning attitude. “And he was part of that, he played a massive role, we value that and now he’s got the reward and I really enjoy that,” he said. Qatar 2022: Real reason Argentina won World Cup – Man United boss, Erik ten Hag","pubDate":"2023-01-04 05:56:04","image_url":null,"source_id":"dailypost","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"EPL: It’s something he’ll look at – Ian Wright reacts to Mikel Arteta’s attitude","link":"https://dailypost.ng/2023/01/04/epl-its-something-hell-look-at-ian-wright-reacts-to-mikel-artetas-attitude/","keywords":["Sport","EPL","Ian Wright","Mikel Arteta"],"creator":["John Owen Nwachukwu"],"video_url":null,"description":"Arsenal legend, Ian Wright has said that manager Mikel Arteta needs to look at his behaviour during matches. The Arsenal legend said he does not really want to condemn Arteta because the Spaniard is his manager. Arteta’s touchline antics have generated a lot of talk from pundits and football fans. Newcastle legend, Alan Shearer slammed […] EPL: It’s something he’ll look at – Ian Wright reacts to Mikel Arteta’s attitude","content":"Arsenal legend, Ian Wright has said that manager Mikel Arteta needs to look at his behaviour during matches. The Arsenal legend said he does not really want to condemn Arteta because the Spaniard is his manager. Arteta’s touchline antics have generated a lot of talk from pundits and football fans. Newcastle legend, Alan Shearer slammed the former midfielder last night after the Arsenal boss lost his cool during their goalless draw in the Premier League. Arteta could be seen sprinting out of his technical area and confronting the fourth official as Newcastle frustrated his side. But Wright feels Arteta’s antics are no different to how several current and former Premier League managers behave. “He’s so plugged into the game, that’s the way he is,” Wright said of Arteta on Premier League Productions. “You see some managers like that, like Jose Mourinho, Antonio Conte, Pep Guardiola. “People are talking about it a lot now so I’m sure it’s something he will look at. But he’s my manager so I’m not going to find too much fault in it!” EPL: It’s something he’ll look at – Ian Wright reacts to Mikel Arteta’s attitude","pubDate":"2023-01-04 05:53:08","image_url":null,"source_id":"dailypost","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Micah Parsons Blasts Bart Scott for Take on Damar Hamlin’s Injury","link":"https://www.si.com/nfl/2023/01/04/micah-parsons-blasts-bart-scott-blaming-tee-higgins-damar-hamlin-injury","keywords":["Breaking","Wire","NFL"],"creator":["Wilton Jackson"],"video_url":null,"description":"The Cowboys star linebacker was not happy with the former NFL player’s comments involving the injured Bills safety.","content":"The Cowboys star linebacker was not happy with the former NFL player’s comments involving the injured Bills safety.In seeking to provide insight to the frightening situation involving Bills safety Damar Hamlin following his collapse in Monday’s game against the Bengals, ESPN analyst and former linebacker Bart Scott made a statement that drew the ire of a fellow linebacker in Cowboys star Micah Parsons.Scott told Stephen A. Smith on ESPN’s First Take that Bengals wide receiver Tee Higgins lowered his helmet into Hamlin while trying to drive through the Bills safety, seeming to assign some blame to Higgins for Hamlin’s subsequent cardiac arrest moments later.“Right before the tackle, [Higgins] lowers his helmet and he kinda throws his body into [Hamlin's] chest,” the former NFL linebacker told Smith. “He’s standing up because he’s thinking he’s gotta chase Tee Higgins at an angle to make a tackle, so he didn’t expect Tee Higgins to launch his body back into him. It’s one of those things you see as a linebacker.”Later Tuesday evening, Parsons made it clear he was not happy with Scott’s comments.“Yoo are we serious?!!?why do we let some people speak on tv?! This was a freak incident but putting fault on another player is wild! They should make some of these guys go over lines or something or not even give them a seat at the table!” Parsons tweeted.Scott also discussed how when players, such as running backs, lower their heads when expecting contact, it leaves defenders exposed in their chest area. “They’ve [the NFL] taken that out of the game, but they don’t regulate it as much as possible,” Scott said. “I expect the league will be a lot more vigilant when it comes to that and using that penalty.”Scott spent 11 seasons in the NFL, playing for the Ravens and the Jets, making the Pro Bowl for Baltimore in 2006.Hamlin remains sedated and in critical condition at the University of Cincinnati Medical Center. He spent Monday night in the intensive care unit after he went into cardiac arrest during the first quarter of Monday Night Football.Earlier Tuesday evening, Hamlin's uncle Dorrian Glenn told WIVB-TV in Buffalo that Hamlin is now on 50% oxygen after originally being on 100%.","pubDate":"2023-01-04 05:34:29","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTk0NDQxMTU0MzcxMDAzOTA5/micah-parsons.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"}]}