{"newsArray":[{"article_id":"e7adadeec2abf8de1ffe9a4da369d43b","title":"Aberystwyth League: six-shooting Bont move up to second","link":"https://www.cambrian-news.co.uk/sport/football/aberystwyth-league-six-shooting-bont-move-up-to-second-647402","keywords":["Football","Sport"],"creator":["Dylan Halliday"],"video_url":null,"description":"Bont moved up to second in the Cambrian Tyres Aberystwyth League with a comprehensive 6-1 victory against visitors Tregaron Turfs Reserves.","content":"Bont moved up to second in the with a comprehensive 6-1 victory against visitors Tregaron Turfs Reserves. The home side scored early and late through William Evans and Garin Evans in a first half that they bossed with William Evans bagging his brace on 52 minutes quickly followed by a Jordan Perry strike to put them four goals clear. Ioan Llwyd pulled one back for the Turfs which fired the home side to go in search of more goals which they got through Cian Thomas and Richard Jones. Leaders Corris made it four wins out of four courtesy of a stoppage time winner by Dean Kohler. Ceredigion League: double comeback seals deserved point for Felinfach Felinfach Ladies in narrow cup defeat at Berriew Captain’s notebook with Amy J: 'We move onto another tough test' FAW Amateur Trophy round-up: wins for Bow Street, Penrhyncoch, Tywyn and Pwllheli The Quarrymen led 2-1 at the break thanks to goals by Dafydd Jones and Joe Green with Tristan Jenkins replying for visitors Borth United. James Fox thought he had earned a share of the spoils when he converted an 82nd minute penalty but Kohler had the last laugh. Tywyn Bryncrug Reserves managed to get over the line to secure their second victory of the campaign after a close encounter against visitors Padarn United. The hosts led 2-0 at the break thanks to Jamie Pymm and an Ian Alexander Lee own goal. Dominik Patlewicz closed the gap on 51 minutes before Ben Williams restored Tywyn’s two-goal cushion with 10 minutes to go. Lee scored at the right end moments later but Tywyn held on to the points.","pubDate":"2023-11-01 13:30:59","image_url":"https://www.cambrian-news.co.uk/tindle-static/image/2023/02/27/13/corner-ball-ga81f0efb0_1920.jpg?width=1200&auto=webp","source_id":"cambrian_news","source_priority":2345860,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"be939c1183f296203307b7a5a634a792","title":"Football : on connaît les affiches du 7e tour de la Coupe de France pour les clubs d'Occitanie","link":"https://www.midilibre.fr/2023/11/01/football-les-affiches-de-coupe-de-france-pour-les-clubs-doccitanie-11554808.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Les tirages au sort des deux premiers tours fédéraux de la Coupe de France féminine ainsi que du septième tour de la la Coupe de France masculine se sont tenus ce mercredi 1er novembre à Clairefontaine. Découvrez les...","content":"Les tirages au sort des deux premiers tours fédéraux de la Coupe de France féminine ainsi que du septième tour de la la Coupe de France masculine se sont tenus ce mercredi 1er novembre à Clairefontaine. Découvrez les affiches pour nos clubs d'Occitanie. Les matches du premier tour fédéral se joueront les samedis 18 et dimanche 19 novembre. Les matches du septième tour se joueront les samedis 18 et dimanche 19 novembre.","pubDate":"2023-11-01 12:43:44","image_url":"https://images.midilibre.fr/api/v1/images/view/65421d0f0d60545a403b4c69/standard/image.jpg?v=1","source_id":"midilibre","source_priority":388149,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"f1b01ac34d00ba4594067edf4584f112","title":"Sir Bobby Charlton died after fall, inquest hears","link":"https://www.bbc.co.uk/news/uk-england-manchester-67285478","keywords":null,"creator":null,"video_url":null,"description":"The England and Manchester United legend was living at a care home for patients with dementia.","content":"Sir Bobby Charlton died after fall, inquest hears Published 38 minutes ago Share close panel Share page Copy link About sharing Image source, Reuters Image caption, Sir Bobby is hailed as one of England's greatest footballers Sir Bobby Charlton died after an accidental fall at a care home, an inquest has heard. The England and Manchester United legend died aged 86 in Macclesfield General Hospital on 21 October. The inquest at Cheshire Coroner's Court heard Sir Bobby was living in The Willows in Knutsford, a nursing home caring for patients with dementia. Senior coroner for Cheshire Jacqueline Devonish concluded his death was accidental. The hearing was told Sir Bobby had lost his balance as he stood up from his chair, striking a window sill and \"possibly a radiator\". Staff performed a full-body check at the time and noted no visible injuries, and recorded his mobility seemed unaffected. But they later noticed swelling on his back and paramedics were called to the centre, where he had been receiving respite care since July. Image source, PA Media Image caption, Tributes to Sir Bobby were left ahead of the Premier League match at Old Trafford on Sunday He was then taken to a local hospital before being moved to Macclesfield General Hospital. A chest X-ray and CT scan revealed he had fractured his ribs and was likely to develop pneumonia, the inquest heard. Doctors then agreed Sir Bobby should be put on end-of-life care, dying five days later. The inquest heard he had an extensive medical history and had also contracted Covid in September. Care home manager Tamara Simmons, said Sir Bobby \"needed support with all aspects of daily living\". The coroner gave the cause of death as trauma in the lungs, a fall and dementia. Image source, PA Media Image caption, Sir Bobby was instrumental in English football's greatest achievements Widely hailed as one of England's greatest ever players, Sir Bobby was a key figure in the Three Lions' 1966 World Cup victory. During a 17-year first-team career with United he won three league titles, a European Cup and an FA Cup. Thousands of fans have left tributes at Old Trafford, with the area in front of the famous Trinity statue - where he is immortalised alongside team-mates George Best and Denis Law - flooded with memorabilia and flowers. Plans for a full memorial service later this month have also been unveiled. Why not follow BBC North West on Facebook , X and Instagram ? You can also send story ideas to northwest.newsonline@bbc.co.uk Related Topics Macclesfield Manchester More on this story Sir Bobby Charlton memorial service announced Published 19 hours ago I owe Sir Bobby Charlton everything - Beckham Published 1 day ago Charlton 'a tower of strength', says Ferguson Published 2 days ago England and Man Utd legend Charlton dies aged 86 Published 21 October Related Internet Links HM Courts & Tribunals Service The BBC is not responsible for the content of external sites.","pubDate":"2023-11-01 12:28:12","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"d5b82b63aa2cc4460a57a76eb9f9a4b4","title":"Liverpool icon Djibril Cisse's son plays for Notts County and has represented Wales","link":"https://www.dailystar.co.uk/sport/football/liverpool-cisse-son-notts-wales-31332357","keywords":["Sport"],"creator":null,"video_url":null,"description":"A new football dynasty appears to be in the making after one member of Liverpool's 2005 Champions League-winning squad saw his son climb the ranks at League Two outfit Notts County","content":"Athletic genes can often run in the family, and it appears that may ring true for a certain member of one of 's most iconic squads. The tyke in question is already well on his way to stardom after representing in the FA Youth Cup this week - albeit in a 3-0 defeat to . That's after representing his mother's nation, Wales, in his younger days and spending time developing in 's respected academy. And the teenage talent is none other than Cassius Cisse, oldest son of 2005 -winner and one-time champion Djibril. Almost 20 years after his dad first made the move to Merseyside in what became the most successful chapter of his career, 17-year-old Cassius is at the genesis of his own journey through the sport that made his father a great. Cassius' mother - Jude Littler, who has kept Cisse's surname since their 2014 divorce - celebrated her son signing his first contract with Notts County in early July. And he's well on his way with the fourth-tier team after starting in Tuesday's FA Youth Cup defeat to the Imps. Cisse played the first 58 minutes from right-wing-back and enjoyed some bright moments prior to the home team's collapse. County enjoyed a positive first half in the cup clash but fell away in the second period as Lincoln ran away with the result. The game also featured a pre-match tribute to Nottingham Panthers player Adam Johnson, who . Former France international Djibril scored nine times in 41 appearances for Les Bleus and was part of the squad that won the 2003 Confederations Cup. The FA Cup-winner also featured in the disappointing 2002 team and would have featured in the 2006 competition had he not broken his leg just before the tournament was due to get underway. £39.99 (PS5), £40.49 (PC) Cisse Jr was only 12 when he first pulled on the colours of Wales' regional team, opting to represent his mother's country over France or England, where he was born. The prospect would also qualify to play for the Ivory Coast, whom his late paternal grandfather, Mangue, once captained. It's uncertain as to whether Cisse has kept on track with Wales' youth teams, though younger brother Prince Kobe is very much still part of the Red Dragons set-up. The 15-year-old is also a member of Liverpool's academy and may stand a chance of lining up as part of the Reds' attack in future, just like his dad. The siblings seem destined for stardom in future, whether that be as footballers or in some other field. Cassius, Prince and youngest brother Marley, 13, all previously appeared with their mum on an episode of 'Rich Holiday, Poor Holiday' in 2020. The good-looking trio have also performed modelling work in the past and appeared in ads for the likes of Tommy Hilfiger, Under Armour and JD. At the very least, if The Beautiful Game doesn't work out, they'll be able to fall back on their looks.","pubDate":"2023-11-01 12:24:24","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31332687.ece/ALTERNATES/s98/6_Screenshot-2023-11-01-at-110043-copy.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6803552090c93f440842e091304f3f6e","title":"Sir Bobby Charlton's cause of death confirmed after Man Utd legend's tragic accident","link":"https://www.dailystar.co.uk/sport/football/breaking-sir-bobby-charlton-death-31333865","keywords":["Sport"],"creator":null,"video_url":null,"description":"Manchester United and England legend Sir Bobby Charlton passed away aged 86 last week following an accidental fall at a care home - an inquest heard","content":"legend Sir Bobby Charlton died after an accidental fall at a care home, an inquest was told. Charlton left the football world in mourning after he passed away aged 86 on October 21. The United and legend was pronounced dead at Macclesfield General Hospital following the accidental fall. Sir Bobby had been battling dementia at The Willows care home in Knutsford. An inquest into his death heard how he lost his balance as he stood up from a chair and hit a windowsill - he also \"possibly\" hit a radiator during the fall. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month The court was told how staff didn't notice any visible injuries after a full body check, but after noticing swelling on his back he was taken to hospital. It was at Macclesfield General Hospital he was put on end-of-life care due to his likelihood of developing pneumonia. The full cause of death was given as trauma in the lungs, a fall and dementia. Senior coroner for Cheshire Jacqueline Devonish ruled his death was accidental. United said in a statement: \"Manchester United is in mourning following the passing of Sir Bobby Charlton, one of the greatest and most beloved players in the history of our club. \"Sir Bobby was a hero to millions, not just in Manchester, or the United Kingdom, but wherever football is played around the world... The club’s heartfelt sympathies are with his wife Lady Norma, his daughters and grandchildren, and all who loved him.\" While his family added: \"It is with great sadness that we share the news that Sir Bobby passed peacefully in the early hours of Saturday morning. \"He was surrounded by his family. His family would like to pass on their thanks to everyone who has contributed to his care and for the many people who have loved and supported him. \"We would request that the family’s privacy be respected at this time.”","pubDate":"2023-11-01 12:17:15","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31333951.ece/ALTERNATES/s98/0_Star-Breaking-News-1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bbad1ba6f16244883c3b07d3d0a40344","title":"Andriy Shevchenko lifts the lid on ill-fated Chelsea spell and says 'I did my best'","link":"https://www.dailystar.co.uk/sport/football/shevchenko-admits-failed-chelsea-spell-31332603","keywords":["Sport"],"creator":null,"video_url":null,"description":"The former striker ranks among the greatest ever in his position but his three-year stint at Chelsea was nothing short of hellish thanks to injury issues","content":"Andriy Shevchenko opened up about the injuries he suffered through during his blighted career at . The Ukrainian legend was one of the most feared strikers in the world during his career, as the 2004 Ballon d'Or winner enjoyed seven years at AC Milan. After scoring 173 goals in 296 games for the Italian giants, Chelsea came calling and signed the striker in a £30.8million deal. Despite the high hopes that the former winner would spearhead Jose Mourinho's side to a third consecutive title, it never worked out for Shevchenko, who was blighted by injuries during his time in West London. Shevchenko scored just 22 goals across two years at Stamford Bridge before he was loaned out to AC Milan in the third year of his contract. In his new book, My Life, My Football, the ex-Ukrainian national team captain opened up about how his injuries led to his demise at Chelsea and the rest of his career at the top level. Following the 2006 , Shevchenko was nursing a knee injury suffered in a quarter-final defeat to Italy which he arrived with for Chelsea's pre-season. \"I did my best and gave my all: that was just my way,\" he said. \"Still, I knew my motor wasn’t running as it ought to. The newspapers criticised me heavily but only I knew the real problem: that accursed fatigue that had never lifted.\" Despite winning the domestic cup double in his debut season, Shevchenko discovered a hernia which caused him to miss the FA Cup final against as he admitted that the failed surgery caused him to lose his strength. \"During the operation, something didn’t go to plan. I didn’t get back to what I was before. I lost all my strength. I was in a rich vein of form — the worst possible moment to suffer an injury.\" He played just 25 games in all competitions in his last season at Chelsea where he was riding the bench in yet another final as he could only watch Chelsea lose to Manchester United in the Champions League final in 2008. The constant injuries had such a physical toll on him that he said: \"I was barely a shadow of the player I used to be.\" A return to AC Milan in 2008 saw Shevchenko score just two goals in 26 games, before he ended his career at boyhood club Dynamo Kyiv in 2012.","pubDate":"2023-11-01 12:09:50","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31332780.ece/ALTERNATES/s98/2_Newcastle-United-v-Chelsesa-at-St-Jamess-Park-220407.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1fe6b4d91a54098637105b17281f2510","title":"From an NBA superstar dressed as Slenderman to footballing Batman - can you recognise these sports stars in their Halloween costumes?","link":"https://www.dailymail.co.uk/sport/othersports/article-12696969/From-NBA-superstar-dressed-Slenderman-footballing-Batman-recognise-sports-stars-Halloween-costumes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"With their multi-million pound contracts and huge following on social media, sports stars rarely hold back when it comes to Halloween, and it appears this year has been no different.","content":"Can you recognise these sports stars in their Halloween costumes? Man United's Dark Knight, a Euros-winning pirate, the Super Mario LIV golfer... and which Lionesses legend has transformed into terrifying Pennywise? Sports stars showed off their impeccable Halloween costumes on social media Perhaps the best costume came from a 7ft 4in NBA player who was Slenderman Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Milo Pope For Mailonline Published: 11:39, 1 November 2023 | Updated: 11:59, 1 November 2023 e-mail View comments With their multi-million pound contracts and huge following on social media, sports stars rarely hold back when it comes to Halloween . And it appears this year has been no different as golfers, footballers and basketballers alike donned their festive attire. Choosing characters from films and video games to downright terrifying Halloween legends, there was a good variety on display. While some of these stars are easier to guess than others, it appears NBA and NFL players have concealed their identity the best. Here's a look at this year's best Halloween outfits from your favourite sporting stars. San Antonio Spurs superstar Victor Wembanyama arrives as Slenderman in Phoenix, Arizona Paul George of the Los Angeles Clippers went far less scary as he dressed as Where's Wally Happy Halloween! Click here for more- https://t.co/VMs5u0JvuX pic.twitter.com/PFChEWf3LC — Paige Spiranac (@PaigeSpiranac) October 31, 2023 First up is the NBA's newest superstar, Victor Wembanyama, who was pictured arriving at the Footprint Center in Arizona to face the Phoenix Suns. The San Antonio Spurs Frenchman came in a Slenderman costume and, standing at seven feet four inches, he definitely nailed the look. Also from the NBA world, Paul George of the Los Angeles Clippers opted for a slightly less scary look as he donned a Where's Wally costume. On to social media golfing sensation Paige Spiranac, the OnlyFans star has done her best impression of Pamela Anderson on Baywatch. The influencer, who has one of the biggest social media followings in the sport, has regularly hit back at commenters who criticise her choice of attire when she plays golf. Former England international and BBC pundit Alex Scott was completely unrecognisable in her costume as she wowed fans with a terrifying clown suit. Scott posted several photos on her Instagram of herself in appropriate surroundings, holding nothing but a set of balloons reminiscent of the iconic Pennywise from Stephen King's IT. Former Spain and Barcelona striker David Villa and his wife Patricia Gonzalez arguably went one better when it came to faithful recreations of a character. While Scott went for a more colourful approach, Villa and Gonzalez even went as far as including the famous clown's monstrous facial features. Alex Scott was completely unrecognisable in her costume as she wowed fans with a terrifying clown suit Villa and Gonzalez even went as far as including the famous clown's monstrous facial features Terry Rozier of the Charlotte Hornets arrives at the arena ahead of their game against Brooklyn Jose Alvarado, the No 15 for the New Orleans Pelicans smashed this Saw outfit last night Keeping with the spooky theme, NBA stars Terry Rozier and Jose Alvarado did their part to terrify the fans. Rozier, who plays for the Charlotte Hornets, donned a Jason Friday the 13th hockey mask as he arrived at the Spectrum Arena to face the Brooklyn Nets. Alvarado, who plays for the New Orleans Pelicans, went in a famous costume from the film series Saw ahead of their game against the Golden State Warriors. Perhaps the strangest of all masks came from Cincinnati Bengals quarterback Joe Burrow who wore an ultra-realistic alien mask as he hopped on the team plane to take on the San Francisco 49ers. Moving away from scary clowns now, LIV Golf's Brooks Koepka posed for some adorable photos alongside his wife Jena Sims and their child. The PGA Championship and US Open winner was dressed as Mario with his child as Luigi, while Jena went as Princess Peach. Even the dog got in on the act, too! Manchester United stars Casemiro and Alejandro Garnacho unburdened themselves of last weekend's humiliating derby day defeat to Manchester City by wearing the outfits of iconic superheroes alongside their respective families. Joey Burrow, from the Cincinnati Bengals, went ultra weird with this incredibly life-like mask Five-time major winner Brooks Koepka is enjoying his downtime as his family dressed up Man United midfielder Casemiro dressed up as Batman while his wife opted for a red devil The veteran Brazilian midfielder, who has been sidelined through with injury, took the chance to live out the dream of many a child and appeared as Batman. His wife, Anna Mariana, appropriately opted for a red devil. United youngster Garnacho and partner Eva Garcia meanwhile, celebrated their first Halloween following the birth of their son by going as The Incredibles. Meanwhile, PSG stopper Gianluigi Donnarumma and girlfriend Alessia Elefante fancied themselves as crew mates on the Black Pearl. The pair took to social media to show off their costumes inspired by the Pirates of the Caribbean movies though neither the 24-year-old nor his interior designer partner bore any striking resembles to the film's main cast. And to round things off, Champions League winner and Real Madrid winger Lucas Vasquez posted an adorable picture alongside his family. The Spaniard's family dressed up as Teenage Mutant Ninja Turtles. Alejandro Garnacho and his family wore costumes from Pixar's hit move The Incredibles PSG's Gianluigi Donnarumma and his girlfriend Alessia Elefante fancied themselves as pirates Real Madrid's Lucas Vasquez and his family dressed up as Teenage Mutant Ninja Turtles NBA Halloween Casemiro Share or comment on this article: From an NBA superstar dressed as Slenderman to footballing Batman - can you recognise these sports stars in their Halloween costumes? e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-01 11:59:13","image_url":"https://i.dailymail.co.uk/1s/2023/11/01/11/77264277-0-image-a-51_1698836935572.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e30fc68fdf85609f0135c43c0c9e149e","title":"Vale Football round-up: Cardiff Airport cup success goes on","link":"https://www.penarthtimes.co.uk/sport/23894286.vale-football-round-up-cardiff-airport-cup-success-goes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Cardiff Airport continued their run in the cups with a penalty shootout win and Ely Rangers came away with a great result in the FAW Trophy","content":"THERE was drama and victory against the odds in the lower Vale football leagues round three of the FAW Trophy. Cardiff Airport, who are having a successful run in the Welsh Cup, matched that with a run in the FAW after penalty shootout glory. And Ely Rangers came away with a fantastic victory over Cardiff Draconians. Last weekend was FAW Trophy Round 3. The FAW Trophy is for all clubs at FAW Tier 3 and below. Wenvoe’s Ely Rangers had the toughest task on paper with a visit to Gabalfa to play Ardal SW Cardiff Draconians where they left with a 3-2 victory, Alex Long (two) and Richard Greaves the scorers. Cardiff Airport’s FAW cup runs continue with a win over Caerphilly Athletic. The score was 3-3 at full time but Airport’s penalty takers put them through to Round 4 winning the shoot-out 3-1. Scorers were Lee Stradling (two) and a Theo Richards penalty. Clwb Cymric, having lost to Vale United in Corntown to a stoppage-time winner a couple of months ago, came out victors this time 4-1. Dan Hanson was Vale’s scorer. Cogan Coronation had a difficult task against Llanelli’s CK Swiss Valley and lost 3-0. , Dinas Powys woes continue with a 9 nil defeat at home to Porthcawl Town Athletic. , Holton Road went down one-nil away against Cwm Welfare 1 - 0.","pubDate":"2023-11-01 11:56:49","image_url":"https://www.penarthtimes.co.uk/resources/images/17394294/?type=app&htype=0","source_id":"penarthtimes","source_priority":5129264,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"29d56a6b5510373bb39867d887ef25fc","title":"Vale Football round-up: Cardiff Airport cup success goes on","link":"https://www.barryanddistrictnews.co.uk/sport/23894286.vale-football-round-up-cardiff-airport-cup-success-goes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Cardiff Airport continued their run in the cups with a penalty shootout win and Ely Rangers came away with a great result in the FAW Trophy","content":"Cardiff Airport, who are having a successful run in the Welsh Cup, matched that with a run in the FAW after penalty shootout glory. And Ely Rangers came away with a fantastic victory over Cardiff Draconians. Last weekend was FAW Trophy Round 3. The FAW Trophy is for all clubs at FAW Tier 3 and below. Wenvoe’s Ely Rangers had the toughest task on paper with a visit to Gabalfa to play Ardal SW Cardiff Draconians where they left with a 3-2 victory, Alex Long (two) and Richard Greaves the scorers. Cardiff Airport’s FAW cup runs continue with a win over Caerphilly Athletic. The score was 3-3 at full time but Airport’s penalty takers put them through to Round 4 winning the shoot-out 3-1. Scorers were Lee Stradling (two) and a Theo Richards penalty. Clwb Cymric, having lost to Vale United in Corntown to a stoppage-time winner a couple of months ago, came out victors this time 4-1. Dan Hanson was Vale’s scorer. Cogan Coronation had a difficult task against Llanelli’s CK Swiss Valley and lost 3-0. , Dinas Powys woes continue with a 9 nil defeat at home to Porthcawl Town Athletic. , Holton Road went down one-nil away against Cwm Welfare 1 - 0.","pubDate":"2023-11-01 11:56:49","image_url":"https://www.barryanddistrictnews.co.uk/resources/images/17394294/?type=app&htype=0","source_id":"barryanddistrictnews","source_priority":1766302,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"968f3cb9fdb19be4c3077c82f75a0d0b","title":"Wrexham-loving model risks Instagram ban covering stunning assets in police tape","link":"https://www.dailystar.co.uk/sport/football/wrexham-alaw-haf-instagram-picture-31333184","keywords":["Sport"],"creator":null,"video_url":null,"description":"Wrexham-loving Instagram model Alaw Haf has wowed fans on as she covered left little to the imagination by covering sizeable assets in caution tape to the delight of her followers","content":"-loving Instagram model Alaw Haf has risked a ban on the social media platform with her latest snap. The stunning brunette shared a nearly-nude picture on Instagram, with only police caution tape used to protect her modesty. The tape was used to fashion some underwear, and Alaw teased fans with some underboob as she captioned the post: \"Caution.\" \"So glad you came with a warning,\" one fan joked. While a cheeky second fan shared: \"Think I’d take my chances,\" and another added: \"Caution indeed in those heels. Absolutely stunning!\" Welcome to Wrexham is back to take you behind the scenes at the Welsh club following the superstar takeover by Ryan Reynolds and Rob McElhenney. New and returning customers in the UK can now subscribe to Disney+ for £1.99/month for three months. £1.99 per month for 3 months Alaw is a huge Wrexham fan, and she drew the fury of Notts County fans over the weekend after she 'cheersed' the side after their loss to the Red Dragons. Last season's two National League sides went toe-to-toe at Meadow Lane on Saturday afternoon as they continue to set the pace at the top of the fourth-tier. But it was Phil Parkinson's side who came out on top thanks to two goals three minutes apart from Elliot Lee and Ollie Palmer. Alaw has also opened her own OnlyFans page to run alongside her Instagram - and both have gained a lot of traction in Wrexham. Speaking to over the summer she admitted: \"Even if it’s not on I have seen that Wrexham is now one of my top locations for followers on my Instagram. I enjoy creating the Wrexham content so I appreciate that other people do too.\" And she added there has been more interest in her page following the hit documentary Welcome to Wrexham: \"I speak to some of the American fans, mainly about the game or Wrexham related stuff. \"Some ask for tips about when they’re coming over. I’ve had messages from everywhere that people are watching Wrexham even in Australia!\"","pubDate":"2023-11-01 11:54:37","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31308550.ece/ALTERNATES/s98/1_ALAW-HAF.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e7adadeec2abf8de1ffe9a4da369d43b","title":"Aberystwyth League: six-shooting Bont move up to second","link":"https://www.cambrian-news.co.uk/sport/football/aberystwyth-league-six-shooting-bont-move-up-to-second-647402","keywords":["Football","Sport"],"creator":["Dylan Halliday"],"video_url":null,"description":"Bont moved up to second in the Cambrian Tyres Aberystwyth League with a comprehensive 6-1 victory against visitors Tregaron Turfs Reserves.","content":"Bont moved up to second in the with a comprehensive 6-1 victory against visitors Tregaron Turfs Reserves. The home side scored early and late through William Evans and Garin Evans in a first half that they bossed with William Evans bagging his brace on 52 minutes quickly followed by a Jordan Perry strike to put them four goals clear. Ioan Llwyd pulled one back for the Turfs which fired the home side to go in search of more goals which they got through Cian Thomas and Richard Jones. Leaders Corris made it four wins out of four courtesy of a stoppage time winner by Dean Kohler. Ceredigion League: double comeback seals deserved point for Felinfach Felinfach Ladies in narrow cup defeat at Berriew Captain’s notebook with Amy J: 'We move onto another tough test' FAW Amateur Trophy round-up: wins for Bow Street, Penrhyncoch, Tywyn and Pwllheli The Quarrymen led 2-1 at the break thanks to goals by Dafydd Jones and Joe Green with Tristan Jenkins replying for visitors Borth United. James Fox thought he had earned a share of the spoils when he converted an 82nd minute penalty but Kohler had the last laugh. Tywyn Bryncrug Reserves managed to get over the line to secure their second victory of the campaign after a close encounter against visitors Padarn United. The hosts led 2-0 at the break thanks to Jamie Pymm and an Ian Alexander Lee own goal. Dominik Patlewicz closed the gap on 51 minutes before Ben Williams restored Tywyn’s two-goal cushion with 10 minutes to go. Lee scored at the right end moments later but Tywyn held on to the points.","pubDate":"2023-11-01 13:30:59","image_url":"https://www.cambrian-news.co.uk/tindle-static/image/2023/02/27/13/corner-ball-ga81f0efb0_1920.jpg?width=1200&auto=webp","source_id":"cambrian_news","source_priority":2345860,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"be939c1183f296203307b7a5a634a792","title":"Football : on connaît les affiches du 7e tour de la Coupe de France pour les clubs d'Occitanie","link":"https://www.midilibre.fr/2023/11/01/football-les-affiches-de-coupe-de-france-pour-les-clubs-doccitanie-11554808.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Les tirages au sort des deux premiers tours fédéraux de la Coupe de France féminine ainsi que du septième tour de la la Coupe de France masculine se sont tenus ce mercredi 1er novembre à Clairefontaine. Découvrez les...","content":"Les tirages au sort des deux premiers tours fédéraux de la Coupe de France féminine ainsi que du septième tour de la la Coupe de France masculine se sont tenus ce mercredi 1er novembre à Clairefontaine. Découvrez les affiches pour nos clubs d'Occitanie. Les matches du premier tour fédéral se joueront les samedis 18 et dimanche 19 novembre. Les matches du septième tour se joueront les samedis 18 et dimanche 19 novembre.","pubDate":"2023-11-01 12:43:44","image_url":"https://images.midilibre.fr/api/v1/images/view/65421d0f0d60545a403b4c69/standard/image.jpg?v=1","source_id":"midilibre","source_priority":388149,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"f1b01ac34d00ba4594067edf4584f112","title":"Sir Bobby Charlton died after fall, inquest hears","link":"https://www.bbc.co.uk/news/uk-england-manchester-67285478","keywords":null,"creator":null,"video_url":null,"description":"The England and Manchester United legend was living at a care home for patients with dementia.","content":"Sir Bobby Charlton died after fall, inquest hears Published 38 minutes ago Share close panel Share page Copy link About sharing Image source, Reuters Image caption, Sir Bobby is hailed as one of England's greatest footballers Sir Bobby Charlton died after an accidental fall at a care home, an inquest has heard. The England and Manchester United legend died aged 86 in Macclesfield General Hospital on 21 October. The inquest at Cheshire Coroner's Court heard Sir Bobby was living in The Willows in Knutsford, a nursing home caring for patients with dementia. Senior coroner for Cheshire Jacqueline Devonish concluded his death was accidental. The hearing was told Sir Bobby had lost his balance as he stood up from his chair, striking a window sill and \"possibly a radiator\". Staff performed a full-body check at the time and noted no visible injuries, and recorded his mobility seemed unaffected. But they later noticed swelling on his back and paramedics were called to the centre, where he had been receiving respite care since July. Image source, PA Media Image caption, Tributes to Sir Bobby were left ahead of the Premier League match at Old Trafford on Sunday He was then taken to a local hospital before being moved to Macclesfield General Hospital. A chest X-ray and CT scan revealed he had fractured his ribs and was likely to develop pneumonia, the inquest heard. Doctors then agreed Sir Bobby should be put on end-of-life care, dying five days later. The inquest heard he had an extensive medical history and had also contracted Covid in September. Care home manager Tamara Simmons, said Sir Bobby \"needed support with all aspects of daily living\". The coroner gave the cause of death as trauma in the lungs, a fall and dementia. Image source, PA Media Image caption, Sir Bobby was instrumental in English football's greatest achievements Widely hailed as one of England's greatest ever players, Sir Bobby was a key figure in the Three Lions' 1966 World Cup victory. During a 17-year first-team career with United he won three league titles, a European Cup and an FA Cup. Thousands of fans have left tributes at Old Trafford, with the area in front of the famous Trinity statue - where he is immortalised alongside team-mates George Best and Denis Law - flooded with memorabilia and flowers. Plans for a full memorial service later this month have also been unveiled. Why not follow BBC North West on Facebook , X and Instagram ? You can also send story ideas to northwest.newsonline@bbc.co.uk Related Topics Macclesfield Manchester More on this story Sir Bobby Charlton memorial service announced Published 19 hours ago I owe Sir Bobby Charlton everything - Beckham Published 1 day ago Charlton 'a tower of strength', says Ferguson Published 2 days ago England and Man Utd legend Charlton dies aged 86 Published 21 October Related Internet Links HM Courts & Tribunals Service The BBC is not responsible for the content of external sites.","pubDate":"2023-11-01 12:28:12","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"d5b82b63aa2cc4460a57a76eb9f9a4b4","title":"Liverpool icon Djibril Cisse's son plays for Notts County and has represented Wales","link":"https://www.dailystar.co.uk/sport/football/liverpool-cisse-son-notts-wales-31332357","keywords":["Sport"],"creator":null,"video_url":null,"description":"A new football dynasty appears to be in the making after one member of Liverpool's 2005 Champions League-winning squad saw his son climb the ranks at League Two outfit Notts County","content":"Athletic genes can often run in the family, and it appears that may ring true for a certain member of one of 's most iconic squads. The tyke in question is already well on his way to stardom after representing in the FA Youth Cup this week - albeit in a 3-0 defeat to . That's after representing his mother's nation, Wales, in his younger days and spending time developing in 's respected academy. And the teenage talent is none other than Cassius Cisse, oldest son of 2005 -winner and one-time champion Djibril. Almost 20 years after his dad first made the move to Merseyside in what became the most successful chapter of his career, 17-year-old Cassius is at the genesis of his own journey through the sport that made his father a great. Cassius' mother - Jude Littler, who has kept Cisse's surname since their 2014 divorce - celebrated her son signing his first contract with Notts County in early July. And he's well on his way with the fourth-tier team after starting in Tuesday's FA Youth Cup defeat to the Imps. Cisse played the first 58 minutes from right-wing-back and enjoyed some bright moments prior to the home team's collapse. County enjoyed a positive first half in the cup clash but fell away in the second period as Lincoln ran away with the result. The game also featured a pre-match tribute to Nottingham Panthers player Adam Johnson, who . Former France international Djibril scored nine times in 41 appearances for Les Bleus and was part of the squad that won the 2003 Confederations Cup. The FA Cup-winner also featured in the disappointing 2002 team and would have featured in the 2006 competition had he not broken his leg just before the tournament was due to get underway. £39.99 (PS5), £40.49 (PC) Cisse Jr was only 12 when he first pulled on the colours of Wales' regional team, opting to represent his mother's country over France or England, where he was born. The prospect would also qualify to play for the Ivory Coast, whom his late paternal grandfather, Mangue, once captained. It's uncertain as to whether Cisse has kept on track with Wales' youth teams, though younger brother Prince Kobe is very much still part of the Red Dragons set-up. The 15-year-old is also a member of Liverpool's academy and may stand a chance of lining up as part of the Reds' attack in future, just like his dad. The siblings seem destined for stardom in future, whether that be as footballers or in some other field. Cassius, Prince and youngest brother Marley, 13, all previously appeared with their mum on an episode of 'Rich Holiday, Poor Holiday' in 2020. The good-looking trio have also performed modelling work in the past and appeared in ads for the likes of Tommy Hilfiger, Under Armour and JD. At the very least, if The Beautiful Game doesn't work out, they'll be able to fall back on their looks.","pubDate":"2023-11-01 12:24:24","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31332687.ece/ALTERNATES/s98/6_Screenshot-2023-11-01-at-110043-copy.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6803552090c93f440842e091304f3f6e","title":"Sir Bobby Charlton's cause of death confirmed after Man Utd legend's tragic accident","link":"https://www.dailystar.co.uk/sport/football/breaking-sir-bobby-charlton-death-31333865","keywords":["Sport"],"creator":null,"video_url":null,"description":"Manchester United and England legend Sir Bobby Charlton passed away aged 86 last week following an accidental fall at a care home - an inquest heard","content":"legend Sir Bobby Charlton died after an accidental fall at a care home, an inquest was told. Charlton left the football world in mourning after he passed away aged 86 on October 21. The United and legend was pronounced dead at Macclesfield General Hospital following the accidental fall. Sir Bobby had been battling dementia at The Willows care home in Knutsford. An inquest into his death heard how he lost his balance as he stood up from a chair and hit a windowsill - he also \"possibly\" hit a radiator during the fall. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month The court was told how staff didn't notice any visible injuries after a full body check, but after noticing swelling on his back he was taken to hospital. It was at Macclesfield General Hospital he was put on end-of-life care due to his likelihood of developing pneumonia. The full cause of death was given as trauma in the lungs, a fall and dementia. Senior coroner for Cheshire Jacqueline Devonish ruled his death was accidental. United said in a statement: \"Manchester United is in mourning following the passing of Sir Bobby Charlton, one of the greatest and most beloved players in the history of our club. \"Sir Bobby was a hero to millions, not just in Manchester, or the United Kingdom, but wherever football is played around the world... The club’s heartfelt sympathies are with his wife Lady Norma, his daughters and grandchildren, and all who loved him.\" While his family added: \"It is with great sadness that we share the news that Sir Bobby passed peacefully in the early hours of Saturday morning. \"He was surrounded by his family. His family would like to pass on their thanks to everyone who has contributed to his care and for the many people who have loved and supported him. \"We would request that the family’s privacy be respected at this time.”","pubDate":"2023-11-01 12:17:15","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31333951.ece/ALTERNATES/s98/0_Star-Breaking-News-1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bbad1ba6f16244883c3b07d3d0a40344","title":"Andriy Shevchenko lifts the lid on ill-fated Chelsea spell and says 'I did my best'","link":"https://www.dailystar.co.uk/sport/football/shevchenko-admits-failed-chelsea-spell-31332603","keywords":["Sport"],"creator":null,"video_url":null,"description":"The former striker ranks among the greatest ever in his position but his three-year stint at Chelsea was nothing short of hellish thanks to injury issues","content":"Andriy Shevchenko opened up about the injuries he suffered through during his blighted career at . The Ukrainian legend was one of the most feared strikers in the world during his career, as the 2004 Ballon d'Or winner enjoyed seven years at AC Milan. After scoring 173 goals in 296 games for the Italian giants, Chelsea came calling and signed the striker in a £30.8million deal. Despite the high hopes that the former winner would spearhead Jose Mourinho's side to a third consecutive title, it never worked out for Shevchenko, who was blighted by injuries during his time in West London. Shevchenko scored just 22 goals across two years at Stamford Bridge before he was loaned out to AC Milan in the third year of his contract. In his new book, My Life, My Football, the ex-Ukrainian national team captain opened up about how his injuries led to his demise at Chelsea and the rest of his career at the top level. Following the 2006 , Shevchenko was nursing a knee injury suffered in a quarter-final defeat to Italy which he arrived with for Chelsea's pre-season. \"I did my best and gave my all: that was just my way,\" he said. \"Still, I knew my motor wasn’t running as it ought to. The newspapers criticised me heavily but only I knew the real problem: that accursed fatigue that had never lifted.\" Despite winning the domestic cup double in his debut season, Shevchenko discovered a hernia which caused him to miss the FA Cup final against as he admitted that the failed surgery caused him to lose his strength. \"During the operation, something didn’t go to plan. I didn’t get back to what I was before. I lost all my strength. I was in a rich vein of form — the worst possible moment to suffer an injury.\" He played just 25 games in all competitions in his last season at Chelsea where he was riding the bench in yet another final as he could only watch Chelsea lose to Manchester United in the Champions League final in 2008. The constant injuries had such a physical toll on him that he said: \"I was barely a shadow of the player I used to be.\" A return to AC Milan in 2008 saw Shevchenko score just two goals in 26 games, before he ended his career at boyhood club Dynamo Kyiv in 2012.","pubDate":"2023-11-01 12:09:50","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31332780.ece/ALTERNATES/s98/2_Newcastle-United-v-Chelsesa-at-St-Jamess-Park-220407.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1fe6b4d91a54098637105b17281f2510","title":"From an NBA superstar dressed as Slenderman to footballing Batman - can you recognise these sports stars in their Halloween costumes?","link":"https://www.dailymail.co.uk/sport/othersports/article-12696969/From-NBA-superstar-dressed-Slenderman-footballing-Batman-recognise-sports-stars-Halloween-costumes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"With their multi-million pound contracts and huge following on social media, sports stars rarely hold back when it comes to Halloween, and it appears this year has been no different.","content":"Can you recognise these sports stars in their Halloween costumes? Man United's Dark Knight, a Euros-winning pirate, the Super Mario LIV golfer... and which Lionesses legend has transformed into terrifying Pennywise? Sports stars showed off their impeccable Halloween costumes on social media Perhaps the best costume came from a 7ft 4in NBA player who was Slenderman Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Milo Pope For Mailonline Published: 11:39, 1 November 2023 | Updated: 11:59, 1 November 2023 e-mail View comments With their multi-million pound contracts and huge following on social media, sports stars rarely hold back when it comes to Halloween . And it appears this year has been no different as golfers, footballers and basketballers alike donned their festive attire. Choosing characters from films and video games to downright terrifying Halloween legends, there was a good variety on display. While some of these stars are easier to guess than others, it appears NBA and NFL players have concealed their identity the best. Here's a look at this year's best Halloween outfits from your favourite sporting stars. San Antonio Spurs superstar Victor Wembanyama arrives as Slenderman in Phoenix, Arizona Paul George of the Los Angeles Clippers went far less scary as he dressed as Where's Wally Happy Halloween! Click here for more- https://t.co/VMs5u0JvuX pic.twitter.com/PFChEWf3LC — Paige Spiranac (@PaigeSpiranac) October 31, 2023 First up is the NBA's newest superstar, Victor Wembanyama, who was pictured arriving at the Footprint Center in Arizona to face the Phoenix Suns. The San Antonio Spurs Frenchman came in a Slenderman costume and, standing at seven feet four inches, he definitely nailed the look. Also from the NBA world, Paul George of the Los Angeles Clippers opted for a slightly less scary look as he donned a Where's Wally costume. On to social media golfing sensation Paige Spiranac, the OnlyFans star has done her best impression of Pamela Anderson on Baywatch. The influencer, who has one of the biggest social media followings in the sport, has regularly hit back at commenters who criticise her choice of attire when she plays golf. Former England international and BBC pundit Alex Scott was completely unrecognisable in her costume as she wowed fans with a terrifying clown suit. Scott posted several photos on her Instagram of herself in appropriate surroundings, holding nothing but a set of balloons reminiscent of the iconic Pennywise from Stephen King's IT. Former Spain and Barcelona striker David Villa and his wife Patricia Gonzalez arguably went one better when it came to faithful recreations of a character. While Scott went for a more colourful approach, Villa and Gonzalez even went as far as including the famous clown's monstrous facial features. Alex Scott was completely unrecognisable in her costume as she wowed fans with a terrifying clown suit Villa and Gonzalez even went as far as including the famous clown's monstrous facial features Terry Rozier of the Charlotte Hornets arrives at the arena ahead of their game against Brooklyn Jose Alvarado, the No 15 for the New Orleans Pelicans smashed this Saw outfit last night Keeping with the spooky theme, NBA stars Terry Rozier and Jose Alvarado did their part to terrify the fans. Rozier, who plays for the Charlotte Hornets, donned a Jason Friday the 13th hockey mask as he arrived at the Spectrum Arena to face the Brooklyn Nets. Alvarado, who plays for the New Orleans Pelicans, went in a famous costume from the film series Saw ahead of their game against the Golden State Warriors. Perhaps the strangest of all masks came from Cincinnati Bengals quarterback Joe Burrow who wore an ultra-realistic alien mask as he hopped on the team plane to take on the San Francisco 49ers. Moving away from scary clowns now, LIV Golf's Brooks Koepka posed for some adorable photos alongside his wife Jena Sims and their child. The PGA Championship and US Open winner was dressed as Mario with his child as Luigi, while Jena went as Princess Peach. Even the dog got in on the act, too! Manchester United stars Casemiro and Alejandro Garnacho unburdened themselves of last weekend's humiliating derby day defeat to Manchester City by wearing the outfits of iconic superheroes alongside their respective families. Joey Burrow, from the Cincinnati Bengals, went ultra weird with this incredibly life-like mask Five-time major winner Brooks Koepka is enjoying his downtime as his family dressed up Man United midfielder Casemiro dressed up as Batman while his wife opted for a red devil The veteran Brazilian midfielder, who has been sidelined through with injury, took the chance to live out the dream of many a child and appeared as Batman. His wife, Anna Mariana, appropriately opted for a red devil. United youngster Garnacho and partner Eva Garcia meanwhile, celebrated their first Halloween following the birth of their son by going as The Incredibles. Meanwhile, PSG stopper Gianluigi Donnarumma and girlfriend Alessia Elefante fancied themselves as crew mates on the Black Pearl. The pair took to social media to show off their costumes inspired by the Pirates of the Caribbean movies though neither the 24-year-old nor his interior designer partner bore any striking resembles to the film's main cast. And to round things off, Champions League winner and Real Madrid winger Lucas Vasquez posted an adorable picture alongside his family. The Spaniard's family dressed up as Teenage Mutant Ninja Turtles. Alejandro Garnacho and his family wore costumes from Pixar's hit move The Incredibles PSG's Gianluigi Donnarumma and his girlfriend Alessia Elefante fancied themselves as pirates Real Madrid's Lucas Vasquez and his family dressed up as Teenage Mutant Ninja Turtles NBA Halloween Casemiro Share or comment on this article: From an NBA superstar dressed as Slenderman to footballing Batman - can you recognise these sports stars in their Halloween costumes? e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-01 11:59:13","image_url":"https://i.dailymail.co.uk/1s/2023/11/01/11/77264277-0-image-a-51_1698836935572.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e30fc68fdf85609f0135c43c0c9e149e","title":"Vale Football round-up: Cardiff Airport cup success goes on","link":"https://www.penarthtimes.co.uk/sport/23894286.vale-football-round-up-cardiff-airport-cup-success-goes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Cardiff Airport continued their run in the cups with a penalty shootout win and Ely Rangers came away with a great result in the FAW Trophy","content":"THERE was drama and victory against the odds in the lower Vale football leagues round three of the FAW Trophy. Cardiff Airport, who are having a successful run in the Welsh Cup, matched that with a run in the FAW after penalty shootout glory. And Ely Rangers came away with a fantastic victory over Cardiff Draconians. Last weekend was FAW Trophy Round 3. The FAW Trophy is for all clubs at FAW Tier 3 and below. Wenvoe’s Ely Rangers had the toughest task on paper with a visit to Gabalfa to play Ardal SW Cardiff Draconians where they left with a 3-2 victory, Alex Long (two) and Richard Greaves the scorers. Cardiff Airport’s FAW cup runs continue with a win over Caerphilly Athletic. The score was 3-3 at full time but Airport’s penalty takers put them through to Round 4 winning the shoot-out 3-1. Scorers were Lee Stradling (two) and a Theo Richards penalty. Clwb Cymric, having lost to Vale United in Corntown to a stoppage-time winner a couple of months ago, came out victors this time 4-1. Dan Hanson was Vale’s scorer. Cogan Coronation had a difficult task against Llanelli’s CK Swiss Valley and lost 3-0. , Dinas Powys woes continue with a 9 nil defeat at home to Porthcawl Town Athletic. , Holton Road went down one-nil away against Cwm Welfare 1 - 0.","pubDate":"2023-11-01 11:56:49","image_url":"https://www.penarthtimes.co.uk/resources/images/17394294/?type=app&htype=0","source_id":"penarthtimes","source_priority":5129264,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"29d56a6b5510373bb39867d887ef25fc","title":"Vale Football round-up: Cardiff Airport cup success goes on","link":"https://www.barryanddistrictnews.co.uk/sport/23894286.vale-football-round-up-cardiff-airport-cup-success-goes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Cardiff Airport continued their run in the cups with a penalty shootout win and Ely Rangers came away with a great result in the FAW Trophy","content":"Cardiff Airport, who are having a successful run in the Welsh Cup, matched that with a run in the FAW after penalty shootout glory. And Ely Rangers came away with a fantastic victory over Cardiff Draconians. Last weekend was FAW Trophy Round 3. The FAW Trophy is for all clubs at FAW Tier 3 and below. Wenvoe’s Ely Rangers had the toughest task on paper with a visit to Gabalfa to play Ardal SW Cardiff Draconians where they left with a 3-2 victory, Alex Long (two) and Richard Greaves the scorers. Cardiff Airport’s FAW cup runs continue with a win over Caerphilly Athletic. The score was 3-3 at full time but Airport’s penalty takers put them through to Round 4 winning the shoot-out 3-1. Scorers were Lee Stradling (two) and a Theo Richards penalty. Clwb Cymric, having lost to Vale United in Corntown to a stoppage-time winner a couple of months ago, came out victors this time 4-1. Dan Hanson was Vale’s scorer. Cogan Coronation had a difficult task against Llanelli’s CK Swiss Valley and lost 3-0. , Dinas Powys woes continue with a 9 nil defeat at home to Porthcawl Town Athletic. , Holton Road went down one-nil away against Cwm Welfare 1 - 0.","pubDate":"2023-11-01 11:56:49","image_url":"https://www.barryanddistrictnews.co.uk/resources/images/17394294/?type=app&htype=0","source_id":"barryanddistrictnews","source_priority":1766302,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"968f3cb9fdb19be4c3077c82f75a0d0b","title":"Wrexham-loving model risks Instagram ban covering stunning assets in police tape","link":"https://www.dailystar.co.uk/sport/football/wrexham-alaw-haf-instagram-picture-31333184","keywords":["Sport"],"creator":null,"video_url":null,"description":"Wrexham-loving Instagram model Alaw Haf has wowed fans on as she covered left little to the imagination by covering sizeable assets in caution tape to the delight of her followers","content":"-loving Instagram model Alaw Haf has risked a ban on the social media platform with her latest snap. The stunning brunette shared a nearly-nude picture on Instagram, with only police caution tape used to protect her modesty. The tape was used to fashion some underwear, and Alaw teased fans with some underboob as she captioned the post: \"Caution.\" \"So glad you came with a warning,\" one fan joked. While a cheeky second fan shared: \"Think I’d take my chances,\" and another added: \"Caution indeed in those heels. Absolutely stunning!\" Welcome to Wrexham is back to take you behind the scenes at the Welsh club following the superstar takeover by Ryan Reynolds and Rob McElhenney. New and returning customers in the UK can now subscribe to Disney+ for £1.99/month for three months. £1.99 per month for 3 months Alaw is a huge Wrexham fan, and she drew the fury of Notts County fans over the weekend after she 'cheersed' the side after their loss to the Red Dragons. Last season's two National League sides went toe-to-toe at Meadow Lane on Saturday afternoon as they continue to set the pace at the top of the fourth-tier. But it was Phil Parkinson's side who came out on top thanks to two goals three minutes apart from Elliot Lee and Ollie Palmer. Alaw has also opened her own OnlyFans page to run alongside her Instagram - and both have gained a lot of traction in Wrexham. Speaking to over the summer she admitted: \"Even if it’s not on I have seen that Wrexham is now one of my top locations for followers on my Instagram. I enjoy creating the Wrexham content so I appreciate that other people do too.\" And she added there has been more interest in her page following the hit documentary Welcome to Wrexham: \"I speak to some of the American fans, mainly about the game or Wrexham related stuff. \"Some ask for tips about when they’re coming over. I’ve had messages from everywhere that people are watching Wrexham even in Australia!\"","pubDate":"2023-11-01 11:54:37","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31308550.ece/ALTERNATES/s98/1_ALAW-HAF.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e7adadeec2abf8de1ffe9a4da369d43b","title":"Aberystwyth League: six-shooting Bont move up to second","link":"https://www.cambrian-news.co.uk/sport/football/aberystwyth-league-six-shooting-bont-move-up-to-second-647402","keywords":["Football","Sport"],"creator":["Dylan Halliday"],"video_url":null,"description":"Bont moved up to second in the Cambrian Tyres Aberystwyth League with a comprehensive 6-1 victory against visitors Tregaron Turfs Reserves.","content":"Bont moved up to second in the with a comprehensive 6-1 victory against visitors Tregaron Turfs Reserves. The home side scored early and late through William Evans and Garin Evans in a first half that they bossed with William Evans bagging his brace on 52 minutes quickly followed by a Jordan Perry strike to put them four goals clear. Ioan Llwyd pulled one back for the Turfs which fired the home side to go in search of more goals which they got through Cian Thomas and Richard Jones. Leaders Corris made it four wins out of four courtesy of a stoppage time winner by Dean Kohler. Ceredigion League: double comeback seals deserved point for Felinfach Felinfach Ladies in narrow cup defeat at Berriew Captain’s notebook with Amy J: 'We move onto another tough test' FAW Amateur Trophy round-up: wins for Bow Street, Penrhyncoch, Tywyn and Pwllheli The Quarrymen led 2-1 at the break thanks to goals by Dafydd Jones and Joe Green with Tristan Jenkins replying for visitors Borth United. James Fox thought he had earned a share of the spoils when he converted an 82nd minute penalty but Kohler had the last laugh. Tywyn Bryncrug Reserves managed to get over the line to secure their second victory of the campaign after a close encounter against visitors Padarn United. The hosts led 2-0 at the break thanks to Jamie Pymm and an Ian Alexander Lee own goal. Dominik Patlewicz closed the gap on 51 minutes before Ben Williams restored Tywyn’s two-goal cushion with 10 minutes to go. Lee scored at the right end moments later but Tywyn held on to the points.","pubDate":"2023-11-01 13:30:59","image_url":"https://www.cambrian-news.co.uk/tindle-static/image/2023/02/27/13/corner-ball-ga81f0efb0_1920.jpg?width=1200&auto=webp","source_id":"cambrian_news","source_priority":2345860,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"be939c1183f296203307b7a5a634a792","title":"Football : on connaît les affiches du 7e tour de la Coupe de France pour les clubs d'Occitanie","link":"https://www.midilibre.fr/2023/11/01/football-les-affiches-de-coupe-de-france-pour-les-clubs-doccitanie-11554808.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Les tirages au sort des deux premiers tours fédéraux de la Coupe de France féminine ainsi que du septième tour de la la Coupe de France masculine se sont tenus ce mercredi 1er novembre à Clairefontaine. Découvrez les...","content":"Les tirages au sort des deux premiers tours fédéraux de la Coupe de France féminine ainsi que du septième tour de la la Coupe de France masculine se sont tenus ce mercredi 1er novembre à Clairefontaine. Découvrez les affiches pour nos clubs d'Occitanie. Les matches du premier tour fédéral se joueront les samedis 18 et dimanche 19 novembre. Les matches du septième tour se joueront les samedis 18 et dimanche 19 novembre.","pubDate":"2023-11-01 12:43:44","image_url":"https://images.midilibre.fr/api/v1/images/view/65421d0f0d60545a403b4c69/standard/image.jpg?v=1","source_id":"midilibre","source_priority":388149,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"f1b01ac34d00ba4594067edf4584f112","title":"Sir Bobby Charlton died after fall, inquest hears","link":"https://www.bbc.co.uk/news/uk-england-manchester-67285478","keywords":null,"creator":null,"video_url":null,"description":"The England and Manchester United legend was living at a care home for patients with dementia.","content":"Sir Bobby Charlton died after fall, inquest hears Published 38 minutes ago Share close panel Share page Copy link About sharing Image source, Reuters Image caption, Sir Bobby is hailed as one of England's greatest footballers Sir Bobby Charlton died after an accidental fall at a care home, an inquest has heard. The England and Manchester United legend died aged 86 in Macclesfield General Hospital on 21 October. The inquest at Cheshire Coroner's Court heard Sir Bobby was living in The Willows in Knutsford, a nursing home caring for patients with dementia. Senior coroner for Cheshire Jacqueline Devonish concluded his death was accidental. The hearing was told Sir Bobby had lost his balance as he stood up from his chair, striking a window sill and \"possibly a radiator\". Staff performed a full-body check at the time and noted no visible injuries, and recorded his mobility seemed unaffected. But they later noticed swelling on his back and paramedics were called to the centre, where he had been receiving respite care since July. Image source, PA Media Image caption, Tributes to Sir Bobby were left ahead of the Premier League match at Old Trafford on Sunday He was then taken to a local hospital before being moved to Macclesfield General Hospital. A chest X-ray and CT scan revealed he had fractured his ribs and was likely to develop pneumonia, the inquest heard. Doctors then agreed Sir Bobby should be put on end-of-life care, dying five days later. The inquest heard he had an extensive medical history and had also contracted Covid in September. Care home manager Tamara Simmons, said Sir Bobby \"needed support with all aspects of daily living\". The coroner gave the cause of death as trauma in the lungs, a fall and dementia. Image source, PA Media Image caption, Sir Bobby was instrumental in English football's greatest achievements Widely hailed as one of England's greatest ever players, Sir Bobby was a key figure in the Three Lions' 1966 World Cup victory. During a 17-year first-team career with United he won three league titles, a European Cup and an FA Cup. Thousands of fans have left tributes at Old Trafford, with the area in front of the famous Trinity statue - where he is immortalised alongside team-mates George Best and Denis Law - flooded with memorabilia and flowers. Plans for a full memorial service later this month have also been unveiled. Why not follow BBC North West on Facebook , X and Instagram ? You can also send story ideas to northwest.newsonline@bbc.co.uk Related Topics Macclesfield Manchester More on this story Sir Bobby Charlton memorial service announced Published 19 hours ago I owe Sir Bobby Charlton everything - Beckham Published 1 day ago Charlton 'a tower of strength', says Ferguson Published 2 days ago England and Man Utd legend Charlton dies aged 86 Published 21 October Related Internet Links HM Courts & Tribunals Service The BBC is not responsible for the content of external sites.","pubDate":"2023-11-01 12:28:12","image_url":null,"source_id":"bbc","source_priority":103,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"d5b82b63aa2cc4460a57a76eb9f9a4b4","title":"Liverpool icon Djibril Cisse's son plays for Notts County and has represented Wales","link":"https://www.dailystar.co.uk/sport/football/liverpool-cisse-son-notts-wales-31332357","keywords":["Sport"],"creator":null,"video_url":null,"description":"A new football dynasty appears to be in the making after one member of Liverpool's 2005 Champions League-winning squad saw his son climb the ranks at League Two outfit Notts County","content":"Athletic genes can often run in the family, and it appears that may ring true for a certain member of one of 's most iconic squads. The tyke in question is already well on his way to stardom after representing in the FA Youth Cup this week - albeit in a 3-0 defeat to . That's after representing his mother's nation, Wales, in his younger days and spending time developing in 's respected academy. And the teenage talent is none other than Cassius Cisse, oldest son of 2005 -winner and one-time champion Djibril. Almost 20 years after his dad first made the move to Merseyside in what became the most successful chapter of his career, 17-year-old Cassius is at the genesis of his own journey through the sport that made his father a great. Cassius' mother - Jude Littler, who has kept Cisse's surname since their 2014 divorce - celebrated her son signing his first contract with Notts County in early July. And he's well on his way with the fourth-tier team after starting in Tuesday's FA Youth Cup defeat to the Imps. Cisse played the first 58 minutes from right-wing-back and enjoyed some bright moments prior to the home team's collapse. County enjoyed a positive first half in the cup clash but fell away in the second period as Lincoln ran away with the result. The game also featured a pre-match tribute to Nottingham Panthers player Adam Johnson, who . Former France international Djibril scored nine times in 41 appearances for Les Bleus and was part of the squad that won the 2003 Confederations Cup. The FA Cup-winner also featured in the disappointing 2002 team and would have featured in the 2006 competition had he not broken his leg just before the tournament was due to get underway. £39.99 (PS5), £40.49 (PC) Cisse Jr was only 12 when he first pulled on the colours of Wales' regional team, opting to represent his mother's country over France or England, where he was born. The prospect would also qualify to play for the Ivory Coast, whom his late paternal grandfather, Mangue, once captained. It's uncertain as to whether Cisse has kept on track with Wales' youth teams, though younger brother Prince Kobe is very much still part of the Red Dragons set-up. The 15-year-old is also a member of Liverpool's academy and may stand a chance of lining up as part of the Reds' attack in future, just like his dad. The siblings seem destined for stardom in future, whether that be as footballers or in some other field. Cassius, Prince and youngest brother Marley, 13, all previously appeared with their mum on an episode of 'Rich Holiday, Poor Holiday' in 2020. The good-looking trio have also performed modelling work in the past and appeared in ads for the likes of Tommy Hilfiger, Under Armour and JD. At the very least, if The Beautiful Game doesn't work out, they'll be able to fall back on their looks.","pubDate":"2023-11-01 12:24:24","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31332687.ece/ALTERNATES/s98/6_Screenshot-2023-11-01-at-110043-copy.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6803552090c93f440842e091304f3f6e","title":"Sir Bobby Charlton's cause of death confirmed after Man Utd legend's tragic accident","link":"https://www.dailystar.co.uk/sport/football/breaking-sir-bobby-charlton-death-31333865","keywords":["Sport"],"creator":null,"video_url":null,"description":"Manchester United and England legend Sir Bobby Charlton passed away aged 86 last week following an accidental fall at a care home - an inquest heard","content":"legend Sir Bobby Charlton died after an accidental fall at a care home, an inquest was told. Charlton left the football world in mourning after he passed away aged 86 on October 21. The United and legend was pronounced dead at Macclesfield General Hospital following the accidental fall. Sir Bobby had been battling dementia at The Willows care home in Knutsford. An inquest into his death heard how he lost his balance as he stood up from a chair and hit a windowsill - he also \"possibly\" hit a radiator during the fall. Sky Sports is bringing you 500 live football games to watch, as well access to C £22 a month The court was told how staff didn't notice any visible injuries after a full body check, but after noticing swelling on his back he was taken to hospital. It was at Macclesfield General Hospital he was put on end-of-life care due to his likelihood of developing pneumonia. The full cause of death was given as trauma in the lungs, a fall and dementia. Senior coroner for Cheshire Jacqueline Devonish ruled his death was accidental. United said in a statement: \"Manchester United is in mourning following the passing of Sir Bobby Charlton, one of the greatest and most beloved players in the history of our club. \"Sir Bobby was a hero to millions, not just in Manchester, or the United Kingdom, but wherever football is played around the world... The club’s heartfelt sympathies are with his wife Lady Norma, his daughters and grandchildren, and all who loved him.\" While his family added: \"It is with great sadness that we share the news that Sir Bobby passed peacefully in the early hours of Saturday morning. \"He was surrounded by his family. His family would like to pass on their thanks to everyone who has contributed to his care and for the many people who have loved and supported him. \"We would request that the family’s privacy be respected at this time.”","pubDate":"2023-11-01 12:17:15","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31333951.ece/ALTERNATES/s98/0_Star-Breaking-News-1.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bbad1ba6f16244883c3b07d3d0a40344","title":"Andriy Shevchenko lifts the lid on ill-fated Chelsea spell and says 'I did my best'","link":"https://www.dailystar.co.uk/sport/football/shevchenko-admits-failed-chelsea-spell-31332603","keywords":["Sport"],"creator":null,"video_url":null,"description":"The former striker ranks among the greatest ever in his position but his three-year stint at Chelsea was nothing short of hellish thanks to injury issues","content":"Andriy Shevchenko opened up about the injuries he suffered through during his blighted career at . The Ukrainian legend was one of the most feared strikers in the world during his career, as the 2004 Ballon d'Or winner enjoyed seven years at AC Milan. After scoring 173 goals in 296 games for the Italian giants, Chelsea came calling and signed the striker in a £30.8million deal. Despite the high hopes that the former winner would spearhead Jose Mourinho's side to a third consecutive title, it never worked out for Shevchenko, who was blighted by injuries during his time in West London. Shevchenko scored just 22 goals across two years at Stamford Bridge before he was loaned out to AC Milan in the third year of his contract. In his new book, My Life, My Football, the ex-Ukrainian national team captain opened up about how his injuries led to his demise at Chelsea and the rest of his career at the top level. Following the 2006 , Shevchenko was nursing a knee injury suffered in a quarter-final defeat to Italy which he arrived with for Chelsea's pre-season. \"I did my best and gave my all: that was just my way,\" he said. \"Still, I knew my motor wasn’t running as it ought to. The newspapers criticised me heavily but only I knew the real problem: that accursed fatigue that had never lifted.\" Despite winning the domestic cup double in his debut season, Shevchenko discovered a hernia which caused him to miss the FA Cup final against as he admitted that the failed surgery caused him to lose his strength. \"During the operation, something didn’t go to plan. I didn’t get back to what I was before. I lost all my strength. I was in a rich vein of form — the worst possible moment to suffer an injury.\" He played just 25 games in all competitions in his last season at Chelsea where he was riding the bench in yet another final as he could only watch Chelsea lose to Manchester United in the Champions League final in 2008. The constant injuries had such a physical toll on him that he said: \"I was barely a shadow of the player I used to be.\" A return to AC Milan in 2008 saw Shevchenko score just two goals in 26 games, before he ended his career at boyhood club Dynamo Kyiv in 2012.","pubDate":"2023-11-01 12:09:50","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31332780.ece/ALTERNATES/s98/2_Newcastle-United-v-Chelsesa-at-St-Jamess-Park-220407.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"1fe6b4d91a54098637105b17281f2510","title":"From an NBA superstar dressed as Slenderman to footballing Batman - can you recognise these sports stars in their Halloween costumes?","link":"https://www.dailymail.co.uk/sport/othersports/article-12696969/From-NBA-superstar-dressed-Slenderman-footballing-Batman-recognise-sports-stars-Halloween-costumes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"With their multi-million pound contracts and huge following on social media, sports stars rarely hold back when it comes to Halloween, and it appears this year has been no different.","content":"Can you recognise these sports stars in their Halloween costumes? Man United's Dark Knight, a Euros-winning pirate, the Super Mario LIV golfer... and which Lionesses legend has transformed into terrifying Pennywise? Sports stars showed off their impeccable Halloween costumes on social media Perhaps the best costume came from a 7ft 4in NBA player who was Slenderman Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Milo Pope For Mailonline Published: 11:39, 1 November 2023 | Updated: 11:59, 1 November 2023 e-mail View comments With their multi-million pound contracts and huge following on social media, sports stars rarely hold back when it comes to Halloween . And it appears this year has been no different as golfers, footballers and basketballers alike donned their festive attire. Choosing characters from films and video games to downright terrifying Halloween legends, there was a good variety on display. While some of these stars are easier to guess than others, it appears NBA and NFL players have concealed their identity the best. Here's a look at this year's best Halloween outfits from your favourite sporting stars. San Antonio Spurs superstar Victor Wembanyama arrives as Slenderman in Phoenix, Arizona Paul George of the Los Angeles Clippers went far less scary as he dressed as Where's Wally Happy Halloween! Click here for more- https://t.co/VMs5u0JvuX pic.twitter.com/PFChEWf3LC — Paige Spiranac (@PaigeSpiranac) October 31, 2023 First up is the NBA's newest superstar, Victor Wembanyama, who was pictured arriving at the Footprint Center in Arizona to face the Phoenix Suns. The San Antonio Spurs Frenchman came in a Slenderman costume and, standing at seven feet four inches, he definitely nailed the look. Also from the NBA world, Paul George of the Los Angeles Clippers opted for a slightly less scary look as he donned a Where's Wally costume. On to social media golfing sensation Paige Spiranac, the OnlyFans star has done her best impression of Pamela Anderson on Baywatch. The influencer, who has one of the biggest social media followings in the sport, has regularly hit back at commenters who criticise her choice of attire when she plays golf. Former England international and BBC pundit Alex Scott was completely unrecognisable in her costume as she wowed fans with a terrifying clown suit. Scott posted several photos on her Instagram of herself in appropriate surroundings, holding nothing but a set of balloons reminiscent of the iconic Pennywise from Stephen King's IT. Former Spain and Barcelona striker David Villa and his wife Patricia Gonzalez arguably went one better when it came to faithful recreations of a character. While Scott went for a more colourful approach, Villa and Gonzalez even went as far as including the famous clown's monstrous facial features. Alex Scott was completely unrecognisable in her costume as she wowed fans with a terrifying clown suit Villa and Gonzalez even went as far as including the famous clown's monstrous facial features Terry Rozier of the Charlotte Hornets arrives at the arena ahead of their game against Brooklyn Jose Alvarado, the No 15 for the New Orleans Pelicans smashed this Saw outfit last night Keeping with the spooky theme, NBA stars Terry Rozier and Jose Alvarado did their part to terrify the fans. Rozier, who plays for the Charlotte Hornets, donned a Jason Friday the 13th hockey mask as he arrived at the Spectrum Arena to face the Brooklyn Nets. Alvarado, who plays for the New Orleans Pelicans, went in a famous costume from the film series Saw ahead of their game against the Golden State Warriors. Perhaps the strangest of all masks came from Cincinnati Bengals quarterback Joe Burrow who wore an ultra-realistic alien mask as he hopped on the team plane to take on the San Francisco 49ers. Moving away from scary clowns now, LIV Golf's Brooks Koepka posed for some adorable photos alongside his wife Jena Sims and their child. The PGA Championship and US Open winner was dressed as Mario with his child as Luigi, while Jena went as Princess Peach. Even the dog got in on the act, too! Manchester United stars Casemiro and Alejandro Garnacho unburdened themselves of last weekend's humiliating derby day defeat to Manchester City by wearing the outfits of iconic superheroes alongside their respective families. Joey Burrow, from the Cincinnati Bengals, went ultra weird with this incredibly life-like mask Five-time major winner Brooks Koepka is enjoying his downtime as his family dressed up Man United midfielder Casemiro dressed up as Batman while his wife opted for a red devil The veteran Brazilian midfielder, who has been sidelined through with injury, took the chance to live out the dream of many a child and appeared as Batman. His wife, Anna Mariana, appropriately opted for a red devil. United youngster Garnacho and partner Eva Garcia meanwhile, celebrated their first Halloween following the birth of their son by going as The Incredibles. Meanwhile, PSG stopper Gianluigi Donnarumma and girlfriend Alessia Elefante fancied themselves as crew mates on the Black Pearl. The pair took to social media to show off their costumes inspired by the Pirates of the Caribbean movies though neither the 24-year-old nor his interior designer partner bore any striking resembles to the film's main cast. And to round things off, Champions League winner and Real Madrid winger Lucas Vasquez posted an adorable picture alongside his family. The Spaniard's family dressed up as Teenage Mutant Ninja Turtles. Alejandro Garnacho and his family wore costumes from Pixar's hit move The Incredibles PSG's Gianluigi Donnarumma and his girlfriend Alessia Elefante fancied themselves as pirates Real Madrid's Lucas Vasquez and his family dressed up as Teenage Mutant Ninja Turtles NBA Halloween Casemiro Share or comment on this article: From an NBA superstar dressed as Slenderman to footballing Batman - can you recognise these sports stars in their Halloween costumes? e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-01 11:59:13","image_url":"https://i.dailymail.co.uk/1s/2023/11/01/11/77264277-0-image-a-51_1698836935572.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e30fc68fdf85609f0135c43c0c9e149e","title":"Vale Football round-up: Cardiff Airport cup success goes on","link":"https://www.penarthtimes.co.uk/sport/23894286.vale-football-round-up-cardiff-airport-cup-success-goes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Cardiff Airport continued their run in the cups with a penalty shootout win and Ely Rangers came away with a great result in the FAW Trophy","content":"THERE was drama and victory against the odds in the lower Vale football leagues round three of the FAW Trophy. Cardiff Airport, who are having a successful run in the Welsh Cup, matched that with a run in the FAW after penalty shootout glory. And Ely Rangers came away with a fantastic victory over Cardiff Draconians. Last weekend was FAW Trophy Round 3. The FAW Trophy is for all clubs at FAW Tier 3 and below. Wenvoe’s Ely Rangers had the toughest task on paper with a visit to Gabalfa to play Ardal SW Cardiff Draconians where they left with a 3-2 victory, Alex Long (two) and Richard Greaves the scorers. Cardiff Airport’s FAW cup runs continue with a win over Caerphilly Athletic. The score was 3-3 at full time but Airport’s penalty takers put them through to Round 4 winning the shoot-out 3-1. Scorers were Lee Stradling (two) and a Theo Richards penalty. Clwb Cymric, having lost to Vale United in Corntown to a stoppage-time winner a couple of months ago, came out victors this time 4-1. Dan Hanson was Vale’s scorer. Cogan Coronation had a difficult task against Llanelli’s CK Swiss Valley and lost 3-0. , Dinas Powys woes continue with a 9 nil defeat at home to Porthcawl Town Athletic. , Holton Road went down one-nil away against Cwm Welfare 1 - 0.","pubDate":"2023-11-01 11:56:49","image_url":"https://www.penarthtimes.co.uk/resources/images/17394294/?type=app&htype=0","source_id":"penarthtimes","source_priority":5129264,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"29d56a6b5510373bb39867d887ef25fc","title":"Vale Football round-up: Cardiff Airport cup success goes on","link":"https://www.barryanddistrictnews.co.uk/sport/23894286.vale-football-round-up-cardiff-airport-cup-success-goes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Cardiff Airport continued their run in the cups with a penalty shootout win and Ely Rangers came away with a great result in the FAW Trophy","content":"Cardiff Airport, who are having a successful run in the Welsh Cup, matched that with a run in the FAW after penalty shootout glory. And Ely Rangers came away with a fantastic victory over Cardiff Draconians. Last weekend was FAW Trophy Round 3. The FAW Trophy is for all clubs at FAW Tier 3 and below. Wenvoe’s Ely Rangers had the toughest task on paper with a visit to Gabalfa to play Ardal SW Cardiff Draconians where they left with a 3-2 victory, Alex Long (two) and Richard Greaves the scorers. Cardiff Airport’s FAW cup runs continue with a win over Caerphilly Athletic. The score was 3-3 at full time but Airport’s penalty takers put them through to Round 4 winning the shoot-out 3-1. Scorers were Lee Stradling (two) and a Theo Richards penalty. Clwb Cymric, having lost to Vale United in Corntown to a stoppage-time winner a couple of months ago, came out victors this time 4-1. Dan Hanson was Vale’s scorer. Cogan Coronation had a difficult task against Llanelli’s CK Swiss Valley and lost 3-0. , Dinas Powys woes continue with a 9 nil defeat at home to Porthcawl Town Athletic. , Holton Road went down one-nil away against Cwm Welfare 1 - 0.","pubDate":"2023-11-01 11:56:49","image_url":"https://www.barryanddistrictnews.co.uk/resources/images/17394294/?type=app&htype=0","source_id":"barryanddistrictnews","source_priority":1766302,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"968f3cb9fdb19be4c3077c82f75a0d0b","title":"Wrexham-loving model risks Instagram ban covering stunning assets in police tape","link":"https://www.dailystar.co.uk/sport/football/wrexham-alaw-haf-instagram-picture-31333184","keywords":["Sport"],"creator":null,"video_url":null,"description":"Wrexham-loving Instagram model Alaw Haf has wowed fans on as she covered left little to the imagination by covering sizeable assets in caution tape to the delight of her followers","content":"-loving Instagram model Alaw Haf has risked a ban on the social media platform with her latest snap. The stunning brunette shared a nearly-nude picture on Instagram, with only police caution tape used to protect her modesty. The tape was used to fashion some underwear, and Alaw teased fans with some underboob as she captioned the post: \"Caution.\" \"So glad you came with a warning,\" one fan joked. While a cheeky second fan shared: \"Think I’d take my chances,\" and another added: \"Caution indeed in those heels. Absolutely stunning!\" Welcome to Wrexham is back to take you behind the scenes at the Welsh club following the superstar takeover by Ryan Reynolds and Rob McElhenney. New and returning customers in the UK can now subscribe to Disney+ for £1.99/month for three months. £1.99 per month for 3 months Alaw is a huge Wrexham fan, and she drew the fury of Notts County fans over the weekend after she 'cheersed' the side after their loss to the Red Dragons. Last season's two National League sides went toe-to-toe at Meadow Lane on Saturday afternoon as they continue to set the pace at the top of the fourth-tier. But it was Phil Parkinson's side who came out on top thanks to two goals three minutes apart from Elliot Lee and Ollie Palmer. Alaw has also opened her own OnlyFans page to run alongside her Instagram - and both have gained a lot of traction in Wrexham. Speaking to over the summer she admitted: \"Even if it’s not on I have seen that Wrexham is now one of my top locations for followers on my Instagram. I enjoy creating the Wrexham content so I appreciate that other people do too.\" And she added there has been more interest in her page following the hit documentary Welcome to Wrexham: \"I speak to some of the American fans, mainly about the game or Wrexham related stuff. \"Some ask for tips about when they’re coming over. I’ve had messages from everywhere that people are watching Wrexham even in Australia!\"","pubDate":"2023-11-01 11:54:37","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31308550.ece/ALTERNATES/s98/1_ALAW-HAF.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"}]}