{"newsArray":[{"title":"Tababaraha Weyn Ee Tottenham Ogol, Salah Oo Liverpool Baxsad Ka Ah & Wararkii Suuqa","link":"https://laacibnet.net/somali/tababaraha-weyn-ee-tottenham-ogol-salah-oo-liverpool-baxsad-ka-ah-wararkii-suuqa/","keywords":["Bundesliga","Ligue 1","Serie A","Suuqa Kala Iibsiga","Wararka Ciyaaraha","Wararka La Liga","Wararka Premier League"],"creator":["Apdihakem Omer Adam"],"video_url":null,"description":"Tottenham ma doonayso inay xagaaga iibiso Harry Kane oo heshiiskiisu 2024 dhacayo xataa haddii uu heshiis kordhin diido. (Sky Sports) Luis Enrique wuu xiisaynayaa shaqada Tottenham haddii uu ka tago kooxdaas tonio Conte. (Times – subscription required) Mohamed Salah ayaa si xoogan uga fikiraya inuu ka tago Liverpool walow uu xagaagii hore uun heshiis kordhin […]","content":"Tottenham ma doonayso inay xagaaga iibiso Harry Kane oo heshiiskiisu 2024 dhacayo xataa haddii uu heshiis kordhin diido. (Sky Sports) Luis Enrique wuu xiisaynayaa shaqada Tottenham haddii uu ka tago kooxdaas tonio Conte. (Times – subscription required) Mohamed Salah ayaa si xoogan uga fikiraya inuu ka tago Liverpool walow uu xagaagii hore uun heshiis kordhin sameeyay, Reds ayaa faa’ido badan iibkiisa ka samayn kara iyadoo PSG saxeexiisa doonayso. (Fichajes – in Spanish) Alexis Mac Allister ayaa xiiso ka helaya kooxo badan oo ay Liverpool iyo Newcastle kamid yihiin xilli uu diyaar u yahay inuu Brighton xagaaga ka tago. (90 Min) Inter Milan madaxeeda fulinta ee Beppe Marotta ayaa sheegay in Romelu Lukaku ku laaban doono Chelsea marka heshiiskiisa amaahda ahi xagaag dhaco. (Sky Sport Italia) Edouard Mendy ayaa wadahadalo heshiis kordhin la yeeshay Chelsea balse labada dhinac wax heshiis ah wali kuma dhawa.(Times – subscription required) Barcelona ayaa doonaysa inay 70 Milyan oo pound ka samayso iibka Frenkie de Jong, wuxuu bartilmaameedka koowaad u yahay Chelsea balse waa inay kula tartanto Man United. (Football Insider) Manchester United heshiis cusub ayay u bandhigaysaa garabkeeda Facundo Pellistri kahor inta aysan xagaaga amaah ku dirin. (Fabrizio Romano) Leeds United ayaa heshiis ay dhammaadka xilli ciyaareedka kula saxeexanayso la gaadhay weeraryahanka Barcelona ee Ilias Akhomach, (Mundo Deportivo – in Spanish) Wolves khadkeeda dhexe ee Ruben Neves bartilmaameed uma aha hadda kaddib Barcelona. (Fichajes – in Spanish) Julian Alvarez ayaa heshiis cusub oo shan sano iyo badh ah la gaadhay kooxdiisa Man City. (Football Insider) Newcastle United ayaa xiisaynaysa daafaca bidix ee Arsenal ee Kieran Tierney balse Gunners ayaa 25 sano jirkaas 35 ilaa 40 Milyan oo pound ku doonaya iibkiisa. (Caught Offside) Liverpool iyo Newcastle ayaa ku tartamaya saxeexa 21 sano jirka khadka dhexe ee Alan Varela oo ka tirsan Boca Juniors. (Football Insider) Paris St-Germain ayaa ka fikiraysa inay heshiis cusub u bandhigto Sergio Ramos, 37 sano jirkaas oo heshiiskiisu xagaaga dhacayo ayaa lala xidhiidhinayay kooxo Sucuudi iyo Maraykan ah. (Sport – in Spanish)","pubDate":"2023-03-15 09:10:19","image_url":null,"source_id":"laacibnet","category":["sports"],"country":["somalia"],"language":"Somali"},{"title":"Football news LIVE - Haaland breaks Messi record, Liverpool prepare for Madrid, Ronaldo punished","link":"https://www.mirror.co.uk/sport/football/news/football-news-live-liverpool-arsenal-29439974","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"The final matches of the Champions League last 16 will take place on Wednesday night, with Liverpool needing a miracle to progress past LaLiga giants Real Madrid","content":"Manchester City cantered into the Champions League quarter-finals after Erling Haaland plundered an extraordinary five goals against RB Leipzig . The Norwegian broke several records thanks to his stunning evening, moving past Lionel Messi. Aiming to join their Premier League rivals in the last eight are Liverpool , but the Reds need a miracle to overturn a their 5-2 aggregate deficit to Real Madrid . Elsewhere, Cristiano Ronaldo was punished for a display of frustration as Al-Nassr got their Saudi Pro League title hopes back on track. And Mikel Arteta is weighing up handing Gabriel Jesus his first start since November when Arsenal host Sporting Lisbon on Thursday. The action on the pitch and away from it is coming thick and fast, so keep it right here as Mirror Football keeps you up to date with all the latest football news. 08:33 Jacob Leeks Haaland achieves rare ratings feat Manchester City superstar Erling Haaland has become just the second player to be given a perfect 10 rating from notoriously harsh French publication L'Equipe. The Norwegian striker achieved the feat as a result of his remarkable performance against Red Bull Leipzig on Tuesday night in the Champions League round-of-16 second-leg. In just 63 minutes worth of playing time, Haaland bagged five goals against the German outfit as City ran riot and won 7-0 on the night, 8-1 on aggregate. An overwhelming amount of elite-level players go their entire career without being given a perfect 10 rating from L'Equipe, but this is already Haaland's second this season. The first came after the Manchester derby at the Etihad last October in a clash that City won 6-3 and saw their talismanic forward score a hat-trick and assist two. Click here to read the full story. 08:18 Jacob Leeks Madrid sent Liverpool comeback warning Eder Militao has warned his Real Madrid team-mates that their Champions League round of 16 tie with Liverpool ain’t over till the fat lady sings. The Spanish giants thrashed Jurgen Klopp’s men 5-2 in the first leg at Anfield with two goals each from Vinicius Junior and Karim Benzema cushioning Militao’s strike. But despite their three-goal lead, Militao insists he and his pals will be taking nothing for granted against a side who have proved time and again in Europe and at home that they can score goals for fun and produce heroic comebacks when they need to. In 2005, of course, Liverpool won the Champions League final on penalties against AC Milan after trailing 3-0 at half-time. And perhaps more pertinently, they beat Barcelona in the 2020 semi-finals by winning the second leg 4-0 after losing 3-0 in the first leg. Click here to read the full story. 08:02 Jacob Leeks Haaland pokes fun at Carragher and Richards Erling Haaland aimed a jibe at Jamie Carragher and Micah Richards over the duo's goalscoring records as players after netting five times against RB Leipzig . Haaland started for Manchester City on Tuesday evening as Pep Guardiola's men smashed the Bundesliga side 7-0 . The star summer signing scored five of their goals, including a first-half hat-trick, as City stormed into the quarter-finals of the Champions League . Unsurprisingly, the Norwegian was put up to handle the post-match media duties, which included speaking to CBS Sports. Carragher, Richards and Arsenal legend Thierry Henry form the punditry team for the American broadcaster and were in attendance at the Etihad Stadium. Click here to read the full story. 07:42 KEY EVENT Ronaldo punished Cristiano Ronaldo could not contain his fury as he was denied a chance to end his Al-Nassr goal drought during Tuesday afternoon's cup clash against Abha. The superstar striker, 38, has failed to find the back of the net in his last two Saudi Pro League fixtures and was frustrated again during the King Cup quarter-final tie. Sami Al-Najei and Abdullah Al-Khaibari gave Al-Nassr an early two-goal lead but Ronaldo was clearly livid when the referee blew the half-time whistle as he attempted to burst out of his own half on the counter-attack. There had been two minutes of added time earmarked and the referee drew the first half to a close with 47:24 on the clock, so the Manchester United legend could have few complaints about his surging run being cut short. Click here to read the full story. 07:41 Jacob Leeks Liverpool prepare for Madrid ust when you think they might have cracked it, they go and shoot themselves in the foot again. Liverpool's 2022-23 season could probably be best summed up by two things that have happened to them in the past month - one was beating Manchester United 7-0 before losing 1-0 to Bournemouth , and another was going 2-0 up against Real Madrid before going down 5-2 . They still have, in theory, a chance to turn that Madrid tie around, but there has been some disappointing news for the squad as they head to Spanish capital on Tuesday. Click here to see what we spotted from training and the airport. 07:40 KEY EVENT Haaland breaks Messi record Erling Haaland has become the youngest player to score 30 Champions League goals on his way to scoring a remarkable five in Manchester City's Champions League clash with RB Leipzig. The Norwegian's third was his 30th in the competition, a tally he has brought up in just 25 matches and at the age of 22 years and 236 days. Kylian Mbappe previously held that record at 22 years and 352 days, placing the pair way ahead of Cristiano Ronaldo and Lionel Messi , who got his 30 in 48 games. Click here to read the full story. 07:38 Jacob Leeks Good morning Good morning and welcome to the Mirror's live blog for all the latest football news. 22:50 Freddie Keighley That's all for today Thank you for joining us for another day of live football news coverage. It's been an extraordinary evening of Champions League action, with Manchester City scoring seven past RB Leipzig and Erling Haaland grabbing for five of those goals. Inter Milan made harder work of their tie against Porto but a goalless draw was enough for them to reach the quarter-finals thanks to their 1-0 lead from the first leg. We'll be back bright and early on Wednesday morning for more live coverage. See you then! 22:35 John Cross John Cross reports from historic Man City victory Erling Haaland sent a message of intent to the rest of Europe on a night of goalscoring records. Haaland got five goals in total, beat RB Leipzig almost on his own and might have hit double figures had he not been substituted to a standing ovation with 27 minutes left. It almost felt as if Pep Guardiola was taking pity on Leipzig by taking off Haaland before he could inflict more humiliation in what was supposed to be a tight last-16 Champions League tie. In the end, Haaland made it look like men against boys. He was bigger, better and more deadly than every other player on the pitch. It was embarrassingly one-sided. Haaland became only the third player - after Lionel Messi for Barcelona in 2012 and Luiz Adriano for Shakhtar Donetsk in 2014 - to score five goals in a single Champions League game. Erling Haaland of Manchester City ( Image: Alex Livesey - Danehouse/Getty Images) 22:15 Mark Jones Haaland shatters records Erling Haaland has become the youngest player to score 30 Champions League goals on his way to scoring a remarkable five in Manchester City's Champions League clash with RB Leipzig. The Norwegian's third was his 30th in the competition, a tally he has brought up in just 25 matches and at the age of 22 years and 236 days. Kylian Mbappe previously held that record at 22 years and 352 days, placing the pair way ahead of Cristiano Ronaldo and Lionel Messi, who got his 30 in 48 games. Full-time KEY EVENT FULL-TIME: MAN CITY 7-0 LEIPZIG (8-1 agg.) The referee has brought the Erling Haaland show to an end at the Etihad Stadium. Manchester City cruise through to the Champions League quarter-finals with one of the most dominant performances seen in European competition in recent years. This was a comprehensive team performance from the hosts, but Haaland will grab the headlines after a truly astonishing display. Kevin De Bruyne was also world class throughout the second leg and scored the goal his performance deserved in the dying seconds. Read the talking points from the fixture by clicking the link below. 57' KEY EVENT MAN CITY 6-0 LEIPZIG (7-1 agg.) Who else but Erling Haaland! This is one of the greatest individual performances seen on Europe's grandest stage this season and his name rings around the stadium. It's another poacher's goal as he instinctively lashes into sidenetting after the RB Leipzig goalkeeper parries the ball into his path. We are witnessing greatness. 54' KEY EVENT MAN CITY 5-0 LEIPZIG (6-1 agg.) It's getting embarrassing for RB Leipzig - but the Etihad faithful don't mind! Erling Haaland adds his fourth of the night with a drilled finish following a scramble in the box to grab his 38th goal of the season, matching the record goalscoring season for a Manchester City player in the process. The other teams who remain in the Champions League should be very, very worried indeed. 49' KEY EVENT MAN CITY 4-0 LEIPZIG (5-1 agg.) Manchester City are running riot! It takes a matter of minutes for the Sky Blues to add their fourth of the night after a sweeping move which scythed through the RB Leipzig defence. This time it's Ilkay Gundogan who converts for the hosts, brushing into the bottom corner to leave City fans dreaming of who they will face in the quarter-finals. Half-time KEY EVENT HALF-TIME: MAN CITY 3-0 LEIPZIG (4-1 agg.) That's surely Mancehster City through to the quarter-finals! It's an Erling Haaland hat-trick as he bundles the ball over the line after Ruben Dias' header from a corner hits the post and dribbles across the goalmouth. The hosts were rampant throughout the first half and, although Ederson was lucky to avoid punishment for taking out Timo Werner, they are fully deserving of their commanding lead. Erling Haaland of Manchester City celebrates ( Image: Shaun Botterill/Getty Images) 24' KEY EVENT MAN CITY 2-0 LEIPZIG (3-1 agg.) Astonishing! Seconds after the restart, Kevin De Bruyne cannons the ball against the crossbar and Erling Haaland is there to nod in the rebound. Is that the tie all but over? 22' KEY EVENT MAN CITY 1-0 LEIPZIG (2-1 agg.) Erling Haaland gives Manchester City the lead! The Norwegian sensation makes no mistake from the spot after a controversial handball was awarded against Benjamin Henrichs. Haaland buries his penalty into the bottom corner as City claim the aggregate advantage. 1' KEY EVENT We're underway! Manchester City versus RB Leipzig is underway at the Etihad Stadium. The two teams drew 1-1 in the first leg of their Champions League last-16 tie, so things are finely poised in Manchester. The pressure is on City to win their first European crown this season, with Erling Haaland charged with leading them to glory. We'll be bringing you updates from the fixture right here. Build-up Freddie Keighley Man City vs RB Leipzig team news Here is the team news from the Etihad Stadium. Manchester City: Ederson; Nathan Ake, Ruben Dias, Jon Stones, Manuel Akanji ; Rodri, Ilkay Gundogan, Jack Grealish, Kevin De Bruyne, Bernardo Silva; Erling Haaland. RB Leipzig: Janis Blaswich; David Raum Benjamin Henrichs, Willi Orban, Josko Gvardiol, Kevin Kampl; Konrad Laimer, Amadou Haidara, Dominik Szoboszlai, Emil Forsberg; Andre Silva, Timo Werner. 20:05 Dan Marsh Scotland trailblazer calls out abhorrent abuse Zander Murray, Scotland's first openly gay footballer, has called out the \"horrendous\" homophobic abuse he received on social media just hours before the release of his upcoming documentary. Murray, who plays for Scottish League Two side Bonnyrigg Rose, came out as gay back in September and recently teamed up with the BBC for a new documentary to assess what more needs to be done to tackle homophobia in football. But just hours before the series, Zander Murray - Out on the Pitch, aired on the BBC on Monday night, the 31-year-old was forced to respond to homophobic abuse in response to a Twitter post. In response to a user who had posted a derogatory message underneath a tweet Murray had shared applauding a young football fan, the striker said: \"Fully expect some homophobic abuse or hate for bringing out a documentary trying to help people and our game. But to comment under this post!? Horrendous, get a grip.\" 19:44 Colin Millar Qatar exploring takeover of Spanish side Qatar Sports Investments (QSI), chaired by Paris Saint-Germain president Nasser Al-Khelaifi, is exploring the possibility of buying a controlling stake in Spanish club Malaga. It comes amid a group led by Qatari banker Sheikh Jassim bin Hamad Al Thani joining the bidding process to buy Manchester United. The Glazers have pushed back their deadline to complete a sale of the club with the ownership situation at Old Trafford still unclear. The Glazer family are exploring outside investment or a full sale of the club they bought 18 years ago. The Americans are deeply unpopular among the club's fans, with the Red Devils having gone a decade without winning the Premier League title. 19:07 Colin Millar Wright and Ferdinand agree over 'untrustworthy' Liverpool Ian Wright has agreed with Rio Ferdinand that Liverpool will likely miss out on a Premier League top four spot and claimed “you can’t trust” Jurgen Klopp’s side. The Reds lost 1-0 at Bournemouth – who had started the day at the foot of the Premier League – on Saturday, just six days after they'd smashed Manchester United 7-0 at Anfield. It continued a hugely erratic campaign, which has also league defeats against Leeds, Nottingham Forest, Wolves, Brighton and Brentford. Klopp’s side remain in the thick of the race for a top four spot but are languishing in sixth in the standings – six points off fourth-placed Tottenham, who have played one game more. Earlier this week, Ferdinand predicted that they would miss out on a top four spot and Champions League football for next season - and Wright agrees with his fellow pundit. Ian Wright ( Image: Arsenal FC via Getty Images) 18:45 Colin Millar Spurs-linked Enrique received Ronaldo backing Erik ten Hag has already made a significant impact since his appointment at Manchester United - but the Dutchman wasn't everybody's first choice for the job. Prior to his messy exit, Cristiano Ronaldo had his own ideas on who should succeed Ole Gunnar Solskjaer. It was outlined at the time that Luis Enrique was Ronaldo's pick to replace Solskjaer after the Old Trafford hierarchy made the difficult decision to dispense with the Norwegian's services back in November 2021. The former Barcelona chief didn't get the call back then, with United instead opting to install Ralf Rangnick as an interim boss before swooping for Ten Hag back in the summer. However, Enrique is now in pole position to finally land a big Premier League job in the coming months. Luis Enrique ( Image: Angel Martinez - UEFA/UEFA via Getty Images) 18:22 Freddie Keighley Liverpool youngster in sickening clash of heads Liverpool Under-19's European encounter with Sporting Lisbon was marred by a sickening clash of heads which left Ben Doak requiring urgent medical attention. Doak, 17, lined up in attack for the young Reds and collapsed to the ground after leaping for a header and making contact with his Sporting opponent. The teenager initially clutched his head in pain before sinking to the turf, promptly receiving on-pitch treatment from two Liverpool medics. Encouragingly, Doak was able to stand up after the harrowing incident, but he was withdrawn from the fray with just eight minutes played so he could be properly examined. It was the low point of a disappointing afternoon for Liverpool U19, who were eliminated from the UEFA Youth League after Rodrigo Ribeiro scored a second-half winner for Sporting. 17:47 Alan Smith Chelsea set for Club World Cup boost Chelsea will be given an automatic place in the first edition of FIFA’s expanded Club World Cup in the summer of 2025. The governing body have confirmed that the Stamford Bridge side will be involved in the summer tournament because they won the 2021 Champions League - and it is set to result in a payday of at least £25m. Real Madrid, last season’s Champions League winners, and the next two victors will gain spots with eight more UEFA members to join them, likely based on coefficient ranking. The revamped competition will see 32 clubs broken into eight groups of four before reaching a knockout stage. It will take place every four years, although the FIFA president Gianni Infantino said in December that no host has been confirmed. Graham Potter ( Image: Justin Setterfield/Getty Images) 17:33 KEY EVENT Five things spotted as Liverpool travel in search of Madrid miracle Just when you think they might have cracked it, they go and shoot themselves in the foot again. Liverpool's 2022-23 season could probably be best summed up by two things that have happened to them in the past month - one was beating Manchester United 7-0 before losing 1-0 to Bournemouth, and another was going 2-0 up against Real Madrid before going down 5-2. They still have, in theory, a chance to turn that Madrid tie around, but there has been some disappointing news for the squad as they head to Spanish capital on Tuesday. Here's what we spotted from training and the airport. Roberto Firmino of Liverpool ( Image: Liverpool FC via Getty Images) 17:14 Josh O'Brien Ceballos opens up on Arsenal unhappiness Real Madrid midfielder Dani Ceballos has confessed he wanted to leave Arsenal soon after joining the Gunners on loan during Unai Emery's reign as manager. With Emery at the helm, Arsenal landed Ceballos' signature on loan in the summer of 2019. Few Gunners fans could forget his stunning debut against Burnley at home, which saw the Spaniard earn comparisons with Emirates favourite Santi Cazorla after just one game. However, Ceballos failed to truly hit those heights at any other time during his stay in north London and has since confessed he never took to life at Arsenal and wanted to return to the Spanish capital almost immediately, though he admits there were some positives to his stint as a Gunner. Unai Emery talks to Dani Ceballos ( Image: Stuart MacFarlane/Arsenal FC via Getty Images) 16:40 Freddie Keighley Ronaldo's fury in Al-Nassr win Cristiano Ronaldo could not contain his fury as he was denied a chance to end his Al-Nassr goal drought during Tuesday afternoon's cup clash against Abha. The superstar striker, 38, has failed to find the back of the net in his last two Saudi Pro League fixtures and was frustrated again during the King Cup quarter-final tie. Sami Al-Najei and Abdullah Al-Khaibari gave Al-Nassr an early two-goal lead but Ronaldo was clearly livid when the referee blew the half-time whistle as he attempted to burst out of his own half on the counter-attack. He responded to the whistle by gesticulating angrily at the referee before picking up and booting the ball powerfully into the opposition half. Ronaldo's act of petulance was punished with a yellow card, which only incensed him further as he trudged off the pitch towards the tunnel. Cristiano Ronaldo ( Image: Twitter/@SkyFootball) 16:22 Ben Husband Lineker's Twitter change spotted Gary Lineker is back at the BBC but has sent a clear message to bosses using the very words that adorn the walls of the corporation’s headquarters. The 62-year-old’s return to the broadcaster was confirmed on Monday after a weekend of chaos. Lineker had been temporarily suspended by the Beeb in light of social media posts criticising the Conservative government’s Illegal Migration Bill. On Monday, the BBC completed a humbling U-turn with director general Tim Davie confirming Lineker’s return. The ex-Tottenham and Leicester forward thanked fans for their support whilst doubling down on his support of refugees fleeing war and persecution. And although he is now back in his old position, there is clearly some understandable, lingering resentment at the furore whipped up by his employers. In a pointed statement to bosses Lineker has updated his profile picture, with his face mocked up in front of the message outside the BBC’s London headquarters. 16:01 KEY EVENT Ramsey appointed Wales captain New Wales captain Aaron Ramsey relishes the chance to atone for the “hurt” he suffered when stripped of the armband as a youngster. Wales boss Rob Page has named Ramsey as Gareth Bale’s successor following the record scorer’s retirement . Read more here","pubDate":"2023-03-15 07:37:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29461147.ece/ALTERNATES/s615/0_MAIN-Football-news-LIVE-Haaland-breaks-Messi-record-Liverpool-prepare-for-Madrid-Ronaldo-punished.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bombers reshuffle: New boss makes his mark to defuse football department tension","link":"https://www.theage.com.au/sport/afl/bombers-reshuffle-new-boss-makes-his-mark-to-defuse-football-department-tension-20230315-p5csbs.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Sam McClure"],"video_url":null,"description":"Recruiting boss Adrian Dodoro and football chief Josh Mahoney are at the centre of a re-structure at the Bombers.","content":"Essendon CEO Craig Vozzo has stamped his authority on his new club restructuring the football department for its three most important figures. Long-time list manager Adrian Dodoro will now report directly to Vozzo instead of football boss Josh Mahoney, after the new chief executive became aware of growing tension between the pair. Football chief Josh Mahoney and recruiting boss Adrian Dodoro Credit: Getty Images Vozzo’s first three months in the job have allowed him to closely analyse the club and its inner workings, with a particularly close eye on the football department. It’s no secret across the competition that Mahoney and Dodoro have endured a frosty relationship in their short time at Tullamarine together. So much so that Vozzo has executed a mini-restructure that will see Dodoro report directly to him instead of Mahoney, which had previously been the case. According to a club source, who was not authorised to speak publicly, the decision was made at least in part to alleviate tension between the pair. In a further change, new coach Brad Scott will also answer directly to Vozzo. Under previous chief executive Xavier Campbell, ex-coach Ben Rutten reported to Mahoney. It is rare for a senior coach to report directly to the CEO and not to the head of football. Mahoney will remain in the list management and total player payment groups as part of his executive role. A club spokesperson confirmed the restructure of the football department to The Age but declined to comment further. The Age also put questions to Dodoro and Mahoney about the restructure and their relationship but Dodoro declined to comment and Mahoney did not respond. Brad Scott has had a big impact as he reshapes Essendon. Credit: Artwork: Jamie Brown Club insiders suggest Mahoney is once again considering putting his hand up for the vacant head of football role at the AFL. Mahoney went for the same role two years ago, which was eventually given to his now coach Brad Scott. The AFL will hold off on finding a replacement for Scott until a successor for league CEO Gillon McLachlan is appointed , which league sources believe will happen before round five. Essendon’s recruiting has drawn mixed reviews with the Essendon faithful during 18 seasons without a finals win, with the club’s decisions to trade first round draft picks for the likes of Dylan Shiel and Devon Smith a point of contention. But the recently revamped list has given Essendon fans something to smile about. The addition of elite talent - like Archie Perkins, Harrison Jones and Nik Cox - through the draft has Bombers insiders hopeful the list in solid shape for the long term. Essendon have also had six Rising Star nominees in the last two seasons, which is an impressive haul. As for Scott, it’s been an interesting beginning. Within weeks of getting the job, Scott’s football director Kevin Sheedy, who is still on the board, stated that he’d voted for James Hird. Next, Scott had to watch on as the club’s new chief executive Andrew Thorburn arrived and departed within a 24-hour period. We know from the latest figures from the AFL that the average player salary is now a tick over $400k. We also know that there’s no one better at bending a dollar than a professional athlete. But extra points should be awarded to the players over summer who opted to get a bit more internal support when they moved houses. You see, most clubs have their own truck that they use to store and transport equipment to training and games. But some players figure it can double as a moving van. So, which Carlton player was recently spotted behind the wheel of the club truck? And no, it wasn’t Patrick Cripps. With more than 85,000 people expected to pack into the MCG for Thursday night’s season-opener between Carlton and Richmond, the AFL is expecting bumper crowds across round one. That is, except for Saturday night’s clash between flag fancies Melbourne and the Western Bulldogs. According to senior people at the MCC, a crowd of about 50,000 is being forecast for the game between two teams likely to be fighting for top-four positions come season’s end. That’s fewer than the 55,000 expected for Sunday afternoon’s game between Essendon and Hawthorn, who most expert tipsters have finishing at the other end of the ladder. Has the snow season come early?","pubDate":"2023-03-15 07:33:44","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Liverpool comeback warning sounded by Real Madrid star despite 5-2 Champions League lead","link":"https://www.mirror.co.uk/sport/football/news/champions-league-real-madrid-liverpool-29456961","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Hopkinson)"],"video_url":null,"description":"Real Madrid will take a three-goal advantage into the second leg of their last-16 Champions League tie with Liverpool, while they will also be playing in front of their own fans","content":"Eder Militao has warned his Real Madrid team-mates that their Champions League round of 16 tie with Liverpool ain’t over till the fat lady sings. The Spanish giants thrashed Jurgen Klopp’s men 5-2 in the first leg at Anfield with two goals each from Vinicius Junior and Karim Benzema cushioning Militao’s strike. But despite their three-goal lead, Militao insists he and his pals will be taking nothing for granted against a side who have proved time and again in Europe and at home that they can score goals for fun and produce heroic comebacks when they need to. In 2005, of course, Liverpool won the Champions League final on penalties against AC Milan after trailing 3-0 at half-time. And perhaps more pertinently, they beat Barcelona in the 2020 semi-finals by winning the second leg 4-0 after losing 3-0 in the first leg. Trent Alexander-Arnold attempts Real Madrid mind games as Liverpool plot miracle escape Virgil van Dijk branded \"overrated\" and told he \"can't lace\" Premier League duo's boots Their 7-0 victory over Manchester United will still be fresh in the memory for Liverpool as they head out at the Santiago Bernabeu on Wednesday, even though they were beaten 1-0 by Bournemouth in their next Premier League fixture. And if they can race into a 2-0 lead this week as they did in the first leg against Real Madrid, then all of a sudden, the tie has a different complexion altogether. Militao knows that and he knows there’s still a long way to go. He said: “Some people believe this tie is already finished but I am expecting a big night between two of the clubs with the biggest histories in world football. “It’s certain that Real Madrid have a very big advantage but still we must wait another 90 minutes and the round is not closed. In previous editions of the Champions League, we have experienced situations that have been right on the limit and we know they were lessons for us. Eder Militao has warned his Real Madrid team-mates against complacency ( Image: David S. Bustamante/Soccrates/Getty Images) “Liverpool improved in the last matches and we saw the game against Manchester United — they were spectacular. We expect a different Liverpool in Madrid than the one we faced at Anfield because they need to take risks to score goals, but our challenge is to play such a match that no one remembers our 5-2 win at Anfield. “The fact the second leg is in front of our supporters is favourable for us. Liverpool will feel enormous pressure and each minute that passes with a goal for them is a success for us. Real have suffered problems with winning and scoring goals since our win in Liverpool but I am totally convinced this will change this week at the Santiago Bernabeu.” Can Liverpool pull off another miraculous European comeback? Have your say in the comments. Eder Militao relished his experience at Anfield in February ( Image: David S. Bustamante/Soccrates/Getty Images) Militao loved his evening at Anfield last month. He added: “The night in Liverpool was one of the most historic in my sporting life — to win 5-2 there and score is a unique moment for any footballer. “But Liverpool have a super squad and now we do not want to be surprised at home. Mo Salah has come into a good moment in attack. He is always dangerous and against us he is hyper-motivated, and also Roberto Firmino is scoring goals again. “So until the end of this match, nothing has been decided.”","pubDate":"2023-03-15 07:30:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29457073.ece/ALTERNATES/s615/0_GettyImages-1232706728.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Glentoran fourth as late Danny Purkis strike stuns Ballymena United","link":"https://www.belfasttelegraph.co.uk/sport/football/irish-league/glentoran-fourth-as-late-danny-purkis-strike-stuns-ballymena-united/874453782.html","keywords":null,"creator":null,"video_url":null,"description":"Danny Purkis last night spared Glentoran blushes by nicking a last gasp winner against gutsy Ballymena United at the BetMcLean Oval — but it wasn’t pretty stuff.","content":"Although Rodney McAree’s boys moved up to fourth place in the Danske Bank Premiership table with the 1-0 win, they still trail runaway leaders Larne by a whopping 11 points. It was only Glentoran’s second win in six outings, but an improvement on their weekend contribution when they were humbled at home by Glenavon which led to manager Rodney McAree and his team being booed off at the finish. Ballymena’s season appears to be slipping away on a weekly basis. They now haven’t won a League game in their last 10 outings, having picked up only three points in that depressing run. Even a seventh placed finish — that could possibly earn a place in the European qualifier — is now rapidly disappearing into over the horizon for the beleaguered Sky Blues. McAree made four changes to the team after that calamity bringing in goalkeeper Ollie Webber, skipper Marcus Kane, Danny Purkis and Niall McGinn. United chief David Jeffrey also reshaped his side, making four changes to the side that crashed to Coleraine, handing Ross Redman, Dougie Wilson, Ryan Waide and Mikey Place starting shirts. Glentoran were only inches away from taking the lead on seven minutes. Conor McMenamin picked up a pass from Rhys Marshall on the right, skipped inside only to see his low curling drive fizz past the post. They threatened again with McGinn whipping in a clever delivery from the right which was met by the towering Aidan Wilson, who could only head into the gloves of Jordan Williamson. Wilson then got back to do what he does best in defence. In an enterprising move on the right, Sean Graham picked out the lively Davy McDaid and, as he pulled the trigger, the big Scot got in a telling block. McDaid was then presented with a glorious chance on 23 minutes. Kenny Kane’s cross was totally miscued by defender Rhys Marshall and when the ball fell to the diminutive striker, he could only drill his shot wide. United grew into the game and, in another impressive move on the right on 38 minutes, Graham sent Kane hurtling through the middle only to hoof his shot just over. Both sides created chances early after the restart. James Singleton’s piercing dash forward opened up a chance for McGinn, whose shot was bravely blocked by teenage centre-back Craig Farquhar. Glentoran missed a glorious chance just before the hour. McMenamin’s pin-point cross found Purkis, who headed across goal, neither Singleton nor McGinn could convert from two yards at the back post. It was Purkis who broke the deadlock on 88 minutes, picking up a clever pass from substitute Shay McCartan before rifling low past Williamson. GLENTORAN: Webber, Marshall, L McCullough, Wilson, Kane (McCartan 68), Devlin (J Donnelly 83), Singleton, Burns, McMenamin, Purkis, McGinn (Wightman 74). Subs not used: A Henderson, R Donnelly, Crowe, Junior. BALLYMENA UNITED: Williamson, Nelson (Gibson 90), Redman, D Wilson, McDaid, Waide (McCullough 70, K Kane, McVarnock, Graham, Place (McGrory 74), Farquhar. Subs not used: J Henderson, Tipton, Tennant, Clarke. REFEREE: Evan Boyce. Man of the match: Craig Farquhar. Match rating 4/10.","pubDate":"2023-03-15 07:10:00","image_url":"https://s3.eu-west-1.amazonaws.com/prod-mh-ireland/70a78722-f2cd-4304-b380-940bf9a75baf/6715fbb9-d6f9-4653-a8d0-2ba1156962d4/ran%20v%20Ballymena_029.jpg","source_id":"belfasttelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"What channel is Real Madrid vs Liverpool? Kick-off time, TV and live stream details","link":"https://www.mirror.co.uk/sport/football/news/liverpool-real-madrid-tv-channel-29457135","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Daniel Orme)"],"video_url":null,"description":"Liverpool have a mountain to climb on Wednesday evening as they aim to reach the quarter-finals of the Champions League against Real Madrid having endured a nightmare first-leg at Anfield","content":"Liverpool have their work cut out on Wednesday evening if they want to reach the quarter-finals of the Champions League against Real Madrid . The Reds travel to the Santiago Bernabeu in midweek aiming to overcome a three-goal deficit from the first-leg. Jurgen Klopp ’s men had initially raced into a two-goal lead during the first-leg on Merseyside but ended up losing 5-2 with Vinicius Jr and Karim Benzema both scoring braces . Since that reverse, the Reds have put together a hugely inconsistent run of results. They at first stumbled to a 0-0 draw with Crystal Palace before overcoming Wolves 2-0. Jamie Carragher makes his feelings clear on Rio Ferdinand's \"small club\" Liverpool claim Trent Alexander-Arnold attempts Real Madrid mind games as Liverpool plot miracle escape They then racked up one of the most memorable results in their history by thumping fierce rivals Manchester United 7-0 . Despite initially looking as though they’d managed to turn a corner, they then fell to a 1-0 defeat to relegation contenders Bournemouth . Elsewhere, Real Madrid only have one win in their last four matches in all competitions since their dominant victory at Anfield - that coming in their most recent outing in the form of a 3-1 success against Espanyol. Away from that, the Reds have a few injury worries to contend with should they want to progress. Thiago Alcantara , Luis Diaz and Joe Gomez are all ruled out ahead of the trip to Madrid. Naby Keita could potentially return to contention after previously suffering with a muscle injury. Yossi Benayoun was the last Liverpool player to score a winning goal against Real Madrid at the Bernabeu ( Image: Getty Images) What are your predictions for Real Madrid vs Liverpool? Share your thoughts in the comments below Carlo Ancelotti also has a number of problems to overcome. Benzema has been suffering with an ankle injury over recent weeks but should be okay to return for the second leg. There is less promising news over Ferland Mendy and David Alaba though who appear unlikely to play against the Reds in any capacity. If Liverpool hope to progress, they will need to do something that they have managed to only ever achieve once - winning at the Bernabeu. They last won 1-0 in February 2009 - Yossi Benayoun netting the winning goal. Their previous trip to the Bernabeu itself saw them lose 1-0 after Brendan Rodgers fielded a much-changed line-up. Liverpool are falling into familiar Robin Hood territory under Jurgen Klopp Rio Ferdinand slams Liverpool over \"small-club mentality\" and calls out Jamie Carragher When is Real Madrid vs Liverpool? The game takes place at the Santiago Bernabeu on Wednesday, March 15. Kick-off is scheduled for 8pm GMT. How can I watch the game? The game itself will be broadcast on BT Sport 1 and BT Sport Ultimate. Alternatively, subscribers can tune in via the BT Sport Website or app. Latest odds Real Madrid - 5/4 Draw - 3/1 Liverpool - 7/4 Odds provided by Betfair. 18+, UK customers only, T&Cs apply","pubDate":"2023-03-15 07:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29457258.ece/ALTERNATES/s615/0_GettyImages-1247377923.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sir Alex Ferguson signed star who could’ve been “best in the world” but he “didn’t care”","link":"https://www.mirror.co.uk/sport/football/news/man-united-alex-ferguson-anderson-29453812","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Ben Husband)"],"video_url":null,"description":"Manchester United welcomed their fair share of superstars to Old Trafford during Sir Alex Ferguson's historic tenure, but there were also a number of high-profile transfer misses","content":"Sir Alex Ferguson openly admits that his decision to sign Owen Hargreaves in the summer of 2007, was the most disappointing of his legendary Manchester United career. The England midfielder arrived off the back of an impressive World Cup campaign 12 months earlier and a reputation enhanced thanks to his time at Bayern Munich. But chronic injury issues meant he never truly established himself at Old Trafford, leading to Ferguson’s non-too-flattering verdict on his transfer. But there are similar regrets about a player signed in the same week as the combative midfielder. Anderson arrived in English football with the tag of one of Brazil’s most exciting talents. Ralf Rangnick’s first Man Utd signing still waiting for appearance under Erik ten Hag Rio Ferdinand tells Man Utd duo they need to start copying Arsenal sensation Just two years previous, the central midfielder had been crowned the player of the tournament in the under-17 World Cup. At just 18, he was already involved in the senior Brazil side and was expected to be a key part of the Selecao’s plans moving forward. United stumped up £27million to sign Anderson from FC Porto, fending off Real Madrid and Chelsea in the process. But despite winning four Premier League titles and a Champions League crown, he never really delivered on his promise. And when his career ended prematurely aged just 31, it culminated as a major ‘what if’ not only for Anderson, but for Manchester United as a whole. Ferguson didn’t get too much wrong in the transfer market and those at the club think he would have got it spot on with Anderson - if only his attitude had been right. Anderson won a host of trophies at Man Utd but didn't truly deliver on his potential ( Image: Corbis via Getty Images) \"He could have been the best player in the world at one point, I promise you he could have,\" ex-United keeper Ben Foster told the UTD Podcast last year. \"Everybody would say that he could have been the best in the world at one point. \"But he just didn't care, he didn't care about anything. Honestly, he didn't care about anything [laughs]. But you put him on a pitch and he was like that. Carlos Tevez was the same sort of thing. Put him on the pitch and oh my god. There has got to be something in being South American, there's got to be something in that.\" That was a verdict which quickly bled into the coaching staff, with Ferguson’s trusted confidante Mick Clegg admitting that anger towards the talented South American even made its way to the boss himself. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. “Anderson was one. You could never find a nicer person, he was popular with everyone but he was a lazy bleeder,” Clegg told the Athletic. “He always had his excuses. I used to have a stick and I said to Alex Ferguson very early on, if he carries on, I'm going to hit him with my bleeding stick. “Fergie couldn't believe it. 'Don't you dare. He cost me a lot of money. You can't be hitting one of my players, are you mad?' “Then, six weeks later, Fergie came to find me. 'Where's that bloody stick? Give me that stick. I want to hit him'.” Clegg added that Anderson could have been “an absolute stormer of a player” but rather than apply himself properly, he decided to not put in the world and became a “party animal.\" He would leave United 2015 after making almost 200 appearances for the club. He then had a short spell in Brazil, before returning to Europe to play in Turkey. However, that adventure was only a fleeting one and he hung up his boots in September 2020, with a boatload of regrets riding off into the sunset with him.","pubDate":"2023-03-15 07:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article28891966.ece/ALTERNATES/s615/0_Sir-Alex-Ferguson-Manchester-Uniteds-Scottish-manager.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Jamie Carragher can't resist dig at Man Utd after Man City smash seven just like Liverpool","link":"https://www.mirror.co.uk/sport/football/news/liverpool-mancity-manutd-jamie-carragher-29461022","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Daniel Orme)"],"video_url":null,"description":"Liverpool icon Jamie Carragher is still clearly basking in the glory of his former side’s 7-0 thumping of fierce rivals Manchester United and even found a way to bring it up following Manchester City’s Champions League cruise","content":"Jamie Carragher couldn’t help himself from taking a brutal dig at Manchester United as their cross-city rivals Manchester City reached the Champions League quarter-finals in style. Pep Guardiola’s men racked-up a comprehensive 7-0 victory against German side RB Leipzig at the Etihad Stadium on Tuesday. Erling Haaland put on a clinical display of his goalscoring abilities by scoring five, with Ilkay Gundogan and Kevin De Bruyne adding to the stunning scoreline. Victory saw City progress to the last eight courtesy of their 8-1 aggregate win. Carragher was on punditry duty for the game itself but couldn’t resist firing a dig at Man United after their defeat by his former side by the same seven-goal scoreline . Liverpool make final decision over the future of \"incredible\" player Jurgen Klopp loves Fabinho finds the positives in Liverpool's Champions League mission improbable in Madrid Taking to Twitter , he wrote: “Losing 7-0 is a joke!” accompanied by a winky face emoji. It is not the first time that the former defender has jumped at the chance to poke fun at the Red Devils’ heavy defeat . His selfie alongside Gary Neville on the Anfield gantry went viral, whilst he then produced a number of jokes throughout the following days including drinking from a 7Up can live on air. That theme continued with a number of references to the number seven ahead of Chelsea ’s Champions League clash with Borussia Dortmund with legendary former Red Devils’ goalkeeper Peter Schmeichel being the butt of the vast majority of the jibes. Carragher said: \"We’re getting into March, the 7th of March. It feels like these games are cut-throat, like I said, into March on the seventh. How important does it feel being at the Bridge.\" Erling Haaland put on a goalscoring show against RB Leipzig ( Image: Getty Images) Who was your man-of-the-match in Man City's win over RB Leipzig? Share your thoughts in the comments below In attempting to give his assessment, Schmeichel replied: “I've been trying to make sense of this since then. I still have no idea how that can happen, because it shouldn’t happen. I think [Erik] ten Hag has said it – it was embarrassing, it was unprofessional and it can never happen again. So I hope he’s right and I hope he gets things right.\" To which Carragher added: \"Peter, you’ve just called him 'Ten Hag'. It's actually 'Seven Hag!'\" Whilst the former defender certainly enjoyed having his fun with the Liverpool result, he and the Reds were soon brought back down to Earth with a bump following their 1-0 defeat to relegation candidates Bournemouth . They now face arguably one of their toughest tests of the season as they attempt to overcome a three-goal deficit to Real Madrid at the Bernabeu. Liverpool face midfield crisis at Real Madrid as FOUR first-team stars ruled out Liverpool on Gavi transfer alert after unique opportunity presents itself Man City will certainly be aiming to avoid the same fate as the Reds following their own 7-0 win. Guardiola’s men are next back in action on Saturday as they take on Championship side Burnley in the quarter-finals of the FA Cup . The Clarets will be led by City icon Vincent Kompany who will make his first return to the Etihad Stadium as a manager. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-15 06:46:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article29414124.ece/ALTERNATES/s615/0_Jamie-Carragher.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man Utd urged to sign 'next George Best' as Gary Lineker tells fans \"remember the name\"","link":"https://www.mirror.co.uk/sport/football/transfer-news/man-utd-transfers-lineker-kvaratskhelia-29459507","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Freddie Keighley)"],"video_url":null,"description":"Khvicha Kvaratskhelia is the name on every fan's lips after a meteoric rise at Napoli - and one Italy legend believes he could have a George Best-like impact at Manchester United","content":"Manchester United have been told \"the days of George Best will return\" if they splash out to sign Napoli sensation Khvicha Kvaratskhelia. The Georgian winger, 22, has exploded onto the scene this season, grabbing 11 goals and nine assists in his debut Serie A campaign to help his side go 18 points clear top of the table. Few had heard of Kvaratskhelia while he was plying his trade in his homeland, but his electric form means his name is on the lips of fans across Europe. Kvaratskhelia's latest heroics came on Saturday as he opened the scoring with a sublime strike against Atalanta . It was a goal which reminded Napoli manager Luciano Spalletti of the late, great Diego Maradona , while the Italy icon Christian Vieri declared the player could match Best's impact at Old Trafford if he joins the Premier League giants. Man Utd takeover: Glazers in 'standoff' with bidders as latest deadline approaches Casemiro's tears over Man Utd red card explained after Real Madrid comments Speaking on Bobo TV, per Calcio Napoli 1926 , Vieri said: \"The goal he scored was the stuff of madness! If he goes to Manchester United , the days of George Best will return. Kvaratskhelia is the same. I can't wait for Wednesday to see Napoli play.\" Kvaratskhelia will have another chance to showcase his ability in midweek as Napoli take on Eintracht Frankfurt in the second leg of their Champions League last-16 tie. The Italian club have a 2-0 advantage from the first leg as they prepare to welcome their opponents to Diego Armando Maradona Stadium. Kvaratskhelia was not on the scoresheet in Germany but he assisted Giovanni Di Lorenzo's goal, which added to Victor Osimhen's opener, to register yet another goal involvement. Gary Lineker is among the onlookers to have been hugely impressed by the youngster and took to Twitter with typical wittiness to write: \"Remember the name. He's that good that eventually we'll all know how to spell it.\" Should Manchester United sign Khvicha Kvaratskhelia? Have your say in the comments! Khvicha Kvaratskhelia is earning comparisons to footballing legends ( Image: Francesco Pecoraro/Getty Images) George Best scored 179 goals for Manchester United ( Image: TV Times via Getty Images) Spalletti could hardly contain himself as he praised Kvaratskhelia in his press conference after the victory over Atalanta. The player weaved through the defence before smashing into the roof of the net to double Napoli's lead, producing the sort of sublime footwork that Maradona used to dazzle fans with during his time in Italy. \"It was a goal worthy of Maradona, and that is not something I say lightly,\" Spalletti said of Kvaratskhelia's breathtaking goal. \"He has this ability to twist the ball inside out and then get the shot away so quickly. When he looks you in the eye and takes you on, he becomes devastating. This time yes, we can invoke the name of the greatest the world has ever seen.\" Such is the rising Georgian star's prodigious ability, the devout Napoli fan base have affectionately nicknamed him \"Kvaradona\", backing up Spalletti's comments.","pubDate":"2023-03-15 06:30:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29428188.ece/ALTERNATES/s615/0_FILE-Gary-Lineker-To-Step-Back-From-Presenting-BBCs-Match-Of-The-Day.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ex-Man Utd wonderkid dubbed 'next Ryan Giggs' in urgent appeal for career-saving surgery","link":"https://www.mirror.co.uk/sport/football/news/man-utd-ryan-giggs-gribbin-29459936","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Freddie Keighley)"],"video_url":null,"description":"Non-league attacking midfielder Callum Gribbin is crowdfunding to raise money for surgery on his knee just over three years after he was released from Manchester United","content":"Former Manchester United prodigy Callum Gribbin has been forced to fundraise to avoid postponing surgery on a devastating knee injury which could end his career. The attacking midfielder, 24, spent over a decade on the Red Devils' books after joining as a child and drew comparisons to Ryan Giggs as he rose through the academy ranks. He announced himself to the Old Trafford faithful while playing for United's under-13s at Edwin van der Sar's testimonial, shining against Ajax in an exhibition fixture. Due to his precocious dribbling ability and wand of a left foot, Gribbin was likened to club legend Giggs and even impressed Jose Mourinho during his time as United manager. However, he was released in 2019 after injuries hampered his progress and subsequently joined Sheffield United , Barrow and Radcliffe. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. The Salford native moved to United of Manchester - who play in the in seventh tier of English football - in 2022 and featured prominently until he suffered a catastrophic leg injury. Gribbin was on the receiving end of a heavy tackle at Broadhurst Park and needed to be stretchered off while in severe discomfort, with scans showing he had ruptured his anterior cruciate ligament, medial ligament and posterior ligament. Man Utd takeover: Glazers in 'standoff' with bidders as latest deadline approaches Sunderland boss Tony Mowbray warns Man Utd that Amad's body has \"almost shut down\" Rupturing one of these ligaments would rule a player out of action for at least six months, so the extent of his injury has thrown his career into doubt. Gribbin requires urgent surgery to address the issue but the cost of the operation is great and he needs to raise 50 per cent of the sum required, with the Professional Footballers' Association covering the other half of the sum A statement on United of Manchester's website claims Gribbin will be forced to delay his surgery if he does not raise the money by Friday 17 March. The player has already been relying on crowdfunding to provide for his young family while he is sidelined, and it will take up to a year for him to rehabilitate from the surgery, whenever it takes place. Callum Gribbin played at Manchester United at various youth levels but never made a senior appearance ( Image: Vincent Cole) What are your memories of Callum Gribbin at Manchester United? Share yours in the comments. The statement concludes: \"We've done it before, and appreciate that times are hard for everyone, but if you can help by chipping in anything you can afford, no matter how small, it would help Callum through an incredibly tough period in his life - he wouldn't ask for this support himself - but he needs it more than ever.\" Gribbin sent his heartfelt thanks to all those who have donated to his fundraiser on Twitter , writing: \"Thank you so much to everyone who has donated.\" His GoFundMe target of £7,000 has nearly been met as of Tuesday evening, with kind-hearted fans stumping up over £5,900 to help him pay for the surgery he so desperately needs.","pubDate":"2023-03-15 06:15:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29460151.ece/ALTERNATES/s615/0_JS107422981.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Tababaraha Weyn Ee Tottenham Ogol, Salah Oo Liverpool Baxsad Ka Ah & Wararkii Suuqa","link":"https://laacibnet.net/somali/tababaraha-weyn-ee-tottenham-ogol-salah-oo-liverpool-baxsad-ka-ah-wararkii-suuqa/","keywords":["Bundesliga","Ligue 1","Serie A","Suuqa Kala Iibsiga","Wararka Ciyaaraha","Wararka La Liga","Wararka Premier League"],"creator":["Apdihakem Omer Adam"],"video_url":null,"description":"Tottenham ma doonayso inay xagaaga iibiso Harry Kane oo heshiiskiisu 2024 dhacayo xataa haddii uu heshiis kordhin diido. (Sky Sports) Luis Enrique wuu xiisaynayaa shaqada Tottenham haddii uu ka tago kooxdaas tonio Conte. (Times – subscription required) Mohamed Salah ayaa si xoogan uga fikiraya inuu ka tago Liverpool walow uu xagaagii hore uun heshiis kordhin […]","content":"Tottenham ma doonayso inay xagaaga iibiso Harry Kane oo heshiiskiisu 2024 dhacayo xataa haddii uu heshiis kordhin diido. (Sky Sports) Luis Enrique wuu xiisaynayaa shaqada Tottenham haddii uu ka tago kooxdaas tonio Conte. (Times – subscription required) Mohamed Salah ayaa si xoogan uga fikiraya inuu ka tago Liverpool walow uu xagaagii hore uun heshiis kordhin sameeyay, Reds ayaa faa’ido badan iibkiisa ka samayn kara iyadoo PSG saxeexiisa doonayso. (Fichajes – in Spanish) Alexis Mac Allister ayaa xiiso ka helaya kooxo badan oo ay Liverpool iyo Newcastle kamid yihiin xilli uu diyaar u yahay inuu Brighton xagaaga ka tago. (90 Min) Inter Milan madaxeeda fulinta ee Beppe Marotta ayaa sheegay in Romelu Lukaku ku laaban doono Chelsea marka heshiiskiisa amaahda ahi xagaag dhaco. (Sky Sport Italia) Edouard Mendy ayaa wadahadalo heshiis kordhin la yeeshay Chelsea balse labada dhinac wax heshiis ah wali kuma dhawa.(Times – subscription required) Barcelona ayaa doonaysa inay 70 Milyan oo pound ka samayso iibka Frenkie de Jong, wuxuu bartilmaameedka koowaad u yahay Chelsea balse waa inay kula tartanto Man United. (Football Insider) Manchester United heshiis cusub ayay u bandhigaysaa garabkeeda Facundo Pellistri kahor inta aysan xagaaga amaah ku dirin. (Fabrizio Romano) Leeds United ayaa heshiis ay dhammaadka xilli ciyaareedka kula saxeexanayso la gaadhay weeraryahanka Barcelona ee Ilias Akhomach, (Mundo Deportivo – in Spanish) Wolves khadkeeda dhexe ee Ruben Neves bartilmaameed uma aha hadda kaddib Barcelona. (Fichajes – in Spanish) Julian Alvarez ayaa heshiis cusub oo shan sano iyo badh ah la gaadhay kooxdiisa Man City. (Football Insider) Newcastle United ayaa xiisaynaysa daafaca bidix ee Arsenal ee Kieran Tierney balse Gunners ayaa 25 sano jirkaas 35 ilaa 40 Milyan oo pound ku doonaya iibkiisa. (Caught Offside) Liverpool iyo Newcastle ayaa ku tartamaya saxeexa 21 sano jirka khadka dhexe ee Alan Varela oo ka tirsan Boca Juniors. (Football Insider) Paris St-Germain ayaa ka fikiraysa inay heshiis cusub u bandhigto Sergio Ramos, 37 sano jirkaas oo heshiiskiisu xagaaga dhacayo ayaa lala xidhiidhinayay kooxo Sucuudi iyo Maraykan ah. (Sport – in Spanish)","pubDate":"2023-03-15 09:10:19","image_url":null,"source_id":"laacibnet","category":["sports"],"country":["somalia"],"language":"Somali"},{"title":"Football news LIVE - Haaland breaks Messi record, Liverpool prepare for Madrid, Ronaldo punished","link":"https://www.mirror.co.uk/sport/football/news/football-news-live-liverpool-arsenal-29439974","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"The final matches of the Champions League last 16 will take place on Wednesday night, with Liverpool needing a miracle to progress past LaLiga giants Real Madrid","content":"Manchester City cantered into the Champions League quarter-finals after Erling Haaland plundered an extraordinary five goals against RB Leipzig . The Norwegian broke several records thanks to his stunning evening, moving past Lionel Messi. Aiming to join their Premier League rivals in the last eight are Liverpool , but the Reds need a miracle to overturn a their 5-2 aggregate deficit to Real Madrid . Elsewhere, Cristiano Ronaldo was punished for a display of frustration as Al-Nassr got their Saudi Pro League title hopes back on track. And Mikel Arteta is weighing up handing Gabriel Jesus his first start since November when Arsenal host Sporting Lisbon on Thursday. The action on the pitch and away from it is coming thick and fast, so keep it right here as Mirror Football keeps you up to date with all the latest football news. 08:33 Jacob Leeks Haaland achieves rare ratings feat Manchester City superstar Erling Haaland has become just the second player to be given a perfect 10 rating from notoriously harsh French publication L'Equipe. The Norwegian striker achieved the feat as a result of his remarkable performance against Red Bull Leipzig on Tuesday night in the Champions League round-of-16 second-leg. In just 63 minutes worth of playing time, Haaland bagged five goals against the German outfit as City ran riot and won 7-0 on the night, 8-1 on aggregate. An overwhelming amount of elite-level players go their entire career without being given a perfect 10 rating from L'Equipe, but this is already Haaland's second this season. The first came after the Manchester derby at the Etihad last October in a clash that City won 6-3 and saw their talismanic forward score a hat-trick and assist two. Click here to read the full story. 08:18 Jacob Leeks Madrid sent Liverpool comeback warning Eder Militao has warned his Real Madrid team-mates that their Champions League round of 16 tie with Liverpool ain’t over till the fat lady sings. The Spanish giants thrashed Jurgen Klopp’s men 5-2 in the first leg at Anfield with two goals each from Vinicius Junior and Karim Benzema cushioning Militao’s strike. But despite their three-goal lead, Militao insists he and his pals will be taking nothing for granted against a side who have proved time and again in Europe and at home that they can score goals for fun and produce heroic comebacks when they need to. In 2005, of course, Liverpool won the Champions League final on penalties against AC Milan after trailing 3-0 at half-time. And perhaps more pertinently, they beat Barcelona in the 2020 semi-finals by winning the second leg 4-0 after losing 3-0 in the first leg. Click here to read the full story. 08:02 Jacob Leeks Haaland pokes fun at Carragher and Richards Erling Haaland aimed a jibe at Jamie Carragher and Micah Richards over the duo's goalscoring records as players after netting five times against RB Leipzig . Haaland started for Manchester City on Tuesday evening as Pep Guardiola's men smashed the Bundesliga side 7-0 . The star summer signing scored five of their goals, including a first-half hat-trick, as City stormed into the quarter-finals of the Champions League . Unsurprisingly, the Norwegian was put up to handle the post-match media duties, which included speaking to CBS Sports. Carragher, Richards and Arsenal legend Thierry Henry form the punditry team for the American broadcaster and were in attendance at the Etihad Stadium. Click here to read the full story. 07:42 KEY EVENT Ronaldo punished Cristiano Ronaldo could not contain his fury as he was denied a chance to end his Al-Nassr goal drought during Tuesday afternoon's cup clash against Abha. The superstar striker, 38, has failed to find the back of the net in his last two Saudi Pro League fixtures and was frustrated again during the King Cup quarter-final tie. Sami Al-Najei and Abdullah Al-Khaibari gave Al-Nassr an early two-goal lead but Ronaldo was clearly livid when the referee blew the half-time whistle as he attempted to burst out of his own half on the counter-attack. There had been two minutes of added time earmarked and the referee drew the first half to a close with 47:24 on the clock, so the Manchester United legend could have few complaints about his surging run being cut short. Click here to read the full story. 07:41 Jacob Leeks Liverpool prepare for Madrid ust when you think they might have cracked it, they go and shoot themselves in the foot again. Liverpool's 2022-23 season could probably be best summed up by two things that have happened to them in the past month - one was beating Manchester United 7-0 before losing 1-0 to Bournemouth , and another was going 2-0 up against Real Madrid before going down 5-2 . They still have, in theory, a chance to turn that Madrid tie around, but there has been some disappointing news for the squad as they head to Spanish capital on Tuesday. Click here to see what we spotted from training and the airport. 07:40 KEY EVENT Haaland breaks Messi record Erling Haaland has become the youngest player to score 30 Champions League goals on his way to scoring a remarkable five in Manchester City's Champions League clash with RB Leipzig. The Norwegian's third was his 30th in the competition, a tally he has brought up in just 25 matches and at the age of 22 years and 236 days. Kylian Mbappe previously held that record at 22 years and 352 days, placing the pair way ahead of Cristiano Ronaldo and Lionel Messi , who got his 30 in 48 games. Click here to read the full story. 07:38 Jacob Leeks Good morning Good morning and welcome to the Mirror's live blog for all the latest football news. 22:50 Freddie Keighley That's all for today Thank you for joining us for another day of live football news coverage. It's been an extraordinary evening of Champions League action, with Manchester City scoring seven past RB Leipzig and Erling Haaland grabbing for five of those goals. Inter Milan made harder work of their tie against Porto but a goalless draw was enough for them to reach the quarter-finals thanks to their 1-0 lead from the first leg. We'll be back bright and early on Wednesday morning for more live coverage. See you then! 22:35 John Cross John Cross reports from historic Man City victory Erling Haaland sent a message of intent to the rest of Europe on a night of goalscoring records. Haaland got five goals in total, beat RB Leipzig almost on his own and might have hit double figures had he not been substituted to a standing ovation with 27 minutes left. It almost felt as if Pep Guardiola was taking pity on Leipzig by taking off Haaland before he could inflict more humiliation in what was supposed to be a tight last-16 Champions League tie. In the end, Haaland made it look like men against boys. He was bigger, better and more deadly than every other player on the pitch. It was embarrassingly one-sided. Haaland became only the third player - after Lionel Messi for Barcelona in 2012 and Luiz Adriano for Shakhtar Donetsk in 2014 - to score five goals in a single Champions League game. Erling Haaland of Manchester City ( Image: Alex Livesey - Danehouse/Getty Images) 22:15 Mark Jones Haaland shatters records Erling Haaland has become the youngest player to score 30 Champions League goals on his way to scoring a remarkable five in Manchester City's Champions League clash with RB Leipzig. The Norwegian's third was his 30th in the competition, a tally he has brought up in just 25 matches and at the age of 22 years and 236 days. Kylian Mbappe previously held that record at 22 years and 352 days, placing the pair way ahead of Cristiano Ronaldo and Lionel Messi, who got his 30 in 48 games. Full-time KEY EVENT FULL-TIME: MAN CITY 7-0 LEIPZIG (8-1 agg.) The referee has brought the Erling Haaland show to an end at the Etihad Stadium. Manchester City cruise through to the Champions League quarter-finals with one of the most dominant performances seen in European competition in recent years. This was a comprehensive team performance from the hosts, but Haaland will grab the headlines after a truly astonishing display. Kevin De Bruyne was also world class throughout the second leg and scored the goal his performance deserved in the dying seconds. Read the talking points from the fixture by clicking the link below. 57' KEY EVENT MAN CITY 6-0 LEIPZIG (7-1 agg.) Who else but Erling Haaland! This is one of the greatest individual performances seen on Europe's grandest stage this season and his name rings around the stadium. It's another poacher's goal as he instinctively lashes into sidenetting after the RB Leipzig goalkeeper parries the ball into his path. We are witnessing greatness. 54' KEY EVENT MAN CITY 5-0 LEIPZIG (6-1 agg.) It's getting embarrassing for RB Leipzig - but the Etihad faithful don't mind! Erling Haaland adds his fourth of the night with a drilled finish following a scramble in the box to grab his 38th goal of the season, matching the record goalscoring season for a Manchester City player in the process. The other teams who remain in the Champions League should be very, very worried indeed. 49' KEY EVENT MAN CITY 4-0 LEIPZIG (5-1 agg.) Manchester City are running riot! It takes a matter of minutes for the Sky Blues to add their fourth of the night after a sweeping move which scythed through the RB Leipzig defence. This time it's Ilkay Gundogan who converts for the hosts, brushing into the bottom corner to leave City fans dreaming of who they will face in the quarter-finals. Half-time KEY EVENT HALF-TIME: MAN CITY 3-0 LEIPZIG (4-1 agg.) That's surely Mancehster City through to the quarter-finals! It's an Erling Haaland hat-trick as he bundles the ball over the line after Ruben Dias' header from a corner hits the post and dribbles across the goalmouth. The hosts were rampant throughout the first half and, although Ederson was lucky to avoid punishment for taking out Timo Werner, they are fully deserving of their commanding lead. Erling Haaland of Manchester City celebrates ( Image: Shaun Botterill/Getty Images) 24' KEY EVENT MAN CITY 2-0 LEIPZIG (3-1 agg.) Astonishing! Seconds after the restart, Kevin De Bruyne cannons the ball against the crossbar and Erling Haaland is there to nod in the rebound. Is that the tie all but over? 22' KEY EVENT MAN CITY 1-0 LEIPZIG (2-1 agg.) Erling Haaland gives Manchester City the lead! The Norwegian sensation makes no mistake from the spot after a controversial handball was awarded against Benjamin Henrichs. Haaland buries his penalty into the bottom corner as City claim the aggregate advantage. 1' KEY EVENT We're underway! Manchester City versus RB Leipzig is underway at the Etihad Stadium. The two teams drew 1-1 in the first leg of their Champions League last-16 tie, so things are finely poised in Manchester. The pressure is on City to win their first European crown this season, with Erling Haaland charged with leading them to glory. We'll be bringing you updates from the fixture right here. Build-up Freddie Keighley Man City vs RB Leipzig team news Here is the team news from the Etihad Stadium. Manchester City: Ederson; Nathan Ake, Ruben Dias, Jon Stones, Manuel Akanji ; Rodri, Ilkay Gundogan, Jack Grealish, Kevin De Bruyne, Bernardo Silva; Erling Haaland. RB Leipzig: Janis Blaswich; David Raum Benjamin Henrichs, Willi Orban, Josko Gvardiol, Kevin Kampl; Konrad Laimer, Amadou Haidara, Dominik Szoboszlai, Emil Forsberg; Andre Silva, Timo Werner. 20:05 Dan Marsh Scotland trailblazer calls out abhorrent abuse Zander Murray, Scotland's first openly gay footballer, has called out the \"horrendous\" homophobic abuse he received on social media just hours before the release of his upcoming documentary. Murray, who plays for Scottish League Two side Bonnyrigg Rose, came out as gay back in September and recently teamed up with the BBC for a new documentary to assess what more needs to be done to tackle homophobia in football. But just hours before the series, Zander Murray - Out on the Pitch, aired on the BBC on Monday night, the 31-year-old was forced to respond to homophobic abuse in response to a Twitter post. In response to a user who had posted a derogatory message underneath a tweet Murray had shared applauding a young football fan, the striker said: \"Fully expect some homophobic abuse or hate for bringing out a documentary trying to help people and our game. But to comment under this post!? Horrendous, get a grip.\" 19:44 Colin Millar Qatar exploring takeover of Spanish side Qatar Sports Investments (QSI), chaired by Paris Saint-Germain president Nasser Al-Khelaifi, is exploring the possibility of buying a controlling stake in Spanish club Malaga. It comes amid a group led by Qatari banker Sheikh Jassim bin Hamad Al Thani joining the bidding process to buy Manchester United. The Glazers have pushed back their deadline to complete a sale of the club with the ownership situation at Old Trafford still unclear. The Glazer family are exploring outside investment or a full sale of the club they bought 18 years ago. The Americans are deeply unpopular among the club's fans, with the Red Devils having gone a decade without winning the Premier League title. 19:07 Colin Millar Wright and Ferdinand agree over 'untrustworthy' Liverpool Ian Wright has agreed with Rio Ferdinand that Liverpool will likely miss out on a Premier League top four spot and claimed “you can’t trust” Jurgen Klopp’s side. The Reds lost 1-0 at Bournemouth – who had started the day at the foot of the Premier League – on Saturday, just six days after they'd smashed Manchester United 7-0 at Anfield. It continued a hugely erratic campaign, which has also league defeats against Leeds, Nottingham Forest, Wolves, Brighton and Brentford. Klopp’s side remain in the thick of the race for a top four spot but are languishing in sixth in the standings – six points off fourth-placed Tottenham, who have played one game more. Earlier this week, Ferdinand predicted that they would miss out on a top four spot and Champions League football for next season - and Wright agrees with his fellow pundit. Ian Wright ( Image: Arsenal FC via Getty Images) 18:45 Colin Millar Spurs-linked Enrique received Ronaldo backing Erik ten Hag has already made a significant impact since his appointment at Manchester United - but the Dutchman wasn't everybody's first choice for the job. Prior to his messy exit, Cristiano Ronaldo had his own ideas on who should succeed Ole Gunnar Solskjaer. It was outlined at the time that Luis Enrique was Ronaldo's pick to replace Solskjaer after the Old Trafford hierarchy made the difficult decision to dispense with the Norwegian's services back in November 2021. The former Barcelona chief didn't get the call back then, with United instead opting to install Ralf Rangnick as an interim boss before swooping for Ten Hag back in the summer. However, Enrique is now in pole position to finally land a big Premier League job in the coming months. Luis Enrique ( Image: Angel Martinez - UEFA/UEFA via Getty Images) 18:22 Freddie Keighley Liverpool youngster in sickening clash of heads Liverpool Under-19's European encounter with Sporting Lisbon was marred by a sickening clash of heads which left Ben Doak requiring urgent medical attention. Doak, 17, lined up in attack for the young Reds and collapsed to the ground after leaping for a header and making contact with his Sporting opponent. The teenager initially clutched his head in pain before sinking to the turf, promptly receiving on-pitch treatment from two Liverpool medics. Encouragingly, Doak was able to stand up after the harrowing incident, but he was withdrawn from the fray with just eight minutes played so he could be properly examined. It was the low point of a disappointing afternoon for Liverpool U19, who were eliminated from the UEFA Youth League after Rodrigo Ribeiro scored a second-half winner for Sporting. 17:47 Alan Smith Chelsea set for Club World Cup boost Chelsea will be given an automatic place in the first edition of FIFA’s expanded Club World Cup in the summer of 2025. The governing body have confirmed that the Stamford Bridge side will be involved in the summer tournament because they won the 2021 Champions League - and it is set to result in a payday of at least £25m. Real Madrid, last season’s Champions League winners, and the next two victors will gain spots with eight more UEFA members to join them, likely based on coefficient ranking. The revamped competition will see 32 clubs broken into eight groups of four before reaching a knockout stage. It will take place every four years, although the FIFA president Gianni Infantino said in December that no host has been confirmed. Graham Potter ( Image: Justin Setterfield/Getty Images) 17:33 KEY EVENT Five things spotted as Liverpool travel in search of Madrid miracle Just when you think they might have cracked it, they go and shoot themselves in the foot again. Liverpool's 2022-23 season could probably be best summed up by two things that have happened to them in the past month - one was beating Manchester United 7-0 before losing 1-0 to Bournemouth, and another was going 2-0 up against Real Madrid before going down 5-2. They still have, in theory, a chance to turn that Madrid tie around, but there has been some disappointing news for the squad as they head to Spanish capital on Tuesday. Here's what we spotted from training and the airport. Roberto Firmino of Liverpool ( Image: Liverpool FC via Getty Images) 17:14 Josh O'Brien Ceballos opens up on Arsenal unhappiness Real Madrid midfielder Dani Ceballos has confessed he wanted to leave Arsenal soon after joining the Gunners on loan during Unai Emery's reign as manager. With Emery at the helm, Arsenal landed Ceballos' signature on loan in the summer of 2019. Few Gunners fans could forget his stunning debut against Burnley at home, which saw the Spaniard earn comparisons with Emirates favourite Santi Cazorla after just one game. However, Ceballos failed to truly hit those heights at any other time during his stay in north London and has since confessed he never took to life at Arsenal and wanted to return to the Spanish capital almost immediately, though he admits there were some positives to his stint as a Gunner. Unai Emery talks to Dani Ceballos ( Image: Stuart MacFarlane/Arsenal FC via Getty Images) 16:40 Freddie Keighley Ronaldo's fury in Al-Nassr win Cristiano Ronaldo could not contain his fury as he was denied a chance to end his Al-Nassr goal drought during Tuesday afternoon's cup clash against Abha. The superstar striker, 38, has failed to find the back of the net in his last two Saudi Pro League fixtures and was frustrated again during the King Cup quarter-final tie. Sami Al-Najei and Abdullah Al-Khaibari gave Al-Nassr an early two-goal lead but Ronaldo was clearly livid when the referee blew the half-time whistle as he attempted to burst out of his own half on the counter-attack. He responded to the whistle by gesticulating angrily at the referee before picking up and booting the ball powerfully into the opposition half. Ronaldo's act of petulance was punished with a yellow card, which only incensed him further as he trudged off the pitch towards the tunnel. Cristiano Ronaldo ( Image: Twitter/@SkyFootball) 16:22 Ben Husband Lineker's Twitter change spotted Gary Lineker is back at the BBC but has sent a clear message to bosses using the very words that adorn the walls of the corporation’s headquarters. The 62-year-old’s return to the broadcaster was confirmed on Monday after a weekend of chaos. Lineker had been temporarily suspended by the Beeb in light of social media posts criticising the Conservative government’s Illegal Migration Bill. On Monday, the BBC completed a humbling U-turn with director general Tim Davie confirming Lineker’s return. The ex-Tottenham and Leicester forward thanked fans for their support whilst doubling down on his support of refugees fleeing war and persecution. And although he is now back in his old position, there is clearly some understandable, lingering resentment at the furore whipped up by his employers. In a pointed statement to bosses Lineker has updated his profile picture, with his face mocked up in front of the message outside the BBC’s London headquarters. 16:01 KEY EVENT Ramsey appointed Wales captain New Wales captain Aaron Ramsey relishes the chance to atone for the “hurt” he suffered when stripped of the armband as a youngster. Wales boss Rob Page has named Ramsey as Gareth Bale’s successor following the record scorer’s retirement . Read more here","pubDate":"2023-03-15 07:37:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29461147.ece/ALTERNATES/s615/0_MAIN-Football-news-LIVE-Haaland-breaks-Messi-record-Liverpool-prepare-for-Madrid-Ronaldo-punished.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bombers reshuffle: New boss makes his mark to defuse football department tension","link":"https://www.theage.com.au/sport/afl/bombers-reshuffle-new-boss-makes-his-mark-to-defuse-football-department-tension-20230315-p5csbs.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Sam McClure"],"video_url":null,"description":"Recruiting boss Adrian Dodoro and football chief Josh Mahoney are at the centre of a re-structure at the Bombers.","content":"Essendon CEO Craig Vozzo has stamped his authority on his new club restructuring the football department for its three most important figures. Long-time list manager Adrian Dodoro will now report directly to Vozzo instead of football boss Josh Mahoney, after the new chief executive became aware of growing tension between the pair. Football chief Josh Mahoney and recruiting boss Adrian Dodoro Credit: Getty Images Vozzo’s first three months in the job have allowed him to closely analyse the club and its inner workings, with a particularly close eye on the football department. It’s no secret across the competition that Mahoney and Dodoro have endured a frosty relationship in their short time at Tullamarine together. So much so that Vozzo has executed a mini-restructure that will see Dodoro report directly to him instead of Mahoney, which had previously been the case. According to a club source, who was not authorised to speak publicly, the decision was made at least in part to alleviate tension between the pair. In a further change, new coach Brad Scott will also answer directly to Vozzo. Under previous chief executive Xavier Campbell, ex-coach Ben Rutten reported to Mahoney. It is rare for a senior coach to report directly to the CEO and not to the head of football. Mahoney will remain in the list management and total player payment groups as part of his executive role. A club spokesperson confirmed the restructure of the football department to The Age but declined to comment further. The Age also put questions to Dodoro and Mahoney about the restructure and their relationship but Dodoro declined to comment and Mahoney did not respond. Brad Scott has had a big impact as he reshapes Essendon. Credit: Artwork: Jamie Brown Club insiders suggest Mahoney is once again considering putting his hand up for the vacant head of football role at the AFL. Mahoney went for the same role two years ago, which was eventually given to his now coach Brad Scott. The AFL will hold off on finding a replacement for Scott until a successor for league CEO Gillon McLachlan is appointed , which league sources believe will happen before round five. Essendon’s recruiting has drawn mixed reviews with the Essendon faithful during 18 seasons without a finals win, with the club’s decisions to trade first round draft picks for the likes of Dylan Shiel and Devon Smith a point of contention. But the recently revamped list has given Essendon fans something to smile about. The addition of elite talent - like Archie Perkins, Harrison Jones and Nik Cox - through the draft has Bombers insiders hopeful the list in solid shape for the long term. Essendon have also had six Rising Star nominees in the last two seasons, which is an impressive haul. As for Scott, it’s been an interesting beginning. Within weeks of getting the job, Scott’s football director Kevin Sheedy, who is still on the board, stated that he’d voted for James Hird. Next, Scott had to watch on as the club’s new chief executive Andrew Thorburn arrived and departed within a 24-hour period. We know from the latest figures from the AFL that the average player salary is now a tick over $400k. We also know that there’s no one better at bending a dollar than a professional athlete. But extra points should be awarded to the players over summer who opted to get a bit more internal support when they moved houses. You see, most clubs have their own truck that they use to store and transport equipment to training and games. But some players figure it can double as a moving van. So, which Carlton player was recently spotted behind the wheel of the club truck? And no, it wasn’t Patrick Cripps. With more than 85,000 people expected to pack into the MCG for Thursday night’s season-opener between Carlton and Richmond, the AFL is expecting bumper crowds across round one. That is, except for Saturday night’s clash between flag fancies Melbourne and the Western Bulldogs. According to senior people at the MCC, a crowd of about 50,000 is being forecast for the game between two teams likely to be fighting for top-four positions come season’s end. That’s fewer than the 55,000 expected for Sunday afternoon’s game between Essendon and Hawthorn, who most expert tipsters have finishing at the other end of the ladder. Has the snow season come early?","pubDate":"2023-03-15 07:33:44","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Liverpool comeback warning sounded by Real Madrid star despite 5-2 Champions League lead","link":"https://www.mirror.co.uk/sport/football/news/champions-league-real-madrid-liverpool-29456961","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Hopkinson)"],"video_url":null,"description":"Real Madrid will take a three-goal advantage into the second leg of their last-16 Champions League tie with Liverpool, while they will also be playing in front of their own fans","content":"Eder Militao has warned his Real Madrid team-mates that their Champions League round of 16 tie with Liverpool ain’t over till the fat lady sings. The Spanish giants thrashed Jurgen Klopp’s men 5-2 in the first leg at Anfield with two goals each from Vinicius Junior and Karim Benzema cushioning Militao’s strike. But despite their three-goal lead, Militao insists he and his pals will be taking nothing for granted against a side who have proved time and again in Europe and at home that they can score goals for fun and produce heroic comebacks when they need to. In 2005, of course, Liverpool won the Champions League final on penalties against AC Milan after trailing 3-0 at half-time. And perhaps more pertinently, they beat Barcelona in the 2020 semi-finals by winning the second leg 4-0 after losing 3-0 in the first leg. Trent Alexander-Arnold attempts Real Madrid mind games as Liverpool plot miracle escape Virgil van Dijk branded \"overrated\" and told he \"can't lace\" Premier League duo's boots Their 7-0 victory over Manchester United will still be fresh in the memory for Liverpool as they head out at the Santiago Bernabeu on Wednesday, even though they were beaten 1-0 by Bournemouth in their next Premier League fixture. And if they can race into a 2-0 lead this week as they did in the first leg against Real Madrid, then all of a sudden, the tie has a different complexion altogether. Militao knows that and he knows there’s still a long way to go. He said: “Some people believe this tie is already finished but I am expecting a big night between two of the clubs with the biggest histories in world football. “It’s certain that Real Madrid have a very big advantage but still we must wait another 90 minutes and the round is not closed. In previous editions of the Champions League, we have experienced situations that have been right on the limit and we know they were lessons for us. Eder Militao has warned his Real Madrid team-mates against complacency ( Image: David S. Bustamante/Soccrates/Getty Images) “Liverpool improved in the last matches and we saw the game against Manchester United — they were spectacular. We expect a different Liverpool in Madrid than the one we faced at Anfield because they need to take risks to score goals, but our challenge is to play such a match that no one remembers our 5-2 win at Anfield. “The fact the second leg is in front of our supporters is favourable for us. Liverpool will feel enormous pressure and each minute that passes with a goal for them is a success for us. Real have suffered problems with winning and scoring goals since our win in Liverpool but I am totally convinced this will change this week at the Santiago Bernabeu.” Can Liverpool pull off another miraculous European comeback? Have your say in the comments. Eder Militao relished his experience at Anfield in February ( Image: David S. Bustamante/Soccrates/Getty Images) Militao loved his evening at Anfield last month. He added: “The night in Liverpool was one of the most historic in my sporting life — to win 5-2 there and score is a unique moment for any footballer. “But Liverpool have a super squad and now we do not want to be surprised at home. Mo Salah has come into a good moment in attack. He is always dangerous and against us he is hyper-motivated, and also Roberto Firmino is scoring goals again. “So until the end of this match, nothing has been decided.”","pubDate":"2023-03-15 07:30:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29457073.ece/ALTERNATES/s615/0_GettyImages-1232706728.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Glentoran fourth as late Danny Purkis strike stuns Ballymena United","link":"https://www.belfasttelegraph.co.uk/sport/football/irish-league/glentoran-fourth-as-late-danny-purkis-strike-stuns-ballymena-united/874453782.html","keywords":null,"creator":null,"video_url":null,"description":"Danny Purkis last night spared Glentoran blushes by nicking a last gasp winner against gutsy Ballymena United at the BetMcLean Oval — but it wasn’t pretty stuff.","content":"Although Rodney McAree’s boys moved up to fourth place in the Danske Bank Premiership table with the 1-0 win, they still trail runaway leaders Larne by a whopping 11 points. It was only Glentoran’s second win in six outings, but an improvement on their weekend contribution when they were humbled at home by Glenavon which led to manager Rodney McAree and his team being booed off at the finish. Ballymena’s season appears to be slipping away on a weekly basis. They now haven’t won a League game in their last 10 outings, having picked up only three points in that depressing run. Even a seventh placed finish — that could possibly earn a place in the European qualifier — is now rapidly disappearing into over the horizon for the beleaguered Sky Blues. McAree made four changes to the team after that calamity bringing in goalkeeper Ollie Webber, skipper Marcus Kane, Danny Purkis and Niall McGinn. United chief David Jeffrey also reshaped his side, making four changes to the side that crashed to Coleraine, handing Ross Redman, Dougie Wilson, Ryan Waide and Mikey Place starting shirts. Glentoran were only inches away from taking the lead on seven minutes. Conor McMenamin picked up a pass from Rhys Marshall on the right, skipped inside only to see his low curling drive fizz past the post. They threatened again with McGinn whipping in a clever delivery from the right which was met by the towering Aidan Wilson, who could only head into the gloves of Jordan Williamson. Wilson then got back to do what he does best in defence. In an enterprising move on the right, Sean Graham picked out the lively Davy McDaid and, as he pulled the trigger, the big Scot got in a telling block. McDaid was then presented with a glorious chance on 23 minutes. Kenny Kane’s cross was totally miscued by defender Rhys Marshall and when the ball fell to the diminutive striker, he could only drill his shot wide. United grew into the game and, in another impressive move on the right on 38 minutes, Graham sent Kane hurtling through the middle only to hoof his shot just over. Both sides created chances early after the restart. James Singleton’s piercing dash forward opened up a chance for McGinn, whose shot was bravely blocked by teenage centre-back Craig Farquhar. Glentoran missed a glorious chance just before the hour. McMenamin’s pin-point cross found Purkis, who headed across goal, neither Singleton nor McGinn could convert from two yards at the back post. It was Purkis who broke the deadlock on 88 minutes, picking up a clever pass from substitute Shay McCartan before rifling low past Williamson. GLENTORAN: Webber, Marshall, L McCullough, Wilson, Kane (McCartan 68), Devlin (J Donnelly 83), Singleton, Burns, McMenamin, Purkis, McGinn (Wightman 74). Subs not used: A Henderson, R Donnelly, Crowe, Junior. BALLYMENA UNITED: Williamson, Nelson (Gibson 90), Redman, D Wilson, McDaid, Waide (McCullough 70, K Kane, McVarnock, Graham, Place (McGrory 74), Farquhar. Subs not used: J Henderson, Tipton, Tennant, Clarke. REFEREE: Evan Boyce. Man of the match: Craig Farquhar. Match rating 4/10.","pubDate":"2023-03-15 07:10:00","image_url":"https://s3.eu-west-1.amazonaws.com/prod-mh-ireland/70a78722-f2cd-4304-b380-940bf9a75baf/6715fbb9-d6f9-4653-a8d0-2ba1156962d4/ran%20v%20Ballymena_029.jpg","source_id":"belfasttelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"What channel is Real Madrid vs Liverpool? Kick-off time, TV and live stream details","link":"https://www.mirror.co.uk/sport/football/news/liverpool-real-madrid-tv-channel-29457135","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Daniel Orme)"],"video_url":null,"description":"Liverpool have a mountain to climb on Wednesday evening as they aim to reach the quarter-finals of the Champions League against Real Madrid having endured a nightmare first-leg at Anfield","content":"Liverpool have their work cut out on Wednesday evening if they want to reach the quarter-finals of the Champions League against Real Madrid . The Reds travel to the Santiago Bernabeu in midweek aiming to overcome a three-goal deficit from the first-leg. Jurgen Klopp ’s men had initially raced into a two-goal lead during the first-leg on Merseyside but ended up losing 5-2 with Vinicius Jr and Karim Benzema both scoring braces . Since that reverse, the Reds have put together a hugely inconsistent run of results. They at first stumbled to a 0-0 draw with Crystal Palace before overcoming Wolves 2-0. Jamie Carragher makes his feelings clear on Rio Ferdinand's \"small club\" Liverpool claim Trent Alexander-Arnold attempts Real Madrid mind games as Liverpool plot miracle escape They then racked up one of the most memorable results in their history by thumping fierce rivals Manchester United 7-0 . Despite initially looking as though they’d managed to turn a corner, they then fell to a 1-0 defeat to relegation contenders Bournemouth . Elsewhere, Real Madrid only have one win in their last four matches in all competitions since their dominant victory at Anfield - that coming in their most recent outing in the form of a 3-1 success against Espanyol. Away from that, the Reds have a few injury worries to contend with should they want to progress. Thiago Alcantara , Luis Diaz and Joe Gomez are all ruled out ahead of the trip to Madrid. Naby Keita could potentially return to contention after previously suffering with a muscle injury. Yossi Benayoun was the last Liverpool player to score a winning goal against Real Madrid at the Bernabeu ( Image: Getty Images) What are your predictions for Real Madrid vs Liverpool? Share your thoughts in the comments below Carlo Ancelotti also has a number of problems to overcome. Benzema has been suffering with an ankle injury over recent weeks but should be okay to return for the second leg. There is less promising news over Ferland Mendy and David Alaba though who appear unlikely to play against the Reds in any capacity. If Liverpool hope to progress, they will need to do something that they have managed to only ever achieve once - winning at the Bernabeu. They last won 1-0 in February 2009 - Yossi Benayoun netting the winning goal. Their previous trip to the Bernabeu itself saw them lose 1-0 after Brendan Rodgers fielded a much-changed line-up. Liverpool are falling into familiar Robin Hood territory under Jurgen Klopp Rio Ferdinand slams Liverpool over \"small-club mentality\" and calls out Jamie Carragher When is Real Madrid vs Liverpool? The game takes place at the Santiago Bernabeu on Wednesday, March 15. Kick-off is scheduled for 8pm GMT. How can I watch the game? The game itself will be broadcast on BT Sport 1 and BT Sport Ultimate. Alternatively, subscribers can tune in via the BT Sport Website or app. Latest odds Real Madrid - 5/4 Draw - 3/1 Liverpool - 7/4 Odds provided by Betfair. 18+, UK customers only, T&Cs apply","pubDate":"2023-03-15 07:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29457258.ece/ALTERNATES/s615/0_GettyImages-1247377923.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sir Alex Ferguson signed star who could’ve been “best in the world” but he “didn’t care”","link":"https://www.mirror.co.uk/sport/football/news/man-united-alex-ferguson-anderson-29453812","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Ben Husband)"],"video_url":null,"description":"Manchester United welcomed their fair share of superstars to Old Trafford during Sir Alex Ferguson's historic tenure, but there were also a number of high-profile transfer misses","content":"Sir Alex Ferguson openly admits that his decision to sign Owen Hargreaves in the summer of 2007, was the most disappointing of his legendary Manchester United career. The England midfielder arrived off the back of an impressive World Cup campaign 12 months earlier and a reputation enhanced thanks to his time at Bayern Munich. But chronic injury issues meant he never truly established himself at Old Trafford, leading to Ferguson’s non-too-flattering verdict on his transfer. But there are similar regrets about a player signed in the same week as the combative midfielder. Anderson arrived in English football with the tag of one of Brazil’s most exciting talents. Ralf Rangnick’s first Man Utd signing still waiting for appearance under Erik ten Hag Rio Ferdinand tells Man Utd duo they need to start copying Arsenal sensation Just two years previous, the central midfielder had been crowned the player of the tournament in the under-17 World Cup. At just 18, he was already involved in the senior Brazil side and was expected to be a key part of the Selecao’s plans moving forward. United stumped up £27million to sign Anderson from FC Porto, fending off Real Madrid and Chelsea in the process. But despite winning four Premier League titles and a Champions League crown, he never really delivered on his promise. And when his career ended prematurely aged just 31, it culminated as a major ‘what if’ not only for Anderson, but for Manchester United as a whole. Ferguson didn’t get too much wrong in the transfer market and those at the club think he would have got it spot on with Anderson - if only his attitude had been right. Anderson won a host of trophies at Man Utd but didn't truly deliver on his potential ( Image: Corbis via Getty Images) \"He could have been the best player in the world at one point, I promise you he could have,\" ex-United keeper Ben Foster told the UTD Podcast last year. \"Everybody would say that he could have been the best in the world at one point. \"But he just didn't care, he didn't care about anything. Honestly, he didn't care about anything [laughs]. But you put him on a pitch and he was like that. Carlos Tevez was the same sort of thing. Put him on the pitch and oh my god. There has got to be something in being South American, there's got to be something in that.\" That was a verdict which quickly bled into the coaching staff, with Ferguson’s trusted confidante Mick Clegg admitting that anger towards the talented South American even made its way to the boss himself. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. “Anderson was one. You could never find a nicer person, he was popular with everyone but he was a lazy bleeder,” Clegg told the Athletic. “He always had his excuses. I used to have a stick and I said to Alex Ferguson very early on, if he carries on, I'm going to hit him with my bleeding stick. “Fergie couldn't believe it. 'Don't you dare. He cost me a lot of money. You can't be hitting one of my players, are you mad?' “Then, six weeks later, Fergie came to find me. 'Where's that bloody stick? Give me that stick. I want to hit him'.” Clegg added that Anderson could have been “an absolute stormer of a player” but rather than apply himself properly, he decided to not put in the world and became a “party animal.\" He would leave United 2015 after making almost 200 appearances for the club. He then had a short spell in Brazil, before returning to Europe to play in Turkey. However, that adventure was only a fleeting one and he hung up his boots in September 2020, with a boatload of regrets riding off into the sunset with him.","pubDate":"2023-03-15 07:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article28891966.ece/ALTERNATES/s615/0_Sir-Alex-Ferguson-Manchester-Uniteds-Scottish-manager.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Jamie Carragher can't resist dig at Man Utd after Man City smash seven just like Liverpool","link":"https://www.mirror.co.uk/sport/football/news/liverpool-mancity-manutd-jamie-carragher-29461022","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Daniel Orme)"],"video_url":null,"description":"Liverpool icon Jamie Carragher is still clearly basking in the glory of his former side’s 7-0 thumping of fierce rivals Manchester United and even found a way to bring it up following Manchester City’s Champions League cruise","content":"Jamie Carragher couldn’t help himself from taking a brutal dig at Manchester United as their cross-city rivals Manchester City reached the Champions League quarter-finals in style. Pep Guardiola’s men racked-up a comprehensive 7-0 victory against German side RB Leipzig at the Etihad Stadium on Tuesday. Erling Haaland put on a clinical display of his goalscoring abilities by scoring five, with Ilkay Gundogan and Kevin De Bruyne adding to the stunning scoreline. Victory saw City progress to the last eight courtesy of their 8-1 aggregate win. Carragher was on punditry duty for the game itself but couldn’t resist firing a dig at Man United after their defeat by his former side by the same seven-goal scoreline . Liverpool make final decision over the future of \"incredible\" player Jurgen Klopp loves Fabinho finds the positives in Liverpool's Champions League mission improbable in Madrid Taking to Twitter , he wrote: “Losing 7-0 is a joke!” accompanied by a winky face emoji. It is not the first time that the former defender has jumped at the chance to poke fun at the Red Devils’ heavy defeat . His selfie alongside Gary Neville on the Anfield gantry went viral, whilst he then produced a number of jokes throughout the following days including drinking from a 7Up can live on air. That theme continued with a number of references to the number seven ahead of Chelsea ’s Champions League clash with Borussia Dortmund with legendary former Red Devils’ goalkeeper Peter Schmeichel being the butt of the vast majority of the jibes. Carragher said: \"We’re getting into March, the 7th of March. It feels like these games are cut-throat, like I said, into March on the seventh. How important does it feel being at the Bridge.\" Erling Haaland put on a goalscoring show against RB Leipzig ( Image: Getty Images) Who was your man-of-the-match in Man City's win over RB Leipzig? Share your thoughts in the comments below In attempting to give his assessment, Schmeichel replied: “I've been trying to make sense of this since then. I still have no idea how that can happen, because it shouldn’t happen. I think [Erik] ten Hag has said it – it was embarrassing, it was unprofessional and it can never happen again. So I hope he’s right and I hope he gets things right.\" To which Carragher added: \"Peter, you’ve just called him 'Ten Hag'. It's actually 'Seven Hag!'\" Whilst the former defender certainly enjoyed having his fun with the Liverpool result, he and the Reds were soon brought back down to Earth with a bump following their 1-0 defeat to relegation candidates Bournemouth . They now face arguably one of their toughest tests of the season as they attempt to overcome a three-goal deficit to Real Madrid at the Bernabeu. Liverpool face midfield crisis at Real Madrid as FOUR first-team stars ruled out Liverpool on Gavi transfer alert after unique opportunity presents itself Man City will certainly be aiming to avoid the same fate as the Reds following their own 7-0 win. Guardiola’s men are next back in action on Saturday as they take on Championship side Burnley in the quarter-finals of the FA Cup . The Clarets will be led by City icon Vincent Kompany who will make his first return to the Etihad Stadium as a manager. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-15 06:46:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article29414124.ece/ALTERNATES/s615/0_Jamie-Carragher.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man Utd urged to sign 'next George Best' as Gary Lineker tells fans \"remember the name\"","link":"https://www.mirror.co.uk/sport/football/transfer-news/man-utd-transfers-lineker-kvaratskhelia-29459507","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Freddie Keighley)"],"video_url":null,"description":"Khvicha Kvaratskhelia is the name on every fan's lips after a meteoric rise at Napoli - and one Italy legend believes he could have a George Best-like impact at Manchester United","content":"Manchester United have been told \"the days of George Best will return\" if they splash out to sign Napoli sensation Khvicha Kvaratskhelia. The Georgian winger, 22, has exploded onto the scene this season, grabbing 11 goals and nine assists in his debut Serie A campaign to help his side go 18 points clear top of the table. Few had heard of Kvaratskhelia while he was plying his trade in his homeland, but his electric form means his name is on the lips of fans across Europe. Kvaratskhelia's latest heroics came on Saturday as he opened the scoring with a sublime strike against Atalanta . It was a goal which reminded Napoli manager Luciano Spalletti of the late, great Diego Maradona , while the Italy icon Christian Vieri declared the player could match Best's impact at Old Trafford if he joins the Premier League giants. Man Utd takeover: Glazers in 'standoff' with bidders as latest deadline approaches Casemiro's tears over Man Utd red card explained after Real Madrid comments Speaking on Bobo TV, per Calcio Napoli 1926 , Vieri said: \"The goal he scored was the stuff of madness! If he goes to Manchester United , the days of George Best will return. Kvaratskhelia is the same. I can't wait for Wednesday to see Napoli play.\" Kvaratskhelia will have another chance to showcase his ability in midweek as Napoli take on Eintracht Frankfurt in the second leg of their Champions League last-16 tie. The Italian club have a 2-0 advantage from the first leg as they prepare to welcome their opponents to Diego Armando Maradona Stadium. Kvaratskhelia was not on the scoresheet in Germany but he assisted Giovanni Di Lorenzo's goal, which added to Victor Osimhen's opener, to register yet another goal involvement. Gary Lineker is among the onlookers to have been hugely impressed by the youngster and took to Twitter with typical wittiness to write: \"Remember the name. He's that good that eventually we'll all know how to spell it.\" Should Manchester United sign Khvicha Kvaratskhelia? Have your say in the comments! Khvicha Kvaratskhelia is earning comparisons to footballing legends ( Image: Francesco Pecoraro/Getty Images) George Best scored 179 goals for Manchester United ( Image: TV Times via Getty Images) Spalletti could hardly contain himself as he praised Kvaratskhelia in his press conference after the victory over Atalanta. The player weaved through the defence before smashing into the roof of the net to double Napoli's lead, producing the sort of sublime footwork that Maradona used to dazzle fans with during his time in Italy. \"It was a goal worthy of Maradona, and that is not something I say lightly,\" Spalletti said of Kvaratskhelia's breathtaking goal. \"He has this ability to twist the ball inside out and then get the shot away so quickly. When he looks you in the eye and takes you on, he becomes devastating. This time yes, we can invoke the name of the greatest the world has ever seen.\" Such is the rising Georgian star's prodigious ability, the devout Napoli fan base have affectionately nicknamed him \"Kvaradona\", backing up Spalletti's comments.","pubDate":"2023-03-15 06:30:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29428188.ece/ALTERNATES/s615/0_FILE-Gary-Lineker-To-Step-Back-From-Presenting-BBCs-Match-Of-The-Day.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ex-Man Utd wonderkid dubbed 'next Ryan Giggs' in urgent appeal for career-saving surgery","link":"https://www.mirror.co.uk/sport/football/news/man-utd-ryan-giggs-gribbin-29459936","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Freddie Keighley)"],"video_url":null,"description":"Non-league attacking midfielder Callum Gribbin is crowdfunding to raise money for surgery on his knee just over three years after he was released from Manchester United","content":"Former Manchester United prodigy Callum Gribbin has been forced to fundraise to avoid postponing surgery on a devastating knee injury which could end his career. The attacking midfielder, 24, spent over a decade on the Red Devils' books after joining as a child and drew comparisons to Ryan Giggs as he rose through the academy ranks. He announced himself to the Old Trafford faithful while playing for United's under-13s at Edwin van der Sar's testimonial, shining against Ajax in an exhibition fixture. Due to his precocious dribbling ability and wand of a left foot, Gribbin was likened to club legend Giggs and even impressed Jose Mourinho during his time as United manager. However, he was released in 2019 after injuries hampered his progress and subsequently joined Sheffield United , Barrow and Radcliffe. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. The Salford native moved to United of Manchester - who play in the in seventh tier of English football - in 2022 and featured prominently until he suffered a catastrophic leg injury. Gribbin was on the receiving end of a heavy tackle at Broadhurst Park and needed to be stretchered off while in severe discomfort, with scans showing he had ruptured his anterior cruciate ligament, medial ligament and posterior ligament. Man Utd takeover: Glazers in 'standoff' with bidders as latest deadline approaches Sunderland boss Tony Mowbray warns Man Utd that Amad's body has \"almost shut down\" Rupturing one of these ligaments would rule a player out of action for at least six months, so the extent of his injury has thrown his career into doubt. Gribbin requires urgent surgery to address the issue but the cost of the operation is great and he needs to raise 50 per cent of the sum required, with the Professional Footballers' Association covering the other half of the sum A statement on United of Manchester's website claims Gribbin will be forced to delay his surgery if he does not raise the money by Friday 17 March. The player has already been relying on crowdfunding to provide for his young family while he is sidelined, and it will take up to a year for him to rehabilitate from the surgery, whenever it takes place. Callum Gribbin played at Manchester United at various youth levels but never made a senior appearance ( Image: Vincent Cole) What are your memories of Callum Gribbin at Manchester United? Share yours in the comments. The statement concludes: \"We've done it before, and appreciate that times are hard for everyone, but if you can help by chipping in anything you can afford, no matter how small, it would help Callum through an incredibly tough period in his life - he wouldn't ask for this support himself - but he needs it more than ever.\" Gribbin sent his heartfelt thanks to all those who have donated to his fundraiser on Twitter , writing: \"Thank you so much to everyone who has donated.\" His GoFundMe target of £7,000 has nearly been met as of Tuesday evening, with kind-hearted fans stumping up over £5,900 to help him pay for the surgery he so desperately needs.","pubDate":"2023-03-15 06:15:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29460151.ece/ALTERNATES/s615/0_JS107422981.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Tababaraha Weyn Ee Tottenham Ogol, Salah Oo Liverpool Baxsad Ka Ah & Wararkii Suuqa","link":"https://laacibnet.net/somali/tababaraha-weyn-ee-tottenham-ogol-salah-oo-liverpool-baxsad-ka-ah-wararkii-suuqa/","keywords":["Bundesliga","Ligue 1","Serie A","Suuqa Kala Iibsiga","Wararka Ciyaaraha","Wararka La Liga","Wararka Premier League"],"creator":["Apdihakem Omer Adam"],"video_url":null,"description":"Tottenham ma doonayso inay xagaaga iibiso Harry Kane oo heshiiskiisu 2024 dhacayo xataa haddii uu heshiis kordhin diido. (Sky Sports) Luis Enrique wuu xiisaynayaa shaqada Tottenham haddii uu ka tago kooxdaas tonio Conte. (Times – subscription required) Mohamed Salah ayaa si xoogan uga fikiraya inuu ka tago Liverpool walow uu xagaagii hore uun heshiis kordhin […]","content":"Tottenham ma doonayso inay xagaaga iibiso Harry Kane oo heshiiskiisu 2024 dhacayo xataa haddii uu heshiis kordhin diido. (Sky Sports) Luis Enrique wuu xiisaynayaa shaqada Tottenham haddii uu ka tago kooxdaas tonio Conte. (Times – subscription required) Mohamed Salah ayaa si xoogan uga fikiraya inuu ka tago Liverpool walow uu xagaagii hore uun heshiis kordhin sameeyay, Reds ayaa faa’ido badan iibkiisa ka samayn kara iyadoo PSG saxeexiisa doonayso. (Fichajes – in Spanish) Alexis Mac Allister ayaa xiiso ka helaya kooxo badan oo ay Liverpool iyo Newcastle kamid yihiin xilli uu diyaar u yahay inuu Brighton xagaaga ka tago. (90 Min) Inter Milan madaxeeda fulinta ee Beppe Marotta ayaa sheegay in Romelu Lukaku ku laaban doono Chelsea marka heshiiskiisa amaahda ahi xagaag dhaco. (Sky Sport Italia) Edouard Mendy ayaa wadahadalo heshiis kordhin la yeeshay Chelsea balse labada dhinac wax heshiis ah wali kuma dhawa.(Times – subscription required) Barcelona ayaa doonaysa inay 70 Milyan oo pound ka samayso iibka Frenkie de Jong, wuxuu bartilmaameedka koowaad u yahay Chelsea balse waa inay kula tartanto Man United. (Football Insider) Manchester United heshiis cusub ayay u bandhigaysaa garabkeeda Facundo Pellistri kahor inta aysan xagaaga amaah ku dirin. (Fabrizio Romano) Leeds United ayaa heshiis ay dhammaadka xilli ciyaareedka kula saxeexanayso la gaadhay weeraryahanka Barcelona ee Ilias Akhomach, (Mundo Deportivo – in Spanish) Wolves khadkeeda dhexe ee Ruben Neves bartilmaameed uma aha hadda kaddib Barcelona. (Fichajes – in Spanish) Julian Alvarez ayaa heshiis cusub oo shan sano iyo badh ah la gaadhay kooxdiisa Man City. (Football Insider) Newcastle United ayaa xiisaynaysa daafaca bidix ee Arsenal ee Kieran Tierney balse Gunners ayaa 25 sano jirkaas 35 ilaa 40 Milyan oo pound ku doonaya iibkiisa. (Caught Offside) Liverpool iyo Newcastle ayaa ku tartamaya saxeexa 21 sano jirka khadka dhexe ee Alan Varela oo ka tirsan Boca Juniors. (Football Insider) Paris St-Germain ayaa ka fikiraysa inay heshiis cusub u bandhigto Sergio Ramos, 37 sano jirkaas oo heshiiskiisu xagaaga dhacayo ayaa lala xidhiidhinayay kooxo Sucuudi iyo Maraykan ah. (Sport – in Spanish)","pubDate":"2023-03-15 09:10:19","image_url":null,"source_id":"laacibnet","category":["sports"],"country":["somalia"],"language":"Somali"},{"title":"Football news LIVE - Haaland breaks Messi record, Liverpool prepare for Madrid, Ronaldo punished","link":"https://www.mirror.co.uk/sport/football/news/football-news-live-liverpool-arsenal-29439974","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"The final matches of the Champions League last 16 will take place on Wednesday night, with Liverpool needing a miracle to progress past LaLiga giants Real Madrid","content":"Manchester City cantered into the Champions League quarter-finals after Erling Haaland plundered an extraordinary five goals against RB Leipzig . The Norwegian broke several records thanks to his stunning evening, moving past Lionel Messi. Aiming to join their Premier League rivals in the last eight are Liverpool , but the Reds need a miracle to overturn a their 5-2 aggregate deficit to Real Madrid . Elsewhere, Cristiano Ronaldo was punished for a display of frustration as Al-Nassr got their Saudi Pro League title hopes back on track. And Mikel Arteta is weighing up handing Gabriel Jesus his first start since November when Arsenal host Sporting Lisbon on Thursday. The action on the pitch and away from it is coming thick and fast, so keep it right here as Mirror Football keeps you up to date with all the latest football news. 08:33 Jacob Leeks Haaland achieves rare ratings feat Manchester City superstar Erling Haaland has become just the second player to be given a perfect 10 rating from notoriously harsh French publication L'Equipe. The Norwegian striker achieved the feat as a result of his remarkable performance against Red Bull Leipzig on Tuesday night in the Champions League round-of-16 second-leg. In just 63 minutes worth of playing time, Haaland bagged five goals against the German outfit as City ran riot and won 7-0 on the night, 8-1 on aggregate. An overwhelming amount of elite-level players go their entire career without being given a perfect 10 rating from L'Equipe, but this is already Haaland's second this season. The first came after the Manchester derby at the Etihad last October in a clash that City won 6-3 and saw their talismanic forward score a hat-trick and assist two. Click here to read the full story. 08:18 Jacob Leeks Madrid sent Liverpool comeback warning Eder Militao has warned his Real Madrid team-mates that their Champions League round of 16 tie with Liverpool ain’t over till the fat lady sings. The Spanish giants thrashed Jurgen Klopp’s men 5-2 in the first leg at Anfield with two goals each from Vinicius Junior and Karim Benzema cushioning Militao’s strike. But despite their three-goal lead, Militao insists he and his pals will be taking nothing for granted against a side who have proved time and again in Europe and at home that they can score goals for fun and produce heroic comebacks when they need to. In 2005, of course, Liverpool won the Champions League final on penalties against AC Milan after trailing 3-0 at half-time. And perhaps more pertinently, they beat Barcelona in the 2020 semi-finals by winning the second leg 4-0 after losing 3-0 in the first leg. Click here to read the full story. 08:02 Jacob Leeks Haaland pokes fun at Carragher and Richards Erling Haaland aimed a jibe at Jamie Carragher and Micah Richards over the duo's goalscoring records as players after netting five times against RB Leipzig . Haaland started for Manchester City on Tuesday evening as Pep Guardiola's men smashed the Bundesliga side 7-0 . The star summer signing scored five of their goals, including a first-half hat-trick, as City stormed into the quarter-finals of the Champions League . Unsurprisingly, the Norwegian was put up to handle the post-match media duties, which included speaking to CBS Sports. Carragher, Richards and Arsenal legend Thierry Henry form the punditry team for the American broadcaster and were in attendance at the Etihad Stadium. Click here to read the full story. 07:42 KEY EVENT Ronaldo punished Cristiano Ronaldo could not contain his fury as he was denied a chance to end his Al-Nassr goal drought during Tuesday afternoon's cup clash against Abha. The superstar striker, 38, has failed to find the back of the net in his last two Saudi Pro League fixtures and was frustrated again during the King Cup quarter-final tie. Sami Al-Najei and Abdullah Al-Khaibari gave Al-Nassr an early two-goal lead but Ronaldo was clearly livid when the referee blew the half-time whistle as he attempted to burst out of his own half on the counter-attack. There had been two minutes of added time earmarked and the referee drew the first half to a close with 47:24 on the clock, so the Manchester United legend could have few complaints about his surging run being cut short. Click here to read the full story. 07:41 Jacob Leeks Liverpool prepare for Madrid ust when you think they might have cracked it, they go and shoot themselves in the foot again. Liverpool's 2022-23 season could probably be best summed up by two things that have happened to them in the past month - one was beating Manchester United 7-0 before losing 1-0 to Bournemouth , and another was going 2-0 up against Real Madrid before going down 5-2 . They still have, in theory, a chance to turn that Madrid tie around, but there has been some disappointing news for the squad as they head to Spanish capital on Tuesday. Click here to see what we spotted from training and the airport. 07:40 KEY EVENT Haaland breaks Messi record Erling Haaland has become the youngest player to score 30 Champions League goals on his way to scoring a remarkable five in Manchester City's Champions League clash with RB Leipzig. The Norwegian's third was his 30th in the competition, a tally he has brought up in just 25 matches and at the age of 22 years and 236 days. Kylian Mbappe previously held that record at 22 years and 352 days, placing the pair way ahead of Cristiano Ronaldo and Lionel Messi , who got his 30 in 48 games. Click here to read the full story. 07:38 Jacob Leeks Good morning Good morning and welcome to the Mirror's live blog for all the latest football news. 22:50 Freddie Keighley That's all for today Thank you for joining us for another day of live football news coverage. It's been an extraordinary evening of Champions League action, with Manchester City scoring seven past RB Leipzig and Erling Haaland grabbing for five of those goals. Inter Milan made harder work of their tie against Porto but a goalless draw was enough for them to reach the quarter-finals thanks to their 1-0 lead from the first leg. We'll be back bright and early on Wednesday morning for more live coverage. See you then! 22:35 John Cross John Cross reports from historic Man City victory Erling Haaland sent a message of intent to the rest of Europe on a night of goalscoring records. Haaland got five goals in total, beat RB Leipzig almost on his own and might have hit double figures had he not been substituted to a standing ovation with 27 minutes left. It almost felt as if Pep Guardiola was taking pity on Leipzig by taking off Haaland before he could inflict more humiliation in what was supposed to be a tight last-16 Champions League tie. In the end, Haaland made it look like men against boys. He was bigger, better and more deadly than every other player on the pitch. It was embarrassingly one-sided. Haaland became only the third player - after Lionel Messi for Barcelona in 2012 and Luiz Adriano for Shakhtar Donetsk in 2014 - to score five goals in a single Champions League game. Erling Haaland of Manchester City ( Image: Alex Livesey - Danehouse/Getty Images) 22:15 Mark Jones Haaland shatters records Erling Haaland has become the youngest player to score 30 Champions League goals on his way to scoring a remarkable five in Manchester City's Champions League clash with RB Leipzig. The Norwegian's third was his 30th in the competition, a tally he has brought up in just 25 matches and at the age of 22 years and 236 days. Kylian Mbappe previously held that record at 22 years and 352 days, placing the pair way ahead of Cristiano Ronaldo and Lionel Messi, who got his 30 in 48 games. Full-time KEY EVENT FULL-TIME: MAN CITY 7-0 LEIPZIG (8-1 agg.) The referee has brought the Erling Haaland show to an end at the Etihad Stadium. Manchester City cruise through to the Champions League quarter-finals with one of the most dominant performances seen in European competition in recent years. This was a comprehensive team performance from the hosts, but Haaland will grab the headlines after a truly astonishing display. Kevin De Bruyne was also world class throughout the second leg and scored the goal his performance deserved in the dying seconds. Read the talking points from the fixture by clicking the link below. 57' KEY EVENT MAN CITY 6-0 LEIPZIG (7-1 agg.) Who else but Erling Haaland! This is one of the greatest individual performances seen on Europe's grandest stage this season and his name rings around the stadium. It's another poacher's goal as he instinctively lashes into sidenetting after the RB Leipzig goalkeeper parries the ball into his path. We are witnessing greatness. 54' KEY EVENT MAN CITY 5-0 LEIPZIG (6-1 agg.) It's getting embarrassing for RB Leipzig - but the Etihad faithful don't mind! Erling Haaland adds his fourth of the night with a drilled finish following a scramble in the box to grab his 38th goal of the season, matching the record goalscoring season for a Manchester City player in the process. The other teams who remain in the Champions League should be very, very worried indeed. 49' KEY EVENT MAN CITY 4-0 LEIPZIG (5-1 agg.) Manchester City are running riot! It takes a matter of minutes for the Sky Blues to add their fourth of the night after a sweeping move which scythed through the RB Leipzig defence. This time it's Ilkay Gundogan who converts for the hosts, brushing into the bottom corner to leave City fans dreaming of who they will face in the quarter-finals. Half-time KEY EVENT HALF-TIME: MAN CITY 3-0 LEIPZIG (4-1 agg.) That's surely Mancehster City through to the quarter-finals! It's an Erling Haaland hat-trick as he bundles the ball over the line after Ruben Dias' header from a corner hits the post and dribbles across the goalmouth. The hosts were rampant throughout the first half and, although Ederson was lucky to avoid punishment for taking out Timo Werner, they are fully deserving of their commanding lead. Erling Haaland of Manchester City celebrates ( Image: Shaun Botterill/Getty Images) 24' KEY EVENT MAN CITY 2-0 LEIPZIG (3-1 agg.) Astonishing! Seconds after the restart, Kevin De Bruyne cannons the ball against the crossbar and Erling Haaland is there to nod in the rebound. Is that the tie all but over? 22' KEY EVENT MAN CITY 1-0 LEIPZIG (2-1 agg.) Erling Haaland gives Manchester City the lead! The Norwegian sensation makes no mistake from the spot after a controversial handball was awarded against Benjamin Henrichs. Haaland buries his penalty into the bottom corner as City claim the aggregate advantage. 1' KEY EVENT We're underway! Manchester City versus RB Leipzig is underway at the Etihad Stadium. The two teams drew 1-1 in the first leg of their Champions League last-16 tie, so things are finely poised in Manchester. The pressure is on City to win their first European crown this season, with Erling Haaland charged with leading them to glory. We'll be bringing you updates from the fixture right here. Build-up Freddie Keighley Man City vs RB Leipzig team news Here is the team news from the Etihad Stadium. Manchester City: Ederson; Nathan Ake, Ruben Dias, Jon Stones, Manuel Akanji ; Rodri, Ilkay Gundogan, Jack Grealish, Kevin De Bruyne, Bernardo Silva; Erling Haaland. RB Leipzig: Janis Blaswich; David Raum Benjamin Henrichs, Willi Orban, Josko Gvardiol, Kevin Kampl; Konrad Laimer, Amadou Haidara, Dominik Szoboszlai, Emil Forsberg; Andre Silva, Timo Werner. 20:05 Dan Marsh Scotland trailblazer calls out abhorrent abuse Zander Murray, Scotland's first openly gay footballer, has called out the \"horrendous\" homophobic abuse he received on social media just hours before the release of his upcoming documentary. Murray, who plays for Scottish League Two side Bonnyrigg Rose, came out as gay back in September and recently teamed up with the BBC for a new documentary to assess what more needs to be done to tackle homophobia in football. But just hours before the series, Zander Murray - Out on the Pitch, aired on the BBC on Monday night, the 31-year-old was forced to respond to homophobic abuse in response to a Twitter post. In response to a user who had posted a derogatory message underneath a tweet Murray had shared applauding a young football fan, the striker said: \"Fully expect some homophobic abuse or hate for bringing out a documentary trying to help people and our game. But to comment under this post!? Horrendous, get a grip.\" 19:44 Colin Millar Qatar exploring takeover of Spanish side Qatar Sports Investments (QSI), chaired by Paris Saint-Germain president Nasser Al-Khelaifi, is exploring the possibility of buying a controlling stake in Spanish club Malaga. It comes amid a group led by Qatari banker Sheikh Jassim bin Hamad Al Thani joining the bidding process to buy Manchester United. The Glazers have pushed back their deadline to complete a sale of the club with the ownership situation at Old Trafford still unclear. The Glazer family are exploring outside investment or a full sale of the club they bought 18 years ago. The Americans are deeply unpopular among the club's fans, with the Red Devils having gone a decade without winning the Premier League title. 19:07 Colin Millar Wright and Ferdinand agree over 'untrustworthy' Liverpool Ian Wright has agreed with Rio Ferdinand that Liverpool will likely miss out on a Premier League top four spot and claimed “you can’t trust” Jurgen Klopp’s side. The Reds lost 1-0 at Bournemouth – who had started the day at the foot of the Premier League – on Saturday, just six days after they'd smashed Manchester United 7-0 at Anfield. It continued a hugely erratic campaign, which has also league defeats against Leeds, Nottingham Forest, Wolves, Brighton and Brentford. Klopp’s side remain in the thick of the race for a top four spot but are languishing in sixth in the standings – six points off fourth-placed Tottenham, who have played one game more. Earlier this week, Ferdinand predicted that they would miss out on a top four spot and Champions League football for next season - and Wright agrees with his fellow pundit. Ian Wright ( Image: Arsenal FC via Getty Images) 18:45 Colin Millar Spurs-linked Enrique received Ronaldo backing Erik ten Hag has already made a significant impact since his appointment at Manchester United - but the Dutchman wasn't everybody's first choice for the job. Prior to his messy exit, Cristiano Ronaldo had his own ideas on who should succeed Ole Gunnar Solskjaer. It was outlined at the time that Luis Enrique was Ronaldo's pick to replace Solskjaer after the Old Trafford hierarchy made the difficult decision to dispense with the Norwegian's services back in November 2021. The former Barcelona chief didn't get the call back then, with United instead opting to install Ralf Rangnick as an interim boss before swooping for Ten Hag back in the summer. However, Enrique is now in pole position to finally land a big Premier League job in the coming months. Luis Enrique ( Image: Angel Martinez - UEFA/UEFA via Getty Images) 18:22 Freddie Keighley Liverpool youngster in sickening clash of heads Liverpool Under-19's European encounter with Sporting Lisbon was marred by a sickening clash of heads which left Ben Doak requiring urgent medical attention. Doak, 17, lined up in attack for the young Reds and collapsed to the ground after leaping for a header and making contact with his Sporting opponent. The teenager initially clutched his head in pain before sinking to the turf, promptly receiving on-pitch treatment from two Liverpool medics. Encouragingly, Doak was able to stand up after the harrowing incident, but he was withdrawn from the fray with just eight minutes played so he could be properly examined. It was the low point of a disappointing afternoon for Liverpool U19, who were eliminated from the UEFA Youth League after Rodrigo Ribeiro scored a second-half winner for Sporting. 17:47 Alan Smith Chelsea set for Club World Cup boost Chelsea will be given an automatic place in the first edition of FIFA’s expanded Club World Cup in the summer of 2025. The governing body have confirmed that the Stamford Bridge side will be involved in the summer tournament because they won the 2021 Champions League - and it is set to result in a payday of at least £25m. Real Madrid, last season’s Champions League winners, and the next two victors will gain spots with eight more UEFA members to join them, likely based on coefficient ranking. The revamped competition will see 32 clubs broken into eight groups of four before reaching a knockout stage. It will take place every four years, although the FIFA president Gianni Infantino said in December that no host has been confirmed. Graham Potter ( Image: Justin Setterfield/Getty Images) 17:33 KEY EVENT Five things spotted as Liverpool travel in search of Madrid miracle Just when you think they might have cracked it, they go and shoot themselves in the foot again. Liverpool's 2022-23 season could probably be best summed up by two things that have happened to them in the past month - one was beating Manchester United 7-0 before losing 1-0 to Bournemouth, and another was going 2-0 up against Real Madrid before going down 5-2. They still have, in theory, a chance to turn that Madrid tie around, but there has been some disappointing news for the squad as they head to Spanish capital on Tuesday. Here's what we spotted from training and the airport. Roberto Firmino of Liverpool ( Image: Liverpool FC via Getty Images) 17:14 Josh O'Brien Ceballos opens up on Arsenal unhappiness Real Madrid midfielder Dani Ceballos has confessed he wanted to leave Arsenal soon after joining the Gunners on loan during Unai Emery's reign as manager. With Emery at the helm, Arsenal landed Ceballos' signature on loan in the summer of 2019. Few Gunners fans could forget his stunning debut against Burnley at home, which saw the Spaniard earn comparisons with Emirates favourite Santi Cazorla after just one game. However, Ceballos failed to truly hit those heights at any other time during his stay in north London and has since confessed he never took to life at Arsenal and wanted to return to the Spanish capital almost immediately, though he admits there were some positives to his stint as a Gunner. Unai Emery talks to Dani Ceballos ( Image: Stuart MacFarlane/Arsenal FC via Getty Images) 16:40 Freddie Keighley Ronaldo's fury in Al-Nassr win Cristiano Ronaldo could not contain his fury as he was denied a chance to end his Al-Nassr goal drought during Tuesday afternoon's cup clash against Abha. The superstar striker, 38, has failed to find the back of the net in his last two Saudi Pro League fixtures and was frustrated again during the King Cup quarter-final tie. Sami Al-Najei and Abdullah Al-Khaibari gave Al-Nassr an early two-goal lead but Ronaldo was clearly livid when the referee blew the half-time whistle as he attempted to burst out of his own half on the counter-attack. He responded to the whistle by gesticulating angrily at the referee before picking up and booting the ball powerfully into the opposition half. Ronaldo's act of petulance was punished with a yellow card, which only incensed him further as he trudged off the pitch towards the tunnel. Cristiano Ronaldo ( Image: Twitter/@SkyFootball) 16:22 Ben Husband Lineker's Twitter change spotted Gary Lineker is back at the BBC but has sent a clear message to bosses using the very words that adorn the walls of the corporation’s headquarters. The 62-year-old’s return to the broadcaster was confirmed on Monday after a weekend of chaos. Lineker had been temporarily suspended by the Beeb in light of social media posts criticising the Conservative government’s Illegal Migration Bill. On Monday, the BBC completed a humbling U-turn with director general Tim Davie confirming Lineker’s return. The ex-Tottenham and Leicester forward thanked fans for their support whilst doubling down on his support of refugees fleeing war and persecution. And although he is now back in his old position, there is clearly some understandable, lingering resentment at the furore whipped up by his employers. In a pointed statement to bosses Lineker has updated his profile picture, with his face mocked up in front of the message outside the BBC’s London headquarters. 16:01 KEY EVENT Ramsey appointed Wales captain New Wales captain Aaron Ramsey relishes the chance to atone for the “hurt” he suffered when stripped of the armband as a youngster. Wales boss Rob Page has named Ramsey as Gareth Bale’s successor following the record scorer’s retirement . Read more here","pubDate":"2023-03-15 07:37:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29461147.ece/ALTERNATES/s615/0_MAIN-Football-news-LIVE-Haaland-breaks-Messi-record-Liverpool-prepare-for-Madrid-Ronaldo-punished.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Bombers reshuffle: New boss makes his mark to defuse football department tension","link":"https://www.theage.com.au/sport/afl/bombers-reshuffle-new-boss-makes-his-mark-to-defuse-football-department-tension-20230315-p5csbs.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / AFL"],"creator":["Sam McClure"],"video_url":null,"description":"Recruiting boss Adrian Dodoro and football chief Josh Mahoney are at the centre of a re-structure at the Bombers.","content":"Essendon CEO Craig Vozzo has stamped his authority on his new club restructuring the football department for its three most important figures. Long-time list manager Adrian Dodoro will now report directly to Vozzo instead of football boss Josh Mahoney, after the new chief executive became aware of growing tension between the pair. Football chief Josh Mahoney and recruiting boss Adrian Dodoro Credit: Getty Images Vozzo’s first three months in the job have allowed him to closely analyse the club and its inner workings, with a particularly close eye on the football department. It’s no secret across the competition that Mahoney and Dodoro have endured a frosty relationship in their short time at Tullamarine together. So much so that Vozzo has executed a mini-restructure that will see Dodoro report directly to him instead of Mahoney, which had previously been the case. According to a club source, who was not authorised to speak publicly, the decision was made at least in part to alleviate tension between the pair. In a further change, new coach Brad Scott will also answer directly to Vozzo. Under previous chief executive Xavier Campbell, ex-coach Ben Rutten reported to Mahoney. It is rare for a senior coach to report directly to the CEO and not to the head of football. Mahoney will remain in the list management and total player payment groups as part of his executive role. A club spokesperson confirmed the restructure of the football department to The Age but declined to comment further. The Age also put questions to Dodoro and Mahoney about the restructure and their relationship but Dodoro declined to comment and Mahoney did not respond. Brad Scott has had a big impact as he reshapes Essendon. Credit: Artwork: Jamie Brown Club insiders suggest Mahoney is once again considering putting his hand up for the vacant head of football role at the AFL. Mahoney went for the same role two years ago, which was eventually given to his now coach Brad Scott. The AFL will hold off on finding a replacement for Scott until a successor for league CEO Gillon McLachlan is appointed , which league sources believe will happen before round five. Essendon’s recruiting has drawn mixed reviews with the Essendon faithful during 18 seasons without a finals win, with the club’s decisions to trade first round draft picks for the likes of Dylan Shiel and Devon Smith a point of contention. But the recently revamped list has given Essendon fans something to smile about. The addition of elite talent - like Archie Perkins, Harrison Jones and Nik Cox - through the draft has Bombers insiders hopeful the list in solid shape for the long term. Essendon have also had six Rising Star nominees in the last two seasons, which is an impressive haul. As for Scott, it’s been an interesting beginning. Within weeks of getting the job, Scott’s football director Kevin Sheedy, who is still on the board, stated that he’d voted for James Hird. Next, Scott had to watch on as the club’s new chief executive Andrew Thorburn arrived and departed within a 24-hour period. We know from the latest figures from the AFL that the average player salary is now a tick over $400k. We also know that there’s no one better at bending a dollar than a professional athlete. But extra points should be awarded to the players over summer who opted to get a bit more internal support when they moved houses. You see, most clubs have their own truck that they use to store and transport equipment to training and games. But some players figure it can double as a moving van. So, which Carlton player was recently spotted behind the wheel of the club truck? And no, it wasn’t Patrick Cripps. With more than 85,000 people expected to pack into the MCG for Thursday night’s season-opener between Carlton and Richmond, the AFL is expecting bumper crowds across round one. That is, except for Saturday night’s clash between flag fancies Melbourne and the Western Bulldogs. According to senior people at the MCC, a crowd of about 50,000 is being forecast for the game between two teams likely to be fighting for top-four positions come season’s end. That’s fewer than the 55,000 expected for Sunday afternoon’s game between Essendon and Hawthorn, who most expert tipsters have finishing at the other end of the ladder. Has the snow season come early?","pubDate":"2023-03-15 07:33:44","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Liverpool comeback warning sounded by Real Madrid star despite 5-2 Champions League lead","link":"https://www.mirror.co.uk/sport/football/news/champions-league-real-madrid-liverpool-29456961","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Tom Hopkinson)"],"video_url":null,"description":"Real Madrid will take a three-goal advantage into the second leg of their last-16 Champions League tie with Liverpool, while they will also be playing in front of their own fans","content":"Eder Militao has warned his Real Madrid team-mates that their Champions League round of 16 tie with Liverpool ain’t over till the fat lady sings. The Spanish giants thrashed Jurgen Klopp’s men 5-2 in the first leg at Anfield with two goals each from Vinicius Junior and Karim Benzema cushioning Militao’s strike. But despite their three-goal lead, Militao insists he and his pals will be taking nothing for granted against a side who have proved time and again in Europe and at home that they can score goals for fun and produce heroic comebacks when they need to. In 2005, of course, Liverpool won the Champions League final on penalties against AC Milan after trailing 3-0 at half-time. And perhaps more pertinently, they beat Barcelona in the 2020 semi-finals by winning the second leg 4-0 after losing 3-0 in the first leg. Trent Alexander-Arnold attempts Real Madrid mind games as Liverpool plot miracle escape Virgil van Dijk branded \"overrated\" and told he \"can't lace\" Premier League duo's boots Their 7-0 victory over Manchester United will still be fresh in the memory for Liverpool as they head out at the Santiago Bernabeu on Wednesday, even though they were beaten 1-0 by Bournemouth in their next Premier League fixture. And if they can race into a 2-0 lead this week as they did in the first leg against Real Madrid, then all of a sudden, the tie has a different complexion altogether. Militao knows that and he knows there’s still a long way to go. He said: “Some people believe this tie is already finished but I am expecting a big night between two of the clubs with the biggest histories in world football. “It’s certain that Real Madrid have a very big advantage but still we must wait another 90 minutes and the round is not closed. In previous editions of the Champions League, we have experienced situations that have been right on the limit and we know they were lessons for us. Eder Militao has warned his Real Madrid team-mates against complacency ( Image: David S. Bustamante/Soccrates/Getty Images) “Liverpool improved in the last matches and we saw the game against Manchester United — they were spectacular. We expect a different Liverpool in Madrid than the one we faced at Anfield because they need to take risks to score goals, but our challenge is to play such a match that no one remembers our 5-2 win at Anfield. “The fact the second leg is in front of our supporters is favourable for us. Liverpool will feel enormous pressure and each minute that passes with a goal for them is a success for us. Real have suffered problems with winning and scoring goals since our win in Liverpool but I am totally convinced this will change this week at the Santiago Bernabeu.” Can Liverpool pull off another miraculous European comeback? Have your say in the comments. Eder Militao relished his experience at Anfield in February ( Image: David S. Bustamante/Soccrates/Getty Images) Militao loved his evening at Anfield last month. He added: “The night in Liverpool was one of the most historic in my sporting life — to win 5-2 there and score is a unique moment for any footballer. “But Liverpool have a super squad and now we do not want to be surprised at home. Mo Salah has come into a good moment in attack. He is always dangerous and against us he is hyper-motivated, and also Roberto Firmino is scoring goals again. “So until the end of this match, nothing has been decided.”","pubDate":"2023-03-15 07:30:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29457073.ece/ALTERNATES/s615/0_GettyImages-1232706728.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Glentoran fourth as late Danny Purkis strike stuns Ballymena United","link":"https://www.belfasttelegraph.co.uk/sport/football/irish-league/glentoran-fourth-as-late-danny-purkis-strike-stuns-ballymena-united/874453782.html","keywords":null,"creator":null,"video_url":null,"description":"Danny Purkis last night spared Glentoran blushes by nicking a last gasp winner against gutsy Ballymena United at the BetMcLean Oval — but it wasn’t pretty stuff.","content":"Although Rodney McAree’s boys moved up to fourth place in the Danske Bank Premiership table with the 1-0 win, they still trail runaway leaders Larne by a whopping 11 points. It was only Glentoran’s second win in six outings, but an improvement on their weekend contribution when they were humbled at home by Glenavon which led to manager Rodney McAree and his team being booed off at the finish. Ballymena’s season appears to be slipping away on a weekly basis. They now haven’t won a League game in their last 10 outings, having picked up only three points in that depressing run. Even a seventh placed finish — that could possibly earn a place in the European qualifier — is now rapidly disappearing into over the horizon for the beleaguered Sky Blues. McAree made four changes to the team after that calamity bringing in goalkeeper Ollie Webber, skipper Marcus Kane, Danny Purkis and Niall McGinn. United chief David Jeffrey also reshaped his side, making four changes to the side that crashed to Coleraine, handing Ross Redman, Dougie Wilson, Ryan Waide and Mikey Place starting shirts. Glentoran were only inches away from taking the lead on seven minutes. Conor McMenamin picked up a pass from Rhys Marshall on the right, skipped inside only to see his low curling drive fizz past the post. They threatened again with McGinn whipping in a clever delivery from the right which was met by the towering Aidan Wilson, who could only head into the gloves of Jordan Williamson. Wilson then got back to do what he does best in defence. In an enterprising move on the right, Sean Graham picked out the lively Davy McDaid and, as he pulled the trigger, the big Scot got in a telling block. McDaid was then presented with a glorious chance on 23 minutes. Kenny Kane’s cross was totally miscued by defender Rhys Marshall and when the ball fell to the diminutive striker, he could only drill his shot wide. United grew into the game and, in another impressive move on the right on 38 minutes, Graham sent Kane hurtling through the middle only to hoof his shot just over. Both sides created chances early after the restart. James Singleton’s piercing dash forward opened up a chance for McGinn, whose shot was bravely blocked by teenage centre-back Craig Farquhar. Glentoran missed a glorious chance just before the hour. McMenamin’s pin-point cross found Purkis, who headed across goal, neither Singleton nor McGinn could convert from two yards at the back post. It was Purkis who broke the deadlock on 88 minutes, picking up a clever pass from substitute Shay McCartan before rifling low past Williamson. GLENTORAN: Webber, Marshall, L McCullough, Wilson, Kane (McCartan 68), Devlin (J Donnelly 83), Singleton, Burns, McMenamin, Purkis, McGinn (Wightman 74). Subs not used: A Henderson, R Donnelly, Crowe, Junior. BALLYMENA UNITED: Williamson, Nelson (Gibson 90), Redman, D Wilson, McDaid, Waide (McCullough 70, K Kane, McVarnock, Graham, Place (McGrory 74), Farquhar. Subs not used: J Henderson, Tipton, Tennant, Clarke. REFEREE: Evan Boyce. Man of the match: Craig Farquhar. Match rating 4/10.","pubDate":"2023-03-15 07:10:00","image_url":"https://s3.eu-west-1.amazonaws.com/prod-mh-ireland/70a78722-f2cd-4304-b380-940bf9a75baf/6715fbb9-d6f9-4653-a8d0-2ba1156962d4/ran%20v%20Ballymena_029.jpg","source_id":"belfasttelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"What channel is Real Madrid vs Liverpool? Kick-off time, TV and live stream details","link":"https://www.mirror.co.uk/sport/football/news/liverpool-real-madrid-tv-channel-29457135","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Daniel Orme)"],"video_url":null,"description":"Liverpool have a mountain to climb on Wednesday evening as they aim to reach the quarter-finals of the Champions League against Real Madrid having endured a nightmare first-leg at Anfield","content":"Liverpool have their work cut out on Wednesday evening if they want to reach the quarter-finals of the Champions League against Real Madrid . The Reds travel to the Santiago Bernabeu in midweek aiming to overcome a three-goal deficit from the first-leg. Jurgen Klopp ’s men had initially raced into a two-goal lead during the first-leg on Merseyside but ended up losing 5-2 with Vinicius Jr and Karim Benzema both scoring braces . Since that reverse, the Reds have put together a hugely inconsistent run of results. They at first stumbled to a 0-0 draw with Crystal Palace before overcoming Wolves 2-0. Jamie Carragher makes his feelings clear on Rio Ferdinand's \"small club\" Liverpool claim Trent Alexander-Arnold attempts Real Madrid mind games as Liverpool plot miracle escape They then racked up one of the most memorable results in their history by thumping fierce rivals Manchester United 7-0 . Despite initially looking as though they’d managed to turn a corner, they then fell to a 1-0 defeat to relegation contenders Bournemouth . Elsewhere, Real Madrid only have one win in their last four matches in all competitions since their dominant victory at Anfield - that coming in their most recent outing in the form of a 3-1 success against Espanyol. Away from that, the Reds have a few injury worries to contend with should they want to progress. Thiago Alcantara , Luis Diaz and Joe Gomez are all ruled out ahead of the trip to Madrid. Naby Keita could potentially return to contention after previously suffering with a muscle injury. Yossi Benayoun was the last Liverpool player to score a winning goal against Real Madrid at the Bernabeu ( Image: Getty Images) What are your predictions for Real Madrid vs Liverpool? Share your thoughts in the comments below Carlo Ancelotti also has a number of problems to overcome. Benzema has been suffering with an ankle injury over recent weeks but should be okay to return for the second leg. There is less promising news over Ferland Mendy and David Alaba though who appear unlikely to play against the Reds in any capacity. If Liverpool hope to progress, they will need to do something that they have managed to only ever achieve once - winning at the Bernabeu. They last won 1-0 in February 2009 - Yossi Benayoun netting the winning goal. Their previous trip to the Bernabeu itself saw them lose 1-0 after Brendan Rodgers fielded a much-changed line-up. Liverpool are falling into familiar Robin Hood territory under Jurgen Klopp Rio Ferdinand slams Liverpool over \"small-club mentality\" and calls out Jamie Carragher When is Real Madrid vs Liverpool? The game takes place at the Santiago Bernabeu on Wednesday, March 15. Kick-off is scheduled for 8pm GMT. How can I watch the game? The game itself will be broadcast on BT Sport 1 and BT Sport Ultimate. Alternatively, subscribers can tune in via the BT Sport Website or app. Latest odds Real Madrid - 5/4 Draw - 3/1 Liverpool - 7/4 Odds provided by Betfair. 18+, UK customers only, T&Cs apply","pubDate":"2023-03-15 07:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29457258.ece/ALTERNATES/s615/0_GettyImages-1247377923.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sir Alex Ferguson signed star who could’ve been “best in the world” but he “didn’t care”","link":"https://www.mirror.co.uk/sport/football/news/man-united-alex-ferguson-anderson-29453812","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Ben Husband)"],"video_url":null,"description":"Manchester United welcomed their fair share of superstars to Old Trafford during Sir Alex Ferguson's historic tenure, but there were also a number of high-profile transfer misses","content":"Sir Alex Ferguson openly admits that his decision to sign Owen Hargreaves in the summer of 2007, was the most disappointing of his legendary Manchester United career. The England midfielder arrived off the back of an impressive World Cup campaign 12 months earlier and a reputation enhanced thanks to his time at Bayern Munich. But chronic injury issues meant he never truly established himself at Old Trafford, leading to Ferguson’s non-too-flattering verdict on his transfer. But there are similar regrets about a player signed in the same week as the combative midfielder. Anderson arrived in English football with the tag of one of Brazil’s most exciting talents. Ralf Rangnick’s first Man Utd signing still waiting for appearance under Erik ten Hag Rio Ferdinand tells Man Utd duo they need to start copying Arsenal sensation Just two years previous, the central midfielder had been crowned the player of the tournament in the under-17 World Cup. At just 18, he was already involved in the senior Brazil side and was expected to be a key part of the Selecao’s plans moving forward. United stumped up £27million to sign Anderson from FC Porto, fending off Real Madrid and Chelsea in the process. But despite winning four Premier League titles and a Champions League crown, he never really delivered on his promise. And when his career ended prematurely aged just 31, it culminated as a major ‘what if’ not only for Anderson, but for Manchester United as a whole. Ferguson didn’t get too much wrong in the transfer market and those at the club think he would have got it spot on with Anderson - if only his attitude had been right. Anderson won a host of trophies at Man Utd but didn't truly deliver on his potential ( Image: Corbis via Getty Images) \"He could have been the best player in the world at one point, I promise you he could have,\" ex-United keeper Ben Foster told the UTD Podcast last year. \"Everybody would say that he could have been the best in the world at one point. \"But he just didn't care, he didn't care about anything. Honestly, he didn't care about anything [laughs]. But you put him on a pitch and he was like that. Carlos Tevez was the same sort of thing. Put him on the pitch and oh my god. There has got to be something in being South American, there's got to be something in that.\" That was a verdict which quickly bled into the coaching staff, with Ferguson’s trusted confidante Mick Clegg admitting that anger towards the talented South American even made its way to the boss himself. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. “Anderson was one. You could never find a nicer person, he was popular with everyone but he was a lazy bleeder,” Clegg told the Athletic. “He always had his excuses. I used to have a stick and I said to Alex Ferguson very early on, if he carries on, I'm going to hit him with my bleeding stick. “Fergie couldn't believe it. 'Don't you dare. He cost me a lot of money. You can't be hitting one of my players, are you mad?' “Then, six weeks later, Fergie came to find me. 'Where's that bloody stick? Give me that stick. I want to hit him'.” Clegg added that Anderson could have been “an absolute stormer of a player” but rather than apply himself properly, he decided to not put in the world and became a “party animal.\" He would leave United 2015 after making almost 200 appearances for the club. He then had a short spell in Brazil, before returning to Europe to play in Turkey. However, that adventure was only a fleeting one and he hung up his boots in September 2020, with a boatload of regrets riding off into the sunset with him.","pubDate":"2023-03-15 07:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article28891966.ece/ALTERNATES/s615/0_Sir-Alex-Ferguson-Manchester-Uniteds-Scottish-manager.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Jamie Carragher can't resist dig at Man Utd after Man City smash seven just like Liverpool","link":"https://www.mirror.co.uk/sport/football/news/liverpool-mancity-manutd-jamie-carragher-29461022","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Daniel Orme)"],"video_url":null,"description":"Liverpool icon Jamie Carragher is still clearly basking in the glory of his former side’s 7-0 thumping of fierce rivals Manchester United and even found a way to bring it up following Manchester City’s Champions League cruise","content":"Jamie Carragher couldn’t help himself from taking a brutal dig at Manchester United as their cross-city rivals Manchester City reached the Champions League quarter-finals in style. Pep Guardiola’s men racked-up a comprehensive 7-0 victory against German side RB Leipzig at the Etihad Stadium on Tuesday. Erling Haaland put on a clinical display of his goalscoring abilities by scoring five, with Ilkay Gundogan and Kevin De Bruyne adding to the stunning scoreline. Victory saw City progress to the last eight courtesy of their 8-1 aggregate win. Carragher was on punditry duty for the game itself but couldn’t resist firing a dig at Man United after their defeat by his former side by the same seven-goal scoreline . Liverpool make final decision over the future of \"incredible\" player Jurgen Klopp loves Fabinho finds the positives in Liverpool's Champions League mission improbable in Madrid Taking to Twitter , he wrote: “Losing 7-0 is a joke!” accompanied by a winky face emoji. It is not the first time that the former defender has jumped at the chance to poke fun at the Red Devils’ heavy defeat . His selfie alongside Gary Neville on the Anfield gantry went viral, whilst he then produced a number of jokes throughout the following days including drinking from a 7Up can live on air. That theme continued with a number of references to the number seven ahead of Chelsea ’s Champions League clash with Borussia Dortmund with legendary former Red Devils’ goalkeeper Peter Schmeichel being the butt of the vast majority of the jibes. Carragher said: \"We’re getting into March, the 7th of March. It feels like these games are cut-throat, like I said, into March on the seventh. How important does it feel being at the Bridge.\" Erling Haaland put on a goalscoring show against RB Leipzig ( Image: Getty Images) Who was your man-of-the-match in Man City's win over RB Leipzig? Share your thoughts in the comments below In attempting to give his assessment, Schmeichel replied: “I've been trying to make sense of this since then. I still have no idea how that can happen, because it shouldn’t happen. I think [Erik] ten Hag has said it – it was embarrassing, it was unprofessional and it can never happen again. So I hope he’s right and I hope he gets things right.\" To which Carragher added: \"Peter, you’ve just called him 'Ten Hag'. It's actually 'Seven Hag!'\" Whilst the former defender certainly enjoyed having his fun with the Liverpool result, he and the Reds were soon brought back down to Earth with a bump following their 1-0 defeat to relegation candidates Bournemouth . They now face arguably one of their toughest tests of the season as they attempt to overcome a three-goal deficit to Real Madrid at the Bernabeu. Liverpool face midfield crisis at Real Madrid as FOUR first-team stars ruled out Liverpool on Gavi transfer alert after unique opportunity presents itself Man City will certainly be aiming to avoid the same fate as the Reds following their own 7-0 win. Guardiola’s men are next back in action on Saturday as they take on Championship side Burnley in the quarter-finals of the FA Cup . The Clarets will be led by City icon Vincent Kompany who will make his first return to the Etihad Stadium as a manager. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-15 06:46:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article29414124.ece/ALTERNATES/s615/0_Jamie-Carragher.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Man Utd urged to sign 'next George Best' as Gary Lineker tells fans \"remember the name\"","link":"https://www.mirror.co.uk/sport/football/transfer-news/man-utd-transfers-lineker-kvaratskhelia-29459507","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Freddie Keighley)"],"video_url":null,"description":"Khvicha Kvaratskhelia is the name on every fan's lips after a meteoric rise at Napoli - and one Italy legend believes he could have a George Best-like impact at Manchester United","content":"Manchester United have been told \"the days of George Best will return\" if they splash out to sign Napoli sensation Khvicha Kvaratskhelia. The Georgian winger, 22, has exploded onto the scene this season, grabbing 11 goals and nine assists in his debut Serie A campaign to help his side go 18 points clear top of the table. Few had heard of Kvaratskhelia while he was plying his trade in his homeland, but his electric form means his name is on the lips of fans across Europe. Kvaratskhelia's latest heroics came on Saturday as he opened the scoring with a sublime strike against Atalanta . It was a goal which reminded Napoli manager Luciano Spalletti of the late, great Diego Maradona , while the Italy icon Christian Vieri declared the player could match Best's impact at Old Trafford if he joins the Premier League giants. Man Utd takeover: Glazers in 'standoff' with bidders as latest deadline approaches Casemiro's tears over Man Utd red card explained after Real Madrid comments Speaking on Bobo TV, per Calcio Napoli 1926 , Vieri said: \"The goal he scored was the stuff of madness! If he goes to Manchester United , the days of George Best will return. Kvaratskhelia is the same. I can't wait for Wednesday to see Napoli play.\" Kvaratskhelia will have another chance to showcase his ability in midweek as Napoli take on Eintracht Frankfurt in the second leg of their Champions League last-16 tie. The Italian club have a 2-0 advantage from the first leg as they prepare to welcome their opponents to Diego Armando Maradona Stadium. Kvaratskhelia was not on the scoresheet in Germany but he assisted Giovanni Di Lorenzo's goal, which added to Victor Osimhen's opener, to register yet another goal involvement. Gary Lineker is among the onlookers to have been hugely impressed by the youngster and took to Twitter with typical wittiness to write: \"Remember the name. He's that good that eventually we'll all know how to spell it.\" Should Manchester United sign Khvicha Kvaratskhelia? Have your say in the comments! Khvicha Kvaratskhelia is earning comparisons to footballing legends ( Image: Francesco Pecoraro/Getty Images) George Best scored 179 goals for Manchester United ( Image: TV Times via Getty Images) Spalletti could hardly contain himself as he praised Kvaratskhelia in his press conference after the victory over Atalanta. The player weaved through the defence before smashing into the roof of the net to double Napoli's lead, producing the sort of sublime footwork that Maradona used to dazzle fans with during his time in Italy. \"It was a goal worthy of Maradona, and that is not something I say lightly,\" Spalletti said of Kvaratskhelia's breathtaking goal. \"He has this ability to twist the ball inside out and then get the shot away so quickly. When he looks you in the eye and takes you on, he becomes devastating. This time yes, we can invoke the name of the greatest the world has ever seen.\" Such is the rising Georgian star's prodigious ability, the devout Napoli fan base have affectionately nicknamed him \"Kvaradona\", backing up Spalletti's comments.","pubDate":"2023-03-15 06:30:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29428188.ece/ALTERNATES/s615/0_FILE-Gary-Lineker-To-Step-Back-From-Presenting-BBCs-Match-Of-The-Day.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ex-Man Utd wonderkid dubbed 'next Ryan Giggs' in urgent appeal for career-saving surgery","link":"https://www.mirror.co.uk/sport/football/news/man-utd-ryan-giggs-gribbin-29459936","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Freddie Keighley)"],"video_url":null,"description":"Non-league attacking midfielder Callum Gribbin is crowdfunding to raise money for surgery on his knee just over three years after he was released from Manchester United","content":"Former Manchester United prodigy Callum Gribbin has been forced to fundraise to avoid postponing surgery on a devastating knee injury which could end his career. The attacking midfielder, 24, spent over a decade on the Red Devils' books after joining as a child and drew comparisons to Ryan Giggs as he rose through the academy ranks. He announced himself to the Old Trafford faithful while playing for United's under-13s at Edwin van der Sar's testimonial, shining against Ajax in an exhibition fixture. Due to his precocious dribbling ability and wand of a left foot, Gribbin was likened to club legend Giggs and even impressed Jose Mourinho during his time as United manager. However, he was released in 2019 after injuries hampered his progress and subsequently joined Sheffield United , Barrow and Radcliffe. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. The Salford native moved to United of Manchester - who play in the in seventh tier of English football - in 2022 and featured prominently until he suffered a catastrophic leg injury. Gribbin was on the receiving end of a heavy tackle at Broadhurst Park and needed to be stretchered off while in severe discomfort, with scans showing he had ruptured his anterior cruciate ligament, medial ligament and posterior ligament. Man Utd takeover: Glazers in 'standoff' with bidders as latest deadline approaches Sunderland boss Tony Mowbray warns Man Utd that Amad's body has \"almost shut down\" Rupturing one of these ligaments would rule a player out of action for at least six months, so the extent of his injury has thrown his career into doubt. Gribbin requires urgent surgery to address the issue but the cost of the operation is great and he needs to raise 50 per cent of the sum required, with the Professional Footballers' Association covering the other half of the sum A statement on United of Manchester's website claims Gribbin will be forced to delay his surgery if he does not raise the money by Friday 17 March. The player has already been relying on crowdfunding to provide for his young family while he is sidelined, and it will take up to a year for him to rehabilitate from the surgery, whenever it takes place. Callum Gribbin played at Manchester United at various youth levels but never made a senior appearance ( Image: Vincent Cole) What are your memories of Callum Gribbin at Manchester United? Share yours in the comments. The statement concludes: \"We've done it before, and appreciate that times are hard for everyone, but if you can help by chipping in anything you can afford, no matter how small, it would help Callum through an incredibly tough period in his life - he wouldn't ask for this support himself - but he needs it more than ever.\" Gribbin sent his heartfelt thanks to all those who have donated to his fundraiser on Twitter , writing: \"Thank you so much to everyone who has donated.\" His GoFundMe target of £7,000 has nearly been met as of Tuesday evening, with kind-hearted fans stumping up over £5,900 to help him pay for the surgery he so desperately needs.","pubDate":"2023-03-15 06:15:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29460151.ece/ALTERNATES/s615/0_JS107422981.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"}]}