{"newsArray":[{"article_id":"ecdd4ca87a27cf5a25afc4061c6f474f","title":"Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast'","link":"https://www.dailymail.co.uk/sport/football/article-12745703/Man-United-refuse-enter-talks-Juventus-potential-Jadon-Sancho-loan-club-wait-permanent-bids-Old-Trafford-outcast.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Sancho looks to have no future at Old Trafford with the forward currently training on his own at the academy and barred from using first team facilities at United's Carrington training base.","content":"Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast' Jadon Sancho remains banished from the first team squad and is training alone Juve had been interested in taking the Englishman on loan in January It’s a three-team title race... Toney could lead Arsenal to glory: It's All Kicking Off By Spencer Morgan For Mailonline Published: 20:05 EST, 13 November 2023 | Updated: 20:13 EST, 13 November 2023 e-mail 6 shares 2 View comments Manchester United have reportedly shut down attempts from Juventus to try and negotiate a loan move for outcast Jadon. Sancho looks to have no future at Old Trafford with the forward currently training on his own at the academy and barred from using first team facilities at United's Carrington training base. Sancho's exile followed the winger publicly branding manager Erik ten Hag a liar over his reasons for dropping him for the 3-1 away defeat by Arsenal in September. And Fabrizio Romano claims Juve had hoped to offer a temporary solution but United are looking for a permanent one. He tweeted: 'U nderstand Juventus asked for information on Jadon Sancho deal in recent days. Man United have refused to talk with Juventus about a possible loan deal for Jadon Sancho 'He’s set to leave Man United in January, Juve are interested but only on loan plus part of salary covered by #MUFC. 'No negotiations yet as Man Utd prefer to wait for permanent deal bids.' A number of Audi Arabian clubs are believed to be interested in Sancho and United will no doubt be hoping to sell to the highest bidder. Sancho joined the Red Devils for a fee of £73m but was never able to find the form that made him a star for Borussia Dortmund. Sancho's exile followed the winger publicly branding manager Erik ten Hag a liar IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/us/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Jadon Sancho Erik ten Hag Share or comment on this article: Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast' e-mail 6 shares Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 01:13:46","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77765101-0-image-a-24_1699923586134.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"553b7661e1a1ee405677598e82722ece","title":"Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling","link":"https://www.dailymail.co.uk/sport/football/article-12742981/Marcus-Rashford-misfiring-forwards-uncertainty-strongest-midfield-Harry-Maguires-best-partner-Erik-ten-Hag-plenty-ponder-international-fortnight-Man-United-struggling.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Saturday's slender win over Luton Town has offered Ten Hag some much-needed respite and it's astonishing to see United sitting sixth in the table for all their problems.","content":"Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling Saturday's 1-0 victory over Luton has given Erik ten Hag some breathing space But shaky start to the season leave him searching for answers to many questions City had their pants pulled down by a development team - It's All Kicking Off By Adam Shergold for MailOnline Published: 22:00, 13 November 2023 | Updated: 00:49, 14 November 2023 e-mail 15 shares 42 View comments Peace at last for Erik ten Hag . As most of his Manchester United players jet off to represent their countries for the final time in 2023, the coach has a couple of weeks breathing space to work on answers to many questions. Saturday's slender win over Luton Town has offered Ten Hag some much-needed respite and it's astonishing to see United sitting sixth in the Premier League table for all their problems. Indeed, with four wins from their last five games, United are among the league's form sides. But league form unfortunately be taken in isolation from United's shocking Champions League campaign and feeble Carabao Cup defence. Erik ten Hag still has plenty to ponder despite Manchester United's win over Luton on Saturday The Reds have lost as many matches as they've won during a shaky start to the season Your browser does not support iframes. They have lost nine times and won nine times overall this season - they don't seem to do draws. After the internationals, United face a tricky trio of away games against Everton, Galatasaray and Newcastle United that may dictate the direction of their whole season. Positive results may chart a course for another top-four finish and Champions League football after Christmas. Further defeats could see United slide into mid-table mediocrity and the Europa League - or even out of Europe entirely. Here's a closer look at some of the problems Ten Hag needs to solve over the coming fortnight. Finishing practice for the forwards! United were indebted yet again to one of their defenders as they squeezed past Luton at Old Trafford. Victor Lindelof was on hand to fire home the winner , just as Raphael Varane, Harry Maguire and Diogo Dalot made match-winning contributions in earlier games. Of their 13 Premier League goals so far, three have come from defenders, nine from midfielders and just one from the strikers. Victor Lindelof (left) fires home United's winner against Luton as another defender saved them Marcus Rashford endured another blank afternoon as his struggles in front of goal continued That was Marcus Rashford's goal in the 3-1 defeat at Arsenal back in September, with nothing so far in the league from Rasmus Hojlund, Antony, Alejandro Garnacho or Anthony Martial. Ten Hag isn't concerned about Hojlund's Premier League goal drought because the £72million Dane has netted five times in Europe. His finishing touch deserted him again versus Luton prior to leaving the pitch late on with a hamstring injury that has forced him out of Denmark duty. The same thing happened to Garnacho, who spurned a very good one-on-one opportunity in the first-half, and needs to be more clinical in such situations. There is growing indifference among United fans to Antony, who is in growing danger of being remembered as a very expensive flop. The Brazilian has been jeered in recent games and rumours abound that United could cut their losses on him as soon as January. Alejandro Garnacho wasn't able to convert a very good one-on-one opening in the first-half The young Argentine is one of several United forwards in need of extra finishing practice Antony is far too predictable when on the ball and has struggled for goals and assists Man United fixtures Premier League unless stated November 26 Everton (A) November 29 Galatasaray (A) Champions League group stage December 2 Newcastle United (A) December 6 Chelsea (H) December 9 Bournemouth (H) December 12 Bayern Munich (H) Champions League group stage <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Rashford, meanwhile, is a shadow of the devastatingly effective goalscorer we saw last season and his goal shortage helps explain why United are struggling to finish off even modest opponents. Ten Hag maintains everyone will come good but United have scored just 13 times in 12 league games and cannot keep relying on their defenders to bail them out. Better service for Hojlund Tied into United's striker troubles has been the theme of Hojlund not receiving enough service , especially in Premier League games. There appears to be little cohesion between the front three, regardless of who plays. Rashford, Antony and Garnacho are all more likely to cut infield and take a shot when they get into a good position rather than look to feed Hojlund, even if he's in a better position. With Rashford's form in a rut, Garnacho still quite raw with his finishing and Antony far too predictable with his intentions, this leads to frustration. When they do try and combine, such as Rashford's hooked back-post cross for Hojlund to head the opener against Galatasaray, it proves effective but most of his service comes from the midfielders. Rasmus Hojlund's Premier League goal drought continued before he was forced off injured There isn't a great deal of cohesion as yet between £72m Hojlund and United's other forwards There has been an element of Rashford looking ever-more desperate to get a goal and taking on more chances as he searches for the moment that breaks the logjam. If the nascent understanding between Rashford and Hojlund can develop - and it will take a bit of time - United should have a deadly strike force. The may, however, be limited time to work on this now with Rashford away on international duty and Hojlund sidelined anyway. Midfield clarity A succession of injury blows have made it difficult for Ten Hag to pick a settled line-up during the early months of the season. This has been especially true at left-back but also in key midfield positions, contributing to a feeling Ten Hag isn't entirely sure of his best combination. Christian Eriksen has picked up a knee injury, joining the out-of-sorts Casemiro on the treatment table, though the Brazilian should be fit again soon. Summer arrival Mason Mount missed five games with a knock, while loan signing Sofyan Amrabat was forced to deputise at left-back. Christian Eriksen became the latest United player to suffer an injury this season Scott McTominay may have left United back in the summer but has been in excellent form Ten Hag has been indebted to Scott McTominay , who may have departed Old Trafford over the summer but has chipped in with some strong performances and vital goals. But Ten Hag needs to have a think about his best midfield going forward. Last season, United's combination of Casemiro, Eriksen and Bruno Fernandes remained unbeaten for some time. Currently, there isn't an obvious first-choice trio. Casemiro has looked off the pace, while playing Eriksen or Mount can leave United exposed. Conversely, partnering two of Casemiro, McTominay or Amrabat together can stifle their creativity and make it hard to break down opponents. We have seen Eriksen hurriedly introduced during games to provide a bit more creativity, while in others opponents have enjoyed so much freedom in the centre of the park. Ten Hag needs to consider who plays there if he only had the luxury of everyone being fit. United look like they need a bit of consistency in this important department. It's difficult to know whether Casemiro would make United's first-choice midfield if fit Who plays alongside Maguire? In a conundrum few saw coming at the start of the season, it isn't a case of does Harry Maguire have an Old Trafford future but who plays alongside him in defence. The England centre-half has shown remarkable resilience after being dropped by Ten Hag last season, stripped of the captaincy in the summer and roundly ridiculed. Maguire always wanted to stay at United and fight for his place and that decision has now been vindicated. He has stepped up and performed at a difficult time for the team. Against Luton, he was paired with Lindelof in a throwback to the Ole Gunnar Solskjaer days and we've also seen an improbable partnership with 35-year-old Jonny Evans. Victor Lindelof and Harry Maguire reprised their central defensive partnership on Saturday There are doubts now over Raphael Varane with Ten Hag continuing to keep him out the side Ten Hag has been quick to play down talk of any rift with Varane, citing 'tactical reasons' and 'internal competition', but the Frenchman's ongoing absence from the starting line-up seems odd. There must be doubts about Varane's long-term future at United but Maguire's good form is certainly helping matters. It remains to be seen if he retains his place when Lisandro Martinez finally returns to fitness with the Argentine and Varane playing well together last season. Martinez is a real leader and favoured by Ten Hag so it's hard to imagine him sitting on the bench when fit while Maguire and Lindelof or Evans play. Until he returns, however, Ten Hag's main consideration is who provides the best accompaniment to Maguire. It's a vital decision - if United aren't scoring, they must be watertight at the back. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Champions League EFL Cup Premier League Share or comment on this article: Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling e-mail 15 shares Add comment Comments 42 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:49:01","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/11/77735019-0-image-a-2_1699875749036.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3cb3875f121fac67657fc200c25e1856","title":"Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale'","link":"https://www.dailymail.co.uk/sport/football/article-12745457/Erik-Ten-Hag-backed-transfer-war-chest-reset-squad-Sir-Jim-Ratcliffe-seals-1-3bn-deal-Man-United-boss-targets-winger-Jadon-Sancho-three-stars-sale.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Erik Ten Hag will be reportedly be backed with a transfer war chest after Sir Jim Ratcliffe has sealed his £1.3billion deal for a 25 per cent stake in Manchester United.","content":"Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale' Billionaire Ratcliffe set to assume control of the football operations of the club Man United boss Ten Hag poised to carry out 'a reset' of his squad in January City had their pants pulled down by a development team - It's All Kicking Off By David Wood for MailOnline Published: 23:50 GMT, 13 November 2023 | Updated: 00:41 GMT, 14 November 2023 e-mail 15 View comments Erik ten Hag will be reportedly be backed with a transfer war chest after Sir Jim Ratcliffe has sealed his £1.3billion deal for a 25 per cent stake in Manchester United . An agreement is close for British billionaire Ratcliffe to assume control of the football operations side of the club, almost a year after the Glazers confirmed they were open to investment. The Sun report the under-pressure Dutchman is poised to carry out 'a reset' of his squad in January - and is believed to be targeting a full-back and a winger. It is also claimed that Ratcliffe has drawn up a plan to shift banished £73million winger Jadon Sancho , £85m flop Antony , and £36m striker Anthony Martial in January. The Sun quotes a United source saying Ten Hag's eyes remain 'very firmly' fixed on securing a Champions League place. Sir Jim Ratcliffe’s £1.3bn deal for a 25 per cent stake in Man United could be agreed soon Man United boss Erik Ten Hag is poised to carry out 'a reset' of his squad in January Your browser does not support iframes. The source said: 'January will be a big month for United. The deal involving Sir Jim should be done by then, and this will free up funds for Ten Hag to reset his squad. 'He's targeting a forward who can play on either flank and a right full-back.' No documents have been signed yet in Ratcliffe's £1.3billion deal but the end of a saga that started almost a year ago is in sight. Those with knowledge of the situation say there is a chance the agreement could be announced this week, but next week is more likely. The anniversary of a tiresome process, which began when the Glazers confirmed they were open to investment, is November 22. Despite the uncertainty, Ratcliffe is reportedly preparing a fire sale to rid the Red Devils of three of its underperforming stars. The British billionaire, as part of his minority deal, would take control of football operations, and he is also thought to be set to pledge £245million to improve infrastructure. As part of his overhaul of the club, he will consider alternative plans to renovate and expand Old Trafford and improve facilities in and around the famous old ground. Old Trafford was one of England’s most iconic stadiums but the roof has been leaking for years. Its facilities are also outdated compared to Tottenham ’s new home and Manchester City ’s stadium. Ratcliffe is set to pledge £245million to improve infrastructure at the club. Man United could also sell Jadon Sancho (left) and Anthony Martial (right) in January Manchester United's famous Old Trafford ground has slowly fallen in disrepute Despite the shortcomings at Old Trafford, Mail Sport has learned that the bulk of that cash is earmarked for a new training centre rather than for the stadium. It is estimated that between £150m and £200m has been earmarked to modernise the Carrington training ground. United have lost nine of their 18 fixtures in all competitions this season and are currently sixth in the Premier League. Ten Hag's team are bottom of their group in the Champions League following the 4-3 defeat at FC Copenhagen. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Anthony Martial Erik ten Hag Antony Share or comment on this article: Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale' e-mail Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:41:42","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77763577-0-image-a-65_1699920352169.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"da8e22a54fd2b65277c84518d1274c57","title":"Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off","link":"https://www.dailymail.co.uk/sport/football/article-12744171/Pep-Guardiola-naive-saying-no-problem-selling-players-rivals-Cole-Palmer-left-Man-City-join-Chelsea-42-5m-says-Ian-Ladyman-Kicking-Off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Palmer ultimately scored a stoppage time penalty to earn Chelsea a 4-4 draw at Stamford Bridge , which prevented Man City from going three points clear at the top of the table.","content":"Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off Cole Palmer left boyhood club Manchester City to join Chelsea last summer Pep Guardiola claimed only small clubs feared selling players to their rivals It's baffling why Guardiola sold Palmer to a rival club - It's All Kicking Off By Michael Pavitt For Mailonline Published: 22:19, 13 November 2023 | Updated: 00:19, 14 November 2023 e-mail 10 View comments Ian Ladyman believes Pep Guardiola is naive for suggesting he has no problem in selling Manchester City players to rival clubs. Guardiola had made the claim ahead of Man City 's match against Chelsea on Sunday, when Cole Palmer faced his former club for the first time following his £42.5million move to Stamford Bridge. Palmer scored a stoppage time penalty to earn Chelsea a 4-4 draw at Stamford Bridge , which prevented Man City from going three points clear at the top of the table. The Man City boss had justified Palmer's sale pre-match, insisting the club have no problem letting unhappy players move on. 'I said to him [Palmer] \" Riyad Mahrez is leaving, you are going to get a chance here\". 'He said \"No, I'm not going to play here, I want to leave\" so I said 'OK, leave!', Guardiola said. Ian Ladyman believes Pep Guardiola is naive for being open to selling players to rivals The Manchester City boss claimed only small clubs refuse to sell players to potential rivals Guardiola had insisted he had no problem allowing Cole Palmer to join Chelsea in the summer Your browser does not support iframes. 'Some clubs would not want to see an asset join a potential rival. City are not like that and were happy to collect a big fee from Chelsea. 'We'd never stop a deal because of that. Why, if the transfer suits both clubs and the player? That means you are a small club. 'Big clubs make decisions for the benefit of all three parties. If a player wants to go to Chelsea or [Manchester] United or Liverpool, what is the problem if they are happy to be there and we are happy with the transfer? Another player comes here and we keep going with a good spirit.' Ladyman, Mail Sport's Football Editor, told the It's All Kicking Off podcast that Guardiola was 'naive' for for allowing the switch despite receiving a good fee for 21-year-old Palmer. 'Pep said on Friday, only small clubs, that's his quote, only small clubs refuse to sell to rivals,' Ladyman told Chris Sutton. 'Really? I think it's slightly naive to sell to a rival which is something that you rarely say about Manchester City. 'Only small clubs refused to sell to rivals, what does that mean?' Sutton suggested the Guardiola was entitled to make the comment given Manchester City's success under the Spaniard. Palmer scored from the penalty spot to earn Chelsea a 4-4 draw against Man City on Sunday The 21-year-old has been rewarded for his impressive form with a call-up to the England squad 'Well, I mean he's entitled to sort of say what he wants is, you know, especially when they're mopping up and over the years they've spent a fortune sort of you know, bringing in some of the best players across the world to play for them,' Sutton said. 'So maybe yeah, I mean, I think it's a bit of a sweeping generalisation from Pep as much as anything, and maybe a dig, well, certainly a dig at a few.' Palmer has flourished after his move from City to Chelsea in the summer, scoring four goals in 11 appearances for the Blues so far this season. His performances have been rewarded by a call-up to Gareth Southgate's England squad for their upcoming Euro 2024 qualifiers. Palmer is the latest player to move from Man City to a direct rival, after Gabriel Jesus and Oleksandr Zinchenko joined Arsenal before helping the Gunners to challenge Guardiola's side for the title last season. Ladyman suggested Guardiola should have attempted to strike a deal with Palmer to reassure him over game-time to prevent the Man City academy product from pushing to move. 'With each passing game, with each passing move, with each passing kind of wave of that magical left foot, with each passing goal for Cole Palmer, with each passing contribution of note and merit, we ask that question, 'why did City sell one of the best young players to a rival? Baffling,' Ladyman said. Ladyman suggested he would have offered Palmer a deal to convince him to stay at Man City 'Frankly, I would just have said no. I'd have said no to him. I would have said, I'd have done him a deal. 'What I would have done, I'd have said, look, you're under contract until 2026, so at the time of this conversation, he would have had three years left. Stay for one year, stay for one year. 'And if you want, if I'm not true to my word and you do not get the games that I'm telling you will, next summer we'll sit down and talk about a transfer. 'That is what I would have done if I was Manchester City.' IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Pep Guardiola Riyad Mahrez Its All Kicking Off Share or comment on this article: Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:19:25","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/16/77745707-0-image-a-26_1699894340715.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f7ec973ec336c3e1ac97b178b4e0fc7f","title":"Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea","link":"https://www.dailymail.co.uk/sport/football/article-12745133/Cole-Palmer-football-United-Man-City-Chelsea.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JACK GAUGHAN: As the country's finest young players approach the age of 18, they are graded by the FA's coaches. On where they are on the ladder and how high they might go.","content":"Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea Cole Palmer received his first senior England call-up after his superb form He has a positive arrogance on the grass, a contrast to his shy personality It's baffling why Guardiola sold Palmer to a rival club - It's All Kicking Off By Jack Gaughan for the Daily Mail Published: 22:30, 13 November 2023 | Updated: 00:17, 14 November 2023 e-mail 17 shares 50 View comments As the country's finest young players approach the age of 18, they are graded by the FA's coaches. On where they are on the ladder and how high they might go. With Cole Palmer, there was no doubt in the mind of Ian Foster, who has managed three of England's age groups. Potential: senior first team. Despite reservations elsewhere, not least within Manchester City , he was unequivocal. Foster, now Steven Gerrard 's assistant in Saudi Arabia, will have raised a smile. A first call-up by Gareth Southgate follows Palmer's eye-catching opening weeks to life at Chelsea , life as a £42.5million footballer and life away from home, away from the bosom of City. Palmer, 21, wears the look that he is destined for a long international career. A positive arrogance on the grass, in contrast to the shy individual he is away from it. His calmness in converting four penalties for Chelsea - and even taking over those duties in the first place - suggests he has the confidence to cope with the inevitable scrutiny. In taking charge of matches, his ability is obvious. Chelsea's Cole Palmer was destined for the top and has been handed a senior England call-up He has enjoyed a superb start to life at his new club and scored against Manchester City Palmer's ability is clear but this was not always appreciated at City, who weighed up releasing him Your browser does not support iframes. That was not always appreciated at City. Five years ago, they might have released him had it not been for the intervention of former academy director Jason Wilcox. Coaches and the hierarchy were split over whether he was worthy of a scholarship, which feels faintly ridiculous now. It meant he had to work harder than anyone else. He was underdeveloped physically and had to make up for that with a sharp brain. City were making big signings in his position, spending a significant amount on Ben Knight from Ipswich. Wilcox vouched for the lad from Wythenshawe and Palmer earned a contract that was shorter and less well-paid than most of his peers. The pecking order was set and Foster took calls from some at City wondering why Palmer continued to pip Knight to national squads when things were different at club level. Their trajectories since could not be more different. While Knight has spent time on loan at Crewe Alexandra, Palmer has scored in a Super Cup final and was growing increasingly frustrated by a lack of minutes with Pep Guardiola's Treble winners. He began debating a move away around March, wondering whether a loan this season might be his best option. That intensified over the summer as it became clear that City were on the hunt for a new winger with more speed, which culminated in their signing of Jeremy Doku. Palmer told them he wanted to leave, City asked him to bring them an acceptable offer, and off he went on deadline day to Stamford Bridge. The evening before he boarded the early train to Euston, Palmer sat in his car at the City Football Academy, taking it all in. At that point the move was not 100 per cent certain and he didn't know whether to say his goodbyes. Although born a Manchester United fan, 13 years of his life had been spent with the blue half of town after City spotted him at youth team NJ Wythenshawe. Palmer on Monday received his first call-up to Gareth Southgate's England senior squad During his time at City, Palmer progressed from the academy to the all-conquering first team He was always the most technically gifted, honing skills with his father, Jermaine, on Hollyhedge Park near Gatley. Until very recently, he was still hiring pitches at the local Powerleague for him and his mates during time off. There remains a street footballer within him. Add that to a mind that Guardiola has moulded and you have a serious player. Guardiola's staff loved him. It was noticeable on Sunday that, even after his dramatic late equaliser and cheeky celebration, Palmer was welcomed into the City dugout and spent a considerable amount of time with the backroom team after the 4-4 draw at Stamford Bridge. He still wants to go back and say thank you to those who took care of him in the academy, too. 'The next star,' said one City source after just a few days of first-team training. Consistently a standout performer in what can be unforgiving sessions, Palmer was following in Phil Foden's footsteps. As with Foden, City rebuffed tens of offers to take him on loan. Unlike Foden, he picked up injuries at crucial moments and then put too much pressure on himself to excite when opportunities did come. Palmer admits he tried too hard to impress last season, which is striking for someone usually so relaxed that he is horizontal. 'Cole needs to be stimulated,' said one source as Palmer was breaking into the senior set-up. Minutes were always going to be key for someone normally boasting supreme self-confidence. To satisfy that, Palmer once scored a hat-trick for the Under 23s about two hours after a cameo appearance in the Premier League. 'When you are just training and not playing, it's not good for him,' Guardiola said at the time. It also indicates he should not have an issue dropping down to England's Under 21s again if asked. Palmer eventually reached that awkward phase of being too good to sit on a Premier League bench, requiring the time and space to fully develop, but not earning the complete trust of his manager. Pep Guardiola and his coaching staff loved Palmer, who was moulded by his former manager Palmer studied Mauricio Pochettino's squad and surmised this was a chance ripe for the taking In that sense, a switch to Chelsea suited all parties. Palmer studied Mauricio Pochettino's squad and possible threats to his own spot and surmised that this was a chance ripe for the taking. 'How he's done is unsurprising,' says England Under 21s boss Lee Carsley, who played him up front, wide right, as a No 10 and deeper midfielder as they won the European Championship in the summer. 'There will be dips at times but if you keep believing in players like Cole you will get your rewards. He is definitely not overconfident but he has an assuredness about his play. Like a lot of the top players, there is no point in the game where he doesn't want the ball. That generally separates the good ones from the special ones and Cole is definitely in that bracket.' City staff were laughing at how nothing fazes him after a first Champions League goal at Club Bruges two years ago, when Raheem Sterling was first to congratulate him for his strike from the edge of the box. 'It was a \"Wow\" moment,' a source says. Nothing has ruffled him at Chelsea, either. Learning to cook, do laundry and get about on the Tube are all more daunting than the actual football. Dad Jermaine - whose heritage means Palmer also qualifies to play for Saint Kitts and Nevis - is helping him settle, but the home comforts are missing. There's also no chance to nip for a takeaway at his favourite Lebanese place near Stockport. Everything is new. And, to many, it feels like Palmer himself is too. Yet those who know him believe this was only a matter of time. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Gareth Southgate Steven Gerrard Share or comment on this article: Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea e-mail 17 shares Add comment Comments 49 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:17:58","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77763927-0-image-a-2_1699921062063.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7a6bc8b1becde87aa191c198f01f5c68","title":"Papers: Tottenham line up move for Juventus' Iling-Junior","link":"https://www.skysports.com/football/news/20876/13007680/tottenham-identify-juventus-youngster-samuel-iling-junior-as-a-potential-january-target-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... THE INDEPENDENT Tottenham have identified Juventus' England U21 international Samuel Iling-Junior as a possible target as they seek squad reinforcements in January. Trent Alexander-Arnold is studying Liverpool great Steven Gerrard, Italy legend Alessandro Pirlo and even England team-mate John Stones as he tries to get used to his \"hybrid\" midfield role. DAILY MAIL Arsenal captain Martin Odegaard missed the club's last two games after being hit in the face with a ball in training and suffering an apparent concussion. Mikel John Obi made a play for fellow Nigerian Victor Osimhen to join his former club Chelsea next summer during an interview in which the Napoli striker confirmed he turned down a \"crazy\" offer from Saudi Arabia during the last window. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Tottenham are lining up a move for Feyenoord striker Santiago Gimenez, according to reports. Wayne Rooney has handed his Birmingham City players individual fitness plans to follow during the international break after deciding they are not fit enough as he looks to stem a bad run of form since taking over as manager. Las Vegas Grand Prix organisers are confident they will sell out their return to Formula One racing on Sunday despite reports that \"tens of thousands\" of tickets remain unsold. Emma Raducanu has confirmed she will not be ready to return in what was scheduled to be her comeback event in Macau early next month. DAILY TELEGRAPH Manchester United outcast Jadon Sancho and Tottenham forward Richarlison are two of the chief targets for Saudi Arabia's Pro League when the transfer window re-opens in January. The All-England Club's plans for a £200m expansion at Wimbledon have hit a setback after Wandsworth planning officers recommended the project be refused permission. Newcastle Falcons wing Mateo Carreras has rejected substantial offers from rival clubs in England and will join French side Bayonne at the end of the season. DAILY MIRROR Rio Ferdinand says he is \"baffled\" why Manchester United might be considering current Crystal Palace sporting director Dougie Freedman for a major role at Old Trafford under Sir Jim Ratcliffe's new backroom regime. Carlton Palmer is not sure Birmingham City's position as a Championship club will be enough to tempt Wrexham midfielder Elliot Lee to leave the ambitious Welsh outfit. THE SUN Manchester United are targeting £35m-rated defender Jean-Clair Todibo as they look to bolster their options by bringing in a player they wanted in the summer from Sir Jim Ratcliffe's French club Nice. Neil Warnock has given his five-point plan to rescue VAR and says referees' boss Howard Webb should appoint an independent group of former players and managers to operate the technology. Erik ten Hag will receive money to spend in January once Sir Jim Ratcliffe's deal to purchase a minority holding in Manchester United is concluded. A full-back and winger are believed to be two of the Dutchman's priorities. Brighton boss Roberto de Zerbi could be facing a touchline ban over his comments that he doesn't \"like 80 per cent of referees in England\" with the PGMOL asking if the Italian should be found in breach of the Participant Behaviour Charter. THE ATHLETIC Nottingham Forest's bid to increase capacity at the City Ground has included ideas similar to those used at Stadium 974 during the Qatar World Cup, where 974 shipping containers were utilised. Leeds United are set to land a British record transfer fee for a 15-year-old player when teen sensation Finlay Gorman leaves the club for Manchester City in the near future. The fee will be seven figures and include a series of future performance clauses. THE TIMES A second IPL franchise has made an offer of investment in Yorkshire to rival Mike Ashley's efforts to buy Headingley Stadium in what is being described as a partnership and \"not just a real estate proposition\". THE GUARDIAN Eritrea withdrew from the 2026 World Cup qualifying process due to fears that players would attempt to seek political asylum during trips abroad, according to sources close to the African nation's squad. DAILY RECORD Andy Halliday says Rangers will live to regret their decision, taken when former boss Michael Beale was in charge, not to pursue a deal for now-Celtic winger Luis Palma. Kilmarnock are set to ditch their plastic pitch, which has often been criticised by opposition managers, and return to a grass surface at Rugby Park. GLASGOW EVENING TIMES Rangers are hopeful of appointing a new director of football in the next fortnight. The role has been vacant since Ross Wilson left Ibrox in April. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-13 23:36:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ba15e3665b43d9bc0bb1e1ec1c021c36","title":"Sir Jim Ratcliffe could sanction signing of 17-year-old wonderkid who punished Man Utd","link":"https://www.dailystar.co.uk/sport/football/man-utd-transfer-news-ratcliffe-31431698","keywords":["Sport"],"creator":null,"video_url":null,"description":"Sir Jim Ratcliffe could get into the swing of signing star prospects with a deal for a Champions League ace who will be a very familiar face to Man Utd fans","content":"Sir Jim Ratcliffe could sanction the signing of 's rival - but not bring him to Old Trafford. side were punished against Copenhagen last week with a 4-3 comeback defeat that was finished off by Swedish forward Roony Bardghji. The 17-year-old might just have booked himself a transfer with his winning goal - his tenth of the season in Denmark. Bardghji made his first-team debut at the age of 16 and six days back in November of 2021 and has since scored 15 goals across 57 fixtures and won back-to-back Danish Superliga titles. report that Bardghji is on the radar of Ratcliffe's Ligue 1 outfit Nice as well as a series of clubs on the back of the substitute performance that put United on the brink of a European exit altogether. as well as Newcastle and are said to be keeping an eye on the forward who is contracted to his current club until 2025. Copenhagen are said to be keen on keeping hold of their young prospect until the summer rather than selling up in January. Meanwhile, at Old Trafford, Ratcliffe is yet to officially take up his new role that involves a 25% ownership. He is thought to be taking the reins on football matters including transfers as well as the position of his manager. Ten Hag's men are current the form team in the Premier League with four wins from five matches to climb up to within seven points of leaders . The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Ten Hag was not in attendance at the on Monday evening having had plans that he couldn't change. The Dutchman, 53, had an 'unbreakable and longstanding personal commitment in the Netherlands' which was given as the reason for his absence by the club Sir Alex Ferguson was among the attendees as were Roy Keane, Prince William and Gareth Southgate with four also there.","pubDate":"2023-11-13 22:53:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31431683.ece/ALTERNATES/s98/0_ECONOMY-ANTWERP-HARBOR-INVESTMENT.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d64961fbe5c3107e20c91e9e9256b1ae","title":"Steven Gerrard left without AWOL Al-Ettifaq star who drives home – 'as he was tired'","link":"https://www.dailystar.co.uk/sport/football/steven-gerrard-awol-al-ettifaq-31431387","keywords":["Sport"],"creator":null,"video_url":null,"description":"Steven Gerrard was incensed with one of his players who went AWOL before a game who claimed that he was too tired to play and made his way home","content":"was noticeably displeased with the reasoning one of his Al-Ettifaq players gave when going AWOL before a match. The manager of the publicly hit back at Mohammed Al-Kuwaykibi after the winger missed his side's 0-0 draw with Al-Feiha on Saturday (November 11). The 28-year-old was nowhere to be found before their league clash which left the legend incensed with the Saudi Arabia international. The winger said he was too tired to play on the weekend despite the Al-Ettifaq medical staff clearing him for action against Al-Feiha. Following the game, Gerrard spoke to the media about the situation and said: \"He got in his car and went home without permission. \"He was analysed by the doctor, the doctor said he was good to train but he got in his car and said he was tired and went home. I am still looking for reasons and answers as to why he wasn't here to help us today.\" The 43-year-old's comments may stir up tension with Al-Kuwaykibi - who has been at the club since 2016 - but the manager was backed by the team who released a statement of support for Gerrard. The statement read: \"We refuse to criticise the team's coach, as this is not the first time that Muhammad Al-Kuwaykibi has taken the same position. In Al-Nasr's first match in the league, he missed the main exercises with the same excuse.\" It's not been a particularly fruitful season for Al-Kuwaykibi who has played in 11 league games so far but has yet to score and has only registered one assist. The former England international is enduring rough form with his team currently sit seventh in the league after a run of just one win in six games. They are 13 points off league leaders Al-Hilal, despite a strong start to the season that saw them win five of their opening seven matches. A notable theme throughout the season has been their struggle for goals, scoring just 19 so far - the second-lowest in the top half of the table. Former and striker Moussa Dembele is their top scorer with seven league goals.","pubDate":"2023-11-13 22:51:30","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31431525.ece/ALTERNATES/s98/0_Al-Nassr-v-Al-Ettifaq-Saudi-King-Cup-of-Champions.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3b1022d717da46f400f462f3fb1b6e8f","title":"BetMGM Bonus Code NYPNEWS1500: Get 20% match or $200 bonus bets for Broncos-Bills, any game","link":"https://nypost.com/2023/11/13/sports/betmgm-bonus-code-nypnews1500-get-20-match-or-200-bonus-bets-for-broncos-bills-any-game/","keywords":null,"creator":["Action Network"],"video_url":null,"description":"The BetMGM bonus code NYPNEWS1500 lets new customers get a deposit match up to $1,500 in bonus bets for the Buffalo Bills hosting the Denver Broncos.","content":"NFL Week 10 wraps up tonight and New York Post readers can cash in with one of two new customer offers from BetMGM Sportsbook . These offers use BetMGM bonus codes NYPNEWS1500 or NPNEWSGET . Here’s what to expect from each offer: The exclusive new customer offer from BetMGM carries a 20% deposit match worth up to $1,500 in bonus bets. For instance, if you deposited $200, you’d get $40 in bonus bets, and so on up to $1,500 (meaning $7,500 is the max initial deposit for this offer). Kentucky bettors can use the BetMGM Kentucky bonus code NYPNEWS1500 to get the same deposit match offer. This offer is not available in New York and Washington DC. If you’re interested in another fun sportsbook, check out the new ESPN BET promo code before it launches! Click the buttons below to learn more. All offers work for all BetMGM sports markets. Tonight’s ‘Monday Night Football’ matchup takes us to Buffalo where Josh Allen and the Bills host the Denver Broncos. Buffalo is favored by 7.5 points on BetMGM Sportsbook and that line just seems a bit too high. The Bills just aren’t as impressive as they have been in recent years and Denver appears to have figured some things out. Get the free Action Network app for expert picks, live odds, bet tracking and more. Buffalo has been very average in its last five games, losing three and winning two in close games. Allen is having a decent season, but his nine interceptions have cost the Bills games this year and it feels like some of his reckless decisions continue each week. Right off a bye, the Broncos appear to be on a bit of an upswing. They ground out two home wins over the Packers and Chiefs in which their defense played well and they ran the ball fairly effectively. Russell Wilson was also able to play mistake-free football in that stretch. I don’t expect the Bills to lose this game, but they haven’t been playing well enough to expect them to win by eight points. Take the Broncos to cover on bet365 Sportsbook with bonus code NYPNEWS .","pubDate":"2023-11-13 22:45:00","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/11/GettyImages-1780251575.jpg?quality=90&strip=all","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"4c1b0951c78e3cb6c18de21ac1f3072b","title":"Heavy loss to Celtic is a reality check for Aberdeen, says captain Graeme Shinnie","link":"https://www.pressandjournal.co.uk/fp/sport/football/aberdeen-fc/6256615/humiliating-6-0-loss-to-celtic-delivers-aberdeen-reality-check-says-graeme-shinnie/","keywords":["Aberdeen FC","Aberdeen","Celtic FC","Europa Conference League","Graeme Shinnie"],"creator":["Sean Wallace"],"video_url":null,"description":"Shinnie has reiterated the Dons squad must 'deal with' the combined demands of European group stage action and domestic commitments.","content":"Captain Graeme Shinnie believes the hammering by Celtic is a reality check of the levels Aberdeen need to reach. The straight-talking skipper accepts losing 6-0 at Parkhead is not acceptable. For Shinnie, Sunday’s heavy loss was particularly hard to take as it stopped a recent resurgence in form from the Dons. Aberdeen drew 2-2 with Group G leaders PAOK in the Europa Conference League fewer than 72 hours before the Parkhead shocker. Prior to the Euro clash in Greece, the Reds secured a Viaplay Cup final slot and also defeated Motherwell 4-2 away in the Premiership. Losing so heavily at Parkhead brought Aberdeen crashing back to earth. Shinnie said: “We went into the Celtic game in pretty good form, but were brought back to reality a little bit as to where our performances need to be. “Overall, for the whole game, we were not at the races and it wasn’t acceptable. “It’s hard. “You single out this game – however, we won at Motherwell, get through to a cup final and had a good performance over in PAOK. “That was three positive performances so this (Celtic) is a sore one to take.” Exertions in Greece ‘no excuse’ for Parkhead shocker Aberdeen flew back from Greece on Friday after The Dons ended the 100 percent record of PAOK in Group G. In contrast, Premiership Hearts had been overwhelmed 4-0 at the Toumba Stadium by the Greek Super League side in the Europa Conference League play-off earlier this season. But Shinnie was adamant the exertions in Greece were not at the root of the performance against Celtic. He said: “It’s no excuse. “Of course, we are not going to get away from the fact it has been a gruelling schedule. “I think five away games in a row, there’s no getting away from that, but it’s no excuse for that performance. “If anything, you can maybe tire towards the end, but we looked tired from the start – you can’t blame that on fatigue. “It’s just not been good enough and, overall, like the manager said, not acceptable as a team.” ‘We need to deal with it as a team’ Aberdeen have won just one of the six games immediately following European action this season, losing three and drawing twice. Facing Celtic at Parkhead on Sunday was the culmination of five consecutive away games for the Dons over just 16 days. Rather than complain about the schedule, Shinnie insists the Dons must deal with it. He would rather have the congested fixture list that comes with Euro group action and domestic cup progression than inactivity. The 32-year-old said: “This is where we want to be. “In European competitions and in cup finals, fighting to get into cup finals. “We can’t use it as an excuse because it is exactly where this club wants to be. “So we need to deal with it as a team.” Slow start played into Celtic’s hands Aberdeen were 2-0 down after 16 minutes to reigning Premiership champions Celtic. They went 3-0 behind to a second half penalty before a complete collapse late on when they conceded three goals in injury time. Shinnie accepts The Dons have failed to win in the previous 21 games in all competitions where they have let in the opening goal. Scotland international Shinnie said: “Going to Celtic, you know they like to start fast. “They like to try and come at you quick and almost effectively try and win the game in the first 20 to 30 minutes. “Being 2-0 down in 16 minutes is exactly what they wanted and it was such a slow start for us. “That’s a frustrating part of it.”","pubDate":"2023-11-13 22:30:11","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/11/20915905_54231938-291xi3rch-e1699882186469-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ecdd4ca87a27cf5a25afc4061c6f474f","title":"Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast'","link":"https://www.dailymail.co.uk/sport/football/article-12745703/Man-United-refuse-enter-talks-Juventus-potential-Jadon-Sancho-loan-club-wait-permanent-bids-Old-Trafford-outcast.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Sancho looks to have no future at Old Trafford with the forward currently training on his own at the academy and barred from using first team facilities at United's Carrington training base.","content":"Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast' Jadon Sancho remains banished from the first team squad and is training alone Juve had been interested in taking the Englishman on loan in January It’s a three-team title race... Toney could lead Arsenal to glory: It's All Kicking Off By Spencer Morgan For Mailonline Published: 20:05 EST, 13 November 2023 | Updated: 20:13 EST, 13 November 2023 e-mail 6 shares 2 View comments Manchester United have reportedly shut down attempts from Juventus to try and negotiate a loan move for outcast Jadon. Sancho looks to have no future at Old Trafford with the forward currently training on his own at the academy and barred from using first team facilities at United's Carrington training base. Sancho's exile followed the winger publicly branding manager Erik ten Hag a liar over his reasons for dropping him for the 3-1 away defeat by Arsenal in September. And Fabrizio Romano claims Juve had hoped to offer a temporary solution but United are looking for a permanent one. He tweeted: 'U nderstand Juventus asked for information on Jadon Sancho deal in recent days. Man United have refused to talk with Juventus about a possible loan deal for Jadon Sancho 'He’s set to leave Man United in January, Juve are interested but only on loan plus part of salary covered by #MUFC. 'No negotiations yet as Man Utd prefer to wait for permanent deal bids.' A number of Audi Arabian clubs are believed to be interested in Sancho and United will no doubt be hoping to sell to the highest bidder. Sancho joined the Red Devils for a fee of £73m but was never able to find the form that made him a star for Borussia Dortmund. Sancho's exile followed the winger publicly branding manager Erik ten Hag a liar IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/us/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Jadon Sancho Erik ten Hag Share or comment on this article: Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast' e-mail 6 shares Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 01:13:46","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77765101-0-image-a-24_1699923586134.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"553b7661e1a1ee405677598e82722ece","title":"Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling","link":"https://www.dailymail.co.uk/sport/football/article-12742981/Marcus-Rashford-misfiring-forwards-uncertainty-strongest-midfield-Harry-Maguires-best-partner-Erik-ten-Hag-plenty-ponder-international-fortnight-Man-United-struggling.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Saturday's slender win over Luton Town has offered Ten Hag some much-needed respite and it's astonishing to see United sitting sixth in the table for all their problems.","content":"Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling Saturday's 1-0 victory over Luton has given Erik ten Hag some breathing space But shaky start to the season leave him searching for answers to many questions City had their pants pulled down by a development team - It's All Kicking Off By Adam Shergold for MailOnline Published: 22:00, 13 November 2023 | Updated: 00:49, 14 November 2023 e-mail 15 shares 42 View comments Peace at last for Erik ten Hag . As most of his Manchester United players jet off to represent their countries for the final time in 2023, the coach has a couple of weeks breathing space to work on answers to many questions. Saturday's slender win over Luton Town has offered Ten Hag some much-needed respite and it's astonishing to see United sitting sixth in the Premier League table for all their problems. Indeed, with four wins from their last five games, United are among the league's form sides. But league form unfortunately be taken in isolation from United's shocking Champions League campaign and feeble Carabao Cup defence. Erik ten Hag still has plenty to ponder despite Manchester United's win over Luton on Saturday The Reds have lost as many matches as they've won during a shaky start to the season Your browser does not support iframes. They have lost nine times and won nine times overall this season - they don't seem to do draws. After the internationals, United face a tricky trio of away games against Everton, Galatasaray and Newcastle United that may dictate the direction of their whole season. Positive results may chart a course for another top-four finish and Champions League football after Christmas. Further defeats could see United slide into mid-table mediocrity and the Europa League - or even out of Europe entirely. Here's a closer look at some of the problems Ten Hag needs to solve over the coming fortnight. Finishing practice for the forwards! United were indebted yet again to one of their defenders as they squeezed past Luton at Old Trafford. Victor Lindelof was on hand to fire home the winner , just as Raphael Varane, Harry Maguire and Diogo Dalot made match-winning contributions in earlier games. Of their 13 Premier League goals so far, three have come from defenders, nine from midfielders and just one from the strikers. Victor Lindelof (left) fires home United's winner against Luton as another defender saved them Marcus Rashford endured another blank afternoon as his struggles in front of goal continued That was Marcus Rashford's goal in the 3-1 defeat at Arsenal back in September, with nothing so far in the league from Rasmus Hojlund, Antony, Alejandro Garnacho or Anthony Martial. Ten Hag isn't concerned about Hojlund's Premier League goal drought because the £72million Dane has netted five times in Europe. His finishing touch deserted him again versus Luton prior to leaving the pitch late on with a hamstring injury that has forced him out of Denmark duty. The same thing happened to Garnacho, who spurned a very good one-on-one opportunity in the first-half, and needs to be more clinical in such situations. There is growing indifference among United fans to Antony, who is in growing danger of being remembered as a very expensive flop. The Brazilian has been jeered in recent games and rumours abound that United could cut their losses on him as soon as January. Alejandro Garnacho wasn't able to convert a very good one-on-one opening in the first-half The young Argentine is one of several United forwards in need of extra finishing practice Antony is far too predictable when on the ball and has struggled for goals and assists Man United fixtures Premier League unless stated November 26 Everton (A) November 29 Galatasaray (A) Champions League group stage December 2 Newcastle United (A) December 6 Chelsea (H) December 9 Bournemouth (H) December 12 Bayern Munich (H) Champions League group stage <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Rashford, meanwhile, is a shadow of the devastatingly effective goalscorer we saw last season and his goal shortage helps explain why United are struggling to finish off even modest opponents. Ten Hag maintains everyone will come good but United have scored just 13 times in 12 league games and cannot keep relying on their defenders to bail them out. Better service for Hojlund Tied into United's striker troubles has been the theme of Hojlund not receiving enough service , especially in Premier League games. There appears to be little cohesion between the front three, regardless of who plays. Rashford, Antony and Garnacho are all more likely to cut infield and take a shot when they get into a good position rather than look to feed Hojlund, even if he's in a better position. With Rashford's form in a rut, Garnacho still quite raw with his finishing and Antony far too predictable with his intentions, this leads to frustration. When they do try and combine, such as Rashford's hooked back-post cross for Hojlund to head the opener against Galatasaray, it proves effective but most of his service comes from the midfielders. Rasmus Hojlund's Premier League goal drought continued before he was forced off injured There isn't a great deal of cohesion as yet between £72m Hojlund and United's other forwards There has been an element of Rashford looking ever-more desperate to get a goal and taking on more chances as he searches for the moment that breaks the logjam. If the nascent understanding between Rashford and Hojlund can develop - and it will take a bit of time - United should have a deadly strike force. The may, however, be limited time to work on this now with Rashford away on international duty and Hojlund sidelined anyway. Midfield clarity A succession of injury blows have made it difficult for Ten Hag to pick a settled line-up during the early months of the season. This has been especially true at left-back but also in key midfield positions, contributing to a feeling Ten Hag isn't entirely sure of his best combination. Christian Eriksen has picked up a knee injury, joining the out-of-sorts Casemiro on the treatment table, though the Brazilian should be fit again soon. Summer arrival Mason Mount missed five games with a knock, while loan signing Sofyan Amrabat was forced to deputise at left-back. Christian Eriksen became the latest United player to suffer an injury this season Scott McTominay may have left United back in the summer but has been in excellent form Ten Hag has been indebted to Scott McTominay , who may have departed Old Trafford over the summer but has chipped in with some strong performances and vital goals. But Ten Hag needs to have a think about his best midfield going forward. Last season, United's combination of Casemiro, Eriksen and Bruno Fernandes remained unbeaten for some time. Currently, there isn't an obvious first-choice trio. Casemiro has looked off the pace, while playing Eriksen or Mount can leave United exposed. Conversely, partnering two of Casemiro, McTominay or Amrabat together can stifle their creativity and make it hard to break down opponents. We have seen Eriksen hurriedly introduced during games to provide a bit more creativity, while in others opponents have enjoyed so much freedom in the centre of the park. Ten Hag needs to consider who plays there if he only had the luxury of everyone being fit. United look like they need a bit of consistency in this important department. It's difficult to know whether Casemiro would make United's first-choice midfield if fit Who plays alongside Maguire? In a conundrum few saw coming at the start of the season, it isn't a case of does Harry Maguire have an Old Trafford future but who plays alongside him in defence. The England centre-half has shown remarkable resilience after being dropped by Ten Hag last season, stripped of the captaincy in the summer and roundly ridiculed. Maguire always wanted to stay at United and fight for his place and that decision has now been vindicated. He has stepped up and performed at a difficult time for the team. Against Luton, he was paired with Lindelof in a throwback to the Ole Gunnar Solskjaer days and we've also seen an improbable partnership with 35-year-old Jonny Evans. Victor Lindelof and Harry Maguire reprised their central defensive partnership on Saturday There are doubts now over Raphael Varane with Ten Hag continuing to keep him out the side Ten Hag has been quick to play down talk of any rift with Varane, citing 'tactical reasons' and 'internal competition', but the Frenchman's ongoing absence from the starting line-up seems odd. There must be doubts about Varane's long-term future at United but Maguire's good form is certainly helping matters. It remains to be seen if he retains his place when Lisandro Martinez finally returns to fitness with the Argentine and Varane playing well together last season. Martinez is a real leader and favoured by Ten Hag so it's hard to imagine him sitting on the bench when fit while Maguire and Lindelof or Evans play. Until he returns, however, Ten Hag's main consideration is who provides the best accompaniment to Maguire. It's a vital decision - if United aren't scoring, they must be watertight at the back. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Champions League EFL Cup Premier League Share or comment on this article: Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling e-mail 15 shares Add comment Comments 42 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:49:01","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/11/77735019-0-image-a-2_1699875749036.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3cb3875f121fac67657fc200c25e1856","title":"Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale'","link":"https://www.dailymail.co.uk/sport/football/article-12745457/Erik-Ten-Hag-backed-transfer-war-chest-reset-squad-Sir-Jim-Ratcliffe-seals-1-3bn-deal-Man-United-boss-targets-winger-Jadon-Sancho-three-stars-sale.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Erik Ten Hag will be reportedly be backed with a transfer war chest after Sir Jim Ratcliffe has sealed his £1.3billion deal for a 25 per cent stake in Manchester United.","content":"Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale' Billionaire Ratcliffe set to assume control of the football operations of the club Man United boss Ten Hag poised to carry out 'a reset' of his squad in January City had their pants pulled down by a development team - It's All Kicking Off By David Wood for MailOnline Published: 23:50 GMT, 13 November 2023 | Updated: 00:41 GMT, 14 November 2023 e-mail 15 View comments Erik ten Hag will be reportedly be backed with a transfer war chest after Sir Jim Ratcliffe has sealed his £1.3billion deal for a 25 per cent stake in Manchester United . An agreement is close for British billionaire Ratcliffe to assume control of the football operations side of the club, almost a year after the Glazers confirmed they were open to investment. The Sun report the under-pressure Dutchman is poised to carry out 'a reset' of his squad in January - and is believed to be targeting a full-back and a winger. It is also claimed that Ratcliffe has drawn up a plan to shift banished £73million winger Jadon Sancho , £85m flop Antony , and £36m striker Anthony Martial in January. The Sun quotes a United source saying Ten Hag's eyes remain 'very firmly' fixed on securing a Champions League place. Sir Jim Ratcliffe’s £1.3bn deal for a 25 per cent stake in Man United could be agreed soon Man United boss Erik Ten Hag is poised to carry out 'a reset' of his squad in January Your browser does not support iframes. The source said: 'January will be a big month for United. The deal involving Sir Jim should be done by then, and this will free up funds for Ten Hag to reset his squad. 'He's targeting a forward who can play on either flank and a right full-back.' No documents have been signed yet in Ratcliffe's £1.3billion deal but the end of a saga that started almost a year ago is in sight. Those with knowledge of the situation say there is a chance the agreement could be announced this week, but next week is more likely. The anniversary of a tiresome process, which began when the Glazers confirmed they were open to investment, is November 22. Despite the uncertainty, Ratcliffe is reportedly preparing a fire sale to rid the Red Devils of three of its underperforming stars. The British billionaire, as part of his minority deal, would take control of football operations, and he is also thought to be set to pledge £245million to improve infrastructure. As part of his overhaul of the club, he will consider alternative plans to renovate and expand Old Trafford and improve facilities in and around the famous old ground. Old Trafford was one of England’s most iconic stadiums but the roof has been leaking for years. Its facilities are also outdated compared to Tottenham ’s new home and Manchester City ’s stadium. Ratcliffe is set to pledge £245million to improve infrastructure at the club. Man United could also sell Jadon Sancho (left) and Anthony Martial (right) in January Manchester United's famous Old Trafford ground has slowly fallen in disrepute Despite the shortcomings at Old Trafford, Mail Sport has learned that the bulk of that cash is earmarked for a new training centre rather than for the stadium. It is estimated that between £150m and £200m has been earmarked to modernise the Carrington training ground. United have lost nine of their 18 fixtures in all competitions this season and are currently sixth in the Premier League. Ten Hag's team are bottom of their group in the Champions League following the 4-3 defeat at FC Copenhagen. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Anthony Martial Erik ten Hag Antony Share or comment on this article: Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale' e-mail Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:41:42","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77763577-0-image-a-65_1699920352169.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"da8e22a54fd2b65277c84518d1274c57","title":"Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off","link":"https://www.dailymail.co.uk/sport/football/article-12744171/Pep-Guardiola-naive-saying-no-problem-selling-players-rivals-Cole-Palmer-left-Man-City-join-Chelsea-42-5m-says-Ian-Ladyman-Kicking-Off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Palmer ultimately scored a stoppage time penalty to earn Chelsea a 4-4 draw at Stamford Bridge , which prevented Man City from going three points clear at the top of the table.","content":"Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off Cole Palmer left boyhood club Manchester City to join Chelsea last summer Pep Guardiola claimed only small clubs feared selling players to their rivals It's baffling why Guardiola sold Palmer to a rival club - It's All Kicking Off By Michael Pavitt For Mailonline Published: 22:19, 13 November 2023 | Updated: 00:19, 14 November 2023 e-mail 10 View comments Ian Ladyman believes Pep Guardiola is naive for suggesting he has no problem in selling Manchester City players to rival clubs. Guardiola had made the claim ahead of Man City 's match against Chelsea on Sunday, when Cole Palmer faced his former club for the first time following his £42.5million move to Stamford Bridge. Palmer scored a stoppage time penalty to earn Chelsea a 4-4 draw at Stamford Bridge , which prevented Man City from going three points clear at the top of the table. The Man City boss had justified Palmer's sale pre-match, insisting the club have no problem letting unhappy players move on. 'I said to him [Palmer] \" Riyad Mahrez is leaving, you are going to get a chance here\". 'He said \"No, I'm not going to play here, I want to leave\" so I said 'OK, leave!', Guardiola said. Ian Ladyman believes Pep Guardiola is naive for being open to selling players to rivals The Manchester City boss claimed only small clubs refuse to sell players to potential rivals Guardiola had insisted he had no problem allowing Cole Palmer to join Chelsea in the summer Your browser does not support iframes. 'Some clubs would not want to see an asset join a potential rival. City are not like that and were happy to collect a big fee from Chelsea. 'We'd never stop a deal because of that. Why, if the transfer suits both clubs and the player? That means you are a small club. 'Big clubs make decisions for the benefit of all three parties. If a player wants to go to Chelsea or [Manchester] United or Liverpool, what is the problem if they are happy to be there and we are happy with the transfer? Another player comes here and we keep going with a good spirit.' Ladyman, Mail Sport's Football Editor, told the It's All Kicking Off podcast that Guardiola was 'naive' for for allowing the switch despite receiving a good fee for 21-year-old Palmer. 'Pep said on Friday, only small clubs, that's his quote, only small clubs refuse to sell to rivals,' Ladyman told Chris Sutton. 'Really? I think it's slightly naive to sell to a rival which is something that you rarely say about Manchester City. 'Only small clubs refused to sell to rivals, what does that mean?' Sutton suggested the Guardiola was entitled to make the comment given Manchester City's success under the Spaniard. Palmer scored from the penalty spot to earn Chelsea a 4-4 draw against Man City on Sunday The 21-year-old has been rewarded for his impressive form with a call-up to the England squad 'Well, I mean he's entitled to sort of say what he wants is, you know, especially when they're mopping up and over the years they've spent a fortune sort of you know, bringing in some of the best players across the world to play for them,' Sutton said. 'So maybe yeah, I mean, I think it's a bit of a sweeping generalisation from Pep as much as anything, and maybe a dig, well, certainly a dig at a few.' Palmer has flourished after his move from City to Chelsea in the summer, scoring four goals in 11 appearances for the Blues so far this season. His performances have been rewarded by a call-up to Gareth Southgate's England squad for their upcoming Euro 2024 qualifiers. Palmer is the latest player to move from Man City to a direct rival, after Gabriel Jesus and Oleksandr Zinchenko joined Arsenal before helping the Gunners to challenge Guardiola's side for the title last season. Ladyman suggested Guardiola should have attempted to strike a deal with Palmer to reassure him over game-time to prevent the Man City academy product from pushing to move. 'With each passing game, with each passing move, with each passing kind of wave of that magical left foot, with each passing goal for Cole Palmer, with each passing contribution of note and merit, we ask that question, 'why did City sell one of the best young players to a rival? Baffling,' Ladyman said. Ladyman suggested he would have offered Palmer a deal to convince him to stay at Man City 'Frankly, I would just have said no. I'd have said no to him. I would have said, I'd have done him a deal. 'What I would have done, I'd have said, look, you're under contract until 2026, so at the time of this conversation, he would have had three years left. Stay for one year, stay for one year. 'And if you want, if I'm not true to my word and you do not get the games that I'm telling you will, next summer we'll sit down and talk about a transfer. 'That is what I would have done if I was Manchester City.' IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Pep Guardiola Riyad Mahrez Its All Kicking Off Share or comment on this article: Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:19:25","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/16/77745707-0-image-a-26_1699894340715.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f7ec973ec336c3e1ac97b178b4e0fc7f","title":"Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea","link":"https://www.dailymail.co.uk/sport/football/article-12745133/Cole-Palmer-football-United-Man-City-Chelsea.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JACK GAUGHAN: As the country's finest young players approach the age of 18, they are graded by the FA's coaches. On where they are on the ladder and how high they might go.","content":"Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea Cole Palmer received his first senior England call-up after his superb form He has a positive arrogance on the grass, a contrast to his shy personality It's baffling why Guardiola sold Palmer to a rival club - It's All Kicking Off By Jack Gaughan for the Daily Mail Published: 22:30, 13 November 2023 | Updated: 00:17, 14 November 2023 e-mail 17 shares 50 View comments As the country's finest young players approach the age of 18, they are graded by the FA's coaches. On where they are on the ladder and how high they might go. With Cole Palmer, there was no doubt in the mind of Ian Foster, who has managed three of England's age groups. Potential: senior first team. Despite reservations elsewhere, not least within Manchester City , he was unequivocal. Foster, now Steven Gerrard 's assistant in Saudi Arabia, will have raised a smile. A first call-up by Gareth Southgate follows Palmer's eye-catching opening weeks to life at Chelsea , life as a £42.5million footballer and life away from home, away from the bosom of City. Palmer, 21, wears the look that he is destined for a long international career. A positive arrogance on the grass, in contrast to the shy individual he is away from it. His calmness in converting four penalties for Chelsea - and even taking over those duties in the first place - suggests he has the confidence to cope with the inevitable scrutiny. In taking charge of matches, his ability is obvious. Chelsea's Cole Palmer was destined for the top and has been handed a senior England call-up He has enjoyed a superb start to life at his new club and scored against Manchester City Palmer's ability is clear but this was not always appreciated at City, who weighed up releasing him Your browser does not support iframes. That was not always appreciated at City. Five years ago, they might have released him had it not been for the intervention of former academy director Jason Wilcox. Coaches and the hierarchy were split over whether he was worthy of a scholarship, which feels faintly ridiculous now. It meant he had to work harder than anyone else. He was underdeveloped physically and had to make up for that with a sharp brain. City were making big signings in his position, spending a significant amount on Ben Knight from Ipswich. Wilcox vouched for the lad from Wythenshawe and Palmer earned a contract that was shorter and less well-paid than most of his peers. The pecking order was set and Foster took calls from some at City wondering why Palmer continued to pip Knight to national squads when things were different at club level. Their trajectories since could not be more different. While Knight has spent time on loan at Crewe Alexandra, Palmer has scored in a Super Cup final and was growing increasingly frustrated by a lack of minutes with Pep Guardiola's Treble winners. He began debating a move away around March, wondering whether a loan this season might be his best option. That intensified over the summer as it became clear that City were on the hunt for a new winger with more speed, which culminated in their signing of Jeremy Doku. Palmer told them he wanted to leave, City asked him to bring them an acceptable offer, and off he went on deadline day to Stamford Bridge. The evening before he boarded the early train to Euston, Palmer sat in his car at the City Football Academy, taking it all in. At that point the move was not 100 per cent certain and he didn't know whether to say his goodbyes. Although born a Manchester United fan, 13 years of his life had been spent with the blue half of town after City spotted him at youth team NJ Wythenshawe. Palmer on Monday received his first call-up to Gareth Southgate's England senior squad During his time at City, Palmer progressed from the academy to the all-conquering first team He was always the most technically gifted, honing skills with his father, Jermaine, on Hollyhedge Park near Gatley. Until very recently, he was still hiring pitches at the local Powerleague for him and his mates during time off. There remains a street footballer within him. Add that to a mind that Guardiola has moulded and you have a serious player. Guardiola's staff loved him. It was noticeable on Sunday that, even after his dramatic late equaliser and cheeky celebration, Palmer was welcomed into the City dugout and spent a considerable amount of time with the backroom team after the 4-4 draw at Stamford Bridge. He still wants to go back and say thank you to those who took care of him in the academy, too. 'The next star,' said one City source after just a few days of first-team training. Consistently a standout performer in what can be unforgiving sessions, Palmer was following in Phil Foden's footsteps. As with Foden, City rebuffed tens of offers to take him on loan. Unlike Foden, he picked up injuries at crucial moments and then put too much pressure on himself to excite when opportunities did come. Palmer admits he tried too hard to impress last season, which is striking for someone usually so relaxed that he is horizontal. 'Cole needs to be stimulated,' said one source as Palmer was breaking into the senior set-up. Minutes were always going to be key for someone normally boasting supreme self-confidence. To satisfy that, Palmer once scored a hat-trick for the Under 23s about two hours after a cameo appearance in the Premier League. 'When you are just training and not playing, it's not good for him,' Guardiola said at the time. It also indicates he should not have an issue dropping down to England's Under 21s again if asked. Palmer eventually reached that awkward phase of being too good to sit on a Premier League bench, requiring the time and space to fully develop, but not earning the complete trust of his manager. Pep Guardiola and his coaching staff loved Palmer, who was moulded by his former manager Palmer studied Mauricio Pochettino's squad and surmised this was a chance ripe for the taking In that sense, a switch to Chelsea suited all parties. Palmer studied Mauricio Pochettino's squad and possible threats to his own spot and surmised that this was a chance ripe for the taking. 'How he's done is unsurprising,' says England Under 21s boss Lee Carsley, who played him up front, wide right, as a No 10 and deeper midfielder as they won the European Championship in the summer. 'There will be dips at times but if you keep believing in players like Cole you will get your rewards. He is definitely not overconfident but he has an assuredness about his play. Like a lot of the top players, there is no point in the game where he doesn't want the ball. That generally separates the good ones from the special ones and Cole is definitely in that bracket.' City staff were laughing at how nothing fazes him after a first Champions League goal at Club Bruges two years ago, when Raheem Sterling was first to congratulate him for his strike from the edge of the box. 'It was a \"Wow\" moment,' a source says. Nothing has ruffled him at Chelsea, either. Learning to cook, do laundry and get about on the Tube are all more daunting than the actual football. Dad Jermaine - whose heritage means Palmer also qualifies to play for Saint Kitts and Nevis - is helping him settle, but the home comforts are missing. There's also no chance to nip for a takeaway at his favourite Lebanese place near Stockport. Everything is new. And, to many, it feels like Palmer himself is too. Yet those who know him believe this was only a matter of time. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Gareth Southgate Steven Gerrard Share or comment on this article: Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea e-mail 17 shares Add comment Comments 49 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:17:58","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77763927-0-image-a-2_1699921062063.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7a6bc8b1becde87aa191c198f01f5c68","title":"Papers: Tottenham line up move for Juventus' Iling-Junior","link":"https://www.skysports.com/football/news/20876/13007680/tottenham-identify-juventus-youngster-samuel-iling-junior-as-a-potential-january-target-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... THE INDEPENDENT Tottenham have identified Juventus' England U21 international Samuel Iling-Junior as a possible target as they seek squad reinforcements in January. Trent Alexander-Arnold is studying Liverpool great Steven Gerrard, Italy legend Alessandro Pirlo and even England team-mate John Stones as he tries to get used to his \"hybrid\" midfield role. DAILY MAIL Arsenal captain Martin Odegaard missed the club's last two games after being hit in the face with a ball in training and suffering an apparent concussion. Mikel John Obi made a play for fellow Nigerian Victor Osimhen to join his former club Chelsea next summer during an interview in which the Napoli striker confirmed he turned down a \"crazy\" offer from Saudi Arabia during the last window. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Tottenham are lining up a move for Feyenoord striker Santiago Gimenez, according to reports. Wayne Rooney has handed his Birmingham City players individual fitness plans to follow during the international break after deciding they are not fit enough as he looks to stem a bad run of form since taking over as manager. Las Vegas Grand Prix organisers are confident they will sell out their return to Formula One racing on Sunday despite reports that \"tens of thousands\" of tickets remain unsold. Emma Raducanu has confirmed she will not be ready to return in what was scheduled to be her comeback event in Macau early next month. DAILY TELEGRAPH Manchester United outcast Jadon Sancho and Tottenham forward Richarlison are two of the chief targets for Saudi Arabia's Pro League when the transfer window re-opens in January. The All-England Club's plans for a £200m expansion at Wimbledon have hit a setback after Wandsworth planning officers recommended the project be refused permission. Newcastle Falcons wing Mateo Carreras has rejected substantial offers from rival clubs in England and will join French side Bayonne at the end of the season. DAILY MIRROR Rio Ferdinand says he is \"baffled\" why Manchester United might be considering current Crystal Palace sporting director Dougie Freedman for a major role at Old Trafford under Sir Jim Ratcliffe's new backroom regime. Carlton Palmer is not sure Birmingham City's position as a Championship club will be enough to tempt Wrexham midfielder Elliot Lee to leave the ambitious Welsh outfit. THE SUN Manchester United are targeting £35m-rated defender Jean-Clair Todibo as they look to bolster their options by bringing in a player they wanted in the summer from Sir Jim Ratcliffe's French club Nice. Neil Warnock has given his five-point plan to rescue VAR and says referees' boss Howard Webb should appoint an independent group of former players and managers to operate the technology. Erik ten Hag will receive money to spend in January once Sir Jim Ratcliffe's deal to purchase a minority holding in Manchester United is concluded. A full-back and winger are believed to be two of the Dutchman's priorities. Brighton boss Roberto de Zerbi could be facing a touchline ban over his comments that he doesn't \"like 80 per cent of referees in England\" with the PGMOL asking if the Italian should be found in breach of the Participant Behaviour Charter. THE ATHLETIC Nottingham Forest's bid to increase capacity at the City Ground has included ideas similar to those used at Stadium 974 during the Qatar World Cup, where 974 shipping containers were utilised. Leeds United are set to land a British record transfer fee for a 15-year-old player when teen sensation Finlay Gorman leaves the club for Manchester City in the near future. The fee will be seven figures and include a series of future performance clauses. THE TIMES A second IPL franchise has made an offer of investment in Yorkshire to rival Mike Ashley's efforts to buy Headingley Stadium in what is being described as a partnership and \"not just a real estate proposition\". THE GUARDIAN Eritrea withdrew from the 2026 World Cup qualifying process due to fears that players would attempt to seek political asylum during trips abroad, according to sources close to the African nation's squad. DAILY RECORD Andy Halliday says Rangers will live to regret their decision, taken when former boss Michael Beale was in charge, not to pursue a deal for now-Celtic winger Luis Palma. Kilmarnock are set to ditch their plastic pitch, which has often been criticised by opposition managers, and return to a grass surface at Rugby Park. GLASGOW EVENING TIMES Rangers are hopeful of appointing a new director of football in the next fortnight. The role has been vacant since Ross Wilson left Ibrox in April. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-13 23:36:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ba15e3665b43d9bc0bb1e1ec1c021c36","title":"Sir Jim Ratcliffe could sanction signing of 17-year-old wonderkid who punished Man Utd","link":"https://www.dailystar.co.uk/sport/football/man-utd-transfer-news-ratcliffe-31431698","keywords":["Sport"],"creator":null,"video_url":null,"description":"Sir Jim Ratcliffe could get into the swing of signing star prospects with a deal for a Champions League ace who will be a very familiar face to Man Utd fans","content":"Sir Jim Ratcliffe could sanction the signing of 's rival - but not bring him to Old Trafford. side were punished against Copenhagen last week with a 4-3 comeback defeat that was finished off by Swedish forward Roony Bardghji. The 17-year-old might just have booked himself a transfer with his winning goal - his tenth of the season in Denmark. Bardghji made his first-team debut at the age of 16 and six days back in November of 2021 and has since scored 15 goals across 57 fixtures and won back-to-back Danish Superliga titles. report that Bardghji is on the radar of Ratcliffe's Ligue 1 outfit Nice as well as a series of clubs on the back of the substitute performance that put United on the brink of a European exit altogether. as well as Newcastle and are said to be keeping an eye on the forward who is contracted to his current club until 2025. Copenhagen are said to be keen on keeping hold of their young prospect until the summer rather than selling up in January. Meanwhile, at Old Trafford, Ratcliffe is yet to officially take up his new role that involves a 25% ownership. He is thought to be taking the reins on football matters including transfers as well as the position of his manager. Ten Hag's men are current the form team in the Premier League with four wins from five matches to climb up to within seven points of leaders . The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Ten Hag was not in attendance at the on Monday evening having had plans that he couldn't change. The Dutchman, 53, had an 'unbreakable and longstanding personal commitment in the Netherlands' which was given as the reason for his absence by the club Sir Alex Ferguson was among the attendees as were Roy Keane, Prince William and Gareth Southgate with four also there.","pubDate":"2023-11-13 22:53:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31431683.ece/ALTERNATES/s98/0_ECONOMY-ANTWERP-HARBOR-INVESTMENT.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d64961fbe5c3107e20c91e9e9256b1ae","title":"Steven Gerrard left without AWOL Al-Ettifaq star who drives home – 'as he was tired'","link":"https://www.dailystar.co.uk/sport/football/steven-gerrard-awol-al-ettifaq-31431387","keywords":["Sport"],"creator":null,"video_url":null,"description":"Steven Gerrard was incensed with one of his players who went AWOL before a game who claimed that he was too tired to play and made his way home","content":"was noticeably displeased with the reasoning one of his Al-Ettifaq players gave when going AWOL before a match. The manager of the publicly hit back at Mohammed Al-Kuwaykibi after the winger missed his side's 0-0 draw with Al-Feiha on Saturday (November 11). The 28-year-old was nowhere to be found before their league clash which left the legend incensed with the Saudi Arabia international. The winger said he was too tired to play on the weekend despite the Al-Ettifaq medical staff clearing him for action against Al-Feiha. Following the game, Gerrard spoke to the media about the situation and said: \"He got in his car and went home without permission. \"He was analysed by the doctor, the doctor said he was good to train but he got in his car and said he was tired and went home. I am still looking for reasons and answers as to why he wasn't here to help us today.\" The 43-year-old's comments may stir up tension with Al-Kuwaykibi - who has been at the club since 2016 - but the manager was backed by the team who released a statement of support for Gerrard. The statement read: \"We refuse to criticise the team's coach, as this is not the first time that Muhammad Al-Kuwaykibi has taken the same position. In Al-Nasr's first match in the league, he missed the main exercises with the same excuse.\" It's not been a particularly fruitful season for Al-Kuwaykibi who has played in 11 league games so far but has yet to score and has only registered one assist. The former England international is enduring rough form with his team currently sit seventh in the league after a run of just one win in six games. They are 13 points off league leaders Al-Hilal, despite a strong start to the season that saw them win five of their opening seven matches. A notable theme throughout the season has been their struggle for goals, scoring just 19 so far - the second-lowest in the top half of the table. Former and striker Moussa Dembele is their top scorer with seven league goals.","pubDate":"2023-11-13 22:51:30","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31431525.ece/ALTERNATES/s98/0_Al-Nassr-v-Al-Ettifaq-Saudi-King-Cup-of-Champions.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3b1022d717da46f400f462f3fb1b6e8f","title":"BetMGM Bonus Code NYPNEWS1500: Get 20% match or $200 bonus bets for Broncos-Bills, any game","link":"https://nypost.com/2023/11/13/sports/betmgm-bonus-code-nypnews1500-get-20-match-or-200-bonus-bets-for-broncos-bills-any-game/","keywords":null,"creator":["Action Network"],"video_url":null,"description":"The BetMGM bonus code NYPNEWS1500 lets new customers get a deposit match up to $1,500 in bonus bets for the Buffalo Bills hosting the Denver Broncos.","content":"NFL Week 10 wraps up tonight and New York Post readers can cash in with one of two new customer offers from BetMGM Sportsbook . These offers use BetMGM bonus codes NYPNEWS1500 or NPNEWSGET . Here’s what to expect from each offer: The exclusive new customer offer from BetMGM carries a 20% deposit match worth up to $1,500 in bonus bets. For instance, if you deposited $200, you’d get $40 in bonus bets, and so on up to $1,500 (meaning $7,500 is the max initial deposit for this offer). Kentucky bettors can use the BetMGM Kentucky bonus code NYPNEWS1500 to get the same deposit match offer. This offer is not available in New York and Washington DC. If you’re interested in another fun sportsbook, check out the new ESPN BET promo code before it launches! Click the buttons below to learn more. All offers work for all BetMGM sports markets. Tonight’s ‘Monday Night Football’ matchup takes us to Buffalo where Josh Allen and the Bills host the Denver Broncos. Buffalo is favored by 7.5 points on BetMGM Sportsbook and that line just seems a bit too high. The Bills just aren’t as impressive as they have been in recent years and Denver appears to have figured some things out. Get the free Action Network app for expert picks, live odds, bet tracking and more. Buffalo has been very average in its last five games, losing three and winning two in close games. Allen is having a decent season, but his nine interceptions have cost the Bills games this year and it feels like some of his reckless decisions continue each week. Right off a bye, the Broncos appear to be on a bit of an upswing. They ground out two home wins over the Packers and Chiefs in which their defense played well and they ran the ball fairly effectively. Russell Wilson was also able to play mistake-free football in that stretch. I don’t expect the Bills to lose this game, but they haven’t been playing well enough to expect them to win by eight points. Take the Broncos to cover on bet365 Sportsbook with bonus code NYPNEWS .","pubDate":"2023-11-13 22:45:00","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/11/GettyImages-1780251575.jpg?quality=90&strip=all","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"4c1b0951c78e3cb6c18de21ac1f3072b","title":"Heavy loss to Celtic is a reality check for Aberdeen, says captain Graeme Shinnie","link":"https://www.pressandjournal.co.uk/fp/sport/football/aberdeen-fc/6256615/humiliating-6-0-loss-to-celtic-delivers-aberdeen-reality-check-says-graeme-shinnie/","keywords":["Aberdeen FC","Aberdeen","Celtic FC","Europa Conference League","Graeme Shinnie"],"creator":["Sean Wallace"],"video_url":null,"description":"Shinnie has reiterated the Dons squad must 'deal with' the combined demands of European group stage action and domestic commitments.","content":"Captain Graeme Shinnie believes the hammering by Celtic is a reality check of the levels Aberdeen need to reach. The straight-talking skipper accepts losing 6-0 at Parkhead is not acceptable. For Shinnie, Sunday’s heavy loss was particularly hard to take as it stopped a recent resurgence in form from the Dons. Aberdeen drew 2-2 with Group G leaders PAOK in the Europa Conference League fewer than 72 hours before the Parkhead shocker. Prior to the Euro clash in Greece, the Reds secured a Viaplay Cup final slot and also defeated Motherwell 4-2 away in the Premiership. Losing so heavily at Parkhead brought Aberdeen crashing back to earth. Shinnie said: “We went into the Celtic game in pretty good form, but were brought back to reality a little bit as to where our performances need to be. “Overall, for the whole game, we were not at the races and it wasn’t acceptable. “It’s hard. “You single out this game – however, we won at Motherwell, get through to a cup final and had a good performance over in PAOK. “That was three positive performances so this (Celtic) is a sore one to take.” Exertions in Greece ‘no excuse’ for Parkhead shocker Aberdeen flew back from Greece on Friday after The Dons ended the 100 percent record of PAOK in Group G. In contrast, Premiership Hearts had been overwhelmed 4-0 at the Toumba Stadium by the Greek Super League side in the Europa Conference League play-off earlier this season. But Shinnie was adamant the exertions in Greece were not at the root of the performance against Celtic. He said: “It’s no excuse. “Of course, we are not going to get away from the fact it has been a gruelling schedule. “I think five away games in a row, there’s no getting away from that, but it’s no excuse for that performance. “If anything, you can maybe tire towards the end, but we looked tired from the start – you can’t blame that on fatigue. “It’s just not been good enough and, overall, like the manager said, not acceptable as a team.” ‘We need to deal with it as a team’ Aberdeen have won just one of the six games immediately following European action this season, losing three and drawing twice. Facing Celtic at Parkhead on Sunday was the culmination of five consecutive away games for the Dons over just 16 days. Rather than complain about the schedule, Shinnie insists the Dons must deal with it. He would rather have the congested fixture list that comes with Euro group action and domestic cup progression than inactivity. The 32-year-old said: “This is where we want to be. “In European competitions and in cup finals, fighting to get into cup finals. “We can’t use it as an excuse because it is exactly where this club wants to be. “So we need to deal with it as a team.” Slow start played into Celtic’s hands Aberdeen were 2-0 down after 16 minutes to reigning Premiership champions Celtic. They went 3-0 behind to a second half penalty before a complete collapse late on when they conceded three goals in injury time. Shinnie accepts The Dons have failed to win in the previous 21 games in all competitions where they have let in the opening goal. Scotland international Shinnie said: “Going to Celtic, you know they like to start fast. “They like to try and come at you quick and almost effectively try and win the game in the first 20 to 30 minutes. “Being 2-0 down in 16 minutes is exactly what they wanted and it was such a slow start for us. “That’s a frustrating part of it.”","pubDate":"2023-11-13 22:30:11","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/11/20915905_54231938-291xi3rch-e1699882186469-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ecdd4ca87a27cf5a25afc4061c6f474f","title":"Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast'","link":"https://www.dailymail.co.uk/sport/football/article-12745703/Man-United-refuse-enter-talks-Juventus-potential-Jadon-Sancho-loan-club-wait-permanent-bids-Old-Trafford-outcast.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Sancho looks to have no future at Old Trafford with the forward currently training on his own at the academy and barred from using first team facilities at United's Carrington training base.","content":"Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast' Jadon Sancho remains banished from the first team squad and is training alone Juve had been interested in taking the Englishman on loan in January It’s a three-team title race... Toney could lead Arsenal to glory: It's All Kicking Off By Spencer Morgan For Mailonline Published: 20:05 EST, 13 November 2023 | Updated: 20:13 EST, 13 November 2023 e-mail 6 shares 2 View comments Manchester United have reportedly shut down attempts from Juventus to try and negotiate a loan move for outcast Jadon. Sancho looks to have no future at Old Trafford with the forward currently training on his own at the academy and barred from using first team facilities at United's Carrington training base. Sancho's exile followed the winger publicly branding manager Erik ten Hag a liar over his reasons for dropping him for the 3-1 away defeat by Arsenal in September. And Fabrizio Romano claims Juve had hoped to offer a temporary solution but United are looking for a permanent one. He tweeted: 'U nderstand Juventus asked for information on Jadon Sancho deal in recent days. Man United have refused to talk with Juventus about a possible loan deal for Jadon Sancho 'He’s set to leave Man United in January, Juve are interested but only on loan plus part of salary covered by #MUFC. 'No negotiations yet as Man Utd prefer to wait for permanent deal bids.' A number of Audi Arabian clubs are believed to be interested in Sancho and United will no doubt be hoping to sell to the highest bidder. Sancho joined the Red Devils for a fee of £73m but was never able to find the form that made him a star for Borussia Dortmund. Sancho's exile followed the winger publicly branding manager Erik ten Hag a liar IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. <!- - ad: https://mads.dailymail.co.uk/v8/us/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Jadon Sancho Erik ten Hag Share or comment on this article: Man United 'refuse to enter talks with Juventus over potential Jadon Sancho loan move as club wait for permanent bids for Old Trafford outcast' e-mail 6 shares Add comment Comments 2 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 01:13:46","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77765101-0-image-a-24_1699923586134.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"553b7661e1a1ee405677598e82722ece","title":"Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling","link":"https://www.dailymail.co.uk/sport/football/article-12742981/Marcus-Rashford-misfiring-forwards-uncertainty-strongest-midfield-Harry-Maguires-best-partner-Erik-ten-Hag-plenty-ponder-international-fortnight-Man-United-struggling.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Saturday's slender win over Luton Town has offered Ten Hag some much-needed respite and it's astonishing to see United sitting sixth in the table for all their problems.","content":"Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling Saturday's 1-0 victory over Luton has given Erik ten Hag some breathing space But shaky start to the season leave him searching for answers to many questions City had their pants pulled down by a development team - It's All Kicking Off By Adam Shergold for MailOnline Published: 22:00, 13 November 2023 | Updated: 00:49, 14 November 2023 e-mail 15 shares 42 View comments Peace at last for Erik ten Hag . As most of his Manchester United players jet off to represent their countries for the final time in 2023, the coach has a couple of weeks breathing space to work on answers to many questions. Saturday's slender win over Luton Town has offered Ten Hag some much-needed respite and it's astonishing to see United sitting sixth in the Premier League table for all their problems. Indeed, with four wins from their last five games, United are among the league's form sides. But league form unfortunately be taken in isolation from United's shocking Champions League campaign and feeble Carabao Cup defence. Erik ten Hag still has plenty to ponder despite Manchester United's win over Luton on Saturday The Reds have lost as many matches as they've won during a shaky start to the season Your browser does not support iframes. They have lost nine times and won nine times overall this season - they don't seem to do draws. After the internationals, United face a tricky trio of away games against Everton, Galatasaray and Newcastle United that may dictate the direction of their whole season. Positive results may chart a course for another top-four finish and Champions League football after Christmas. Further defeats could see United slide into mid-table mediocrity and the Europa League - or even out of Europe entirely. Here's a closer look at some of the problems Ten Hag needs to solve over the coming fortnight. Finishing practice for the forwards! United were indebted yet again to one of their defenders as they squeezed past Luton at Old Trafford. Victor Lindelof was on hand to fire home the winner , just as Raphael Varane, Harry Maguire and Diogo Dalot made match-winning contributions in earlier games. Of their 13 Premier League goals so far, three have come from defenders, nine from midfielders and just one from the strikers. Victor Lindelof (left) fires home United's winner against Luton as another defender saved them Marcus Rashford endured another blank afternoon as his struggles in front of goal continued That was Marcus Rashford's goal in the 3-1 defeat at Arsenal back in September, with nothing so far in the league from Rasmus Hojlund, Antony, Alejandro Garnacho or Anthony Martial. Ten Hag isn't concerned about Hojlund's Premier League goal drought because the £72million Dane has netted five times in Europe. His finishing touch deserted him again versus Luton prior to leaving the pitch late on with a hamstring injury that has forced him out of Denmark duty. The same thing happened to Garnacho, who spurned a very good one-on-one opportunity in the first-half, and needs to be more clinical in such situations. There is growing indifference among United fans to Antony, who is in growing danger of being remembered as a very expensive flop. The Brazilian has been jeered in recent games and rumours abound that United could cut their losses on him as soon as January. Alejandro Garnacho wasn't able to convert a very good one-on-one opening in the first-half The young Argentine is one of several United forwards in need of extra finishing practice Antony is far too predictable when on the ball and has struggled for goals and assists Man United fixtures Premier League unless stated November 26 Everton (A) November 29 Galatasaray (A) Champions League group stage December 2 Newcastle United (A) December 6 Chelsea (H) December 9 Bournemouth (H) December 12 Bayern Munich (H) Champions League group stage <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/football/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Rashford, meanwhile, is a shadow of the devastatingly effective goalscorer we saw last season and his goal shortage helps explain why United are struggling to finish off even modest opponents. Ten Hag maintains everyone will come good but United have scored just 13 times in 12 league games and cannot keep relying on their defenders to bail them out. Better service for Hojlund Tied into United's striker troubles has been the theme of Hojlund not receiving enough service , especially in Premier League games. There appears to be little cohesion between the front three, regardless of who plays. Rashford, Antony and Garnacho are all more likely to cut infield and take a shot when they get into a good position rather than look to feed Hojlund, even if he's in a better position. With Rashford's form in a rut, Garnacho still quite raw with his finishing and Antony far too predictable with his intentions, this leads to frustration. When they do try and combine, such as Rashford's hooked back-post cross for Hojlund to head the opener against Galatasaray, it proves effective but most of his service comes from the midfielders. Rasmus Hojlund's Premier League goal drought continued before he was forced off injured There isn't a great deal of cohesion as yet between £72m Hojlund and United's other forwards There has been an element of Rashford looking ever-more desperate to get a goal and taking on more chances as he searches for the moment that breaks the logjam. If the nascent understanding between Rashford and Hojlund can develop - and it will take a bit of time - United should have a deadly strike force. The may, however, be limited time to work on this now with Rashford away on international duty and Hojlund sidelined anyway. Midfield clarity A succession of injury blows have made it difficult for Ten Hag to pick a settled line-up during the early months of the season. This has been especially true at left-back but also in key midfield positions, contributing to a feeling Ten Hag isn't entirely sure of his best combination. Christian Eriksen has picked up a knee injury, joining the out-of-sorts Casemiro on the treatment table, though the Brazilian should be fit again soon. Summer arrival Mason Mount missed five games with a knock, while loan signing Sofyan Amrabat was forced to deputise at left-back. Christian Eriksen became the latest United player to suffer an injury this season Scott McTominay may have left United back in the summer but has been in excellent form Ten Hag has been indebted to Scott McTominay , who may have departed Old Trafford over the summer but has chipped in with some strong performances and vital goals. But Ten Hag needs to have a think about his best midfield going forward. Last season, United's combination of Casemiro, Eriksen and Bruno Fernandes remained unbeaten for some time. Currently, there isn't an obvious first-choice trio. Casemiro has looked off the pace, while playing Eriksen or Mount can leave United exposed. Conversely, partnering two of Casemiro, McTominay or Amrabat together can stifle their creativity and make it hard to break down opponents. We have seen Eriksen hurriedly introduced during games to provide a bit more creativity, while in others opponents have enjoyed so much freedom in the centre of the park. Ten Hag needs to consider who plays there if he only had the luxury of everyone being fit. United look like they need a bit of consistency in this important department. It's difficult to know whether Casemiro would make United's first-choice midfield if fit Who plays alongside Maguire? In a conundrum few saw coming at the start of the season, it isn't a case of does Harry Maguire have an Old Trafford future but who plays alongside him in defence. The England centre-half has shown remarkable resilience after being dropped by Ten Hag last season, stripped of the captaincy in the summer and roundly ridiculed. Maguire always wanted to stay at United and fight for his place and that decision has now been vindicated. He has stepped up and performed at a difficult time for the team. Against Luton, he was paired with Lindelof in a throwback to the Ole Gunnar Solskjaer days and we've also seen an improbable partnership with 35-year-old Jonny Evans. Victor Lindelof and Harry Maguire reprised their central defensive partnership on Saturday There are doubts now over Raphael Varane with Ten Hag continuing to keep him out the side Ten Hag has been quick to play down talk of any rift with Varane, citing 'tactical reasons' and 'internal competition', but the Frenchman's ongoing absence from the starting line-up seems odd. There must be doubts about Varane's long-term future at United but Maguire's good form is certainly helping matters. It remains to be seen if he retains his place when Lisandro Martinez finally returns to fitness with the Argentine and Varane playing well together last season. Martinez is a real leader and favoured by Ten Hag so it's hard to imagine him sitting on the bench when fit while Maguire and Lindelof or Evans play. Until he returns, however, Ten Hag's main consideration is who provides the best accompaniment to Maguire. It's a vital decision - if United aren't scoring, they must be watertight at the back. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football, launching with a preview show today and every week this season. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify Your browser does not support iframes. Champions League EFL Cup Premier League Share or comment on this article: Marcus Rashford among misfiring forwards, uncertainty over the strongest midfield and who is Harry Maguire's best partner? Erik ten Hag has plenty to ponder over the international fortnight with Man United still struggling e-mail 15 shares Add comment Comments 42 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:49:01","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/11/77735019-0-image-a-2_1699875749036.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3cb3875f121fac67657fc200c25e1856","title":"Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale'","link":"https://www.dailymail.co.uk/sport/football/article-12745457/Erik-Ten-Hag-backed-transfer-war-chest-reset-squad-Sir-Jim-Ratcliffe-seals-1-3bn-deal-Man-United-boss-targets-winger-Jadon-Sancho-three-stars-sale.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Erik Ten Hag will be reportedly be backed with a transfer war chest after Sir Jim Ratcliffe has sealed his £1.3billion deal for a 25 per cent stake in Manchester United.","content":"Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale' Billionaire Ratcliffe set to assume control of the football operations of the club Man United boss Ten Hag poised to carry out 'a reset' of his squad in January City had their pants pulled down by a development team - It's All Kicking Off By David Wood for MailOnline Published: 23:50 GMT, 13 November 2023 | Updated: 00:41 GMT, 14 November 2023 e-mail 15 View comments Erik ten Hag will be reportedly be backed with a transfer war chest after Sir Jim Ratcliffe has sealed his £1.3billion deal for a 25 per cent stake in Manchester United . An agreement is close for British billionaire Ratcliffe to assume control of the football operations side of the club, almost a year after the Glazers confirmed they were open to investment. The Sun report the under-pressure Dutchman is poised to carry out 'a reset' of his squad in January - and is believed to be targeting a full-back and a winger. It is also claimed that Ratcliffe has drawn up a plan to shift banished £73million winger Jadon Sancho , £85m flop Antony , and £36m striker Anthony Martial in January. The Sun quotes a United source saying Ten Hag's eyes remain 'very firmly' fixed on securing a Champions League place. Sir Jim Ratcliffe’s £1.3bn deal for a 25 per cent stake in Man United could be agreed soon Man United boss Erik Ten Hag is poised to carry out 'a reset' of his squad in January Your browser does not support iframes. The source said: 'January will be a big month for United. The deal involving Sir Jim should be done by then, and this will free up funds for Ten Hag to reset his squad. 'He's targeting a forward who can play on either flank and a right full-back.' No documents have been signed yet in Ratcliffe's £1.3billion deal but the end of a saga that started almost a year ago is in sight. Those with knowledge of the situation say there is a chance the agreement could be announced this week, but next week is more likely. The anniversary of a tiresome process, which began when the Glazers confirmed they were open to investment, is November 22. Despite the uncertainty, Ratcliffe is reportedly preparing a fire sale to rid the Red Devils of three of its underperforming stars. The British billionaire, as part of his minority deal, would take control of football operations, and he is also thought to be set to pledge £245million to improve infrastructure. As part of his overhaul of the club, he will consider alternative plans to renovate and expand Old Trafford and improve facilities in and around the famous old ground. Old Trafford was one of England’s most iconic stadiums but the roof has been leaking for years. Its facilities are also outdated compared to Tottenham ’s new home and Manchester City ’s stadium. Ratcliffe is set to pledge £245million to improve infrastructure at the club. Man United could also sell Jadon Sancho (left) and Anthony Martial (right) in January Manchester United's famous Old Trafford ground has slowly fallen in disrepute Despite the shortcomings at Old Trafford, Mail Sport has learned that the bulk of that cash is earmarked for a new training centre rather than for the stadium. It is estimated that between £150m and £200m has been earmarked to modernise the Carrington training ground. United have lost nine of their 18 fixtures in all competitions this season and are currently sixth in the Premier League. Ten Hag's team are bottom of their group in the Champions League following the 4-3 defeat at FC Copenhagen. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Anthony Martial Erik ten Hag Antony Share or comment on this article: Erik ten Hag 'to be backed with transfer war chest to reset squad after Sir Jim Ratcliffe seals £1.3bn deal'... as Man United boss 'targets full-back and winger - with Jadon Sancho among three stars up for sale' e-mail Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:41:42","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77763577-0-image-a-65_1699920352169.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"da8e22a54fd2b65277c84518d1274c57","title":"Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off","link":"https://www.dailymail.co.uk/sport/football/article-12744171/Pep-Guardiola-naive-saying-no-problem-selling-players-rivals-Cole-Palmer-left-Man-City-join-Chelsea-42-5m-says-Ian-Ladyman-Kicking-Off.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Palmer ultimately scored a stoppage time penalty to earn Chelsea a 4-4 draw at Stamford Bridge , which prevented Man City from going three points clear at the top of the table.","content":"Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off Cole Palmer left boyhood club Manchester City to join Chelsea last summer Pep Guardiola claimed only small clubs feared selling players to their rivals It's baffling why Guardiola sold Palmer to a rival club - It's All Kicking Off By Michael Pavitt For Mailonline Published: 22:19, 13 November 2023 | Updated: 00:19, 14 November 2023 e-mail 10 View comments Ian Ladyman believes Pep Guardiola is naive for suggesting he has no problem in selling Manchester City players to rival clubs. Guardiola had made the claim ahead of Man City 's match against Chelsea on Sunday, when Cole Palmer faced his former club for the first time following his £42.5million move to Stamford Bridge. Palmer scored a stoppage time penalty to earn Chelsea a 4-4 draw at Stamford Bridge , which prevented Man City from going three points clear at the top of the table. The Man City boss had justified Palmer's sale pre-match, insisting the club have no problem letting unhappy players move on. 'I said to him [Palmer] \" Riyad Mahrez is leaving, you are going to get a chance here\". 'He said \"No, I'm not going to play here, I want to leave\" so I said 'OK, leave!', Guardiola said. Ian Ladyman believes Pep Guardiola is naive for being open to selling players to rivals The Manchester City boss claimed only small clubs refuse to sell players to potential rivals Guardiola had insisted he had no problem allowing Cole Palmer to join Chelsea in the summer Your browser does not support iframes. 'Some clubs would not want to see an asset join a potential rival. City are not like that and were happy to collect a big fee from Chelsea. 'We'd never stop a deal because of that. Why, if the transfer suits both clubs and the player? That means you are a small club. 'Big clubs make decisions for the benefit of all three parties. If a player wants to go to Chelsea or [Manchester] United or Liverpool, what is the problem if they are happy to be there and we are happy with the transfer? Another player comes here and we keep going with a good spirit.' Ladyman, Mail Sport's Football Editor, told the It's All Kicking Off podcast that Guardiola was 'naive' for for allowing the switch despite receiving a good fee for 21-year-old Palmer. 'Pep said on Friday, only small clubs, that's his quote, only small clubs refuse to sell to rivals,' Ladyman told Chris Sutton. 'Really? I think it's slightly naive to sell to a rival which is something that you rarely say about Manchester City. 'Only small clubs refused to sell to rivals, what does that mean?' Sutton suggested the Guardiola was entitled to make the comment given Manchester City's success under the Spaniard. Palmer scored from the penalty spot to earn Chelsea a 4-4 draw against Man City on Sunday The 21-year-old has been rewarded for his impressive form with a call-up to the England squad 'Well, I mean he's entitled to sort of say what he wants is, you know, especially when they're mopping up and over the years they've spent a fortune sort of you know, bringing in some of the best players across the world to play for them,' Sutton said. 'So maybe yeah, I mean, I think it's a bit of a sweeping generalisation from Pep as much as anything, and maybe a dig, well, certainly a dig at a few.' Palmer has flourished after his move from City to Chelsea in the summer, scoring four goals in 11 appearances for the Blues so far this season. His performances have been rewarded by a call-up to Gareth Southgate's England squad for their upcoming Euro 2024 qualifiers. Palmer is the latest player to move from Man City to a direct rival, after Gabriel Jesus and Oleksandr Zinchenko joined Arsenal before helping the Gunners to challenge Guardiola's side for the title last season. Ladyman suggested Guardiola should have attempted to strike a deal with Palmer to reassure him over game-time to prevent the Man City academy product from pushing to move. 'With each passing game, with each passing move, with each passing kind of wave of that magical left foot, with each passing goal for Cole Palmer, with each passing contribution of note and merit, we ask that question, 'why did City sell one of the best young players to a rival? Baffling,' Ladyman said. Ladyman suggested he would have offered Palmer a deal to convince him to stay at Man City 'Frankly, I would just have said no. I'd have said no to him. I would have said, I'd have done him a deal. 'What I would have done, I'd have said, look, you're under contract until 2026, so at the time of this conversation, he would have had three years left. Stay for one year, stay for one year. 'And if you want, if I'm not true to my word and you do not get the games that I'm telling you will, next summer we'll sit down and talk about a transfer. 'That is what I would have done if I was Manchester City.' IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Pep Guardiola Riyad Mahrez Its All Kicking Off Share or comment on this article: Pep Guardiola is 'naive' in saying he has no problem in selling players to his rivals after Cole Palmer left Man City to join Chelsea for £42.5m, says Ian Ladyman on It's All Kicking Off e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:19:25","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/16/77745707-0-image-a-26_1699894340715.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f7ec973ec336c3e1ac97b178b4e0fc7f","title":"Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea","link":"https://www.dailymail.co.uk/sport/football/article-12745133/Cole-Palmer-football-United-Man-City-Chelsea.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JACK GAUGHAN: As the country's finest young players approach the age of 18, they are graded by the FA's coaches. On where they are on the ladder and how high they might go.","content":"Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea Cole Palmer received his first senior England call-up after his superb form He has a positive arrogance on the grass, a contrast to his shy personality It's baffling why Guardiola sold Palmer to a rival club - It's All Kicking Off By Jack Gaughan for the Daily Mail Published: 22:30, 13 November 2023 | Updated: 00:17, 14 November 2023 e-mail 17 shares 50 View comments As the country's finest young players approach the age of 18, they are graded by the FA's coaches. On where they are on the ladder and how high they might go. With Cole Palmer, there was no doubt in the mind of Ian Foster, who has managed three of England's age groups. Potential: senior first team. Despite reservations elsewhere, not least within Manchester City , he was unequivocal. Foster, now Steven Gerrard 's assistant in Saudi Arabia, will have raised a smile. A first call-up by Gareth Southgate follows Palmer's eye-catching opening weeks to life at Chelsea , life as a £42.5million footballer and life away from home, away from the bosom of City. Palmer, 21, wears the look that he is destined for a long international career. A positive arrogance on the grass, in contrast to the shy individual he is away from it. His calmness in converting four penalties for Chelsea - and even taking over those duties in the first place - suggests he has the confidence to cope with the inevitable scrutiny. In taking charge of matches, his ability is obvious. Chelsea's Cole Palmer was destined for the top and has been handed a senior England call-up He has enjoyed a superb start to life at his new club and scored against Manchester City Palmer's ability is clear but this was not always appreciated at City, who weighed up releasing him Your browser does not support iframes. That was not always appreciated at City. Five years ago, they might have released him had it not been for the intervention of former academy director Jason Wilcox. Coaches and the hierarchy were split over whether he was worthy of a scholarship, which feels faintly ridiculous now. It meant he had to work harder than anyone else. He was underdeveloped physically and had to make up for that with a sharp brain. City were making big signings in his position, spending a significant amount on Ben Knight from Ipswich. Wilcox vouched for the lad from Wythenshawe and Palmer earned a contract that was shorter and less well-paid than most of his peers. The pecking order was set and Foster took calls from some at City wondering why Palmer continued to pip Knight to national squads when things were different at club level. Their trajectories since could not be more different. While Knight has spent time on loan at Crewe Alexandra, Palmer has scored in a Super Cup final and was growing increasingly frustrated by a lack of minutes with Pep Guardiola's Treble winners. He began debating a move away around March, wondering whether a loan this season might be his best option. That intensified over the summer as it became clear that City were on the hunt for a new winger with more speed, which culminated in their signing of Jeremy Doku. Palmer told them he wanted to leave, City asked him to bring them an acceptable offer, and off he went on deadline day to Stamford Bridge. The evening before he boarded the early train to Euston, Palmer sat in his car at the City Football Academy, taking it all in. At that point the move was not 100 per cent certain and he didn't know whether to say his goodbyes. Although born a Manchester United fan, 13 years of his life had been spent with the blue half of town after City spotted him at youth team NJ Wythenshawe. Palmer on Monday received his first call-up to Gareth Southgate's England senior squad During his time at City, Palmer progressed from the academy to the all-conquering first team He was always the most technically gifted, honing skills with his father, Jermaine, on Hollyhedge Park near Gatley. Until very recently, he was still hiring pitches at the local Powerleague for him and his mates during time off. There remains a street footballer within him. Add that to a mind that Guardiola has moulded and you have a serious player. Guardiola's staff loved him. It was noticeable on Sunday that, even after his dramatic late equaliser and cheeky celebration, Palmer was welcomed into the City dugout and spent a considerable amount of time with the backroom team after the 4-4 draw at Stamford Bridge. He still wants to go back and say thank you to those who took care of him in the academy, too. 'The next star,' said one City source after just a few days of first-team training. Consistently a standout performer in what can be unforgiving sessions, Palmer was following in Phil Foden's footsteps. As with Foden, City rebuffed tens of offers to take him on loan. Unlike Foden, he picked up injuries at crucial moments and then put too much pressure on himself to excite when opportunities did come. Palmer admits he tried too hard to impress last season, which is striking for someone usually so relaxed that he is horizontal. 'Cole needs to be stimulated,' said one source as Palmer was breaking into the senior set-up. Minutes were always going to be key for someone normally boasting supreme self-confidence. To satisfy that, Palmer once scored a hat-trick for the Under 23s about two hours after a cameo appearance in the Premier League. 'When you are just training and not playing, it's not good for him,' Guardiola said at the time. It also indicates he should not have an issue dropping down to England's Under 21s again if asked. Palmer eventually reached that awkward phase of being too good to sit on a Premier League bench, requiring the time and space to fully develop, but not earning the complete trust of his manager. Pep Guardiola and his coaching staff loved Palmer, who was moulded by his former manager Palmer studied Mauricio Pochettino's squad and surmised this was a chance ripe for the taking In that sense, a switch to Chelsea suited all parties. Palmer studied Mauricio Pochettino's squad and possible threats to his own spot and surmised that this was a chance ripe for the taking. 'How he's done is unsurprising,' says England Under 21s boss Lee Carsley, who played him up front, wide right, as a No 10 and deeper midfielder as they won the European Championship in the summer. 'There will be dips at times but if you keep believing in players like Cole you will get your rewards. He is definitely not overconfident but he has an assuredness about his play. Like a lot of the top players, there is no point in the game where he doesn't want the ball. That generally separates the good ones from the special ones and Cole is definitely in that bracket.' City staff were laughing at how nothing fazes him after a first Champions League goal at Club Bruges two years ago, when Raheem Sterling was first to congratulate him for his strike from the edge of the box. 'It was a \"Wow\" moment,' a source says. Nothing has ruffled him at Chelsea, either. Learning to cook, do laundry and get about on the Tube are all more daunting than the actual football. Dad Jermaine - whose heritage means Palmer also qualifies to play for Saint Kitts and Nevis - is helping him settle, but the home comforts are missing. There's also no chance to nip for a takeaway at his favourite Lebanese place near Stockport. Everything is new. And, to many, it feels like Palmer himself is too. Yet those who know him believe this was only a matter of time. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Gareth Southgate Steven Gerrard Share or comment on this article: Cole Palmer was always destined for the grandest stage: Part street-fighter, part football genius, the United-supporting former Man City kid is flying at Chelsea e-mail 17 shares Add comment Comments 49 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-14 00:17:58","image_url":"https://i.dailymail.co.uk/1s/2023/11/14/00/77763927-0-image-a-2_1699921062063.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7a6bc8b1becde87aa191c198f01f5c68","title":"Papers: Tottenham line up move for Juventus' Iling-Junior","link":"https://www.skysports.com/football/news/20876/13007680/tottenham-identify-juventus-youngster-samuel-iling-junior-as-a-potential-january-target-paper-talk","keywords":null,"creator":null,"video_url":null,"description":"All the top stories and transfer rumours from Tuesday's newspapers...","content":"All the top stories and transfer rumours from Tuesday's newspapers... THE INDEPENDENT Tottenham have identified Juventus' England U21 international Samuel Iling-Junior as a possible target as they seek squad reinforcements in January. Trent Alexander-Arnold is studying Liverpool great Steven Gerrard, Italy legend Alessandro Pirlo and even England team-mate John Stones as he tries to get used to his \"hybrid\" midfield role. DAILY MAIL Arsenal captain Martin Odegaard missed the club's last two games after being hit in the face with a ball in training and suffering an apparent concussion. Mikel John Obi made a play for fellow Nigerian Victor Osimhen to join his former club Chelsea next summer during an interview in which the Napoli striker confirmed he turned down a \"crazy\" offer from Saudi Arabia during the last window. Stream the Premier League and more with NOW Get Sky Sports Download the Sky Sports app Transfer Centre LIVE! Tottenham are lining up a move for Feyenoord striker Santiago Gimenez, according to reports. Wayne Rooney has handed his Birmingham City players individual fitness plans to follow during the international break after deciding they are not fit enough as he looks to stem a bad run of form since taking over as manager. Las Vegas Grand Prix organisers are confident they will sell out their return to Formula One racing on Sunday despite reports that \"tens of thousands\" of tickets remain unsold. Emma Raducanu has confirmed she will not be ready to return in what was scheduled to be her comeback event in Macau early next month. DAILY TELEGRAPH Manchester United outcast Jadon Sancho and Tottenham forward Richarlison are two of the chief targets for Saudi Arabia's Pro League when the transfer window re-opens in January. The All-England Club's plans for a £200m expansion at Wimbledon have hit a setback after Wandsworth planning officers recommended the project be refused permission. Newcastle Falcons wing Mateo Carreras has rejected substantial offers from rival clubs in England and will join French side Bayonne at the end of the season. DAILY MIRROR Rio Ferdinand says he is \"baffled\" why Manchester United might be considering current Crystal Palace sporting director Dougie Freedman for a major role at Old Trafford under Sir Jim Ratcliffe's new backroom regime. Carlton Palmer is not sure Birmingham City's position as a Championship club will be enough to tempt Wrexham midfielder Elliot Lee to leave the ambitious Welsh outfit. THE SUN Manchester United are targeting £35m-rated defender Jean-Clair Todibo as they look to bolster their options by bringing in a player they wanted in the summer from Sir Jim Ratcliffe's French club Nice. Neil Warnock has given his five-point plan to rescue VAR and says referees' boss Howard Webb should appoint an independent group of former players and managers to operate the technology. Erik ten Hag will receive money to spend in January once Sir Jim Ratcliffe's deal to purchase a minority holding in Manchester United is concluded. A full-back and winger are believed to be two of the Dutchman's priorities. Brighton boss Roberto de Zerbi could be facing a touchline ban over his comments that he doesn't \"like 80 per cent of referees in England\" with the PGMOL asking if the Italian should be found in breach of the Participant Behaviour Charter. THE ATHLETIC Nottingham Forest's bid to increase capacity at the City Ground has included ideas similar to those used at Stadium 974 during the Qatar World Cup, where 974 shipping containers were utilised. Leeds United are set to land a British record transfer fee for a 15-year-old player when teen sensation Finlay Gorman leaves the club for Manchester City in the near future. The fee will be seven figures and include a series of future performance clauses. THE TIMES A second IPL franchise has made an offer of investment in Yorkshire to rival Mike Ashley's efforts to buy Headingley Stadium in what is being described as a partnership and \"not just a real estate proposition\". THE GUARDIAN Eritrea withdrew from the 2026 World Cup qualifying process due to fears that players would attempt to seek political asylum during trips abroad, according to sources close to the African nation's squad. DAILY RECORD Andy Halliday says Rangers will live to regret their decision, taken when former boss Michael Beale was in charge, not to pursue a deal for now-Celtic winger Luis Palma. Kilmarnock are set to ditch their plastic pitch, which has often been criticised by opposition managers, and return to a grass surface at Rugby Park. GLASGOW EVENING TIMES Rangers are hopeful of appointing a new director of football in the next fortnight. The role has been vacant since Ross Wilson left Ibrox in April. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-13 23:36:00","image_url":"https://e0.365dm.com/19/10/1920x1080/skysports-paper-talk-papers_4819668.jpg?20200516213727","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ba15e3665b43d9bc0bb1e1ec1c021c36","title":"Sir Jim Ratcliffe could sanction signing of 17-year-old wonderkid who punished Man Utd","link":"https://www.dailystar.co.uk/sport/football/man-utd-transfer-news-ratcliffe-31431698","keywords":["Sport"],"creator":null,"video_url":null,"description":"Sir Jim Ratcliffe could get into the swing of signing star prospects with a deal for a Champions League ace who will be a very familiar face to Man Utd fans","content":"Sir Jim Ratcliffe could sanction the signing of 's rival - but not bring him to Old Trafford. side were punished against Copenhagen last week with a 4-3 comeback defeat that was finished off by Swedish forward Roony Bardghji. The 17-year-old might just have booked himself a transfer with his winning goal - his tenth of the season in Denmark. Bardghji made his first-team debut at the age of 16 and six days back in November of 2021 and has since scored 15 goals across 57 fixtures and won back-to-back Danish Superliga titles. report that Bardghji is on the radar of Ratcliffe's Ligue 1 outfit Nice as well as a series of clubs on the back of the substitute performance that put United on the brink of a European exit altogether. as well as Newcastle and are said to be keeping an eye on the forward who is contracted to his current club until 2025. Copenhagen are said to be keen on keeping hold of their young prospect until the summer rather than selling up in January. Meanwhile, at Old Trafford, Ratcliffe is yet to officially take up his new role that involves a 25% ownership. He is thought to be taking the reins on football matters including transfers as well as the position of his manager. Ten Hag's men are current the form team in the Premier League with four wins from five matches to climb up to within seven points of leaders . The Daily Star is now on WhatsApp and we want you to join us! Through the app, we'll send you the sassiest showbiz stories, some naught headline and a seismic smattering of aliens...along with the latest breaking news of course. To join our community, all you have to do to join is , select 'Join Chat' and you're in! No one will be able to see who has sign up and no one can send messages except for the Daily Star team. We also treat our community members to competitions, special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. To leave our community click on the name at the top of your screen and choose Exit group. If you’re curious, you can read our . Ten Hag was not in attendance at the on Monday evening having had plans that he couldn't change. The Dutchman, 53, had an 'unbreakable and longstanding personal commitment in the Netherlands' which was given as the reason for his absence by the club Sir Alex Ferguson was among the attendees as were Roy Keane, Prince William and Gareth Southgate with four also there.","pubDate":"2023-11-13 22:53:41","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31431683.ece/ALTERNATES/s98/0_ECONOMY-ANTWERP-HARBOR-INVESTMENT.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d64961fbe5c3107e20c91e9e9256b1ae","title":"Steven Gerrard left without AWOL Al-Ettifaq star who drives home – 'as he was tired'","link":"https://www.dailystar.co.uk/sport/football/steven-gerrard-awol-al-ettifaq-31431387","keywords":["Sport"],"creator":null,"video_url":null,"description":"Steven Gerrard was incensed with one of his players who went AWOL before a game who claimed that he was too tired to play and made his way home","content":"was noticeably displeased with the reasoning one of his Al-Ettifaq players gave when going AWOL before a match. The manager of the publicly hit back at Mohammed Al-Kuwaykibi after the winger missed his side's 0-0 draw with Al-Feiha on Saturday (November 11). The 28-year-old was nowhere to be found before their league clash which left the legend incensed with the Saudi Arabia international. The winger said he was too tired to play on the weekend despite the Al-Ettifaq medical staff clearing him for action against Al-Feiha. Following the game, Gerrard spoke to the media about the situation and said: \"He got in his car and went home without permission. \"He was analysed by the doctor, the doctor said he was good to train but he got in his car and said he was tired and went home. I am still looking for reasons and answers as to why he wasn't here to help us today.\" The 43-year-old's comments may stir up tension with Al-Kuwaykibi - who has been at the club since 2016 - but the manager was backed by the team who released a statement of support for Gerrard. The statement read: \"We refuse to criticise the team's coach, as this is not the first time that Muhammad Al-Kuwaykibi has taken the same position. In Al-Nasr's first match in the league, he missed the main exercises with the same excuse.\" It's not been a particularly fruitful season for Al-Kuwaykibi who has played in 11 league games so far but has yet to score and has only registered one assist. The former England international is enduring rough form with his team currently sit seventh in the league after a run of just one win in six games. They are 13 points off league leaders Al-Hilal, despite a strong start to the season that saw them win five of their opening seven matches. A notable theme throughout the season has been their struggle for goals, scoring just 19 so far - the second-lowest in the top half of the table. Former and striker Moussa Dembele is their top scorer with seven league goals.","pubDate":"2023-11-13 22:51:30","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31431525.ece/ALTERNATES/s98/0_Al-Nassr-v-Al-Ettifaq-Saudi-King-Cup-of-Champions.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3b1022d717da46f400f462f3fb1b6e8f","title":"BetMGM Bonus Code NYPNEWS1500: Get 20% match or $200 bonus bets for Broncos-Bills, any game","link":"https://nypost.com/2023/11/13/sports/betmgm-bonus-code-nypnews1500-get-20-match-or-200-bonus-bets-for-broncos-bills-any-game/","keywords":null,"creator":["Action Network"],"video_url":null,"description":"The BetMGM bonus code NYPNEWS1500 lets new customers get a deposit match up to $1,500 in bonus bets for the Buffalo Bills hosting the Denver Broncos.","content":"NFL Week 10 wraps up tonight and New York Post readers can cash in with one of two new customer offers from BetMGM Sportsbook . These offers use BetMGM bonus codes NYPNEWS1500 or NPNEWSGET . Here’s what to expect from each offer: The exclusive new customer offer from BetMGM carries a 20% deposit match worth up to $1,500 in bonus bets. For instance, if you deposited $200, you’d get $40 in bonus bets, and so on up to $1,500 (meaning $7,500 is the max initial deposit for this offer). Kentucky bettors can use the BetMGM Kentucky bonus code NYPNEWS1500 to get the same deposit match offer. This offer is not available in New York and Washington DC. If you’re interested in another fun sportsbook, check out the new ESPN BET promo code before it launches! Click the buttons below to learn more. All offers work for all BetMGM sports markets. Tonight’s ‘Monday Night Football’ matchup takes us to Buffalo where Josh Allen and the Bills host the Denver Broncos. Buffalo is favored by 7.5 points on BetMGM Sportsbook and that line just seems a bit too high. The Bills just aren’t as impressive as they have been in recent years and Denver appears to have figured some things out. Get the free Action Network app for expert picks, live odds, bet tracking and more. Buffalo has been very average in its last five games, losing three and winning two in close games. Allen is having a decent season, but his nine interceptions have cost the Bills games this year and it feels like some of his reckless decisions continue each week. Right off a bye, the Broncos appear to be on a bit of an upswing. They ground out two home wins over the Packers and Chiefs in which their defense played well and they ran the ball fairly effectively. Russell Wilson was also able to play mistake-free football in that stretch. I don’t expect the Bills to lose this game, but they haven’t been playing well enough to expect them to win by eight points. Take the Broncos to cover on bet365 Sportsbook with bonus code NYPNEWS .","pubDate":"2023-11-13 22:45:00","image_url":"https://nypost.com/wp-content/uploads/sites/2/2023/11/GettyImages-1780251575.jpg?quality=90&strip=all","source_id":"nypost","source_priority":109,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"4c1b0951c78e3cb6c18de21ac1f3072b","title":"Heavy loss to Celtic is a reality check for Aberdeen, says captain Graeme Shinnie","link":"https://www.pressandjournal.co.uk/fp/sport/football/aberdeen-fc/6256615/humiliating-6-0-loss-to-celtic-delivers-aberdeen-reality-check-says-graeme-shinnie/","keywords":["Aberdeen FC","Aberdeen","Celtic FC","Europa Conference League","Graeme Shinnie"],"creator":["Sean Wallace"],"video_url":null,"description":"Shinnie has reiterated the Dons squad must 'deal with' the combined demands of European group stage action and domestic commitments.","content":"Captain Graeme Shinnie believes the hammering by Celtic is a reality check of the levels Aberdeen need to reach. The straight-talking skipper accepts losing 6-0 at Parkhead is not acceptable. For Shinnie, Sunday’s heavy loss was particularly hard to take as it stopped a recent resurgence in form from the Dons. Aberdeen drew 2-2 with Group G leaders PAOK in the Europa Conference League fewer than 72 hours before the Parkhead shocker. Prior to the Euro clash in Greece, the Reds secured a Viaplay Cup final slot and also defeated Motherwell 4-2 away in the Premiership. Losing so heavily at Parkhead brought Aberdeen crashing back to earth. Shinnie said: “We went into the Celtic game in pretty good form, but were brought back to reality a little bit as to where our performances need to be. “Overall, for the whole game, we were not at the races and it wasn’t acceptable. “It’s hard. “You single out this game – however, we won at Motherwell, get through to a cup final and had a good performance over in PAOK. “That was three positive performances so this (Celtic) is a sore one to take.” Exertions in Greece ‘no excuse’ for Parkhead shocker Aberdeen flew back from Greece on Friday after The Dons ended the 100 percent record of PAOK in Group G. In contrast, Premiership Hearts had been overwhelmed 4-0 at the Toumba Stadium by the Greek Super League side in the Europa Conference League play-off earlier this season. But Shinnie was adamant the exertions in Greece were not at the root of the performance against Celtic. He said: “It’s no excuse. “Of course, we are not going to get away from the fact it has been a gruelling schedule. “I think five away games in a row, there’s no getting away from that, but it’s no excuse for that performance. “If anything, you can maybe tire towards the end, but we looked tired from the start – you can’t blame that on fatigue. “It’s just not been good enough and, overall, like the manager said, not acceptable as a team.” ‘We need to deal with it as a team’ Aberdeen have won just one of the six games immediately following European action this season, losing three and drawing twice. Facing Celtic at Parkhead on Sunday was the culmination of five consecutive away games for the Dons over just 16 days. Rather than complain about the schedule, Shinnie insists the Dons must deal with it. He would rather have the congested fixture list that comes with Euro group action and domestic cup progression than inactivity. The 32-year-old said: “This is where we want to be. “In European competitions and in cup finals, fighting to get into cup finals. “We can’t use it as an excuse because it is exactly where this club wants to be. “So we need to deal with it as a team.” Slow start played into Celtic’s hands Aberdeen were 2-0 down after 16 minutes to reigning Premiership champions Celtic. They went 3-0 behind to a second half penalty before a complete collapse late on when they conceded three goals in injury time. Shinnie accepts The Dons have failed to win in the previous 21 games in all competitions where they have let in the opening goal. Scotland international Shinnie said: “Going to Celtic, you know they like to start fast. “They like to try and come at you quick and almost effectively try and win the game in the first 20 to 30 minutes. “Being 2-0 down in 16 minutes is exactly what they wanted and it was such a slow start for us. “That’s a frustrating part of it.”","pubDate":"2023-11-13 22:30:11","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2023/11/20915905_54231938-291xi3rch-e1699882186469-140x84.jpg","source_id":"pressandjournal","source_priority":105351,"country":["united kingdom"],"category":["sports"],"language":"english"}]}