{"newsArray":[{"article_id":"964df9faef4d57ba0462706982687ea5","title":"Napoli’s Social Media Executive Resigns Amid Backlash Over Mocking Osimhen","link":"https://tdpelmedia.com/osimhen-tiktok-video-napolis-social-media-executive-resigns-amid-backlash/","keywords":["Sports News","Nigeria"],"creator":["Funmilayo Salau"],"video_url":null,"description":"Napoli’s Social Media Executive Resigns Amid Osimhen Video Backlash Alessio Fortino, the social media executive of Napoli Football Club, has announced his resignation from his The post Napoli’s Social Media Executive Resigns Amid Backlash Over Mocking Osimhen appeared first on TDPel Media.","content":"Alessio Fortino, the social media executive of Napoli Football Club, has announced his resignation from his role in the midst of a public outcry over a TikTok video posted on the club’s official handle. The video in question targeted Nigerian football star Victor Osimhen, resulting in widespread criticism. The controversy erupted after Napoli shared a video on their social media platform, mocking Victor Osimhen for missing a penalty kick during their 0-0 draw against Bologna. This viral video stirred outrage both within and outside the football community. In response to the video, Osimhen removed all Napoli-related content from his Instagram account, and his agent, Roberto Calenda, issued threats of legal action. The Nigerian government also weighed in on the issue, pledging to engage with the Italian government, Napoli, and Osimhen himself regarding the incident. The video’s impact extended far beyond the world of sports, highlighting the significance of respectful and responsible social media content. Victor Osimhen has enjoyed an impressive run at Napoli since joining the club. He emerged as both the club’s and Serie A’s top scorer, netting 26 goals last season as Napoli clinched their first Scudetto in 33 years. However, the recent video controversy threatened to overshadow his accomplishments. The first video that sparked outrage depicted the 24-year-old striker appealing for a penalty, accompanied by child-like audio and the caption ‘Gimme penalty please.’ This was followed by a second video comparing Osimhen to a ‘coconut,’ which is widely regarded as a racial slur. Although Napoli insisted they meant no harm, the fallout resulted in the resignation of Alessio Fortino, the social media executive. Confirming his decision to step down on Instagram, Alessio Fortino expressed gratitude for his time with SSC Napoli, acknowledging the support he received from colleagues, partners, and fans. While Fortino departs, it’s reported that Napoli directors privately apologized to Osimhen for the club’s actions on social media, aiming to mend the strained relationship. Alessio Fortino’s resignation serves as a reminder of the importance of responsible and respectful social media engagement, especially when it involves public figures and athletes.","pubDate":"2023-10-01 22:07:50","image_url":null,"source_id":"tdpelmedia","source_priority":27640785,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"82563f91cfaf4ad4c1f9bd048f7df11e","title":"MAJOR Scottish Premiership Club Fires Its Manager After Just 10 Months","link":"https://euroweeklynews.com/2023/10/01/major-scottish-premiership-club-rangers-fire-michael-beale/","keywords":["Aston Villa","Celtic","Chelsea","Football","Liverpool","Rangers","Sport","Michael Beale","Rangers FC","Scottish Premiership","Twitter Share"],"creator":["Chris King"],"video_url":null,"description":"THE first managerial casualty of the Scottish Premiership occurred this Sunday, October 1. Rangers Football Club confirmed that it had parted company with Michael Beale, the Glasgow club’s men’s first-team manager. In an official statement on rangers.co.uk, they wrote: ‘The Rangers board would like to put on record their thanks to Michael and his staff […]","content":"Rangers Football Club confirmed that it had parted company with Michael Beale, the Glasgow club’s men’s first-team manager. In an official statement on , they wrote: ‘The Rangers board would like to put on record their thanks to Michael and his staff for their efforts since joining the club last November’. Most Read on Euro Weekly News It continued: ‘Results this season have fallen short of what everyone connected to Rangers would expect. Therefore, the decision was reached today to terminate the contract of the manager, as well as the contracts of coaches Neil Banfield, Damian Matthew, Harry Watling and Jack Ade’. ‘The club is pleased to announce that Steven Davis will lead the interim management team. The team will consist of former Rangers player and hugely experienced coach Alex Rae, former Rangers player and current coach Steven Smith, coach Brian Gilmour, and goalkeeping coach, Colin Stewart’, the statement concluded. Rangers chairman John Bennett confirmed the search for a new manager John Bennett, the Rangers Chairman, commented: ‘I’d like to thank Michael for his dedicated work since he re-joined the club as manager last November. It is clear that results have fallen well short of the board’s, Michael’s and our supporters’ expectations’. ‘The search process for the new manager is already underway. I wish Steven Davis and the interim management team every success – they will remain in charge for as long as it takes to make the right appointment’, he explained. Rangers trail Celtic by seven points Beale was appointed as head coach at Ibrox last November following the departure of the Dutchman Giovanni van Bronckhorst. With only seven games of the new campaign played, the Glasgow giants have already lost three league matches and currently trail their city rivals Celtic by seven points. A 3-1 home defeat by Aberdeen yesterday that saw the players booed off the pitch was clearly the straw that broke the camel’s back. The 43-year-old Englishman previously worked under at both Rangers and . He also had spells coaching with , and in Brazil with São Paulo. Rangers face a trip to Cyprus on Thursday 5, to face Aris Limassol in a Europa League group match. Thank you for taking the time to read this article. Do remember to come back and check website for all your up-to-date local and international news stories and remember, you can also follow us on and .","pubDate":"2023-10-01 21:26:36","image_url":"https://euroweeklynews.com/wp-content/uploads/2023/10/ibrox-1024x608.jpg","source_id":"euroweeklynews","source_priority":251231,"country":["spain"],"category":["sports"],"language":"english"},{"article_id":"cb7650af04e1d92d51edc0455ffdbf82","title":"T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium","link":"https://www.dailymail.co.uk/sport/nfl/article-12581675/T-Minus-Travis-Chiefs-star-Kelce-arrives-hotel-New-Jersey-Taylor-Swifts-Range-Rover-just-hours-music-megastar-watches-Jets-Metlife-stadium.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Kelce was seen arriving at his hotel in the popstar's SUV - hours before his team takes on the New York Jets in a game which has sparked as much excitement among Swifties as NFL fans.","content":"T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium The Chiefs star was glimpsed entering the Envue Hotel in Weehawken on Sunday ahead of his team's clash with the New York Jets at the MetLife Stadium Kelce appeared back at the hotel and legged it into a small side entrance after presumably spending the night at the Eras megastar's apartment The Kansas City Chiefs game against the Jets at 8.20pm tonight has sparked as much excitement among Swifties as NFL fans thanks to the pairing By Laura Parnaby For Dailymail.Com Published: 19:17, 1 October 2023 | Updated: 00:09, 2 October 2023 e-mail 1.7k shares 789 View comments Travis Kelce has been spotted arriving back at his New Jersey hotel in Taylor Swift 's Range Rover, after he is believed to have spent the night at her apartment. The 33-year-old tight end was glimpsed entering the Envue Hotel in Weehawken just before 1pm on Sunday ahead of Kansas City Chiefs ' clash with the New York Jets at MetLife Stadium in East Rutherford. With kick-off due at 8.20pm, the game has sparked as much excitement among Swifties as NFL fans amid rumors the Eras megastar will be supporting Kelce's team from the sidelines. After spending Sunday in Manhattan with Swift, the Chiefs legend appeared back at the hotel and legged it into a small side entrance, where an employee was waiting with a door held open for him. Wearing a black t-shirt and cap, the 6-foot-5 athlete attempted an inconspicuous arrival after arriving in Swift's SUV. Travis Kelce was glimpsed entering the Envue Hotel in Weehawken just before 1pm on Sunday ahead of the Kansas City Chiefs MetLife Stadium clash with the New York Jets The 33-year-old tight end was spotted arriving at the hotel in Taylor Swift 's Range Rover Meanwhile, Taylor Swift was spotted indulging in a girls' night out with her pals Blake Lively and Sophie Turner in New York City on Saturday night A female fan wearing a Swiftie t-shirt was waiting outside with her pet bulldog in the hope of catching sight of the latest high-profile celebrity couple. And she's not the only fan eagerly awaiting the game. News of the popstar's likely appearance at the Sunday game at MetLife Stadium - the same sprawling venue where she performed as part of her Eras Tour in May - has sent her hefty fanbase into an online frenzy. Taylor Swift spent two whirlwind nights in Kansas City getting to know her new beau Travis Kelce earlier this week Swift sat beside Kelce's mother Donna in a suite during the Chiefs' victory over the Chicago Bears last week, and she left the arena with the player. She was last spotted indulging in a girls' night out with her pals Blake Lively and Sophie Turner in New York City on Saturday night. They dined that evening at the Soho eatery Emilio’s Ballato with Brittany Mahomes, the wife of Travis' teammate Patrick Mahomes, according to a report in Page Six . The Italian eatery is owned by the smoldering chef Emilio Vitolo Jr., who hit the headlines a few years ago because of his brief romantic involvement with Katie Holmes. While dashing off to dinner at Emilio's Ballato this Saturday night, Taylor could be spotted holding hands with Blake, who has been a close pal of hers for years. In fact, their Saturday night outing comes just hours after Taylor attended the seventh birthday party of Blake's daughter Inez, whom she shares with her husband Ryan Reynolds . Taylor famously also released a song in 2020 called Betty, named after Blake and Ryan's third daughter, who is now three years old. By the way: The 33-year-old pop superstar is rumored to be attending her new boyfriend Travis Kelce 's NFL game Sunday night across the Hudson River Looking fab: Amid the swirling public drama, Sophie grabbed a breather with her girlfriends, stepping out in New York on Saturday night in a sleekly revealing ensemble Taylor's presence at the football game sent shockwaves throughout the football and pop worlds when she was seen cheering Travis on next to his parents. Pictured with Travis' mom Donna Meanwhile, Taylor has been cultivating a blossoming friendship with Sophie amid the latter's divorce from their mutual ex Joe Jonas. Taylor, who briefly dated Joe in the summer of 2008, has written multiple songs that are rumored to be about him, including the scathing Better Than Revenge. Joe and Sophie married in 2019 and separated this month, since when they have been waging a bitter custody battle that has unfolded in the headlines. Their principle bone of contention appears to be where their two young daughters will live, with Joe arguing for the US and Sophie pulling for her native UK. Share or comment on this article: T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium e-mail 1.7k shares Add comment Comments 792 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-01 21:18:43","image_url":"https://i.dailymail.co.uk/1s/2023/10/01/19/76044191-0-image-m-18_1696184047127.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5e4387e39266b9ba312ab4ba3f6abb63","title":"Three talking points from the Premier League weekend","link":"https://guardian.ng/sport/three-talking-points-from-the-premier-league-weekend-2/","keywords":["Football","Sport","Aston Villa News","EPL News","Man City News"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Manchester City's shock 2-1 defeat to Wolves leaves the Premier League's top six separated by just three points. The post Three talking points from the Premier League weekend appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Manchester City’s shock 2-1 defeat to Wolves leaves the Premier League’s top six separated by just three points. Tottenham took full advantage of City’s first slip-up of the season to close within one point of the lead, but had luck and poor officiating on their side in a controversial 2-1 win over nine-man Liverpool. Arsenal also closed on City ahead of their showdown next weekend by cruising to a 4-0 win at Bournemouth. Aston Villa moved ahead of Brighton into fifth by thrashing the Seagulls 6-1. But it was another miserable weekend for Manchester United, who slumped to a 1-0 home defeat to Crystal Palace. AFP Sport looks at three talking points from the Premier League weekend: VAR costs luckless Liverpool Referees’ body PGMOL was forced into a swift apology following full-time at the Tottenham Hotspur Stadium after VAR failed to intervene and award a Liverpool goal in the first-half. The Reds had already lost Curtis Jones to an early red card when Luis Diaz sped in behind and smashed low and hard into the far corner of the Spurs net. Diaz was flagged offside on the field but replays quickly showed the Colombian had been played on by Cristian Romero. To compound Liverpool’s anger, Spurs soon took the lead through Son Heung-min. Jurgen Klopp’s men battled back to level with 10 men through Cody Gakpo, then survived 25 minutes with nine after Diogo Jota also saw red. But their misfortune was rounded off in the 96th minute when Joel Matip sliced Pedro Porro’s cross into the top corner of his own net to hand Tottenham victory. “I never saw a game like this with the most unfair circumstances, crazy decisions,” said Klopp. Villa target top four Brighton started the weekend in third but dreams of the Seagulls reaching the Champions League for the first time were given a huge reality check at Villa Park. Ollie Watkins became the first Villa player to score two hat-tricks in one season for 47 years. The England striker is just one of many Villa players transformed since the arrival of Unai Emery. Only Erling Haaland and Mohamed Salah have been involved in more goals and assists in the Premier League than Watkins’ 24 since Emery took charge a year ago. Emery led Villa back into Europe for the first time in 13 years last season and captain John McGinn now has his sights set on bringing Champions League football to Villa Park. “Hopefully we can try and disrupt that top four, top six. It is not going to be easy, but why not?. “Why can’t we challenge them and do what Newcastle did last season?” More Man Utd misery As the top six bunch together, United slipped down to 10th with their fourth defeat in seven league games. The Red Devils are now off to their worst ever start in the Premier League era. It was a familiar story for Erik ten Hag’s men as a series of chances were squandered at Old Trafford after Joachim Andersen’s stunning strike had given Palace the lead. “We were, many times, close and then you have to be clinical, concentrated and be sharp,” said Ten Hag. United had been on an impressive 31-game unbeaten run at home in all competitions prior to Brighton’s success at the Theatre of Dreams. But the warning signs had been there in victories over Wolves and Nottingham Forest earlier this season when United were far from convincing. Ten Hag is battling a mounting injury list but he accepted there can be “no excuses” for such a run of form that has already jeopardised their chances of even climbing back into the top four. Follow Us","pubDate":"2023-10-01 21:17:19","image_url":null,"source_id":"guardian","source_priority":11489,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"9309e684f3a37ee03ea093b3efc6acf4","title":"Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home'","link":"https://www.dailymail.co.uk/sport/nfl/article-12581981/Aaron-Rodgers-returns-MetLife-Stadium-time-suffering-Achilles-tear-New-York-Jets-debut-Welcome-home.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Jets shared a clip of the sidelined quarterback entering the stadium on the back of a golf cart clutching his crutches in his hand ahead of watching his team take on the Kansas City Chiefs.","content":"Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home' Aaron Rodgers ruptured his Achilles just four snaps into his Jets debut in Week 1 Taylor Swift is also expected to be in attendance amid romance with Travis Kelce DailyMail.com provides all the latest international sports news By Isabel Baldwin For Dailymail.Com Published: 16:30 EDT, 1 October 2023 | Updated: 17:15 EDT, 1 October 2023 e-mail 54 shares 19 View comments Aaron Rodgers made his return to MetLife Stadium Sunday three weeks after he ruptured his Achilles during his New York Jets debut. The Jets' X account shared a clip of the veteran quarterback entering the stadium on the back of a golf cart clutching his crutches in his hand ahead of watching his team take on reigning Super Bowl champion, the Kansas City Chiefs. It marks the first time the four-time MVP has returned to MetLife Stadium after suffering his potentially season-ending injury during Week 1. The sidelined signal caller, dressed casually in a white t-shirt, blue jeans and shades, appeared it be in good spirits as he offered a little wave and smile to the camera. The 39-year-old attended a team meeting at the Jets´ hotel Saturday night, according to a person with knowledge of the situation, according to The Associated Press. Welcome home, @AaronRodgers12 pic.twitter.com/TmiuHHQK8w — New York Jets (@nyjets) October 1, 2023 Aaron Rodgers made his return to MetLife Stadium Sunday three weeks after his Achilles tear Rodgers tore his Achilles minutes into his Jets debut against Buffalo Bills on September 11 Rodgers had been healing and rehabilitating at home in Malibu, California, after having surgery two-and-a-half weeks ago to repair a torn left Achilles tendon. Rodgers was injured four snaps into his debut with the Jets on September 11 against Buffalo. Rodgers hinted earlier this week during his weekly appearance on 'The Pat McAfee Show' he could make his first public appearance since the injury if he was cleared by doctors to travel. 'You never know who you´re going to see at the game,' Rodgers said with a grin. Rodgers won't be the only VIP in attendance at the game as Taylor Swift is expected to be in New Jersey to watch the Week 4 matchup amid her romance with Chiefs tight end Travis Kelce. Swift already attended Kansas City's last game , a 41-10 win against the Chicago Bears, last Sunday at Arrowhead. In that game, Kelce had seven receptions for a touchdown and 69 yards. Photos published by the New York Post on Friday of Rodgers walking on crutches and his left leg in a compression sleeve after a workout in Los Angeles further fueled speculation the quarterback could attend the game. 'I would love to have him back, but whenever it is safe for him to travel,' coach Robert Saleh said Friday. 'I know he wants to get back, but I'm not exactly sure where that is on the timeline.' It apparently was right on time for him to make it to the game Sunday night. His teammates were excited about the idea of Rodgers at some point rejoining them, even if he can't play. Taylor Swift is expected to be in attendance amid her romance with Chiefs tsar Travis Kelce Rodgers hinted earlier this week' he could make his first public appearance since the injury It initially appeared that Rodgers would miss the entire year or even consider retiring 'That would be awesome to have as good of a football mind as he is around the team for, you know, someone like me to be able to bounce my thoughts off and see what he´s thinking,' wide receiver Garrett Wilson said Friday. 'To have him around, the energy, the aura that he comes with, I mean, it´s priceless, man. So as soon as we can get him back, his presence will be felt. 'And, I look forward to that. I hope it is this weekend.' It initially appeared that Rodgers would miss the entire year and the injury even cast doubt on his future in the NFL. Rodgers, who turns 40 in December, even admitted to Pat McAfee that he had considered retiring from football in the immediate aftermath of the injury. 'It's tough, every single day is tough. I've been grinding on the rehab and looking forward to getting back out to Jersey at some point,' Rodgers said as he offered an update on his rehab last week. 'It's disappointing not to be out there.' Rodgers also joked that his rehab is the 'reverse darkness retreat' as he was in a white room without anything on the walls. According to ESPN, it is 'not out of the question' that Rodgers comes back before the Super Bowl in February, with the quarterback refusing to put a timeframe on his return. In the meantime, Rodgers has watched his new team, which he joined in a blockbuster trade from the Green Bay Packers during the offseason, from home. Rodgers said the Jets offense 'needs to grow up' amid rising frustration levels this week Running back Michael Carter was seen yelling at his position coach on the sideline on Sunday But the veteran seemingly hasn't been impressed with what he has seen on the field as he offered his teammates some stern advice earlier this week. Rodgers was making his weekly appearance on 'The Pat McAfee Show' when he said that he wasn't a fan of the 'little side conversations' that took place during the 15-10 loss to the New England Patriots and said his teammates needed to 'grow up.' 'I think we need to hold our poise a little bit better across the board,' Rodgers said. 'Just offensively, we need to not have some of those things happen on the sideline and to be a little better and to be a, just be a little better competitors. 'Too many little side conversations, and we just need to grow up a little bit on offense and lock in and do our jobs and not point fingers at each other -- and that's everybody. Don't point fingers at the coaching staff, don't point fingers at each other. Just get back to work and get the job done.' Rodgers was in large part alluding to the animated conversations seen on the sidelines involving WR Garrett Wilson and RB Michael Carter. Share or comment on this article: Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home' e-mail 54 shares Add comment Comments 20 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-01 21:15:06","image_url":"https://i.dailymail.co.uk/1s/2023/10/01/21/76047121-0-image-m-10_1696192187391.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8ebf1e2cf5030eee77709039bdba723c","title":"Navua aware of Suva’s threat","link":"https://www.fbcnews.com.fj/sports/football/navua-aware-of-suvas-threat/","keywords":["Football"],"creator":["Nitesh Raniga"],"video_url":null,"description":"This year’s Courts Inter-District Championship, according to Navua coach Saiyad Ali, will feature high-caliber matchups due to the evenly divided pools, and he knows Suva will also be at the top of their game. Since Suva is hosting and hasn’t yet won any of this year’s completed contests, Ali feels there will be a lot […]","content":"This year’s Courts Inter-District Championship, according to Navua coach Saiyad Ali, will feature high-caliber matchups due to the evenly divided pools, and he knows Suva will also be at the top of their game. Since Suva is hosting and hasn’t yet won any of this year’s completed contests, Ali feels there will be a lot of pressure on them. Regardless, the Navua coach is confident that Suva will fight hard to establish their name. Ali claims that his team has performed exceptionally well in previous competitions, but that does not mean they will sleep on the job next week. The IDC begins next week on Tuesday and will conclude next week on Sunday at the HFC Bank Stadium in Suva.","pubDate":"2023-10-01 21:09:42","image_url":"https://www.fbcnews.com.fj/wp-content/uploads/2023/10/011023TT-Navua-8am.mp3","source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"9a4806d08dbae89758dd489c331ff165","title":"Liverpool issue statement blasting “unacceptable” VAR failures as Reds “explore options”","link":"https://ionigeria.com/liverpool-issue-statement-blasting-unacceptable-var-failures-as-reds-explore-options/?utm_source=rss&utm_medium=rss&utm_campaign=liverpool-issue-statement-blasting-unacceptable-var-failures-as-reds-explore-options","keywords":["Football"],"creator":["Charles Igbinidu"],"video_url":null,"description":"Liverpool were denied a goal by a VAR decision during their Premier League defeat at Tottenham on Saturday, with a later PGMOL statement referring to “significant” error Liverpool have vowed to “explore the range of options available” after claiming sporting integrity was undermined after Luis Diaz’s goal was ruled out against Tottenham for what the … The post Liverpool issue statement blasting “unacceptable” VAR failures as Reds “explore options” appeared first on ionigeria.com.","content":"Spread the love Liverpool have vowed to “explore the range of options available” after claiming sporting integrity was undermined after Luis Diaz’s goal was ruled out against Tottenham for what the PGMOL described as “significant human error”. Diaz’s goal against Spurs was incorrectly disallowed for offside after the VAR mistakenly believed the on-field decision had been to award the goal. A Liverpool statement issued on Sunday evening read: “Liverpool Football Club acknowledges PGMOL’s admission of their failures last night. It is clear that the correct application of the laws of the game did not occur, resulting in sporting integrity being undermined. “We fully accept the pressures that match officials work under but these pressures are supposed to be alleviated, not exacerbated, by the existence and implementation of VAR. “It is therefore unsatisfactory that sufficient time was not afforded to allow the correct decision to be made and that there was no subsequent intervention. “That such failings have already been categorised as “significant human error” is also unacceptable. Any and all outcomes should be established only by the review and with full transparency. “This is vital for the reliability of future decision making as it applies to all clubs with learnings being used to make improvements to processes in order to ensure this kind of situation cannot occur again. “In the meantime, we will explore the range of options available, given the clear need for escalation and resolution.”","pubDate":"2023-10-01 20:49:03","image_url":null,"source_id":"ionigeria","source_priority":4862299,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"70ec831da8e19d15dbd901e23130cdfe","title":"Liverpool say blown VAR call 'undermined sporting integrity'","link":"https://guardian.ng/sport/liverpool-say-blown-var-call-undermined-sporting-integrity/","keywords":["Football","Sport","EPL News","Liverpool News","Luis Diaz","VAR"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Liverpool on Sunday said a botched VAR decision that cost them a goal in their 2-1 defeat at Tottenham resulted in \"sporting integrity being undermined\". The post Liverpool say blown VAR call 'undermined sporting integrity' appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Liverpool on Sunday said a botched VAR decision that cost them a goal in their 2-1 defeat at Tottenham resulted in “sporting integrity being undermined”. Referees’ body the PGMOL, admitted a “significant human error” had meant Luis Diaz’s strike, when Saturday’s game was level at 0-0, was not awarded by a VAR review after being flagged offside. PGMOL chief Howard Webb also reached out to apologise to Liverpool on Saturday evening. The match officials at fault for the mistake were stood down from duty for the rest of the Premier League weekend. “Liverpool Football Club acknowledges PGMOL’s admission of their failures last night. It is clear that the correct application of the laws of the game did not occur, resulting in sporting integrity being undermined,” read a statement. “We fully accept the pressures that match officials work under but these pressures are supposed to be alleviated, not exacerbated, by the existence and implementation of VAR. “It is therefore unsatisfactory that sufficient time was not afforded to allow the correct decision to be made and that there was no subsequent intervention.” Liverpool added that they will now explore their options “given the clear need for escalation and resolution.” Victory at the Tottenham Hotspur Stadium would have taken Jurgen Klopp’s men to the top of the Premier League table. However, they had a mountain to climb after just 26 minutes when Curtis Jones was shown a straight red card after the VAR officials did intervene to instruct an on-field review for his challenge on Yves Bissouma. The visitors should still have taken the lead when Diaz’s strike found the far corner and replays showed he had been played onside by Cristian Romero. Liverpool’s fury was compounded when Spurs took the lead moments later through Son Heung-min. The 10 men fought back to level at 1-1 before half-time through Cody Gakpo. But Liverpool were then reduced to nine men for the final 20 minutes when Diogo Jota was sent-off for a second bookable offence. The Reds still nearly held out for a remarkable point until Joel Matip’s 96th-minute own goal handed Spurs victory. “I never saw a game like this with the most unfair circumstances, crazy decisions,” said Klopp. Follow Us","pubDate":"2023-10-01 20:44:57","image_url":null,"source_id":"guardian","source_priority":11489,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"21d1c0ed7e4aa0a181a688be17cf590a","title":"\"He’s got to be a better defender\" - Pundit slams Manchester United star for error in loss to Crystal Palace","link":"https://www.sportskeeda.com/football/news-he-s-got-better-defender-pundit-slams-manchester-united-star-error-loss-crystal-palace","keywords":["Football"],"creator":["Nnanna Mba"],"video_url":null,"description":null,"content":"Football pundit Tony Cascarino has expressed serious concerns over Manchester United defender Victor Lindelof's recent performance. The club suffered their fourth Premier League defeat this season, falling 1-0 at home to Crystal Palace. Lindelof's inability to effectively mark Joachim Andersen during a crucial corner situation led to the game's decisive goal and has put his defensive skills under scrutiny. This prompted Cascarino to question his defensive capabilities during his appearance on the Weekend Sports Breakfast . Victor Lindelof has started five games for Manchester United in the current campaign. However, Cascarino has stated that his contributions have been subpar (via GOAL): Cascarino further elaborated: In the wake of mounting frustration from supporters, United's manager Erik ten Hag has openly admitted to understanding the fans' growing disillusionment. The club was handed its fourth Premier League defeat of the season in a 1-0 loss to Crystal Palace, sinking them further to a concerning 10th place. The loss, a second consecutive one at home, marks the club's most dismal season start in 34 years. Ten Hag, charged with steering the Red Devils back to their glorious past, has not had an easy journey so far. He has grappled with not only on-field issues but also off-field disturbances. His leadership and tactics were called into question once more when audible boos reverberated around Old Trafford as the final whistle sounded. Addressing the fans' exasperation, Ten Hag conceded (via 90min): With a Champions League fixture against Galatasaray looming in the midweek, followed by another match against Brentford, the pressure is escalating. A victory in these upcoming matches is not merely desirable: it's increasingly looking like a prerequisite to maintain the faith of the Manchester United fanbase. Quick Links","pubDate":"2023-10-01 20:22:05","image_url":"https://staticc.sportskeeda.com/editor/2023/10/bd2fb-16961827340532-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"06c988f3969962db5ea6abc02df95e80","title":"Deion Sanders' girlfriend Tracey Edmonds calls herself \"president of Coach Prime’s fans club\" after Colorado's loss to USC","link":"https://www.sportskeeda.com/college-football/news-deion-sanders-girlfriend-tracey-edmonds-calls-president-coach-prime-s-fans-club-colorado-s-loss-usc","keywords":["College Football"],"creator":["Farouk Yusuf"],"video_url":null,"description":null,"content":"Tracey Edmonds has named herself the president of Deion Sanders fans club, and many would say she has earned it. Following an impressive start to 2023, Colorado suffered its second defeat of the season on Saturday, losing 48-41 to USC at Folsom Field. This marks a back-to-back loss for the Buffaloes after falling to the Oregon Ducks during their Week 4 game in Eugene. However, the support for Deion Sanders from his loved ones hasn't waned a bit. Coach Prime's girlfriend, Tracy Edmonds, has been one of his biggest supporters since he took the Colorado job. She has once again come out to show public support for him following the USC loss. In an Instagram post with a picture of herself and Brittany Faye, girlfriend of Deion Sanders Jr., Tracey Edmonds penned a message of support to Deion Sanders after the loss, further declaring herself as the president of Coach Prime fans club. She captioned the post: Instagram Post Deion Sanders has maintained a long-term relationship spanning over a decade with businesswoman and TV personality Tracey Edmonds. They started dating in 2012 and have remained together since then. Deion Sanders initially crossed paths with Tracey Edmons at a party for a film she was producing. Afterward, they had a couple of meetings to discuss the idea of creating a reality television show, which eventually sparked the beginning of their romantic relationship. However, despite the long-term relationship, the couple are not legally married. It does not seem that Deion Sanders and Tracey Edmonds will one day decide to walk down the aisle. Nonetheless, this doesn't have any impact on their love life and romantic relationship. Colorado has suffered two consecutive defeats from its Pac-12 rivals. In some way, this has downplayed the Buffs' brilliant start to the 2023 college football season. However, there's a chance for redemption when they play Arizona State in Week 6. Many college football analysts believed Colorado wouldn't win the game against Oregon and USC . However, the Buffaloes have a good chance against Arizona State next week. The Sun Devils have only won one of their five games this season. Quick Links","pubDate":"2023-10-01 20:22:05","image_url":"https://staticc.sportskeeda.com/editor/2023/10/c7c7d-16961852005087-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"964df9faef4d57ba0462706982687ea5","title":"Napoli’s Social Media Executive Resigns Amid Backlash Over Mocking Osimhen","link":"https://tdpelmedia.com/osimhen-tiktok-video-napolis-social-media-executive-resigns-amid-backlash/","keywords":["Sports News","Nigeria"],"creator":["Funmilayo Salau"],"video_url":null,"description":"Napoli’s Social Media Executive Resigns Amid Osimhen Video Backlash Alessio Fortino, the social media executive of Napoli Football Club, has announced his resignation from his The post Napoli’s Social Media Executive Resigns Amid Backlash Over Mocking Osimhen appeared first on TDPel Media.","content":"Alessio Fortino, the social media executive of Napoli Football Club, has announced his resignation from his role in the midst of a public outcry over a TikTok video posted on the club’s official handle. The video in question targeted Nigerian football star Victor Osimhen, resulting in widespread criticism. The controversy erupted after Napoli shared a video on their social media platform, mocking Victor Osimhen for missing a penalty kick during their 0-0 draw against Bologna. This viral video stirred outrage both within and outside the football community. In response to the video, Osimhen removed all Napoli-related content from his Instagram account, and his agent, Roberto Calenda, issued threats of legal action. The Nigerian government also weighed in on the issue, pledging to engage with the Italian government, Napoli, and Osimhen himself regarding the incident. The video’s impact extended far beyond the world of sports, highlighting the significance of respectful and responsible social media content. Victor Osimhen has enjoyed an impressive run at Napoli since joining the club. He emerged as both the club’s and Serie A’s top scorer, netting 26 goals last season as Napoli clinched their first Scudetto in 33 years. However, the recent video controversy threatened to overshadow his accomplishments. The first video that sparked outrage depicted the 24-year-old striker appealing for a penalty, accompanied by child-like audio and the caption ‘Gimme penalty please.’ This was followed by a second video comparing Osimhen to a ‘coconut,’ which is widely regarded as a racial slur. Although Napoli insisted they meant no harm, the fallout resulted in the resignation of Alessio Fortino, the social media executive. Confirming his decision to step down on Instagram, Alessio Fortino expressed gratitude for his time with SSC Napoli, acknowledging the support he received from colleagues, partners, and fans. While Fortino departs, it’s reported that Napoli directors privately apologized to Osimhen for the club’s actions on social media, aiming to mend the strained relationship. Alessio Fortino’s resignation serves as a reminder of the importance of responsible and respectful social media engagement, especially when it involves public figures and athletes.","pubDate":"2023-10-01 22:07:50","image_url":null,"source_id":"tdpelmedia","source_priority":27640785,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"82563f91cfaf4ad4c1f9bd048f7df11e","title":"MAJOR Scottish Premiership Club Fires Its Manager After Just 10 Months","link":"https://euroweeklynews.com/2023/10/01/major-scottish-premiership-club-rangers-fire-michael-beale/","keywords":["Aston Villa","Celtic","Chelsea","Football","Liverpool","Rangers","Sport","Michael Beale","Rangers FC","Scottish Premiership","Twitter Share"],"creator":["Chris King"],"video_url":null,"description":"THE first managerial casualty of the Scottish Premiership occurred this Sunday, October 1. Rangers Football Club confirmed that it had parted company with Michael Beale, the Glasgow club’s men’s first-team manager. In an official statement on rangers.co.uk, they wrote: ‘The Rangers board would like to put on record their thanks to Michael and his staff […]","content":"Rangers Football Club confirmed that it had parted company with Michael Beale, the Glasgow club’s men’s first-team manager. In an official statement on , they wrote: ‘The Rangers board would like to put on record their thanks to Michael and his staff for their efforts since joining the club last November’. Most Read on Euro Weekly News It continued: ‘Results this season have fallen short of what everyone connected to Rangers would expect. Therefore, the decision was reached today to terminate the contract of the manager, as well as the contracts of coaches Neil Banfield, Damian Matthew, Harry Watling and Jack Ade’. ‘The club is pleased to announce that Steven Davis will lead the interim management team. The team will consist of former Rangers player and hugely experienced coach Alex Rae, former Rangers player and current coach Steven Smith, coach Brian Gilmour, and goalkeeping coach, Colin Stewart’, the statement concluded. Rangers chairman John Bennett confirmed the search for a new manager John Bennett, the Rangers Chairman, commented: ‘I’d like to thank Michael for his dedicated work since he re-joined the club as manager last November. It is clear that results have fallen well short of the board’s, Michael’s and our supporters’ expectations’. ‘The search process for the new manager is already underway. I wish Steven Davis and the interim management team every success – they will remain in charge for as long as it takes to make the right appointment’, he explained. Rangers trail Celtic by seven points Beale was appointed as head coach at Ibrox last November following the departure of the Dutchman Giovanni van Bronckhorst. With only seven games of the new campaign played, the Glasgow giants have already lost three league matches and currently trail their city rivals Celtic by seven points. A 3-1 home defeat by Aberdeen yesterday that saw the players booed off the pitch was clearly the straw that broke the camel’s back. The 43-year-old Englishman previously worked under at both Rangers and . He also had spells coaching with , and in Brazil with São Paulo. Rangers face a trip to Cyprus on Thursday 5, to face Aris Limassol in a Europa League group match. Thank you for taking the time to read this article. Do remember to come back and check website for all your up-to-date local and international news stories and remember, you can also follow us on and .","pubDate":"2023-10-01 21:26:36","image_url":"https://euroweeklynews.com/wp-content/uploads/2023/10/ibrox-1024x608.jpg","source_id":"euroweeklynews","source_priority":251231,"country":["spain"],"category":["sports"],"language":"english"},{"article_id":"cb7650af04e1d92d51edc0455ffdbf82","title":"T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium","link":"https://www.dailymail.co.uk/sport/nfl/article-12581675/T-Minus-Travis-Chiefs-star-Kelce-arrives-hotel-New-Jersey-Taylor-Swifts-Range-Rover-just-hours-music-megastar-watches-Jets-Metlife-stadium.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Kelce was seen arriving at his hotel in the popstar's SUV - hours before his team takes on the New York Jets in a game which has sparked as much excitement among Swifties as NFL fans.","content":"T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium The Chiefs star was glimpsed entering the Envue Hotel in Weehawken on Sunday ahead of his team's clash with the New York Jets at the MetLife Stadium Kelce appeared back at the hotel and legged it into a small side entrance after presumably spending the night at the Eras megastar's apartment The Kansas City Chiefs game against the Jets at 8.20pm tonight has sparked as much excitement among Swifties as NFL fans thanks to the pairing By Laura Parnaby For Dailymail.Com Published: 19:17, 1 October 2023 | Updated: 00:09, 2 October 2023 e-mail 1.7k shares 789 View comments Travis Kelce has been spotted arriving back at his New Jersey hotel in Taylor Swift 's Range Rover, after he is believed to have spent the night at her apartment. The 33-year-old tight end was glimpsed entering the Envue Hotel in Weehawken just before 1pm on Sunday ahead of Kansas City Chiefs ' clash with the New York Jets at MetLife Stadium in East Rutherford. With kick-off due at 8.20pm, the game has sparked as much excitement among Swifties as NFL fans amid rumors the Eras megastar will be supporting Kelce's team from the sidelines. After spending Sunday in Manhattan with Swift, the Chiefs legend appeared back at the hotel and legged it into a small side entrance, where an employee was waiting with a door held open for him. Wearing a black t-shirt and cap, the 6-foot-5 athlete attempted an inconspicuous arrival after arriving in Swift's SUV. Travis Kelce was glimpsed entering the Envue Hotel in Weehawken just before 1pm on Sunday ahead of the Kansas City Chiefs MetLife Stadium clash with the New York Jets The 33-year-old tight end was spotted arriving at the hotel in Taylor Swift 's Range Rover Meanwhile, Taylor Swift was spotted indulging in a girls' night out with her pals Blake Lively and Sophie Turner in New York City on Saturday night A female fan wearing a Swiftie t-shirt was waiting outside with her pet bulldog in the hope of catching sight of the latest high-profile celebrity couple. And she's not the only fan eagerly awaiting the game. News of the popstar's likely appearance at the Sunday game at MetLife Stadium - the same sprawling venue where she performed as part of her Eras Tour in May - has sent her hefty fanbase into an online frenzy. Taylor Swift spent two whirlwind nights in Kansas City getting to know her new beau Travis Kelce earlier this week Swift sat beside Kelce's mother Donna in a suite during the Chiefs' victory over the Chicago Bears last week, and she left the arena with the player. She was last spotted indulging in a girls' night out with her pals Blake Lively and Sophie Turner in New York City on Saturday night. They dined that evening at the Soho eatery Emilio’s Ballato with Brittany Mahomes, the wife of Travis' teammate Patrick Mahomes, according to a report in Page Six . The Italian eatery is owned by the smoldering chef Emilio Vitolo Jr., who hit the headlines a few years ago because of his brief romantic involvement with Katie Holmes. While dashing off to dinner at Emilio's Ballato this Saturday night, Taylor could be spotted holding hands with Blake, who has been a close pal of hers for years. In fact, their Saturday night outing comes just hours after Taylor attended the seventh birthday party of Blake's daughter Inez, whom she shares with her husband Ryan Reynolds . Taylor famously also released a song in 2020 called Betty, named after Blake and Ryan's third daughter, who is now three years old. By the way: The 33-year-old pop superstar is rumored to be attending her new boyfriend Travis Kelce 's NFL game Sunday night across the Hudson River Looking fab: Amid the swirling public drama, Sophie grabbed a breather with her girlfriends, stepping out in New York on Saturday night in a sleekly revealing ensemble Taylor's presence at the football game sent shockwaves throughout the football and pop worlds when she was seen cheering Travis on next to his parents. Pictured with Travis' mom Donna Meanwhile, Taylor has been cultivating a blossoming friendship with Sophie amid the latter's divorce from their mutual ex Joe Jonas. Taylor, who briefly dated Joe in the summer of 2008, has written multiple songs that are rumored to be about him, including the scathing Better Than Revenge. Joe and Sophie married in 2019 and separated this month, since when they have been waging a bitter custody battle that has unfolded in the headlines. Their principle bone of contention appears to be where their two young daughters will live, with Joe arguing for the US and Sophie pulling for her native UK. Share or comment on this article: T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium e-mail 1.7k shares Add comment Comments 792 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-01 21:18:43","image_url":"https://i.dailymail.co.uk/1s/2023/10/01/19/76044191-0-image-m-18_1696184047127.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5e4387e39266b9ba312ab4ba3f6abb63","title":"Three talking points from the Premier League weekend","link":"https://guardian.ng/sport/three-talking-points-from-the-premier-league-weekend-2/","keywords":["Football","Sport","Aston Villa News","EPL News","Man City News"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Manchester City's shock 2-1 defeat to Wolves leaves the Premier League's top six separated by just three points. The post Three talking points from the Premier League weekend appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Manchester City’s shock 2-1 defeat to Wolves leaves the Premier League’s top six separated by just three points. Tottenham took full advantage of City’s first slip-up of the season to close within one point of the lead, but had luck and poor officiating on their side in a controversial 2-1 win over nine-man Liverpool. Arsenal also closed on City ahead of their showdown next weekend by cruising to a 4-0 win at Bournemouth. Aston Villa moved ahead of Brighton into fifth by thrashing the Seagulls 6-1. But it was another miserable weekend for Manchester United, who slumped to a 1-0 home defeat to Crystal Palace. AFP Sport looks at three talking points from the Premier League weekend: VAR costs luckless Liverpool Referees’ body PGMOL was forced into a swift apology following full-time at the Tottenham Hotspur Stadium after VAR failed to intervene and award a Liverpool goal in the first-half. The Reds had already lost Curtis Jones to an early red card when Luis Diaz sped in behind and smashed low and hard into the far corner of the Spurs net. Diaz was flagged offside on the field but replays quickly showed the Colombian had been played on by Cristian Romero. To compound Liverpool’s anger, Spurs soon took the lead through Son Heung-min. Jurgen Klopp’s men battled back to level with 10 men through Cody Gakpo, then survived 25 minutes with nine after Diogo Jota also saw red. But their misfortune was rounded off in the 96th minute when Joel Matip sliced Pedro Porro’s cross into the top corner of his own net to hand Tottenham victory. “I never saw a game like this with the most unfair circumstances, crazy decisions,” said Klopp. Villa target top four Brighton started the weekend in third but dreams of the Seagulls reaching the Champions League for the first time were given a huge reality check at Villa Park. Ollie Watkins became the first Villa player to score two hat-tricks in one season for 47 years. The England striker is just one of many Villa players transformed since the arrival of Unai Emery. Only Erling Haaland and Mohamed Salah have been involved in more goals and assists in the Premier League than Watkins’ 24 since Emery took charge a year ago. Emery led Villa back into Europe for the first time in 13 years last season and captain John McGinn now has his sights set on bringing Champions League football to Villa Park. “Hopefully we can try and disrupt that top four, top six. It is not going to be easy, but why not?. “Why can’t we challenge them and do what Newcastle did last season?” More Man Utd misery As the top six bunch together, United slipped down to 10th with their fourth defeat in seven league games. The Red Devils are now off to their worst ever start in the Premier League era. It was a familiar story for Erik ten Hag’s men as a series of chances were squandered at Old Trafford after Joachim Andersen’s stunning strike had given Palace the lead. “We were, many times, close and then you have to be clinical, concentrated and be sharp,” said Ten Hag. United had been on an impressive 31-game unbeaten run at home in all competitions prior to Brighton’s success at the Theatre of Dreams. But the warning signs had been there in victories over Wolves and Nottingham Forest earlier this season when United were far from convincing. Ten Hag is battling a mounting injury list but he accepted there can be “no excuses” for such a run of form that has already jeopardised their chances of even climbing back into the top four. Follow Us","pubDate":"2023-10-01 21:17:19","image_url":null,"source_id":"guardian","source_priority":11489,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"9309e684f3a37ee03ea093b3efc6acf4","title":"Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home'","link":"https://www.dailymail.co.uk/sport/nfl/article-12581981/Aaron-Rodgers-returns-MetLife-Stadium-time-suffering-Achilles-tear-New-York-Jets-debut-Welcome-home.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Jets shared a clip of the sidelined quarterback entering the stadium on the back of a golf cart clutching his crutches in his hand ahead of watching his team take on the Kansas City Chiefs.","content":"Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home' Aaron Rodgers ruptured his Achilles just four snaps into his Jets debut in Week 1 Taylor Swift is also expected to be in attendance amid romance with Travis Kelce DailyMail.com provides all the latest international sports news By Isabel Baldwin For Dailymail.Com Published: 16:30 EDT, 1 October 2023 | Updated: 17:15 EDT, 1 October 2023 e-mail 54 shares 19 View comments Aaron Rodgers made his return to MetLife Stadium Sunday three weeks after he ruptured his Achilles during his New York Jets debut. The Jets' X account shared a clip of the veteran quarterback entering the stadium on the back of a golf cart clutching his crutches in his hand ahead of watching his team take on reigning Super Bowl champion, the Kansas City Chiefs. It marks the first time the four-time MVP has returned to MetLife Stadium after suffering his potentially season-ending injury during Week 1. The sidelined signal caller, dressed casually in a white t-shirt, blue jeans and shades, appeared it be in good spirits as he offered a little wave and smile to the camera. The 39-year-old attended a team meeting at the Jets´ hotel Saturday night, according to a person with knowledge of the situation, according to The Associated Press. Welcome home, @AaronRodgers12 pic.twitter.com/TmiuHHQK8w — New York Jets (@nyjets) October 1, 2023 Aaron Rodgers made his return to MetLife Stadium Sunday three weeks after his Achilles tear Rodgers tore his Achilles minutes into his Jets debut against Buffalo Bills on September 11 Rodgers had been healing and rehabilitating at home in Malibu, California, after having surgery two-and-a-half weeks ago to repair a torn left Achilles tendon. Rodgers was injured four snaps into his debut with the Jets on September 11 against Buffalo. Rodgers hinted earlier this week during his weekly appearance on 'The Pat McAfee Show' he could make his first public appearance since the injury if he was cleared by doctors to travel. 'You never know who you´re going to see at the game,' Rodgers said with a grin. Rodgers won't be the only VIP in attendance at the game as Taylor Swift is expected to be in New Jersey to watch the Week 4 matchup amid her romance with Chiefs tight end Travis Kelce. Swift already attended Kansas City's last game , a 41-10 win against the Chicago Bears, last Sunday at Arrowhead. In that game, Kelce had seven receptions for a touchdown and 69 yards. Photos published by the New York Post on Friday of Rodgers walking on crutches and his left leg in a compression sleeve after a workout in Los Angeles further fueled speculation the quarterback could attend the game. 'I would love to have him back, but whenever it is safe for him to travel,' coach Robert Saleh said Friday. 'I know he wants to get back, but I'm not exactly sure where that is on the timeline.' It apparently was right on time for him to make it to the game Sunday night. His teammates were excited about the idea of Rodgers at some point rejoining them, even if he can't play. Taylor Swift is expected to be in attendance amid her romance with Chiefs tsar Travis Kelce Rodgers hinted earlier this week' he could make his first public appearance since the injury It initially appeared that Rodgers would miss the entire year or even consider retiring 'That would be awesome to have as good of a football mind as he is around the team for, you know, someone like me to be able to bounce my thoughts off and see what he´s thinking,' wide receiver Garrett Wilson said Friday. 'To have him around, the energy, the aura that he comes with, I mean, it´s priceless, man. So as soon as we can get him back, his presence will be felt. 'And, I look forward to that. I hope it is this weekend.' It initially appeared that Rodgers would miss the entire year and the injury even cast doubt on his future in the NFL. Rodgers, who turns 40 in December, even admitted to Pat McAfee that he had considered retiring from football in the immediate aftermath of the injury. 'It's tough, every single day is tough. I've been grinding on the rehab and looking forward to getting back out to Jersey at some point,' Rodgers said as he offered an update on his rehab last week. 'It's disappointing not to be out there.' Rodgers also joked that his rehab is the 'reverse darkness retreat' as he was in a white room without anything on the walls. According to ESPN, it is 'not out of the question' that Rodgers comes back before the Super Bowl in February, with the quarterback refusing to put a timeframe on his return. In the meantime, Rodgers has watched his new team, which he joined in a blockbuster trade from the Green Bay Packers during the offseason, from home. Rodgers said the Jets offense 'needs to grow up' amid rising frustration levels this week Running back Michael Carter was seen yelling at his position coach on the sideline on Sunday But the veteran seemingly hasn't been impressed with what he has seen on the field as he offered his teammates some stern advice earlier this week. Rodgers was making his weekly appearance on 'The Pat McAfee Show' when he said that he wasn't a fan of the 'little side conversations' that took place during the 15-10 loss to the New England Patriots and said his teammates needed to 'grow up.' 'I think we need to hold our poise a little bit better across the board,' Rodgers said. 'Just offensively, we need to not have some of those things happen on the sideline and to be a little better and to be a, just be a little better competitors. 'Too many little side conversations, and we just need to grow up a little bit on offense and lock in and do our jobs and not point fingers at each other -- and that's everybody. Don't point fingers at the coaching staff, don't point fingers at each other. Just get back to work and get the job done.' Rodgers was in large part alluding to the animated conversations seen on the sidelines involving WR Garrett Wilson and RB Michael Carter. Share or comment on this article: Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home' e-mail 54 shares Add comment Comments 20 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-01 21:15:06","image_url":"https://i.dailymail.co.uk/1s/2023/10/01/21/76047121-0-image-m-10_1696192187391.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8ebf1e2cf5030eee77709039bdba723c","title":"Navua aware of Suva’s threat","link":"https://www.fbcnews.com.fj/sports/football/navua-aware-of-suvas-threat/","keywords":["Football"],"creator":["Nitesh Raniga"],"video_url":null,"description":"This year’s Courts Inter-District Championship, according to Navua coach Saiyad Ali, will feature high-caliber matchups due to the evenly divided pools, and he knows Suva will also be at the top of their game. Since Suva is hosting and hasn’t yet won any of this year’s completed contests, Ali feels there will be a lot […]","content":"This year’s Courts Inter-District Championship, according to Navua coach Saiyad Ali, will feature high-caliber matchups due to the evenly divided pools, and he knows Suva will also be at the top of their game. Since Suva is hosting and hasn’t yet won any of this year’s completed contests, Ali feels there will be a lot of pressure on them. Regardless, the Navua coach is confident that Suva will fight hard to establish their name. Ali claims that his team has performed exceptionally well in previous competitions, but that does not mean they will sleep on the job next week. The IDC begins next week on Tuesday and will conclude next week on Sunday at the HFC Bank Stadium in Suva.","pubDate":"2023-10-01 21:09:42","image_url":"https://www.fbcnews.com.fj/wp-content/uploads/2023/10/011023TT-Navua-8am.mp3","source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"9a4806d08dbae89758dd489c331ff165","title":"Liverpool issue statement blasting “unacceptable” VAR failures as Reds “explore options”","link":"https://ionigeria.com/liverpool-issue-statement-blasting-unacceptable-var-failures-as-reds-explore-options/?utm_source=rss&utm_medium=rss&utm_campaign=liverpool-issue-statement-blasting-unacceptable-var-failures-as-reds-explore-options","keywords":["Football"],"creator":["Charles Igbinidu"],"video_url":null,"description":"Liverpool were denied a goal by a VAR decision during their Premier League defeat at Tottenham on Saturday, with a later PGMOL statement referring to “significant” error Liverpool have vowed to “explore the range of options available” after claiming sporting integrity was undermined after Luis Diaz’s goal was ruled out against Tottenham for what the … The post Liverpool issue statement blasting “unacceptable” VAR failures as Reds “explore options” appeared first on ionigeria.com.","content":"Spread the love Liverpool have vowed to “explore the range of options available” after claiming sporting integrity was undermined after Luis Diaz’s goal was ruled out against Tottenham for what the PGMOL described as “significant human error”. Diaz’s goal against Spurs was incorrectly disallowed for offside after the VAR mistakenly believed the on-field decision had been to award the goal. A Liverpool statement issued on Sunday evening read: “Liverpool Football Club acknowledges PGMOL’s admission of their failures last night. It is clear that the correct application of the laws of the game did not occur, resulting in sporting integrity being undermined. “We fully accept the pressures that match officials work under but these pressures are supposed to be alleviated, not exacerbated, by the existence and implementation of VAR. “It is therefore unsatisfactory that sufficient time was not afforded to allow the correct decision to be made and that there was no subsequent intervention. “That such failings have already been categorised as “significant human error” is also unacceptable. Any and all outcomes should be established only by the review and with full transparency. “This is vital for the reliability of future decision making as it applies to all clubs with learnings being used to make improvements to processes in order to ensure this kind of situation cannot occur again. “In the meantime, we will explore the range of options available, given the clear need for escalation and resolution.”","pubDate":"2023-10-01 20:49:03","image_url":null,"source_id":"ionigeria","source_priority":4862299,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"70ec831da8e19d15dbd901e23130cdfe","title":"Liverpool say blown VAR call 'undermined sporting integrity'","link":"https://guardian.ng/sport/liverpool-say-blown-var-call-undermined-sporting-integrity/","keywords":["Football","Sport","EPL News","Liverpool News","Luis Diaz","VAR"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Liverpool on Sunday said a botched VAR decision that cost them a goal in their 2-1 defeat at Tottenham resulted in \"sporting integrity being undermined\". The post Liverpool say blown VAR call 'undermined sporting integrity' appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Liverpool on Sunday said a botched VAR decision that cost them a goal in their 2-1 defeat at Tottenham resulted in “sporting integrity being undermined”. Referees’ body the PGMOL, admitted a “significant human error” had meant Luis Diaz’s strike, when Saturday’s game was level at 0-0, was not awarded by a VAR review after being flagged offside. PGMOL chief Howard Webb also reached out to apologise to Liverpool on Saturday evening. The match officials at fault for the mistake were stood down from duty for the rest of the Premier League weekend. “Liverpool Football Club acknowledges PGMOL’s admission of their failures last night. It is clear that the correct application of the laws of the game did not occur, resulting in sporting integrity being undermined,” read a statement. “We fully accept the pressures that match officials work under but these pressures are supposed to be alleviated, not exacerbated, by the existence and implementation of VAR. “It is therefore unsatisfactory that sufficient time was not afforded to allow the correct decision to be made and that there was no subsequent intervention.” Liverpool added that they will now explore their options “given the clear need for escalation and resolution.” Victory at the Tottenham Hotspur Stadium would have taken Jurgen Klopp’s men to the top of the Premier League table. However, they had a mountain to climb after just 26 minutes when Curtis Jones was shown a straight red card after the VAR officials did intervene to instruct an on-field review for his challenge on Yves Bissouma. The visitors should still have taken the lead when Diaz’s strike found the far corner and replays showed he had been played onside by Cristian Romero. Liverpool’s fury was compounded when Spurs took the lead moments later through Son Heung-min. The 10 men fought back to level at 1-1 before half-time through Cody Gakpo. But Liverpool were then reduced to nine men for the final 20 minutes when Diogo Jota was sent-off for a second bookable offence. The Reds still nearly held out for a remarkable point until Joel Matip’s 96th-minute own goal handed Spurs victory. “I never saw a game like this with the most unfair circumstances, crazy decisions,” said Klopp. Follow Us","pubDate":"2023-10-01 20:44:57","image_url":null,"source_id":"guardian","source_priority":11489,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"21d1c0ed7e4aa0a181a688be17cf590a","title":"\"He’s got to be a better defender\" - Pundit slams Manchester United star for error in loss to Crystal Palace","link":"https://www.sportskeeda.com/football/news-he-s-got-better-defender-pundit-slams-manchester-united-star-error-loss-crystal-palace","keywords":["Football"],"creator":["Nnanna Mba"],"video_url":null,"description":null,"content":"Football pundit Tony Cascarino has expressed serious concerns over Manchester United defender Victor Lindelof's recent performance. The club suffered their fourth Premier League defeat this season, falling 1-0 at home to Crystal Palace. Lindelof's inability to effectively mark Joachim Andersen during a crucial corner situation led to the game's decisive goal and has put his defensive skills under scrutiny. This prompted Cascarino to question his defensive capabilities during his appearance on the Weekend Sports Breakfast . Victor Lindelof has started five games for Manchester United in the current campaign. However, Cascarino has stated that his contributions have been subpar (via GOAL): Cascarino further elaborated: In the wake of mounting frustration from supporters, United's manager Erik ten Hag has openly admitted to understanding the fans' growing disillusionment. The club was handed its fourth Premier League defeat of the season in a 1-0 loss to Crystal Palace, sinking them further to a concerning 10th place. The loss, a second consecutive one at home, marks the club's most dismal season start in 34 years. Ten Hag, charged with steering the Red Devils back to their glorious past, has not had an easy journey so far. He has grappled with not only on-field issues but also off-field disturbances. His leadership and tactics were called into question once more when audible boos reverberated around Old Trafford as the final whistle sounded. Addressing the fans' exasperation, Ten Hag conceded (via 90min): With a Champions League fixture against Galatasaray looming in the midweek, followed by another match against Brentford, the pressure is escalating. A victory in these upcoming matches is not merely desirable: it's increasingly looking like a prerequisite to maintain the faith of the Manchester United fanbase. Quick Links","pubDate":"2023-10-01 20:22:05","image_url":"https://staticc.sportskeeda.com/editor/2023/10/bd2fb-16961827340532-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"06c988f3969962db5ea6abc02df95e80","title":"Deion Sanders' girlfriend Tracey Edmonds calls herself \"president of Coach Prime’s fans club\" after Colorado's loss to USC","link":"https://www.sportskeeda.com/college-football/news-deion-sanders-girlfriend-tracey-edmonds-calls-president-coach-prime-s-fans-club-colorado-s-loss-usc","keywords":["College Football"],"creator":["Farouk Yusuf"],"video_url":null,"description":null,"content":"Tracey Edmonds has named herself the president of Deion Sanders fans club, and many would say she has earned it. Following an impressive start to 2023, Colorado suffered its second defeat of the season on Saturday, losing 48-41 to USC at Folsom Field. This marks a back-to-back loss for the Buffaloes after falling to the Oregon Ducks during their Week 4 game in Eugene. However, the support for Deion Sanders from his loved ones hasn't waned a bit. Coach Prime's girlfriend, Tracy Edmonds, has been one of his biggest supporters since he took the Colorado job. She has once again come out to show public support for him following the USC loss. In an Instagram post with a picture of herself and Brittany Faye, girlfriend of Deion Sanders Jr., Tracey Edmonds penned a message of support to Deion Sanders after the loss, further declaring herself as the president of Coach Prime fans club. She captioned the post: Instagram Post Deion Sanders has maintained a long-term relationship spanning over a decade with businesswoman and TV personality Tracey Edmonds. They started dating in 2012 and have remained together since then. Deion Sanders initially crossed paths with Tracey Edmons at a party for a film she was producing. Afterward, they had a couple of meetings to discuss the idea of creating a reality television show, which eventually sparked the beginning of their romantic relationship. However, despite the long-term relationship, the couple are not legally married. It does not seem that Deion Sanders and Tracey Edmonds will one day decide to walk down the aisle. Nonetheless, this doesn't have any impact on their love life and romantic relationship. Colorado has suffered two consecutive defeats from its Pac-12 rivals. In some way, this has downplayed the Buffs' brilliant start to the 2023 college football season. However, there's a chance for redemption when they play Arizona State in Week 6. Many college football analysts believed Colorado wouldn't win the game against Oregon and USC . However, the Buffaloes have a good chance against Arizona State next week. The Sun Devils have only won one of their five games this season. Quick Links","pubDate":"2023-10-01 20:22:05","image_url":"https://staticc.sportskeeda.com/editor/2023/10/c7c7d-16961852005087-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"964df9faef4d57ba0462706982687ea5","title":"Napoli’s Social Media Executive Resigns Amid Backlash Over Mocking Osimhen","link":"https://tdpelmedia.com/osimhen-tiktok-video-napolis-social-media-executive-resigns-amid-backlash/","keywords":["Sports News","Nigeria"],"creator":["Funmilayo Salau"],"video_url":null,"description":"Napoli’s Social Media Executive Resigns Amid Osimhen Video Backlash Alessio Fortino, the social media executive of Napoli Football Club, has announced his resignation from his The post Napoli’s Social Media Executive Resigns Amid Backlash Over Mocking Osimhen appeared first on TDPel Media.","content":"Alessio Fortino, the social media executive of Napoli Football Club, has announced his resignation from his role in the midst of a public outcry over a TikTok video posted on the club’s official handle. The video in question targeted Nigerian football star Victor Osimhen, resulting in widespread criticism. The controversy erupted after Napoli shared a video on their social media platform, mocking Victor Osimhen for missing a penalty kick during their 0-0 draw against Bologna. This viral video stirred outrage both within and outside the football community. In response to the video, Osimhen removed all Napoli-related content from his Instagram account, and his agent, Roberto Calenda, issued threats of legal action. The Nigerian government also weighed in on the issue, pledging to engage with the Italian government, Napoli, and Osimhen himself regarding the incident. The video’s impact extended far beyond the world of sports, highlighting the significance of respectful and responsible social media content. Victor Osimhen has enjoyed an impressive run at Napoli since joining the club. He emerged as both the club’s and Serie A’s top scorer, netting 26 goals last season as Napoli clinched their first Scudetto in 33 years. However, the recent video controversy threatened to overshadow his accomplishments. The first video that sparked outrage depicted the 24-year-old striker appealing for a penalty, accompanied by child-like audio and the caption ‘Gimme penalty please.’ This was followed by a second video comparing Osimhen to a ‘coconut,’ which is widely regarded as a racial slur. Although Napoli insisted they meant no harm, the fallout resulted in the resignation of Alessio Fortino, the social media executive. Confirming his decision to step down on Instagram, Alessio Fortino expressed gratitude for his time with SSC Napoli, acknowledging the support he received from colleagues, partners, and fans. While Fortino departs, it’s reported that Napoli directors privately apologized to Osimhen for the club’s actions on social media, aiming to mend the strained relationship. Alessio Fortino’s resignation serves as a reminder of the importance of responsible and respectful social media engagement, especially when it involves public figures and athletes.","pubDate":"2023-10-01 22:07:50","image_url":null,"source_id":"tdpelmedia","source_priority":27640785,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"82563f91cfaf4ad4c1f9bd048f7df11e","title":"MAJOR Scottish Premiership Club Fires Its Manager After Just 10 Months","link":"https://euroweeklynews.com/2023/10/01/major-scottish-premiership-club-rangers-fire-michael-beale/","keywords":["Aston Villa","Celtic","Chelsea","Football","Liverpool","Rangers","Sport","Michael Beale","Rangers FC","Scottish Premiership","Twitter Share"],"creator":["Chris King"],"video_url":null,"description":"THE first managerial casualty of the Scottish Premiership occurred this Sunday, October 1. Rangers Football Club confirmed that it had parted company with Michael Beale, the Glasgow club’s men’s first-team manager. In an official statement on rangers.co.uk, they wrote: ‘The Rangers board would like to put on record their thanks to Michael and his staff […]","content":"Rangers Football Club confirmed that it had parted company with Michael Beale, the Glasgow club’s men’s first-team manager. In an official statement on , they wrote: ‘The Rangers board would like to put on record their thanks to Michael and his staff for their efforts since joining the club last November’. Most Read on Euro Weekly News It continued: ‘Results this season have fallen short of what everyone connected to Rangers would expect. Therefore, the decision was reached today to terminate the contract of the manager, as well as the contracts of coaches Neil Banfield, Damian Matthew, Harry Watling and Jack Ade’. ‘The club is pleased to announce that Steven Davis will lead the interim management team. The team will consist of former Rangers player and hugely experienced coach Alex Rae, former Rangers player and current coach Steven Smith, coach Brian Gilmour, and goalkeeping coach, Colin Stewart’, the statement concluded. Rangers chairman John Bennett confirmed the search for a new manager John Bennett, the Rangers Chairman, commented: ‘I’d like to thank Michael for his dedicated work since he re-joined the club as manager last November. It is clear that results have fallen well short of the board’s, Michael’s and our supporters’ expectations’. ‘The search process for the new manager is already underway. I wish Steven Davis and the interim management team every success – they will remain in charge for as long as it takes to make the right appointment’, he explained. Rangers trail Celtic by seven points Beale was appointed as head coach at Ibrox last November following the departure of the Dutchman Giovanni van Bronckhorst. With only seven games of the new campaign played, the Glasgow giants have already lost three league matches and currently trail their city rivals Celtic by seven points. A 3-1 home defeat by Aberdeen yesterday that saw the players booed off the pitch was clearly the straw that broke the camel’s back. The 43-year-old Englishman previously worked under at both Rangers and . He also had spells coaching with , and in Brazil with São Paulo. Rangers face a trip to Cyprus on Thursday 5, to face Aris Limassol in a Europa League group match. Thank you for taking the time to read this article. Do remember to come back and check website for all your up-to-date local and international news stories and remember, you can also follow us on and .","pubDate":"2023-10-01 21:26:36","image_url":"https://euroweeklynews.com/wp-content/uploads/2023/10/ibrox-1024x608.jpg","source_id":"euroweeklynews","source_priority":251231,"country":["spain"],"category":["sports"],"language":"english"},{"article_id":"cb7650af04e1d92d51edc0455ffdbf82","title":"T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium","link":"https://www.dailymail.co.uk/sport/nfl/article-12581675/T-Minus-Travis-Chiefs-star-Kelce-arrives-hotel-New-Jersey-Taylor-Swifts-Range-Rover-just-hours-music-megastar-watches-Jets-Metlife-stadium.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Kelce was seen arriving at his hotel in the popstar's SUV - hours before his team takes on the New York Jets in a game which has sparked as much excitement among Swifties as NFL fans.","content":"T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium The Chiefs star was glimpsed entering the Envue Hotel in Weehawken on Sunday ahead of his team's clash with the New York Jets at the MetLife Stadium Kelce appeared back at the hotel and legged it into a small side entrance after presumably spending the night at the Eras megastar's apartment The Kansas City Chiefs game against the Jets at 8.20pm tonight has sparked as much excitement among Swifties as NFL fans thanks to the pairing By Laura Parnaby For Dailymail.Com Published: 19:17, 1 October 2023 | Updated: 00:09, 2 October 2023 e-mail 1.7k shares 789 View comments Travis Kelce has been spotted arriving back at his New Jersey hotel in Taylor Swift 's Range Rover, after he is believed to have spent the night at her apartment. The 33-year-old tight end was glimpsed entering the Envue Hotel in Weehawken just before 1pm on Sunday ahead of Kansas City Chiefs ' clash with the New York Jets at MetLife Stadium in East Rutherford. With kick-off due at 8.20pm, the game has sparked as much excitement among Swifties as NFL fans amid rumors the Eras megastar will be supporting Kelce's team from the sidelines. After spending Sunday in Manhattan with Swift, the Chiefs legend appeared back at the hotel and legged it into a small side entrance, where an employee was waiting with a door held open for him. Wearing a black t-shirt and cap, the 6-foot-5 athlete attempted an inconspicuous arrival after arriving in Swift's SUV. Travis Kelce was glimpsed entering the Envue Hotel in Weehawken just before 1pm on Sunday ahead of the Kansas City Chiefs MetLife Stadium clash with the New York Jets The 33-year-old tight end was spotted arriving at the hotel in Taylor Swift 's Range Rover Meanwhile, Taylor Swift was spotted indulging in a girls' night out with her pals Blake Lively and Sophie Turner in New York City on Saturday night A female fan wearing a Swiftie t-shirt was waiting outside with her pet bulldog in the hope of catching sight of the latest high-profile celebrity couple. And she's not the only fan eagerly awaiting the game. News of the popstar's likely appearance at the Sunday game at MetLife Stadium - the same sprawling venue where she performed as part of her Eras Tour in May - has sent her hefty fanbase into an online frenzy. Taylor Swift spent two whirlwind nights in Kansas City getting to know her new beau Travis Kelce earlier this week Swift sat beside Kelce's mother Donna in a suite during the Chiefs' victory over the Chicago Bears last week, and she left the arena with the player. She was last spotted indulging in a girls' night out with her pals Blake Lively and Sophie Turner in New York City on Saturday night. They dined that evening at the Soho eatery Emilio’s Ballato with Brittany Mahomes, the wife of Travis' teammate Patrick Mahomes, according to a report in Page Six . The Italian eatery is owned by the smoldering chef Emilio Vitolo Jr., who hit the headlines a few years ago because of his brief romantic involvement with Katie Holmes. While dashing off to dinner at Emilio's Ballato this Saturday night, Taylor could be spotted holding hands with Blake, who has been a close pal of hers for years. In fact, their Saturday night outing comes just hours after Taylor attended the seventh birthday party of Blake's daughter Inez, whom she shares with her husband Ryan Reynolds . Taylor famously also released a song in 2020 called Betty, named after Blake and Ryan's third daughter, who is now three years old. By the way: The 33-year-old pop superstar is rumored to be attending her new boyfriend Travis Kelce 's NFL game Sunday night across the Hudson River Looking fab: Amid the swirling public drama, Sophie grabbed a breather with her girlfriends, stepping out in New York on Saturday night in a sleekly revealing ensemble Taylor's presence at the football game sent shockwaves throughout the football and pop worlds when she was seen cheering Travis on next to his parents. Pictured with Travis' mom Donna Meanwhile, Taylor has been cultivating a blossoming friendship with Sophie amid the latter's divorce from their mutual ex Joe Jonas. Taylor, who briefly dated Joe in the summer of 2008, has written multiple songs that are rumored to be about him, including the scathing Better Than Revenge. Joe and Sophie married in 2019 and separated this month, since when they have been waging a bitter custody battle that has unfolded in the headlines. Their principle bone of contention appears to be where their two young daughters will live, with Joe arguing for the US and Sophie pulling for her native UK. Share or comment on this article: T-Minus Travis! Chiefs star Kelce arrives back to his hotel in New Jersey in Taylor Swift's Range Rover - with just hours to go before music megastar watches him take on the Jets at MetLife Stadium e-mail 1.7k shares Add comment Comments 792 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-01 21:18:43","image_url":"https://i.dailymail.co.uk/1s/2023/10/01/19/76044191-0-image-m-18_1696184047127.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5e4387e39266b9ba312ab4ba3f6abb63","title":"Three talking points from the Premier League weekend","link":"https://guardian.ng/sport/three-talking-points-from-the-premier-league-weekend-2/","keywords":["Football","Sport","Aston Villa News","EPL News","Man City News"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Manchester City's shock 2-1 defeat to Wolves leaves the Premier League's top six separated by just three points. The post Three talking points from the Premier League weekend appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Manchester City’s shock 2-1 defeat to Wolves leaves the Premier League’s top six separated by just three points. Tottenham took full advantage of City’s first slip-up of the season to close within one point of the lead, but had luck and poor officiating on their side in a controversial 2-1 win over nine-man Liverpool. Arsenal also closed on City ahead of their showdown next weekend by cruising to a 4-0 win at Bournemouth. Aston Villa moved ahead of Brighton into fifth by thrashing the Seagulls 6-1. But it was another miserable weekend for Manchester United, who slumped to a 1-0 home defeat to Crystal Palace. AFP Sport looks at three talking points from the Premier League weekend: VAR costs luckless Liverpool Referees’ body PGMOL was forced into a swift apology following full-time at the Tottenham Hotspur Stadium after VAR failed to intervene and award a Liverpool goal in the first-half. The Reds had already lost Curtis Jones to an early red card when Luis Diaz sped in behind and smashed low and hard into the far corner of the Spurs net. Diaz was flagged offside on the field but replays quickly showed the Colombian had been played on by Cristian Romero. To compound Liverpool’s anger, Spurs soon took the lead through Son Heung-min. Jurgen Klopp’s men battled back to level with 10 men through Cody Gakpo, then survived 25 minutes with nine after Diogo Jota also saw red. But their misfortune was rounded off in the 96th minute when Joel Matip sliced Pedro Porro’s cross into the top corner of his own net to hand Tottenham victory. “I never saw a game like this with the most unfair circumstances, crazy decisions,” said Klopp. Villa target top four Brighton started the weekend in third but dreams of the Seagulls reaching the Champions League for the first time were given a huge reality check at Villa Park. Ollie Watkins became the first Villa player to score two hat-tricks in one season for 47 years. The England striker is just one of many Villa players transformed since the arrival of Unai Emery. Only Erling Haaland and Mohamed Salah have been involved in more goals and assists in the Premier League than Watkins’ 24 since Emery took charge a year ago. Emery led Villa back into Europe for the first time in 13 years last season and captain John McGinn now has his sights set on bringing Champions League football to Villa Park. “Hopefully we can try and disrupt that top four, top six. It is not going to be easy, but why not?. “Why can’t we challenge them and do what Newcastle did last season?” More Man Utd misery As the top six bunch together, United slipped down to 10th with their fourth defeat in seven league games. The Red Devils are now off to their worst ever start in the Premier League era. It was a familiar story for Erik ten Hag’s men as a series of chances were squandered at Old Trafford after Joachim Andersen’s stunning strike had given Palace the lead. “We were, many times, close and then you have to be clinical, concentrated and be sharp,” said Ten Hag. United had been on an impressive 31-game unbeaten run at home in all competitions prior to Brighton’s success at the Theatre of Dreams. But the warning signs had been there in victories over Wolves and Nottingham Forest earlier this season when United were far from convincing. Ten Hag is battling a mounting injury list but he accepted there can be “no excuses” for such a run of form that has already jeopardised their chances of even climbing back into the top four. Follow Us","pubDate":"2023-10-01 21:17:19","image_url":null,"source_id":"guardian","source_priority":11489,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"9309e684f3a37ee03ea093b3efc6acf4","title":"Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home'","link":"https://www.dailymail.co.uk/sport/nfl/article-12581981/Aaron-Rodgers-returns-MetLife-Stadium-time-suffering-Achilles-tear-New-York-Jets-debut-Welcome-home.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Jets shared a clip of the sidelined quarterback entering the stadium on the back of a golf cart clutching his crutches in his hand ahead of watching his team take on the Kansas City Chiefs.","content":"Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home' Aaron Rodgers ruptured his Achilles just four snaps into his Jets debut in Week 1 Taylor Swift is also expected to be in attendance amid romance with Travis Kelce DailyMail.com provides all the latest international sports news By Isabel Baldwin For Dailymail.Com Published: 16:30 EDT, 1 October 2023 | Updated: 17:15 EDT, 1 October 2023 e-mail 54 shares 19 View comments Aaron Rodgers made his return to MetLife Stadium Sunday three weeks after he ruptured his Achilles during his New York Jets debut. The Jets' X account shared a clip of the veteran quarterback entering the stadium on the back of a golf cart clutching his crutches in his hand ahead of watching his team take on reigning Super Bowl champion, the Kansas City Chiefs. It marks the first time the four-time MVP has returned to MetLife Stadium after suffering his potentially season-ending injury during Week 1. The sidelined signal caller, dressed casually in a white t-shirt, blue jeans and shades, appeared it be in good spirits as he offered a little wave and smile to the camera. The 39-year-old attended a team meeting at the Jets´ hotel Saturday night, according to a person with knowledge of the situation, according to The Associated Press. Welcome home, @AaronRodgers12 pic.twitter.com/TmiuHHQK8w — New York Jets (@nyjets) October 1, 2023 Aaron Rodgers made his return to MetLife Stadium Sunday three weeks after his Achilles tear Rodgers tore his Achilles minutes into his Jets debut against Buffalo Bills on September 11 Rodgers had been healing and rehabilitating at home in Malibu, California, after having surgery two-and-a-half weeks ago to repair a torn left Achilles tendon. Rodgers was injured four snaps into his debut with the Jets on September 11 against Buffalo. Rodgers hinted earlier this week during his weekly appearance on 'The Pat McAfee Show' he could make his first public appearance since the injury if he was cleared by doctors to travel. 'You never know who you´re going to see at the game,' Rodgers said with a grin. Rodgers won't be the only VIP in attendance at the game as Taylor Swift is expected to be in New Jersey to watch the Week 4 matchup amid her romance with Chiefs tight end Travis Kelce. Swift already attended Kansas City's last game , a 41-10 win against the Chicago Bears, last Sunday at Arrowhead. In that game, Kelce had seven receptions for a touchdown and 69 yards. Photos published by the New York Post on Friday of Rodgers walking on crutches and his left leg in a compression sleeve after a workout in Los Angeles further fueled speculation the quarterback could attend the game. 'I would love to have him back, but whenever it is safe for him to travel,' coach Robert Saleh said Friday. 'I know he wants to get back, but I'm not exactly sure where that is on the timeline.' It apparently was right on time for him to make it to the game Sunday night. His teammates were excited about the idea of Rodgers at some point rejoining them, even if he can't play. Taylor Swift is expected to be in attendance amid her romance with Chiefs tsar Travis Kelce Rodgers hinted earlier this week' he could make his first public appearance since the injury It initially appeared that Rodgers would miss the entire year or even consider retiring 'That would be awesome to have as good of a football mind as he is around the team for, you know, someone like me to be able to bounce my thoughts off and see what he´s thinking,' wide receiver Garrett Wilson said Friday. 'To have him around, the energy, the aura that he comes with, I mean, it´s priceless, man. So as soon as we can get him back, his presence will be felt. 'And, I look forward to that. I hope it is this weekend.' It initially appeared that Rodgers would miss the entire year and the injury even cast doubt on his future in the NFL. Rodgers, who turns 40 in December, even admitted to Pat McAfee that he had considered retiring from football in the immediate aftermath of the injury. 'It's tough, every single day is tough. I've been grinding on the rehab and looking forward to getting back out to Jersey at some point,' Rodgers said as he offered an update on his rehab last week. 'It's disappointing not to be out there.' Rodgers also joked that his rehab is the 'reverse darkness retreat' as he was in a white room without anything on the walls. According to ESPN, it is 'not out of the question' that Rodgers comes back before the Super Bowl in February, with the quarterback refusing to put a timeframe on his return. In the meantime, Rodgers has watched his new team, which he joined in a blockbuster trade from the Green Bay Packers during the offseason, from home. Rodgers said the Jets offense 'needs to grow up' amid rising frustration levels this week Running back Michael Carter was seen yelling at his position coach on the sideline on Sunday But the veteran seemingly hasn't been impressed with what he has seen on the field as he offered his teammates some stern advice earlier this week. Rodgers was making his weekly appearance on 'The Pat McAfee Show' when he said that he wasn't a fan of the 'little side conversations' that took place during the 15-10 loss to the New England Patriots and said his teammates needed to 'grow up.' 'I think we need to hold our poise a little bit better across the board,' Rodgers said. 'Just offensively, we need to not have some of those things happen on the sideline and to be a little better and to be a, just be a little better competitors. 'Too many little side conversations, and we just need to grow up a little bit on offense and lock in and do our jobs and not point fingers at each other -- and that's everybody. Don't point fingers at the coaching staff, don't point fingers at each other. Just get back to work and get the job done.' Rodgers was in large part alluding to the animated conversations seen on the sidelines involving WR Garrett Wilson and RB Michael Carter. Share or comment on this article: Aaron Rodgers returns to MetLife Stadium for the first time since suffering an Achilles tear during his New York Jets debut: 'Welcome home' e-mail 54 shares Add comment Comments 20 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-01 21:15:06","image_url":"https://i.dailymail.co.uk/1s/2023/10/01/21/76047121-0-image-m-10_1696192187391.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"8ebf1e2cf5030eee77709039bdba723c","title":"Navua aware of Suva’s threat","link":"https://www.fbcnews.com.fj/sports/football/navua-aware-of-suvas-threat/","keywords":["Football"],"creator":["Nitesh Raniga"],"video_url":null,"description":"This year’s Courts Inter-District Championship, according to Navua coach Saiyad Ali, will feature high-caliber matchups due to the evenly divided pools, and he knows Suva will also be at the top of their game. Since Suva is hosting and hasn’t yet won any of this year’s completed contests, Ali feels there will be a lot […]","content":"This year’s Courts Inter-District Championship, according to Navua coach Saiyad Ali, will feature high-caliber matchups due to the evenly divided pools, and he knows Suva will also be at the top of their game. Since Suva is hosting and hasn’t yet won any of this year’s completed contests, Ali feels there will be a lot of pressure on them. Regardless, the Navua coach is confident that Suva will fight hard to establish their name. Ali claims that his team has performed exceptionally well in previous competitions, but that does not mean they will sleep on the job next week. The IDC begins next week on Tuesday and will conclude next week on Sunday at the HFC Bank Stadium in Suva.","pubDate":"2023-10-01 21:09:42","image_url":"https://www.fbcnews.com.fj/wp-content/uploads/2023/10/011023TT-Navua-8am.mp3","source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"9a4806d08dbae89758dd489c331ff165","title":"Liverpool issue statement blasting “unacceptable” VAR failures as Reds “explore options”","link":"https://ionigeria.com/liverpool-issue-statement-blasting-unacceptable-var-failures-as-reds-explore-options/?utm_source=rss&utm_medium=rss&utm_campaign=liverpool-issue-statement-blasting-unacceptable-var-failures-as-reds-explore-options","keywords":["Football"],"creator":["Charles Igbinidu"],"video_url":null,"description":"Liverpool were denied a goal by a VAR decision during their Premier League defeat at Tottenham on Saturday, with a later PGMOL statement referring to “significant” error Liverpool have vowed to “explore the range of options available” after claiming sporting integrity was undermined after Luis Diaz’s goal was ruled out against Tottenham for what the … The post Liverpool issue statement blasting “unacceptable” VAR failures as Reds “explore options” appeared first on ionigeria.com.","content":"Spread the love Liverpool have vowed to “explore the range of options available” after claiming sporting integrity was undermined after Luis Diaz’s goal was ruled out against Tottenham for what the PGMOL described as “significant human error”. Diaz’s goal against Spurs was incorrectly disallowed for offside after the VAR mistakenly believed the on-field decision had been to award the goal. A Liverpool statement issued on Sunday evening read: “Liverpool Football Club acknowledges PGMOL’s admission of their failures last night. It is clear that the correct application of the laws of the game did not occur, resulting in sporting integrity being undermined. “We fully accept the pressures that match officials work under but these pressures are supposed to be alleviated, not exacerbated, by the existence and implementation of VAR. “It is therefore unsatisfactory that sufficient time was not afforded to allow the correct decision to be made and that there was no subsequent intervention. “That such failings have already been categorised as “significant human error” is also unacceptable. Any and all outcomes should be established only by the review and with full transparency. “This is vital for the reliability of future decision making as it applies to all clubs with learnings being used to make improvements to processes in order to ensure this kind of situation cannot occur again. “In the meantime, we will explore the range of options available, given the clear need for escalation and resolution.”","pubDate":"2023-10-01 20:49:03","image_url":null,"source_id":"ionigeria","source_priority":4862299,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"70ec831da8e19d15dbd901e23130cdfe","title":"Liverpool say blown VAR call 'undermined sporting integrity'","link":"https://guardian.ng/sport/liverpool-say-blown-var-call-undermined-sporting-integrity/","keywords":["Football","Sport","EPL News","Liverpool News","Luis Diaz","VAR"],"creator":["Guardian Nigeria"],"video_url":null,"description":"Liverpool on Sunday said a botched VAR decision that cost them a goal in their 2-1 defeat at Tottenham resulted in \"sporting integrity being undermined\". The post Liverpool say blown VAR call 'undermined sporting integrity' appeared first on The Guardian Nigeria News - Nigeria and World News.","content":"Liverpool on Sunday said a botched VAR decision that cost them a goal in their 2-1 defeat at Tottenham resulted in “sporting integrity being undermined”. Referees’ body the PGMOL, admitted a “significant human error” had meant Luis Diaz’s strike, when Saturday’s game was level at 0-0, was not awarded by a VAR review after being flagged offside. PGMOL chief Howard Webb also reached out to apologise to Liverpool on Saturday evening. The match officials at fault for the mistake were stood down from duty for the rest of the Premier League weekend. “Liverpool Football Club acknowledges PGMOL’s admission of their failures last night. It is clear that the correct application of the laws of the game did not occur, resulting in sporting integrity being undermined,” read a statement. “We fully accept the pressures that match officials work under but these pressures are supposed to be alleviated, not exacerbated, by the existence and implementation of VAR. “It is therefore unsatisfactory that sufficient time was not afforded to allow the correct decision to be made and that there was no subsequent intervention.” Liverpool added that they will now explore their options “given the clear need for escalation and resolution.” Victory at the Tottenham Hotspur Stadium would have taken Jurgen Klopp’s men to the top of the Premier League table. However, they had a mountain to climb after just 26 minutes when Curtis Jones was shown a straight red card after the VAR officials did intervene to instruct an on-field review for his challenge on Yves Bissouma. The visitors should still have taken the lead when Diaz’s strike found the far corner and replays showed he had been played onside by Cristian Romero. Liverpool’s fury was compounded when Spurs took the lead moments later through Son Heung-min. The 10 men fought back to level at 1-1 before half-time through Cody Gakpo. But Liverpool were then reduced to nine men for the final 20 minutes when Diogo Jota was sent-off for a second bookable offence. The Reds still nearly held out for a remarkable point until Joel Matip’s 96th-minute own goal handed Spurs victory. “I never saw a game like this with the most unfair circumstances, crazy decisions,” said Klopp. Follow Us","pubDate":"2023-10-01 20:44:57","image_url":null,"source_id":"guardian","source_priority":11489,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"21d1c0ed7e4aa0a181a688be17cf590a","title":"\"He’s got to be a better defender\" - Pundit slams Manchester United star for error in loss to Crystal Palace","link":"https://www.sportskeeda.com/football/news-he-s-got-better-defender-pundit-slams-manchester-united-star-error-loss-crystal-palace","keywords":["Football"],"creator":["Nnanna Mba"],"video_url":null,"description":null,"content":"Football pundit Tony Cascarino has expressed serious concerns over Manchester United defender Victor Lindelof's recent performance. The club suffered their fourth Premier League defeat this season, falling 1-0 at home to Crystal Palace. Lindelof's inability to effectively mark Joachim Andersen during a crucial corner situation led to the game's decisive goal and has put his defensive skills under scrutiny. This prompted Cascarino to question his defensive capabilities during his appearance on the Weekend Sports Breakfast . Victor Lindelof has started five games for Manchester United in the current campaign. However, Cascarino has stated that his contributions have been subpar (via GOAL): Cascarino further elaborated: In the wake of mounting frustration from supporters, United's manager Erik ten Hag has openly admitted to understanding the fans' growing disillusionment. The club was handed its fourth Premier League defeat of the season in a 1-0 loss to Crystal Palace, sinking them further to a concerning 10th place. The loss, a second consecutive one at home, marks the club's most dismal season start in 34 years. Ten Hag, charged with steering the Red Devils back to their glorious past, has not had an easy journey so far. He has grappled with not only on-field issues but also off-field disturbances. His leadership and tactics were called into question once more when audible boos reverberated around Old Trafford as the final whistle sounded. Addressing the fans' exasperation, Ten Hag conceded (via 90min): With a Champions League fixture against Galatasaray looming in the midweek, followed by another match against Brentford, the pressure is escalating. A victory in these upcoming matches is not merely desirable: it's increasingly looking like a prerequisite to maintain the faith of the Manchester United fanbase. Quick Links","pubDate":"2023-10-01 20:22:05","image_url":"https://staticc.sportskeeda.com/editor/2023/10/bd2fb-16961827340532-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"06c988f3969962db5ea6abc02df95e80","title":"Deion Sanders' girlfriend Tracey Edmonds calls herself \"president of Coach Prime’s fans club\" after Colorado's loss to USC","link":"https://www.sportskeeda.com/college-football/news-deion-sanders-girlfriend-tracey-edmonds-calls-president-coach-prime-s-fans-club-colorado-s-loss-usc","keywords":["College Football"],"creator":["Farouk Yusuf"],"video_url":null,"description":null,"content":"Tracey Edmonds has named herself the president of Deion Sanders fans club, and many would say she has earned it. Following an impressive start to 2023, Colorado suffered its second defeat of the season on Saturday, losing 48-41 to USC at Folsom Field. This marks a back-to-back loss for the Buffaloes after falling to the Oregon Ducks during their Week 4 game in Eugene. However, the support for Deion Sanders from his loved ones hasn't waned a bit. Coach Prime's girlfriend, Tracy Edmonds, has been one of his biggest supporters since he took the Colorado job. She has once again come out to show public support for him following the USC loss. In an Instagram post with a picture of herself and Brittany Faye, girlfriend of Deion Sanders Jr., Tracey Edmonds penned a message of support to Deion Sanders after the loss, further declaring herself as the president of Coach Prime fans club. She captioned the post: Instagram Post Deion Sanders has maintained a long-term relationship spanning over a decade with businesswoman and TV personality Tracey Edmonds. They started dating in 2012 and have remained together since then. Deion Sanders initially crossed paths with Tracey Edmons at a party for a film she was producing. Afterward, they had a couple of meetings to discuss the idea of creating a reality television show, which eventually sparked the beginning of their romantic relationship. However, despite the long-term relationship, the couple are not legally married. It does not seem that Deion Sanders and Tracey Edmonds will one day decide to walk down the aisle. Nonetheless, this doesn't have any impact on their love life and romantic relationship. Colorado has suffered two consecutive defeats from its Pac-12 rivals. In some way, this has downplayed the Buffs' brilliant start to the 2023 college football season. However, there's a chance for redemption when they play Arizona State in Week 6. Many college football analysts believed Colorado wouldn't win the game against Oregon and USC . However, the Buffaloes have a good chance against Arizona State next week. The Sun Devils have only won one of their five games this season. Quick Links","pubDate":"2023-10-01 20:22:05","image_url":"https://staticc.sportskeeda.com/editor/2023/10/c7c7d-16961852005087-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"}]}