{"newsArray":[{"article_id":"81e11c7a5932e79e27122f4b6ed9d275","title":"Η επιβάρυνση ελέω Ευρώπης και το αποτέλεσμα αυτής!","link":"https://www.gazzetta.gr/football/superleague/2286101/i-epibarynsi-eleo-eyropis-kai-apotelesma-aytis","keywords":["Ποδόσφαιρο","Superleague","Γιώργος Τσακίρης","ΑΕΚ","Ματίας Αλμέιδα","Γενς Γιόνσον","Τραυματισμός"],"creator":null,"video_url":null,"description":"Η κουβέντα για τις απουσίες της ΑΕΚ, οι περισσότερες από οποιαδήποτε άλλη ομάδα, είναι απόλυτα δικαιολογημένη και υπάρχει απόλυτα λογική αιτία να της συμβαίνει αυτό..","content":"Είναι γεγονός (και δικαιολογημένα συμβαίνει) πως έχει προκύψει μεγάλη και μπόλικη κουβέντα σχετικά με το πρόβλημα το οποίο ταλαιπωρεί την ΑΕΚ και δυσκολεύει το έργο της σε αγωνιστικό επίπεδο και αφορά τα ζητήματα τραυματισμών και απουσιών σε σημαντικά ματς, είτε για την Ευρώπη είτε για την Ελλάδα. Ειδικά στο τέλος των υποχρεώσεων στον απαιτητικό όμιλο που συμμετείχαν οι νταμπλούχοι για το Europa League , αποδείχτηκαν καθοριστικές οι απουσίες σημαντικών ποδοσφαιριστών ( Πινέδα , Αραούχο , Γιόνσον , Στάνκοβιτς , Πόνσε ), οι οποίοι εφόσον ήταν διαθέσιμοι -έστω στο τελευταίο ματς στο Άμστερνταμ με αντίπαλο τον Άγιαξ , είναι πολύ πιθανό να ήταν εντελώς διαφορετική η τύχη της και να υπήρχε ευρωπαϊκή συνέχεια, έστω μέσω της 3ης θέσης στον όμιλο του θανάτου! Ωστόσο για τον Δικέφαλο δεν προέκυψαν αγωνιστικά άσχημα αποτελέσματα μόνο στην Ευρώπη ελέω απουσιών. Η επιβάρυνση που προέκυψε από τα ευρωπαϊκά παιχνίδια σε μια ομάδα που αντικειμενικά ήταν (λόγω απουσίας από την κανονικότητά της) άπειρη σε επίπεδο ανταπόκρισης σε τρεις διοργανώσεις, προκάλεσε γκέλες και στις εγχώριες διοργανώσεις και πιο σωστά στο πρωτάθλημα. Σε οποιοδήποτε ματς στράβωσε για την ΑΕΚ υπήρχαν τεράστιας σημασίας και πολλές σε αριθμό απουσίες. Αποκορύφωμα ήταν το πιο πρόσφατο με αντίπαλο τον Παναιτωλικό όπου η Ένωση υποχρεώθηκε να παίξει στο Αγρίνιο δίχως επτά σημαντικούς ποδοσφαιριστές της... Απουσίες που δεν αφορούν αποκλειστικά την ενδεκάδα της αλλά και τη διαχείριση του εκάστοτε αγώνα. Για παράδειγμα στην γκέλα με τον Παναιτωλικό από τον πάγκο δεν υπήρχαν πολλοί πλην των Τσούμπερ και Γιόνσον για να 'ρθουν στον αγωνιστικό χώρο και να αλλάξουν πράγματα. Έλειπαν συνολικά επτά ποδοσφαιριστές! Δεν είναι δα και εύκολο για καμία ομάδα να ανταποκριθεί με τόσες απουσίες και προφανώς αυτό είναι κάτι που το αντιλαμβάνονται στην ΑΕΚ , ο ίδιος ο Ματίας Αλμέιδα και οι συνεργάτες του, αλλά και όλοι στο club. Γι' αυτό και περιμένουν πως και πως το 2024 όπου δεδομένα δεν γίνεται να έχει στην πορεία του έως την ολοκλήρωση της σεζόν τα ίδια προβλήματα απουσιών. Γιατί όμως συνέβη αυτό; Μα φυσικά και απλά από την επιβάρυνση της ομάδας από επιπλέον παιχνίδια στην Ευρώπη και σε αυτό το επίπεδο, με ομάδες που πρέπει να βγάλεις το 100% για να ανταποκριθείς, να ξεπεράσεις τα στάνταρ σου σε επίπεδα έντασης, φυσικής κατάστασης και δύναμης! Αυτό δεν γίνεται να το πετύχεις αναίμακτα. Η ΑΕΚ έως τώρα συγκριτικά με την περσινή σεζόν έχει δώσει ήδη τουλάχιστον δέκα περισσότερα ματς με ταξίδια και ότι αυτό συνεπάγεται. Δεδομένου ότι δεν άλλαξε τη δουλειά που έκανε και στον βαθμό έντασης που το έκανε και πέρυσι ο Αλμέιδα και το team του, αναμενόμενα και απόλυτα δικαιολογημένα, έχουμε αυτό το μεγάλο ζήτημα των τραυματιών! Είναι αν μη τι άλλο απόλυτη λογική η αιτία. Οι νταμπλούχοι έπαιξαν διπλές αναμετρήσεις με υψηλή απαίτηση αφού αντιμετώπισαν τη Ντινάμο Ζάγκρεμπ , την Αντβέρπ , όλα διπλές αναμετρήσεις και μάλιστα με τους Κροάτες ελέω δολοφονίας Μιχάλη σε πολύ σύντομο χρονικό διάστημα και ενώ ενδιάμεσα ξεκίνησε και το πρωτάθλημα. Ακολούθησαν τα ματς με Μπράιτον , Μαρσέιγ και Άγιαξ μέσα και έξω επίσης με αποτέλεσμα αυτή η επιβάρυνση και τα επιπλέον ματς συγκριτικά με πέρυσι να φέρουν τα ζητήματα τραυματισμών σε πρώτο πλάνο, διότι και πέρυσι είχε η ΑΕΚ , απλά λόγω του ματς ανά βδομάδα, ήταν λογικά και λιγότερες οι απουσίες ανά παιχνίδι και πιο γρήγορη η επιστροφή των κιτρινόμαυρων ποδοσφαιριστών, αλλά και όλων των ομάδων που δεν είχαν ευρωπαϊκές αναμετρήσεις. Τώρα σε ότι αφορά στην κουβέντα αν έπρεπε να ρίξει την ένταση και το ρυθμό αυτό το διάστημα ο Ματίας Αλμέιδα στις προπονήσεις, προφανώς και κάθε άποψη είναι αποδεκτή, αλλά αυτή που 'χει σημασία είναι στο τέλος εκείνη του Αργεντινού τεχνικού! Επίσης θα κριθεί στο τέλος της χρονιάς και όχι τώρα... Διότι στο επιχείρημα «μπορεί να μην είχαν βγει τόσοι πολλοί μαζί εκτός», υπάρχει και ο αντίλογος που αναφέρει «αλλά δεν θα μπορούσαμε να ανταποκριθούμε με μικρότερη και λιγότερη ένταση στα ματς αυτά και στη τεράστια απαίτηση απέναντι σε ομάδα Premier League και όχι μόνο». Το μόνο σίγουρο είναι ότι πρόκειται για κάτι υποθετικό στο οποίο ουσιαστικά απάντηση δεν υπάρχει που να δικαιώνει, ή να ακυρώνει την κάθε άποψη...","pubDate":"2023-12-19 13:30:00","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"c4b2a39a469f504c8257c408d98ee4f2","title":"Νότιγχαμ Φόρεστ: «Τελειώνει» ο Κούπερ και αναλαμβάνει ο Εσπίριτο Σάντο","link":"https://www.gazzetta.gr/football/premier-league/2286126/notigham-forest-teleionei-o-koyper-kai-analambanei-o-espirito-santo","keywords":["Ποδόσφαιρο","Premier League","Newsroom","Νότιγχαμ Φόρεστ"],"creator":null,"video_url":null,"description":"Μια ανάσα από τον Εσπίριτο Σάντο φέρεται να βρίσκεται η Νότιγχαμ Φόρεστ με τον Στιβ Κούπερ να αναμένεται να αποτελέσει παρελθόν μέσα στις επόμενες ώρες.","content":"Ραγδαίες οι εξελίξεις στο στρατόπεδο της Νότιγχαμ Φόρεστ. Όπως δείχνουν τα τελευταία γεγονότα, ο Νούνο Εσπίριτο Σάντο αναμένεται να αναλάβει την τεχνική ηγεσία των reds! Σύμφωνα με τον Φαμπρίτσιο Ρομάνο, ο Πορτογάλος τεχνικός τα έχει ήδη βρει σε όλα με τους ανθρώπους του αγγλικού συλλόγου και μάλιστα μέσα στις επόμενες ώρες θα βρεθεί στην Αγγλία προκειμένου να υπογράψει το συμβόλαιο του με την ομάδα. Ο Στιβ Κούπερ από την άλλη αναμένεται να αποτελέσει παρελθόν μέσα στις επόμενες ώρες και εφόσον δεν προκύψει κάποια μεγάλη ανατροπή, τότε ο Πορτογάλος θα είναι ο νέος προπονητής της Φόρεστ. O Πορτογάλος κόουτς αποχώρησε το Νοέμβριο από την Αλ Ιτιχάντ και φαίνεται πως βρίσκεται μια ανάσα από την επιστροφή του στην Premier League. Στο παρελθόν έχει κοουτσάρει Ρίο Άβε, Βαλένθια, Πόρτο, Γουβς , Τότεναμ , ενώ ήταν προπονητής τερματοφυλάκων σε Μάλαγα και Παναθηναϊκό .","pubDate":"2023-12-19 13:26:54","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"83999f5af9a7896b4c9d1308423527c9","title":"Panenkas and playing the panto villain: Ross Millen’s key role at Raith Rovers","link":"https://www.thecourier.co.uk/fp/sport/football/4844957/panenkas-and-playing-the-panto-villain-ross-millens-key-role-at-raith-rovers/","keywords":["Football","Raith Rovers FC","Ross Millen","Scottish Championship"],"creator":["Craig Cairns"],"video_url":null,"description":"The 29-year-old has become a popular figure amongst supporters.","content":"The sight of Ross Millen celebrating a last-ditch tackle as if it were a goal was the latest exploit to endear the Raith Rovers support to their colourful full-back. With the team 1-0 up in Saturday’s pivotal Scottish Championship clash at Tannadice deep into the second half, it felt a matter of time until Dundee United had ‘their chance’. It appeared to have fallen to , but as he was about to pull the trigger the out-stretched right leg of Millen hooked the ball to safety. Buoyed by the backing of a relieved and rapturous support, he stood up to punch the air in celebration. Millen explained to Courier Sport why relief also informed his response to the tackle: “Nae wonder because it was me that lost the ball at the start of it! “I played it short and Sam [Stanton] got it nicked off him. I was like ‘Aw naw…’. I was just glad to get back and help the boys out.” Millen was part of a trio of signings brought to the club by Ian Murray soon after the Raith boos took charge in the summer of 2022. Along with Scott Brown and , the 29-year-old right-back has gone on to establish himself as a key member of the starting XI. And like most in the squad, he has gone on to excel so far this season – his character standing out just as much as his on-field ability. That was encapsulated no better than when he capped off the most sensational comeback on this run – in – with an injury-time Panenka at Hampden. That was – at least the third club he has scored one for. He was booked as he searched for pieces of kit he’d torn off in the understandably wild celebrations. ‘Over-celebrating’ has been a slight issue and is part of why Millen sat out the win in Inverness through suspension. He has since picked up a yellow card after carrying Lewis Vaughan on his shoulder after the substitute . Again, it was a completely understandably wild celebration to befit another madcap ending to a game for this Rovers side. ‘Panto villain’ is a seasonably suitable term to describe the approach Millen sometimes takes to the game. After Stanton’s winner at East End Park, he put his fingers in his ears in front of the Dunfermline fans – a reference to Matty Todd after he netted the winning penalty on the opening day of the season. It’s all in good humour, though. Millen still and is greeted warmly by staff when he returns to East End Park. But right now it’s all about enjoying the moment at Raith, after they took a five-point lead at the top of the Championship. “It’s ,” adds Millen. “That breeds confidence and more wins. “But I know the other side, when you’re losing games and you can’t get that goal at times. You just really need to enjoy it while it comes. “It gives you confidence, but you’re only in December. We’ve loads of games to go. “There are going to be ups and downs – there will be downs to come at some point. It’s just how you deal with them.”","pubDate":"2023-12-19 13:26:18","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/12/2023/12/Untitled-design-54-pxcni2r6-150x150.jpg","source_id":"thecourier","source_priority":241228,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"90e1189858d6b0fef994a9a1c0fb4671","title":"Liverpool legends unite for Christmas meal with some unrecognisable from playing days","link":"https://www.mirror.co.uk/sport/football/news/liverpool-legends-christmas-fowler-rush-31708039","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Mark Jones)"],"video_url":null,"description":"Reds legends gathered for a Christmas meal as they toasted their successes of the past, with Robbie Fowler sharing a team photo of the 13 former players","content":"Thirteen Liverpool legends linked up to celebrate Christmas as the Reds greats reminisced about their playing days - but how many can you remember? Liverpool icon Robbie Fowler shared a snap of the players enjoying Christmas dinner together on Monday, and while the man known affectionately as 'God' by Reds supporters was side by side with his 1990s team-mate Steve McManaman, you might need to be a fan of a certain age to recognise most of the other players in the Liverpool line-up. Players from the club's glory days of the 1970s and 80s make up most of the snap, with Fowler posting the caption: \"In good company. Absolute legends and top fellas\" with his picture. Roy Keane told to \"get a life\" as Liverpool icon wades in on Virgil van Dijk row Liverpool hatch clear January transfer plan after private talks between Jurgen Klopp and FSG Starting top left, it is former Reds midfielder Sammy Lee who is stood next to Phil Thompson, with both men serving on the coaching staff of the club after their successful playing days ended. Thompson, who also served as Liverpool's interim manager when Gerard Houllier was ill between 2001 and 2002, also enjoyed a successful career as a Sky Sports pundit before being axed in 2020 . Liverpool legends enjoyed a Christmas meal together on Monday ( Image: @Robbie9Fowler/Twitter) Next, moving clockwise along the top row, it is Liverpool's all-time appearance maker Ian Callaghan, now 81, who played a record 857 times for the Reds between 1960 and 1978. He is followed by Alan Kennedy, who scored the winning goal in 1981 European Cup final and the winning penalty in the shootout in the 1984 final. Then after Fowler and McManaman come 1980s legends John Aldridge and Steve McMahon. Moving to the bottom row, and heading left to right again, it is David Fairclough who is seated furthest left. The forward was known as 'Super Sub' during his career for his ability to score goals off the bench, and was a key part of the squad which won the European Cup in 1977. Phil Thompson (back row, second left), David Fairclough (middle row, third left), and Ian Callaghan (front row, second left) in a 1977 team photo ( Image: Bob Thomas Sports Photography via Getty Images) Liverpool's all-time top scorer Ian Rush comes next, and is seated next to Reds icon John Barnes, who was one of the best players in the world in the late 1980s and a star of the Reds side that dominated English football at the time. Next to Barnes is Howard Gayle, Liverpool's first ever black player who made a famous appearance in a European Cup semi-final against Bayern Munich in 1981 , and next to Gayle is David Hodgson, the Gateshead-born forward who won two league titles and the European Cup with the Reds between 1982 and 1984. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here The Liverpool legends line-up in full: Standing L-R - Sammy Lee, Phil Thompson, Ian Callaghan, Alan Kennedy, Robbie Fowler, Steve McManaman, John Aldridge, Steve McMahon. Sitting L-R - David Fairclough, Ian Rush, John Barnes, Howard Gayle, David Hodgson. Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-12-19 13:21:28","image_url":"https://i2-prod.mirror.co.uk/incoming/article31708255.ece/ALTERNATES/s615/0_Screenshot-2023-12-19-at-085448.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d68b49cef99d05988559c7cb7aa27f96","title":"Inside Anthony Joshua’s amazing car collection, from top-of-the range Range Rover to riding in a £600k Rolls-Royce limo","link":"https://www.thesun.ie/sport/11879558/anthony-joshua-car-collection-range-rover-rolls-royce/","keywords":["Boxing","Sport","Car collections","Longtail","Sport Features"],"creator":["Jon Boon"],"video_url":null,"description":null,"content":"ANTHONY Joshua is part of the sporting elite, having amassed a fortune through boxing. AJ, 34, is believed to be worth around £200million - thanks to a glittering career and savvy investments. The two-time former unified world heavyweight champion has spent his money wisely. And thanks to a sponsorship with Land Rover, his company cars are to die for. SunSport takes a look at what the legendary boxer has in his garage. The most impressive of his fleet is a top-of-the-range Range Rover that is worth £150,000. The one-of-a-kind customised SUV was presented to AJ ahead of his bout against Wladimir Klitschko in 2017. His high-performance Range Rover SVAutobiography Dynamic includes a number of special features just for the boxer, including door handles with unique boxing glove pattern surrounds, name-inscribed treadplates, a chrome B-pillar badge with AJ's signature, and a custom equipment storage unit for all Joshua's gear. The car also features diamond-quilted leather interior with Joshua's signature embossed in the headrest and aluminium letter box finishers on door cards engraved with his signature. We're cheating here, this one wasn't technically his. However, he did try to buy a stunning Rolls-Royce Phantom stretch limo, after he was taken for a ride in it in 2016. AJ hired the amazing motor when he attended an event in Staffordshire. And he was so impressed, he reportedly asked John Smith, the owner of Phantom Limo Hire, if he would sell it to him. Joshua also shared a snap on Instagram posing with the limo. He captioned the photo: \"Work... That’s all a brother’s working with.\" Everyone has to start somewhere. And Joshua's first car was a Vauxhall Astra that he saved up £1,500 to buy. In an interview he described the Astra as a \"'stable, sturdy, a good car.\" Still, given its size it's a mystery he was able to squeeze his 6ft5in frame into one in the first place. Although AJ has had some classy cars in his time, it's his XJR that has a special place in his heart. He told The Telegraph in 2016: \"When I pull up in a Jag, it’s like a watch. Certain watches, everyone has, but there are certain watches only a few people know about. \"The Jag is a car that only certain people know about. \"It used to be that it was a car for the established man, who’d been in the game for years and treated himself to a Jag, but now they’re crossing right the way across the board. \"And I’m lucky enough to have one that they’ve kept classy but added a few sports touches to.\" Most recently, AJ has been seen driving around Central London in this stylish Audi. It's the highest spec the German manufacturer produces. The motor features a powerful 2.0 litre turbocharged engine with Quattro all-wheel drive and an S Tronic automatic gearbox. It's a very comfortable ride. However, AJ reportedly has a chauffeur who drives him - so he may not know! One thing we know about AJ is he loves his mum. When he had enough riches, and she was desperately in need of a new car, he happily obliged by gifting her a Range Rover Sport. He said: \"I feel I’ve never had the time to focus on helping her, so when her car broke down, I was just like it’s that time – if I’m going to do anything I’ll sort her out with a nice car, and so I got that as a present. \"It’s nice for her to be in a car like that. She didn’t expect it and we surprised her, so it was a really good time for her.\"","pubDate":"2023-12-19 13:20:47","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/GETTY_Day-Of-Reckoning-Media-Day-In-Riyadh_SPO_GYI1858324190jpg-JS867167918.jpg?strip=all&w=960","source_id":"thesun_ie","source_priority":45285,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"b5d66dbd14be405c4f71160bf1ee499a","title":"Inside Anthony Joshua’s amazing car collection, from top-of-the range Range Rover to riding in a £600k Rolls-Royce limo","link":"https://www.thesun.co.uk/sport/25100550/anthony-joshua-car-collection-range-rover-rolls-royce/","keywords":["Boxing","Sport","Car collections","Longtail","Sport Features"],"creator":["Jon Boon"],"video_url":null,"description":null,"content":"ANTHONY Joshua is part of the sporting elite, having amassed a fortune through boxing. AJ , 34, is believed to be worth around £200million - thanks to a glittering career and savvy investments. The two-time former unified world heavyweight champion has spent his money wisely. And thanks to a sponsorship with Land Rover , his company cars are to die for. SunSport takes a look at what the legendary boxer has in his garage. The most impressive of his fleet is a top-of-the-range Range Rover that is worth £150,000. The one-of-a-kind customised SUV was presented to AJ ahead of his bout against Wladimir Klitschko in 2017. His high-performance Range Rover SVAutobiography Dynamic includes a number of special features just for the boxer, including door handles with unique boxing glove pattern surrounds, name-inscribed treadplates, a chrome B-pillar badge with AJ's signature, and a custom equipment storage unit for all Joshua's gear. The car also features diamond-quilted leather interior with Joshua's signature embossed in the headrest and aluminium letter box finishers on door cards engraved with his signature. We're cheating here, this one wasn't technically his. However, he did try to buy a stunning Rolls-Royce Phantom stretch limo, after he was taken for a ride in it in 2016. AJ hired the amazing motor when he attended an event in Staffordshire. And he was so impressed, he reportedly asked John Smith, the owner of Phantom Limo Hire, if he would sell it to him. Joshua also shared a snap on Instagram posing with the limo. He captioned the photo: \"Work... That’s all a brother’s working with.\" Everyone has to start somewhere. And Joshua's first car was a Vauxhall Astra that he saved up £1,500 to buy. In an interview he described the Astra as a \"'stable, sturdy, a good car.\" Still, given its size it's a mystery he was able to squeeze his 6ft5in frame into one in the first place. Although AJ has had some classy cars in his time, it's his XJR that has a special place in his heart. He told The Telegraph in 2016: \"When I pull up in a Jag, it’s like a watch. Certain watches, everyone has, but there are certain watches only a few people know about. \"The Jag is a car that only certain people know about. \"It used to be that it was a car for the established man, who’d been in the game for years and treated himself to a Jag, but now they’re crossing right the way across the board. \"And I’m lucky enough to have one that they’ve kept classy but added a few sports touches to.\" Most recently, AJ has been seen driving around Central London in this stylish Audi. It's the highest spec the German manufacturer produces. The motor features a powerful 2.0 litre turbocharged engine with Quattro all-wheel drive and an S Tronic automatic gearbox. It's a very comfortable ride. However, AJ reportedly has a chauffeur who drives him - so he may not know! One thing we know about AJ is he loves his mum. When he had enough riches, and she was desperately in need of a new car, he happily obliged by gifting her a Range Rover Sport. He said: \"I feel I’ve never had the time to focus on helping her, so when her car broke down, I was just like it’s that time – if I’m going to do anything I’ll sort her out with a nice car, and so I got that as a present. \"It’s nice for her to be in a car like that. She didn’t expect it and we surprised her, so it was a really good time for her.\"","pubDate":"2023-12-19 13:20:47","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/GETTY_Day-Of-Reckoning-Media-Day-In-Riyadh_SPO_GYI1858324190jpg-JS867167918.jpg?strip=all&w=960","source_id":"thesun","source_priority":1813,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"92b8a1592544282552e333411e36dcaa","title":"Man City Premier League title chances 'drop 50 percent' as Arsenal and Liverpool benefit","link":"https://www.mirror.co.uk/sport/football/news/man-city-premier-league-title-31707600","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"Manchester City have won just one of their last six games, allowing Arsenal and Liverpool to pull away in the race to win the Premier League title heading into the festive period","content":"Manchester City's recent poor form has since their chances of winning the Premier League drop by more than 50 percent, according to a new supercomputer. The reigning champions have won just one of their last six games in the top-flight, throwing away a two goal lead in a draw with Crystal Palace at the weekend. They have also drawn with Chelsea , Liverpool and Tottenham , as well as losing to Aston Villa. During their difficult period, Arsenal , Liverpool and Villa have been able to pull away, with City now five points adrift of top spot. At the start of the season, City had been given a 90.2 percent chance of retaining their title for a fourth successive time by Opta. Jamie Carragher doubles down on Liverpool league title prediction as Gary Neville agrees Man City star Bernardo Silva warns bosses that players are at breaking point Their chances have plummeted now though, with Opta giving them a 39.3 percent chance of winning the league, a drop of 50.9 percent from the start of the season. The draw with Palace saw their odds plummet by 8.5 percent, though they are still the favourites. Arsenal are rated as their closest rivals, with the Gunners' lead at the top of the table standing at one point ahead of Liverpool heading into the festive period. Mikel Arteta's men are given a 29.9 percent chance of winning their first title in 20 years by Opta, an increase of 25.8 percent from pre-season. Liverpool have launched somewhat of a surprise title challenge, though their hopes are down at 23.6 percent. Despite their bore draw with Manchester United , their chances have flown up, having been rated as just 3.5 percent favourites before the campaign. HAVE YOUR SAY! Who will win the Premier League title? Comment below . A draw with Crystal Palace has sent Manchester City's chances of winning the title plummeting ( Image: Shaun Botterill/Getty Images) Talking of surprises, Aston Villa have come from nowhere to put themselves firmly in the title conversation. They are now rated as the fourth-most likely team to win the league, though they are still down at 6.8 percent. City have a short break from league action while they take part in the Club World Cup. And former Newcastle star Alan Shearer believes they can recover from their poor form to have say in the title race. \"Compared with the high standards they set themselves, City have hit a sticky patch. It just shows you that, even if you are as great as they are, when games are tight at the finish then uncertainty can creep in when you are on a run where you are not winning,\" he told BBC Sport. \"They are just not used to that, because they have had things very much their own way for such a long time. Their points total is the lowest at this stage of the season since Pep Guardiola took charge in 2016, which is a concern. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here \"And if they are going to win the title again then it looks like they will have to do it in a different way to the years where they have been the dominant team. Even so, it would be foolish to write them off, because they are far too good for that. \"They will have ground to make up when they get back from the Club World Cup, but I still expect them to go on one of their long winning runs. They have got Erling Haaland and Kevin de Bruyne to come back into the team, of course they are going to figure in the title race.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-12-19 13:17:12","image_url":"https://i2-prod.mirror.co.uk/incoming/article31707614.ece/ALTERNATES/s615/0_GettyImages-1860043673.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"160183f2e2314cc79b0ce98b25ef200b","title":"Danladi canvasses support for Nasarawa United, Lobi Stars","link":"https://dailypost.ng/2023/12/19/danladi-canvasses-support-for-nasarawa-united-lobi-stars/","keywords":["Sport","Danladi","Lobi Stars","Nasarawa United"],"creator":["Taiwo Adesanya"],"video_url":null,"description":"The Nasarawa State government has called for improved support for both Nasarawa United and Lobi Stars. The permanent secretary of the Ministry of Youth and Sports Development, Barrister Isaac Danladi commended the Jibrin Ali Baggio-led Supporters’ Club for their unwavering support to players and management of the Solid Miners, urging them to sustain the tempo […] Danladi canvasses support for Nasarawa United, Lobi Stars","content":"Daily Post Nigeria Danladi canvasses support for Nasarawa United, Lobi Stars Home News Politics Metro Entertainment Sport Sport Danladi canvasses support for Nasarawa United, Lobi Stars Published on December 19, 2023 By Taiwo Adesanya The Nasarawa State government has called for improved support for both Nasarawa United and Lobi Stars. The permanent secretary of the Ministry of Youth and Sports Development, Barrister Isaac Danladi commended the Jibrin Ali Baggio-led Supporters’ Club for their unwavering support to players and management of the Solid Miners, urging them to sustain the tempo until the club returns to the top-flight. Danladi also urged members of the supporters’ club to continue with the support they accord NPFL side, Lobi Stars, who have adopted the Lafia City Stadium as their home ground this season. He, however, frowned at the division in the support that occurred in the matchday 14 game between Lobi Stars versus Doma United. Danladi said the incident was an indication that there was a crack in the leadership of the supporters’ club which almost marred the support for Lobi Stars. “Ab initio, the rationale behind Lobi Stars adopting the Lafia City Stadium as their alternative home ground for the 2023/24 NPFL Season followed an extensive camaraderie between Governor Abdullahi Sule and his Benue State counterpart, His Excellency, Governor Hyacinth Iormem Alia, and the shared brotherhood between Nasarawa and Benue States,” he stated during a meeting with the supporters club. “Also, I have enjoyed a healthy working relationship with the Vice Chairman and CEO of Lobi Stars, Dominic Iorfa, and it’s the utmost expectation of the Nasarawa State Government and people and the Government and people of Benue State to see both Nasarawa United gain promotion back to the premier league and Lobi Stars win the league title, respectively, and play continental football at their make-shift home ground as it would both be to our collective benefits. “Therefore, we are calling on the leadership of the Supporters’ Club to control her members in order not to foment any problems capable of disuniting the fraternity or bringing the league to disrepute as Nasarawa State is known for peace, hospitality and harmonious co-existence, irrespective of any differences.” Related Topics: Danladi Lobi Stars Nasarawa United Don't Miss Sacked Bolus to take legal action against Katsina United You may like Lobi Stars coach Agabe happy with team’s resilience in Doma United’s win Lobi Stars appoint U-17 management team Adams upbeat Nasarawa United will beat Yobe Stars in NNL fixture Doma United get Aliyu, Abdullahi boost ahead of Lobi Stars clash Agagbe rues Lobi Stars defeat to Akwa United El-Kanemi Warriors defeat won’t derail Nasarawa United’s promotion bid – Adams Advertise About Us Contact Us Privacy-Policy Terms Copyright © Daily Post Media Ltd","pubDate":"2023-12-19 13:16:03","image_url":"https://dailypost.ng/wp-content/uploads/2023/10/Nasarawa-United.jpg","source_id":"dailypost","source_priority":55306,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"cedbc57e2dac7ca47594e73ba7fd754c","title":"La Liga to make referee and VAR communications public","link":"https://www.barcablaugranes.com/2023/12/19/24007634/la-liga-to-make-referee-and-var-communications-public-from-january","keywords":null,"creator":["",""],"video_url":null,"description":null,"content":"La Liga confirmed on Tuesday that referee and VAR communications will be made public from January. The new initiative will be implemented initially in the Spanish Super Cup and will then be implemented in La Liga from matchday 20. “The RFEF and LaLiga have agreed to start publishing the images and audio of the conversations between the on-field referee and the VAR officials following a VAR review and the use of the pitchside monitor. These will be released exclusively through the official media channels and only after the end of the matchday. “This initiative marks a new level of collaboration and joint work between the RFEF and the CTA and LaLiga, with the aim of making refereeing in professional football and the competitions themselves more transparent. “In this sense, with the broadcasting of the images and audios after the end of each competition day (Saturday, Sunday and Monday), the fans’ experience will be improved and a better understanding of the refereeing decisions will be appreciated by the viewers, thus improving the competitions as a whole.” The move comes after a season where there’s once again been plenty of controversy over refereeing decisions in the Spanish top flight.","pubDate":"2023-12-19 13:15:20","image_url":"https://cdn.vox-cdn.com/thumbor/TQDX8q_497Qi5iMu7CjdTIbYu88=/0x0:3189x2126/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/72978059/1612736491.0.jpg","source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"bdd55707a17cfa588a847aac12d0b7d6","title":"Manchester United winger Antony is becoming impossible to defend","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-winger-antony-becoming-28314744","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Steven Railston)"],"video_url":null,"description":"Antony has struggled in Manchester since signing from Ajax in 2022 and he's becoming increasingly difficult to defend.","content":"Sky Germany were criticised for mocking up an image of Jadon Sancho as 007 in a tuxedo alongside his statistics - no goals or assists in seven appearances - after he signed for Manchester United. Sancho had failed to hit the ground running following his move from Borussia Dortmund and the German media decided to poke fun at his disappointing start with a James Bond-themed joke. However, if those statistics looked bad, then Antony's record of no goals and assists in 18 appearances this season looks awful and he certainly does not have a licence to thrill. ALSO READ: Eriksen returns to training ALSO READ: Dan Gore's journey to United debut Antony endured a difficult first season after signing from Ajax, but he was given the benefit of the doubt after moving to a new environment and it was hoped he could progress in the new campaign. The 23-year-old has regressed instead and he's become indefensible for even the most partisan supporters due to his poor performances and failure to contribute in attacking scenarios. United privately conceded they overpaid for Antony when stumping up £86million and that gamble has backfired. They hoped he would become one of the best wingers in the world but that seems unlikely. Antony made a stellar first impression with three goals in his first few appearances against Arsenal, Manchester City and Everton, although even then, his performances were masked by finding the net. Naturally, scoring a goal decides how a player's performance is judged and he deserved credit for making a bright goal start, but the goals quickly dried up and the scrutiny heightened. While Antony can be a threat when cutting inside on his left foot, it didn't take long for defenders to do their homework and he's now arguably the most one-dimensional player in the Premier League. Remarkably, the season is about to reach Christmas and he's yet to record a goal or an assist. The calendar year of 2023 hasn't been kind and he's contributed just one league goal across the last 12 months. Antony looks worth a fraction of the fee paid for his signature and there's already talk of United cutting their losses because, despite a hint of a recent revival, he has failed to build on some encouraging signs. The Brazilian produced his best performance of the season against Galatasaray and he would have felt aggrieved to be dropped against Newcastle, but he's been poor since returning to the starting team. United fans have been waiting for Antony to burst into life and produce consistent displays but it's still yet to happen. It was the same situation with Sancho and it never happened for him. Paul Pogba, Antony, Harry Maguire, Romelu Lukaku and Sancho are the five most expensive signings in United's history and that highlights the club's horrendous record in the transfer market. United have been the worst buyers in football over the last decade and with Sir Jim Ratcliffe's arrival imminent, it's hoped Antony is the last player to grossly underperform after being signed for a multi-million-pound fee. Antony contributed just eight goals and four assists in his final season in the Eredivisie and considering the standard of the Netherlands' first division, that level of output didn't warrant the fee paid. Speaking in 2019, Ratcliffe famously described the singing of Fred for £50m as 'dumb money' and it would be interesting to get his thoughts on the £86m that was invested into Antony. It's probable Ratcliffe's language would be colourful and he's unlikely to go on record with that.","pubDate":"2023-12-19 13:15:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article28314934.ece/ALTERNATES/s615/0_GettyImages-1864401857.jpg","source_id":"manchestereveningnews","source_priority":6158,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"81e11c7a5932e79e27122f4b6ed9d275","title":"Η επιβάρυνση ελέω Ευρώπης και το αποτέλεσμα αυτής!","link":"https://www.gazzetta.gr/football/superleague/2286101/i-epibarynsi-eleo-eyropis-kai-apotelesma-aytis","keywords":["Ποδόσφαιρο","Superleague","Γιώργος Τσακίρης","ΑΕΚ","Ματίας Αλμέιδα","Γενς Γιόνσον","Τραυματισμός"],"creator":null,"video_url":null,"description":"Η κουβέντα για τις απουσίες της ΑΕΚ, οι περισσότερες από οποιαδήποτε άλλη ομάδα, είναι απόλυτα δικαιολογημένη και υπάρχει απόλυτα λογική αιτία να της συμβαίνει αυτό..","content":"Είναι γεγονός (και δικαιολογημένα συμβαίνει) πως έχει προκύψει μεγάλη και μπόλικη κουβέντα σχετικά με το πρόβλημα το οποίο ταλαιπωρεί την ΑΕΚ και δυσκολεύει το έργο της σε αγωνιστικό επίπεδο και αφορά τα ζητήματα τραυματισμών και απουσιών σε σημαντικά ματς, είτε για την Ευρώπη είτε για την Ελλάδα. Ειδικά στο τέλος των υποχρεώσεων στον απαιτητικό όμιλο που συμμετείχαν οι νταμπλούχοι για το Europa League , αποδείχτηκαν καθοριστικές οι απουσίες σημαντικών ποδοσφαιριστών ( Πινέδα , Αραούχο , Γιόνσον , Στάνκοβιτς , Πόνσε ), οι οποίοι εφόσον ήταν διαθέσιμοι -έστω στο τελευταίο ματς στο Άμστερνταμ με αντίπαλο τον Άγιαξ , είναι πολύ πιθανό να ήταν εντελώς διαφορετική η τύχη της και να υπήρχε ευρωπαϊκή συνέχεια, έστω μέσω της 3ης θέσης στον όμιλο του θανάτου! Ωστόσο για τον Δικέφαλο δεν προέκυψαν αγωνιστικά άσχημα αποτελέσματα μόνο στην Ευρώπη ελέω απουσιών. Η επιβάρυνση που προέκυψε από τα ευρωπαϊκά παιχνίδια σε μια ομάδα που αντικειμενικά ήταν (λόγω απουσίας από την κανονικότητά της) άπειρη σε επίπεδο ανταπόκρισης σε τρεις διοργανώσεις, προκάλεσε γκέλες και στις εγχώριες διοργανώσεις και πιο σωστά στο πρωτάθλημα. Σε οποιοδήποτε ματς στράβωσε για την ΑΕΚ υπήρχαν τεράστιας σημασίας και πολλές σε αριθμό απουσίες. Αποκορύφωμα ήταν το πιο πρόσφατο με αντίπαλο τον Παναιτωλικό όπου η Ένωση υποχρεώθηκε να παίξει στο Αγρίνιο δίχως επτά σημαντικούς ποδοσφαιριστές της... Απουσίες που δεν αφορούν αποκλειστικά την ενδεκάδα της αλλά και τη διαχείριση του εκάστοτε αγώνα. Για παράδειγμα στην γκέλα με τον Παναιτωλικό από τον πάγκο δεν υπήρχαν πολλοί πλην των Τσούμπερ και Γιόνσον για να 'ρθουν στον αγωνιστικό χώρο και να αλλάξουν πράγματα. Έλειπαν συνολικά επτά ποδοσφαιριστές! Δεν είναι δα και εύκολο για καμία ομάδα να ανταποκριθεί με τόσες απουσίες και προφανώς αυτό είναι κάτι που το αντιλαμβάνονται στην ΑΕΚ , ο ίδιος ο Ματίας Αλμέιδα και οι συνεργάτες του, αλλά και όλοι στο club. Γι' αυτό και περιμένουν πως και πως το 2024 όπου δεδομένα δεν γίνεται να έχει στην πορεία του έως την ολοκλήρωση της σεζόν τα ίδια προβλήματα απουσιών. Γιατί όμως συνέβη αυτό; Μα φυσικά και απλά από την επιβάρυνση της ομάδας από επιπλέον παιχνίδια στην Ευρώπη και σε αυτό το επίπεδο, με ομάδες που πρέπει να βγάλεις το 100% για να ανταποκριθείς, να ξεπεράσεις τα στάνταρ σου σε επίπεδα έντασης, φυσικής κατάστασης και δύναμης! Αυτό δεν γίνεται να το πετύχεις αναίμακτα. Η ΑΕΚ έως τώρα συγκριτικά με την περσινή σεζόν έχει δώσει ήδη τουλάχιστον δέκα περισσότερα ματς με ταξίδια και ότι αυτό συνεπάγεται. Δεδομένου ότι δεν άλλαξε τη δουλειά που έκανε και στον βαθμό έντασης που το έκανε και πέρυσι ο Αλμέιδα και το team του, αναμενόμενα και απόλυτα δικαιολογημένα, έχουμε αυτό το μεγάλο ζήτημα των τραυματιών! Είναι αν μη τι άλλο απόλυτη λογική η αιτία. Οι νταμπλούχοι έπαιξαν διπλές αναμετρήσεις με υψηλή απαίτηση αφού αντιμετώπισαν τη Ντινάμο Ζάγκρεμπ , την Αντβέρπ , όλα διπλές αναμετρήσεις και μάλιστα με τους Κροάτες ελέω δολοφονίας Μιχάλη σε πολύ σύντομο χρονικό διάστημα και ενώ ενδιάμεσα ξεκίνησε και το πρωτάθλημα. Ακολούθησαν τα ματς με Μπράιτον , Μαρσέιγ και Άγιαξ μέσα και έξω επίσης με αποτέλεσμα αυτή η επιβάρυνση και τα επιπλέον ματς συγκριτικά με πέρυσι να φέρουν τα ζητήματα τραυματισμών σε πρώτο πλάνο, διότι και πέρυσι είχε η ΑΕΚ , απλά λόγω του ματς ανά βδομάδα, ήταν λογικά και λιγότερες οι απουσίες ανά παιχνίδι και πιο γρήγορη η επιστροφή των κιτρινόμαυρων ποδοσφαιριστών, αλλά και όλων των ομάδων που δεν είχαν ευρωπαϊκές αναμετρήσεις. Τώρα σε ότι αφορά στην κουβέντα αν έπρεπε να ρίξει την ένταση και το ρυθμό αυτό το διάστημα ο Ματίας Αλμέιδα στις προπονήσεις, προφανώς και κάθε άποψη είναι αποδεκτή, αλλά αυτή που 'χει σημασία είναι στο τέλος εκείνη του Αργεντινού τεχνικού! Επίσης θα κριθεί στο τέλος της χρονιάς και όχι τώρα... Διότι στο επιχείρημα «μπορεί να μην είχαν βγει τόσοι πολλοί μαζί εκτός», υπάρχει και ο αντίλογος που αναφέρει «αλλά δεν θα μπορούσαμε να ανταποκριθούμε με μικρότερη και λιγότερη ένταση στα ματς αυτά και στη τεράστια απαίτηση απέναντι σε ομάδα Premier League και όχι μόνο». Το μόνο σίγουρο είναι ότι πρόκειται για κάτι υποθετικό στο οποίο ουσιαστικά απάντηση δεν υπάρχει που να δικαιώνει, ή να ακυρώνει την κάθε άποψη...","pubDate":"2023-12-19 13:30:00","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"c4b2a39a469f504c8257c408d98ee4f2","title":"Νότιγχαμ Φόρεστ: «Τελειώνει» ο Κούπερ και αναλαμβάνει ο Εσπίριτο Σάντο","link":"https://www.gazzetta.gr/football/premier-league/2286126/notigham-forest-teleionei-o-koyper-kai-analambanei-o-espirito-santo","keywords":["Ποδόσφαιρο","Premier League","Newsroom","Νότιγχαμ Φόρεστ"],"creator":null,"video_url":null,"description":"Μια ανάσα από τον Εσπίριτο Σάντο φέρεται να βρίσκεται η Νότιγχαμ Φόρεστ με τον Στιβ Κούπερ να αναμένεται να αποτελέσει παρελθόν μέσα στις επόμενες ώρες.","content":"Ραγδαίες οι εξελίξεις στο στρατόπεδο της Νότιγχαμ Φόρεστ. Όπως δείχνουν τα τελευταία γεγονότα, ο Νούνο Εσπίριτο Σάντο αναμένεται να αναλάβει την τεχνική ηγεσία των reds! Σύμφωνα με τον Φαμπρίτσιο Ρομάνο, ο Πορτογάλος τεχνικός τα έχει ήδη βρει σε όλα με τους ανθρώπους του αγγλικού συλλόγου και μάλιστα μέσα στις επόμενες ώρες θα βρεθεί στην Αγγλία προκειμένου να υπογράψει το συμβόλαιο του με την ομάδα. Ο Στιβ Κούπερ από την άλλη αναμένεται να αποτελέσει παρελθόν μέσα στις επόμενες ώρες και εφόσον δεν προκύψει κάποια μεγάλη ανατροπή, τότε ο Πορτογάλος θα είναι ο νέος προπονητής της Φόρεστ. O Πορτογάλος κόουτς αποχώρησε το Νοέμβριο από την Αλ Ιτιχάντ και φαίνεται πως βρίσκεται μια ανάσα από την επιστροφή του στην Premier League. Στο παρελθόν έχει κοουτσάρει Ρίο Άβε, Βαλένθια, Πόρτο, Γουβς , Τότεναμ , ενώ ήταν προπονητής τερματοφυλάκων σε Μάλαγα και Παναθηναϊκό .","pubDate":"2023-12-19 13:26:54","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"83999f5af9a7896b4c9d1308423527c9","title":"Panenkas and playing the panto villain: Ross Millen’s key role at Raith Rovers","link":"https://www.thecourier.co.uk/fp/sport/football/4844957/panenkas-and-playing-the-panto-villain-ross-millens-key-role-at-raith-rovers/","keywords":["Football","Raith Rovers FC","Ross Millen","Scottish Championship"],"creator":["Craig Cairns"],"video_url":null,"description":"The 29-year-old has become a popular figure amongst supporters.","content":"The sight of Ross Millen celebrating a last-ditch tackle as if it were a goal was the latest exploit to endear the Raith Rovers support to their colourful full-back. With the team 1-0 up in Saturday’s pivotal Scottish Championship clash at Tannadice deep into the second half, it felt a matter of time until Dundee United had ‘their chance’. It appeared to have fallen to , but as he was about to pull the trigger the out-stretched right leg of Millen hooked the ball to safety. Buoyed by the backing of a relieved and rapturous support, he stood up to punch the air in celebration. Millen explained to Courier Sport why relief also informed his response to the tackle: “Nae wonder because it was me that lost the ball at the start of it! “I played it short and Sam [Stanton] got it nicked off him. I was like ‘Aw naw…’. I was just glad to get back and help the boys out.” Millen was part of a trio of signings brought to the club by Ian Murray soon after the Raith boos took charge in the summer of 2022. Along with Scott Brown and , the 29-year-old right-back has gone on to establish himself as a key member of the starting XI. And like most in the squad, he has gone on to excel so far this season – his character standing out just as much as his on-field ability. That was encapsulated no better than when he capped off the most sensational comeback on this run – in – with an injury-time Panenka at Hampden. That was – at least the third club he has scored one for. He was booked as he searched for pieces of kit he’d torn off in the understandably wild celebrations. ‘Over-celebrating’ has been a slight issue and is part of why Millen sat out the win in Inverness through suspension. He has since picked up a yellow card after carrying Lewis Vaughan on his shoulder after the substitute . Again, it was a completely understandably wild celebration to befit another madcap ending to a game for this Rovers side. ‘Panto villain’ is a seasonably suitable term to describe the approach Millen sometimes takes to the game. After Stanton’s winner at East End Park, he put his fingers in his ears in front of the Dunfermline fans – a reference to Matty Todd after he netted the winning penalty on the opening day of the season. It’s all in good humour, though. Millen still and is greeted warmly by staff when he returns to East End Park. But right now it’s all about enjoying the moment at Raith, after they took a five-point lead at the top of the Championship. “It’s ,” adds Millen. “That breeds confidence and more wins. “But I know the other side, when you’re losing games and you can’t get that goal at times. You just really need to enjoy it while it comes. “It gives you confidence, but you’re only in December. We’ve loads of games to go. “There are going to be ups and downs – there will be downs to come at some point. It’s just how you deal with them.”","pubDate":"2023-12-19 13:26:18","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/12/2023/12/Untitled-design-54-pxcni2r6-150x150.jpg","source_id":"thecourier","source_priority":241228,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"90e1189858d6b0fef994a9a1c0fb4671","title":"Liverpool legends unite for Christmas meal with some unrecognisable from playing days","link":"https://www.mirror.co.uk/sport/football/news/liverpool-legends-christmas-fowler-rush-31708039","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Mark Jones)"],"video_url":null,"description":"Reds legends gathered for a Christmas meal as they toasted their successes of the past, with Robbie Fowler sharing a team photo of the 13 former players","content":"Thirteen Liverpool legends linked up to celebrate Christmas as the Reds greats reminisced about their playing days - but how many can you remember? Liverpool icon Robbie Fowler shared a snap of the players enjoying Christmas dinner together on Monday, and while the man known affectionately as 'God' by Reds supporters was side by side with his 1990s team-mate Steve McManaman, you might need to be a fan of a certain age to recognise most of the other players in the Liverpool line-up. Players from the club's glory days of the 1970s and 80s make up most of the snap, with Fowler posting the caption: \"In good company. Absolute legends and top fellas\" with his picture. Roy Keane told to \"get a life\" as Liverpool icon wades in on Virgil van Dijk row Liverpool hatch clear January transfer plan after private talks between Jurgen Klopp and FSG Starting top left, it is former Reds midfielder Sammy Lee who is stood next to Phil Thompson, with both men serving on the coaching staff of the club after their successful playing days ended. Thompson, who also served as Liverpool's interim manager when Gerard Houllier was ill between 2001 and 2002, also enjoyed a successful career as a Sky Sports pundit before being axed in 2020 . Liverpool legends enjoyed a Christmas meal together on Monday ( Image: @Robbie9Fowler/Twitter) Next, moving clockwise along the top row, it is Liverpool's all-time appearance maker Ian Callaghan, now 81, who played a record 857 times for the Reds between 1960 and 1978. He is followed by Alan Kennedy, who scored the winning goal in 1981 European Cup final and the winning penalty in the shootout in the 1984 final. Then after Fowler and McManaman come 1980s legends John Aldridge and Steve McMahon. Moving to the bottom row, and heading left to right again, it is David Fairclough who is seated furthest left. The forward was known as 'Super Sub' during his career for his ability to score goals off the bench, and was a key part of the squad which won the European Cup in 1977. Phil Thompson (back row, second left), David Fairclough (middle row, third left), and Ian Callaghan (front row, second left) in a 1977 team photo ( Image: Bob Thomas Sports Photography via Getty Images) Liverpool's all-time top scorer Ian Rush comes next, and is seated next to Reds icon John Barnes, who was one of the best players in the world in the late 1980s and a star of the Reds side that dominated English football at the time. Next to Barnes is Howard Gayle, Liverpool's first ever black player who made a famous appearance in a European Cup semi-final against Bayern Munich in 1981 , and next to Gayle is David Hodgson, the Gateshead-born forward who won two league titles and the European Cup with the Reds between 1982 and 1984. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here The Liverpool legends line-up in full: Standing L-R - Sammy Lee, Phil Thompson, Ian Callaghan, Alan Kennedy, Robbie Fowler, Steve McManaman, John Aldridge, Steve McMahon. Sitting L-R - David Fairclough, Ian Rush, John Barnes, Howard Gayle, David Hodgson. Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-12-19 13:21:28","image_url":"https://i2-prod.mirror.co.uk/incoming/article31708255.ece/ALTERNATES/s615/0_Screenshot-2023-12-19-at-085448.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d68b49cef99d05988559c7cb7aa27f96","title":"Inside Anthony Joshua’s amazing car collection, from top-of-the range Range Rover to riding in a £600k Rolls-Royce limo","link":"https://www.thesun.ie/sport/11879558/anthony-joshua-car-collection-range-rover-rolls-royce/","keywords":["Boxing","Sport","Car collections","Longtail","Sport Features"],"creator":["Jon Boon"],"video_url":null,"description":null,"content":"ANTHONY Joshua is part of the sporting elite, having amassed a fortune through boxing. AJ, 34, is believed to be worth around £200million - thanks to a glittering career and savvy investments. The two-time former unified world heavyweight champion has spent his money wisely. And thanks to a sponsorship with Land Rover, his company cars are to die for. SunSport takes a look at what the legendary boxer has in his garage. The most impressive of his fleet is a top-of-the-range Range Rover that is worth £150,000. The one-of-a-kind customised SUV was presented to AJ ahead of his bout against Wladimir Klitschko in 2017. His high-performance Range Rover SVAutobiography Dynamic includes a number of special features just for the boxer, including door handles with unique boxing glove pattern surrounds, name-inscribed treadplates, a chrome B-pillar badge with AJ's signature, and a custom equipment storage unit for all Joshua's gear. The car also features diamond-quilted leather interior with Joshua's signature embossed in the headrest and aluminium letter box finishers on door cards engraved with his signature. We're cheating here, this one wasn't technically his. However, he did try to buy a stunning Rolls-Royce Phantom stretch limo, after he was taken for a ride in it in 2016. AJ hired the amazing motor when he attended an event in Staffordshire. And he was so impressed, he reportedly asked John Smith, the owner of Phantom Limo Hire, if he would sell it to him. Joshua also shared a snap on Instagram posing with the limo. He captioned the photo: \"Work... That’s all a brother’s working with.\" Everyone has to start somewhere. And Joshua's first car was a Vauxhall Astra that he saved up £1,500 to buy. In an interview he described the Astra as a \"'stable, sturdy, a good car.\" Still, given its size it's a mystery he was able to squeeze his 6ft5in frame into one in the first place. Although AJ has had some classy cars in his time, it's his XJR that has a special place in his heart. He told The Telegraph in 2016: \"When I pull up in a Jag, it’s like a watch. Certain watches, everyone has, but there are certain watches only a few people know about. \"The Jag is a car that only certain people know about. \"It used to be that it was a car for the established man, who’d been in the game for years and treated himself to a Jag, but now they’re crossing right the way across the board. \"And I’m lucky enough to have one that they’ve kept classy but added a few sports touches to.\" Most recently, AJ has been seen driving around Central London in this stylish Audi. It's the highest spec the German manufacturer produces. The motor features a powerful 2.0 litre turbocharged engine with Quattro all-wheel drive and an S Tronic automatic gearbox. It's a very comfortable ride. However, AJ reportedly has a chauffeur who drives him - so he may not know! One thing we know about AJ is he loves his mum. When he had enough riches, and she was desperately in need of a new car, he happily obliged by gifting her a Range Rover Sport. He said: \"I feel I’ve never had the time to focus on helping her, so when her car broke down, I was just like it’s that time – if I’m going to do anything I’ll sort her out with a nice car, and so I got that as a present. \"It’s nice for her to be in a car like that. She didn’t expect it and we surprised her, so it was a really good time for her.\"","pubDate":"2023-12-19 13:20:47","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/GETTY_Day-Of-Reckoning-Media-Day-In-Riyadh_SPO_GYI1858324190jpg-JS867167918.jpg?strip=all&w=960","source_id":"thesun_ie","source_priority":45285,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"b5d66dbd14be405c4f71160bf1ee499a","title":"Inside Anthony Joshua’s amazing car collection, from top-of-the range Range Rover to riding in a £600k Rolls-Royce limo","link":"https://www.thesun.co.uk/sport/25100550/anthony-joshua-car-collection-range-rover-rolls-royce/","keywords":["Boxing","Sport","Car collections","Longtail","Sport Features"],"creator":["Jon Boon"],"video_url":null,"description":null,"content":"ANTHONY Joshua is part of the sporting elite, having amassed a fortune through boxing. AJ , 34, is believed to be worth around £200million - thanks to a glittering career and savvy investments. The two-time former unified world heavyweight champion has spent his money wisely. And thanks to a sponsorship with Land Rover , his company cars are to die for. SunSport takes a look at what the legendary boxer has in his garage. The most impressive of his fleet is a top-of-the-range Range Rover that is worth £150,000. The one-of-a-kind customised SUV was presented to AJ ahead of his bout against Wladimir Klitschko in 2017. His high-performance Range Rover SVAutobiography Dynamic includes a number of special features just for the boxer, including door handles with unique boxing glove pattern surrounds, name-inscribed treadplates, a chrome B-pillar badge with AJ's signature, and a custom equipment storage unit for all Joshua's gear. The car also features diamond-quilted leather interior with Joshua's signature embossed in the headrest and aluminium letter box finishers on door cards engraved with his signature. We're cheating here, this one wasn't technically his. However, he did try to buy a stunning Rolls-Royce Phantom stretch limo, after he was taken for a ride in it in 2016. AJ hired the amazing motor when he attended an event in Staffordshire. And he was so impressed, he reportedly asked John Smith, the owner of Phantom Limo Hire, if he would sell it to him. Joshua also shared a snap on Instagram posing with the limo. He captioned the photo: \"Work... That’s all a brother’s working with.\" Everyone has to start somewhere. And Joshua's first car was a Vauxhall Astra that he saved up £1,500 to buy. In an interview he described the Astra as a \"'stable, sturdy, a good car.\" Still, given its size it's a mystery he was able to squeeze his 6ft5in frame into one in the first place. Although AJ has had some classy cars in his time, it's his XJR that has a special place in his heart. He told The Telegraph in 2016: \"When I pull up in a Jag, it’s like a watch. Certain watches, everyone has, but there are certain watches only a few people know about. \"The Jag is a car that only certain people know about. \"It used to be that it was a car for the established man, who’d been in the game for years and treated himself to a Jag, but now they’re crossing right the way across the board. \"And I’m lucky enough to have one that they’ve kept classy but added a few sports touches to.\" Most recently, AJ has been seen driving around Central London in this stylish Audi. It's the highest spec the German manufacturer produces. The motor features a powerful 2.0 litre turbocharged engine with Quattro all-wheel drive and an S Tronic automatic gearbox. It's a very comfortable ride. However, AJ reportedly has a chauffeur who drives him - so he may not know! One thing we know about AJ is he loves his mum. When he had enough riches, and she was desperately in need of a new car, he happily obliged by gifting her a Range Rover Sport. He said: \"I feel I’ve never had the time to focus on helping her, so when her car broke down, I was just like it’s that time – if I’m going to do anything I’ll sort her out with a nice car, and so I got that as a present. \"It’s nice for her to be in a car like that. She didn’t expect it and we surprised her, so it was a really good time for her.\"","pubDate":"2023-12-19 13:20:47","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/GETTY_Day-Of-Reckoning-Media-Day-In-Riyadh_SPO_GYI1858324190jpg-JS867167918.jpg?strip=all&w=960","source_id":"thesun","source_priority":1813,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"92b8a1592544282552e333411e36dcaa","title":"Man City Premier League title chances 'drop 50 percent' as Arsenal and Liverpool benefit","link":"https://www.mirror.co.uk/sport/football/news/man-city-premier-league-title-31707600","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"Manchester City have won just one of their last six games, allowing Arsenal and Liverpool to pull away in the race to win the Premier League title heading into the festive period","content":"Manchester City's recent poor form has since their chances of winning the Premier League drop by more than 50 percent, according to a new supercomputer. The reigning champions have won just one of their last six games in the top-flight, throwing away a two goal lead in a draw with Crystal Palace at the weekend. They have also drawn with Chelsea , Liverpool and Tottenham , as well as losing to Aston Villa. During their difficult period, Arsenal , Liverpool and Villa have been able to pull away, with City now five points adrift of top spot. At the start of the season, City had been given a 90.2 percent chance of retaining their title for a fourth successive time by Opta. Jamie Carragher doubles down on Liverpool league title prediction as Gary Neville agrees Man City star Bernardo Silva warns bosses that players are at breaking point Their chances have plummeted now though, with Opta giving them a 39.3 percent chance of winning the league, a drop of 50.9 percent from the start of the season. The draw with Palace saw their odds plummet by 8.5 percent, though they are still the favourites. Arsenal are rated as their closest rivals, with the Gunners' lead at the top of the table standing at one point ahead of Liverpool heading into the festive period. Mikel Arteta's men are given a 29.9 percent chance of winning their first title in 20 years by Opta, an increase of 25.8 percent from pre-season. Liverpool have launched somewhat of a surprise title challenge, though their hopes are down at 23.6 percent. Despite their bore draw with Manchester United , their chances have flown up, having been rated as just 3.5 percent favourites before the campaign. HAVE YOUR SAY! Who will win the Premier League title? Comment below . A draw with Crystal Palace has sent Manchester City's chances of winning the title plummeting ( Image: Shaun Botterill/Getty Images) Talking of surprises, Aston Villa have come from nowhere to put themselves firmly in the title conversation. They are now rated as the fourth-most likely team to win the league, though they are still down at 6.8 percent. City have a short break from league action while they take part in the Club World Cup. And former Newcastle star Alan Shearer believes they can recover from their poor form to have say in the title race. \"Compared with the high standards they set themselves, City have hit a sticky patch. It just shows you that, even if you are as great as they are, when games are tight at the finish then uncertainty can creep in when you are on a run where you are not winning,\" he told BBC Sport. \"They are just not used to that, because they have had things very much their own way for such a long time. Their points total is the lowest at this stage of the season since Pep Guardiola took charge in 2016, which is a concern. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here \"And if they are going to win the title again then it looks like they will have to do it in a different way to the years where they have been the dominant team. Even so, it would be foolish to write them off, because they are far too good for that. \"They will have ground to make up when they get back from the Club World Cup, but I still expect them to go on one of their long winning runs. They have got Erling Haaland and Kevin de Bruyne to come back into the team, of course they are going to figure in the title race.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-12-19 13:17:12","image_url":"https://i2-prod.mirror.co.uk/incoming/article31707614.ece/ALTERNATES/s615/0_GettyImages-1860043673.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"160183f2e2314cc79b0ce98b25ef200b","title":"Danladi canvasses support for Nasarawa United, Lobi Stars","link":"https://dailypost.ng/2023/12/19/danladi-canvasses-support-for-nasarawa-united-lobi-stars/","keywords":["Sport","Danladi","Lobi Stars","Nasarawa United"],"creator":["Taiwo Adesanya"],"video_url":null,"description":"The Nasarawa State government has called for improved support for both Nasarawa United and Lobi Stars. The permanent secretary of the Ministry of Youth and Sports Development, Barrister Isaac Danladi commended the Jibrin Ali Baggio-led Supporters’ Club for their unwavering support to players and management of the Solid Miners, urging them to sustain the tempo […] Danladi canvasses support for Nasarawa United, Lobi Stars","content":"Daily Post Nigeria Danladi canvasses support for Nasarawa United, Lobi Stars Home News Politics Metro Entertainment Sport Sport Danladi canvasses support for Nasarawa United, Lobi Stars Published on December 19, 2023 By Taiwo Adesanya The Nasarawa State government has called for improved support for both Nasarawa United and Lobi Stars. The permanent secretary of the Ministry of Youth and Sports Development, Barrister Isaac Danladi commended the Jibrin Ali Baggio-led Supporters’ Club for their unwavering support to players and management of the Solid Miners, urging them to sustain the tempo until the club returns to the top-flight. Danladi also urged members of the supporters’ club to continue with the support they accord NPFL side, Lobi Stars, who have adopted the Lafia City Stadium as their home ground this season. He, however, frowned at the division in the support that occurred in the matchday 14 game between Lobi Stars versus Doma United. Danladi said the incident was an indication that there was a crack in the leadership of the supporters’ club which almost marred the support for Lobi Stars. “Ab initio, the rationale behind Lobi Stars adopting the Lafia City Stadium as their alternative home ground for the 2023/24 NPFL Season followed an extensive camaraderie between Governor Abdullahi Sule and his Benue State counterpart, His Excellency, Governor Hyacinth Iormem Alia, and the shared brotherhood between Nasarawa and Benue States,” he stated during a meeting with the supporters club. “Also, I have enjoyed a healthy working relationship with the Vice Chairman and CEO of Lobi Stars, Dominic Iorfa, and it’s the utmost expectation of the Nasarawa State Government and people and the Government and people of Benue State to see both Nasarawa United gain promotion back to the premier league and Lobi Stars win the league title, respectively, and play continental football at their make-shift home ground as it would both be to our collective benefits. “Therefore, we are calling on the leadership of the Supporters’ Club to control her members in order not to foment any problems capable of disuniting the fraternity or bringing the league to disrepute as Nasarawa State is known for peace, hospitality and harmonious co-existence, irrespective of any differences.” Related Topics: Danladi Lobi Stars Nasarawa United Don't Miss Sacked Bolus to take legal action against Katsina United You may like Lobi Stars coach Agabe happy with team’s resilience in Doma United’s win Lobi Stars appoint U-17 management team Adams upbeat Nasarawa United will beat Yobe Stars in NNL fixture Doma United get Aliyu, Abdullahi boost ahead of Lobi Stars clash Agagbe rues Lobi Stars defeat to Akwa United El-Kanemi Warriors defeat won’t derail Nasarawa United’s promotion bid – Adams Advertise About Us Contact Us Privacy-Policy Terms Copyright © Daily Post Media Ltd","pubDate":"2023-12-19 13:16:03","image_url":"https://dailypost.ng/wp-content/uploads/2023/10/Nasarawa-United.jpg","source_id":"dailypost","source_priority":55306,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"cedbc57e2dac7ca47594e73ba7fd754c","title":"La Liga to make referee and VAR communications public","link":"https://www.barcablaugranes.com/2023/12/19/24007634/la-liga-to-make-referee-and-var-communications-public-from-january","keywords":null,"creator":["",""],"video_url":null,"description":null,"content":"La Liga confirmed on Tuesday that referee and VAR communications will be made public from January. The new initiative will be implemented initially in the Spanish Super Cup and will then be implemented in La Liga from matchday 20. “The RFEF and LaLiga have agreed to start publishing the images and audio of the conversations between the on-field referee and the VAR officials following a VAR review and the use of the pitchside monitor. These will be released exclusively through the official media channels and only after the end of the matchday. “This initiative marks a new level of collaboration and joint work between the RFEF and the CTA and LaLiga, with the aim of making refereeing in professional football and the competitions themselves more transparent. “In this sense, with the broadcasting of the images and audios after the end of each competition day (Saturday, Sunday and Monday), the fans’ experience will be improved and a better understanding of the refereeing decisions will be appreciated by the viewers, thus improving the competitions as a whole.” The move comes after a season where there’s once again been plenty of controversy over refereeing decisions in the Spanish top flight.","pubDate":"2023-12-19 13:15:20","image_url":"https://cdn.vox-cdn.com/thumbor/TQDX8q_497Qi5iMu7CjdTIbYu88=/0x0:3189x2126/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/72978059/1612736491.0.jpg","source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"bdd55707a17cfa588a847aac12d0b7d6","title":"Manchester United winger Antony is becoming impossible to defend","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-winger-antony-becoming-28314744","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Steven Railston)"],"video_url":null,"description":"Antony has struggled in Manchester since signing from Ajax in 2022 and he's becoming increasingly difficult to defend.","content":"Sky Germany were criticised for mocking up an image of Jadon Sancho as 007 in a tuxedo alongside his statistics - no goals or assists in seven appearances - after he signed for Manchester United. Sancho had failed to hit the ground running following his move from Borussia Dortmund and the German media decided to poke fun at his disappointing start with a James Bond-themed joke. However, if those statistics looked bad, then Antony's record of no goals and assists in 18 appearances this season looks awful and he certainly does not have a licence to thrill. ALSO READ: Eriksen returns to training ALSO READ: Dan Gore's journey to United debut Antony endured a difficult first season after signing from Ajax, but he was given the benefit of the doubt after moving to a new environment and it was hoped he could progress in the new campaign. The 23-year-old has regressed instead and he's become indefensible for even the most partisan supporters due to his poor performances and failure to contribute in attacking scenarios. United privately conceded they overpaid for Antony when stumping up £86million and that gamble has backfired. They hoped he would become one of the best wingers in the world but that seems unlikely. Antony made a stellar first impression with three goals in his first few appearances against Arsenal, Manchester City and Everton, although even then, his performances were masked by finding the net. Naturally, scoring a goal decides how a player's performance is judged and he deserved credit for making a bright goal start, but the goals quickly dried up and the scrutiny heightened. While Antony can be a threat when cutting inside on his left foot, it didn't take long for defenders to do their homework and he's now arguably the most one-dimensional player in the Premier League. Remarkably, the season is about to reach Christmas and he's yet to record a goal or an assist. The calendar year of 2023 hasn't been kind and he's contributed just one league goal across the last 12 months. Antony looks worth a fraction of the fee paid for his signature and there's already talk of United cutting their losses because, despite a hint of a recent revival, he has failed to build on some encouraging signs. The Brazilian produced his best performance of the season against Galatasaray and he would have felt aggrieved to be dropped against Newcastle, but he's been poor since returning to the starting team. United fans have been waiting for Antony to burst into life and produce consistent displays but it's still yet to happen. It was the same situation with Sancho and it never happened for him. Paul Pogba, Antony, Harry Maguire, Romelu Lukaku and Sancho are the five most expensive signings in United's history and that highlights the club's horrendous record in the transfer market. United have been the worst buyers in football over the last decade and with Sir Jim Ratcliffe's arrival imminent, it's hoped Antony is the last player to grossly underperform after being signed for a multi-million-pound fee. Antony contributed just eight goals and four assists in his final season in the Eredivisie and considering the standard of the Netherlands' first division, that level of output didn't warrant the fee paid. Speaking in 2019, Ratcliffe famously described the singing of Fred for £50m as 'dumb money' and it would be interesting to get his thoughts on the £86m that was invested into Antony. It's probable Ratcliffe's language would be colourful and he's unlikely to go on record with that.","pubDate":"2023-12-19 13:15:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article28314934.ece/ALTERNATES/s615/0_GettyImages-1864401857.jpg","source_id":"manchestereveningnews","source_priority":6158,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"81e11c7a5932e79e27122f4b6ed9d275","title":"Η επιβάρυνση ελέω Ευρώπης και το αποτέλεσμα αυτής!","link":"https://www.gazzetta.gr/football/superleague/2286101/i-epibarynsi-eleo-eyropis-kai-apotelesma-aytis","keywords":["Ποδόσφαιρο","Superleague","Γιώργος Τσακίρης","ΑΕΚ","Ματίας Αλμέιδα","Γενς Γιόνσον","Τραυματισμός"],"creator":null,"video_url":null,"description":"Η κουβέντα για τις απουσίες της ΑΕΚ, οι περισσότερες από οποιαδήποτε άλλη ομάδα, είναι απόλυτα δικαιολογημένη και υπάρχει απόλυτα λογική αιτία να της συμβαίνει αυτό..","content":"Είναι γεγονός (και δικαιολογημένα συμβαίνει) πως έχει προκύψει μεγάλη και μπόλικη κουβέντα σχετικά με το πρόβλημα το οποίο ταλαιπωρεί την ΑΕΚ και δυσκολεύει το έργο της σε αγωνιστικό επίπεδο και αφορά τα ζητήματα τραυματισμών και απουσιών σε σημαντικά ματς, είτε για την Ευρώπη είτε για την Ελλάδα. Ειδικά στο τέλος των υποχρεώσεων στον απαιτητικό όμιλο που συμμετείχαν οι νταμπλούχοι για το Europa League , αποδείχτηκαν καθοριστικές οι απουσίες σημαντικών ποδοσφαιριστών ( Πινέδα , Αραούχο , Γιόνσον , Στάνκοβιτς , Πόνσε ), οι οποίοι εφόσον ήταν διαθέσιμοι -έστω στο τελευταίο ματς στο Άμστερνταμ με αντίπαλο τον Άγιαξ , είναι πολύ πιθανό να ήταν εντελώς διαφορετική η τύχη της και να υπήρχε ευρωπαϊκή συνέχεια, έστω μέσω της 3ης θέσης στον όμιλο του θανάτου! Ωστόσο για τον Δικέφαλο δεν προέκυψαν αγωνιστικά άσχημα αποτελέσματα μόνο στην Ευρώπη ελέω απουσιών. Η επιβάρυνση που προέκυψε από τα ευρωπαϊκά παιχνίδια σε μια ομάδα που αντικειμενικά ήταν (λόγω απουσίας από την κανονικότητά της) άπειρη σε επίπεδο ανταπόκρισης σε τρεις διοργανώσεις, προκάλεσε γκέλες και στις εγχώριες διοργανώσεις και πιο σωστά στο πρωτάθλημα. Σε οποιοδήποτε ματς στράβωσε για την ΑΕΚ υπήρχαν τεράστιας σημασίας και πολλές σε αριθμό απουσίες. Αποκορύφωμα ήταν το πιο πρόσφατο με αντίπαλο τον Παναιτωλικό όπου η Ένωση υποχρεώθηκε να παίξει στο Αγρίνιο δίχως επτά σημαντικούς ποδοσφαιριστές της... Απουσίες που δεν αφορούν αποκλειστικά την ενδεκάδα της αλλά και τη διαχείριση του εκάστοτε αγώνα. Για παράδειγμα στην γκέλα με τον Παναιτωλικό από τον πάγκο δεν υπήρχαν πολλοί πλην των Τσούμπερ και Γιόνσον για να 'ρθουν στον αγωνιστικό χώρο και να αλλάξουν πράγματα. Έλειπαν συνολικά επτά ποδοσφαιριστές! Δεν είναι δα και εύκολο για καμία ομάδα να ανταποκριθεί με τόσες απουσίες και προφανώς αυτό είναι κάτι που το αντιλαμβάνονται στην ΑΕΚ , ο ίδιος ο Ματίας Αλμέιδα και οι συνεργάτες του, αλλά και όλοι στο club. Γι' αυτό και περιμένουν πως και πως το 2024 όπου δεδομένα δεν γίνεται να έχει στην πορεία του έως την ολοκλήρωση της σεζόν τα ίδια προβλήματα απουσιών. Γιατί όμως συνέβη αυτό; Μα φυσικά και απλά από την επιβάρυνση της ομάδας από επιπλέον παιχνίδια στην Ευρώπη και σε αυτό το επίπεδο, με ομάδες που πρέπει να βγάλεις το 100% για να ανταποκριθείς, να ξεπεράσεις τα στάνταρ σου σε επίπεδα έντασης, φυσικής κατάστασης και δύναμης! Αυτό δεν γίνεται να το πετύχεις αναίμακτα. Η ΑΕΚ έως τώρα συγκριτικά με την περσινή σεζόν έχει δώσει ήδη τουλάχιστον δέκα περισσότερα ματς με ταξίδια και ότι αυτό συνεπάγεται. Δεδομένου ότι δεν άλλαξε τη δουλειά που έκανε και στον βαθμό έντασης που το έκανε και πέρυσι ο Αλμέιδα και το team του, αναμενόμενα και απόλυτα δικαιολογημένα, έχουμε αυτό το μεγάλο ζήτημα των τραυματιών! Είναι αν μη τι άλλο απόλυτη λογική η αιτία. Οι νταμπλούχοι έπαιξαν διπλές αναμετρήσεις με υψηλή απαίτηση αφού αντιμετώπισαν τη Ντινάμο Ζάγκρεμπ , την Αντβέρπ , όλα διπλές αναμετρήσεις και μάλιστα με τους Κροάτες ελέω δολοφονίας Μιχάλη σε πολύ σύντομο χρονικό διάστημα και ενώ ενδιάμεσα ξεκίνησε και το πρωτάθλημα. Ακολούθησαν τα ματς με Μπράιτον , Μαρσέιγ και Άγιαξ μέσα και έξω επίσης με αποτέλεσμα αυτή η επιβάρυνση και τα επιπλέον ματς συγκριτικά με πέρυσι να φέρουν τα ζητήματα τραυματισμών σε πρώτο πλάνο, διότι και πέρυσι είχε η ΑΕΚ , απλά λόγω του ματς ανά βδομάδα, ήταν λογικά και λιγότερες οι απουσίες ανά παιχνίδι και πιο γρήγορη η επιστροφή των κιτρινόμαυρων ποδοσφαιριστών, αλλά και όλων των ομάδων που δεν είχαν ευρωπαϊκές αναμετρήσεις. Τώρα σε ότι αφορά στην κουβέντα αν έπρεπε να ρίξει την ένταση και το ρυθμό αυτό το διάστημα ο Ματίας Αλμέιδα στις προπονήσεις, προφανώς και κάθε άποψη είναι αποδεκτή, αλλά αυτή που 'χει σημασία είναι στο τέλος εκείνη του Αργεντινού τεχνικού! Επίσης θα κριθεί στο τέλος της χρονιάς και όχι τώρα... Διότι στο επιχείρημα «μπορεί να μην είχαν βγει τόσοι πολλοί μαζί εκτός», υπάρχει και ο αντίλογος που αναφέρει «αλλά δεν θα μπορούσαμε να ανταποκριθούμε με μικρότερη και λιγότερη ένταση στα ματς αυτά και στη τεράστια απαίτηση απέναντι σε ομάδα Premier League και όχι μόνο». Το μόνο σίγουρο είναι ότι πρόκειται για κάτι υποθετικό στο οποίο ουσιαστικά απάντηση δεν υπάρχει που να δικαιώνει, ή να ακυρώνει την κάθε άποψη...","pubDate":"2023-12-19 13:30:00","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"c4b2a39a469f504c8257c408d98ee4f2","title":"Νότιγχαμ Φόρεστ: «Τελειώνει» ο Κούπερ και αναλαμβάνει ο Εσπίριτο Σάντο","link":"https://www.gazzetta.gr/football/premier-league/2286126/notigham-forest-teleionei-o-koyper-kai-analambanei-o-espirito-santo","keywords":["Ποδόσφαιρο","Premier League","Newsroom","Νότιγχαμ Φόρεστ"],"creator":null,"video_url":null,"description":"Μια ανάσα από τον Εσπίριτο Σάντο φέρεται να βρίσκεται η Νότιγχαμ Φόρεστ με τον Στιβ Κούπερ να αναμένεται να αποτελέσει παρελθόν μέσα στις επόμενες ώρες.","content":"Ραγδαίες οι εξελίξεις στο στρατόπεδο της Νότιγχαμ Φόρεστ. Όπως δείχνουν τα τελευταία γεγονότα, ο Νούνο Εσπίριτο Σάντο αναμένεται να αναλάβει την τεχνική ηγεσία των reds! Σύμφωνα με τον Φαμπρίτσιο Ρομάνο, ο Πορτογάλος τεχνικός τα έχει ήδη βρει σε όλα με τους ανθρώπους του αγγλικού συλλόγου και μάλιστα μέσα στις επόμενες ώρες θα βρεθεί στην Αγγλία προκειμένου να υπογράψει το συμβόλαιο του με την ομάδα. Ο Στιβ Κούπερ από την άλλη αναμένεται να αποτελέσει παρελθόν μέσα στις επόμενες ώρες και εφόσον δεν προκύψει κάποια μεγάλη ανατροπή, τότε ο Πορτογάλος θα είναι ο νέος προπονητής της Φόρεστ. O Πορτογάλος κόουτς αποχώρησε το Νοέμβριο από την Αλ Ιτιχάντ και φαίνεται πως βρίσκεται μια ανάσα από την επιστροφή του στην Premier League. Στο παρελθόν έχει κοουτσάρει Ρίο Άβε, Βαλένθια, Πόρτο, Γουβς , Τότεναμ , ενώ ήταν προπονητής τερματοφυλάκων σε Μάλαγα και Παναθηναϊκό .","pubDate":"2023-12-19 13:26:54","image_url":null,"source_id":"gazzetta_gr","source_priority":116059,"country":["greece"],"category":["sports"],"language":"greek"},{"article_id":"83999f5af9a7896b4c9d1308423527c9","title":"Panenkas and playing the panto villain: Ross Millen’s key role at Raith Rovers","link":"https://www.thecourier.co.uk/fp/sport/football/4844957/panenkas-and-playing-the-panto-villain-ross-millens-key-role-at-raith-rovers/","keywords":["Football","Raith Rovers FC","Ross Millen","Scottish Championship"],"creator":["Craig Cairns"],"video_url":null,"description":"The 29-year-old has become a popular figure amongst supporters.","content":"The sight of Ross Millen celebrating a last-ditch tackle as if it were a goal was the latest exploit to endear the Raith Rovers support to their colourful full-back. With the team 1-0 up in Saturday’s pivotal Scottish Championship clash at Tannadice deep into the second half, it felt a matter of time until Dundee United had ‘their chance’. It appeared to have fallen to , but as he was about to pull the trigger the out-stretched right leg of Millen hooked the ball to safety. Buoyed by the backing of a relieved and rapturous support, he stood up to punch the air in celebration. Millen explained to Courier Sport why relief also informed his response to the tackle: “Nae wonder because it was me that lost the ball at the start of it! “I played it short and Sam [Stanton] got it nicked off him. I was like ‘Aw naw…’. I was just glad to get back and help the boys out.” Millen was part of a trio of signings brought to the club by Ian Murray soon after the Raith boos took charge in the summer of 2022. Along with Scott Brown and , the 29-year-old right-back has gone on to establish himself as a key member of the starting XI. And like most in the squad, he has gone on to excel so far this season – his character standing out just as much as his on-field ability. That was encapsulated no better than when he capped off the most sensational comeback on this run – in – with an injury-time Panenka at Hampden. That was – at least the third club he has scored one for. He was booked as he searched for pieces of kit he’d torn off in the understandably wild celebrations. ‘Over-celebrating’ has been a slight issue and is part of why Millen sat out the win in Inverness through suspension. He has since picked up a yellow card after carrying Lewis Vaughan on his shoulder after the substitute . Again, it was a completely understandably wild celebration to befit another madcap ending to a game for this Rovers side. ‘Panto villain’ is a seasonably suitable term to describe the approach Millen sometimes takes to the game. After Stanton’s winner at East End Park, he put his fingers in his ears in front of the Dunfermline fans – a reference to Matty Todd after he netted the winning penalty on the opening day of the season. It’s all in good humour, though. Millen still and is greeted warmly by staff when he returns to East End Park. But right now it’s all about enjoying the moment at Raith, after they took a five-point lead at the top of the Championship. “It’s ,” adds Millen. “That breeds confidence and more wins. “But I know the other side, when you’re losing games and you can’t get that goal at times. You just really need to enjoy it while it comes. “It gives you confidence, but you’re only in December. We’ve loads of games to go. “There are going to be ups and downs – there will be downs to come at some point. It’s just how you deal with them.”","pubDate":"2023-12-19 13:26:18","image_url":"https://wpcluster.dctdigital.com/wp-content/uploads/sites/12/2023/12/Untitled-design-54-pxcni2r6-150x150.jpg","source_id":"thecourier","source_priority":241228,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"90e1189858d6b0fef994a9a1c0fb4671","title":"Liverpool legends unite for Christmas meal with some unrecognisable from playing days","link":"https://www.mirror.co.uk/sport/football/news/liverpool-legends-christmas-fowler-rush-31708039","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Mark Jones)"],"video_url":null,"description":"Reds legends gathered for a Christmas meal as they toasted their successes of the past, with Robbie Fowler sharing a team photo of the 13 former players","content":"Thirteen Liverpool legends linked up to celebrate Christmas as the Reds greats reminisced about their playing days - but how many can you remember? Liverpool icon Robbie Fowler shared a snap of the players enjoying Christmas dinner together on Monday, and while the man known affectionately as 'God' by Reds supporters was side by side with his 1990s team-mate Steve McManaman, you might need to be a fan of a certain age to recognise most of the other players in the Liverpool line-up. Players from the club's glory days of the 1970s and 80s make up most of the snap, with Fowler posting the caption: \"In good company. Absolute legends and top fellas\" with his picture. Roy Keane told to \"get a life\" as Liverpool icon wades in on Virgil van Dijk row Liverpool hatch clear January transfer plan after private talks between Jurgen Klopp and FSG Starting top left, it is former Reds midfielder Sammy Lee who is stood next to Phil Thompson, with both men serving on the coaching staff of the club after their successful playing days ended. Thompson, who also served as Liverpool's interim manager when Gerard Houllier was ill between 2001 and 2002, also enjoyed a successful career as a Sky Sports pundit before being axed in 2020 . Liverpool legends enjoyed a Christmas meal together on Monday ( Image: @Robbie9Fowler/Twitter) Next, moving clockwise along the top row, it is Liverpool's all-time appearance maker Ian Callaghan, now 81, who played a record 857 times for the Reds between 1960 and 1978. He is followed by Alan Kennedy, who scored the winning goal in 1981 European Cup final and the winning penalty in the shootout in the 1984 final. Then after Fowler and McManaman come 1980s legends John Aldridge and Steve McMahon. Moving to the bottom row, and heading left to right again, it is David Fairclough who is seated furthest left. The forward was known as 'Super Sub' during his career for his ability to score goals off the bench, and was a key part of the squad which won the European Cup in 1977. Phil Thompson (back row, second left), David Fairclough (middle row, third left), and Ian Callaghan (front row, second left) in a 1977 team photo ( Image: Bob Thomas Sports Photography via Getty Images) Liverpool's all-time top scorer Ian Rush comes next, and is seated next to Reds icon John Barnes, who was one of the best players in the world in the late 1980s and a star of the Reds side that dominated English football at the time. Next to Barnes is Howard Gayle, Liverpool's first ever black player who made a famous appearance in a European Cup semi-final against Bayern Munich in 1981 , and next to Gayle is David Hodgson, the Gateshead-born forward who won two league titles and the European Cup with the Reds between 1982 and 1984. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here The Liverpool legends line-up in full: Standing L-R - Sammy Lee, Phil Thompson, Ian Callaghan, Alan Kennedy, Robbie Fowler, Steve McManaman, John Aldridge, Steve McMahon. Sitting L-R - David Fairclough, Ian Rush, John Barnes, Howard Gayle, David Hodgson. Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-12-19 13:21:28","image_url":"https://i2-prod.mirror.co.uk/incoming/article31708255.ece/ALTERNATES/s615/0_Screenshot-2023-12-19-at-085448.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d68b49cef99d05988559c7cb7aa27f96","title":"Inside Anthony Joshua’s amazing car collection, from top-of-the range Range Rover to riding in a £600k Rolls-Royce limo","link":"https://www.thesun.ie/sport/11879558/anthony-joshua-car-collection-range-rover-rolls-royce/","keywords":["Boxing","Sport","Car collections","Longtail","Sport Features"],"creator":["Jon Boon"],"video_url":null,"description":null,"content":"ANTHONY Joshua is part of the sporting elite, having amassed a fortune through boxing. AJ, 34, is believed to be worth around £200million - thanks to a glittering career and savvy investments. The two-time former unified world heavyweight champion has spent his money wisely. And thanks to a sponsorship with Land Rover, his company cars are to die for. SunSport takes a look at what the legendary boxer has in his garage. The most impressive of his fleet is a top-of-the-range Range Rover that is worth £150,000. The one-of-a-kind customised SUV was presented to AJ ahead of his bout against Wladimir Klitschko in 2017. His high-performance Range Rover SVAutobiography Dynamic includes a number of special features just for the boxer, including door handles with unique boxing glove pattern surrounds, name-inscribed treadplates, a chrome B-pillar badge with AJ's signature, and a custom equipment storage unit for all Joshua's gear. The car also features diamond-quilted leather interior with Joshua's signature embossed in the headrest and aluminium letter box finishers on door cards engraved with his signature. We're cheating here, this one wasn't technically his. However, he did try to buy a stunning Rolls-Royce Phantom stretch limo, after he was taken for a ride in it in 2016. AJ hired the amazing motor when he attended an event in Staffordshire. And he was so impressed, he reportedly asked John Smith, the owner of Phantom Limo Hire, if he would sell it to him. Joshua also shared a snap on Instagram posing with the limo. He captioned the photo: \"Work... That’s all a brother’s working with.\" Everyone has to start somewhere. And Joshua's first car was a Vauxhall Astra that he saved up £1,500 to buy. In an interview he described the Astra as a \"'stable, sturdy, a good car.\" Still, given its size it's a mystery he was able to squeeze his 6ft5in frame into one in the first place. Although AJ has had some classy cars in his time, it's his XJR that has a special place in his heart. He told The Telegraph in 2016: \"When I pull up in a Jag, it’s like a watch. Certain watches, everyone has, but there are certain watches only a few people know about. \"The Jag is a car that only certain people know about. \"It used to be that it was a car for the established man, who’d been in the game for years and treated himself to a Jag, but now they’re crossing right the way across the board. \"And I’m lucky enough to have one that they’ve kept classy but added a few sports touches to.\" Most recently, AJ has been seen driving around Central London in this stylish Audi. It's the highest spec the German manufacturer produces. The motor features a powerful 2.0 litre turbocharged engine with Quattro all-wheel drive and an S Tronic automatic gearbox. It's a very comfortable ride. However, AJ reportedly has a chauffeur who drives him - so he may not know! One thing we know about AJ is he loves his mum. When he had enough riches, and she was desperately in need of a new car, he happily obliged by gifting her a Range Rover Sport. He said: \"I feel I’ve never had the time to focus on helping her, so when her car broke down, I was just like it’s that time – if I’m going to do anything I’ll sort her out with a nice car, and so I got that as a present. \"It’s nice for her to be in a car like that. She didn’t expect it and we surprised her, so it was a really good time for her.\"","pubDate":"2023-12-19 13:20:47","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/GETTY_Day-Of-Reckoning-Media-Day-In-Riyadh_SPO_GYI1858324190jpg-JS867167918.jpg?strip=all&w=960","source_id":"thesun_ie","source_priority":45285,"country":["ireland"],"category":["sports"],"language":"english"},{"article_id":"b5d66dbd14be405c4f71160bf1ee499a","title":"Inside Anthony Joshua’s amazing car collection, from top-of-the range Range Rover to riding in a £600k Rolls-Royce limo","link":"https://www.thesun.co.uk/sport/25100550/anthony-joshua-car-collection-range-rover-rolls-royce/","keywords":["Boxing","Sport","Car collections","Longtail","Sport Features"],"creator":["Jon Boon"],"video_url":null,"description":null,"content":"ANTHONY Joshua is part of the sporting elite, having amassed a fortune through boxing. AJ , 34, is believed to be worth around £200million - thanks to a glittering career and savvy investments. The two-time former unified world heavyweight champion has spent his money wisely. And thanks to a sponsorship with Land Rover , his company cars are to die for. SunSport takes a look at what the legendary boxer has in his garage. The most impressive of his fleet is a top-of-the-range Range Rover that is worth £150,000. The one-of-a-kind customised SUV was presented to AJ ahead of his bout against Wladimir Klitschko in 2017. His high-performance Range Rover SVAutobiography Dynamic includes a number of special features just for the boxer, including door handles with unique boxing glove pattern surrounds, name-inscribed treadplates, a chrome B-pillar badge with AJ's signature, and a custom equipment storage unit for all Joshua's gear. The car also features diamond-quilted leather interior with Joshua's signature embossed in the headrest and aluminium letter box finishers on door cards engraved with his signature. We're cheating here, this one wasn't technically his. However, he did try to buy a stunning Rolls-Royce Phantom stretch limo, after he was taken for a ride in it in 2016. AJ hired the amazing motor when he attended an event in Staffordshire. And he was so impressed, he reportedly asked John Smith, the owner of Phantom Limo Hire, if he would sell it to him. Joshua also shared a snap on Instagram posing with the limo. He captioned the photo: \"Work... That’s all a brother’s working with.\" Everyone has to start somewhere. And Joshua's first car was a Vauxhall Astra that he saved up £1,500 to buy. In an interview he described the Astra as a \"'stable, sturdy, a good car.\" Still, given its size it's a mystery he was able to squeeze his 6ft5in frame into one in the first place. Although AJ has had some classy cars in his time, it's his XJR that has a special place in his heart. He told The Telegraph in 2016: \"When I pull up in a Jag, it’s like a watch. Certain watches, everyone has, but there are certain watches only a few people know about. \"The Jag is a car that only certain people know about. \"It used to be that it was a car for the established man, who’d been in the game for years and treated himself to a Jag, but now they’re crossing right the way across the board. \"And I’m lucky enough to have one that they’ve kept classy but added a few sports touches to.\" Most recently, AJ has been seen driving around Central London in this stylish Audi. It's the highest spec the German manufacturer produces. The motor features a powerful 2.0 litre turbocharged engine with Quattro all-wheel drive and an S Tronic automatic gearbox. It's a very comfortable ride. However, AJ reportedly has a chauffeur who drives him - so he may not know! One thing we know about AJ is he loves his mum. When he had enough riches, and she was desperately in need of a new car, he happily obliged by gifting her a Range Rover Sport. He said: \"I feel I’ve never had the time to focus on helping her, so when her car broke down, I was just like it’s that time – if I’m going to do anything I’ll sort her out with a nice car, and so I got that as a present. \"It’s nice for her to be in a car like that. She didn’t expect it and we surprised her, so it was a really good time for her.\"","pubDate":"2023-12-19 13:20:47","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/12/GETTY_Day-Of-Reckoning-Media-Day-In-Riyadh_SPO_GYI1858324190jpg-JS867167918.jpg?strip=all&w=960","source_id":"thesun","source_priority":1813,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"92b8a1592544282552e333411e36dcaa","title":"Man City Premier League title chances 'drop 50 percent' as Arsenal and Liverpool benefit","link":"https://www.mirror.co.uk/sport/football/news/man-city-premier-league-title-31707600","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Jacob Leeks)"],"video_url":null,"description":"Manchester City have won just one of their last six games, allowing Arsenal and Liverpool to pull away in the race to win the Premier League title heading into the festive period","content":"Manchester City's recent poor form has since their chances of winning the Premier League drop by more than 50 percent, according to a new supercomputer. The reigning champions have won just one of their last six games in the top-flight, throwing away a two goal lead in a draw with Crystal Palace at the weekend. They have also drawn with Chelsea , Liverpool and Tottenham , as well as losing to Aston Villa. During their difficult period, Arsenal , Liverpool and Villa have been able to pull away, with City now five points adrift of top spot. At the start of the season, City had been given a 90.2 percent chance of retaining their title for a fourth successive time by Opta. Jamie Carragher doubles down on Liverpool league title prediction as Gary Neville agrees Man City star Bernardo Silva warns bosses that players are at breaking point Their chances have plummeted now though, with Opta giving them a 39.3 percent chance of winning the league, a drop of 50.9 percent from the start of the season. The draw with Palace saw their odds plummet by 8.5 percent, though they are still the favourites. Arsenal are rated as their closest rivals, with the Gunners' lead at the top of the table standing at one point ahead of Liverpool heading into the festive period. Mikel Arteta's men are given a 29.9 percent chance of winning their first title in 20 years by Opta, an increase of 25.8 percent from pre-season. Liverpool have launched somewhat of a surprise title challenge, though their hopes are down at 23.6 percent. Despite their bore draw with Manchester United , their chances have flown up, having been rated as just 3.5 percent favourites before the campaign. HAVE YOUR SAY! Who will win the Premier League title? Comment below . A draw with Crystal Palace has sent Manchester City's chances of winning the title plummeting ( Image: Shaun Botterill/Getty Images) Talking of surprises, Aston Villa have come from nowhere to put themselves firmly in the title conversation. They are now rated as the fourth-most likely team to win the league, though they are still down at 6.8 percent. City have a short break from league action while they take part in the Club World Cup. And former Newcastle star Alan Shearer believes they can recover from their poor form to have say in the title race. \"Compared with the high standards they set themselves, City have hit a sticky patch. It just shows you that, even if you are as great as they are, when games are tight at the finish then uncertainty can creep in when you are on a run where you are not winning,\" he told BBC Sport. \"They are just not used to that, because they have had things very much their own way for such a long time. Their points total is the lowest at this stage of the season since Pep Guardiola took charge in 2016, which is a concern. This article contains affiliate links, we will receive a commission on any sales we generate from it. Learn more Watch the Premier League, Champions League and more Watch the Premier League, Champions League, Europa League and much more £29.99 a month and get access to discovery+ Premium at no extra cost TNT Sports gives you access to games across the Premier League, Champions League, Europa League, Serie A and many more. You can also watch the biggest clashes in boxing, UFC, WWE and the get exclusive action from MLB all for one payment every month. You can watch TNT Sports through BT, EE, Sky, and Virgin Media. TNT Sports Get it here \"And if they are going to win the title again then it looks like they will have to do it in a different way to the years where they have been the dominant team. Even so, it would be foolish to write them off, because they are far too good for that. \"They will have ground to make up when they get back from the Club World Cup, but I still expect them to go on one of their long winning runs. They have got Erling Haaland and Kevin de Bruyne to come back into the team, of course they are going to figure in the title race.\" Join our new WhatsApp community! Click this link to receive your daily dose of Mirror Football content. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.","pubDate":"2023-12-19 13:17:12","image_url":"https://i2-prod.mirror.co.uk/incoming/article31707614.ece/ALTERNATES/s615/0_GettyImages-1860043673.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"160183f2e2314cc79b0ce98b25ef200b","title":"Danladi canvasses support for Nasarawa United, Lobi Stars","link":"https://dailypost.ng/2023/12/19/danladi-canvasses-support-for-nasarawa-united-lobi-stars/","keywords":["Sport","Danladi","Lobi Stars","Nasarawa United"],"creator":["Taiwo Adesanya"],"video_url":null,"description":"The Nasarawa State government has called for improved support for both Nasarawa United and Lobi Stars. The permanent secretary of the Ministry of Youth and Sports Development, Barrister Isaac Danladi commended the Jibrin Ali Baggio-led Supporters’ Club for their unwavering support to players and management of the Solid Miners, urging them to sustain the tempo […] Danladi canvasses support for Nasarawa United, Lobi Stars","content":"Daily Post Nigeria Danladi canvasses support for Nasarawa United, Lobi Stars Home News Politics Metro Entertainment Sport Sport Danladi canvasses support for Nasarawa United, Lobi Stars Published on December 19, 2023 By Taiwo Adesanya The Nasarawa State government has called for improved support for both Nasarawa United and Lobi Stars. The permanent secretary of the Ministry of Youth and Sports Development, Barrister Isaac Danladi commended the Jibrin Ali Baggio-led Supporters’ Club for their unwavering support to players and management of the Solid Miners, urging them to sustain the tempo until the club returns to the top-flight. Danladi also urged members of the supporters’ club to continue with the support they accord NPFL side, Lobi Stars, who have adopted the Lafia City Stadium as their home ground this season. He, however, frowned at the division in the support that occurred in the matchday 14 game between Lobi Stars versus Doma United. Danladi said the incident was an indication that there was a crack in the leadership of the supporters’ club which almost marred the support for Lobi Stars. “Ab initio, the rationale behind Lobi Stars adopting the Lafia City Stadium as their alternative home ground for the 2023/24 NPFL Season followed an extensive camaraderie between Governor Abdullahi Sule and his Benue State counterpart, His Excellency, Governor Hyacinth Iormem Alia, and the shared brotherhood between Nasarawa and Benue States,” he stated during a meeting with the supporters club. “Also, I have enjoyed a healthy working relationship with the Vice Chairman and CEO of Lobi Stars, Dominic Iorfa, and it’s the utmost expectation of the Nasarawa State Government and people and the Government and people of Benue State to see both Nasarawa United gain promotion back to the premier league and Lobi Stars win the league title, respectively, and play continental football at their make-shift home ground as it would both be to our collective benefits. “Therefore, we are calling on the leadership of the Supporters’ Club to control her members in order not to foment any problems capable of disuniting the fraternity or bringing the league to disrepute as Nasarawa State is known for peace, hospitality and harmonious co-existence, irrespective of any differences.” Related Topics: Danladi Lobi Stars Nasarawa United Don't Miss Sacked Bolus to take legal action against Katsina United You may like Lobi Stars coach Agabe happy with team’s resilience in Doma United’s win Lobi Stars appoint U-17 management team Adams upbeat Nasarawa United will beat Yobe Stars in NNL fixture Doma United get Aliyu, Abdullahi boost ahead of Lobi Stars clash Agagbe rues Lobi Stars defeat to Akwa United El-Kanemi Warriors defeat won’t derail Nasarawa United’s promotion bid – Adams Advertise About Us Contact Us Privacy-Policy Terms Copyright © Daily Post Media Ltd","pubDate":"2023-12-19 13:16:03","image_url":"https://dailypost.ng/wp-content/uploads/2023/10/Nasarawa-United.jpg","source_id":"dailypost","source_priority":55306,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"cedbc57e2dac7ca47594e73ba7fd754c","title":"La Liga to make referee and VAR communications public","link":"https://www.barcablaugranes.com/2023/12/19/24007634/la-liga-to-make-referee-and-var-communications-public-from-january","keywords":null,"creator":["",""],"video_url":null,"description":null,"content":"La Liga confirmed on Tuesday that referee and VAR communications will be made public from January. The new initiative will be implemented initially in the Spanish Super Cup and will then be implemented in La Liga from matchday 20. “The RFEF and LaLiga have agreed to start publishing the images and audio of the conversations between the on-field referee and the VAR officials following a VAR review and the use of the pitchside monitor. These will be released exclusively through the official media channels and only after the end of the matchday. “This initiative marks a new level of collaboration and joint work between the RFEF and the CTA and LaLiga, with the aim of making refereeing in professional football and the competitions themselves more transparent. “In this sense, with the broadcasting of the images and audios after the end of each competition day (Saturday, Sunday and Monday), the fans’ experience will be improved and a better understanding of the refereeing decisions will be appreciated by the viewers, thus improving the competitions as a whole.” The move comes after a season where there’s once again been plenty of controversy over refereeing decisions in the Spanish top flight.","pubDate":"2023-12-19 13:15:20","image_url":"https://cdn.vox-cdn.com/thumbor/TQDX8q_497Qi5iMu7CjdTIbYu88=/0x0:3189x2126/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/72978059/1612736491.0.jpg","source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"bdd55707a17cfa588a847aac12d0b7d6","title":"Manchester United winger Antony is becoming impossible to defend","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-winger-antony-becoming-28314744","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Steven Railston)"],"video_url":null,"description":"Antony has struggled in Manchester since signing from Ajax in 2022 and he's becoming increasingly difficult to defend.","content":"Sky Germany were criticised for mocking up an image of Jadon Sancho as 007 in a tuxedo alongside his statistics - no goals or assists in seven appearances - after he signed for Manchester United. Sancho had failed to hit the ground running following his move from Borussia Dortmund and the German media decided to poke fun at his disappointing start with a James Bond-themed joke. However, if those statistics looked bad, then Antony's record of no goals and assists in 18 appearances this season looks awful and he certainly does not have a licence to thrill. ALSO READ: Eriksen returns to training ALSO READ: Dan Gore's journey to United debut Antony endured a difficult first season after signing from Ajax, but he was given the benefit of the doubt after moving to a new environment and it was hoped he could progress in the new campaign. The 23-year-old has regressed instead and he's become indefensible for even the most partisan supporters due to his poor performances and failure to contribute in attacking scenarios. United privately conceded they overpaid for Antony when stumping up £86million and that gamble has backfired. They hoped he would become one of the best wingers in the world but that seems unlikely. Antony made a stellar first impression with three goals in his first few appearances against Arsenal, Manchester City and Everton, although even then, his performances were masked by finding the net. Naturally, scoring a goal decides how a player's performance is judged and he deserved credit for making a bright goal start, but the goals quickly dried up and the scrutiny heightened. While Antony can be a threat when cutting inside on his left foot, it didn't take long for defenders to do their homework and he's now arguably the most one-dimensional player in the Premier League. Remarkably, the season is about to reach Christmas and he's yet to record a goal or an assist. The calendar year of 2023 hasn't been kind and he's contributed just one league goal across the last 12 months. Antony looks worth a fraction of the fee paid for his signature and there's already talk of United cutting their losses because, despite a hint of a recent revival, he has failed to build on some encouraging signs. The Brazilian produced his best performance of the season against Galatasaray and he would have felt aggrieved to be dropped against Newcastle, but he's been poor since returning to the starting team. United fans have been waiting for Antony to burst into life and produce consistent displays but it's still yet to happen. It was the same situation with Sancho and it never happened for him. Paul Pogba, Antony, Harry Maguire, Romelu Lukaku and Sancho are the five most expensive signings in United's history and that highlights the club's horrendous record in the transfer market. United have been the worst buyers in football over the last decade and with Sir Jim Ratcliffe's arrival imminent, it's hoped Antony is the last player to grossly underperform after being signed for a multi-million-pound fee. Antony contributed just eight goals and four assists in his final season in the Eredivisie and considering the standard of the Netherlands' first division, that level of output didn't warrant the fee paid. Speaking in 2019, Ratcliffe famously described the singing of Fred for £50m as 'dumb money' and it would be interesting to get his thoughts on the £86m that was invested into Antony. It's probable Ratcliffe's language would be colourful and he's unlikely to go on record with that.","pubDate":"2023-12-19 13:15:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/sport/football/article28314934.ece/ALTERNATES/s615/0_GettyImages-1864401857.jpg","source_id":"manchestereveningnews","source_priority":6158,"country":["united kingdom"],"category":["sports"],"language":"english"}]}