{"newsArray":[{"title":"Alessia Russo lifts lid on England's Euros win and World Cup hopes","link":"https://www.mirror.co.uk/sport/football/news/alessia-russo-england-euros-victory-29444939","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Beth Lindop)"],"video_url":null,"description":"Russo has established herself as a crucial part of Sarina Wiegman's squad and is likely to play a massive role when England travel to Australia and New Zealand for the World Cup","content":"Manchester United and England striker Alessia Russo believes the Lionesses' Euros win has helped to change \"a lot of people's opinions\" on women's football. Russo was an integral part of the squad that ended England's 56-year wait for a major trophy last summer, netting four goals in six games and the winning goal of the tournament for her stunning back-heel against Sweden. Now the 24-year-old has opened up on how her life has changed since that historic victory over Germany at Wembley. “During the tournament, we were so unaware of what was going on, on the outside…because we were so in the zone and focused on just football,\" she said in an interview with Woman’s Health UK ,. \"And then after the tournament, we came out and it was like coming out of the Big Brother house and everyone was like, ‘what you guys have done this summer is amazing’. France women's manager Corinne Diacre sacked as mutiny reaches 'point of no return' Final day of WSL season confirmed after Premier League clash concerns \"Hearing stories of people watching it at the pub or going with all their friends to sit in one of the viewing points and watch was really cool because I don't think we would have ever thought that women's football would have got to that point. We always hoped, and I think last summer changed a lot of people's opinions.” England will get the opportunity to surpass their Euros triumph when they travel to Australia and New Zealand for the Women's World Cup in July. The Lionesses are among the favourites to take home the most coveted prize in the women's game and are currently 29 games unbeaten under manager Sarina Wiegman . “For an athlete, the World Cup is the pinnacle,\" Russo said, looking ahead to the summer. \"FirstIy, obviously, I want to get selected and go into the squad. \"But then I'd just like to [have] the same kind of energy that we had at the Euros, be positive, relax and just enjoy every second of it.” Russo has also been in fine form for Manchester United ( Image: Getty Images) Russo is also enjoying another stellar season on the domestic stage, having notched eight goals in 13 league appearances for Manchester United so far this term. The 24-year-old - who was the subject of Arsenal 's world-record bid for a women's player in January - has been one of United's standout performers in a campaign where the Red Devils are battling it out with the likes of Chelsea and Arsenal for top spot in the WSL. Reflecting on what she does to prepare for a matchday, Russo said: “I listen to the same playlist every game day. And it's got the most variety mix on that ever. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. \"It's full of r&b, a bit of house music bit of country, it just bounces everywhere…Music has always been a part of my life but also my sport. And there's like a lot of songs that I can relate back to different moments in my career, whether it be a tournament or a game, or travelling…I'm also the DJ at training so I like to put different mixes on.” “Alessia Russo was speaking to the Women’s Health UK YouTube channel in an interview available now”","pubDate":"2023-03-13 17:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29447834.ece/ALTERNATES/s615/1_JS273724714.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Alan Shearer makes feelings clear on BBC bosses after Gary Lineker suspension lifted","link":"https://www.mirror.co.uk/sport/football/news/alan-shearer-bbc-gary-lineker-29448507","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Samuel Meade)"],"video_url":null,"description":"Alan Shearer was among those to snub the BBC at the weekend following the axe of Gary Lineker but the pundit has made his feelings clear following his colleague's return","content":"Alan Shearer has subtly made his feelings known regarding the influence of Gary Lineker and Match of the Day after the BBC's climbdown. The broadcaster's football coverage was thrown into turmoil over the weekend following Friday's decision to take Lineker off presenting the flagship show on Saturday night due to comments he made on social media. One by one, his colleagues joined him in stating they wouldn't participate as a result. Shearer was among the most high profile names to do so, alongside regular BBC pundit Ian Wright, but within 72 hours Lineker was reinstated after productive discussions with BBC bosses. The Premier League's all-time leading goalscorer has liked a tweet by Times journalist Henry Winter, who called on BBC chiefs to understand the influence of the famous highlights show. Piers Morgan calls Gary Lineker news a victory for free speech as he slams the BBC Gary Lineker won't host Saturday's Match of the Day highlights despite BBC return He tweeted: \"BBC bosses need to appreciate better how important Match of the Day is and what Gary Lineker brings to it. In an era of teams being more tactically sophisticated, the insight that Lineker & pundits bring is even more important. They spend hours watching games, then air analysis.\" Match of the Day aired without any analysis on Saturday as a greatly reduced show was forced to focus purely on the match highlights as they failed to fill its usual spots. Lineker has spoken after being reinstated and hailed the support shown by his colleagues. He tweeted: \"After a surreal few days, I’m delighted that we have navigated a way through this. I want to thank you all for the incredible support, particularly my colleagues at BBC Sport, for the remarkable show of solidarity. Football is a team game but their backing was overwhelming.\" Alan Shearer is a regular on Match of the Day ( Image: BBC) The former England international also added: \"I'd like to thank Tim Davie for his understanding during this difficult period. He has an almost impossible job keeping everybody happy, particularly in the area of impartiality. I am delighted that we'll continue to fight the good fight, together.\" Davie, the BBC's director general, has has spoken of the need to re-examine the social media guidelines imposed on the corporation's employees, who have to remain impartial, in the wake of the incident. \"I think people across the BBC, if you talk to them, are all very passionate about our standing as an impartial broadcaster. I want to fight for a BBC where we can have proper calm debate, facilitate free speech,\" he added. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:57:56","image_url":"https://i2-prod.dailystar.co.uk/incoming/article29254088.ece/ALTERNATES/s615/0_Alan-Shearer-lost-by-gameplan-of-under-pressure-Graham-Potters-10th-place-Chelsea.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Liverpool duo invest in local club after Jurgen Klopp's training ground demand","link":"https://www.mirror.co.uk/sport/football/news/liverpool-duo-invest-local-club-29448438","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alan Smith)"],"video_url":null,"description":"Jordan Henderson and James Milner have invested in a Cheshire padel club having been introduced to the sport by the manager, who has his own customised racket available for fans to purchase","content":"Jurgen Klopp became so enamoured with it during a trip to Tenerife that he told Liverpool to install a court at the training ground. Now, the influence of padel is wearing off on some of his players with Jordan Henderson and James Milner investing in a Cheshire club. The racket sport, considered the fastest growing in the world, is taking off across the country and footballers are among those who cannot get enough. It is a cross between tennis and squash, played on a 10m x 20m court that is fenced in and doubles are more common than singles. Balls are like tennis balls and the scoring system is the same but the rackets used are solid rather than strings. Football news LIVE - Arsenal photo theory emerges, Man Utd takeover latest, Liverpool stars slammed Virgil van Dijk branded \"overrated\" and told he \"can't lace\" Premier League duo's boots David Beckham , Lionel Messi and Paul Pogba are among those to be pictured in action but Klopp may be the most fanatic of them all. The Liverpool boss even has his own range of kit, made by Wilson. \"Padel is, besides football, the best game I've ever played,” he said when the range, which includes a customised racket, was launched. “I've only known it in the last five years or so, but since then, I'm really addicted to it. You make big steps in a short period of time. It's really fun to play.\" Klopp came across it during a training camp in Tenerife - the game began in Mexico before spreading to Spanish-speaking countries - and became hooked. Games at Melwood have become so competitive that assistant Pep Lijnders has previously joked that Klopp “walks around like Conor McGregor ” after winning a few games. Pep Lijnders ( Image: YouTube/This is Anfield) Henderson and Milner have stumped up cash for a stake in the Padel Club in Handforth. The Daily Mail reported that former Everton players Joleon Lescott and Gareth Barry have also invested. During their post-World Cup camp in Dubai, Mo Salah and Thiago Alcantara even got involved with a game against the coaches - but Klopp and Lijnders triumphed. Klopp, quoted by the club’s own media, said: \"The coaches, we play in our spare time – we love it, we just love the game and play it pretty much all the time. We have our average level. \"Mo saw us from time to time playing and wanted to play against us desperately, so we now gave him the chance to play. But I'm not sure he'll want to play again! \"That's not true actually – he asked all the time when we can play again. But it's a wonderful game, we love it. \"When you saw the pictures, it's obviously not high-intense at our level. There are levels where it's incredibly intense but we cannot play that. It was good fun.\"","pubDate":"2023-03-13 16:50:01","image_url":"https://i2-prod.mirror.co.uk/incoming/article29448511.ece/ALTERNATES/s615/0_GettyImages-1360431233.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Crystal Palace Women suspends three members of staff amid investigation","link":"https://www.mirror.co.uk/sport/football/news/crystal-palace-women-staff-suspended-29445733","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Press Association, Laura Hartley)"],"video_url":null,"description":"Crystal Palace Women have released a statement following the allegations and suspension of staff on its team","content":"Three members of staff at Crystal Palace Women have been suspended pending an investigation, it is understood. It is understood an investigation into the trio’s conduct is ongoing after a complaint was raised - but it isn't yet known who raised the complaint. A statement from Palace said: “Three members of staff at Palace Women have been suspended, pending an investigation. “We can’t comment further while it is ongoing.” The club are currently lying sixth in the Women's Championship","pubDate":"2023-03-13 16:33:17","image_url":"https://i2-prod.mirror.co.uk/incoming/article21164186.ece/ALTERNATES/s615/0_Crystal-Palace-v-West-Ham-United-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"\"Khi Tuchel bắt đầu có quyền lực, nó đã bị tước đi\"","link":"https://www.bongda.com.vn/khi-tuchel-bat-dau-co-quyen-luc-no-da-bi-tuoc-di-d676080.html","keywords":null,"creator":null,"video_url":null,"description":"Chuyên gia bóng đá Habib Beye lên tiếng nhận định về tình hình hiện tại của Gã Nhà giàu nước Pháp.","content":"Theo quan điểm đến từ Habib Beye, kế hoạch của không nên được xoay quanh các cầu thủ ngôi sao của câu lạc bộ. Mà thay vào đó, Gã Nhà giàu nước Pháp nên trao toàn bộ quyền lực cho vị thuyền trưởng của mình. Đồng thời, Beye còn lên tiếng chỉ trích PSG vì quyết định sa thải HLV Thomas Tuchel, khi chiến lược gia người Đức mới bắt đầu được trao quyền lực. GOAL France và PSG dẫn lời chuyên gia trực thuộc Canal Football Club: Tuchel lên ngôi vô địch không lâu sau khi bị PSG sa thải.","pubDate":"2023-03-13 16:21:31","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/03/09/tuchel-1122.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"بسبب رونالدو.. النصر يتفوق بعدد المتابعين على كبار أندية أوروبا","link":"https://mz-mz.net/1743432/","keywords":["الدوري السعودي"],"creator":["mzmz3"],"video_url":null,"description":"كشفت إحصائية لـ Football Benchmark، عن تأثير النجم البرتغالي كريستيانو رونالدو على النصر، بخصوص متابعي حسابات النادي على مواقع التواصل الاجتماعي. بسبب رونالدو.. النصر يتفوق بعدد المتابعين على كبار أندية أوروبا مزمز","content":"كشفت إحصائية لـ Football Benchmark، عن تأثير النجم البرتغالي كريستيانو رونالدو على النصر، بخصوص متابعي حسابات النادي على مواقع التواصل الاجتماعي. ومنذ التعاقد مع رونالدو انتزع النصر الصدارة بعدد متابعين بلغ 9.666.756 متابع جديد، فيما بلغ عدد متابعي ريال مدريد الجدد 8.835.600 متابع جديد. وفي المركز الثالث حل باريس سان جيرمان بعدد متابعين جدد بلغوا 8.748.335 آخر شهرين. المصدر: صحيفة صدى.","pubDate":"2023-03-13 16:21:29","image_url":null,"source_id":"mzmz","category":["sports"],"country":["saudi arabia"],"language":"arabic"},{"title":"Thái Lan được mời tham dự siêu giải đấu, có vinh dự so tài với ĐT Nga","link":"https://thethao247.vn/406-thai-lan-duoc-moi-tham-du-sieu-giai-dau-co-vinh-du-so-tai-voi-dt-nga-d281318.html","keywords":null,"creator":["Thethao247"],"video_url":null,"description":"Thái Lan cùng ĐT Nga nhận được lời mời tham dự giải vô địch Tây Á từ CAFA trong thời gian FIFA Days của tháng 6 tới.","content":"Thái Lan cùng ĐT Nga nhận được lời mời tham dự giải vô địch Tây Á từ CAFA trong thời gian FIFA Days của tháng 6 tới. Theo nguồn tin từ ASEAN Football, Hiệp hội Bóng đá Trung Á (CAFA) đang có kế hoạch tổ chức giải vô địch Trung Á 2023, diễn ra từ ngày 9 đến 21/6, trùng với thời gian FIFA Days của tháng 6. Trong đó giải đấu năm nay sẽ có sự xuất hiện của 2 khách mời rất đặc biệt không thuộc Trung Á. Khách mời đầu tiên được tiết lộ là ĐT Nga. Hiệp hội Bóng đá Trung Á được cho là có mối quan hệ rất tốt với LĐBĐ Nga. Đây cũng là thời điểm ĐT Nga đang bị cấm tham gia các giải đấu ở châu Âu. Tuy nhiên FIFA và UEFA vẫn đồng ý cho chủ nhà của World Cup 2018 tham dự các giải giao hữu. Khách mời thứ 2 của giải vô địch Trung Á 2023 được tiết lộ là 1 đại diện từ khu vực Đông Nam Á. Theo những thông tin mới nhất, Thái Lan chính là đội tuyển nhận được lời mời tham dự giải đấu này. Tuy nhiên việc \"Voi chiến\" có đồng ý nhận lời tham gia hay không thì chưa được xác thực. Nếu đúng như dự kiến, giải vô địch Trung Á 2023 sẽ có tổng cộng 8 đội tham dự, bao gồm 6 đội thuộc khu vực này là Tajikistan, Iran, Uzbekistan, Kyrgyzstan, Turkmenistan và Afghanistan, cùng với 2 đội khách mời là Thái Lan và Nga. Trong tháng 3, Nga cũng sẽ đá giao hữu với Iran và Iraq. Theo điều lệ của giải, 8 đội sẽ được chia đều vào 2 bảng. Dù có 4 đội 1 bảng nhưng sẽ chỉ lấy 1 đội đứng nhất bảng để chơi ở trận chung kết chứ sẽ không tổ chức bán kết như thường lệ. Như vậy mỗi đội tham dự sẽ có ít nhất 3 trận và tối đa 4 trận đấu tại giải vô địch Tây Á 2023. Trong tháng 3 tới, ĐT Thái Lan sẽ tới UAE để Trước đó Thái Lan cũng nhận được 1 lời mời tham dự giải đấu thuộc khu vực khác. Theo đó trong thời gian FIFA Days tháng 3, nhưng cuối cùng giải đấu lại hủy bỏ và khiến cho những kế hoạch của \"Voi chiến\" phải thay đổi gấp.","pubDate":"2023-03-13 16:19:00","image_url":null,"source_id":"thethao247","category":["sports"],"country":["Vietnam"],"language":"Vietnamese"},{"title":"Mikel Arteta's innovative plan behind dressing room photo after Arsenal theory emerges","link":"https://www.mirror.co.uk/sport/football/news/arsenal-clock-dressing-room-photo-29447647","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Samuel Meade)"],"video_url":null,"description":"Arsenal celebrated their win at Fulham with a dressing room photo that included the club's iconic clock as they attempt to bring home comforts on their away days","content":"Arsenal 's unique celebrations in the changing room with the iconic club clock are born out of a decision to make away days feel more homely, it has been revealed. The Gunners responded to Manchester City's win on Saturday night by securing the three points at Fulham on Sunday afternoon. It ensures they remain five points clear at the top, but questions were asked when the squad were pictured celebrating the win alongside the famous clock. It has now been reported by the Daily Mail that it is part of a plan within the squad to make away grounds feel more like the Emirates, where they have only lost once this term. Alongside the clock, pictures of the Arsenal badge and posters of the squad have also been utilised. Olivier Giroud reaches out to Folarin Balogun as Arsenal star lined up to replace him Mikel Arteta's immediate response to reaching a century of Arsenal wins says it all The iconic clock was part of the club's former ground, Highbury, for more than 70 years. 13 years ago a larger replica of the clock was installed at Emirates, with the original located outside the stadium in north London. Five of the team's remaining 11 league fixtures are away from home - with some particularly challenging games to come. Mikel Arteta's next assignment on the road will be at Liverpool in April - a ground they have not enjoyed themselves at in recent seasons. Losses at this stage, especially with City attempting to chase them down, could be crucial. Liverpool, despite their struggles this term, have only lost once at home in the league and are a difficult proposition at Anfield. The following week they make the short trip to West Ham . Arsenal posed for a dressing room picture with the club's iconic clock ( Image: zinchenko_96/Instagram) Arsenal must travel to City on April 26 in a game that could decide the destination of the title. The defending champions are the only team to win at the Emirates this term and have already beaten the Gunners on their own patch in the FA Cup . A trip to Newcastle , who are another side to enjoy a sensational home crowd, is still on their radar. The Magpies could well be fighting for a place in the top four, which would add to the magnitude of the team. St James' Park is also a venue Arsenal lost at last term. The last away game for the Gunners is the penultimate clash of the season when they will travel to Nottingham Forest , who could still be trying to avoid relegation. Arsenal made light work of Fulham on Sunday afternoon, securing a 3-0 win at Craven Cottage - scoring all three of their goals in the first-half. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:04:22","image_url":"https://i2-prod.mirror.co.uk/incoming/article29441470.ece/ALTERNATES/s615/0_Arsenal-take-dressing-room-selfie-with-title-countdown-clock-after-Fulham-win.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gary Lineker 'victory' not all as it seems amid BBC climbdown over Match of the Day row","link":"https://www.mirror.co.uk/sport/football/news/gary-lineker-bbc-row-return-29447939","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Andy Dunn)"],"video_url":null,"description":"Gary Lineker will return to his Match of the Day presenting duties after the BBC climbed down from suspending him following a row with Conservative party MPs","content":"So, the common consensus seems to be it is Gary Lineker 1 BBC 0, another victory for the former England striker, a climbdown from the Beeb. And to a certain extent, it is. There was certainly no apology from Lineker and, commendably, he reinforced his concern for the plight of refugees trying to seek safe asylum on these shores. A consummate broadcaster, his return to the BBC’s football coverage this coming weekend is good news. But while the BBC’s director-general, Tim Davie, was the one who was forced to be contrite, it is hard not to feel there will be some in the organisation - and in this government - who will reflect on Lineker’s one-game ban as a shot across his bows. Chris Sutton gets his wish after hitting out at \"messy\" Gary Lineker and BBC feud Gary Lineker won't host Saturday's Match of the Day highlights despite BBC return There is no doubting Lineker is a man of principle but don’t expect anything remotely controversial on his Twitter feed in the near future. And that is a shame. Over his long career in television, mainly with the BBC, Lineker has developed into a peerless presenter but he might have made an even better pundit. Because there is a difference. Lineker is a great communicator, with clear ideas, not to mention no little wit. He is a public figure and we should want to hear more of his views on a whole range of subjects, not less of them. He can send his views to millions and be an influence for good in society. HAVE YOUR SAY! Should Gary Lineker face any further action after his row with the BBC? Comment below . BBC director general Tim Davie ordered a climbdown after the weekend's chaos ( Image: Getty Images) Ironically, his words on Qatar at the beginning of the BBC’s World Cup coverage were perfectly pitched. One day, Lineker will have the freedom to publicly say what he wants, to publicise whatever political allegiances he might have. But not yet. Yes, this is a victory. Yes, it is Gary Lineker 1 BBC 0. But you suspect the game is far from over. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:01:59","image_url":"https://i2-prod.mirror.co.uk/incoming/article29448008.ece/ALTERNATES/s615/0_GettyImages-1473185968.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"„Red&Gold Football“ – Bayern und Los Angeles wollen künftig gemeinsam Talente entwickeln","link":"https://fcbinside.de/2023/03/13/redgold-football-bayern-und-los-angeles-wollen-kuenftig-gemeinsam-talente-entwickeln/","keywords":["FC Bayern News"],"creator":["Vjeko Keskic"],"video_url":null,"description":"Der FC Bayern hat in den vergangenen Jahren seine Internationalisierung stetig vorangetrieben. Vor allem in den USA sind die Münchner schon seit Jahren sehr aktiv. Wie der deutsche Rekordmeister am Montag bekannt gab, hat man nun einen weiteren Partner in der Major League Soccer gefunden. Nach der Partnerschaft mit dem FC Dallas, welche seit 2018 […] Der Beitrag „Red&Gold Football“ – Bayern und Los Angeles wollen künftig gemeinsam Talente entwickeln erschien zuerst auf Aktuelle FC Bayern News.","content":"Der FC Bayern hat in den vergangenen Jahren seine Internationalisierung stetig vorangetrieben. Vor allem in den USA sind die Münchner schon seit Jahren sehr aktiv. Wie der deutsche Rekordmeister am Montag bekannt gab, hat man nun einen weiteren Partner in der Major League Soccer gefunden. Nach der Partnerschaft mit dem FC Dallas, welche seit 2018 besteht, haben die Bayern nun eine weitere Kooperation mit dem amtierenden MLS-Meister Los Angeles FC abgeschlossen. Laut den Münchnern möchten beide Klubs künftig bei der Nachwuchsförderung zusammenarbeiten. Dazu wird eine gemeinsame Gesellschaft mit den Namen „Red&Gold Football“ gegründet. Das Joint Venture soll seinen Sitz in München haben. Ziel der Kooperation ist es internationale Talente für die eigenen Mannschaften und den Profifußball auszubilden. „Wir sehen in der Partnerschaft mit LAFC eine Chance“ Klubchef Oliver Kahn äußerte sich wie folgt zu der Kooperation: „Auf internationaler Ebene entwickelt sich der Fußball sehr dynamisch, das ist besonders auf dem Transfermarkt erkennbar. Wir sehen in der Partnerschaft mit LAFC eine Chance, den FC Bayern im sportlichen Wettbewerb mit den besten Vereinen Europas und der Bundesliga zu stärken.“ Laut dem 53-Jährigen ist die USA ein sehr spannender Markt für den FC Bayern: „Dass die Fußball-WM 2026 zu großen Teilen in den USA stattfindet, wo wir bereits mit einem Büro in New York vertreten sind, macht den Standort Los Angeles zusätzlich attraktiv. Ich erwarte einen Qualitäts- und Nachwuchsschub in der Major League Soccer, der sich positiv auf unsere Partnerschaft auswirkt.“ John Thorrington, Co-Präsident und General Manager des LAFC, freut sich ebenfalls auf die Partnerschaft: „Das ist ein wirklich besonderer Moment für LAFC. Eine Partnerschaft dieser Größenordnung ist der nächste Schritt in unserer Entwicklung als Club. Wir sind überzeugt, dass diese Zusammenarbeit unseren Spielern die Möglichkeit geben wird, ihr Potenzial zu maximieren und den Weg in unsere ersten Mannschaften zu finden.“","pubDate":"2023-03-13 15:59:42","image_url":null,"source_id":"fcbinside","category":["sports"],"country":["germany"],"language":"german"},{"title":"Alessia Russo lifts lid on England's Euros win and World Cup hopes","link":"https://www.mirror.co.uk/sport/football/news/alessia-russo-england-euros-victory-29444939","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Beth Lindop)"],"video_url":null,"description":"Russo has established herself as a crucial part of Sarina Wiegman's squad and is likely to play a massive role when England travel to Australia and New Zealand for the World Cup","content":"Manchester United and England striker Alessia Russo believes the Lionesses' Euros win has helped to change \"a lot of people's opinions\" on women's football. Russo was an integral part of the squad that ended England's 56-year wait for a major trophy last summer, netting four goals in six games and the winning goal of the tournament for her stunning back-heel against Sweden. Now the 24-year-old has opened up on how her life has changed since that historic victory over Germany at Wembley. “During the tournament, we were so unaware of what was going on, on the outside…because we were so in the zone and focused on just football,\" she said in an interview with Woman’s Health UK ,. \"And then after the tournament, we came out and it was like coming out of the Big Brother house and everyone was like, ‘what you guys have done this summer is amazing’. France women's manager Corinne Diacre sacked as mutiny reaches 'point of no return' Final day of WSL season confirmed after Premier League clash concerns \"Hearing stories of people watching it at the pub or going with all their friends to sit in one of the viewing points and watch was really cool because I don't think we would have ever thought that women's football would have got to that point. We always hoped, and I think last summer changed a lot of people's opinions.” England will get the opportunity to surpass their Euros triumph when they travel to Australia and New Zealand for the Women's World Cup in July. The Lionesses are among the favourites to take home the most coveted prize in the women's game and are currently 29 games unbeaten under manager Sarina Wiegman . “For an athlete, the World Cup is the pinnacle,\" Russo said, looking ahead to the summer. \"FirstIy, obviously, I want to get selected and go into the squad. \"But then I'd just like to [have] the same kind of energy that we had at the Euros, be positive, relax and just enjoy every second of it.” Russo has also been in fine form for Manchester United ( Image: Getty Images) Russo is also enjoying another stellar season on the domestic stage, having notched eight goals in 13 league appearances for Manchester United so far this term. The 24-year-old - who was the subject of Arsenal 's world-record bid for a women's player in January - has been one of United's standout performers in a campaign where the Red Devils are battling it out with the likes of Chelsea and Arsenal for top spot in the WSL. Reflecting on what she does to prepare for a matchday, Russo said: “I listen to the same playlist every game day. And it's got the most variety mix on that ever. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. \"It's full of r&b, a bit of house music bit of country, it just bounces everywhere…Music has always been a part of my life but also my sport. And there's like a lot of songs that I can relate back to different moments in my career, whether it be a tournament or a game, or travelling…I'm also the DJ at training so I like to put different mixes on.” “Alessia Russo was speaking to the Women’s Health UK YouTube channel in an interview available now”","pubDate":"2023-03-13 17:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29447834.ece/ALTERNATES/s615/1_JS273724714.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Alan Shearer makes feelings clear on BBC bosses after Gary Lineker suspension lifted","link":"https://www.mirror.co.uk/sport/football/news/alan-shearer-bbc-gary-lineker-29448507","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Samuel Meade)"],"video_url":null,"description":"Alan Shearer was among those to snub the BBC at the weekend following the axe of Gary Lineker but the pundit has made his feelings clear following his colleague's return","content":"Alan Shearer has subtly made his feelings known regarding the influence of Gary Lineker and Match of the Day after the BBC's climbdown. The broadcaster's football coverage was thrown into turmoil over the weekend following Friday's decision to take Lineker off presenting the flagship show on Saturday night due to comments he made on social media. One by one, his colleagues joined him in stating they wouldn't participate as a result. Shearer was among the most high profile names to do so, alongside regular BBC pundit Ian Wright, but within 72 hours Lineker was reinstated after productive discussions with BBC bosses. The Premier League's all-time leading goalscorer has liked a tweet by Times journalist Henry Winter, who called on BBC chiefs to understand the influence of the famous highlights show. Piers Morgan calls Gary Lineker news a victory for free speech as he slams the BBC Gary Lineker won't host Saturday's Match of the Day highlights despite BBC return He tweeted: \"BBC bosses need to appreciate better how important Match of the Day is and what Gary Lineker brings to it. In an era of teams being more tactically sophisticated, the insight that Lineker & pundits bring is even more important. They spend hours watching games, then air analysis.\" Match of the Day aired without any analysis on Saturday as a greatly reduced show was forced to focus purely on the match highlights as they failed to fill its usual spots. Lineker has spoken after being reinstated and hailed the support shown by his colleagues. He tweeted: \"After a surreal few days, I’m delighted that we have navigated a way through this. I want to thank you all for the incredible support, particularly my colleagues at BBC Sport, for the remarkable show of solidarity. Football is a team game but their backing was overwhelming.\" Alan Shearer is a regular on Match of the Day ( Image: BBC) The former England international also added: \"I'd like to thank Tim Davie for his understanding during this difficult period. He has an almost impossible job keeping everybody happy, particularly in the area of impartiality. I am delighted that we'll continue to fight the good fight, together.\" Davie, the BBC's director general, has has spoken of the need to re-examine the social media guidelines imposed on the corporation's employees, who have to remain impartial, in the wake of the incident. \"I think people across the BBC, if you talk to them, are all very passionate about our standing as an impartial broadcaster. I want to fight for a BBC where we can have proper calm debate, facilitate free speech,\" he added. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:57:56","image_url":"https://i2-prod.dailystar.co.uk/incoming/article29254088.ece/ALTERNATES/s615/0_Alan-Shearer-lost-by-gameplan-of-under-pressure-Graham-Potters-10th-place-Chelsea.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Liverpool duo invest in local club after Jurgen Klopp's training ground demand","link":"https://www.mirror.co.uk/sport/football/news/liverpool-duo-invest-local-club-29448438","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alan Smith)"],"video_url":null,"description":"Jordan Henderson and James Milner have invested in a Cheshire padel club having been introduced to the sport by the manager, who has his own customised racket available for fans to purchase","content":"Jurgen Klopp became so enamoured with it during a trip to Tenerife that he told Liverpool to install a court at the training ground. Now, the influence of padel is wearing off on some of his players with Jordan Henderson and James Milner investing in a Cheshire club. The racket sport, considered the fastest growing in the world, is taking off across the country and footballers are among those who cannot get enough. It is a cross between tennis and squash, played on a 10m x 20m court that is fenced in and doubles are more common than singles. Balls are like tennis balls and the scoring system is the same but the rackets used are solid rather than strings. Football news LIVE - Arsenal photo theory emerges, Man Utd takeover latest, Liverpool stars slammed Virgil van Dijk branded \"overrated\" and told he \"can't lace\" Premier League duo's boots David Beckham , Lionel Messi and Paul Pogba are among those to be pictured in action but Klopp may be the most fanatic of them all. The Liverpool boss even has his own range of kit, made by Wilson. \"Padel is, besides football, the best game I've ever played,” he said when the range, which includes a customised racket, was launched. “I've only known it in the last five years or so, but since then, I'm really addicted to it. You make big steps in a short period of time. It's really fun to play.\" Klopp came across it during a training camp in Tenerife - the game began in Mexico before spreading to Spanish-speaking countries - and became hooked. Games at Melwood have become so competitive that assistant Pep Lijnders has previously joked that Klopp “walks around like Conor McGregor ” after winning a few games. Pep Lijnders ( Image: YouTube/This is Anfield) Henderson and Milner have stumped up cash for a stake in the Padel Club in Handforth. The Daily Mail reported that former Everton players Joleon Lescott and Gareth Barry have also invested. During their post-World Cup camp in Dubai, Mo Salah and Thiago Alcantara even got involved with a game against the coaches - but Klopp and Lijnders triumphed. Klopp, quoted by the club’s own media, said: \"The coaches, we play in our spare time – we love it, we just love the game and play it pretty much all the time. We have our average level. \"Mo saw us from time to time playing and wanted to play against us desperately, so we now gave him the chance to play. But I'm not sure he'll want to play again! \"That's not true actually – he asked all the time when we can play again. But it's a wonderful game, we love it. \"When you saw the pictures, it's obviously not high-intense at our level. There are levels where it's incredibly intense but we cannot play that. It was good fun.\"","pubDate":"2023-03-13 16:50:01","image_url":"https://i2-prod.mirror.co.uk/incoming/article29448511.ece/ALTERNATES/s615/0_GettyImages-1360431233.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Crystal Palace Women suspends three members of staff amid investigation","link":"https://www.mirror.co.uk/sport/football/news/crystal-palace-women-staff-suspended-29445733","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Press Association, Laura Hartley)"],"video_url":null,"description":"Crystal Palace Women have released a statement following the allegations and suspension of staff on its team","content":"Three members of staff at Crystal Palace Women have been suspended pending an investigation, it is understood. It is understood an investigation into the trio’s conduct is ongoing after a complaint was raised - but it isn't yet known who raised the complaint. A statement from Palace said: “Three members of staff at Palace Women have been suspended, pending an investigation. “We can’t comment further while it is ongoing.” The club are currently lying sixth in the Women's Championship","pubDate":"2023-03-13 16:33:17","image_url":"https://i2-prod.mirror.co.uk/incoming/article21164186.ece/ALTERNATES/s615/0_Crystal-Palace-v-West-Ham-United-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"\"Khi Tuchel bắt đầu có quyền lực, nó đã bị tước đi\"","link":"https://www.bongda.com.vn/khi-tuchel-bat-dau-co-quyen-luc-no-da-bi-tuoc-di-d676080.html","keywords":null,"creator":null,"video_url":null,"description":"Chuyên gia bóng đá Habib Beye lên tiếng nhận định về tình hình hiện tại của Gã Nhà giàu nước Pháp.","content":"Theo quan điểm đến từ Habib Beye, kế hoạch của không nên được xoay quanh các cầu thủ ngôi sao của câu lạc bộ. Mà thay vào đó, Gã Nhà giàu nước Pháp nên trao toàn bộ quyền lực cho vị thuyền trưởng của mình. Đồng thời, Beye còn lên tiếng chỉ trích PSG vì quyết định sa thải HLV Thomas Tuchel, khi chiến lược gia người Đức mới bắt đầu được trao quyền lực. GOAL France và PSG dẫn lời chuyên gia trực thuộc Canal Football Club: Tuchel lên ngôi vô địch không lâu sau khi bị PSG sa thải.","pubDate":"2023-03-13 16:21:31","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/03/09/tuchel-1122.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"بسبب رونالدو.. النصر يتفوق بعدد المتابعين على كبار أندية أوروبا","link":"https://mz-mz.net/1743432/","keywords":["الدوري السعودي"],"creator":["mzmz3"],"video_url":null,"description":"كشفت إحصائية لـ Football Benchmark، عن تأثير النجم البرتغالي كريستيانو رونالدو على النصر، بخصوص متابعي حسابات النادي على مواقع التواصل الاجتماعي. بسبب رونالدو.. النصر يتفوق بعدد المتابعين على كبار أندية أوروبا مزمز","content":"كشفت إحصائية لـ Football Benchmark، عن تأثير النجم البرتغالي كريستيانو رونالدو على النصر، بخصوص متابعي حسابات النادي على مواقع التواصل الاجتماعي. ومنذ التعاقد مع رونالدو انتزع النصر الصدارة بعدد متابعين بلغ 9.666.756 متابع جديد، فيما بلغ عدد متابعي ريال مدريد الجدد 8.835.600 متابع جديد. وفي المركز الثالث حل باريس سان جيرمان بعدد متابعين جدد بلغوا 8.748.335 آخر شهرين. المصدر: صحيفة صدى.","pubDate":"2023-03-13 16:21:29","image_url":null,"source_id":"mzmz","category":["sports"],"country":["saudi arabia"],"language":"arabic"},{"title":"Thái Lan được mời tham dự siêu giải đấu, có vinh dự so tài với ĐT Nga","link":"https://thethao247.vn/406-thai-lan-duoc-moi-tham-du-sieu-giai-dau-co-vinh-du-so-tai-voi-dt-nga-d281318.html","keywords":null,"creator":["Thethao247"],"video_url":null,"description":"Thái Lan cùng ĐT Nga nhận được lời mời tham dự giải vô địch Tây Á từ CAFA trong thời gian FIFA Days của tháng 6 tới.","content":"Thái Lan cùng ĐT Nga nhận được lời mời tham dự giải vô địch Tây Á từ CAFA trong thời gian FIFA Days của tháng 6 tới. Theo nguồn tin từ ASEAN Football, Hiệp hội Bóng đá Trung Á (CAFA) đang có kế hoạch tổ chức giải vô địch Trung Á 2023, diễn ra từ ngày 9 đến 21/6, trùng với thời gian FIFA Days của tháng 6. Trong đó giải đấu năm nay sẽ có sự xuất hiện của 2 khách mời rất đặc biệt không thuộc Trung Á. Khách mời đầu tiên được tiết lộ là ĐT Nga. Hiệp hội Bóng đá Trung Á được cho là có mối quan hệ rất tốt với LĐBĐ Nga. Đây cũng là thời điểm ĐT Nga đang bị cấm tham gia các giải đấu ở châu Âu. Tuy nhiên FIFA và UEFA vẫn đồng ý cho chủ nhà của World Cup 2018 tham dự các giải giao hữu. Khách mời thứ 2 của giải vô địch Trung Á 2023 được tiết lộ là 1 đại diện từ khu vực Đông Nam Á. Theo những thông tin mới nhất, Thái Lan chính là đội tuyển nhận được lời mời tham dự giải đấu này. Tuy nhiên việc \"Voi chiến\" có đồng ý nhận lời tham gia hay không thì chưa được xác thực. Nếu đúng như dự kiến, giải vô địch Trung Á 2023 sẽ có tổng cộng 8 đội tham dự, bao gồm 6 đội thuộc khu vực này là Tajikistan, Iran, Uzbekistan, Kyrgyzstan, Turkmenistan và Afghanistan, cùng với 2 đội khách mời là Thái Lan và Nga. Trong tháng 3, Nga cũng sẽ đá giao hữu với Iran và Iraq. Theo điều lệ của giải, 8 đội sẽ được chia đều vào 2 bảng. Dù có 4 đội 1 bảng nhưng sẽ chỉ lấy 1 đội đứng nhất bảng để chơi ở trận chung kết chứ sẽ không tổ chức bán kết như thường lệ. Như vậy mỗi đội tham dự sẽ có ít nhất 3 trận và tối đa 4 trận đấu tại giải vô địch Tây Á 2023. Trong tháng 3 tới, ĐT Thái Lan sẽ tới UAE để Trước đó Thái Lan cũng nhận được 1 lời mời tham dự giải đấu thuộc khu vực khác. Theo đó trong thời gian FIFA Days tháng 3, nhưng cuối cùng giải đấu lại hủy bỏ và khiến cho những kế hoạch của \"Voi chiến\" phải thay đổi gấp.","pubDate":"2023-03-13 16:19:00","image_url":null,"source_id":"thethao247","category":["sports"],"country":["Vietnam"],"language":"Vietnamese"},{"title":"Mikel Arteta's innovative plan behind dressing room photo after Arsenal theory emerges","link":"https://www.mirror.co.uk/sport/football/news/arsenal-clock-dressing-room-photo-29447647","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Samuel Meade)"],"video_url":null,"description":"Arsenal celebrated their win at Fulham with a dressing room photo that included the club's iconic clock as they attempt to bring home comforts on their away days","content":"Arsenal 's unique celebrations in the changing room with the iconic club clock are born out of a decision to make away days feel more homely, it has been revealed. The Gunners responded to Manchester City's win on Saturday night by securing the three points at Fulham on Sunday afternoon. It ensures they remain five points clear at the top, but questions were asked when the squad were pictured celebrating the win alongside the famous clock. It has now been reported by the Daily Mail that it is part of a plan within the squad to make away grounds feel more like the Emirates, where they have only lost once this term. Alongside the clock, pictures of the Arsenal badge and posters of the squad have also been utilised. Olivier Giroud reaches out to Folarin Balogun as Arsenal star lined up to replace him Mikel Arteta's immediate response to reaching a century of Arsenal wins says it all The iconic clock was part of the club's former ground, Highbury, for more than 70 years. 13 years ago a larger replica of the clock was installed at Emirates, with the original located outside the stadium in north London. Five of the team's remaining 11 league fixtures are away from home - with some particularly challenging games to come. Mikel Arteta's next assignment on the road will be at Liverpool in April - a ground they have not enjoyed themselves at in recent seasons. Losses at this stage, especially with City attempting to chase them down, could be crucial. Liverpool, despite their struggles this term, have only lost once at home in the league and are a difficult proposition at Anfield. The following week they make the short trip to West Ham . Arsenal posed for a dressing room picture with the club's iconic clock ( Image: zinchenko_96/Instagram) Arsenal must travel to City on April 26 in a game that could decide the destination of the title. The defending champions are the only team to win at the Emirates this term and have already beaten the Gunners on their own patch in the FA Cup . A trip to Newcastle , who are another side to enjoy a sensational home crowd, is still on their radar. The Magpies could well be fighting for a place in the top four, which would add to the magnitude of the team. St James' Park is also a venue Arsenal lost at last term. The last away game for the Gunners is the penultimate clash of the season when they will travel to Nottingham Forest , who could still be trying to avoid relegation. Arsenal made light work of Fulham on Sunday afternoon, securing a 3-0 win at Craven Cottage - scoring all three of their goals in the first-half. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:04:22","image_url":"https://i2-prod.mirror.co.uk/incoming/article29441470.ece/ALTERNATES/s615/0_Arsenal-take-dressing-room-selfie-with-title-countdown-clock-after-Fulham-win.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gary Lineker 'victory' not all as it seems amid BBC climbdown over Match of the Day row","link":"https://www.mirror.co.uk/sport/football/news/gary-lineker-bbc-row-return-29447939","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Andy Dunn)"],"video_url":null,"description":"Gary Lineker will return to his Match of the Day presenting duties after the BBC climbed down from suspending him following a row with Conservative party MPs","content":"So, the common consensus seems to be it is Gary Lineker 1 BBC 0, another victory for the former England striker, a climbdown from the Beeb. And to a certain extent, it is. There was certainly no apology from Lineker and, commendably, he reinforced his concern for the plight of refugees trying to seek safe asylum on these shores. A consummate broadcaster, his return to the BBC’s football coverage this coming weekend is good news. But while the BBC’s director-general, Tim Davie, was the one who was forced to be contrite, it is hard not to feel there will be some in the organisation - and in this government - who will reflect on Lineker’s one-game ban as a shot across his bows. Chris Sutton gets his wish after hitting out at \"messy\" Gary Lineker and BBC feud Gary Lineker won't host Saturday's Match of the Day highlights despite BBC return There is no doubting Lineker is a man of principle but don’t expect anything remotely controversial on his Twitter feed in the near future. And that is a shame. Over his long career in television, mainly with the BBC, Lineker has developed into a peerless presenter but he might have made an even better pundit. Because there is a difference. Lineker is a great communicator, with clear ideas, not to mention no little wit. He is a public figure and we should want to hear more of his views on a whole range of subjects, not less of them. He can send his views to millions and be an influence for good in society. HAVE YOUR SAY! Should Gary Lineker face any further action after his row with the BBC? Comment below . BBC director general Tim Davie ordered a climbdown after the weekend's chaos ( Image: Getty Images) Ironically, his words on Qatar at the beginning of the BBC’s World Cup coverage were perfectly pitched. One day, Lineker will have the freedom to publicly say what he wants, to publicise whatever political allegiances he might have. But not yet. Yes, this is a victory. Yes, it is Gary Lineker 1 BBC 0. But you suspect the game is far from over. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:01:59","image_url":"https://i2-prod.mirror.co.uk/incoming/article29448008.ece/ALTERNATES/s615/0_GettyImages-1473185968.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"„Red&Gold Football“ – Bayern und Los Angeles wollen künftig gemeinsam Talente entwickeln","link":"https://fcbinside.de/2023/03/13/redgold-football-bayern-und-los-angeles-wollen-kuenftig-gemeinsam-talente-entwickeln/","keywords":["FC Bayern News"],"creator":["Vjeko Keskic"],"video_url":null,"description":"Der FC Bayern hat in den vergangenen Jahren seine Internationalisierung stetig vorangetrieben. Vor allem in den USA sind die Münchner schon seit Jahren sehr aktiv. Wie der deutsche Rekordmeister am Montag bekannt gab, hat man nun einen weiteren Partner in der Major League Soccer gefunden. Nach der Partnerschaft mit dem FC Dallas, welche seit 2018 […] Der Beitrag „Red&Gold Football“ – Bayern und Los Angeles wollen künftig gemeinsam Talente entwickeln erschien zuerst auf Aktuelle FC Bayern News.","content":"Der FC Bayern hat in den vergangenen Jahren seine Internationalisierung stetig vorangetrieben. Vor allem in den USA sind die Münchner schon seit Jahren sehr aktiv. Wie der deutsche Rekordmeister am Montag bekannt gab, hat man nun einen weiteren Partner in der Major League Soccer gefunden. Nach der Partnerschaft mit dem FC Dallas, welche seit 2018 besteht, haben die Bayern nun eine weitere Kooperation mit dem amtierenden MLS-Meister Los Angeles FC abgeschlossen. Laut den Münchnern möchten beide Klubs künftig bei der Nachwuchsförderung zusammenarbeiten. Dazu wird eine gemeinsame Gesellschaft mit den Namen „Red&Gold Football“ gegründet. Das Joint Venture soll seinen Sitz in München haben. Ziel der Kooperation ist es internationale Talente für die eigenen Mannschaften und den Profifußball auszubilden. „Wir sehen in der Partnerschaft mit LAFC eine Chance“ Klubchef Oliver Kahn äußerte sich wie folgt zu der Kooperation: „Auf internationaler Ebene entwickelt sich der Fußball sehr dynamisch, das ist besonders auf dem Transfermarkt erkennbar. Wir sehen in der Partnerschaft mit LAFC eine Chance, den FC Bayern im sportlichen Wettbewerb mit den besten Vereinen Europas und der Bundesliga zu stärken.“ Laut dem 53-Jährigen ist die USA ein sehr spannender Markt für den FC Bayern: „Dass die Fußball-WM 2026 zu großen Teilen in den USA stattfindet, wo wir bereits mit einem Büro in New York vertreten sind, macht den Standort Los Angeles zusätzlich attraktiv. Ich erwarte einen Qualitäts- und Nachwuchsschub in der Major League Soccer, der sich positiv auf unsere Partnerschaft auswirkt.“ John Thorrington, Co-Präsident und General Manager des LAFC, freut sich ebenfalls auf die Partnerschaft: „Das ist ein wirklich besonderer Moment für LAFC. Eine Partnerschaft dieser Größenordnung ist der nächste Schritt in unserer Entwicklung als Club. Wir sind überzeugt, dass diese Zusammenarbeit unseren Spielern die Möglichkeit geben wird, ihr Potenzial zu maximieren und den Weg in unsere ersten Mannschaften zu finden.“","pubDate":"2023-03-13 15:59:42","image_url":null,"source_id":"fcbinside","category":["sports"],"country":["germany"],"language":"german"},{"title":"Alessia Russo lifts lid on England's Euros win and World Cup hopes","link":"https://www.mirror.co.uk/sport/football/news/alessia-russo-england-euros-victory-29444939","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Beth Lindop)"],"video_url":null,"description":"Russo has established herself as a crucial part of Sarina Wiegman's squad and is likely to play a massive role when England travel to Australia and New Zealand for the World Cup","content":"Manchester United and England striker Alessia Russo believes the Lionesses' Euros win has helped to change \"a lot of people's opinions\" on women's football. Russo was an integral part of the squad that ended England's 56-year wait for a major trophy last summer, netting four goals in six games and the winning goal of the tournament for her stunning back-heel against Sweden. Now the 24-year-old has opened up on how her life has changed since that historic victory over Germany at Wembley. “During the tournament, we were so unaware of what was going on, on the outside…because we were so in the zone and focused on just football,\" she said in an interview with Woman’s Health UK ,. \"And then after the tournament, we came out and it was like coming out of the Big Brother house and everyone was like, ‘what you guys have done this summer is amazing’. France women's manager Corinne Diacre sacked as mutiny reaches 'point of no return' Final day of WSL season confirmed after Premier League clash concerns \"Hearing stories of people watching it at the pub or going with all their friends to sit in one of the viewing points and watch was really cool because I don't think we would have ever thought that women's football would have got to that point. We always hoped, and I think last summer changed a lot of people's opinions.” England will get the opportunity to surpass their Euros triumph when they travel to Australia and New Zealand for the Women's World Cup in July. The Lionesses are among the favourites to take home the most coveted prize in the women's game and are currently 29 games unbeaten under manager Sarina Wiegman . “For an athlete, the World Cup is the pinnacle,\" Russo said, looking ahead to the summer. \"FirstIy, obviously, I want to get selected and go into the squad. \"But then I'd just like to [have] the same kind of energy that we had at the Euros, be positive, relax and just enjoy every second of it.” Russo has also been in fine form for Manchester United ( Image: Getty Images) Russo is also enjoying another stellar season on the domestic stage, having notched eight goals in 13 league appearances for Manchester United so far this term. The 24-year-old - who was the subject of Arsenal 's world-record bid for a women's player in January - has been one of United's standout performers in a campaign where the Red Devils are battling it out with the likes of Chelsea and Arsenal for top spot in the WSL. Reflecting on what she does to prepare for a matchday, Russo said: “I listen to the same playlist every game day. And it's got the most variety mix on that ever. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE. \"It's full of r&b, a bit of house music bit of country, it just bounces everywhere…Music has always been a part of my life but also my sport. And there's like a lot of songs that I can relate back to different moments in my career, whether it be a tournament or a game, or travelling…I'm also the DJ at training so I like to put different mixes on.” “Alessia Russo was speaking to the Women’s Health UK YouTube channel in an interview available now”","pubDate":"2023-03-13 17:00:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29447834.ece/ALTERNATES/s615/1_JS273724714.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Alan Shearer makes feelings clear on BBC bosses after Gary Lineker suspension lifted","link":"https://www.mirror.co.uk/sport/football/news/alan-shearer-bbc-gary-lineker-29448507","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Samuel Meade)"],"video_url":null,"description":"Alan Shearer was among those to snub the BBC at the weekend following the axe of Gary Lineker but the pundit has made his feelings clear following his colleague's return","content":"Alan Shearer has subtly made his feelings known regarding the influence of Gary Lineker and Match of the Day after the BBC's climbdown. The broadcaster's football coverage was thrown into turmoil over the weekend following Friday's decision to take Lineker off presenting the flagship show on Saturday night due to comments he made on social media. One by one, his colleagues joined him in stating they wouldn't participate as a result. Shearer was among the most high profile names to do so, alongside regular BBC pundit Ian Wright, but within 72 hours Lineker was reinstated after productive discussions with BBC bosses. The Premier League's all-time leading goalscorer has liked a tweet by Times journalist Henry Winter, who called on BBC chiefs to understand the influence of the famous highlights show. Piers Morgan calls Gary Lineker news a victory for free speech as he slams the BBC Gary Lineker won't host Saturday's Match of the Day highlights despite BBC return He tweeted: \"BBC bosses need to appreciate better how important Match of the Day is and what Gary Lineker brings to it. In an era of teams being more tactically sophisticated, the insight that Lineker & pundits bring is even more important. They spend hours watching games, then air analysis.\" Match of the Day aired without any analysis on Saturday as a greatly reduced show was forced to focus purely on the match highlights as they failed to fill its usual spots. Lineker has spoken after being reinstated and hailed the support shown by his colleagues. He tweeted: \"After a surreal few days, I’m delighted that we have navigated a way through this. I want to thank you all for the incredible support, particularly my colleagues at BBC Sport, for the remarkable show of solidarity. Football is a team game but their backing was overwhelming.\" Alan Shearer is a regular on Match of the Day ( Image: BBC) The former England international also added: \"I'd like to thank Tim Davie for his understanding during this difficult period. He has an almost impossible job keeping everybody happy, particularly in the area of impartiality. I am delighted that we'll continue to fight the good fight, together.\" Davie, the BBC's director general, has has spoken of the need to re-examine the social media guidelines imposed on the corporation's employees, who have to remain impartial, in the wake of the incident. \"I think people across the BBC, if you talk to them, are all very passionate about our standing as an impartial broadcaster. I want to fight for a BBC where we can have proper calm debate, facilitate free speech,\" he added. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:57:56","image_url":"https://i2-prod.dailystar.co.uk/incoming/article29254088.ece/ALTERNATES/s615/0_Alan-Shearer-lost-by-gameplan-of-under-pressure-Graham-Potters-10th-place-Chelsea.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Liverpool duo invest in local club after Jurgen Klopp's training ground demand","link":"https://www.mirror.co.uk/sport/football/news/liverpool-duo-invest-local-club-29448438","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Alan Smith)"],"video_url":null,"description":"Jordan Henderson and James Milner have invested in a Cheshire padel club having been introduced to the sport by the manager, who has his own customised racket available for fans to purchase","content":"Jurgen Klopp became so enamoured with it during a trip to Tenerife that he told Liverpool to install a court at the training ground. Now, the influence of padel is wearing off on some of his players with Jordan Henderson and James Milner investing in a Cheshire club. The racket sport, considered the fastest growing in the world, is taking off across the country and footballers are among those who cannot get enough. It is a cross between tennis and squash, played on a 10m x 20m court that is fenced in and doubles are more common than singles. Balls are like tennis balls and the scoring system is the same but the rackets used are solid rather than strings. Football news LIVE - Arsenal photo theory emerges, Man Utd takeover latest, Liverpool stars slammed Virgil van Dijk branded \"overrated\" and told he \"can't lace\" Premier League duo's boots David Beckham , Lionel Messi and Paul Pogba are among those to be pictured in action but Klopp may be the most fanatic of them all. The Liverpool boss even has his own range of kit, made by Wilson. \"Padel is, besides football, the best game I've ever played,” he said when the range, which includes a customised racket, was launched. “I've only known it in the last five years or so, but since then, I'm really addicted to it. You make big steps in a short period of time. It's really fun to play.\" Klopp came across it during a training camp in Tenerife - the game began in Mexico before spreading to Spanish-speaking countries - and became hooked. Games at Melwood have become so competitive that assistant Pep Lijnders has previously joked that Klopp “walks around like Conor McGregor ” after winning a few games. Pep Lijnders ( Image: YouTube/This is Anfield) Henderson and Milner have stumped up cash for a stake in the Padel Club in Handforth. The Daily Mail reported that former Everton players Joleon Lescott and Gareth Barry have also invested. During their post-World Cup camp in Dubai, Mo Salah and Thiago Alcantara even got involved with a game against the coaches - but Klopp and Lijnders triumphed. Klopp, quoted by the club’s own media, said: \"The coaches, we play in our spare time – we love it, we just love the game and play it pretty much all the time. We have our average level. \"Mo saw us from time to time playing and wanted to play against us desperately, so we now gave him the chance to play. But I'm not sure he'll want to play again! \"That's not true actually – he asked all the time when we can play again. But it's a wonderful game, we love it. \"When you saw the pictures, it's obviously not high-intense at our level. There are levels where it's incredibly intense but we cannot play that. It was good fun.\"","pubDate":"2023-03-13 16:50:01","image_url":"https://i2-prod.mirror.co.uk/incoming/article29448511.ece/ALTERNATES/s615/0_GettyImages-1360431233.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Crystal Palace Women suspends three members of staff amid investigation","link":"https://www.mirror.co.uk/sport/football/news/crystal-palace-women-staff-suspended-29445733","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Press Association, Laura Hartley)"],"video_url":null,"description":"Crystal Palace Women have released a statement following the allegations and suspension of staff on its team","content":"Three members of staff at Crystal Palace Women have been suspended pending an investigation, it is understood. It is understood an investigation into the trio’s conduct is ongoing after a complaint was raised - but it isn't yet known who raised the complaint. A statement from Palace said: “Three members of staff at Palace Women have been suspended, pending an investigation. “We can’t comment further while it is ongoing.” The club are currently lying sixth in the Women's Championship","pubDate":"2023-03-13 16:33:17","image_url":"https://i2-prod.mirror.co.uk/incoming/article21164186.ece/ALTERNATES/s615/0_Crystal-Palace-v-West-Ham-United-Premier-League.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"\"Khi Tuchel bắt đầu có quyền lực, nó đã bị tước đi\"","link":"https://www.bongda.com.vn/khi-tuchel-bat-dau-co-quyen-luc-no-da-bi-tuoc-di-d676080.html","keywords":null,"creator":null,"video_url":null,"description":"Chuyên gia bóng đá Habib Beye lên tiếng nhận định về tình hình hiện tại của Gã Nhà giàu nước Pháp.","content":"Theo quan điểm đến từ Habib Beye, kế hoạch của không nên được xoay quanh các cầu thủ ngôi sao của câu lạc bộ. Mà thay vào đó, Gã Nhà giàu nước Pháp nên trao toàn bộ quyền lực cho vị thuyền trưởng của mình. Đồng thời, Beye còn lên tiếng chỉ trích PSG vì quyết định sa thải HLV Thomas Tuchel, khi chiến lược gia người Đức mới bắt đầu được trao quyền lực. GOAL France và PSG dẫn lời chuyên gia trực thuộc Canal Football Club: Tuchel lên ngôi vô địch không lâu sau khi bị PSG sa thải.","pubDate":"2023-03-13 16:21:31","image_url":"https://media.bongda.com.vn/resize/404x260/files/anh.nguyen/2023/03/09/tuchel-1122.png","source_id":"bongda","category":["sports"],"country":["czech republic"],"language":"czech"},{"title":"بسبب رونالدو.. النصر يتفوق بعدد المتابعين على كبار أندية أوروبا","link":"https://mz-mz.net/1743432/","keywords":["الدوري السعودي"],"creator":["mzmz3"],"video_url":null,"description":"كشفت إحصائية لـ Football Benchmark، عن تأثير النجم البرتغالي كريستيانو رونالدو على النصر، بخصوص متابعي حسابات النادي على مواقع التواصل الاجتماعي. بسبب رونالدو.. النصر يتفوق بعدد المتابعين على كبار أندية أوروبا مزمز","content":"كشفت إحصائية لـ Football Benchmark، عن تأثير النجم البرتغالي كريستيانو رونالدو على النصر، بخصوص متابعي حسابات النادي على مواقع التواصل الاجتماعي. ومنذ التعاقد مع رونالدو انتزع النصر الصدارة بعدد متابعين بلغ 9.666.756 متابع جديد، فيما بلغ عدد متابعي ريال مدريد الجدد 8.835.600 متابع جديد. وفي المركز الثالث حل باريس سان جيرمان بعدد متابعين جدد بلغوا 8.748.335 آخر شهرين. المصدر: صحيفة صدى.","pubDate":"2023-03-13 16:21:29","image_url":null,"source_id":"mzmz","category":["sports"],"country":["saudi arabia"],"language":"arabic"},{"title":"Thái Lan được mời tham dự siêu giải đấu, có vinh dự so tài với ĐT Nga","link":"https://thethao247.vn/406-thai-lan-duoc-moi-tham-du-sieu-giai-dau-co-vinh-du-so-tai-voi-dt-nga-d281318.html","keywords":null,"creator":["Thethao247"],"video_url":null,"description":"Thái Lan cùng ĐT Nga nhận được lời mời tham dự giải vô địch Tây Á từ CAFA trong thời gian FIFA Days của tháng 6 tới.","content":"Thái Lan cùng ĐT Nga nhận được lời mời tham dự giải vô địch Tây Á từ CAFA trong thời gian FIFA Days của tháng 6 tới. Theo nguồn tin từ ASEAN Football, Hiệp hội Bóng đá Trung Á (CAFA) đang có kế hoạch tổ chức giải vô địch Trung Á 2023, diễn ra từ ngày 9 đến 21/6, trùng với thời gian FIFA Days của tháng 6. Trong đó giải đấu năm nay sẽ có sự xuất hiện của 2 khách mời rất đặc biệt không thuộc Trung Á. Khách mời đầu tiên được tiết lộ là ĐT Nga. Hiệp hội Bóng đá Trung Á được cho là có mối quan hệ rất tốt với LĐBĐ Nga. Đây cũng là thời điểm ĐT Nga đang bị cấm tham gia các giải đấu ở châu Âu. Tuy nhiên FIFA và UEFA vẫn đồng ý cho chủ nhà của World Cup 2018 tham dự các giải giao hữu. Khách mời thứ 2 của giải vô địch Trung Á 2023 được tiết lộ là 1 đại diện từ khu vực Đông Nam Á. Theo những thông tin mới nhất, Thái Lan chính là đội tuyển nhận được lời mời tham dự giải đấu này. Tuy nhiên việc \"Voi chiến\" có đồng ý nhận lời tham gia hay không thì chưa được xác thực. Nếu đúng như dự kiến, giải vô địch Trung Á 2023 sẽ có tổng cộng 8 đội tham dự, bao gồm 6 đội thuộc khu vực này là Tajikistan, Iran, Uzbekistan, Kyrgyzstan, Turkmenistan và Afghanistan, cùng với 2 đội khách mời là Thái Lan và Nga. Trong tháng 3, Nga cũng sẽ đá giao hữu với Iran và Iraq. Theo điều lệ của giải, 8 đội sẽ được chia đều vào 2 bảng. Dù có 4 đội 1 bảng nhưng sẽ chỉ lấy 1 đội đứng nhất bảng để chơi ở trận chung kết chứ sẽ không tổ chức bán kết như thường lệ. Như vậy mỗi đội tham dự sẽ có ít nhất 3 trận và tối đa 4 trận đấu tại giải vô địch Tây Á 2023. Trong tháng 3 tới, ĐT Thái Lan sẽ tới UAE để Trước đó Thái Lan cũng nhận được 1 lời mời tham dự giải đấu thuộc khu vực khác. Theo đó trong thời gian FIFA Days tháng 3, nhưng cuối cùng giải đấu lại hủy bỏ và khiến cho những kế hoạch của \"Voi chiến\" phải thay đổi gấp.","pubDate":"2023-03-13 16:19:00","image_url":null,"source_id":"thethao247","category":["sports"],"country":["Vietnam"],"language":"Vietnamese"},{"title":"Mikel Arteta's innovative plan behind dressing room photo after Arsenal theory emerges","link":"https://www.mirror.co.uk/sport/football/news/arsenal-clock-dressing-room-photo-29447647","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Samuel Meade)"],"video_url":null,"description":"Arsenal celebrated their win at Fulham with a dressing room photo that included the club's iconic clock as they attempt to bring home comforts on their away days","content":"Arsenal 's unique celebrations in the changing room with the iconic club clock are born out of a decision to make away days feel more homely, it has been revealed. The Gunners responded to Manchester City's win on Saturday night by securing the three points at Fulham on Sunday afternoon. It ensures they remain five points clear at the top, but questions were asked when the squad were pictured celebrating the win alongside the famous clock. It has now been reported by the Daily Mail that it is part of a plan within the squad to make away grounds feel more like the Emirates, where they have only lost once this term. Alongside the clock, pictures of the Arsenal badge and posters of the squad have also been utilised. Olivier Giroud reaches out to Folarin Balogun as Arsenal star lined up to replace him Mikel Arteta's immediate response to reaching a century of Arsenal wins says it all The iconic clock was part of the club's former ground, Highbury, for more than 70 years. 13 years ago a larger replica of the clock was installed at Emirates, with the original located outside the stadium in north London. Five of the team's remaining 11 league fixtures are away from home - with some particularly challenging games to come. Mikel Arteta's next assignment on the road will be at Liverpool in April - a ground they have not enjoyed themselves at in recent seasons. Losses at this stage, especially with City attempting to chase them down, could be crucial. Liverpool, despite their struggles this term, have only lost once at home in the league and are a difficult proposition at Anfield. The following week they make the short trip to West Ham . Arsenal posed for a dressing room picture with the club's iconic clock ( Image: zinchenko_96/Instagram) Arsenal must travel to City on April 26 in a game that could decide the destination of the title. The defending champions are the only team to win at the Emirates this term and have already beaten the Gunners on their own patch in the FA Cup . A trip to Newcastle , who are another side to enjoy a sensational home crowd, is still on their radar. The Magpies could well be fighting for a place in the top four, which would add to the magnitude of the team. St James' Park is also a venue Arsenal lost at last term. The last away game for the Gunners is the penultimate clash of the season when they will travel to Nottingham Forest , who could still be trying to avoid relegation. Arsenal made light work of Fulham on Sunday afternoon, securing a 3-0 win at Craven Cottage - scoring all three of their goals in the first-half. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:04:22","image_url":"https://i2-prod.mirror.co.uk/incoming/article29441470.ece/ALTERNATES/s615/0_Arsenal-take-dressing-room-selfie-with-title-countdown-clock-after-Fulham-win.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Gary Lineker 'victory' not all as it seems amid BBC climbdown over Match of the Day row","link":"https://www.mirror.co.uk/sport/football/news/gary-lineker-bbc-row-return-29447939","keywords":["Football"],"creator":["mirrornews@mirror.co.uk (Andy Dunn)"],"video_url":null,"description":"Gary Lineker will return to his Match of the Day presenting duties after the BBC climbed down from suspending him following a row with Conservative party MPs","content":"So, the common consensus seems to be it is Gary Lineker 1 BBC 0, another victory for the former England striker, a climbdown from the Beeb. And to a certain extent, it is. There was certainly no apology from Lineker and, commendably, he reinforced his concern for the plight of refugees trying to seek safe asylum on these shores. A consummate broadcaster, his return to the BBC’s football coverage this coming weekend is good news. But while the BBC’s director-general, Tim Davie, was the one who was forced to be contrite, it is hard not to feel there will be some in the organisation - and in this government - who will reflect on Lineker’s one-game ban as a shot across his bows. Chris Sutton gets his wish after hitting out at \"messy\" Gary Lineker and BBC feud Gary Lineker won't host Saturday's Match of the Day highlights despite BBC return There is no doubting Lineker is a man of principle but don’t expect anything remotely controversial on his Twitter feed in the near future. And that is a shame. Over his long career in television, mainly with the BBC, Lineker has developed into a peerless presenter but he might have made an even better pundit. Because there is a difference. Lineker is a great communicator, with clear ideas, not to mention no little wit. He is a public figure and we should want to hear more of his views on a whole range of subjects, not less of them. He can send his views to millions and be an influence for good in society. HAVE YOUR SAY! Should Gary Lineker face any further action after his row with the BBC? Comment below . BBC director general Tim Davie ordered a climbdown after the weekend's chaos ( Image: Getty Images) Ironically, his words on Qatar at the beginning of the BBC’s World Cup coverage were perfectly pitched. One day, Lineker will have the freedom to publicly say what he wants, to publicise whatever political allegiances he might have. But not yet. Yes, this is a victory. Yes, it is Gary Lineker 1 BBC 0. But you suspect the game is far from over. Free £2 shop bet with William Hill every day of the Cheltenham Festival - plus all the fantastic daily coverage you need Pick up your Daily Mirror every day of the festival for racing specials, day by day updates and free bet EVERY DAY. Celebrate the biggest racing week of the year- the Cheltenham Festival. One of the most prestigious National Hunt Meetings of the calendar is not to be missed…and we’ve got a bumper week of amazing content and great reader offers. Find out more HERE.","pubDate":"2023-03-13 16:01:59","image_url":"https://i2-prod.mirror.co.uk/incoming/article29448008.ece/ALTERNATES/s615/0_GettyImages-1473185968.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"„Red&Gold Football“ – Bayern und Los Angeles wollen künftig gemeinsam Talente entwickeln","link":"https://fcbinside.de/2023/03/13/redgold-football-bayern-und-los-angeles-wollen-kuenftig-gemeinsam-talente-entwickeln/","keywords":["FC Bayern News"],"creator":["Vjeko Keskic"],"video_url":null,"description":"Der FC Bayern hat in den vergangenen Jahren seine Internationalisierung stetig vorangetrieben. Vor allem in den USA sind die Münchner schon seit Jahren sehr aktiv. Wie der deutsche Rekordmeister am Montag bekannt gab, hat man nun einen weiteren Partner in der Major League Soccer gefunden. Nach der Partnerschaft mit dem FC Dallas, welche seit 2018 […] Der Beitrag „Red&Gold Football“ – Bayern und Los Angeles wollen künftig gemeinsam Talente entwickeln erschien zuerst auf Aktuelle FC Bayern News.","content":"Der FC Bayern hat in den vergangenen Jahren seine Internationalisierung stetig vorangetrieben. Vor allem in den USA sind die Münchner schon seit Jahren sehr aktiv. Wie der deutsche Rekordmeister am Montag bekannt gab, hat man nun einen weiteren Partner in der Major League Soccer gefunden. Nach der Partnerschaft mit dem FC Dallas, welche seit 2018 besteht, haben die Bayern nun eine weitere Kooperation mit dem amtierenden MLS-Meister Los Angeles FC abgeschlossen. Laut den Münchnern möchten beide Klubs künftig bei der Nachwuchsförderung zusammenarbeiten. Dazu wird eine gemeinsame Gesellschaft mit den Namen „Red&Gold Football“ gegründet. Das Joint Venture soll seinen Sitz in München haben. Ziel der Kooperation ist es internationale Talente für die eigenen Mannschaften und den Profifußball auszubilden. „Wir sehen in der Partnerschaft mit LAFC eine Chance“ Klubchef Oliver Kahn äußerte sich wie folgt zu der Kooperation: „Auf internationaler Ebene entwickelt sich der Fußball sehr dynamisch, das ist besonders auf dem Transfermarkt erkennbar. Wir sehen in der Partnerschaft mit LAFC eine Chance, den FC Bayern im sportlichen Wettbewerb mit den besten Vereinen Europas und der Bundesliga zu stärken.“ Laut dem 53-Jährigen ist die USA ein sehr spannender Markt für den FC Bayern: „Dass die Fußball-WM 2026 zu großen Teilen in den USA stattfindet, wo wir bereits mit einem Büro in New York vertreten sind, macht den Standort Los Angeles zusätzlich attraktiv. Ich erwarte einen Qualitäts- und Nachwuchsschub in der Major League Soccer, der sich positiv auf unsere Partnerschaft auswirkt.“ John Thorrington, Co-Präsident und General Manager des LAFC, freut sich ebenfalls auf die Partnerschaft: „Das ist ein wirklich besonderer Moment für LAFC. Eine Partnerschaft dieser Größenordnung ist der nächste Schritt in unserer Entwicklung als Club. Wir sind überzeugt, dass diese Zusammenarbeit unseren Spielern die Möglichkeit geben wird, ihr Potenzial zu maximieren und den Weg in unsere ersten Mannschaften zu finden.“","pubDate":"2023-03-13 15:59:42","image_url":null,"source_id":"fcbinside","category":["sports"],"country":["germany"],"language":"german"}]}