{"newsArray":[{"title":"Mbappé e Messi marcam, PSG vence Olympique e abre vantagem no Francês","link":"https://www.mg.superesportes.com.br/app/noticias/futebol/futebol-internacional/2023/02/26/noticia_futebol_internacional,3989316/mbappe-e-messi-marcam-psg-vence-olympique-e-abre-vantagem-no-frances.shtml","keywords":["Futebol Internacional"],"creator":null,"video_url":null,"description":" Neste domingo, o Paris Saint-Germain venceu o Olympique de Marselha por 3 a 0, pela 25ª rodada do Campeonato Francês, fora de casa, no Stade Vélodrome. Com isso, abriu uma vantagem de oito pontos no torneio. Messi e Mbappé (2x) marcaram para os visitantes.Em seu próximo compromisso, os comandados de Christophe Galtier enfrentam o Nantes no próximo dia 4, às 17h (de Brasília), na condição de mandante, no Parque dos Príncipes.Do outro lado, o Olympique de Marselha vê a possibilidade de título no Campeonato Francês ficar mais distante. Assim, encara o Football Club d'Annecy pelas quartas de finais da Copa da França, nessa quarta-feira, às 17h, em casa.O jogoAs duas primeiras oportunidades claras de gol foram do Olympique de Marselha. Na primeira, Nuno Tavares invadiu a área e foi travado pelo defensor. E, na segunda, o lateral esquerdo ficou cara a cara com o Donnarumma, mas chutou torto.  Mesmo com a pressão dos mandantes, quem abriu o placar foi o Paris Saint-Germain, Messi acha Mbappé, que bateu cruzado para o fundo do gol. Depois, Bailly empatou, mas o tento foi anulado. Após servir o francês, foi a vez do argentino marcar. O craque tocou na saída do goleiro e ampliou a vantagem.No final da primeira etapa, os dois protagonistas do PSG perderam a oportunidade de ir para o intervalo mais tranquilos. Na sequência, Marquinhos apareceu como centroavante, mas também não conseguiu acertar a meta. O Olympique de Marselha até tentou diminuir, mas Nuno Tavares chutou para fora e, na chance de Alexis Sanchéz, o goleiro italiano deu um tapa para fora.Assim como na primeira etapa, o jogo começou frenético. Após perdeu outra chance de ampliar, Mbappé tabelou com Messi e marcou o seu segundo gol na partida.Com a vantagem, o Paris Saint-Germain diminuiu o ritmo. Assim, as melhores chances passaram a ser dos mandantes. Porém, não conseguiu fazer o gol de honra.","content":"foto: NICOLAS TUCAT / AFP Mbappé e Messi marcaram na vitória do PSG Neste domingo, o Paris Saint-Germain venceu o Olympique de Marselha por 3 a 0, pela 25ª rodada do Campeonato Francês, fora de casa, no Stade Vélodrome. Com isso, abriu uma vantagem de oito pontos no torneio. Messi e Mbappé (2x) marcaram para os visitantes. Em seu próximo compromisso, os comandados de Christophe Galtier enfrentam o Nantes no próximo dia 4, às 17h (de Brasília), na condição de mandante, no Parque dos Príncipes. Do outro lado, o Olympique de Marselha vê a possibilidade de título no Campeonato Francês ficar mais distante. Assim, encara o Football Club d'Annecy pelas quartas de finais da Copa da França, nessa quarta-feira, às 17h, em casa. O jogo As duas primeiras oportunidades claras de gol foram do Olympique de Marselha. Na primeira, Nuno Tavares invadiu a área e foi travado pelo defensor. E, na segunda, o lateral esquerdo ficou cara a cara com o Donnarumma, mas chutou torto. Saiba mais Barcelona perde do Almería e vê Real Madrid se aproximar no Espanhol Bayern bate Union Berlin em confronto direto e segue na liderança do Alemão United bate Newcastle com gol de Casemiro, finda jejum e ganha Copa da Liga Para cortar gastos, PSG pode deixar Messi sair na próxima temporada Mesmo com a pressão dos mandantes, quem abriu o placar foi o Paris Saint-Germain, Messi acha Mbappé, que bateu cruzado para o fundo do gol. Depois, Bailly empatou, mas o tento foi anulado. Após servir o francês, foi a vez do argentino marcar. O craque tocou na saída do goleiro e ampliou a vantagem. No final da primeira etapa, os dois protagonistas do PSG perderam a oportunidade de ir para o intervalo mais tranquilos. Na sequência, Marquinhos apareceu como centroavante, mas também não conseguiu acertar a meta. O Olympique de Marselha até tentou diminuir, mas Nuno Tavares chutou para fora e, na chance de Alexis Sanchéz, o goleiro italiano deu um tapa para fora. Assim como na primeira etapa, o jogo começou frenético. Após perdeu outra chance de ampliar, Mbappé tabelou com Messi e marcou o seu segundo gol na partida. Com a vantagem, o Paris Saint-Germain diminuiu o ritmo. Assim, as melhores chances passaram a ser dos mandantes. Porém, não conseguiu fazer o gol de honra.","pubDate":"2023-02-26 22:35:00","image_url":null,"source_id":"superesportes","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"O gol de Yuri Alberto foi bem anulado? Veja o que diz a regra","link":"https://www.meutimao.com.br/noticias-do-corinthians/442467/o-gol-de-yuri-alberto-foi-bem-anulado-veja-o-que-diz-a-regra","keywords":null,"creator":null,"video_url":null,"description":"A Torcida do Corinthians repercutiu bastante o gol anulado de Yuri Alberto no primeiro tempo do empate contra o Santos. Mas estava realmente impedido? Veja o que a regra diz.","content":"Ainda na primeira etapa do empate entre Corinthians e Santos , Yuri Alberto conseguiu balançar as redes adversárias duas vezes, mas um dos tentos foi anulado por um suposto impedimento do atacante. Após o apito final, a Fiel criticou bastante a árbitra Edina Alves Batista pela invalidação do gol. O lance ocorreu por volta dos 26 minutos. Nele, Renato Augusto fez um passe para Du Queiroz no corredor direito do ataque corinthiano. Neste momento, o camisa 9 alvinegro se movimentou para posicionar-se dentro da área santista, mas no caminho acabou trombando com um rival, impedindo que ele alcançasse o volante alvinegro. Este encontrão foi o motivo da anulação. Mas a ação foi correta? O Meu Timão buscou na regras do futebol e te mostra, torcedor, como funciona a regra de impedimento. Antes de tudo, vale lembrar que um jogador está impedido quando ele está atrás da linha da bola e/ou do penúltimo marcador adversário. Portanto, Yuri Alberto estava sim impedido na origem do lance. No entanto, só é considerado infração e o árbitro ou auxiliar deve assinalar impedimento se ele tiver interferido no lance de forma direta ou indireta. A Confederação Brasileira de Futebol (CBF) ainda não divulgou o livro de regras de 2023, mas, segundo a edição de 2022, é considerada interferência em duas ocasiões: Já a edição de 2023 do International Football Association Board (IFAB), órgão da Fifa que regulamenta as regras do futebol, diz que o jogador impedido comete uma infração quando: Tanto a CBF quanto o IFAB dizem que o árbitro de vídeo só deve entrar em ação quando percebe algum erro claro do juiz da partida em campo ou de algum \"incidente grave despercebido\" relacionado a algum gol, pênalti, cartão vermelho direto (segundo amarelo não é levado em consideração) ou erro de identificação de qualquer punição (seja cartão amarelo ou vermelho). Ainda, o árbitro do campo é quem toma a decisão final , a partir do que o responsável pelo VAR lhe informar, o que viu do lance e no replay da cabine. Veja mais em: Arbitragem , Erros de arbitragem , Corinthians x Santos , Yuri Alberto e Campeonato Paulista .","pubDate":"2023-02-26 22:26:00","image_url":null,"source_id":"meutimao","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"Mbappé e Messi brilham, PSG vence Marseille e dispara na liderança da Ligue 1","link":"http://www.lance.com.br/futebol-internacional/mbappe-e-messi-brilham-psg-vence-marseille-e-dispara-na-lideranca-da-ligue.html","keywords":["Futebol Internacional"],"creator":["Luiz Eduardo"],"video_url":null,"description":null,"content":"Segue o líder! O Paris Saint-Germain venceu o clássico contra o Olympique de Marseille por 3 a 0, fora de casa, neste domingo, em partida que valeu pela 25ª rodada da Ligue 1 2022/23. Kylian Mbappé, duas vezes, e Lionel Messi marcaram para o PSG. Neymar desfalcou a equipe, visto que está se recuperando de uma lesão no tornozelo. Com o resultado, os comandados de Christophe Galtier chegaram aos 60 pontos e ampliaram a vantagem na liderança do Francês para oito à frente do próprio Marseille, que é o vice-líder da competição, com 52. A vitória deixa a vida do PSG mais fácil na briga pelo título nacional. SENTIU Aos 11 minutos do primeiro tempo, o zagueiro Kimpembé sentiu um problema muscular e caiu sozinho no gramado após contragolpe do Marseille. O defensor, que havia voltado há pouco tempo, teve de deixar a partida de maca e deve desfalcar novamente a equipe do PSG nos próximos compromissos. MESSI PARA MBAPPÉ A noite em Marselha foi dos astros do Paris. Aos 25 minutos, Messi arrancou pelo meio, tocou para Mbappé avançar com a bola e o francês tocou na saída do goleiro Pau López, abrindo o placar no Vélodrome para o PSG, 1 a 0. + Veja a tabela da Ligue 1 2022/23 MBAPPÉ PARA MESSI Aos 29, foi a vez do francês retribuir a assistência para o argentino. Mbappé recebeu pela esquerda, encarou a marcação de Bailly e tocou na medida para Messi mandar para o fundo das redes, dobrando a vantagem do PSG no clássico. DISCO REPETIDO Mesmo após o intervalo, a história do jogo não mudou. Aos nove minutos do segundo tempo, novamente Messi achou Mbappé, desta vez com um lindo passe de cavadinha e o francês soltou o pé esquerdo, de primeira, para fazer o terceiro gol do PSG contra o Marseille e fechar a conta no Vélodrome: 3 a 0 e liderança da Ligue 1 consolidada. AGENDA ​O PSG volta a campo no próximo sábado, às 17h (de Brasília), em casa contra o Nantes, pelo Campeonato Francês. O Olympique de Marseille, por sua vez, enfrenta o Football Club d'Annecy na quarta-feira, também às 17h (de Brasília), mas pela Copa da França.","pubDate":"2023-02-26 22:17:21","image_url":"http://www.lance.com.br//files//uploads/2023/02/26/63fbcbeb217d1.jpeg","source_id":"lance","category":["top","sports"],"country":["brazil"],"language":"portuguese"},{"title":"Amakhosi on the hunt after fortuitous win eases pressure on coach Arthur Zwane","link":"https://www.dailymaverick.co.za/article/2023-02-27-amakhosi-on-the-hunt-after-fortuitous-win-eases-pressure-on-coach-arthur-zwane/","keywords":null,"creator":["Yanga Sibembe"],"video_url":null,"description":"The biggest match on the South African soccer calendar was a cagey and drab affair, but Kaizer Chiefs’ 1-0 win over Orlando Pirates on Saturday marks their fifth victory in a row over their in-form Soweto neighbour. The post Amakhosi on the hunt after fortuitous win eases pressure on coach Arthur Zwane appeared first on Daily Maverick.","content":"Victory for Kaizer Chiefs against Orlando Pirates on Saturday, 25 February, eased pressure on the former team’s coach, Arthur Zwane, keeping Amakhosi in the hunt for second spot on the Premiership table. Kaizer Chiefs edged Orlando Pirates 1-0 for the second time this season to complete a second league double on the trot against their bitter rivals. The biggest match on the South African soccer calendar was far from a memorable spectacle, with the two teams recording a total of four shots on target. The match was a cagey and drab affair. It took a hopeful and searching diagonal ball by player of the match Edmilson Dove to force an own goal off the head of Pirates’ second-half substitute Olisa Ndah. Yusuf Maart of Kaizer Chiefs and Tapelo Xoki of Orlando Pirates in action at FNB Stadium on 25 February 2023 in Johannesburg, South Africa. (Photo: Lefty Shivambu / Gallo Images) With just one minute left to play of the regulation 90 minutes, the Nigerian defender flicked the ball over Buccaneers goalkeeper Sipho Chaine, who had come off his line in an attempt to intercept the long pass. That sequence of miscommunication compounded the Bucs’ misery in front of a crowd of just more than 78,000 at the FNB Stadium in the south of Johannesburg. They had already been playing with 10 men after captain Innocent Maela was sent off at the one-hour mark. The narrow win for Amakhosi will have eased the mounting pressure on the Naturena-based side’s coach, Zwane. There have been calls from sections of Chiefs’ fanbase for the former Amakhosi and Bafana Bafana midfielder to vacate his seat. These murmurs had amplified in recent weeks, with the Glamour Boys claiming just one win from their five league matches preceding the derby. In that period they suffered three defeats and played to one draw. In spite of that not-so-favourable return, the Chiefs’ hierarchy threw its weight behind Zwane and offered the public reassurance that he was still their man as they sought to end an eight-year trophy drought. Visit Daily Maverick’s home page for more news, analysis and investigations Zwane – who played more than 150 games for Amakhosi in the early to late 2000s, collecting numerous trophies along the way – was appointed as the club’s head coach in May 2022. He was tasked with bringing back a culture of winning to the team and reigniting the fighting spirit of one of the most successful clubs in Africa. Zwane still believes he is the right man for the job, and that eventually the seeds he is planting and tending to will reap the desired fruit. “I’ve said it in the past that the club has a plan. We know when you start something there’ll be a rough patch because you are trying to lay a strong foundation,” Zwane told journalists after the match. Amakhosi may be extremely inconsistent as they continue trying to bounce back to their former glory. But one thing that has remained consistent in recent seasons is beating their Soweto neighbours. The 1-0 win on Saturday was the fifth in a row for Chiefs in this league fixture. This is even though Sea Robbers headed into the tie as the in-form side, having claimed four wins from their five most recent matches. Zwane downplayed Chiefs’ impressive streak over their nemesis, saying it was just another fixture that they aimed to do well in, which was the target in every match they played. “It’s just another six points for us. I don’t want the players to only focus on beating Orlando Pirates. We want to beat every team that we come across because the league is a marathon, it’s not just winning against Pirates. But the win is important for us as a club, knowing our history with them,” Zwane told journalists. With these three points, Chiefs kept themselves firmly in the race for second place and clinching the final Caf Champions League spot – with Mamelodi Sundowns sprinting to the Premiership title and the primary continental football spot. Gavin Hunt’s SuperSport occupy second spot with 36 points. They strengthened their position by beating the relegation-threatened Maritzburg United 2-0 on Friday. With defeat in the derby, third-placed Pirates now trail Hunt’s men by five points. Level with them on 31 points are fourth-placed Richards Bay and Amakhosi in fifth. The Sea Robbers lead the duo due to a marginally superior goal difference. With nine games left to play this campaign, the scramble for second spot is on. “We are thinking week by week. We just need to prepare for the next game. That’s all,” said Pirates’ assistant coach Sergio Almenara when asked about the sprint for second. Chiefs are next in action again on Saturday, 4 March, in a crucial clash against Richards Bay in the tight pursuit for second place. The Buccaneers will tussle with Swallows on Friday, 3 March. DM","pubDate":"2023-02-26 22:03:51","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Man City to battle rivals for Brighton star Alexis Mac Allister and other transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-city-mac-allister-gossip-26334953","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Brighton and Hove Albion's midfielder was a key man for Argentina at the World Cup and his name features in today's Man City transfer gossip.","content":"Manchester City are reportedly 'hot on the heels' of Brighton and Hove Albion's World Cup winner Alexis Mac Allister. After not appearing in Argentina's opening defeat to Saudi Arabia, Mac Allister was introduced for the remainder of the tournament and proved to be an unsung hero for Lionel Messi's team, scoring once and grabbing an assist in the final victory over France. Upon his return to England, the 24-year-old continued to impress. He scored twice in his first game back in the FA Cup victory over Middlesbrough and he has also adapted a game to suit Brighton's needs. At the beginning of the season, Mac Allister played in the defensive midfield role but has since played in central and attacking midfield positions. ALSO READ: Lewis explains why City squad were 'gutted' after victory This flexibility and form has led Pep Guardiola to become interested in the Argentine, according to the Daily Star . They claim that Guardiola sees Mac Allister as the perfect addition to his squad. However, the report warns that Chelsea, Arsenal and Liverpool are also keen on the 24-year-old. Elsewhere, Football Insider are claiming that Barcelona are continuing to push for the signing of Ilkay Gundogan . Gundogan became City's captain at the beginning of the season following Fernandinho's departure from the Etihad Stadium. The 32-year-old's contract is due to expire at the end of the campaign and it is unclear whether the German will commit to a new deal. Barca meanwhile are looking for players who could replace Sergio Busquets and they have reportedly earmarked Gundogan as a target. It is claimed in the report that City are not close to agreeing a new contract with the ex-Borussia Dortmund man and that Xavi, Barcelona's manager, is a big fan of the midfielder. READ NEXT: Get all the latest City news here Alvarez sends message to Foden Haaland verdict on City win Bournemouth boss gives verdict on win Guardiola explains full time reaction","pubDate":"2023-02-26 21:00:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26335045.ece/ALTERNATES/s615/0_GettyImages-1467430720.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ten Hag snags Manchester United’s first title in six years","link":"https://www.premiumtimesng.com/sports/football/584746-ten-hag-snags-manchester-uniteds-first-title-in-six-years.html","keywords":["Football","Bruno Guimaraes","Man united","Manchester United","Rashford","Ten Hag"],"creator":["Jide Alaka"],"video_url":null,"description":"Six years after their last title, new manager Erik ten Hag led Manchester United to the Carabao Cup title. The post Ten Hag snags Manchester United’s first title in six years appeared first on Premium Times Nigeria.","content":"Two first-half goals from Casemiro and an own goal gave Manchester United a 2-0 victory over Newcastle United in the Carabao Cup final on Sunday at Wembley. Both teams came into Sunday’s final needing to snap a trophy drought. While the United from Manchester had last won a trophy in 2017; Newcastle’s drought stretched back to 2006 when the Magpies won the UEFA Intertoto Cup. Both United teams had the full complement of their first teamers, with Manchester having Casemiro and Newcastle having Bruno Guimaraes back from the red card he got in the semifinal. And the Magpies started the better of the two teams, controlling the midfield through their two Brazilians in Joelinton and Guimaraes. Despite the early pressure, it was Manchester United that took the lead through Casemiro, who rose highest to head home a Luke Shaw free kick in the 32nd minute. There was a VAR check, but the former Real Madrid midfielder was ruled to be onside by a hair’s breadth. Marcus Rashford combined brilliantly with Wout Weghorst in the 39th minute before driving into the box and seeing his shot deflect off of Sven Botman before eluding Loris Karius in the Newcastle goal. After the match, Erik ten Hag said getting the first trophy was the start of the journey. “It was not always the best football, but it was effective. Firstly, you have to win the first one [trophy]. We will get a lot of inspiration from this, but also more confidence that we can do it.” The victory comes three days after beating Barcelona to qualify for the round of 16 in the Europa League. Donate TEXT AD: Call Willie - +2348098788999","pubDate":"2023-02-26 20:56:28","image_url":null,"source_id":"premiumtimesng","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"'People don't see that' - Phil Jones on how Marcus Rashford has reignited his Man United career","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/marcus-rashford-jones-manchester-united-26336012","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Rashford has been Manchester United's star man so far this season and has been undroppable under Erik ten Hag","content":"Manchester United defender Phil Jones believes that it is Marcus Rashford's mentality that has helped him improve his form this season. Rashford is United's leading goalscorer this term having notched just five in all competitions last campaign. Erik ten Hag has previously compared the Englishman to Kylian Mbappe for his ability to get in behind the opposition defence. Despite being injured this season, Jones has been able to observe Rashford's rise at Carrington. He told Sky Sports , ahead of the Carabao Cup final, that the 25-year-old's dedication sets him apart from other players. ALSO READ: United player ratings vs Newcastle Jones explained: \"I think it is his maturity, especially after the World Cup where he did not start as many games as he would have liked. He has knuckled down and got on with it. He has become sharper, stronger and you see that in the reflection of his performances this season. \"Defenders find him really hard to deal with, cope with him. He can take it one way, take it the other way. His goals [are] from outside the box, inside the box, he has scored a few headers lately as well. \"His all-round game at the minute has hit heights that probably even he didn't think he would get to. But he has been brilliant. \"He probably will not thank me for it but I think, on current form, he is the best player in the world.\" He added: \" His body shape, his strength in the gym, he has worked really hard on himself. \"The club have worked with him really well after training, people do not see that, but the work that he puts in after training [is brilliant]. So I am delighted for him.\" READ NEXT Catch up on all the latest United news Casemiro gives United what they wanted Erik ten Hag reveals ex-United pundits do affect players Varane explains why United success may mean more than Madrid Sir Alex Ferguson advice could be about to pay off for Erik ten Hag","pubDate":"2023-02-26 20:56:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26336130.ece/ALTERNATES/s615/0_GettyImages-1469765909.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Why Cristiano Ronaldo is at Tommy Fury vs Jake Paul fight as Manchester United win Carabao Cup","link":"https://www.manchestereveningnews.co.uk/sport/boxing/ronaldo-fury-paul-man-utd-26337293","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Shane Ireland)"],"video_url":null,"description":"Former Man United forward Ronaldo was spotted in attendance at the Tommy Fury vs Jake Paul fight in Saudi Arabia on Sunday night","content":"Cristiano Ronaldo attended the Tommy Fury vs Jake Paul boxing match in Saudi Arabia on the same day Manchester United won the Carabao Cup at Wembley. United ended their six-year wait for a trophy with a 2-0 victory over Newcastle United on Sunday, with Casemiro opening the scoring before Newcastle defender Sven Botman deflected Marcus Rashford’s effort into his own net. Ronaldo, meanwhile, was spotted in attendance for Fury’s fight against American YouTube star Paul . The fight is taking place in Riyadh. LIVE UPDATES: Follow Fury vs Paul here Ronaldo left United last year after his controversial interview with Piers Morgan. The Portugal international criticised several elements of the club in the interview with the broadcaster, including manager Erik ten Hag. In November, Ronaldo’s contract at Old Trafford was terminated by mutual consent and the 38-year-old joined Saudi side Al-Nassr after the World Cup. The forward is reportedly earning over £170million per year having signed what is claimed to be the most lucrative contract in football history. Paul said in the build-up to the fight that Ronaldo would be in attendance. Morgan confirmed this shortly after , saying: “Quick update to the end of that conversation: Cristiano Ronaldo has just told me he is going to the fight on Sunday. And he thinks it’s going to be a great fight, which many people do - so there we are.” Ronaldo’s club Al-Nassr are based in Riyadh, which is around a 20-minute drive from the Diriyah Arena where the fight is taking place. Ronaldo scored a hat-trick as Al-Nassr beat Damac 3-0 on Saturday to go back to the top of the table. Their next match is on Friday, March 3. Ronaldo has previously posed for photos with boxing legend Floyd Mayweather, who made his UK debut in an exhibition bout against Geordie Shore star Aaron Chalmers on Saturday night. Ronaldo has also shown an interest in other combat sports. He posed with two-weight UFC champion Conor McGregor in a gym. United co-chairman Glazer attended only his sixth United match in the last four years to see the win against Newcastle. Ten Hag said: \"He was really happy, really happy for the club, as an owner. So I really wanted (him) to be part of it. He was in the dressing room, very good he was there to show his intentions.\" READ MORE: 'Only people at the club know' - interview with Marcus Rashford 'Sometimes I want to kill' - Martinez on becoming Man United's cult hero Ten Hag invites Sir Alex into dressing room Ten Hag has as much impact as the players in memorable win vs Barca All the United news and views","pubDate":"2023-02-26 20:51:17","image_url":"https://i2-prod.manchestereveningnews.co.uk//article26337222.ece/ALTERNATES/s615/0_escenic-36.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Thuram en mode total régal... Les notes des joueurs de l'OGC Nice après la victoire dans le derby de la Côte d'Azur","link":"https://www.nicematin.com/football/thuram-en-mode-total-regal-les-notes-des-joueurs-de-logc-nice-apres-la-victoire-dans-le-derby-de-la-cote-dazur-830851","keywords":null,"creator":null,"video_url":null,"description":"L'OGC Nice s'est offert l'AS Monaco (3-0), ce dimanche au Stade Louis-II lors de la 25e journée de L1 grâce à un grand Khéphren Thuram et un immense Terem Moffi.","content":"SCHMEICHEL (6): Golovin est le premier à l’alerter en seconde période (48’, 56’). Ben Yedder n’était pas inspiré non plus, du coup le Danois a passé un derby plutôt tranquille. YOUSSOUF (7): autant sa première période a été globalement délicate malgré deux grosses remontées de balle au pied (16’, 42’), autant il a été énorme quand il est repassé au milieu après la pause. Outre ses replis incroyables, sa solidité au contact, il offre un bon ballon à Thuram dans la profondeur (58’). TODIBO (7): tout en vitesse (30’) ou en couverture des copains (40’), il a été intraitable défensivement. Fidèle à lui-même. DANTE (8): ça faisait longtemps qu’on n’avait pas revu sa spéciale, cette ouverture géniale dans le dos des défenseurs qui a régalé la fusée Terem Moffi (8’). Énorme défensivement aussi, même les crampes (68’) ne l’ont pas arrêté. LOTOMBA (6): plus à l’aise sans le ballon qu’avec hier, le Suisse a fait le taf puisqu’il n’a jamais été mis en difficulté dans son couloir droit. BOUDAOUI (7): un pied, un tibia, il avait toujours un membre qui traînait pour contrer son adversaire aux abords de la surface. L’Algérien a encore couvert du terrain et colmaté les brèches. Essentiel, avant de céder sa place à Barkley (81’), qui a failli signer le 4-0 si Nübel ne s’était pas réveillé après la pause. AMRAOUI (6): très appliqué pour sa première chez les pros, il a collectionné les interventions intelligentes et décisives. Du très bon boulot dans un contexte de derby peu évident à appréhender. RAMSEY (NN): il était appliqué et très utile dans le 5-4-1 sans ballon quand son match s’est arrêté sur blessure (34’). Remplacé par Rosario, qui a encore été au diapason dans l’engagement dès ses premières foulées. Pas maladroit non plus pour orienter et lancer Brahimi face au but (84’). THURAM (8): Lilian a dû apprécier le spectacle. Le petit brossé du fiston est parfait pour que son ouverture arrive dans la course de Moffi sur le deuxième but (26’). Le rush, le décalage sur Moffi, la demi-volée, tout est magnifique lorsqu’il signe le 3-0 (43’). Replacé ailier gauche à la pause, il régale encore l’assistance avec son enchaînement contrôle de la poitrine, volée que Nübel repousse en corner (58’). Remplacé par Sofiane Diop (71’). LABORDE (5): il a raturé beaucoup de transmissions et ainsi annihilé quelques beaux coups. Mais à sa décharge, son activité énorme dans le repli, les ballons qu’il a pu gratter ont grignoté sa lucidité. Remplacé par Bouanani (81’), qui a sollicité Nübel en fin de match. MOFFI (9): un doublé, une passe décisive, il a parfaitement choisi son match pour lancer sa nouvelle aventure avec le Gym. ça fait 14 réalisations en Ligue 1 pour le Nigérian. Il n’était pas loin du triplé si Nübel n’avait pas réalisé la parade sur sa frappe puissante (67’). Remplacé par Brahimi (81’), qui a raté son duel avec Nübel, gêné par Sarr (84’).","pubDate":"2023-02-26 20:39:00","image_url":"https://fyooyzbm.filerobot.com/v7/Image+20230226NIM4409-pPegO1O6.jpg?vh=ed7dc6&ci_seal=da536ba389&p=medium&v2&gravity=auto","source_id":"nicematin","category":["sports"],"country":["france"],"language":"french"},{"title":"Erik ten Hag explains Avram Glazer attendance at Manchester United Carabao Cup final win","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-glazer-ten-hag-26337171","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Samuel Luckhurst)"],"video_url":null,"description":"Erik ten Hag was congratulated by co-chairman Avram Glazer amid offers to buy the club from Sheikh Jassim bin Hamad al-Thani and Sir Jim Ratcliffe.","content":"Manchester United manager Erik ten Hag says Avram Glazer wanted to \"show his intentions\" with his presence at the League Cup final victory over Newcastle. United co-chairman Glazer attended only his sixth United match in the last four years to see their 2-0 victory over Newcastle at Wembley. Sheikh Jassim bin Hamad al-Thani and Sir Jim Ratcliffe submitted proposals to buy United before a soft deadline on February 17. Read more: United player ratings as they win the Carabao Cup The United supporters booed Glazer when he appeared on the big screen and he was filmed congratulating Ten Hag in the stands and outside the dressing room. \"He was really happy, really happy for the club, as an owner. So I was really wanted (him) to be part of it. He was in the dressing room, very good he was there to show his intentions.\" When asked if that indicated Glazer's stance on investment in the club, Ten Hag replied: \"I don't know, I'm not involved in that process. \"Thank you for the question. But I think the way that he is here shows you feel that he is committed about the process, about what he wants is not for me. I have to perform this team, this dressing room and others at the club are involved in the decisions about ownership, etc. Casemiro nodded in United's opening goal in the 33rd minute and a Sven Botman own goal six minutes later deflated Newcastle as United ended a trophy drought that had strayed close to six years. The triumph capped a fine February for Ten Hag, who presided over eight unbeaten games as United progressed in the Europa League over Barcelona and ended the month third in the Premier League table. Now United have secured silverware, Ten Hag hopes it will inspire the squad to achieve greater things. \"It's true even if you take that (the Barcelona win) into account), it's a massive performance that we can deliver this. \"And that tells you we are fit, physically fit, mentally fit. They had energy so I think it was a great performance in that perspective for us. \"We are not only hoping but to know that it's worth to invest, to know that it's worth to suffer and to sacrifice and to know you have to give every day your best to celebrate. It's all about that; glory and honour. \"If you want to win something, if you want to prove something, you have to do it, otherwise you don't get it, because nobody is bringing you something in top football. \"It shows one thing: that you are on a good pathway, you are in a good direction. It is one cup in February but it shows the right direction. \"This has to be the inspiration, this has to be the motivation to continue in this pathway and improve and don't be happy. Okay, be happy for 24 hours but not be satisfied because satisfaction leads to laziness and when you get lazy you don't win any more games and you can't win trophies.\" READ MORE: 'Only people at the club know' - interview with Marcus Rashford 'Sometimes I want to kill' - Martinez on becoming Man United's cult hero Ten Hag invites Sir Alex into dressing room Ten Hag has as much impact as the players in memorable win vs Barca All the United news and views","pubDate":"2023-02-26 20:21:42","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26337191.ece/ALTERNATES/s615/0_Screenshot-2023-02-26-201158.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Mbappé e Messi marcam, PSG vence Olympique e abre vantagem no Francês","link":"https://www.mg.superesportes.com.br/app/noticias/futebol/futebol-internacional/2023/02/26/noticia_futebol_internacional,3989316/mbappe-e-messi-marcam-psg-vence-olympique-e-abre-vantagem-no-frances.shtml","keywords":["Futebol Internacional"],"creator":null,"video_url":null,"description":" Neste domingo, o Paris Saint-Germain venceu o Olympique de Marselha por 3 a 0, pela 25ª rodada do Campeonato Francês, fora de casa, no Stade Vélodrome. Com isso, abriu uma vantagem de oito pontos no torneio. Messi e Mbappé (2x) marcaram para os visitantes.Em seu próximo compromisso, os comandados de Christophe Galtier enfrentam o Nantes no próximo dia 4, às 17h (de Brasília), na condição de mandante, no Parque dos Príncipes.Do outro lado, o Olympique de Marselha vê a possibilidade de título no Campeonato Francês ficar mais distante. Assim, encara o Football Club d'Annecy pelas quartas de finais da Copa da França, nessa quarta-feira, às 17h, em casa.O jogoAs duas primeiras oportunidades claras de gol foram do Olympique de Marselha. Na primeira, Nuno Tavares invadiu a área e foi travado pelo defensor. E, na segunda, o lateral esquerdo ficou cara a cara com o Donnarumma, mas chutou torto.  Mesmo com a pressão dos mandantes, quem abriu o placar foi o Paris Saint-Germain, Messi acha Mbappé, que bateu cruzado para o fundo do gol. Depois, Bailly empatou, mas o tento foi anulado. Após servir o francês, foi a vez do argentino marcar. O craque tocou na saída do goleiro e ampliou a vantagem.No final da primeira etapa, os dois protagonistas do PSG perderam a oportunidade de ir para o intervalo mais tranquilos. Na sequência, Marquinhos apareceu como centroavante, mas também não conseguiu acertar a meta. O Olympique de Marselha até tentou diminuir, mas Nuno Tavares chutou para fora e, na chance de Alexis Sanchéz, o goleiro italiano deu um tapa para fora.Assim como na primeira etapa, o jogo começou frenético. Após perdeu outra chance de ampliar, Mbappé tabelou com Messi e marcou o seu segundo gol na partida.Com a vantagem, o Paris Saint-Germain diminuiu o ritmo. Assim, as melhores chances passaram a ser dos mandantes. Porém, não conseguiu fazer o gol de honra.","content":"foto: NICOLAS TUCAT / AFP Mbappé e Messi marcaram na vitória do PSG Neste domingo, o Paris Saint-Germain venceu o Olympique de Marselha por 3 a 0, pela 25ª rodada do Campeonato Francês, fora de casa, no Stade Vélodrome. Com isso, abriu uma vantagem de oito pontos no torneio. Messi e Mbappé (2x) marcaram para os visitantes. Em seu próximo compromisso, os comandados de Christophe Galtier enfrentam o Nantes no próximo dia 4, às 17h (de Brasília), na condição de mandante, no Parque dos Príncipes. Do outro lado, o Olympique de Marselha vê a possibilidade de título no Campeonato Francês ficar mais distante. Assim, encara o Football Club d'Annecy pelas quartas de finais da Copa da França, nessa quarta-feira, às 17h, em casa. O jogo As duas primeiras oportunidades claras de gol foram do Olympique de Marselha. Na primeira, Nuno Tavares invadiu a área e foi travado pelo defensor. E, na segunda, o lateral esquerdo ficou cara a cara com o Donnarumma, mas chutou torto. Saiba mais Barcelona perde do Almería e vê Real Madrid se aproximar no Espanhol Bayern bate Union Berlin em confronto direto e segue na liderança do Alemão United bate Newcastle com gol de Casemiro, finda jejum e ganha Copa da Liga Para cortar gastos, PSG pode deixar Messi sair na próxima temporada Mesmo com a pressão dos mandantes, quem abriu o placar foi o Paris Saint-Germain, Messi acha Mbappé, que bateu cruzado para o fundo do gol. Depois, Bailly empatou, mas o tento foi anulado. Após servir o francês, foi a vez do argentino marcar. O craque tocou na saída do goleiro e ampliou a vantagem. No final da primeira etapa, os dois protagonistas do PSG perderam a oportunidade de ir para o intervalo mais tranquilos. Na sequência, Marquinhos apareceu como centroavante, mas também não conseguiu acertar a meta. O Olympique de Marselha até tentou diminuir, mas Nuno Tavares chutou para fora e, na chance de Alexis Sanchéz, o goleiro italiano deu um tapa para fora. Assim como na primeira etapa, o jogo começou frenético. Após perdeu outra chance de ampliar, Mbappé tabelou com Messi e marcou o seu segundo gol na partida. Com a vantagem, o Paris Saint-Germain diminuiu o ritmo. Assim, as melhores chances passaram a ser dos mandantes. Porém, não conseguiu fazer o gol de honra.","pubDate":"2023-02-26 22:35:00","image_url":null,"source_id":"superesportes","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"O gol de Yuri Alberto foi bem anulado? Veja o que diz a regra","link":"https://www.meutimao.com.br/noticias-do-corinthians/442467/o-gol-de-yuri-alberto-foi-bem-anulado-veja-o-que-diz-a-regra","keywords":null,"creator":null,"video_url":null,"description":"A Torcida do Corinthians repercutiu bastante o gol anulado de Yuri Alberto no primeiro tempo do empate contra o Santos. Mas estava realmente impedido? Veja o que a regra diz.","content":"Ainda na primeira etapa do empate entre Corinthians e Santos , Yuri Alberto conseguiu balançar as redes adversárias duas vezes, mas um dos tentos foi anulado por um suposto impedimento do atacante. Após o apito final, a Fiel criticou bastante a árbitra Edina Alves Batista pela invalidação do gol. O lance ocorreu por volta dos 26 minutos. Nele, Renato Augusto fez um passe para Du Queiroz no corredor direito do ataque corinthiano. Neste momento, o camisa 9 alvinegro se movimentou para posicionar-se dentro da área santista, mas no caminho acabou trombando com um rival, impedindo que ele alcançasse o volante alvinegro. Este encontrão foi o motivo da anulação. Mas a ação foi correta? O Meu Timão buscou na regras do futebol e te mostra, torcedor, como funciona a regra de impedimento. Antes de tudo, vale lembrar que um jogador está impedido quando ele está atrás da linha da bola e/ou do penúltimo marcador adversário. Portanto, Yuri Alberto estava sim impedido na origem do lance. No entanto, só é considerado infração e o árbitro ou auxiliar deve assinalar impedimento se ele tiver interferido no lance de forma direta ou indireta. A Confederação Brasileira de Futebol (CBF) ainda não divulgou o livro de regras de 2023, mas, segundo a edição de 2022, é considerada interferência em duas ocasiões: Já a edição de 2023 do International Football Association Board (IFAB), órgão da Fifa que regulamenta as regras do futebol, diz que o jogador impedido comete uma infração quando: Tanto a CBF quanto o IFAB dizem que o árbitro de vídeo só deve entrar em ação quando percebe algum erro claro do juiz da partida em campo ou de algum \"incidente grave despercebido\" relacionado a algum gol, pênalti, cartão vermelho direto (segundo amarelo não é levado em consideração) ou erro de identificação de qualquer punição (seja cartão amarelo ou vermelho). Ainda, o árbitro do campo é quem toma a decisão final , a partir do que o responsável pelo VAR lhe informar, o que viu do lance e no replay da cabine. Veja mais em: Arbitragem , Erros de arbitragem , Corinthians x Santos , Yuri Alberto e Campeonato Paulista .","pubDate":"2023-02-26 22:26:00","image_url":null,"source_id":"meutimao","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"Mbappé e Messi brilham, PSG vence Marseille e dispara na liderança da Ligue 1","link":"http://www.lance.com.br/futebol-internacional/mbappe-e-messi-brilham-psg-vence-marseille-e-dispara-na-lideranca-da-ligue.html","keywords":["Futebol Internacional"],"creator":["Luiz Eduardo"],"video_url":null,"description":null,"content":"Segue o líder! O Paris Saint-Germain venceu o clássico contra o Olympique de Marseille por 3 a 0, fora de casa, neste domingo, em partida que valeu pela 25ª rodada da Ligue 1 2022/23. Kylian Mbappé, duas vezes, e Lionel Messi marcaram para o PSG. Neymar desfalcou a equipe, visto que está se recuperando de uma lesão no tornozelo. Com o resultado, os comandados de Christophe Galtier chegaram aos 60 pontos e ampliaram a vantagem na liderança do Francês para oito à frente do próprio Marseille, que é o vice-líder da competição, com 52. A vitória deixa a vida do PSG mais fácil na briga pelo título nacional. SENTIU Aos 11 minutos do primeiro tempo, o zagueiro Kimpembé sentiu um problema muscular e caiu sozinho no gramado após contragolpe do Marseille. O defensor, que havia voltado há pouco tempo, teve de deixar a partida de maca e deve desfalcar novamente a equipe do PSG nos próximos compromissos. MESSI PARA MBAPPÉ A noite em Marselha foi dos astros do Paris. Aos 25 minutos, Messi arrancou pelo meio, tocou para Mbappé avançar com a bola e o francês tocou na saída do goleiro Pau López, abrindo o placar no Vélodrome para o PSG, 1 a 0. + Veja a tabela da Ligue 1 2022/23 MBAPPÉ PARA MESSI Aos 29, foi a vez do francês retribuir a assistência para o argentino. Mbappé recebeu pela esquerda, encarou a marcação de Bailly e tocou na medida para Messi mandar para o fundo das redes, dobrando a vantagem do PSG no clássico. DISCO REPETIDO Mesmo após o intervalo, a história do jogo não mudou. Aos nove minutos do segundo tempo, novamente Messi achou Mbappé, desta vez com um lindo passe de cavadinha e o francês soltou o pé esquerdo, de primeira, para fazer o terceiro gol do PSG contra o Marseille e fechar a conta no Vélodrome: 3 a 0 e liderança da Ligue 1 consolidada. AGENDA ​O PSG volta a campo no próximo sábado, às 17h (de Brasília), em casa contra o Nantes, pelo Campeonato Francês. O Olympique de Marseille, por sua vez, enfrenta o Football Club d'Annecy na quarta-feira, também às 17h (de Brasília), mas pela Copa da França.","pubDate":"2023-02-26 22:17:21","image_url":"http://www.lance.com.br//files//uploads/2023/02/26/63fbcbeb217d1.jpeg","source_id":"lance","category":["top","sports"],"country":["brazil"],"language":"portuguese"},{"title":"Amakhosi on the hunt after fortuitous win eases pressure on coach Arthur Zwane","link":"https://www.dailymaverick.co.za/article/2023-02-27-amakhosi-on-the-hunt-after-fortuitous-win-eases-pressure-on-coach-arthur-zwane/","keywords":null,"creator":["Yanga Sibembe"],"video_url":null,"description":"The biggest match on the South African soccer calendar was a cagey and drab affair, but Kaizer Chiefs’ 1-0 win over Orlando Pirates on Saturday marks their fifth victory in a row over their in-form Soweto neighbour. The post Amakhosi on the hunt after fortuitous win eases pressure on coach Arthur Zwane appeared first on Daily Maverick.","content":"Victory for Kaizer Chiefs against Orlando Pirates on Saturday, 25 February, eased pressure on the former team’s coach, Arthur Zwane, keeping Amakhosi in the hunt for second spot on the Premiership table. Kaizer Chiefs edged Orlando Pirates 1-0 for the second time this season to complete a second league double on the trot against their bitter rivals. The biggest match on the South African soccer calendar was far from a memorable spectacle, with the two teams recording a total of four shots on target. The match was a cagey and drab affair. It took a hopeful and searching diagonal ball by player of the match Edmilson Dove to force an own goal off the head of Pirates’ second-half substitute Olisa Ndah. Yusuf Maart of Kaizer Chiefs and Tapelo Xoki of Orlando Pirates in action at FNB Stadium on 25 February 2023 in Johannesburg, South Africa. (Photo: Lefty Shivambu / Gallo Images) With just one minute left to play of the regulation 90 minutes, the Nigerian defender flicked the ball over Buccaneers goalkeeper Sipho Chaine, who had come off his line in an attempt to intercept the long pass. That sequence of miscommunication compounded the Bucs’ misery in front of a crowd of just more than 78,000 at the FNB Stadium in the south of Johannesburg. They had already been playing with 10 men after captain Innocent Maela was sent off at the one-hour mark. The narrow win for Amakhosi will have eased the mounting pressure on the Naturena-based side’s coach, Zwane. There have been calls from sections of Chiefs’ fanbase for the former Amakhosi and Bafana Bafana midfielder to vacate his seat. These murmurs had amplified in recent weeks, with the Glamour Boys claiming just one win from their five league matches preceding the derby. In that period they suffered three defeats and played to one draw. In spite of that not-so-favourable return, the Chiefs’ hierarchy threw its weight behind Zwane and offered the public reassurance that he was still their man as they sought to end an eight-year trophy drought. Visit Daily Maverick’s home page for more news, analysis and investigations Zwane – who played more than 150 games for Amakhosi in the early to late 2000s, collecting numerous trophies along the way – was appointed as the club’s head coach in May 2022. He was tasked with bringing back a culture of winning to the team and reigniting the fighting spirit of one of the most successful clubs in Africa. Zwane still believes he is the right man for the job, and that eventually the seeds he is planting and tending to will reap the desired fruit. “I’ve said it in the past that the club has a plan. We know when you start something there’ll be a rough patch because you are trying to lay a strong foundation,” Zwane told journalists after the match. Amakhosi may be extremely inconsistent as they continue trying to bounce back to their former glory. But one thing that has remained consistent in recent seasons is beating their Soweto neighbours. The 1-0 win on Saturday was the fifth in a row for Chiefs in this league fixture. This is even though Sea Robbers headed into the tie as the in-form side, having claimed four wins from their five most recent matches. Zwane downplayed Chiefs’ impressive streak over their nemesis, saying it was just another fixture that they aimed to do well in, which was the target in every match they played. “It’s just another six points for us. I don’t want the players to only focus on beating Orlando Pirates. We want to beat every team that we come across because the league is a marathon, it’s not just winning against Pirates. But the win is important for us as a club, knowing our history with them,” Zwane told journalists. With these three points, Chiefs kept themselves firmly in the race for second place and clinching the final Caf Champions League spot – with Mamelodi Sundowns sprinting to the Premiership title and the primary continental football spot. Gavin Hunt’s SuperSport occupy second spot with 36 points. They strengthened their position by beating the relegation-threatened Maritzburg United 2-0 on Friday. With defeat in the derby, third-placed Pirates now trail Hunt’s men by five points. Level with them on 31 points are fourth-placed Richards Bay and Amakhosi in fifth. The Sea Robbers lead the duo due to a marginally superior goal difference. With nine games left to play this campaign, the scramble for second spot is on. “We are thinking week by week. We just need to prepare for the next game. That’s all,” said Pirates’ assistant coach Sergio Almenara when asked about the sprint for second. Chiefs are next in action again on Saturday, 4 March, in a crucial clash against Richards Bay in the tight pursuit for second place. The Buccaneers will tussle with Swallows on Friday, 3 March. DM","pubDate":"2023-02-26 22:03:51","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Man City to battle rivals for Brighton star Alexis Mac Allister and other transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-city-mac-allister-gossip-26334953","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Brighton and Hove Albion's midfielder was a key man for Argentina at the World Cup and his name features in today's Man City transfer gossip.","content":"Manchester City are reportedly 'hot on the heels' of Brighton and Hove Albion's World Cup winner Alexis Mac Allister. After not appearing in Argentina's opening defeat to Saudi Arabia, Mac Allister was introduced for the remainder of the tournament and proved to be an unsung hero for Lionel Messi's team, scoring once and grabbing an assist in the final victory over France. Upon his return to England, the 24-year-old continued to impress. He scored twice in his first game back in the FA Cup victory over Middlesbrough and he has also adapted a game to suit Brighton's needs. At the beginning of the season, Mac Allister played in the defensive midfield role but has since played in central and attacking midfield positions. ALSO READ: Lewis explains why City squad were 'gutted' after victory This flexibility and form has led Pep Guardiola to become interested in the Argentine, according to the Daily Star . They claim that Guardiola sees Mac Allister as the perfect addition to his squad. However, the report warns that Chelsea, Arsenal and Liverpool are also keen on the 24-year-old. Elsewhere, Football Insider are claiming that Barcelona are continuing to push for the signing of Ilkay Gundogan . Gundogan became City's captain at the beginning of the season following Fernandinho's departure from the Etihad Stadium. The 32-year-old's contract is due to expire at the end of the campaign and it is unclear whether the German will commit to a new deal. Barca meanwhile are looking for players who could replace Sergio Busquets and they have reportedly earmarked Gundogan as a target. It is claimed in the report that City are not close to agreeing a new contract with the ex-Borussia Dortmund man and that Xavi, Barcelona's manager, is a big fan of the midfielder. READ NEXT: Get all the latest City news here Alvarez sends message to Foden Haaland verdict on City win Bournemouth boss gives verdict on win Guardiola explains full time reaction","pubDate":"2023-02-26 21:00:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26335045.ece/ALTERNATES/s615/0_GettyImages-1467430720.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ten Hag snags Manchester United’s first title in six years","link":"https://www.premiumtimesng.com/sports/football/584746-ten-hag-snags-manchester-uniteds-first-title-in-six-years.html","keywords":["Football","Bruno Guimaraes","Man united","Manchester United","Rashford","Ten Hag"],"creator":["Jide Alaka"],"video_url":null,"description":"Six years after their last title, new manager Erik ten Hag led Manchester United to the Carabao Cup title. The post Ten Hag snags Manchester United’s first title in six years appeared first on Premium Times Nigeria.","content":"Two first-half goals from Casemiro and an own goal gave Manchester United a 2-0 victory over Newcastle United in the Carabao Cup final on Sunday at Wembley. Both teams came into Sunday’s final needing to snap a trophy drought. While the United from Manchester had last won a trophy in 2017; Newcastle’s drought stretched back to 2006 when the Magpies won the UEFA Intertoto Cup. Both United teams had the full complement of their first teamers, with Manchester having Casemiro and Newcastle having Bruno Guimaraes back from the red card he got in the semifinal. And the Magpies started the better of the two teams, controlling the midfield through their two Brazilians in Joelinton and Guimaraes. Despite the early pressure, it was Manchester United that took the lead through Casemiro, who rose highest to head home a Luke Shaw free kick in the 32nd minute. There was a VAR check, but the former Real Madrid midfielder was ruled to be onside by a hair’s breadth. Marcus Rashford combined brilliantly with Wout Weghorst in the 39th minute before driving into the box and seeing his shot deflect off of Sven Botman before eluding Loris Karius in the Newcastle goal. After the match, Erik ten Hag said getting the first trophy was the start of the journey. “It was not always the best football, but it was effective. Firstly, you have to win the first one [trophy]. We will get a lot of inspiration from this, but also more confidence that we can do it.” The victory comes three days after beating Barcelona to qualify for the round of 16 in the Europa League. Donate TEXT AD: Call Willie - +2348098788999","pubDate":"2023-02-26 20:56:28","image_url":null,"source_id":"premiumtimesng","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"'People don't see that' - Phil Jones on how Marcus Rashford has reignited his Man United career","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/marcus-rashford-jones-manchester-united-26336012","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Rashford has been Manchester United's star man so far this season and has been undroppable under Erik ten Hag","content":"Manchester United defender Phil Jones believes that it is Marcus Rashford's mentality that has helped him improve his form this season. Rashford is United's leading goalscorer this term having notched just five in all competitions last campaign. Erik ten Hag has previously compared the Englishman to Kylian Mbappe for his ability to get in behind the opposition defence. Despite being injured this season, Jones has been able to observe Rashford's rise at Carrington. He told Sky Sports , ahead of the Carabao Cup final, that the 25-year-old's dedication sets him apart from other players. ALSO READ: United player ratings vs Newcastle Jones explained: \"I think it is his maturity, especially after the World Cup where he did not start as many games as he would have liked. He has knuckled down and got on with it. He has become sharper, stronger and you see that in the reflection of his performances this season. \"Defenders find him really hard to deal with, cope with him. He can take it one way, take it the other way. His goals [are] from outside the box, inside the box, he has scored a few headers lately as well. \"His all-round game at the minute has hit heights that probably even he didn't think he would get to. But he has been brilliant. \"He probably will not thank me for it but I think, on current form, he is the best player in the world.\" He added: \" His body shape, his strength in the gym, he has worked really hard on himself. \"The club have worked with him really well after training, people do not see that, but the work that he puts in after training [is brilliant]. So I am delighted for him.\" READ NEXT Catch up on all the latest United news Casemiro gives United what they wanted Erik ten Hag reveals ex-United pundits do affect players Varane explains why United success may mean more than Madrid Sir Alex Ferguson advice could be about to pay off for Erik ten Hag","pubDate":"2023-02-26 20:56:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26336130.ece/ALTERNATES/s615/0_GettyImages-1469765909.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Why Cristiano Ronaldo is at Tommy Fury vs Jake Paul fight as Manchester United win Carabao Cup","link":"https://www.manchestereveningnews.co.uk/sport/boxing/ronaldo-fury-paul-man-utd-26337293","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Shane Ireland)"],"video_url":null,"description":"Former Man United forward Ronaldo was spotted in attendance at the Tommy Fury vs Jake Paul fight in Saudi Arabia on Sunday night","content":"Cristiano Ronaldo attended the Tommy Fury vs Jake Paul boxing match in Saudi Arabia on the same day Manchester United won the Carabao Cup at Wembley. United ended their six-year wait for a trophy with a 2-0 victory over Newcastle United on Sunday, with Casemiro opening the scoring before Newcastle defender Sven Botman deflected Marcus Rashford’s effort into his own net. Ronaldo, meanwhile, was spotted in attendance for Fury’s fight against American YouTube star Paul . The fight is taking place in Riyadh. LIVE UPDATES: Follow Fury vs Paul here Ronaldo left United last year after his controversial interview with Piers Morgan. The Portugal international criticised several elements of the club in the interview with the broadcaster, including manager Erik ten Hag. In November, Ronaldo’s contract at Old Trafford was terminated by mutual consent and the 38-year-old joined Saudi side Al-Nassr after the World Cup. The forward is reportedly earning over £170million per year having signed what is claimed to be the most lucrative contract in football history. Paul said in the build-up to the fight that Ronaldo would be in attendance. Morgan confirmed this shortly after , saying: “Quick update to the end of that conversation: Cristiano Ronaldo has just told me he is going to the fight on Sunday. And he thinks it’s going to be a great fight, which many people do - so there we are.” Ronaldo’s club Al-Nassr are based in Riyadh, which is around a 20-minute drive from the Diriyah Arena where the fight is taking place. Ronaldo scored a hat-trick as Al-Nassr beat Damac 3-0 on Saturday to go back to the top of the table. Their next match is on Friday, March 3. Ronaldo has previously posed for photos with boxing legend Floyd Mayweather, who made his UK debut in an exhibition bout against Geordie Shore star Aaron Chalmers on Saturday night. Ronaldo has also shown an interest in other combat sports. He posed with two-weight UFC champion Conor McGregor in a gym. United co-chairman Glazer attended only his sixth United match in the last four years to see the win against Newcastle. Ten Hag said: \"He was really happy, really happy for the club, as an owner. So I really wanted (him) to be part of it. He was in the dressing room, very good he was there to show his intentions.\" READ MORE: 'Only people at the club know' - interview with Marcus Rashford 'Sometimes I want to kill' - Martinez on becoming Man United's cult hero Ten Hag invites Sir Alex into dressing room Ten Hag has as much impact as the players in memorable win vs Barca All the United news and views","pubDate":"2023-02-26 20:51:17","image_url":"https://i2-prod.manchestereveningnews.co.uk//article26337222.ece/ALTERNATES/s615/0_escenic-36.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Thuram en mode total régal... Les notes des joueurs de l'OGC Nice après la victoire dans le derby de la Côte d'Azur","link":"https://www.nicematin.com/football/thuram-en-mode-total-regal-les-notes-des-joueurs-de-logc-nice-apres-la-victoire-dans-le-derby-de-la-cote-dazur-830851","keywords":null,"creator":null,"video_url":null,"description":"L'OGC Nice s'est offert l'AS Monaco (3-0), ce dimanche au Stade Louis-II lors de la 25e journée de L1 grâce à un grand Khéphren Thuram et un immense Terem Moffi.","content":"SCHMEICHEL (6): Golovin est le premier à l’alerter en seconde période (48’, 56’). Ben Yedder n’était pas inspiré non plus, du coup le Danois a passé un derby plutôt tranquille. YOUSSOUF (7): autant sa première période a été globalement délicate malgré deux grosses remontées de balle au pied (16’, 42’), autant il a été énorme quand il est repassé au milieu après la pause. Outre ses replis incroyables, sa solidité au contact, il offre un bon ballon à Thuram dans la profondeur (58’). TODIBO (7): tout en vitesse (30’) ou en couverture des copains (40’), il a été intraitable défensivement. Fidèle à lui-même. DANTE (8): ça faisait longtemps qu’on n’avait pas revu sa spéciale, cette ouverture géniale dans le dos des défenseurs qui a régalé la fusée Terem Moffi (8’). Énorme défensivement aussi, même les crampes (68’) ne l’ont pas arrêté. LOTOMBA (6): plus à l’aise sans le ballon qu’avec hier, le Suisse a fait le taf puisqu’il n’a jamais été mis en difficulté dans son couloir droit. BOUDAOUI (7): un pied, un tibia, il avait toujours un membre qui traînait pour contrer son adversaire aux abords de la surface. L’Algérien a encore couvert du terrain et colmaté les brèches. Essentiel, avant de céder sa place à Barkley (81’), qui a failli signer le 4-0 si Nübel ne s’était pas réveillé après la pause. AMRAOUI (6): très appliqué pour sa première chez les pros, il a collectionné les interventions intelligentes et décisives. Du très bon boulot dans un contexte de derby peu évident à appréhender. RAMSEY (NN): il était appliqué et très utile dans le 5-4-1 sans ballon quand son match s’est arrêté sur blessure (34’). Remplacé par Rosario, qui a encore été au diapason dans l’engagement dès ses premières foulées. Pas maladroit non plus pour orienter et lancer Brahimi face au but (84’). THURAM (8): Lilian a dû apprécier le spectacle. Le petit brossé du fiston est parfait pour que son ouverture arrive dans la course de Moffi sur le deuxième but (26’). Le rush, le décalage sur Moffi, la demi-volée, tout est magnifique lorsqu’il signe le 3-0 (43’). Replacé ailier gauche à la pause, il régale encore l’assistance avec son enchaînement contrôle de la poitrine, volée que Nübel repousse en corner (58’). Remplacé par Sofiane Diop (71’). LABORDE (5): il a raturé beaucoup de transmissions et ainsi annihilé quelques beaux coups. Mais à sa décharge, son activité énorme dans le repli, les ballons qu’il a pu gratter ont grignoté sa lucidité. Remplacé par Bouanani (81’), qui a sollicité Nübel en fin de match. MOFFI (9): un doublé, une passe décisive, il a parfaitement choisi son match pour lancer sa nouvelle aventure avec le Gym. ça fait 14 réalisations en Ligue 1 pour le Nigérian. Il n’était pas loin du triplé si Nübel n’avait pas réalisé la parade sur sa frappe puissante (67’). Remplacé par Brahimi (81’), qui a raté son duel avec Nübel, gêné par Sarr (84’).","pubDate":"2023-02-26 20:39:00","image_url":"https://fyooyzbm.filerobot.com/v7/Image+20230226NIM4409-pPegO1O6.jpg?vh=ed7dc6&ci_seal=da536ba389&p=medium&v2&gravity=auto","source_id":"nicematin","category":["sports"],"country":["france"],"language":"french"},{"title":"Erik ten Hag explains Avram Glazer attendance at Manchester United Carabao Cup final win","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-glazer-ten-hag-26337171","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Samuel Luckhurst)"],"video_url":null,"description":"Erik ten Hag was congratulated by co-chairman Avram Glazer amid offers to buy the club from Sheikh Jassim bin Hamad al-Thani and Sir Jim Ratcliffe.","content":"Manchester United manager Erik ten Hag says Avram Glazer wanted to \"show his intentions\" with his presence at the League Cup final victory over Newcastle. United co-chairman Glazer attended only his sixth United match in the last four years to see their 2-0 victory over Newcastle at Wembley. Sheikh Jassim bin Hamad al-Thani and Sir Jim Ratcliffe submitted proposals to buy United before a soft deadline on February 17. Read more: United player ratings as they win the Carabao Cup The United supporters booed Glazer when he appeared on the big screen and he was filmed congratulating Ten Hag in the stands and outside the dressing room. \"He was really happy, really happy for the club, as an owner. So I was really wanted (him) to be part of it. He was in the dressing room, very good he was there to show his intentions.\" When asked if that indicated Glazer's stance on investment in the club, Ten Hag replied: \"I don't know, I'm not involved in that process. \"Thank you for the question. But I think the way that he is here shows you feel that he is committed about the process, about what he wants is not for me. I have to perform this team, this dressing room and others at the club are involved in the decisions about ownership, etc. Casemiro nodded in United's opening goal in the 33rd minute and a Sven Botman own goal six minutes later deflated Newcastle as United ended a trophy drought that had strayed close to six years. The triumph capped a fine February for Ten Hag, who presided over eight unbeaten games as United progressed in the Europa League over Barcelona and ended the month third in the Premier League table. Now United have secured silverware, Ten Hag hopes it will inspire the squad to achieve greater things. \"It's true even if you take that (the Barcelona win) into account), it's a massive performance that we can deliver this. \"And that tells you we are fit, physically fit, mentally fit. They had energy so I think it was a great performance in that perspective for us. \"We are not only hoping but to know that it's worth to invest, to know that it's worth to suffer and to sacrifice and to know you have to give every day your best to celebrate. It's all about that; glory and honour. \"If you want to win something, if you want to prove something, you have to do it, otherwise you don't get it, because nobody is bringing you something in top football. \"It shows one thing: that you are on a good pathway, you are in a good direction. It is one cup in February but it shows the right direction. \"This has to be the inspiration, this has to be the motivation to continue in this pathway and improve and don't be happy. Okay, be happy for 24 hours but not be satisfied because satisfaction leads to laziness and when you get lazy you don't win any more games and you can't win trophies.\" READ MORE: 'Only people at the club know' - interview with Marcus Rashford 'Sometimes I want to kill' - Martinez on becoming Man United's cult hero Ten Hag invites Sir Alex into dressing room Ten Hag has as much impact as the players in memorable win vs Barca All the United news and views","pubDate":"2023-02-26 20:21:42","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26337191.ece/ALTERNATES/s615/0_Screenshot-2023-02-26-201158.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Mbappé e Messi marcam, PSG vence Olympique e abre vantagem no Francês","link":"https://www.mg.superesportes.com.br/app/noticias/futebol/futebol-internacional/2023/02/26/noticia_futebol_internacional,3989316/mbappe-e-messi-marcam-psg-vence-olympique-e-abre-vantagem-no-frances.shtml","keywords":["Futebol Internacional"],"creator":null,"video_url":null,"description":" Neste domingo, o Paris Saint-Germain venceu o Olympique de Marselha por 3 a 0, pela 25ª rodada do Campeonato Francês, fora de casa, no Stade Vélodrome. Com isso, abriu uma vantagem de oito pontos no torneio. Messi e Mbappé (2x) marcaram para os visitantes.Em seu próximo compromisso, os comandados de Christophe Galtier enfrentam o Nantes no próximo dia 4, às 17h (de Brasília), na condição de mandante, no Parque dos Príncipes.Do outro lado, o Olympique de Marselha vê a possibilidade de título no Campeonato Francês ficar mais distante. Assim, encara o Football Club d'Annecy pelas quartas de finais da Copa da França, nessa quarta-feira, às 17h, em casa.O jogoAs duas primeiras oportunidades claras de gol foram do Olympique de Marselha. Na primeira, Nuno Tavares invadiu a área e foi travado pelo defensor. E, na segunda, o lateral esquerdo ficou cara a cara com o Donnarumma, mas chutou torto.  Mesmo com a pressão dos mandantes, quem abriu o placar foi o Paris Saint-Germain, Messi acha Mbappé, que bateu cruzado para o fundo do gol. Depois, Bailly empatou, mas o tento foi anulado. Após servir o francês, foi a vez do argentino marcar. O craque tocou na saída do goleiro e ampliou a vantagem.No final da primeira etapa, os dois protagonistas do PSG perderam a oportunidade de ir para o intervalo mais tranquilos. Na sequência, Marquinhos apareceu como centroavante, mas também não conseguiu acertar a meta. O Olympique de Marselha até tentou diminuir, mas Nuno Tavares chutou para fora e, na chance de Alexis Sanchéz, o goleiro italiano deu um tapa para fora.Assim como na primeira etapa, o jogo começou frenético. Após perdeu outra chance de ampliar, Mbappé tabelou com Messi e marcou o seu segundo gol na partida.Com a vantagem, o Paris Saint-Germain diminuiu o ritmo. Assim, as melhores chances passaram a ser dos mandantes. Porém, não conseguiu fazer o gol de honra.","content":"foto: NICOLAS TUCAT / AFP Mbappé e Messi marcaram na vitória do PSG Neste domingo, o Paris Saint-Germain venceu o Olympique de Marselha por 3 a 0, pela 25ª rodada do Campeonato Francês, fora de casa, no Stade Vélodrome. Com isso, abriu uma vantagem de oito pontos no torneio. Messi e Mbappé (2x) marcaram para os visitantes. Em seu próximo compromisso, os comandados de Christophe Galtier enfrentam o Nantes no próximo dia 4, às 17h (de Brasília), na condição de mandante, no Parque dos Príncipes. Do outro lado, o Olympique de Marselha vê a possibilidade de título no Campeonato Francês ficar mais distante. Assim, encara o Football Club d'Annecy pelas quartas de finais da Copa da França, nessa quarta-feira, às 17h, em casa. O jogo As duas primeiras oportunidades claras de gol foram do Olympique de Marselha. Na primeira, Nuno Tavares invadiu a área e foi travado pelo defensor. E, na segunda, o lateral esquerdo ficou cara a cara com o Donnarumma, mas chutou torto. Saiba mais Barcelona perde do Almería e vê Real Madrid se aproximar no Espanhol Bayern bate Union Berlin em confronto direto e segue na liderança do Alemão United bate Newcastle com gol de Casemiro, finda jejum e ganha Copa da Liga Para cortar gastos, PSG pode deixar Messi sair na próxima temporada Mesmo com a pressão dos mandantes, quem abriu o placar foi o Paris Saint-Germain, Messi acha Mbappé, que bateu cruzado para o fundo do gol. Depois, Bailly empatou, mas o tento foi anulado. Após servir o francês, foi a vez do argentino marcar. O craque tocou na saída do goleiro e ampliou a vantagem. No final da primeira etapa, os dois protagonistas do PSG perderam a oportunidade de ir para o intervalo mais tranquilos. Na sequência, Marquinhos apareceu como centroavante, mas também não conseguiu acertar a meta. O Olympique de Marselha até tentou diminuir, mas Nuno Tavares chutou para fora e, na chance de Alexis Sanchéz, o goleiro italiano deu um tapa para fora. Assim como na primeira etapa, o jogo começou frenético. Após perdeu outra chance de ampliar, Mbappé tabelou com Messi e marcou o seu segundo gol na partida. Com a vantagem, o Paris Saint-Germain diminuiu o ritmo. Assim, as melhores chances passaram a ser dos mandantes. Porém, não conseguiu fazer o gol de honra.","pubDate":"2023-02-26 22:35:00","image_url":null,"source_id":"superesportes","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"O gol de Yuri Alberto foi bem anulado? Veja o que diz a regra","link":"https://www.meutimao.com.br/noticias-do-corinthians/442467/o-gol-de-yuri-alberto-foi-bem-anulado-veja-o-que-diz-a-regra","keywords":null,"creator":null,"video_url":null,"description":"A Torcida do Corinthians repercutiu bastante o gol anulado de Yuri Alberto no primeiro tempo do empate contra o Santos. Mas estava realmente impedido? Veja o que a regra diz.","content":"Ainda na primeira etapa do empate entre Corinthians e Santos , Yuri Alberto conseguiu balançar as redes adversárias duas vezes, mas um dos tentos foi anulado por um suposto impedimento do atacante. Após o apito final, a Fiel criticou bastante a árbitra Edina Alves Batista pela invalidação do gol. O lance ocorreu por volta dos 26 minutos. Nele, Renato Augusto fez um passe para Du Queiroz no corredor direito do ataque corinthiano. Neste momento, o camisa 9 alvinegro se movimentou para posicionar-se dentro da área santista, mas no caminho acabou trombando com um rival, impedindo que ele alcançasse o volante alvinegro. Este encontrão foi o motivo da anulação. Mas a ação foi correta? O Meu Timão buscou na regras do futebol e te mostra, torcedor, como funciona a regra de impedimento. Antes de tudo, vale lembrar que um jogador está impedido quando ele está atrás da linha da bola e/ou do penúltimo marcador adversário. Portanto, Yuri Alberto estava sim impedido na origem do lance. No entanto, só é considerado infração e o árbitro ou auxiliar deve assinalar impedimento se ele tiver interferido no lance de forma direta ou indireta. A Confederação Brasileira de Futebol (CBF) ainda não divulgou o livro de regras de 2023, mas, segundo a edição de 2022, é considerada interferência em duas ocasiões: Já a edição de 2023 do International Football Association Board (IFAB), órgão da Fifa que regulamenta as regras do futebol, diz que o jogador impedido comete uma infração quando: Tanto a CBF quanto o IFAB dizem que o árbitro de vídeo só deve entrar em ação quando percebe algum erro claro do juiz da partida em campo ou de algum \"incidente grave despercebido\" relacionado a algum gol, pênalti, cartão vermelho direto (segundo amarelo não é levado em consideração) ou erro de identificação de qualquer punição (seja cartão amarelo ou vermelho). Ainda, o árbitro do campo é quem toma a decisão final , a partir do que o responsável pelo VAR lhe informar, o que viu do lance e no replay da cabine. Veja mais em: Arbitragem , Erros de arbitragem , Corinthians x Santos , Yuri Alberto e Campeonato Paulista .","pubDate":"2023-02-26 22:26:00","image_url":null,"source_id":"meutimao","category":["sports"],"country":["brazil"],"language":"portuguese"},{"title":"Mbappé e Messi brilham, PSG vence Marseille e dispara na liderança da Ligue 1","link":"http://www.lance.com.br/futebol-internacional/mbappe-e-messi-brilham-psg-vence-marseille-e-dispara-na-lideranca-da-ligue.html","keywords":["Futebol Internacional"],"creator":["Luiz Eduardo"],"video_url":null,"description":null,"content":"Segue o líder! O Paris Saint-Germain venceu o clássico contra o Olympique de Marseille por 3 a 0, fora de casa, neste domingo, em partida que valeu pela 25ª rodada da Ligue 1 2022/23. Kylian Mbappé, duas vezes, e Lionel Messi marcaram para o PSG. Neymar desfalcou a equipe, visto que está se recuperando de uma lesão no tornozelo. Com o resultado, os comandados de Christophe Galtier chegaram aos 60 pontos e ampliaram a vantagem na liderança do Francês para oito à frente do próprio Marseille, que é o vice-líder da competição, com 52. A vitória deixa a vida do PSG mais fácil na briga pelo título nacional. SENTIU Aos 11 minutos do primeiro tempo, o zagueiro Kimpembé sentiu um problema muscular e caiu sozinho no gramado após contragolpe do Marseille. O defensor, que havia voltado há pouco tempo, teve de deixar a partida de maca e deve desfalcar novamente a equipe do PSG nos próximos compromissos. MESSI PARA MBAPPÉ A noite em Marselha foi dos astros do Paris. Aos 25 minutos, Messi arrancou pelo meio, tocou para Mbappé avançar com a bola e o francês tocou na saída do goleiro Pau López, abrindo o placar no Vélodrome para o PSG, 1 a 0. + Veja a tabela da Ligue 1 2022/23 MBAPPÉ PARA MESSI Aos 29, foi a vez do francês retribuir a assistência para o argentino. Mbappé recebeu pela esquerda, encarou a marcação de Bailly e tocou na medida para Messi mandar para o fundo das redes, dobrando a vantagem do PSG no clássico. DISCO REPETIDO Mesmo após o intervalo, a história do jogo não mudou. Aos nove minutos do segundo tempo, novamente Messi achou Mbappé, desta vez com um lindo passe de cavadinha e o francês soltou o pé esquerdo, de primeira, para fazer o terceiro gol do PSG contra o Marseille e fechar a conta no Vélodrome: 3 a 0 e liderança da Ligue 1 consolidada. AGENDA ​O PSG volta a campo no próximo sábado, às 17h (de Brasília), em casa contra o Nantes, pelo Campeonato Francês. O Olympique de Marseille, por sua vez, enfrenta o Football Club d'Annecy na quarta-feira, também às 17h (de Brasília), mas pela Copa da França.","pubDate":"2023-02-26 22:17:21","image_url":"http://www.lance.com.br//files//uploads/2023/02/26/63fbcbeb217d1.jpeg","source_id":"lance","category":["top","sports"],"country":["brazil"],"language":"portuguese"},{"title":"Amakhosi on the hunt after fortuitous win eases pressure on coach Arthur Zwane","link":"https://www.dailymaverick.co.za/article/2023-02-27-amakhosi-on-the-hunt-after-fortuitous-win-eases-pressure-on-coach-arthur-zwane/","keywords":null,"creator":["Yanga Sibembe"],"video_url":null,"description":"The biggest match on the South African soccer calendar was a cagey and drab affair, but Kaizer Chiefs’ 1-0 win over Orlando Pirates on Saturday marks their fifth victory in a row over their in-form Soweto neighbour. The post Amakhosi on the hunt after fortuitous win eases pressure on coach Arthur Zwane appeared first on Daily Maverick.","content":"Victory for Kaizer Chiefs against Orlando Pirates on Saturday, 25 February, eased pressure on the former team’s coach, Arthur Zwane, keeping Amakhosi in the hunt for second spot on the Premiership table. Kaizer Chiefs edged Orlando Pirates 1-0 for the second time this season to complete a second league double on the trot against their bitter rivals. The biggest match on the South African soccer calendar was far from a memorable spectacle, with the two teams recording a total of four shots on target. The match was a cagey and drab affair. It took a hopeful and searching diagonal ball by player of the match Edmilson Dove to force an own goal off the head of Pirates’ second-half substitute Olisa Ndah. Yusuf Maart of Kaizer Chiefs and Tapelo Xoki of Orlando Pirates in action at FNB Stadium on 25 February 2023 in Johannesburg, South Africa. (Photo: Lefty Shivambu / Gallo Images) With just one minute left to play of the regulation 90 minutes, the Nigerian defender flicked the ball over Buccaneers goalkeeper Sipho Chaine, who had come off his line in an attempt to intercept the long pass. That sequence of miscommunication compounded the Bucs’ misery in front of a crowd of just more than 78,000 at the FNB Stadium in the south of Johannesburg. They had already been playing with 10 men after captain Innocent Maela was sent off at the one-hour mark. The narrow win for Amakhosi will have eased the mounting pressure on the Naturena-based side’s coach, Zwane. There have been calls from sections of Chiefs’ fanbase for the former Amakhosi and Bafana Bafana midfielder to vacate his seat. These murmurs had amplified in recent weeks, with the Glamour Boys claiming just one win from their five league matches preceding the derby. In that period they suffered three defeats and played to one draw. In spite of that not-so-favourable return, the Chiefs’ hierarchy threw its weight behind Zwane and offered the public reassurance that he was still their man as they sought to end an eight-year trophy drought. Visit Daily Maverick’s home page for more news, analysis and investigations Zwane – who played more than 150 games for Amakhosi in the early to late 2000s, collecting numerous trophies along the way – was appointed as the club’s head coach in May 2022. He was tasked with bringing back a culture of winning to the team and reigniting the fighting spirit of one of the most successful clubs in Africa. Zwane still believes he is the right man for the job, and that eventually the seeds he is planting and tending to will reap the desired fruit. “I’ve said it in the past that the club has a plan. We know when you start something there’ll be a rough patch because you are trying to lay a strong foundation,” Zwane told journalists after the match. Amakhosi may be extremely inconsistent as they continue trying to bounce back to their former glory. But one thing that has remained consistent in recent seasons is beating their Soweto neighbours. The 1-0 win on Saturday was the fifth in a row for Chiefs in this league fixture. This is even though Sea Robbers headed into the tie as the in-form side, having claimed four wins from their five most recent matches. Zwane downplayed Chiefs’ impressive streak over their nemesis, saying it was just another fixture that they aimed to do well in, which was the target in every match they played. “It’s just another six points for us. I don’t want the players to only focus on beating Orlando Pirates. We want to beat every team that we come across because the league is a marathon, it’s not just winning against Pirates. But the win is important for us as a club, knowing our history with them,” Zwane told journalists. With these three points, Chiefs kept themselves firmly in the race for second place and clinching the final Caf Champions League spot – with Mamelodi Sundowns sprinting to the Premiership title and the primary continental football spot. Gavin Hunt’s SuperSport occupy second spot with 36 points. They strengthened their position by beating the relegation-threatened Maritzburg United 2-0 on Friday. With defeat in the derby, third-placed Pirates now trail Hunt’s men by five points. Level with them on 31 points are fourth-placed Richards Bay and Amakhosi in fifth. The Sea Robbers lead the duo due to a marginally superior goal difference. With nine games left to play this campaign, the scramble for second spot is on. “We are thinking week by week. We just need to prepare for the next game. That’s all,” said Pirates’ assistant coach Sergio Almenara when asked about the sprint for second. Chiefs are next in action again on Saturday, 4 March, in a crucial clash against Richards Bay in the tight pursuit for second place. The Buccaneers will tussle with Swallows on Friday, 3 March. DM","pubDate":"2023-02-26 22:03:51","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Man City to battle rivals for Brighton star Alexis Mac Allister and other transfer rumours","link":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-city-mac-allister-gossip-26334953","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Brighton and Hove Albion's midfielder was a key man for Argentina at the World Cup and his name features in today's Man City transfer gossip.","content":"Manchester City are reportedly 'hot on the heels' of Brighton and Hove Albion's World Cup winner Alexis Mac Allister. After not appearing in Argentina's opening defeat to Saudi Arabia, Mac Allister was introduced for the remainder of the tournament and proved to be an unsung hero for Lionel Messi's team, scoring once and grabbing an assist in the final victory over France. Upon his return to England, the 24-year-old continued to impress. He scored twice in his first game back in the FA Cup victory over Middlesbrough and he has also adapted a game to suit Brighton's needs. At the beginning of the season, Mac Allister played in the defensive midfield role but has since played in central and attacking midfield positions. ALSO READ: Lewis explains why City squad were 'gutted' after victory This flexibility and form has led Pep Guardiola to become interested in the Argentine, according to the Daily Star . They claim that Guardiola sees Mac Allister as the perfect addition to his squad. However, the report warns that Chelsea, Arsenal and Liverpool are also keen on the 24-year-old. Elsewhere, Football Insider are claiming that Barcelona are continuing to push for the signing of Ilkay Gundogan . Gundogan became City's captain at the beginning of the season following Fernandinho's departure from the Etihad Stadium. The 32-year-old's contract is due to expire at the end of the campaign and it is unclear whether the German will commit to a new deal. Barca meanwhile are looking for players who could replace Sergio Busquets and they have reportedly earmarked Gundogan as a target. It is claimed in the report that City are not close to agreeing a new contract with the ex-Borussia Dortmund man and that Xavi, Barcelona's manager, is a big fan of the midfielder. READ NEXT: Get all the latest City news here Alvarez sends message to Foden Haaland verdict on City win Bournemouth boss gives verdict on win Guardiola explains full time reaction","pubDate":"2023-02-26 21:00:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26335045.ece/ALTERNATES/s615/0_GettyImages-1467430720.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Ten Hag snags Manchester United’s first title in six years","link":"https://www.premiumtimesng.com/sports/football/584746-ten-hag-snags-manchester-uniteds-first-title-in-six-years.html","keywords":["Football","Bruno Guimaraes","Man united","Manchester United","Rashford","Ten Hag"],"creator":["Jide Alaka"],"video_url":null,"description":"Six years after their last title, new manager Erik ten Hag led Manchester United to the Carabao Cup title. The post Ten Hag snags Manchester United’s first title in six years appeared first on Premium Times Nigeria.","content":"Two first-half goals from Casemiro and an own goal gave Manchester United a 2-0 victory over Newcastle United in the Carabao Cup final on Sunday at Wembley. Both teams came into Sunday’s final needing to snap a trophy drought. While the United from Manchester had last won a trophy in 2017; Newcastle’s drought stretched back to 2006 when the Magpies won the UEFA Intertoto Cup. Both United teams had the full complement of their first teamers, with Manchester having Casemiro and Newcastle having Bruno Guimaraes back from the red card he got in the semifinal. And the Magpies started the better of the two teams, controlling the midfield through their two Brazilians in Joelinton and Guimaraes. Despite the early pressure, it was Manchester United that took the lead through Casemiro, who rose highest to head home a Luke Shaw free kick in the 32nd minute. There was a VAR check, but the former Real Madrid midfielder was ruled to be onside by a hair’s breadth. Marcus Rashford combined brilliantly with Wout Weghorst in the 39th minute before driving into the box and seeing his shot deflect off of Sven Botman before eluding Loris Karius in the Newcastle goal. After the match, Erik ten Hag said getting the first trophy was the start of the journey. “It was not always the best football, but it was effective. Firstly, you have to win the first one [trophy]. We will get a lot of inspiration from this, but also more confidence that we can do it.” The victory comes three days after beating Barcelona to qualify for the round of 16 in the Europa League. Donate TEXT AD: Call Willie - +2348098788999","pubDate":"2023-02-26 20:56:28","image_url":null,"source_id":"premiumtimesng","category":["sports"],"country":["nigeria"],"language":"english"},{"title":"'People don't see that' - Phil Jones on how Marcus Rashford has reignited his Man United career","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/marcus-rashford-jones-manchester-united-26336012","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Jack Flintham)"],"video_url":null,"description":"Rashford has been Manchester United's star man so far this season and has been undroppable under Erik ten Hag","content":"Manchester United defender Phil Jones believes that it is Marcus Rashford's mentality that has helped him improve his form this season. Rashford is United's leading goalscorer this term having notched just five in all competitions last campaign. Erik ten Hag has previously compared the Englishman to Kylian Mbappe for his ability to get in behind the opposition defence. Despite being injured this season, Jones has been able to observe Rashford's rise at Carrington. He told Sky Sports , ahead of the Carabao Cup final, that the 25-year-old's dedication sets him apart from other players. ALSO READ: United player ratings vs Newcastle Jones explained: \"I think it is his maturity, especially after the World Cup where he did not start as many games as he would have liked. He has knuckled down and got on with it. He has become sharper, stronger and you see that in the reflection of his performances this season. \"Defenders find him really hard to deal with, cope with him. He can take it one way, take it the other way. His goals [are] from outside the box, inside the box, he has scored a few headers lately as well. \"His all-round game at the minute has hit heights that probably even he didn't think he would get to. But he has been brilliant. \"He probably will not thank me for it but I think, on current form, he is the best player in the world.\" He added: \" His body shape, his strength in the gym, he has worked really hard on himself. \"The club have worked with him really well after training, people do not see that, but the work that he puts in after training [is brilliant]. So I am delighted for him.\" READ NEXT Catch up on all the latest United news Casemiro gives United what they wanted Erik ten Hag reveals ex-United pundits do affect players Varane explains why United success may mean more than Madrid Sir Alex Ferguson advice could be about to pay off for Erik ten Hag","pubDate":"2023-02-26 20:56:00","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26336130.ece/ALTERNATES/s615/0_GettyImages-1469765909.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Why Cristiano Ronaldo is at Tommy Fury vs Jake Paul fight as Manchester United win Carabao Cup","link":"https://www.manchestereveningnews.co.uk/sport/boxing/ronaldo-fury-paul-man-utd-26337293","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Shane Ireland)"],"video_url":null,"description":"Former Man United forward Ronaldo was spotted in attendance at the Tommy Fury vs Jake Paul fight in Saudi Arabia on Sunday night","content":"Cristiano Ronaldo attended the Tommy Fury vs Jake Paul boxing match in Saudi Arabia on the same day Manchester United won the Carabao Cup at Wembley. United ended their six-year wait for a trophy with a 2-0 victory over Newcastle United on Sunday, with Casemiro opening the scoring before Newcastle defender Sven Botman deflected Marcus Rashford’s effort into his own net. Ronaldo, meanwhile, was spotted in attendance for Fury’s fight against American YouTube star Paul . The fight is taking place in Riyadh. LIVE UPDATES: Follow Fury vs Paul here Ronaldo left United last year after his controversial interview with Piers Morgan. The Portugal international criticised several elements of the club in the interview with the broadcaster, including manager Erik ten Hag. In November, Ronaldo’s contract at Old Trafford was terminated by mutual consent and the 38-year-old joined Saudi side Al-Nassr after the World Cup. The forward is reportedly earning over £170million per year having signed what is claimed to be the most lucrative contract in football history. Paul said in the build-up to the fight that Ronaldo would be in attendance. Morgan confirmed this shortly after , saying: “Quick update to the end of that conversation: Cristiano Ronaldo has just told me he is going to the fight on Sunday. And he thinks it’s going to be a great fight, which many people do - so there we are.” Ronaldo’s club Al-Nassr are based in Riyadh, which is around a 20-minute drive from the Diriyah Arena where the fight is taking place. Ronaldo scored a hat-trick as Al-Nassr beat Damac 3-0 on Saturday to go back to the top of the table. Their next match is on Friday, March 3. Ronaldo has previously posed for photos with boxing legend Floyd Mayweather, who made his UK debut in an exhibition bout against Geordie Shore star Aaron Chalmers on Saturday night. Ronaldo has also shown an interest in other combat sports. He posed with two-weight UFC champion Conor McGregor in a gym. United co-chairman Glazer attended only his sixth United match in the last four years to see the win against Newcastle. Ten Hag said: \"He was really happy, really happy for the club, as an owner. So I really wanted (him) to be part of it. He was in the dressing room, very good he was there to show his intentions.\" READ MORE: 'Only people at the club know' - interview with Marcus Rashford 'Sometimes I want to kill' - Martinez on becoming Man United's cult hero Ten Hag invites Sir Alex into dressing room Ten Hag has as much impact as the players in memorable win vs Barca All the United news and views","pubDate":"2023-02-26 20:51:17","image_url":"https://i2-prod.manchestereveningnews.co.uk//article26337222.ece/ALTERNATES/s615/0_escenic-36.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Thuram en mode total régal... Les notes des joueurs de l'OGC Nice après la victoire dans le derby de la Côte d'Azur","link":"https://www.nicematin.com/football/thuram-en-mode-total-regal-les-notes-des-joueurs-de-logc-nice-apres-la-victoire-dans-le-derby-de-la-cote-dazur-830851","keywords":null,"creator":null,"video_url":null,"description":"L'OGC Nice s'est offert l'AS Monaco (3-0), ce dimanche au Stade Louis-II lors de la 25e journée de L1 grâce à un grand Khéphren Thuram et un immense Terem Moffi.","content":"SCHMEICHEL (6): Golovin est le premier à l’alerter en seconde période (48’, 56’). Ben Yedder n’était pas inspiré non plus, du coup le Danois a passé un derby plutôt tranquille. YOUSSOUF (7): autant sa première période a été globalement délicate malgré deux grosses remontées de balle au pied (16’, 42’), autant il a été énorme quand il est repassé au milieu après la pause. Outre ses replis incroyables, sa solidité au contact, il offre un bon ballon à Thuram dans la profondeur (58’). TODIBO (7): tout en vitesse (30’) ou en couverture des copains (40’), il a été intraitable défensivement. Fidèle à lui-même. DANTE (8): ça faisait longtemps qu’on n’avait pas revu sa spéciale, cette ouverture géniale dans le dos des défenseurs qui a régalé la fusée Terem Moffi (8’). Énorme défensivement aussi, même les crampes (68’) ne l’ont pas arrêté. LOTOMBA (6): plus à l’aise sans le ballon qu’avec hier, le Suisse a fait le taf puisqu’il n’a jamais été mis en difficulté dans son couloir droit. BOUDAOUI (7): un pied, un tibia, il avait toujours un membre qui traînait pour contrer son adversaire aux abords de la surface. L’Algérien a encore couvert du terrain et colmaté les brèches. Essentiel, avant de céder sa place à Barkley (81’), qui a failli signer le 4-0 si Nübel ne s’était pas réveillé après la pause. AMRAOUI (6): très appliqué pour sa première chez les pros, il a collectionné les interventions intelligentes et décisives. Du très bon boulot dans un contexte de derby peu évident à appréhender. RAMSEY (NN): il était appliqué et très utile dans le 5-4-1 sans ballon quand son match s’est arrêté sur blessure (34’). Remplacé par Rosario, qui a encore été au diapason dans l’engagement dès ses premières foulées. Pas maladroit non plus pour orienter et lancer Brahimi face au but (84’). THURAM (8): Lilian a dû apprécier le spectacle. Le petit brossé du fiston est parfait pour que son ouverture arrive dans la course de Moffi sur le deuxième but (26’). Le rush, le décalage sur Moffi, la demi-volée, tout est magnifique lorsqu’il signe le 3-0 (43’). Replacé ailier gauche à la pause, il régale encore l’assistance avec son enchaînement contrôle de la poitrine, volée que Nübel repousse en corner (58’). Remplacé par Sofiane Diop (71’). LABORDE (5): il a raturé beaucoup de transmissions et ainsi annihilé quelques beaux coups. Mais à sa décharge, son activité énorme dans le repli, les ballons qu’il a pu gratter ont grignoté sa lucidité. Remplacé par Bouanani (81’), qui a sollicité Nübel en fin de match. MOFFI (9): un doublé, une passe décisive, il a parfaitement choisi son match pour lancer sa nouvelle aventure avec le Gym. ça fait 14 réalisations en Ligue 1 pour le Nigérian. Il n’était pas loin du triplé si Nübel n’avait pas réalisé la parade sur sa frappe puissante (67’). Remplacé par Brahimi (81’), qui a raté son duel avec Nübel, gêné par Sarr (84’).","pubDate":"2023-02-26 20:39:00","image_url":"https://fyooyzbm.filerobot.com/v7/Image+20230226NIM4409-pPegO1O6.jpg?vh=ed7dc6&ci_seal=da536ba389&p=medium&v2&gravity=auto","source_id":"nicematin","category":["sports"],"country":["france"],"language":"french"},{"title":"Erik ten Hag explains Avram Glazer attendance at Manchester United Carabao Cup final win","link":"https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-glazer-ten-hag-26337171","keywords":["Sport"],"creator":["newsdesk@men-news.co.uk (Samuel Luckhurst)"],"video_url":null,"description":"Erik ten Hag was congratulated by co-chairman Avram Glazer amid offers to buy the club from Sheikh Jassim bin Hamad al-Thani and Sir Jim Ratcliffe.","content":"Manchester United manager Erik ten Hag says Avram Glazer wanted to \"show his intentions\" with his presence at the League Cup final victory over Newcastle. United co-chairman Glazer attended only his sixth United match in the last four years to see their 2-0 victory over Newcastle at Wembley. Sheikh Jassim bin Hamad al-Thani and Sir Jim Ratcliffe submitted proposals to buy United before a soft deadline on February 17. Read more: United player ratings as they win the Carabao Cup The United supporters booed Glazer when he appeared on the big screen and he was filmed congratulating Ten Hag in the stands and outside the dressing room. \"He was really happy, really happy for the club, as an owner. So I was really wanted (him) to be part of it. He was in the dressing room, very good he was there to show his intentions.\" When asked if that indicated Glazer's stance on investment in the club, Ten Hag replied: \"I don't know, I'm not involved in that process. \"Thank you for the question. But I think the way that he is here shows you feel that he is committed about the process, about what he wants is not for me. I have to perform this team, this dressing room and others at the club are involved in the decisions about ownership, etc. Casemiro nodded in United's opening goal in the 33rd minute and a Sven Botman own goal six minutes later deflated Newcastle as United ended a trophy drought that had strayed close to six years. The triumph capped a fine February for Ten Hag, who presided over eight unbeaten games as United progressed in the Europa League over Barcelona and ended the month third in the Premier League table. Now United have secured silverware, Ten Hag hopes it will inspire the squad to achieve greater things. \"It's true even if you take that (the Barcelona win) into account), it's a massive performance that we can deliver this. \"And that tells you we are fit, physically fit, mentally fit. They had energy so I think it was a great performance in that perspective for us. \"We are not only hoping but to know that it's worth to invest, to know that it's worth to suffer and to sacrifice and to know you have to give every day your best to celebrate. It's all about that; glory and honour. \"If you want to win something, if you want to prove something, you have to do it, otherwise you don't get it, because nobody is bringing you something in top football. \"It shows one thing: that you are on a good pathway, you are in a good direction. It is one cup in February but it shows the right direction. \"This has to be the inspiration, this has to be the motivation to continue in this pathway and improve and don't be happy. Okay, be happy for 24 hours but not be satisfied because satisfaction leads to laziness and when you get lazy you don't win any more games and you can't win trophies.\" READ MORE: 'Only people at the club know' - interview with Marcus Rashford 'Sometimes I want to kill' - Martinez on becoming Man United's cult hero Ten Hag invites Sir Alex into dressing room Ten Hag has as much impact as the players in memorable win vs Barca All the United news and views","pubDate":"2023-02-26 20:21:42","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26337191.ece/ALTERNATES/s615/0_Screenshot-2023-02-26-201158.jpg","source_id":"manchestereveningnews","category":["sports"],"country":["united kingdom"],"language":"english"}]}