{"newsArray":[{"title":"Young athletes brace for Lusaka champs","link":"https://www.herald.co.zw/young-athletes-brace-for-lusaka-champs/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […]","content":"HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at White City stadium in Bulawayo and will be the final selection competition for the African championships. The continental event is due to take place from April 29 to May 3 in Lusaka, Zambia. The selection process began at the NASH and NAPH events that were held last week in Marondera and Chinhoyi respectively. Nhubu, who is also part of the selectors, said they are looking at a team of 40 athletes for the African Championships and so far they have selected 20 youths (Under-18) and 30 juniors (Under-20). “It is our hope that we will have about 40 athletes that will go to Zambia. We will have two categories that is youths and juniors. The championships merges these two age-groups. “The last edition was held in Ivory Coast (in 2019). We had a composition of youths and juniors who represented Zimbabwe, both boys and girls. “We had picked 20 youths and 30 juniors on our long list which is tentative. The final travelling team will be determined by selectors after the NAAZ champs,” said Nhubu. With some of the athletes having competed in last week’s Nash and Naph competitions, and also vying to make the times for the African championships, Nhubu said they are hopeful of quality competition in Bulawayo. “The NASH competition has been very competitive and we are extremely excited that there was stiff competition and very good times were posted. However, we didn’t have electronic time. “As a federation, we are targeting at least 40 athletes of which we expect to have 20 juniors to qualify. “Juniors need to meet CAA qualifying standards and also NAAZ standards. Looking at most athletes’ form, l hope we surpass the target. “The Bulawayo junior championships will be fireworks as everyone in this category will be fighting for honours. It’s coming at the rightful time when athletes are still in good shape,” said Nhubu. The selected athletes are expected to go into camp where the coaches will finalise the travelling team to Zambia. With the continental meet in Zambia, the national association has indicated that they would want to send a bigger team. “After the junior championships, we hope there will be a camp for prospective athletes to fine tune them for the extravaganza. “We also expect all stakeholders and partners to throw their maximum support to enable the federation to provide the requisite resources that are enablers for podium performance. “It is also our hope that the coaches will dedicate the camp time to prepare the athletes for international level,” said Nhubu. The national association welcomed the return of the schools’ national competitions after the Covid-19-induced break, as they are the major providers of grassroots development. Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:32","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Students host Gems Boys in first home game","link":"https://www.herald.co.zw/students-host-gems-boys-in-first-home-game/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:25","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Tournament a boon for juniors","link":"https://www.herald.co.zw/tournament-a-boon-for-juniors/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:21","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"CAPS United, Herentals can’t spoil it for the owners","link":"https://www.herald.co.zw/caps-united-herentals-cant-spoil-it-for-the-owners/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:15","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raza gets special wishes from Zim teammate","link":"https://www.herald.co.zw/raza-gets-special-wishes-from-zim-teammate/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"MOHALI. — Zimbabwe’s Sikandar Raza is all set to make his Indian Premier League (IPL) debut this season. The prolific cricket all-rounder was roped in by Punjab Kings at his base price of Rs 50 lakh at the IPL 2023 auction. He became just the fourth Zimbabwe cricketer to be signed by an IPL side. […]","content":"msn.com. Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:12","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Bosso appeal to fans ahead of FC Platinum clash","link":"https://www.herald.co.zw/bosso-appeal-to-fans-ahead-of-fc-platinum-clash/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Eddie Chikamhi-Senior Sports Reporter GIANTS Highlanders have appealed to their supporters to play a big part in the terraces on Sunday as they hope to break a nine-year winless jinx against champions FC Platinum. The Bulawayo giants head into the match high in confidence after accomplishing another fine feat at the National Sports Stadium last […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:02","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ΚΟΠ: Συνεχάρη το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου…","link":"https://balla.com.cy/2023/03/30/kop-synechari-to-apoel-gia-tin-kataktisi-toy-kypelloy/","keywords":["Futsal","ΑΠΟΕΛ","Σπορ"],"creator":["Balla.com.cy"],"video_url":null,"description":"Με ανάρτηση της η ΚΟΠ συγχαίρει το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου στο Φούτσαλ. Η ανάρτηση της Ομοσπονδίας: View this post on Instagram A post shared by Cyprus Football Association (@cyprusfa_official)","content":"Οι καλύτερες αποδόσεις παγκοσμίως με 0% γκανιότα στα σημαντικότερα παιχνίδια της ημέρας μόνο στον Stoiximan! Με ανάρτηση της η ΚΟΠ συγχαίρει το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου στο Φούτσαλ. Η ανάρτηση της Ομοσπονδίας: A post shared by Cyprus Football Association (@cyprusfa_official)","pubDate":"2023-03-30 20:27:00","image_url":"https://balla.com.cy/wp-content/uploads/2023/03/SAK_1613-thumbnail_preview-1.jpg","source_id":"balla_cy","category":["sports"],"country":["cyprus"],"language":"greek"},{"title":"Snl24.com | Zwane Compares Bafana Performance To Chiefs","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Kaizer-Chiefs/zwane-uses-tau-as-lesson-not-to-doubt-chiefs-players-20230330","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs head coach Arthur Zwane has compared Bafana Bafana's performance at Orlando Stadium to his side's previous struggles and used Percy Tau as an example to quell criticism.","content":"Kaizer Chiefs head coach Arthur Zwane has compared Bafana Bafana's performance at Orlando Stadium to his side's previous struggles and used Percy Tau as an example to quell criticism. Chiefs' results have been fluctuating under Zwane, who was under pressure before his side won four games in a row in all competitions, including booking a spot in the quarter-finals. The Glamour Boys' struggles this season are somehow reflected by the fact that they had no player selected at the recent Bafana Bafana squad that played back-to-back Africa Cup of Nations qualifier matches against Liberia. South Africa almost made it hard for themselves to qualify after they squandered a two-goal lead to draw 2-2 with the Lone Stars at Orlando Stadium after missing a host of chances. And although Hugo Broos' charges eventually sealed qualification with a 2-1 win in Monrovia, Zwane says how they missed chances at Orlando Stadium is an indication that the goal-scoring problem is not only a Chiefs issue and that even quality players like Tau can miss chances. \"When you look at what happened at Orlando Stadium we could have turned things into a worse situation just because we missed chances, so do we doubt those players?\" Zwane told reporters at the club's Open Media Day. \"No you can't, the quality is there. You want to tell me you doubt Percy Tau because he missed chances at Orlando (Stadium)? But how many times Tau scored great goals for us as a nation? \"You understand what I'm saying? So that's why the part of judging players...You just have to understand that football is played by human beings that are bound to make mistakes at any given time, they always need our support,\" he said. 'Mangethe' went on and congratulated Bafana for eventually qualifying for the Afcon in Ivory Coast next year and drew parallels with them eventually going on a winning run. \"And we went to Monrovia for one thing, to make sure we grind the result and we're proud of them, they made us proud, all of us as South Africans, we're proud, we're waiting for the Nations Cup because South Africa qualified, that's what we wanted,\" he said. \"It was a same situation with us where we created a number of chances and we missed them, some we took them and we find ourselves now we're winning four games on the trot it's because we took most of ours chances, although we made mistakes that nearly cost us but what was very important was to grind the result,\" he added. Chiefs will resume their league schedule when they host Stellenbosch on Saturday evening. You must be to read and post comments.","pubDate":"2023-03-30 20:06:38","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Official: CAF Make 2023 AFCON Announcement","link":"https://www.snl24.com/soccerladuma/International/AFCON/official-caf-make-2023-afcon-announcement-20230330","keywords":null,"creator":null,"video_url":null,"description":"With South Africa one of the seven teams that have already qualified for the 2023 Africa Cup of Nations, the Confederation of African football (CAF) has made a big announcement regarding the continental showpiece.","content":"With South Africa one of the seven teams that have already qualified for the 2023 Africa Cup of Nations, the Confederation of African football (CAF) has made a big announcement regarding the continental showpiece. Alongside Bafana Bafana, reigning champions Senegal, Morocco, Algeria, Burkina Faso and Tunisia have all confirmed their spots to join host nation Ivory Coast at Africa's biggest tournament next year. African football's governing body has now confirmed when the tournament will begin and end as it prepares to return to the west African nation for the first time in 40 years. \"The TotalEnergies Africa Cup of Nations Cote d'Ivoire 2023 dates have been officially confirmed by CAF, with the opening match scheduled to take place on Saturday, 13 January 2024 at the Alassane Ouattara Stadium in Ebimpe, Abidjan,\" a statement released by CAF read. \"The four-week tournament, pitting Africa's best 24 nations [against each other], will officially conclude on 11 February 2024. \"This will be the 34th edition of the tournament and returns to Cote d'Ivoire for the second time after first being held there in 1984, where Cameroon emerged as winners for the first time. \"With the TotalEnergies AFCON 2023 Qualifiers approaching its business end, the road to Cote D'Ivoire is gradually taking shape as the world gears up for Africa's biggest football spectacle. \"Following this past weekend's thrilling round of qualifiers, six countries secured their place for the competition joining hosts, Cote d'Ivoire. They are Algeria, Morocco, South Africa, Tunisia, Burkina Faso and African champions, Senegal. \"CAF General Secretary Veron Mosengo-Omba also confirmed that the Final Draw of the TotalEnergies Africa Cup of Nations 2023 Cote d'Ivoire will be held in September 2023. Date and venue will be confirmed in due course.\" You must be to read and post comments. 2","pubDate":"2023-03-30 20:06:38","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"CAF confirm kick off date for 2024 AFCON in Ivory Coast","link":"https://www.ghanamma.com/2023/03/30/caf-confirm-kick-off-date-for-2024-afcon-in-ivory-coast/","keywords":["Sports"],"creator":["Ghana News"],"video_url":null,"description":"The Africa Cup of Nations was switched to June and July in 2019 to avoid a clash with the European domestic season The Confederation of African Football [CAF] on Thursday confirmed the start and end dates for the 2023 Africa Cup of Nations scheduled to be hosted in Cote d’Ivoire. Six countries have so far qualified […] The post CAF confirm kick off date for 2024 AFCON in Ivory Coast appeared first on Ghanamma.com.","content":"The Confederation of African Football [CAF] on Thursday confirmed the start and end dates for the 2023 Africa Cup of Nations scheduled to be hosted in Cote d’Ivoire. Six countries have so far qualified for the 34th edition of Africa’s prestigious tournament. South Africa, Morocco, Algeria, defending champions Senegal, Burkina Faso and Tunisia as teams who have already qualified, while Ivory Coast are also confirmed as one of the 24 teams as hosts. “The TotalEnergies Africa Cup of Nations Cote d’Ivoire 2023 dates have been officially confirmed by CAF, with the opening match scheduled to take place on Saturday, 13 January 2024 at the Alassane Ouattara Stadium in Ebimpe, Abidjan,” CAF said via a press statement. “The four-week tournament, pitting Africa’s best 24 nations will officially conclude on 11 February 2024. “This will be the 34th edition of the tournament and returns to Cote d’Ivoire for the second time after first being held there in 1984, where Cameroon emerged as winners for the first time. READ ALSO “With the TotalEnergies AFCON 2023 Qualifiers approaching its business end, the road to Cote D’Ivoire is gradually taking shape as the world gears up for Africa’s biggest football spectacle. “CAF General Secretary, Veron Mosengo-Omba also confirmed that the Final Draw of the TotalEnergies Africa Cup of Nations 2023 Cote d’Ivoire will be held in September 2023. Date and venue will be confirmed in due course. “With the rapidly growing global interest of CAF competitions recorded in the last few months, CAF is projecting record global TV audiences and stadium attendances for next year’s edition of its flagship competition, which also currently holds the record of being Africa’s biggest event. “As evidently seen in recently concluded CAF competitions, CAF has taken giant steps in enhancing the viewing and stadium attendance experience of its competitions with the introduction of cutting-edge broadcast technology as well as digital engagement, resulting in a world-class product that is consumed in real-time globally.” The matchday three and four games were played last week and this week with the final round of two games scheduled to be played in June later this year. Log in to leave a comment","pubDate":"2023-03-30 19:30:04","image_url":null,"source_id":"ghanamma","category":["sports"],"country":["ghana"],"language":"english"},{"title":"Young athletes brace for Lusaka champs","link":"https://www.herald.co.zw/young-athletes-brace-for-lusaka-champs/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […]","content":"HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at White City stadium in Bulawayo and will be the final selection competition for the African championships. The continental event is due to take place from April 29 to May 3 in Lusaka, Zambia. The selection process began at the NASH and NAPH events that were held last week in Marondera and Chinhoyi respectively. Nhubu, who is also part of the selectors, said they are looking at a team of 40 athletes for the African Championships and so far they have selected 20 youths (Under-18) and 30 juniors (Under-20). “It is our hope that we will have about 40 athletes that will go to Zambia. We will have two categories that is youths and juniors. The championships merges these two age-groups. “The last edition was held in Ivory Coast (in 2019). We had a composition of youths and juniors who represented Zimbabwe, both boys and girls. “We had picked 20 youths and 30 juniors on our long list which is tentative. The final travelling team will be determined by selectors after the NAAZ champs,” said Nhubu. With some of the athletes having competed in last week’s Nash and Naph competitions, and also vying to make the times for the African championships, Nhubu said they are hopeful of quality competition in Bulawayo. “The NASH competition has been very competitive and we are extremely excited that there was stiff competition and very good times were posted. However, we didn’t have electronic time. “As a federation, we are targeting at least 40 athletes of which we expect to have 20 juniors to qualify. “Juniors need to meet CAA qualifying standards and also NAAZ standards. Looking at most athletes’ form, l hope we surpass the target. “The Bulawayo junior championships will be fireworks as everyone in this category will be fighting for honours. It’s coming at the rightful time when athletes are still in good shape,” said Nhubu. The selected athletes are expected to go into camp where the coaches will finalise the travelling team to Zambia. With the continental meet in Zambia, the national association has indicated that they would want to send a bigger team. “After the junior championships, we hope there will be a camp for prospective athletes to fine tune them for the extravaganza. “We also expect all stakeholders and partners to throw their maximum support to enable the federation to provide the requisite resources that are enablers for podium performance. “It is also our hope that the coaches will dedicate the camp time to prepare the athletes for international level,” said Nhubu. The national association welcomed the return of the schools’ national competitions after the Covid-19-induced break, as they are the major providers of grassroots development. Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:32","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Students host Gems Boys in first home game","link":"https://www.herald.co.zw/students-host-gems-boys-in-first-home-game/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:25","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Tournament a boon for juniors","link":"https://www.herald.co.zw/tournament-a-boon-for-juniors/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:21","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"CAPS United, Herentals can’t spoil it for the owners","link":"https://www.herald.co.zw/caps-united-herentals-cant-spoil-it-for-the-owners/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:15","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raza gets special wishes from Zim teammate","link":"https://www.herald.co.zw/raza-gets-special-wishes-from-zim-teammate/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"MOHALI. — Zimbabwe’s Sikandar Raza is all set to make his Indian Premier League (IPL) debut this season. The prolific cricket all-rounder was roped in by Punjab Kings at his base price of Rs 50 lakh at the IPL 2023 auction. He became just the fourth Zimbabwe cricketer to be signed by an IPL side. […]","content":"msn.com. Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:12","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Bosso appeal to fans ahead of FC Platinum clash","link":"https://www.herald.co.zw/bosso-appeal-to-fans-ahead-of-fc-platinum-clash/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Eddie Chikamhi-Senior Sports Reporter GIANTS Highlanders have appealed to their supporters to play a big part in the terraces on Sunday as they hope to break a nine-year winless jinx against champions FC Platinum. The Bulawayo giants head into the match high in confidence after accomplishing another fine feat at the National Sports Stadium last […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:02","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ΚΟΠ: Συνεχάρη το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου…","link":"https://balla.com.cy/2023/03/30/kop-synechari-to-apoel-gia-tin-kataktisi-toy-kypelloy/","keywords":["Futsal","ΑΠΟΕΛ","Σπορ"],"creator":["Balla.com.cy"],"video_url":null,"description":"Με ανάρτηση της η ΚΟΠ συγχαίρει το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου στο Φούτσαλ. Η ανάρτηση της Ομοσπονδίας: View this post on Instagram A post shared by Cyprus Football Association (@cyprusfa_official)","content":"Οι καλύτερες αποδόσεις παγκοσμίως με 0% γκανιότα στα σημαντικότερα παιχνίδια της ημέρας μόνο στον Stoiximan! Με ανάρτηση της η ΚΟΠ συγχαίρει το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου στο Φούτσαλ. Η ανάρτηση της Ομοσπονδίας: A post shared by Cyprus Football Association (@cyprusfa_official)","pubDate":"2023-03-30 20:27:00","image_url":"https://balla.com.cy/wp-content/uploads/2023/03/SAK_1613-thumbnail_preview-1.jpg","source_id":"balla_cy","category":["sports"],"country":["cyprus"],"language":"greek"},{"title":"Snl24.com | Zwane Compares Bafana Performance To Chiefs","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Kaizer-Chiefs/zwane-uses-tau-as-lesson-not-to-doubt-chiefs-players-20230330","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs head coach Arthur Zwane has compared Bafana Bafana's performance at Orlando Stadium to his side's previous struggles and used Percy Tau as an example to quell criticism.","content":"Kaizer Chiefs head coach Arthur Zwane has compared Bafana Bafana's performance at Orlando Stadium to his side's previous struggles and used Percy Tau as an example to quell criticism. Chiefs' results have been fluctuating under Zwane, who was under pressure before his side won four games in a row in all competitions, including booking a spot in the quarter-finals. The Glamour Boys' struggles this season are somehow reflected by the fact that they had no player selected at the recent Bafana Bafana squad that played back-to-back Africa Cup of Nations qualifier matches against Liberia. South Africa almost made it hard for themselves to qualify after they squandered a two-goal lead to draw 2-2 with the Lone Stars at Orlando Stadium after missing a host of chances. And although Hugo Broos' charges eventually sealed qualification with a 2-1 win in Monrovia, Zwane says how they missed chances at Orlando Stadium is an indication that the goal-scoring problem is not only a Chiefs issue and that even quality players like Tau can miss chances. \"When you look at what happened at Orlando Stadium we could have turned things into a worse situation just because we missed chances, so do we doubt those players?\" Zwane told reporters at the club's Open Media Day. \"No you can't, the quality is there. You want to tell me you doubt Percy Tau because he missed chances at Orlando (Stadium)? But how many times Tau scored great goals for us as a nation? \"You understand what I'm saying? So that's why the part of judging players...You just have to understand that football is played by human beings that are bound to make mistakes at any given time, they always need our support,\" he said. 'Mangethe' went on and congratulated Bafana for eventually qualifying for the Afcon in Ivory Coast next year and drew parallels with them eventually going on a winning run. \"And we went to Monrovia for one thing, to make sure we grind the result and we're proud of them, they made us proud, all of us as South Africans, we're proud, we're waiting for the Nations Cup because South Africa qualified, that's what we wanted,\" he said. \"It was a same situation with us where we created a number of chances and we missed them, some we took them and we find ourselves now we're winning four games on the trot it's because we took most of ours chances, although we made mistakes that nearly cost us but what was very important was to grind the result,\" he added. Chiefs will resume their league schedule when they host Stellenbosch on Saturday evening. You must be to read and post comments.","pubDate":"2023-03-30 20:06:38","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Official: CAF Make 2023 AFCON Announcement","link":"https://www.snl24.com/soccerladuma/International/AFCON/official-caf-make-2023-afcon-announcement-20230330","keywords":null,"creator":null,"video_url":null,"description":"With South Africa one of the seven teams that have already qualified for the 2023 Africa Cup of Nations, the Confederation of African football (CAF) has made a big announcement regarding the continental showpiece.","content":"With South Africa one of the seven teams that have already qualified for the 2023 Africa Cup of Nations, the Confederation of African football (CAF) has made a big announcement regarding the continental showpiece. Alongside Bafana Bafana, reigning champions Senegal, Morocco, Algeria, Burkina Faso and Tunisia have all confirmed their spots to join host nation Ivory Coast at Africa's biggest tournament next year. African football's governing body has now confirmed when the tournament will begin and end as it prepares to return to the west African nation for the first time in 40 years. \"The TotalEnergies Africa Cup of Nations Cote d'Ivoire 2023 dates have been officially confirmed by CAF, with the opening match scheduled to take place on Saturday, 13 January 2024 at the Alassane Ouattara Stadium in Ebimpe, Abidjan,\" a statement released by CAF read. \"The four-week tournament, pitting Africa's best 24 nations [against each other], will officially conclude on 11 February 2024. \"This will be the 34th edition of the tournament and returns to Cote d'Ivoire for the second time after first being held there in 1984, where Cameroon emerged as winners for the first time. \"With the TotalEnergies AFCON 2023 Qualifiers approaching its business end, the road to Cote D'Ivoire is gradually taking shape as the world gears up for Africa's biggest football spectacle. \"Following this past weekend's thrilling round of qualifiers, six countries secured their place for the competition joining hosts, Cote d'Ivoire. They are Algeria, Morocco, South Africa, Tunisia, Burkina Faso and African champions, Senegal. \"CAF General Secretary Veron Mosengo-Omba also confirmed that the Final Draw of the TotalEnergies Africa Cup of Nations 2023 Cote d'Ivoire will be held in September 2023. Date and venue will be confirmed in due course.\" You must be to read and post comments. 2","pubDate":"2023-03-30 20:06:38","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"CAF confirm kick off date for 2024 AFCON in Ivory Coast","link":"https://www.ghanamma.com/2023/03/30/caf-confirm-kick-off-date-for-2024-afcon-in-ivory-coast/","keywords":["Sports"],"creator":["Ghana News"],"video_url":null,"description":"The Africa Cup of Nations was switched to June and July in 2019 to avoid a clash with the European domestic season The Confederation of African Football [CAF] on Thursday confirmed the start and end dates for the 2023 Africa Cup of Nations scheduled to be hosted in Cote d’Ivoire. Six countries have so far qualified […] The post CAF confirm kick off date for 2024 AFCON in Ivory Coast appeared first on Ghanamma.com.","content":"The Confederation of African Football [CAF] on Thursday confirmed the start and end dates for the 2023 Africa Cup of Nations scheduled to be hosted in Cote d’Ivoire. Six countries have so far qualified for the 34th edition of Africa’s prestigious tournament. South Africa, Morocco, Algeria, defending champions Senegal, Burkina Faso and Tunisia as teams who have already qualified, while Ivory Coast are also confirmed as one of the 24 teams as hosts. “The TotalEnergies Africa Cup of Nations Cote d’Ivoire 2023 dates have been officially confirmed by CAF, with the opening match scheduled to take place on Saturday, 13 January 2024 at the Alassane Ouattara Stadium in Ebimpe, Abidjan,” CAF said via a press statement. “The four-week tournament, pitting Africa’s best 24 nations will officially conclude on 11 February 2024. “This will be the 34th edition of the tournament and returns to Cote d’Ivoire for the second time after first being held there in 1984, where Cameroon emerged as winners for the first time. READ ALSO “With the TotalEnergies AFCON 2023 Qualifiers approaching its business end, the road to Cote D’Ivoire is gradually taking shape as the world gears up for Africa’s biggest football spectacle. “CAF General Secretary, Veron Mosengo-Omba also confirmed that the Final Draw of the TotalEnergies Africa Cup of Nations 2023 Cote d’Ivoire will be held in September 2023. Date and venue will be confirmed in due course. “With the rapidly growing global interest of CAF competitions recorded in the last few months, CAF is projecting record global TV audiences and stadium attendances for next year’s edition of its flagship competition, which also currently holds the record of being Africa’s biggest event. “As evidently seen in recently concluded CAF competitions, CAF has taken giant steps in enhancing the viewing and stadium attendance experience of its competitions with the introduction of cutting-edge broadcast technology as well as digital engagement, resulting in a world-class product that is consumed in real-time globally.” The matchday three and four games were played last week and this week with the final round of two games scheduled to be played in June later this year. Log in to leave a comment","pubDate":"2023-03-30 19:30:04","image_url":null,"source_id":"ghanamma","category":["sports"],"country":["ghana"],"language":"english"},{"title":"Young athletes brace for Lusaka champs","link":"https://www.herald.co.zw/young-athletes-brace-for-lusaka-champs/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […]","content":"HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at White City stadium in Bulawayo and will be the final selection competition for the African championships. The continental event is due to take place from April 29 to May 3 in Lusaka, Zambia. The selection process began at the NASH and NAPH events that were held last week in Marondera and Chinhoyi respectively. Nhubu, who is also part of the selectors, said they are looking at a team of 40 athletes for the African Championships and so far they have selected 20 youths (Under-18) and 30 juniors (Under-20). “It is our hope that we will have about 40 athletes that will go to Zambia. We will have two categories that is youths and juniors. The championships merges these two age-groups. “The last edition was held in Ivory Coast (in 2019). We had a composition of youths and juniors who represented Zimbabwe, both boys and girls. “We had picked 20 youths and 30 juniors on our long list which is tentative. The final travelling team will be determined by selectors after the NAAZ champs,” said Nhubu. With some of the athletes having competed in last week’s Nash and Naph competitions, and also vying to make the times for the African championships, Nhubu said they are hopeful of quality competition in Bulawayo. “The NASH competition has been very competitive and we are extremely excited that there was stiff competition and very good times were posted. However, we didn’t have electronic time. “As a federation, we are targeting at least 40 athletes of which we expect to have 20 juniors to qualify. “Juniors need to meet CAA qualifying standards and also NAAZ standards. Looking at most athletes’ form, l hope we surpass the target. “The Bulawayo junior championships will be fireworks as everyone in this category will be fighting for honours. It’s coming at the rightful time when athletes are still in good shape,” said Nhubu. The selected athletes are expected to go into camp where the coaches will finalise the travelling team to Zambia. With the continental meet in Zambia, the national association has indicated that they would want to send a bigger team. “After the junior championships, we hope there will be a camp for prospective athletes to fine tune them for the extravaganza. “We also expect all stakeholders and partners to throw their maximum support to enable the federation to provide the requisite resources that are enablers for podium performance. “It is also our hope that the coaches will dedicate the camp time to prepare the athletes for international level,” said Nhubu. The national association welcomed the return of the schools’ national competitions after the Covid-19-induced break, as they are the major providers of grassroots development. Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:32","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Students host Gems Boys in first home game","link":"https://www.herald.co.zw/students-host-gems-boys-in-first-home-game/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:25","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Tournament a boon for juniors","link":"https://www.herald.co.zw/tournament-a-boon-for-juniors/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","pubDate":"2023-03-30 22:02:21","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"CAPS United, Herentals can’t spoil it for the owners","link":"https://www.herald.co.zw/caps-united-herentals-cant-spoil-it-for-the-owners/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Tadious Manyepo-Sports Reporter CASTLE Lager Premier Soccer League teams CAPS United and Herentals haven’t started the season the way they would have wanted. Makepekepe have already dropped two points in their opening two games this season, having beaten Manica Diamonds 2-0 before labouring to a goalless draw at Ngezi Platinum last weekend. On the other […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:15","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raza gets special wishes from Zim teammate","link":"https://www.herald.co.zw/raza-gets-special-wishes-from-zim-teammate/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"MOHALI. — Zimbabwe’s Sikandar Raza is all set to make his Indian Premier League (IPL) debut this season. The prolific cricket all-rounder was roped in by Punjab Kings at his base price of Rs 50 lakh at the IPL 2023 auction. He became just the fourth Zimbabwe cricketer to be signed by an IPL side. […]","content":"msn.com. Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:12","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Bosso appeal to fans ahead of FC Platinum clash","link":"https://www.herald.co.zw/bosso-appeal-to-fans-ahead-of-fc-platinum-clash/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Eddie Chikamhi-Senior Sports Reporter GIANTS Highlanders have appealed to their supporters to play a big part in the terraces on Sunday as they hope to break a nine-year winless jinx against champions FC Platinum. The Bulawayo giants head into the match high in confidence after accomplishing another fine feat at the National Sports Stadium last […]","content":"Ellina Mhlanga-Senior Sports Reporter HEAD coach for junior and youth athletics teams Briad Nhubu says they are expecting to finalise the team to compete at the African Under-18 and Under-20 combined championships after the national meet. The National Athletics Association of Zimbabwe Gift Chigwere Junior Track and Field Championships are set for April 8 at […] Grace Chingoma–Senior Sports Reporter HERENTALS are seeking maximum points when they play at home for the first time this season in a Castle Lager Premiership football encounter against Manica Diamonds at the National Sports Stadium this afternoon. The Students played their first league games at Gibbo. They lost to Triangle 1-0 and shared the spoils […] Takudzwa Chitsiga-Sports Reporter THE National Athletics Association of Zimbabwe president Tendai Tagara has hailed the upcoming Gift Chigwere track and field junior championships, saying all is now in place for the second edition of the event. The championships are scheduled for White City in Bulawayo on April 8 and Tagara said junior athletes have been […]","pubDate":"2023-03-30 22:02:02","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"ΚΟΠ: Συνεχάρη το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου…","link":"https://balla.com.cy/2023/03/30/kop-synechari-to-apoel-gia-tin-kataktisi-toy-kypelloy/","keywords":["Futsal","ΑΠΟΕΛ","Σπορ"],"creator":["Balla.com.cy"],"video_url":null,"description":"Με ανάρτηση της η ΚΟΠ συγχαίρει το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου στο Φούτσαλ. Η ανάρτηση της Ομοσπονδίας: View this post on Instagram A post shared by Cyprus Football Association (@cyprusfa_official)","content":"Οι καλύτερες αποδόσεις παγκοσμίως με 0% γκανιότα στα σημαντικότερα παιχνίδια της ημέρας μόνο στον Stoiximan! Με ανάρτηση της η ΚΟΠ συγχαίρει το ΑΠΟΕΛ για την κατάκτηση του Κυπέλλου στο Φούτσαλ. Η ανάρτηση της Ομοσπονδίας: A post shared by Cyprus Football Association (@cyprusfa_official)","pubDate":"2023-03-30 20:27:00","image_url":"https://balla.com.cy/wp-content/uploads/2023/03/SAK_1613-thumbnail_preview-1.jpg","source_id":"balla_cy","category":["sports"],"country":["cyprus"],"language":"greek"},{"title":"Snl24.com | Zwane Compares Bafana Performance To Chiefs","link":"https://www.snl24.com/soccerladuma/Local/Premiership/Kaizer-Chiefs/zwane-uses-tau-as-lesson-not-to-doubt-chiefs-players-20230330","keywords":null,"creator":null,"video_url":null,"description":"Kaizer Chiefs head coach Arthur Zwane has compared Bafana Bafana's performance at Orlando Stadium to his side's previous struggles and used Percy Tau as an example to quell criticism.","content":"Kaizer Chiefs head coach Arthur Zwane has compared Bafana Bafana's performance at Orlando Stadium to his side's previous struggles and used Percy Tau as an example to quell criticism. Chiefs' results have been fluctuating under Zwane, who was under pressure before his side won four games in a row in all competitions, including booking a spot in the quarter-finals. The Glamour Boys' struggles this season are somehow reflected by the fact that they had no player selected at the recent Bafana Bafana squad that played back-to-back Africa Cup of Nations qualifier matches against Liberia. South Africa almost made it hard for themselves to qualify after they squandered a two-goal lead to draw 2-2 with the Lone Stars at Orlando Stadium after missing a host of chances. And although Hugo Broos' charges eventually sealed qualification with a 2-1 win in Monrovia, Zwane says how they missed chances at Orlando Stadium is an indication that the goal-scoring problem is not only a Chiefs issue and that even quality players like Tau can miss chances. \"When you look at what happened at Orlando Stadium we could have turned things into a worse situation just because we missed chances, so do we doubt those players?\" Zwane told reporters at the club's Open Media Day. \"No you can't, the quality is there. You want to tell me you doubt Percy Tau because he missed chances at Orlando (Stadium)? But how many times Tau scored great goals for us as a nation? \"You understand what I'm saying? So that's why the part of judging players...You just have to understand that football is played by human beings that are bound to make mistakes at any given time, they always need our support,\" he said. 'Mangethe' went on and congratulated Bafana for eventually qualifying for the Afcon in Ivory Coast next year and drew parallels with them eventually going on a winning run. \"And we went to Monrovia for one thing, to make sure we grind the result and we're proud of them, they made us proud, all of us as South Africans, we're proud, we're waiting for the Nations Cup because South Africa qualified, that's what we wanted,\" he said. \"It was a same situation with us where we created a number of chances and we missed them, some we took them and we find ourselves now we're winning four games on the trot it's because we took most of ours chances, although we made mistakes that nearly cost us but what was very important was to grind the result,\" he added. Chiefs will resume their league schedule when they host Stellenbosch on Saturday evening. You must be to read and post comments.","pubDate":"2023-03-30 20:06:38","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Snl24.com | Official: CAF Make 2023 AFCON Announcement","link":"https://www.snl24.com/soccerladuma/International/AFCON/official-caf-make-2023-afcon-announcement-20230330","keywords":null,"creator":null,"video_url":null,"description":"With South Africa one of the seven teams that have already qualified for the 2023 Africa Cup of Nations, the Confederation of African football (CAF) has made a big announcement regarding the continental showpiece.","content":"With South Africa one of the seven teams that have already qualified for the 2023 Africa Cup of Nations, the Confederation of African football (CAF) has made a big announcement regarding the continental showpiece. Alongside Bafana Bafana, reigning champions Senegal, Morocco, Algeria, Burkina Faso and Tunisia have all confirmed their spots to join host nation Ivory Coast at Africa's biggest tournament next year. African football's governing body has now confirmed when the tournament will begin and end as it prepares to return to the west African nation for the first time in 40 years. \"The TotalEnergies Africa Cup of Nations Cote d'Ivoire 2023 dates have been officially confirmed by CAF, with the opening match scheduled to take place on Saturday, 13 January 2024 at the Alassane Ouattara Stadium in Ebimpe, Abidjan,\" a statement released by CAF read. \"The four-week tournament, pitting Africa's best 24 nations [against each other], will officially conclude on 11 February 2024. \"This will be the 34th edition of the tournament and returns to Cote d'Ivoire for the second time after first being held there in 1984, where Cameroon emerged as winners for the first time. \"With the TotalEnergies AFCON 2023 Qualifiers approaching its business end, the road to Cote D'Ivoire is gradually taking shape as the world gears up for Africa's biggest football spectacle. \"Following this past weekend's thrilling round of qualifiers, six countries secured their place for the competition joining hosts, Cote d'Ivoire. They are Algeria, Morocco, South Africa, Tunisia, Burkina Faso and African champions, Senegal. \"CAF General Secretary Veron Mosengo-Omba also confirmed that the Final Draw of the TotalEnergies Africa Cup of Nations 2023 Cote d'Ivoire will be held in September 2023. Date and venue will be confirmed in due course.\" You must be to read and post comments. 2","pubDate":"2023-03-30 20:06:38","image_url":"https://scripts.24.co.za/img/sites/soccerladuma24.png","source_id":"soccerladuma","category":["sports"],"country":["south africa"],"language":"english"},{"title":"CAF confirm kick off date for 2024 AFCON in Ivory Coast","link":"https://www.ghanamma.com/2023/03/30/caf-confirm-kick-off-date-for-2024-afcon-in-ivory-coast/","keywords":["Sports"],"creator":["Ghana News"],"video_url":null,"description":"The Africa Cup of Nations was switched to June and July in 2019 to avoid a clash with the European domestic season The Confederation of African Football [CAF] on Thursday confirmed the start and end dates for the 2023 Africa Cup of Nations scheduled to be hosted in Cote d’Ivoire. Six countries have so far qualified […] The post CAF confirm kick off date for 2024 AFCON in Ivory Coast appeared first on Ghanamma.com.","content":"The Confederation of African Football [CAF] on Thursday confirmed the start and end dates for the 2023 Africa Cup of Nations scheduled to be hosted in Cote d’Ivoire. Six countries have so far qualified for the 34th edition of Africa’s prestigious tournament. South Africa, Morocco, Algeria, defending champions Senegal, Burkina Faso and Tunisia as teams who have already qualified, while Ivory Coast are also confirmed as one of the 24 teams as hosts. “The TotalEnergies Africa Cup of Nations Cote d’Ivoire 2023 dates have been officially confirmed by CAF, with the opening match scheduled to take place on Saturday, 13 January 2024 at the Alassane Ouattara Stadium in Ebimpe, Abidjan,” CAF said via a press statement. “The four-week tournament, pitting Africa’s best 24 nations will officially conclude on 11 February 2024. “This will be the 34th edition of the tournament and returns to Cote d’Ivoire for the second time after first being held there in 1984, where Cameroon emerged as winners for the first time. READ ALSO “With the TotalEnergies AFCON 2023 Qualifiers approaching its business end, the road to Cote D’Ivoire is gradually taking shape as the world gears up for Africa’s biggest football spectacle. “CAF General Secretary, Veron Mosengo-Omba also confirmed that the Final Draw of the TotalEnergies Africa Cup of Nations 2023 Cote d’Ivoire will be held in September 2023. Date and venue will be confirmed in due course. “With the rapidly growing global interest of CAF competitions recorded in the last few months, CAF is projecting record global TV audiences and stadium attendances for next year’s edition of its flagship competition, which also currently holds the record of being Africa’s biggest event. “As evidently seen in recently concluded CAF competitions, CAF has taken giant steps in enhancing the viewing and stadium attendance experience of its competitions with the introduction of cutting-edge broadcast technology as well as digital engagement, resulting in a world-class product that is consumed in real-time globally.” The matchday three and four games were played last week and this week with the final round of two games scheduled to be played in June later this year. Log in to leave a comment","pubDate":"2023-03-30 19:30:04","image_url":null,"source_id":"ghanamma","category":["sports"],"country":["ghana"],"language":"english"}]}