{"newsArray":[{"article_id":"df742fa67d8bb49d0ebe725874fd8a56","title":"Dubai's Department of Economy and Tourism, Real Madrid announce landmark global partnership","link":"https://www.wam.ae/en/details/1395303206226","keywords":null,"creator":["Rola AlGhoul/ Esraa Esmail"],"video_url":null,"description":null,"content":"Fri 06-10-2023 08:49 AM DUBAI, 6th October, 2023 (WAM) -- Dubai's Department of Economy and Tourism, together with Real Madrid Club de Fútbol, have kicked off a landmark collaboration. The multi-year agreement promises a range of exciting activations, special fan moments and unique experiences for Dubai and Real Madrid fans. The newly formed alliance will equally serve as a powerhouse platform to create new growth opportunities for both institutions and support Dubai's ambitious plans as part of its recently announced Dubai Economic Agenda – D33. Being at the forefront of global sports entertainment with the world's greatest Club aligns perfectly with Dubai's ambitious plans to consolidate its position among the top three global cities. Launching this October, the partnership encompasses Real Madrid's First Men and Women Football Teams, bringing a taste of Dubai to Santiago Bernabéu offering fans unforgettable experiences and services. Issam Kazim, Chief Executive Officer of Dubai Corporation for Tourism and Commerce Marketing (DCTCM), and Florentino Perez, President of Real Madrid Club de Fútbol, formalised the partnership during an official ceremony at the legendary Sala de Juntas in Ciudad Real Madrid, in the presence of Jose Angel Sanchez, Chief Executive Officer of the Club, and Emilio Butragueño, Real Madrid legend and Director of Institutional Relations. Kazim commented, \"We are excited to begin our journey with Real Madrid as a global partner. This game-changing collaboration between Dubai and the greatest Club in the world is built upon a shared vision and values, where every achievement motivates one to pursue new heights. With our aim to consolidate Dubai's position among the top three global cities, this strategic alliance will harness the strengths of a leading destination and the world's most celebrated team to reaffirm Dubai globally as the best city to visit, live, and work in.\" Butragueño, in turn, said, \"We are very proud of this new partnership with Dubai's Department of Economy and Tourism as the Club's first Official Destination Partner. Dubai is a destination that strives for excellence in all its entertainment offerings, a value shared by the Club. We are delighted to bring this exciting tourist destination to our millions of Madridistas around the world.\" Dubai's strong public and private sector relations are at the heart of its success, and this new collaboration with Real Madrid further builds on a longstanding partnership that Emirates has cemented since 2011. It is also perfectly timed for the upcoming Real Madrid themed-park at Dubai Parks and Resorts, the largest theme park destination in the Middle East, which will further expand the city's diverse destination proposition. The park, which will be the world's first Real Madrid-themed park, will feature a number of Real Madrid-related attractions, such as a museum, amusement rides and football skill games, food and beverage outlets, and retail spaces selling official Real Madrid products.","pubDate":"2023-10-06 06:25:05","image_url":null,"source_id":"wam","source_priority":799259,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"article_id":"0128ab392d5b9f1a65d4d5c5c4f9bb60","title":"Punjab FC vs NorthEast United FC, ISL 2023-24 Live Streaming Online on JioCinema: Watch Telecast of PFC vs NEUFC Match in Indian Super League 10 on TV and Online","link":"https://www.latestly.com/sports/football/punjab-fc-vs-northeast-united-fc-isl-2023-24-live-streaming-online-on-jiocinema-watch-telecast-of-pfc-vs-neufc-match-in-indian-super-league-10-on-tv-and-online-5466637.html","keywords":null,"creator":null,"video_url":null,"description":"North East United had a poor campaign last season and they have a win and loss in their two games this term. They will be fancying themselves to come up with a good performance this evening. Punjab FC on the other hand, have lost both their matches so far. Read below to check out the live streaming and telecast details of the Punjab FC vs NorthEast United FC match.","content":"Newly promoted Punjab FC will be taking on North East United at home with an aim to secure their first win of the 2023-24 Indian Super League season. It has not been the best of starts by them with two straightforward losses against Mohun Bagan and Goa. While the defence did shore up a bit against the Gaurs in the last game, the attacking and midfield display was well below par which is a cause for worry. The team lacks the big game experience and it is evident with their display on the pitch. North East United had a poor campaign last season and they have a win and loss in their two games this term. They will be fancying themselves to come up with a good performance this evening. Punjab FC versus NorthEast United FC will be telecasted on the Sports18 network and streamed on the Jio Cinema app from 8:00 pm. ISL 2023-24 Points Table Updated Live. Nikhil Prabhu in defence looked lively against Goa and his partnership against Melroy Melwin Assisi will be crucial against North East. Luka Majcen and Juan Mera have not had much opportunity to score goals which is a concern. The duo will need their midfielder to try and dominate possession to create chances. Parthib Gogoi was the star of the show for North East United against Chennaiyin as he tormented the opposition backlines with his darting runs. He was rewarded with a goal while fellow attacking player Konsam Phalguni Singh was also on the scoresheet. The team has quality players going forward and when they click, the team does score a few. Indian international Manvir Singh is expected to keep his place on the flanks. ISL 2023–24 Schedule Announced . When Is Punjab FC vs NorthEast United FC, ISL 2023-24, Football Match Schedule (Know Date, Time and Venue) Punjab FC will face NorthEast United FC in the Indian Super League 2023-24 on Friday, October 6. The PFC vs NEUFC ISL match will be played at the Jawaharlal Nehru Stadium in New Delhi and it starts at 8:00 pm IST (Indian Standard Time). Where To Watch Punjab FC vs NorthEast United FC, ISL 2023-24 Football Telecast On TV? Viacom18 Network have the broadcasting rights for the Indian Super League in India. Fans can tune into VH1, Sports18 1 SD/HD (English Commentary), Sports18 Khel (Hindi Commentary, Surya Movies (Malayalam Commentary), Colours Bangla Cinema (Bangla Commentary for MBSG and EBFC only) channels to watch live telecast of the Punjab FC vs NorthEast United FC match. For live streaming details, scroll down. How To Watch Punjab FC vs NorthEast United FC, ISL 2023-24 Football Live Streaming Online? JioCinema, the official OTT platform of Viacom18 Network, will live stream the Punjab FC vs NorthEast United FC, ISL 2023-24 match on online platforms. Fans can tune into the JioCinema app and website to catch the action live. One Football will provide live streaming of the match Internationally. NorthEast United should win this game although it may not be a high-scoring encounter. (The above story first appeared on LatestLY on Oct 06, 2023 11:41 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-10-06 06:11:23","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bf709676a6fe3f31033180b28afdb7fc","title":"Ross County's women and girls aiming for the top","link":"https://www.ross-shirejournal.co.uk/sport/ross-countys-women-and-girls-aiming-for-the-top-328760/","keywords":null,"creator":null,"video_url":null,"description":"The Staggies&#39; women&#39;s and girls&#39; section has grown rapidly in recent years, and those involved see no reason why they can&#39;t aim for the highest level.","content":"Women's football at Ross County will take a significant step forward next year with the introduction of two new senior teams. A development team will , while the first team will take part in Scottish Women's Football's performance pathway, joining the regional SWFL leagues. This is a step that has been a long time coming. Starting off as Invergordon Girls, the club joined forces with Ross County in 2019, and have since grown beyond anyone's wildest expectations. Now, it is not uncommon to see more than 100 girls attending training. The current oldest age group side, the under-16s, have also already played other senior teams and competed well. That has only fuelled confidence of what can be achieved by the Staggies – and quickly, if expectations are met. \"We want to take the club as far as we possibly can,\" head coach Iain MacIver explained. \"In the first year we enter that North League, a lot of people would probably look at it as a development year but we'll be looking to go up if possible. \"We've played the team that are currently sitting top a few weeks ago, and we did pretty well, so we'll be looking to do pretty well and get into the national leagues. \"I think all the players there have the ambition to go as far as they can – ideally with us, but they want to forge a career in football. \"A few years ago that wouldn't really have been a possibility for girls from here. Even going back a couple of decades in Scotland, it wouldn't have been physically possible, but now, they have ambitions and see professional players on TV so it's something for them to aspire to.\" Those ambitions come through clearly by talking to the players themselves. Sisters Kiera and Teagan Syrjanen both play for the club's under-16s, and have been part of the squads that took on senior teams elsewhere. The Dingwall Academy pupils are in no doubt about where they want to go in football, and the impact that establishing senior teams at Ross County could have on their chances of being successful. Kiera said: \"It's just good for girls' football in general. Obviously men's football is huge, so I hope women's football keeps growing too. \"I want to play for Scotland or a high-end team in England. Maybe Rangers as well. \"We're playing friendlies against teams more well-known than us, which will make us well-known, and we've matched their standards so it shows that in the future we can be just as big. \"We're obviously starting a women's team, so we're building that pathway up to the top which wasn't always there. It's good for the club to have somewhere to go after you've finished with the under-16s.\" Teagan explained: \"We think about it for when we're older. \"One of my main goals is to play for Scotland, but I think I'd also like to play for Chelsea or a team in England, and I think that is realistic, because we're playing a few top teams already and have performed very well. \"When we first joined, we didn't really know what the future would look like for us, but now we know more and can see the pathway there. \"If new girls join, they know there's that pathway there and it's not just one team and then that's the end of it.\" One of the things that will help Staggies talents reach those heights is greater integration between the women's club and the men's academy and senior side. With plans in place for the new senior women's teams in 2024, that connection has recently taken a big step forward as County's head of professional academy Gary Warren has started to get involved in training sessions. Even on first impressions, he has been very impressed – and with a young daughter Warren has every reason to take a vested interest in the fortunes of the women's side of the club. \"My main role now is to oversee a programme that will unite the girls and the boys together,\" Warren said. \"I've just recently had my first coaching session with the girls, and it was really good and really enjoyable. There's some great talent, and that's not just at one particular level – that's across the age groups. \"There is so much out there to offer – not just in the local area but also in Stornoway and the islands – it would be silly not to develop a programme that will help these girls flourish. \"It's so important. You look at how the game has developed and the academies that have been created down south and oversees, and we're in a position where we can try and do that. \"We can nurture and develop these girls. They've got a great set-up – when I was out there over 120 girls showed up in one night, which is incredible. These coaches give up their own time to help out, so it's important that we help to maximise the opportunity for everyone to flourish. \"Before you would look at the women's game and a lot of people wouldn't think it was at the same level, but you look at how much it has changed and how much the quality has improved in terms of technical, tactical and physical, and the game has improved so much. \"I have a little girl myself, and she loves her football, so it's great for me to see the game develop and hopefully one day she can follow in the current players' footsteps. If she can emulate some of these players now, she'll have a good upbringing in football and a good understanding. \"You feel the excitement just by turning up and watching them train. When you do that, you see the standards and that makes you think 'wow, this could be something really special'. \"It's important that we really now work together as a club and as a group to join forces and develop the programme as much as we can.\" The commitment from the men's side of Ross County is absolute, and goes right to the top of the club. Chief executive officer Steven Ferguson was at pains to hail the work that MacIver and Glenda Scobbie have done with the women's side over recent years, and is looking forward to seeing how an even more integrated set-up will progress in the future. \"We recognise how important it is for girls and women in this area, and we also recognise the part that we have to play as the senior club,\" Ferguson added. \"We are ready to make sure that we are completely joined up, and give them the opportunity and the support that they deserve. \"When this got off the ground many years ago now, it was essentially a partnership in name only, but the plan was always to make sure that year by year we had something that was sustainable and growing organically. \"We weren't trying to force or demand anything, and it has grown to this stage where it needs more and more input and support from the football club to make sure it's fully integrated. \"The most important thing is that it's sustainable so that we have a Ross County women's team in 10 years' time, and we have the solid foundations in place. \"It's so important to us as a football club that everybody is catered to whatever their level, and I'm really looking forward to see the young girls developing into young women that will go on to compete at a national level and represent this area and club. It's really exciting. \"There is definitely a buzz around girls' and women's football. As a football club and as an area, we are no different. \"I see girls who have played on a Saturday morning, and both them and the team they have played are in the stadium watching a first team game in the afternoon. That's what gives me a buzz – the fact that it's completely integrated across the women's and men's game, and everybody is enjoying both parts of it, to make it that one club. \"That's my goal, to very much be catering for absolutely everybody and inclusive for everyone. That's really important to us as a football club, and it's really exciting to think about the distance that we've come over the last four or five years – and we're only just scratching the surface. \"What we have in place are really solid foundations that will shape the next five years, and I think that's the bit that excites everybody.\"","pubDate":"2023-10-06 06:00:00","image_url":null,"source_id":"ross_shirejournal","source_priority":1094642,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3aa82fdc02d28e8217aa3710d9a6f94b","title":"Daily Schmankerl: Chelsea in the mix for Bayern Munich’s Alphonso Davies; Bayern eyeing Valencia youngster; Liverpool duo headed to Saudi Arabia?; Chelsea looking Dušan Vlahović and Alvaro Morata; Frans Krätzig praised again; and MORE!","link":"https://www.bavarianfootballworks.com/2023/10/6/23904435/chelsea-bayern-munich-davies-valencia-guerra-liverpool-juventus-vlahovic-morata-kratzig-transfer-tel","keywords":null,"creator":["CSmith1919"],"video_url":null,"description":null,"content":"Davies rumors are persisting (Chelsea Chronicle) Rumors have been floating for a few months now that Alphonso Davies could be on the fast track out of Bayern Munich . With his contract negotiations at a standstill and his agent popping off intermittently about a potential move, Davies’ future in Germany is uncertain as ever. With Real Madrid already considered a prime contender to get Davies, Chelsea FC and Manchester City are also getting ready for the transfer competition: There’s been transfer rumours emerge this week involving both Chelsea and Bayern Munich’s Alphonso Davies, which is why it’s certainly worth looking back on previous comments from Ashley Cole. 90min claimed on Wednesday that Chelsea are being kept informed on Bayern left-back Alphonso Davies. The German heavyweights want their 22-year-old defender to sign a new contract with them, but he’s grabbing the attention of Chelsea, Real Madrid and Manchester City. Speaking in 2020 via The Mirror, Cole raved about Davies’ quality: “He’s so direct, he’s quick, he can go inside or outside. “I played against him in the MLS and, obviously, he couldn’t combine there with players of the quality Bayern have. Moving to Bayern was a big step, it was a huge risk going from somewhere he was comfortable to play with top stars, but he has just improved –his timing, his understanding, when to go in behind, when to drag people out of position. He has improved on his decision-making and, of course, his strength is his speed.” With clubs like Real Madrid, Manchester City, and Chelsea in the mix, Davies is going to have his choice of destinations should he want to go. Will it happen? The next few months will certainly give fans an indication of how things are progressing. The initial 90Min.com report also states the obvious — Bayern Munich wants to re-up its Canadian star, but it is unclear at this point how serious Davies is about leaving the club. Related With Real Madrid planning 2024 heist, Bayern Munich preps for talks with Alphonso Davies Alphonso Davies’ agent puts Bayern Munich on notice, says Real Madrid and Premier League clubs are interested (Update: Full quote) Salah, Thiago headed to Saudi league? (Fichajes via 90Min.com) It sure seems like Liverpool FC is heading for a changing of the guard next summer. Thiago Alcantara and Mo Salah are two of the big names who could move on: Liverpool duo Mohamed Salah and Thiago Alcantara are among the top targets for the Saudi Pro League next summer. Related What is going on with former Bayern Munich man Thiago at Liverpool? Bavarian Podcast Works: Weekend Warm-up Podcast Season 3, Episode 13 (Bavarian Football Works) As Bayern Munich heads into another international break, the Bavarians will face a stiff test from SC Freiburg, but also have the opportunity to quiet some of noise surrounding the team. Thomas Tuchel has the fanbase at each other’s throats and while the team is winning, things are not as pretty as most would like. There are transfer rumors and A LOT to talk about with the squad. So, let’s get to it! Here is what we have on tape for this episode: A preview of the Bayern Munich vs. SC Freiburg match where we take a look at the form of each team, the potential starting lineup for Bayern, and give a prediction on the match. Discussing the uneasy feeling that Bayern Munich’s wins are covering for a lot of flaws with the team. Bayern Munich is not getting the most out of Harry Kane...but why? Let’s talk about it. Leroy Sané, Serge Gnabry, Alphonso Davies, Matthijs de Ligt, and Joshua Kimmich are just some of the names that have already been linked with a transfer away for next summer. Asr these just baseless rumors or is there a brewing problem on the squad? Addressing those Jerome Boateng rumors. Related Bavarian Podcast Works: Weekend Warm-up Podcast Season 3, Episode 13 — A preview of Bayern Munich vs. SC Freiburg; Why Bayern’s wins don’t mean everything; Bayern’s recent transfer rumors; and MORE! Bayern eyeing Valencia youngster (Bild via @iMiaSanMia) Bayern Munich could be looking at another young midfielder — this time, Valencia’s Javi Guerra: Valencia midfielder Javi Guerra (20) is one of the players being watched by FC Bayern, although there’s nothing concrete at the moment. Guerra profiles mostly as a No. 8 per Transfermarkt and could be a relatively cheap acquisition should Bayern Munich opt to go into that direction. Related Bayern Munich looking to splash the cash in January as squad is reduced to bare bones Morata in the mix if Chelsea can’t get Juve star (CalciomercatoTV via 90Min.com) If Chelsea cann not get Juventus striker Dušan Vlahović, it will push to get Atlético Madrid striker Alvaro Morata: Chelsea are prepared to try and re-sign Atletico Madrid striker Alvaro Morata if they fail to convince Juventus to part ways with Dušan Vlahović. Related Report: If Harry Kane transfer sputters, Bayern Munich could shift quickly to Plan B — Juventus star Dušan Vlahović Bavarian Podcast Works — Postgame Show: FC Copenhagen 1-2 Bayern Munich (Bavarian Football Works) Bayern Munich once again came into a game completely unprepared and paid for it with a poor first half in which the team came to the dressing room behind on goals. Just like the last game however, Tuchel was bailed out by individual brilliance from the usual suspects. After a pair of games that made it look like Thomas Tuchel knew what he was doing, we have been treated to a pair of games that have made it look like Tuchel has never managed a game of football in his life. In this podcast, Rayyan goes over (rants about) the game and Bayern in detail. A look at the starting XIs for the game. The tactical decisions that Thomas Tuchel made. The lack of any direction or ‘game plan’ for Tuchel. A signature Cyler Meltdown™ over the state of Bayern. Related Bavarian Podcast Works: Postgame Show — FC Copenhagen 1-2 Bayern Munich (UEFA Champions League) Matthäus says Bayern can trust Krätzig (Tz via @iMiaSanMia) Lothar Matthäus has seen Bayern Munich’s depth issues, but he does think that Thomas Tuchel can trust youngster Frans Krätzig. “I saw him during pre-season in Asia, not just his goal against Liverpool back then. You can rely on some young players. You have to trust them, play them and talk to them. In the future, I would like to see young players integrated step by step,” Matthäus remarked. Krätzig has certainly impressed and brought a spark to each game that he has entered. However, with Bayern Munich looking to add depth in January, the Krätzig’s potential role in the second half of the season could decrease. Related Bayern Munich star Leon Goretzka lauds “clever” Frans Krätzig after Preußen Münster performance Surging Stuttgart star gets interest from Spurs, Hammers (TEAMtalk) VfB Stuttgart attacker Serhou Guirassy has gotten off to a red hot start for Die Schwaben and is now getting interest from Tottenham Hotspur and West Ham United: A host of Premier League clubs including Tottenham and West Ham have taken an interest in a Stuttgart striker who is currently outscoring Harry Kane in the Bundesliga. Serhou Guirassy is hitting the radar of Premier League clubs following his early season goal-blitz in Germany. The Stuttgart striker is one of the most in-form front men in Europe after a return of 10 goals from six Bundesliga outings. Related FC Barcelona’s Robert Lewandowski says Harry Kane was “good solution” for Bayern Munich, eager to see how it all plays out Bavarian Podcast Works — Flagship Show: Season 6, Episode 12 (Bavarian Football Works) Compared to last week, Bayern Munich really gave us a lot to talk about this time round. Unfortunately, not a lot of it is good news. A 2-2 draw to RB Leipzig marks the third consecutive game where Thomas Tuchel has failed to win versus Marco Rose and his cans. In the meanwhile, the bosses have suddenly begun and almost finalized talks with Jerome Boateng, which is causing a variety of reactions from the fanbase. Meanwhile, Max Eberl was sacked by RBL and he’s rumored to be on his way to Bayern, while there’s also a game against Copenhagen in the Champions League this week. In this episode, INNN and Cyler discuss the following: Why does Thomas Tuchel seem incapable of beating the better teams that he faces? Understanding why Tuchel dislikes giving certain players like Thomas Muller, Noussair Mazraoui, and Matthijs de Ligt playing time. The entire problem with Tuchel’s philosophy with the squad. An in-depth look at the controversy surrounding the Jerome Boateng transfer — why this move would be a complete travesty. Is Max Eberl the next board member at Bayern Munich? How might Christoph Freund and Eberl get along? A quick preview of the Champions League game versus Copenhagen and what we can expect. Related Bavarian Podcast Works S6E12: Why Jerome Boateng would be a disgusting signing for Bayern Munich + Why can’t Thomas Tuchel beat top teams? + Eberl updates + UCL preview","pubDate":"2023-10-06 04:00:00","image_url":null,"source_id":"bavarianfootballworks","source_priority":27959,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b3686054adb6754f41017ad75806507c","title":"NFL Week 5 Picks: Eagles suffer first loss, Vikings upset Chiefs, Niners beat Cowboys yet again","link":"https://torontosun.com/sports/football/nfl/nfl-week-5-picks-eagles-suffer-first-loss-vikings-upset-chiefs-niners-beat-cowboys-yet-again","keywords":["Football","NFL","Sports"],"creator":["Don Brennan"],"video_url":null,"description":"After winning 11 games over their last three seasons, the Texans appear headed in the right direction after destroying Jacksonville and Pittsburgh the last two weeks.","content":"HOUSTON TEXANS (2-2) at ATLANTA FALCONS (2-2) LINE: Atlanta by 1.5 CHEWABLE: After winning 11 games over their last three seasons, the Texans appear headed in the right direction after destroying Jacksonville and Pittsburgh the last two weeks. A lot of that is rookie C.J. Stroud, who currently sits fourth in passing yards with 1212, which is more than Justin Herbert, Patrick Mahomes, Josh Allen and Jalen Hurts. First-year head coach DeMeco Ryans also deserves credit, as the Texans have a banged-up offensive line that was missing four starters in last week’s 30-6 dominance of T.J. Watt, Alex Highsmith and the rest of the Steelers. Texans supposedly have a poor run defence, but they have not allowed any one player more than 88 rushing yards or any team more than 126 to date. Now they face a Falcons team whose offence is built around backs Bijan Robinson and Tyler Allgeier. While many think the injuries will catch up to the Texans, Pro Bowl LT Laremy Tunsil was back at practice Wednesday. The Falcons lose because of the QB matchup — Desmond Ridder is the worst starter in the league — and because this week they’re having to deal with jet lag from their trip to England. TAKING: HOUSTON +1.5 SCORE (O/U: 41.5): Texans 24, Falcons 17 CINCINNATI BENGALS (1-3) at ARIZONA CARDINALS (1-3) LINE: Cincinnati by 3 CHEWABLE: Does this not look like a mistake? Don’t you think the wrong side is being cast as the favourite? I had the Cardinals as the 32nd-best team in the league to start the season, but no longer. They’ve been in every game this season — except for their 35-16 loss to the Niners last week, but even that score is misleading as their back-to-back Zachs, Ertz and Pascal, dropped what would have been sure TD passes in the last minute — and they put a beating on the Cowboys. The Bengals’ three losses include both their road games to date, a 24-3 pounding by Cleveland in Week 1 and a 27-3 spanking in Tennessee last week, which I think means they’re being outscored 51-6 as visitors. And now they’re laying points in Arizona? Something you wouldn’t have thought possible — the quarterback matchup is heavily in favour of the Cards. Joshua Dobbs has a 4/0 touchdown to interception ratio, been sacked just four times and, in his worst outing, completed 67.7 percent of his passes. Joe Burrow shouldn’t be playing. The calf injury he brought with him into the season has prevented him from throwing downfield with any type of authority. He has two touchdown passes and two interceptions and has guided the Bengals offence into dead last place in total yards, with and average of 236 per game — or 101 yards per game behind Arizona, which is 12th. With the Bengals also now missing Tee Higgins, this could come down to a duel between Joe Mixon and James Conner, as the latter will be carrying the ball against the 31st-ranked run defence while the former will be weaving holes through an Arizona ‘D’ that sits 24th against the run. Bengals coach Zac Taylor is 8-2 ATS in the second of back-to-back road games, but that winning percentage will dip this week — because the wrong team is cast as the favourite. TAKING: ARIZONA +3 SCORE (O/U 44.5): Cardinals 23, Bengals 21 NEW YORK JETS (1-3) at DENVER BRONCOS (1-3) LINE: Denver by 1.5 CHEWABLE: It’s a showdown of the Wilsons at Empower Field at Mile High, where Zach will be coming off a game in which he finally gave the Jets hope that there is life after Aaron Rodgers (injury), and Russell was near perfect in leading the Broncos to a come-from-behind victory over the lowly Bears. Old Russ has faced a lineup of easy defences, while young Zach has gone up against four stout Ds, and now the tables get turned. If the Jets could force Patrick Mahomes into having a very un-Patrick Mahomes like night (18-of-30, 203 yards, two interceptions) what will they do to Russ? Quarterbacks aside, the tangible evidence on why to back the visitors: The Broncos have by far the worst run defence in the NFL, allowing an average of 176 ground yards per game. Jets running backs Breece Hall, Dalvin Cook and even Michael Carter have to be wringing their hands in anticipation. The intangible: When Broncos coach Sean Payton was a TV analyst he said of Nathaniel Hackett’s 15-game run as the Denver sideline boss, “(it) may be one of the worst coaching jobs in the history of the NFL. That’s how bad it was.” Hackett is now the Jets offensive coordinator. If he gets his players wanting to rub it in Payton’s face as much as he does, things could get out of control. TAKING: N.Y. JETS +1.5 SCORE (O/U 43): Jets 27, Broncos 10 JACKSONVILLE JAGUARS (2-2) vs. BUFFALO BILLS (3-1) (at London) LINE : Buffalo by 5.5 CHEWABLE: Never has there been a square-off between two such red-hot Josh Allens as this, where the one that’s an edge rusher for the Jaguars is coming off a three-sack game in a victory over the Falcons while the one who quarterbacks the Bills threw for four TDs and ran for one in a blowout beating of the Dolphins. Never has there been a game played in London where one team has been acclimatizing to the time change, sleep patterns, food, etc., for the better part of two weeks while its opponent is flying in a few days before the game for only its second ever visit to England. When Jaguars schooled the Falcons 23-7 at Wembley Stadium last Sunday it evened their franchise record in London at 5-5, a mark that includes a 34-31 victory over the Bills in 2015, the only other time Buffalo has played overseas … Do the Bills have the same type of letdown they’ve had in the past for games following meetings with Miami, when they are 12-37 ATS in the last 25 years? Probably not, because they’ll be pumped playing in another country. But their offence is about to have a bigger test against a defence that is much better than the one in Miami … The Bills are the best team in the AFC and, looking at the bigger picture, right up there with the Niners. In terms of total yards, they have the NFL’s sixth-ranked defence and sixth-ranked offence. Josh Allen, the quarterback, has yet to amass 100 yards rushing for the season, reaching as high as 46 in just one of the four games. With the Jags owning a strong pass rush, he should be on the move more in this one … After a uninspiring start, Jacksonville will build off the win against Atlanta, but Trevor Lawrence will find the Bills ‘D’ too tough to beat. TAKING: JACKSONVILLE +5.5 SCORE (O/U 48.5): Bills 24, Jaguars 20 CAROLINA PANTHERS (0-4) at DETROIT LIONS (3-1) LINE: Detroit by 10 CHEWABLE: The task of putting clamps on David Montgomery, Jahmyr Gibbs and the rest of the Lions ground attack is too much for the injury-riddled Panthers, who are among the worst in the league when it comes to stopping a running game. These toothless cats from Carolina will also have their hands full with Jared Goff, who is seventh in passing yardage, WR extraordinaire Amon-Ra St. Brown and rookie tight end Sam LaPorta, who seems to be good for one or three big catches per game. Detroit’s Aidan Hutchinson and Charles Harris will too much for the overmatched Carolina pass protectors, which means another tough outing for Bryce Young. If you’re laying the points you’re concerned about the possibility of a back-door cover, but you’re better off sticking with the surging home side. Lions are the second best Survivor Pool pick of the week, and when was the last time you’ve seen or heard those words? TAKING: DETROIT -10 SCORE (O/U 45): Lions 30, Panthers 17 TENNESSEE TITANS (2-2) at INDIANAPOLIS COLTS (2-2) LINE: Tennessee by 2.5 CHEWABLE: Titans are a funny team. They get crushed 27-3 by the Browns in Week 3 and destroy the Bengals 27-3 in Week 4. I have a good feeling about them this week, and at least part of it has to do with Derrick Henry finally getting untracked with his biggest day — just in time to set up a potential showdown with Jonathan Taylor. The Colts have a much better run defence than the Bengals, so Henry is facing a stiffer challenge. I also like that Mike Vrabel gets to game plan against a rookie QB for the first time this season. He better come up with a strong one, because Colts QB Anthony Richardson has shown he has a very good, albeit sometimes erratic arm, and the Titans secondary is below average. TAKING: TENNESSEE -2.5 SCORE (O/U 42.5): Titans 23, Colts 20 NEW YORK GIANTS (1-3) at MIAMI DOLPHINS (3-1) LINE: Miami by 11 CHEWABLE: Hate laying double digits, especially against a team that won a playoff game nine months ago and was expected to take a step forward from there. But along with squeaking by the Cardinals, the G-Men lost by 40 to the Cowboys, by 18 to the Niners and by 21 to the Seahawks, who also sacked quarterback Daniel Jones 11 times on Monday. This week they’re playing a Dolphins team, in Miami, that was being hailed for its greatness before it was pounded by the Bills. It’s also looking like they’ll again be without superstar left tackle Andrew Thomas and quite likely Saquon Barkley, who is not only their best offensive player but their only real threat. The Fish beat them 20-9 at Hard Rock Stadium the last time the teams met, Dec. 12, 2021, and the boys in blue won’t get that close this time. Miami, which is the No. 1 Survivor Pool pick of the week, not only redeems itself from the Buffalo beating but may actually score 70 again. TAKING: MIAMI -11 SCORE (O/U 49.5): Dolphins 37, Giants 14 NEW ORLEANS SAINTS (2-2) at NEW ENGLAND PATRIOTS (1-3) LINE: New England by 1 CHEWABLE: Two teams that failed to reach double digits on the scoreboard in lopsided and ugly defeats last week. With all their weapons, including the return of Alvin Kamara, the Saints managed just nine points, while being torched by Baker Mayfield, because Derek Carr clearly should have been resting his injured shoulder. The Patriots scored just three while giving up 38 in the most lopsided defeat of Bill Belichick’s career. Their normally solid defence was hurt by injuries to CB Christian Gonzalez and LB Matthew Judon, while Mac Jones simply fell on his face in giving Dallas a pair of defensive touchdowns. Sounds like Carr’s shoulder is still problematic, so I’m going to side with the Belichick squelching the whispers that he’s in danger of losing his job — at least for one week — and Jones responding positively to his third-quarter benching. TAKING: NEW ENGLAND -1 SCORE (O/U 40.0): Patriots 21, Saints 17 BALTIMORE RAVENS (3-1) at PITTSBURGH STEELERS (2-2) LINE: Baltimore by 4 CHEWABLE: Already without WR Diontae Johnson, the Steelers offence took a couple of big hits last week when QB Kenny Pickett suffered a muscle strain/bone bruise and TE Pat Freiermuth was sidelined by a hamstring injury. While Freiermuth was not practising as of Wednesday and will likely miss this one, Pickett wore a “bulky knee brace” but says he’ll be ready to go. If not, the Steelers would turn to Mitchell Trubisky, who is mobile and one of the better backups in the league. Coming off an embarrassing 30-6 loss, the Steelers are facing a division rival who just went into Cleveland and beat the Browns (and their backup QB) 28-3. Mike Tomlin, whose teams are 13-2 ATS after losing by 20+ points and 54-30 ATS as a dog, will have his team ready for the Ravens. Expect a huge day from a top-tier defence looking to atone for its mistakes against Houston, with the T.J. Watt-Lamar Jackson matchup must-see TV. Steelers have won five of the last six meetings and whichever way this one goes, getting more than three points with the home team is too good to pass up. TAKING: PITTSBURGH +4 SCORE (O/U: 37.5): Ravens 20, Steelers 17 PHILADELPHIA EAGLES (4-0) at LOS ANGELES RAMS (2-2) LINE: Philadelphia by 4.5 CHEWABLE: The Rams are anticipating the return of Cooper Kupp this week, if only in a limited capacity. A hamstring injury prevented Kupp from suiting up for more than nine games in 2022, but when he played a full season in 2021, he was the NFL’s best receiver. Having him back will cut down on the balls going to Puka Nacua, who leads the NFL with 39 receptions, but it could it also give the Rams the best 1-2 receiving punch in the league. The Eagles are undefeated but still giving their fans reason to squawk. With two new coordinators, they rank 10th in offence and 18th in defence, where they have also allowed nine TD passes, third most in the NFL. Rans quarterback Matthew Stafford is dealing with a hip injury, but he is expected to play, and I’m expecting he’ll have success working against struggling Philly cornerbacks James Bradberry and Darius Slay. TAKING: L.A. RAMS +4.5 SCORE (O/U 50.5): Rams 28, Eagles 24 KANSAS CITY CHIEFS (3-1) at MINNESOTA VIKINGS (1-3) LINE: Kansas City by 4 CHEWABLE: If you have paid attention to the Chiefs offence (and not focused on the next camera shot of Taylor Swift) as it works, you’ll notice something isn’t quite right. Patrick Mahomes himself has said “I just haven’t played very good.” This is a chance to fix that against a defence that is low on talent, and don’t be surprised if Mahomes has his biggest afternoon of the season. But don’t expect the Chiefs to run away and hide against Minnesota. The Vikings offence is good — their passing game ranks third behind the Dolphins and Rams — and even though the Chiefs defend aerial attacks well, the home team will put up some points. The difference might just be Isiah Pacheco, who commentators were comparing to Marshawn Lynch, as he attempts to build off a game against the Jets in which he averaged 5.8 yards per carry over 20 rushes. At the end of the day, Justin Jefferson posts his fourth game of more than 148 receiving yards, and Kirk Cousins enjoys the post-game handshakes a little more than his friend from the Netflix special Quarterbacks . TAKING: MINNESOTA +4 SCORE (O/U 53): Vikings 28, Chiefs 24 DALLAS COWBOYS (3-1) at SAN FRANCISCO 49ERS (4-0) LINE: San Francisco by 3.5 CHEWABLE: Imagine being Brock Purdy, after completing 20 of 21 passes for 283 yards in a 35-16 victory over a division rival to improve your career record (in games you’ve started and finished) to 9-0, and still winding up as a sidebar to the main story — Christian McCaffrey. After scoring four touchdowns last Sunday, the NFL’s best offensive player has seven scores on the season and at least one in 10 straight games. He also leads the league with 459 rushing yards and Sunday, against a Cowboys who can be exploited over the middle, is apt to have a huge receiving day. The Cowboys don’t have anything comparable — Tony Pollard will have a hard time finding room against a run defence that is holding opponents to 66 yards per game — but could get something done by throwing deep balls to CeeDee Lamb against Niners sometimes shaky corners. That’s providing Dak Prescott gets the time against Nick Bosa and friends, who should be able to take advantage of injuries along the Cowboys offensive line. Prescott wants to avenge last year’s 19-12 loss in the divisional playoffs in which he threw two picks and was outplayed by Purdy, but he won’t. Not this time. TAKING: SAN FRANCISCO -3.5 SCORE (O/U 45): Niners 23, Cowboys 17 GREEN BAY PACKERS (2-2) at LAS VEGAS RAIDERS (1-3) LINE: Green Bay by 1 CHEWABLE: Jimmy Garoppolo was practising while still in concussion protocol on Thursday, which means by Monday he should be ready to go and Aidan O’Connell return to the sidelines as a backup. Meanwhile, Packers RB Aaron Jones and WR Christian Watson, who were on snap-count limits when returning from injuries for last Thursday’s loss to the Lions, will be at full steam ahead after a 10-day break. Jones particularly should loom large against Vegas’ 26th ranked run defence. Bottom line: Josh McDaniels’ winning percentage of .333 (7-14) as the Raiders coach drops a little more as the Packers are victorious for the ninth straight time in games between the two teams. TAKING: GREEN BAY -1 SCORE (O/U 44.5): Packers 27, Raiders 20","pubDate":"2023-10-06 03:12:39","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1006stroud-scaled-e1696561933732.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"215f65f696dc8eba38f2fea15c5b15be","title":"WATCH: Alarcon back in action with superb solo goal","link":"https://www.barcablaugranes.com/2023/10/6/23905432/watch-angel-alarcon-offers-barcelona-timely-reminder-of-his-talents-with-solo-goal","keywords":null,"creator":["Barca Blaugranes Staff"],"video_url":null,"description":null,"content":"Angel Alarcon is back from injury and back in the goals too. The Barcelona youngster scored in a 2-0 win for the club in a Youth League win over Porto in midweek. The 19-year-old’s strike may well have made Xavi sit up and take notice too. Alarcon picked up possession in his own half before racing through on goal and finishing neatly. ¡QUÉ GOLAZO DE COSTA A COSTA DE ÁNGEL ALARCÓN (2004)! #UYL pic.twitter.com/TLWzYPBy9F — Football Report (@FootballReprt) October 4, 2023 Alarcon is back after several months out with injury but his return looks to be well-timed with Barcelona having lost Robert Lewandowski to injury. The striker has suffered a sprained ankle , but there are already fears he could miss around a month of action for Xavi’s side . Barca are also without Raphinha due to injury right now, leaving Xavi a little short of options in attack currently. Xavi does still have Ferran Tores, Joao Felix and Lamine Yamal available, but it seems that Alarcon could also be an option if needed.","pubDate":"2023-10-06 03:00:00","image_url":null,"source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"92e543de14ec42139744a5cea4c4aec7","title":"Ukraine demands FIFA, UEFA review decision to allow Russians to compete","link":"https://mb.com.ph/2023/10/6/ukraine-demands-fifa-uefa-review-decision-to-allow-russians-to-compete","keywords":null,"creator":null,"video_url":null,"description":"Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions.","content":"Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions. PARIS (AFP) -- Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions. World football's governing body FIFA on Wednesday, Oct. 4, lifted its suspension on Russia's under-17 teams, following in the footsteps of UEFA, and clearing the way for them to play at the World Cup. UEFA last week reinstated Russian youth teams to its competitions but maintained a ban on the country's senior sides due to the ongoing war in Ukraine. The decision is conditional on Russian teams playing under the name of the \"Football Union of Russia\", while the country's flag, anthem and national playing kit would not be allowed either, FIFA said. On Thursday, Ukraine's Ministry of Youth and Sports condemned \"the decisions of FIFA and UEFA to allow Russian citizens to participate in international competitions\". \"We call on FIFA and UEFA to stand up to the violence and aggression of the Russian federation,\" Ukraine's Sports Ministry said in a statement. \"We demand to review of the FIFA and UEFA decisions as infringing on the rights of Ukrainian children who have been deprived by Russia of the right to train safely and simply live in their homeland without the threat of being kidnapped, raped or killed. \"The occupying Russian regime continues to kill and kidnap Ukrainian children, destroying civilian infrastructure, including stadiums and sports schools, leaving Ukrainian children no opportunity to play sports or live a normal life. \"It has deprived hundreds of our children of their lives. \"At the same time, UEFA and FIFA are bringing back Russian children to compete, and they, through the fault of these organizations, will be convinced that their country has the right to kill others and is doing the right things.\" Russia was barred from all international football tournaments following its invasion of Ukraine in February 2022.","pubDate":"2023-10-06 02:51:22","image_url":"https://storage.googleapis.com/mb-mkt-neo-prod-1-uploads-2/media/FIFA_logo_28ca0b8f93/FIFA_logo_28ca0b8f93.jpg","source_id":"mb","source_priority":29418,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"b9fcc42102557fc3f6d3affc44a0e1a5","title":"Korea faces off with Japan in men's football final; female archers set for gold","link":"https://koreatimes.co.kr/www/nation/2023/10/829_360565.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea will meet its archrival Japan in the men's football final at the 19th Asian Games on Saturday, the last step toward the ultimate goal of the third straight gold medal.","content":"Korean players and coaches celebrate their 2-1 win over Uzbekistan in the men's football semifinals at the Asian Games at Huanglong Sports Centre Stadium in Hangzhou, China, Oct. 4. Yonhap Korea will meet its archrival Japan in the men's football final at the 19th Asian Games on Saturday, the last step toward the ultimate goal of the third straight gold medal. The gold medal match between Korea and Japan will take place at 8 p.m. at Huanglong Sports Centre Stadium in Hangzhou, China. It will be the final stage for the Korean football team to extend its winning streak to three. The country has topped the podium of men's football for two straight Asiads since 2014. Led by head coach Hwang Sun-hong, the players cruised to the gold medal match, scoring 25 goals in six matches, including the semifinal against Uzbekistan, and allowing two. Korea's baseball team is also seeking its fourth consecutive Asian Games title Saturday. If it wins against China in its second Super Round game Friday, Korea will take on Chinese Taipei in the final at Shaoxing Baseball and Softball Sports Centre in Shaoxing. Korean players celebrate their 2-0 victory after the teams' first Super Round game against Japan in the 19th Asian Games baseball tournament at Shaoxing Baseball and Softball Sports Centre in Shaoxing, China, Oct. 5. Yonhap Female archers will target multiple gold medals Saturday at Fuyang Yinhu Sports Centre Final Field in Hangzhou, with one already in hand. Koreans Lim Si-hyeon and An San will compete in women's individual recurve archery for gold in a fresh all-Korean final, while So Chae-won will have a duel with India's Jyothi Surekha Vennam in the women's individual compound final. In women's hockey, Korea will vie for the Asian Games crown with host China at Gongshu Canal Sports Park Stadium. It grabbed the final berth after a shootout victory over Japan in the semis. Korean breakdancers will also go for the gold medal at the Hangzhou Asian Games, where the sport of breaking is being competed for the first time as a medal program. Sport climber Seo Cha-hyun will compete in the semifinals and finals of the women's boulder and lead sport climbing competition Saturday to try to become the first female Korean to win the gold medal in the event. (Yonhap)","pubDate":"2023-10-06 02:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/026a6eb948da4b2985c86381b1f2ba25.jpg","source_id":"koreatimes","source_priority":35310,"country":["south korea"],"category":["sports"],"language":"english"},{"article_id":"4b29eb68b60ba339f183d46f0be86895","title":"Bears' DJ Moore makes fantasy owners happy after torching Commanders in first half","link":"https://www.foxnews.com/sports/bears-dj-moore-makes-fantasy-owners-happy-torching-commanders-first-half","keywords":null,"creator":null,"video_url":null,"description":"Chicago Bears top wide receiver D.J. Moore helped his winless team get off to a hot start against the Washington Commanders, collecting two touchdowns in just over 15 minutes.","content":"close Video Fox News Flash top sports headlines for October 4 Fox News Flash top sports headlines are here. Check out what's clicking on Foxnews.com. The Chicago Bears , winless in their last 14 games, came out firing against the Washington Commanders on Thursday night, and top wide receiver D.J. Moore was the key reason why the score was 27-3 at halftime. Bears quarterback Justin Fields had a career game last week against the Denver Broncos despite the loss, and he continued that momentum on the first drive of the game when he found Moore for a 58-yard bomb down the left sideline to Washington’s 16-yard line. Then, when it seemed the Bears were going to get stopped after a Fields sack forcing a 3rd-and-14, Fields threw an absolute dot to Moore in the back left of the end zone for a quick six points. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM D.J. Moore #2 of the Chicago Bears catches a touchdown pass during the second quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) But Moore wasn’t done making it hurt in the first quarter. The Bears quickly got the ball back after forcing a three-and-out on the Commanders , and the Fields-Moore combo was on full display yet again. To begin the drive, Moore ran a simple curl route where Fields put it right on his chest for a completion. It looked like the Commanders corner that was covering Moore was going to take him down the second he caught the ball. DICK BUTKUS, HALL OF FAMER AND LEGENDARY BEARS LINEBACKER, DEAD AT 80 However, the tackle was poor and Moore made Washington pay. He slipped the tackle and hit the jets down the right sideline for a 39-yard completion instead of the seven yards he was expected to get. That fired up the Bears who continued moving the ball down the field into Washington territory. On 3rd-and-6 on Washington’s 11, Fields trusted Moore once more, lofting a fade pass to the back of the end zone. Moore jumped up and snatched the ball out of the air for his second touchdown of the half in just over 15 minutes of play. D.J. Moore of the Chicago Bears, center, celebrates with teammates after scoring a touchdown during the first quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) Moore finished the half with five receptions for 137 yards with his two scores, making fantasy football owners very happy if he was in their starting lineups. But it wasn’t just Moore that led the Bears to outgain the Commanders, 307-84, in terms of yards in the first half. They rushed for 122 yards, with running back Khalil Herbert leading the way with 76 yards on nine carries. Of course, Fields had his fair share of rushes, gaining 27 yards on six tries. Also, Fields found Cole Kmet for a touchdown, as he had five catches for 42 yards with his score. The Bears are desperate for a win and are in prime position to finally snap that losing streak that spans to the 2022 season. D.J. Moore of the Chicago Bears runs after catching a pass during the first quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) CLICK HERE TO GET THE FOX NEWS APP Moore and the rest of the offense will do what it can in the second half to secure that victory. Scott Thompson is a sports writer for Fox News Digital.","pubDate":"2023-10-06 01:54:50","image_url":null,"source_id":"foxnews","source_priority":59,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b862ad69af6f28de643cb6e47f857445","title":"Nothing’s changed with VAR, says Gareth Southgate","link":"https://www.basingstokegazette.co.uk/sport/national/23837624.nothings-changed-var-says-gareth-southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The England boss says off-field decision-making process has not done anything to resolve controversial refereeing decisions.","content":"The off-field decision-making process has come under renewed fire this week after Liverpool were denied a fair goal in their defeat at Tottenham when VAR Darren England mistakenly thought the on-field decision was onside and inadvertently validated the linesman’s offside call, with play restarting before the mistake was noticed. There has been a huge fallout from the gaffe, with Reds boss Jurgen Klopp calling for the game to be replayed while the Professional Game Match Officials Limited (PGMOL) has announced a review into VAR and its practices. Southgate has always been against it and says nothing has changed from when on-field decisions were final. “Well, all I would say is everybody used to go to the pub and moan about the ref and they still go to the pub and moan about the ref,” he quipped. “So I’m not sure what we’ve resolved, really. I don’t like it, never have, so I have sort of dismissed it. “I just was always brought up as a kid that the referee’s decision was final. You might agree or disagree but we have to get on with it. “I didn’t ever feel we were going to resolve every issue. “I think we are probably too far down the line now to go back but I didn’t like it from the off. “Once you open up a technology opportunity, you are normally going that way and you have got to refine and improve on what happens. But yes, I don’t like it.” The PGMOL has taken unprecedented steps in recent times of retrospectively releasing audio of the decision-making process, including England’s expletive-filled mistake at the weekend. But fans in the stadium remain in the dark at the time, often left waiting for up to five minutes while decisions are scrutinised in Stockley Park. “When I am at games I am always conscious that the only people who don’t know what is going on are the people who have paid to go,” he said. “I find that really difficult. “I am sitting in the stadium next to people and I am lucky as I normally get a free ticket and other people pay a lot of money and haven’t got a clue or are on the phone to someone at home asking what’s going on. “The frustration, you can feel it in the stadium, you can feel the view. “I know if we didn’t have it people would go back to, ‘well this could be resolved’, but when I am in the stadiums my sense is they don’t necessarily want 14 minutes of added time or a decision by something that they are not totally across the process of.” Meanwhile, Spurs boss Ange Postecoglou has said he does not know if he likes “where the game’s heading” in the wake of the VAR controversy. Speaking to the Sydney Morning Herald, prior to the audio emerging and Klopp’s suggestion of a replay, Postecoglou questioned the game’s pursuit of “perfection”. He told the paper: “It seems like we’re now heading towards that space of trying to find perfection in a game where the beauty of it is the imperfection. “What makes our game different from any other game is that the goal – the actual goal, the scoring of a goal – is that most precious commodity. It’s the flaws in the game that creates goals. “Sometimes we think it’s the brilliance – yeah, it is the brilliance, but mostly on the back of somebody’s flaw, either an opposition player or your own teammate or a referee. “We’re trying to make this perfect game, which the other codes do – but they have to, because goals in their game don’t mean anything, so they try and create this perfect product. And that’s not football. “Football is Maradona putting it (in with) his hand. I don’t like it, but that’s the game, and if you want to eliminate that? Yes, OK, but if you’re searching for perfection within football, I just think you take away from what the essence of it is.”","pubDate":"2023-10-06 01:50:54","image_url":"https://www.basingstokegazette.co.uk/resources/images/17302874/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"df742fa67d8bb49d0ebe725874fd8a56","title":"Dubai's Department of Economy and Tourism, Real Madrid announce landmark global partnership","link":"https://www.wam.ae/en/details/1395303206226","keywords":null,"creator":["Rola AlGhoul/ Esraa Esmail"],"video_url":null,"description":null,"content":"Fri 06-10-2023 08:49 AM DUBAI, 6th October, 2023 (WAM) -- Dubai's Department of Economy and Tourism, together with Real Madrid Club de Fútbol, have kicked off a landmark collaboration. The multi-year agreement promises a range of exciting activations, special fan moments and unique experiences for Dubai and Real Madrid fans. The newly formed alliance will equally serve as a powerhouse platform to create new growth opportunities for both institutions and support Dubai's ambitious plans as part of its recently announced Dubai Economic Agenda – D33. Being at the forefront of global sports entertainment with the world's greatest Club aligns perfectly with Dubai's ambitious plans to consolidate its position among the top three global cities. Launching this October, the partnership encompasses Real Madrid's First Men and Women Football Teams, bringing a taste of Dubai to Santiago Bernabéu offering fans unforgettable experiences and services. Issam Kazim, Chief Executive Officer of Dubai Corporation for Tourism and Commerce Marketing (DCTCM), and Florentino Perez, President of Real Madrid Club de Fútbol, formalised the partnership during an official ceremony at the legendary Sala de Juntas in Ciudad Real Madrid, in the presence of Jose Angel Sanchez, Chief Executive Officer of the Club, and Emilio Butragueño, Real Madrid legend and Director of Institutional Relations. Kazim commented, \"We are excited to begin our journey with Real Madrid as a global partner. This game-changing collaboration between Dubai and the greatest Club in the world is built upon a shared vision and values, where every achievement motivates one to pursue new heights. With our aim to consolidate Dubai's position among the top three global cities, this strategic alliance will harness the strengths of a leading destination and the world's most celebrated team to reaffirm Dubai globally as the best city to visit, live, and work in.\" Butragueño, in turn, said, \"We are very proud of this new partnership with Dubai's Department of Economy and Tourism as the Club's first Official Destination Partner. Dubai is a destination that strives for excellence in all its entertainment offerings, a value shared by the Club. We are delighted to bring this exciting tourist destination to our millions of Madridistas around the world.\" Dubai's strong public and private sector relations are at the heart of its success, and this new collaboration with Real Madrid further builds on a longstanding partnership that Emirates has cemented since 2011. It is also perfectly timed for the upcoming Real Madrid themed-park at Dubai Parks and Resorts, the largest theme park destination in the Middle East, which will further expand the city's diverse destination proposition. The park, which will be the world's first Real Madrid-themed park, will feature a number of Real Madrid-related attractions, such as a museum, amusement rides and football skill games, food and beverage outlets, and retail spaces selling official Real Madrid products.","pubDate":"2023-10-06 06:25:05","image_url":null,"source_id":"wam","source_priority":799259,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"article_id":"0128ab392d5b9f1a65d4d5c5c4f9bb60","title":"Punjab FC vs NorthEast United FC, ISL 2023-24 Live Streaming Online on JioCinema: Watch Telecast of PFC vs NEUFC Match in Indian Super League 10 on TV and Online","link":"https://www.latestly.com/sports/football/punjab-fc-vs-northeast-united-fc-isl-2023-24-live-streaming-online-on-jiocinema-watch-telecast-of-pfc-vs-neufc-match-in-indian-super-league-10-on-tv-and-online-5466637.html","keywords":null,"creator":null,"video_url":null,"description":"North East United had a poor campaign last season and they have a win and loss in their two games this term. They will be fancying themselves to come up with a good performance this evening. Punjab FC on the other hand, have lost both their matches so far. Read below to check out the live streaming and telecast details of the Punjab FC vs NorthEast United FC match.","content":"Newly promoted Punjab FC will be taking on North East United at home with an aim to secure their first win of the 2023-24 Indian Super League season. It has not been the best of starts by them with two straightforward losses against Mohun Bagan and Goa. While the defence did shore up a bit against the Gaurs in the last game, the attacking and midfield display was well below par which is a cause for worry. The team lacks the big game experience and it is evident with their display on the pitch. North East United had a poor campaign last season and they have a win and loss in their two games this term. They will be fancying themselves to come up with a good performance this evening. Punjab FC versus NorthEast United FC will be telecasted on the Sports18 network and streamed on the Jio Cinema app from 8:00 pm. ISL 2023-24 Points Table Updated Live. Nikhil Prabhu in defence looked lively against Goa and his partnership against Melroy Melwin Assisi will be crucial against North East. Luka Majcen and Juan Mera have not had much opportunity to score goals which is a concern. The duo will need their midfielder to try and dominate possession to create chances. Parthib Gogoi was the star of the show for North East United against Chennaiyin as he tormented the opposition backlines with his darting runs. He was rewarded with a goal while fellow attacking player Konsam Phalguni Singh was also on the scoresheet. The team has quality players going forward and when they click, the team does score a few. Indian international Manvir Singh is expected to keep his place on the flanks. ISL 2023–24 Schedule Announced . When Is Punjab FC vs NorthEast United FC, ISL 2023-24, Football Match Schedule (Know Date, Time and Venue) Punjab FC will face NorthEast United FC in the Indian Super League 2023-24 on Friday, October 6. The PFC vs NEUFC ISL match will be played at the Jawaharlal Nehru Stadium in New Delhi and it starts at 8:00 pm IST (Indian Standard Time). Where To Watch Punjab FC vs NorthEast United FC, ISL 2023-24 Football Telecast On TV? Viacom18 Network have the broadcasting rights for the Indian Super League in India. Fans can tune into VH1, Sports18 1 SD/HD (English Commentary), Sports18 Khel (Hindi Commentary, Surya Movies (Malayalam Commentary), Colours Bangla Cinema (Bangla Commentary for MBSG and EBFC only) channels to watch live telecast of the Punjab FC vs NorthEast United FC match. For live streaming details, scroll down. How To Watch Punjab FC vs NorthEast United FC, ISL 2023-24 Football Live Streaming Online? JioCinema, the official OTT platform of Viacom18 Network, will live stream the Punjab FC vs NorthEast United FC, ISL 2023-24 match on online platforms. Fans can tune into the JioCinema app and website to catch the action live. One Football will provide live streaming of the match Internationally. NorthEast United should win this game although it may not be a high-scoring encounter. (The above story first appeared on LatestLY on Oct 06, 2023 11:41 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-10-06 06:11:23","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bf709676a6fe3f31033180b28afdb7fc","title":"Ross County's women and girls aiming for the top","link":"https://www.ross-shirejournal.co.uk/sport/ross-countys-women-and-girls-aiming-for-the-top-328760/","keywords":null,"creator":null,"video_url":null,"description":"The Staggies&#39; women&#39;s and girls&#39; section has grown rapidly in recent years, and those involved see no reason why they can&#39;t aim for the highest level.","content":"Women's football at Ross County will take a significant step forward next year with the introduction of two new senior teams. A development team will , while the first team will take part in Scottish Women's Football's performance pathway, joining the regional SWFL leagues. This is a step that has been a long time coming. Starting off as Invergordon Girls, the club joined forces with Ross County in 2019, and have since grown beyond anyone's wildest expectations. Now, it is not uncommon to see more than 100 girls attending training. The current oldest age group side, the under-16s, have also already played other senior teams and competed well. That has only fuelled confidence of what can be achieved by the Staggies – and quickly, if expectations are met. \"We want to take the club as far as we possibly can,\" head coach Iain MacIver explained. \"In the first year we enter that North League, a lot of people would probably look at it as a development year but we'll be looking to go up if possible. \"We've played the team that are currently sitting top a few weeks ago, and we did pretty well, so we'll be looking to do pretty well and get into the national leagues. \"I think all the players there have the ambition to go as far as they can – ideally with us, but they want to forge a career in football. \"A few years ago that wouldn't really have been a possibility for girls from here. Even going back a couple of decades in Scotland, it wouldn't have been physically possible, but now, they have ambitions and see professional players on TV so it's something for them to aspire to.\" Those ambitions come through clearly by talking to the players themselves. Sisters Kiera and Teagan Syrjanen both play for the club's under-16s, and have been part of the squads that took on senior teams elsewhere. The Dingwall Academy pupils are in no doubt about where they want to go in football, and the impact that establishing senior teams at Ross County could have on their chances of being successful. Kiera said: \"It's just good for girls' football in general. Obviously men's football is huge, so I hope women's football keeps growing too. \"I want to play for Scotland or a high-end team in England. Maybe Rangers as well. \"We're playing friendlies against teams more well-known than us, which will make us well-known, and we've matched their standards so it shows that in the future we can be just as big. \"We're obviously starting a women's team, so we're building that pathway up to the top which wasn't always there. It's good for the club to have somewhere to go after you've finished with the under-16s.\" Teagan explained: \"We think about it for when we're older. \"One of my main goals is to play for Scotland, but I think I'd also like to play for Chelsea or a team in England, and I think that is realistic, because we're playing a few top teams already and have performed very well. \"When we first joined, we didn't really know what the future would look like for us, but now we know more and can see the pathway there. \"If new girls join, they know there's that pathway there and it's not just one team and then that's the end of it.\" One of the things that will help Staggies talents reach those heights is greater integration between the women's club and the men's academy and senior side. With plans in place for the new senior women's teams in 2024, that connection has recently taken a big step forward as County's head of professional academy Gary Warren has started to get involved in training sessions. Even on first impressions, he has been very impressed – and with a young daughter Warren has every reason to take a vested interest in the fortunes of the women's side of the club. \"My main role now is to oversee a programme that will unite the girls and the boys together,\" Warren said. \"I've just recently had my first coaching session with the girls, and it was really good and really enjoyable. There's some great talent, and that's not just at one particular level – that's across the age groups. \"There is so much out there to offer – not just in the local area but also in Stornoway and the islands – it would be silly not to develop a programme that will help these girls flourish. \"It's so important. You look at how the game has developed and the academies that have been created down south and oversees, and we're in a position where we can try and do that. \"We can nurture and develop these girls. They've got a great set-up – when I was out there over 120 girls showed up in one night, which is incredible. These coaches give up their own time to help out, so it's important that we help to maximise the opportunity for everyone to flourish. \"Before you would look at the women's game and a lot of people wouldn't think it was at the same level, but you look at how much it has changed and how much the quality has improved in terms of technical, tactical and physical, and the game has improved so much. \"I have a little girl myself, and she loves her football, so it's great for me to see the game develop and hopefully one day she can follow in the current players' footsteps. If she can emulate some of these players now, she'll have a good upbringing in football and a good understanding. \"You feel the excitement just by turning up and watching them train. When you do that, you see the standards and that makes you think 'wow, this could be something really special'. \"It's important that we really now work together as a club and as a group to join forces and develop the programme as much as we can.\" The commitment from the men's side of Ross County is absolute, and goes right to the top of the club. Chief executive officer Steven Ferguson was at pains to hail the work that MacIver and Glenda Scobbie have done with the women's side over recent years, and is looking forward to seeing how an even more integrated set-up will progress in the future. \"We recognise how important it is for girls and women in this area, and we also recognise the part that we have to play as the senior club,\" Ferguson added. \"We are ready to make sure that we are completely joined up, and give them the opportunity and the support that they deserve. \"When this got off the ground many years ago now, it was essentially a partnership in name only, but the plan was always to make sure that year by year we had something that was sustainable and growing organically. \"We weren't trying to force or demand anything, and it has grown to this stage where it needs more and more input and support from the football club to make sure it's fully integrated. \"The most important thing is that it's sustainable so that we have a Ross County women's team in 10 years' time, and we have the solid foundations in place. \"It's so important to us as a football club that everybody is catered to whatever their level, and I'm really looking forward to see the young girls developing into young women that will go on to compete at a national level and represent this area and club. It's really exciting. \"There is definitely a buzz around girls' and women's football. As a football club and as an area, we are no different. \"I see girls who have played on a Saturday morning, and both them and the team they have played are in the stadium watching a first team game in the afternoon. That's what gives me a buzz – the fact that it's completely integrated across the women's and men's game, and everybody is enjoying both parts of it, to make it that one club. \"That's my goal, to very much be catering for absolutely everybody and inclusive for everyone. That's really important to us as a football club, and it's really exciting to think about the distance that we've come over the last four or five years – and we're only just scratching the surface. \"What we have in place are really solid foundations that will shape the next five years, and I think that's the bit that excites everybody.\"","pubDate":"2023-10-06 06:00:00","image_url":null,"source_id":"ross_shirejournal","source_priority":1094642,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3aa82fdc02d28e8217aa3710d9a6f94b","title":"Daily Schmankerl: Chelsea in the mix for Bayern Munich’s Alphonso Davies; Bayern eyeing Valencia youngster; Liverpool duo headed to Saudi Arabia?; Chelsea looking Dušan Vlahović and Alvaro Morata; Frans Krätzig praised again; and MORE!","link":"https://www.bavarianfootballworks.com/2023/10/6/23904435/chelsea-bayern-munich-davies-valencia-guerra-liverpool-juventus-vlahovic-morata-kratzig-transfer-tel","keywords":null,"creator":["CSmith1919"],"video_url":null,"description":null,"content":"Davies rumors are persisting (Chelsea Chronicle) Rumors have been floating for a few months now that Alphonso Davies could be on the fast track out of Bayern Munich . With his contract negotiations at a standstill and his agent popping off intermittently about a potential move, Davies’ future in Germany is uncertain as ever. With Real Madrid already considered a prime contender to get Davies, Chelsea FC and Manchester City are also getting ready for the transfer competition: There’s been transfer rumours emerge this week involving both Chelsea and Bayern Munich’s Alphonso Davies, which is why it’s certainly worth looking back on previous comments from Ashley Cole. 90min claimed on Wednesday that Chelsea are being kept informed on Bayern left-back Alphonso Davies. The German heavyweights want their 22-year-old defender to sign a new contract with them, but he’s grabbing the attention of Chelsea, Real Madrid and Manchester City. Speaking in 2020 via The Mirror, Cole raved about Davies’ quality: “He’s so direct, he’s quick, he can go inside or outside. “I played against him in the MLS and, obviously, he couldn’t combine there with players of the quality Bayern have. Moving to Bayern was a big step, it was a huge risk going from somewhere he was comfortable to play with top stars, but he has just improved –his timing, his understanding, when to go in behind, when to drag people out of position. He has improved on his decision-making and, of course, his strength is his speed.” With clubs like Real Madrid, Manchester City, and Chelsea in the mix, Davies is going to have his choice of destinations should he want to go. Will it happen? The next few months will certainly give fans an indication of how things are progressing. The initial 90Min.com report also states the obvious — Bayern Munich wants to re-up its Canadian star, but it is unclear at this point how serious Davies is about leaving the club. Related With Real Madrid planning 2024 heist, Bayern Munich preps for talks with Alphonso Davies Alphonso Davies’ agent puts Bayern Munich on notice, says Real Madrid and Premier League clubs are interested (Update: Full quote) Salah, Thiago headed to Saudi league? (Fichajes via 90Min.com) It sure seems like Liverpool FC is heading for a changing of the guard next summer. Thiago Alcantara and Mo Salah are two of the big names who could move on: Liverpool duo Mohamed Salah and Thiago Alcantara are among the top targets for the Saudi Pro League next summer. Related What is going on with former Bayern Munich man Thiago at Liverpool? Bavarian Podcast Works: Weekend Warm-up Podcast Season 3, Episode 13 (Bavarian Football Works) As Bayern Munich heads into another international break, the Bavarians will face a stiff test from SC Freiburg, but also have the opportunity to quiet some of noise surrounding the team. Thomas Tuchel has the fanbase at each other’s throats and while the team is winning, things are not as pretty as most would like. There are transfer rumors and A LOT to talk about with the squad. So, let’s get to it! Here is what we have on tape for this episode: A preview of the Bayern Munich vs. SC Freiburg match where we take a look at the form of each team, the potential starting lineup for Bayern, and give a prediction on the match. Discussing the uneasy feeling that Bayern Munich’s wins are covering for a lot of flaws with the team. Bayern Munich is not getting the most out of Harry Kane...but why? Let’s talk about it. Leroy Sané, Serge Gnabry, Alphonso Davies, Matthijs de Ligt, and Joshua Kimmich are just some of the names that have already been linked with a transfer away for next summer. Asr these just baseless rumors or is there a brewing problem on the squad? Addressing those Jerome Boateng rumors. Related Bavarian Podcast Works: Weekend Warm-up Podcast Season 3, Episode 13 — A preview of Bayern Munich vs. SC Freiburg; Why Bayern’s wins don’t mean everything; Bayern’s recent transfer rumors; and MORE! Bayern eyeing Valencia youngster (Bild via @iMiaSanMia) Bayern Munich could be looking at another young midfielder — this time, Valencia’s Javi Guerra: Valencia midfielder Javi Guerra (20) is one of the players being watched by FC Bayern, although there’s nothing concrete at the moment. Guerra profiles mostly as a No. 8 per Transfermarkt and could be a relatively cheap acquisition should Bayern Munich opt to go into that direction. Related Bayern Munich looking to splash the cash in January as squad is reduced to bare bones Morata in the mix if Chelsea can’t get Juve star (CalciomercatoTV via 90Min.com) If Chelsea cann not get Juventus striker Dušan Vlahović, it will push to get Atlético Madrid striker Alvaro Morata: Chelsea are prepared to try and re-sign Atletico Madrid striker Alvaro Morata if they fail to convince Juventus to part ways with Dušan Vlahović. Related Report: If Harry Kane transfer sputters, Bayern Munich could shift quickly to Plan B — Juventus star Dušan Vlahović Bavarian Podcast Works — Postgame Show: FC Copenhagen 1-2 Bayern Munich (Bavarian Football Works) Bayern Munich once again came into a game completely unprepared and paid for it with a poor first half in which the team came to the dressing room behind on goals. Just like the last game however, Tuchel was bailed out by individual brilliance from the usual suspects. After a pair of games that made it look like Thomas Tuchel knew what he was doing, we have been treated to a pair of games that have made it look like Tuchel has never managed a game of football in his life. In this podcast, Rayyan goes over (rants about) the game and Bayern in detail. A look at the starting XIs for the game. The tactical decisions that Thomas Tuchel made. The lack of any direction or ‘game plan’ for Tuchel. A signature Cyler Meltdown™ over the state of Bayern. Related Bavarian Podcast Works: Postgame Show — FC Copenhagen 1-2 Bayern Munich (UEFA Champions League) Matthäus says Bayern can trust Krätzig (Tz via @iMiaSanMia) Lothar Matthäus has seen Bayern Munich’s depth issues, but he does think that Thomas Tuchel can trust youngster Frans Krätzig. “I saw him during pre-season in Asia, not just his goal against Liverpool back then. You can rely on some young players. You have to trust them, play them and talk to them. In the future, I would like to see young players integrated step by step,” Matthäus remarked. Krätzig has certainly impressed and brought a spark to each game that he has entered. However, with Bayern Munich looking to add depth in January, the Krätzig’s potential role in the second half of the season could decrease. Related Bayern Munich star Leon Goretzka lauds “clever” Frans Krätzig after Preußen Münster performance Surging Stuttgart star gets interest from Spurs, Hammers (TEAMtalk) VfB Stuttgart attacker Serhou Guirassy has gotten off to a red hot start for Die Schwaben and is now getting interest from Tottenham Hotspur and West Ham United: A host of Premier League clubs including Tottenham and West Ham have taken an interest in a Stuttgart striker who is currently outscoring Harry Kane in the Bundesliga. Serhou Guirassy is hitting the radar of Premier League clubs following his early season goal-blitz in Germany. The Stuttgart striker is one of the most in-form front men in Europe after a return of 10 goals from six Bundesliga outings. Related FC Barcelona’s Robert Lewandowski says Harry Kane was “good solution” for Bayern Munich, eager to see how it all plays out Bavarian Podcast Works — Flagship Show: Season 6, Episode 12 (Bavarian Football Works) Compared to last week, Bayern Munich really gave us a lot to talk about this time round. Unfortunately, not a lot of it is good news. A 2-2 draw to RB Leipzig marks the third consecutive game where Thomas Tuchel has failed to win versus Marco Rose and his cans. In the meanwhile, the bosses have suddenly begun and almost finalized talks with Jerome Boateng, which is causing a variety of reactions from the fanbase. Meanwhile, Max Eberl was sacked by RBL and he’s rumored to be on his way to Bayern, while there’s also a game against Copenhagen in the Champions League this week. In this episode, INNN and Cyler discuss the following: Why does Thomas Tuchel seem incapable of beating the better teams that he faces? Understanding why Tuchel dislikes giving certain players like Thomas Muller, Noussair Mazraoui, and Matthijs de Ligt playing time. The entire problem with Tuchel’s philosophy with the squad. An in-depth look at the controversy surrounding the Jerome Boateng transfer — why this move would be a complete travesty. Is Max Eberl the next board member at Bayern Munich? How might Christoph Freund and Eberl get along? A quick preview of the Champions League game versus Copenhagen and what we can expect. Related Bavarian Podcast Works S6E12: Why Jerome Boateng would be a disgusting signing for Bayern Munich + Why can’t Thomas Tuchel beat top teams? + Eberl updates + UCL preview","pubDate":"2023-10-06 04:00:00","image_url":null,"source_id":"bavarianfootballworks","source_priority":27959,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b3686054adb6754f41017ad75806507c","title":"NFL Week 5 Picks: Eagles suffer first loss, Vikings upset Chiefs, Niners beat Cowboys yet again","link":"https://torontosun.com/sports/football/nfl/nfl-week-5-picks-eagles-suffer-first-loss-vikings-upset-chiefs-niners-beat-cowboys-yet-again","keywords":["Football","NFL","Sports"],"creator":["Don Brennan"],"video_url":null,"description":"After winning 11 games over their last three seasons, the Texans appear headed in the right direction after destroying Jacksonville and Pittsburgh the last two weeks.","content":"HOUSTON TEXANS (2-2) at ATLANTA FALCONS (2-2) LINE: Atlanta by 1.5 CHEWABLE: After winning 11 games over their last three seasons, the Texans appear headed in the right direction after destroying Jacksonville and Pittsburgh the last two weeks. A lot of that is rookie C.J. Stroud, who currently sits fourth in passing yards with 1212, which is more than Justin Herbert, Patrick Mahomes, Josh Allen and Jalen Hurts. First-year head coach DeMeco Ryans also deserves credit, as the Texans have a banged-up offensive line that was missing four starters in last week’s 30-6 dominance of T.J. Watt, Alex Highsmith and the rest of the Steelers. Texans supposedly have a poor run defence, but they have not allowed any one player more than 88 rushing yards or any team more than 126 to date. Now they face a Falcons team whose offence is built around backs Bijan Robinson and Tyler Allgeier. While many think the injuries will catch up to the Texans, Pro Bowl LT Laremy Tunsil was back at practice Wednesday. The Falcons lose because of the QB matchup — Desmond Ridder is the worst starter in the league — and because this week they’re having to deal with jet lag from their trip to England. TAKING: HOUSTON +1.5 SCORE (O/U: 41.5): Texans 24, Falcons 17 CINCINNATI BENGALS (1-3) at ARIZONA CARDINALS (1-3) LINE: Cincinnati by 3 CHEWABLE: Does this not look like a mistake? Don’t you think the wrong side is being cast as the favourite? I had the Cardinals as the 32nd-best team in the league to start the season, but no longer. They’ve been in every game this season — except for their 35-16 loss to the Niners last week, but even that score is misleading as their back-to-back Zachs, Ertz and Pascal, dropped what would have been sure TD passes in the last minute — and they put a beating on the Cowboys. The Bengals’ three losses include both their road games to date, a 24-3 pounding by Cleveland in Week 1 and a 27-3 spanking in Tennessee last week, which I think means they’re being outscored 51-6 as visitors. And now they’re laying points in Arizona? Something you wouldn’t have thought possible — the quarterback matchup is heavily in favour of the Cards. Joshua Dobbs has a 4/0 touchdown to interception ratio, been sacked just four times and, in his worst outing, completed 67.7 percent of his passes. Joe Burrow shouldn’t be playing. The calf injury he brought with him into the season has prevented him from throwing downfield with any type of authority. He has two touchdown passes and two interceptions and has guided the Bengals offence into dead last place in total yards, with and average of 236 per game — or 101 yards per game behind Arizona, which is 12th. With the Bengals also now missing Tee Higgins, this could come down to a duel between Joe Mixon and James Conner, as the latter will be carrying the ball against the 31st-ranked run defence while the former will be weaving holes through an Arizona ‘D’ that sits 24th against the run. Bengals coach Zac Taylor is 8-2 ATS in the second of back-to-back road games, but that winning percentage will dip this week — because the wrong team is cast as the favourite. TAKING: ARIZONA +3 SCORE (O/U 44.5): Cardinals 23, Bengals 21 NEW YORK JETS (1-3) at DENVER BRONCOS (1-3) LINE: Denver by 1.5 CHEWABLE: It’s a showdown of the Wilsons at Empower Field at Mile High, where Zach will be coming off a game in which he finally gave the Jets hope that there is life after Aaron Rodgers (injury), and Russell was near perfect in leading the Broncos to a come-from-behind victory over the lowly Bears. Old Russ has faced a lineup of easy defences, while young Zach has gone up against four stout Ds, and now the tables get turned. If the Jets could force Patrick Mahomes into having a very un-Patrick Mahomes like night (18-of-30, 203 yards, two interceptions) what will they do to Russ? Quarterbacks aside, the tangible evidence on why to back the visitors: The Broncos have by far the worst run defence in the NFL, allowing an average of 176 ground yards per game. Jets running backs Breece Hall, Dalvin Cook and even Michael Carter have to be wringing their hands in anticipation. The intangible: When Broncos coach Sean Payton was a TV analyst he said of Nathaniel Hackett’s 15-game run as the Denver sideline boss, “(it) may be one of the worst coaching jobs in the history of the NFL. That’s how bad it was.” Hackett is now the Jets offensive coordinator. If he gets his players wanting to rub it in Payton’s face as much as he does, things could get out of control. TAKING: N.Y. JETS +1.5 SCORE (O/U 43): Jets 27, Broncos 10 JACKSONVILLE JAGUARS (2-2) vs. BUFFALO BILLS (3-1) (at London) LINE : Buffalo by 5.5 CHEWABLE: Never has there been a square-off between two such red-hot Josh Allens as this, where the one that’s an edge rusher for the Jaguars is coming off a three-sack game in a victory over the Falcons while the one who quarterbacks the Bills threw for four TDs and ran for one in a blowout beating of the Dolphins. Never has there been a game played in London where one team has been acclimatizing to the time change, sleep patterns, food, etc., for the better part of two weeks while its opponent is flying in a few days before the game for only its second ever visit to England. When Jaguars schooled the Falcons 23-7 at Wembley Stadium last Sunday it evened their franchise record in London at 5-5, a mark that includes a 34-31 victory over the Bills in 2015, the only other time Buffalo has played overseas … Do the Bills have the same type of letdown they’ve had in the past for games following meetings with Miami, when they are 12-37 ATS in the last 25 years? Probably not, because they’ll be pumped playing in another country. But their offence is about to have a bigger test against a defence that is much better than the one in Miami … The Bills are the best team in the AFC and, looking at the bigger picture, right up there with the Niners. In terms of total yards, they have the NFL’s sixth-ranked defence and sixth-ranked offence. Josh Allen, the quarterback, has yet to amass 100 yards rushing for the season, reaching as high as 46 in just one of the four games. With the Jags owning a strong pass rush, he should be on the move more in this one … After a uninspiring start, Jacksonville will build off the win against Atlanta, but Trevor Lawrence will find the Bills ‘D’ too tough to beat. TAKING: JACKSONVILLE +5.5 SCORE (O/U 48.5): Bills 24, Jaguars 20 CAROLINA PANTHERS (0-4) at DETROIT LIONS (3-1) LINE: Detroit by 10 CHEWABLE: The task of putting clamps on David Montgomery, Jahmyr Gibbs and the rest of the Lions ground attack is too much for the injury-riddled Panthers, who are among the worst in the league when it comes to stopping a running game. These toothless cats from Carolina will also have their hands full with Jared Goff, who is seventh in passing yardage, WR extraordinaire Amon-Ra St. Brown and rookie tight end Sam LaPorta, who seems to be good for one or three big catches per game. Detroit’s Aidan Hutchinson and Charles Harris will too much for the overmatched Carolina pass protectors, which means another tough outing for Bryce Young. If you’re laying the points you’re concerned about the possibility of a back-door cover, but you’re better off sticking with the surging home side. Lions are the second best Survivor Pool pick of the week, and when was the last time you’ve seen or heard those words? TAKING: DETROIT -10 SCORE (O/U 45): Lions 30, Panthers 17 TENNESSEE TITANS (2-2) at INDIANAPOLIS COLTS (2-2) LINE: Tennessee by 2.5 CHEWABLE: Titans are a funny team. They get crushed 27-3 by the Browns in Week 3 and destroy the Bengals 27-3 in Week 4. I have a good feeling about them this week, and at least part of it has to do with Derrick Henry finally getting untracked with his biggest day — just in time to set up a potential showdown with Jonathan Taylor. The Colts have a much better run defence than the Bengals, so Henry is facing a stiffer challenge. I also like that Mike Vrabel gets to game plan against a rookie QB for the first time this season. He better come up with a strong one, because Colts QB Anthony Richardson has shown he has a very good, albeit sometimes erratic arm, and the Titans secondary is below average. TAKING: TENNESSEE -2.5 SCORE (O/U 42.5): Titans 23, Colts 20 NEW YORK GIANTS (1-3) at MIAMI DOLPHINS (3-1) LINE: Miami by 11 CHEWABLE: Hate laying double digits, especially against a team that won a playoff game nine months ago and was expected to take a step forward from there. But along with squeaking by the Cardinals, the G-Men lost by 40 to the Cowboys, by 18 to the Niners and by 21 to the Seahawks, who also sacked quarterback Daniel Jones 11 times on Monday. This week they’re playing a Dolphins team, in Miami, that was being hailed for its greatness before it was pounded by the Bills. It’s also looking like they’ll again be without superstar left tackle Andrew Thomas and quite likely Saquon Barkley, who is not only their best offensive player but their only real threat. The Fish beat them 20-9 at Hard Rock Stadium the last time the teams met, Dec. 12, 2021, and the boys in blue won’t get that close this time. Miami, which is the No. 1 Survivor Pool pick of the week, not only redeems itself from the Buffalo beating but may actually score 70 again. TAKING: MIAMI -11 SCORE (O/U 49.5): Dolphins 37, Giants 14 NEW ORLEANS SAINTS (2-2) at NEW ENGLAND PATRIOTS (1-3) LINE: New England by 1 CHEWABLE: Two teams that failed to reach double digits on the scoreboard in lopsided and ugly defeats last week. With all their weapons, including the return of Alvin Kamara, the Saints managed just nine points, while being torched by Baker Mayfield, because Derek Carr clearly should have been resting his injured shoulder. The Patriots scored just three while giving up 38 in the most lopsided defeat of Bill Belichick’s career. Their normally solid defence was hurt by injuries to CB Christian Gonzalez and LB Matthew Judon, while Mac Jones simply fell on his face in giving Dallas a pair of defensive touchdowns. Sounds like Carr’s shoulder is still problematic, so I’m going to side with the Belichick squelching the whispers that he’s in danger of losing his job — at least for one week — and Jones responding positively to his third-quarter benching. TAKING: NEW ENGLAND -1 SCORE (O/U 40.0): Patriots 21, Saints 17 BALTIMORE RAVENS (3-1) at PITTSBURGH STEELERS (2-2) LINE: Baltimore by 4 CHEWABLE: Already without WR Diontae Johnson, the Steelers offence took a couple of big hits last week when QB Kenny Pickett suffered a muscle strain/bone bruise and TE Pat Freiermuth was sidelined by a hamstring injury. While Freiermuth was not practising as of Wednesday and will likely miss this one, Pickett wore a “bulky knee brace” but says he’ll be ready to go. If not, the Steelers would turn to Mitchell Trubisky, who is mobile and one of the better backups in the league. Coming off an embarrassing 30-6 loss, the Steelers are facing a division rival who just went into Cleveland and beat the Browns (and their backup QB) 28-3. Mike Tomlin, whose teams are 13-2 ATS after losing by 20+ points and 54-30 ATS as a dog, will have his team ready for the Ravens. Expect a huge day from a top-tier defence looking to atone for its mistakes against Houston, with the T.J. Watt-Lamar Jackson matchup must-see TV. Steelers have won five of the last six meetings and whichever way this one goes, getting more than three points with the home team is too good to pass up. TAKING: PITTSBURGH +4 SCORE (O/U: 37.5): Ravens 20, Steelers 17 PHILADELPHIA EAGLES (4-0) at LOS ANGELES RAMS (2-2) LINE: Philadelphia by 4.5 CHEWABLE: The Rams are anticipating the return of Cooper Kupp this week, if only in a limited capacity. A hamstring injury prevented Kupp from suiting up for more than nine games in 2022, but when he played a full season in 2021, he was the NFL’s best receiver. Having him back will cut down on the balls going to Puka Nacua, who leads the NFL with 39 receptions, but it could it also give the Rams the best 1-2 receiving punch in the league. The Eagles are undefeated but still giving their fans reason to squawk. With two new coordinators, they rank 10th in offence and 18th in defence, where they have also allowed nine TD passes, third most in the NFL. Rans quarterback Matthew Stafford is dealing with a hip injury, but he is expected to play, and I’m expecting he’ll have success working against struggling Philly cornerbacks James Bradberry and Darius Slay. TAKING: L.A. RAMS +4.5 SCORE (O/U 50.5): Rams 28, Eagles 24 KANSAS CITY CHIEFS (3-1) at MINNESOTA VIKINGS (1-3) LINE: Kansas City by 4 CHEWABLE: If you have paid attention to the Chiefs offence (and not focused on the next camera shot of Taylor Swift) as it works, you’ll notice something isn’t quite right. Patrick Mahomes himself has said “I just haven’t played very good.” This is a chance to fix that against a defence that is low on talent, and don’t be surprised if Mahomes has his biggest afternoon of the season. But don’t expect the Chiefs to run away and hide against Minnesota. The Vikings offence is good — their passing game ranks third behind the Dolphins and Rams — and even though the Chiefs defend aerial attacks well, the home team will put up some points. The difference might just be Isiah Pacheco, who commentators were comparing to Marshawn Lynch, as he attempts to build off a game against the Jets in which he averaged 5.8 yards per carry over 20 rushes. At the end of the day, Justin Jefferson posts his fourth game of more than 148 receiving yards, and Kirk Cousins enjoys the post-game handshakes a little more than his friend from the Netflix special Quarterbacks . TAKING: MINNESOTA +4 SCORE (O/U 53): Vikings 28, Chiefs 24 DALLAS COWBOYS (3-1) at SAN FRANCISCO 49ERS (4-0) LINE: San Francisco by 3.5 CHEWABLE: Imagine being Brock Purdy, after completing 20 of 21 passes for 283 yards in a 35-16 victory over a division rival to improve your career record (in games you’ve started and finished) to 9-0, and still winding up as a sidebar to the main story — Christian McCaffrey. After scoring four touchdowns last Sunday, the NFL’s best offensive player has seven scores on the season and at least one in 10 straight games. He also leads the league with 459 rushing yards and Sunday, against a Cowboys who can be exploited over the middle, is apt to have a huge receiving day. The Cowboys don’t have anything comparable — Tony Pollard will have a hard time finding room against a run defence that is holding opponents to 66 yards per game — but could get something done by throwing deep balls to CeeDee Lamb against Niners sometimes shaky corners. That’s providing Dak Prescott gets the time against Nick Bosa and friends, who should be able to take advantage of injuries along the Cowboys offensive line. Prescott wants to avenge last year’s 19-12 loss in the divisional playoffs in which he threw two picks and was outplayed by Purdy, but he won’t. Not this time. TAKING: SAN FRANCISCO -3.5 SCORE (O/U 45): Niners 23, Cowboys 17 GREEN BAY PACKERS (2-2) at LAS VEGAS RAIDERS (1-3) LINE: Green Bay by 1 CHEWABLE: Jimmy Garoppolo was practising while still in concussion protocol on Thursday, which means by Monday he should be ready to go and Aidan O’Connell return to the sidelines as a backup. Meanwhile, Packers RB Aaron Jones and WR Christian Watson, who were on snap-count limits when returning from injuries for last Thursday’s loss to the Lions, will be at full steam ahead after a 10-day break. Jones particularly should loom large against Vegas’ 26th ranked run defence. Bottom line: Josh McDaniels’ winning percentage of .333 (7-14) as the Raiders coach drops a little more as the Packers are victorious for the ninth straight time in games between the two teams. TAKING: GREEN BAY -1 SCORE (O/U 44.5): Packers 27, Raiders 20","pubDate":"2023-10-06 03:12:39","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1006stroud-scaled-e1696561933732.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"215f65f696dc8eba38f2fea15c5b15be","title":"WATCH: Alarcon back in action with superb solo goal","link":"https://www.barcablaugranes.com/2023/10/6/23905432/watch-angel-alarcon-offers-barcelona-timely-reminder-of-his-talents-with-solo-goal","keywords":null,"creator":["Barca Blaugranes Staff"],"video_url":null,"description":null,"content":"Angel Alarcon is back from injury and back in the goals too. The Barcelona youngster scored in a 2-0 win for the club in a Youth League win over Porto in midweek. The 19-year-old’s strike may well have made Xavi sit up and take notice too. Alarcon picked up possession in his own half before racing through on goal and finishing neatly. ¡QUÉ GOLAZO DE COSTA A COSTA DE ÁNGEL ALARCÓN (2004)! #UYL pic.twitter.com/TLWzYPBy9F — Football Report (@FootballReprt) October 4, 2023 Alarcon is back after several months out with injury but his return looks to be well-timed with Barcelona having lost Robert Lewandowski to injury. The striker has suffered a sprained ankle , but there are already fears he could miss around a month of action for Xavi’s side . Barca are also without Raphinha due to injury right now, leaving Xavi a little short of options in attack currently. Xavi does still have Ferran Tores, Joao Felix and Lamine Yamal available, but it seems that Alarcon could also be an option if needed.","pubDate":"2023-10-06 03:00:00","image_url":null,"source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"92e543de14ec42139744a5cea4c4aec7","title":"Ukraine demands FIFA, UEFA review decision to allow Russians to compete","link":"https://mb.com.ph/2023/10/6/ukraine-demands-fifa-uefa-review-decision-to-allow-russians-to-compete","keywords":null,"creator":null,"video_url":null,"description":"Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions.","content":"Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions. PARIS (AFP) -- Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions. World football's governing body FIFA on Wednesday, Oct. 4, lifted its suspension on Russia's under-17 teams, following in the footsteps of UEFA, and clearing the way for them to play at the World Cup. UEFA last week reinstated Russian youth teams to its competitions but maintained a ban on the country's senior sides due to the ongoing war in Ukraine. The decision is conditional on Russian teams playing under the name of the \"Football Union of Russia\", while the country's flag, anthem and national playing kit would not be allowed either, FIFA said. On Thursday, Ukraine's Ministry of Youth and Sports condemned \"the decisions of FIFA and UEFA to allow Russian citizens to participate in international competitions\". \"We call on FIFA and UEFA to stand up to the violence and aggression of the Russian federation,\" Ukraine's Sports Ministry said in a statement. \"We demand to review of the FIFA and UEFA decisions as infringing on the rights of Ukrainian children who have been deprived by Russia of the right to train safely and simply live in their homeland without the threat of being kidnapped, raped or killed. \"The occupying Russian regime continues to kill and kidnap Ukrainian children, destroying civilian infrastructure, including stadiums and sports schools, leaving Ukrainian children no opportunity to play sports or live a normal life. \"It has deprived hundreds of our children of their lives. \"At the same time, UEFA and FIFA are bringing back Russian children to compete, and they, through the fault of these organizations, will be convinced that their country has the right to kill others and is doing the right things.\" Russia was barred from all international football tournaments following its invasion of Ukraine in February 2022.","pubDate":"2023-10-06 02:51:22","image_url":"https://storage.googleapis.com/mb-mkt-neo-prod-1-uploads-2/media/FIFA_logo_28ca0b8f93/FIFA_logo_28ca0b8f93.jpg","source_id":"mb","source_priority":29418,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"b9fcc42102557fc3f6d3affc44a0e1a5","title":"Korea faces off with Japan in men's football final; female archers set for gold","link":"https://koreatimes.co.kr/www/nation/2023/10/829_360565.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea will meet its archrival Japan in the men's football final at the 19th Asian Games on Saturday, the last step toward the ultimate goal of the third straight gold medal.","content":"Korean players and coaches celebrate their 2-1 win over Uzbekistan in the men's football semifinals at the Asian Games at Huanglong Sports Centre Stadium in Hangzhou, China, Oct. 4. Yonhap Korea will meet its archrival Japan in the men's football final at the 19th Asian Games on Saturday, the last step toward the ultimate goal of the third straight gold medal. The gold medal match between Korea and Japan will take place at 8 p.m. at Huanglong Sports Centre Stadium in Hangzhou, China. It will be the final stage for the Korean football team to extend its winning streak to three. The country has topped the podium of men's football for two straight Asiads since 2014. Led by head coach Hwang Sun-hong, the players cruised to the gold medal match, scoring 25 goals in six matches, including the semifinal against Uzbekistan, and allowing two. Korea's baseball team is also seeking its fourth consecutive Asian Games title Saturday. If it wins against China in its second Super Round game Friday, Korea will take on Chinese Taipei in the final at Shaoxing Baseball and Softball Sports Centre in Shaoxing. Korean players celebrate their 2-0 victory after the teams' first Super Round game against Japan in the 19th Asian Games baseball tournament at Shaoxing Baseball and Softball Sports Centre in Shaoxing, China, Oct. 5. Yonhap Female archers will target multiple gold medals Saturday at Fuyang Yinhu Sports Centre Final Field in Hangzhou, with one already in hand. Koreans Lim Si-hyeon and An San will compete in women's individual recurve archery for gold in a fresh all-Korean final, while So Chae-won will have a duel with India's Jyothi Surekha Vennam in the women's individual compound final. In women's hockey, Korea will vie for the Asian Games crown with host China at Gongshu Canal Sports Park Stadium. It grabbed the final berth after a shootout victory over Japan in the semis. Korean breakdancers will also go for the gold medal at the Hangzhou Asian Games, where the sport of breaking is being competed for the first time as a medal program. Sport climber Seo Cha-hyun will compete in the semifinals and finals of the women's boulder and lead sport climbing competition Saturday to try to become the first female Korean to win the gold medal in the event. (Yonhap)","pubDate":"2023-10-06 02:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/026a6eb948da4b2985c86381b1f2ba25.jpg","source_id":"koreatimes","source_priority":35310,"country":["south korea"],"category":["sports"],"language":"english"},{"article_id":"4b29eb68b60ba339f183d46f0be86895","title":"Bears' DJ Moore makes fantasy owners happy after torching Commanders in first half","link":"https://www.foxnews.com/sports/bears-dj-moore-makes-fantasy-owners-happy-torching-commanders-first-half","keywords":null,"creator":null,"video_url":null,"description":"Chicago Bears top wide receiver D.J. Moore helped his winless team get off to a hot start against the Washington Commanders, collecting two touchdowns in just over 15 minutes.","content":"close Video Fox News Flash top sports headlines for October 4 Fox News Flash top sports headlines are here. Check out what's clicking on Foxnews.com. The Chicago Bears , winless in their last 14 games, came out firing against the Washington Commanders on Thursday night, and top wide receiver D.J. Moore was the key reason why the score was 27-3 at halftime. Bears quarterback Justin Fields had a career game last week against the Denver Broncos despite the loss, and he continued that momentum on the first drive of the game when he found Moore for a 58-yard bomb down the left sideline to Washington’s 16-yard line. Then, when it seemed the Bears were going to get stopped after a Fields sack forcing a 3rd-and-14, Fields threw an absolute dot to Moore in the back left of the end zone for a quick six points. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM D.J. Moore #2 of the Chicago Bears catches a touchdown pass during the second quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) But Moore wasn’t done making it hurt in the first quarter. The Bears quickly got the ball back after forcing a three-and-out on the Commanders , and the Fields-Moore combo was on full display yet again. To begin the drive, Moore ran a simple curl route where Fields put it right on his chest for a completion. It looked like the Commanders corner that was covering Moore was going to take him down the second he caught the ball. DICK BUTKUS, HALL OF FAMER AND LEGENDARY BEARS LINEBACKER, DEAD AT 80 However, the tackle was poor and Moore made Washington pay. He slipped the tackle and hit the jets down the right sideline for a 39-yard completion instead of the seven yards he was expected to get. That fired up the Bears who continued moving the ball down the field into Washington territory. On 3rd-and-6 on Washington’s 11, Fields trusted Moore once more, lofting a fade pass to the back of the end zone. Moore jumped up and snatched the ball out of the air for his second touchdown of the half in just over 15 minutes of play. D.J. Moore of the Chicago Bears, center, celebrates with teammates after scoring a touchdown during the first quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) Moore finished the half with five receptions for 137 yards with his two scores, making fantasy football owners very happy if he was in their starting lineups. But it wasn’t just Moore that led the Bears to outgain the Commanders, 307-84, in terms of yards in the first half. They rushed for 122 yards, with running back Khalil Herbert leading the way with 76 yards on nine carries. Of course, Fields had his fair share of rushes, gaining 27 yards on six tries. Also, Fields found Cole Kmet for a touchdown, as he had five catches for 42 yards with his score. The Bears are desperate for a win and are in prime position to finally snap that losing streak that spans to the 2022 season. D.J. Moore of the Chicago Bears runs after catching a pass during the first quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) CLICK HERE TO GET THE FOX NEWS APP Moore and the rest of the offense will do what it can in the second half to secure that victory. Scott Thompson is a sports writer for Fox News Digital.","pubDate":"2023-10-06 01:54:50","image_url":null,"source_id":"foxnews","source_priority":59,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b862ad69af6f28de643cb6e47f857445","title":"Nothing’s changed with VAR, says Gareth Southgate","link":"https://www.basingstokegazette.co.uk/sport/national/23837624.nothings-changed-var-says-gareth-southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The England boss says off-field decision-making process has not done anything to resolve controversial refereeing decisions.","content":"The off-field decision-making process has come under renewed fire this week after Liverpool were denied a fair goal in their defeat at Tottenham when VAR Darren England mistakenly thought the on-field decision was onside and inadvertently validated the linesman’s offside call, with play restarting before the mistake was noticed. There has been a huge fallout from the gaffe, with Reds boss Jurgen Klopp calling for the game to be replayed while the Professional Game Match Officials Limited (PGMOL) has announced a review into VAR and its practices. Southgate has always been against it and says nothing has changed from when on-field decisions were final. “Well, all I would say is everybody used to go to the pub and moan about the ref and they still go to the pub and moan about the ref,” he quipped. “So I’m not sure what we’ve resolved, really. I don’t like it, never have, so I have sort of dismissed it. “I just was always brought up as a kid that the referee’s decision was final. You might agree or disagree but we have to get on with it. “I didn’t ever feel we were going to resolve every issue. “I think we are probably too far down the line now to go back but I didn’t like it from the off. “Once you open up a technology opportunity, you are normally going that way and you have got to refine and improve on what happens. But yes, I don’t like it.” The PGMOL has taken unprecedented steps in recent times of retrospectively releasing audio of the decision-making process, including England’s expletive-filled mistake at the weekend. But fans in the stadium remain in the dark at the time, often left waiting for up to five minutes while decisions are scrutinised in Stockley Park. “When I am at games I am always conscious that the only people who don’t know what is going on are the people who have paid to go,” he said. “I find that really difficult. “I am sitting in the stadium next to people and I am lucky as I normally get a free ticket and other people pay a lot of money and haven’t got a clue or are on the phone to someone at home asking what’s going on. “The frustration, you can feel it in the stadium, you can feel the view. “I know if we didn’t have it people would go back to, ‘well this could be resolved’, but when I am in the stadiums my sense is they don’t necessarily want 14 minutes of added time or a decision by something that they are not totally across the process of.” Meanwhile, Spurs boss Ange Postecoglou has said he does not know if he likes “where the game’s heading” in the wake of the VAR controversy. Speaking to the Sydney Morning Herald, prior to the audio emerging and Klopp’s suggestion of a replay, Postecoglou questioned the game’s pursuit of “perfection”. He told the paper: “It seems like we’re now heading towards that space of trying to find perfection in a game where the beauty of it is the imperfection. “What makes our game different from any other game is that the goal – the actual goal, the scoring of a goal – is that most precious commodity. It’s the flaws in the game that creates goals. “Sometimes we think it’s the brilliance – yeah, it is the brilliance, but mostly on the back of somebody’s flaw, either an opposition player or your own teammate or a referee. “We’re trying to make this perfect game, which the other codes do – but they have to, because goals in their game don’t mean anything, so they try and create this perfect product. And that’s not football. “Football is Maradona putting it (in with) his hand. I don’t like it, but that’s the game, and if you want to eliminate that? Yes, OK, but if you’re searching for perfection within football, I just think you take away from what the essence of it is.”","pubDate":"2023-10-06 01:50:54","image_url":"https://www.basingstokegazette.co.uk/resources/images/17302874/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"df742fa67d8bb49d0ebe725874fd8a56","title":"Dubai's Department of Economy and Tourism, Real Madrid announce landmark global partnership","link":"https://www.wam.ae/en/details/1395303206226","keywords":null,"creator":["Rola AlGhoul/ Esraa Esmail"],"video_url":null,"description":null,"content":"Fri 06-10-2023 08:49 AM DUBAI, 6th October, 2023 (WAM) -- Dubai's Department of Economy and Tourism, together with Real Madrid Club de Fútbol, have kicked off a landmark collaboration. The multi-year agreement promises a range of exciting activations, special fan moments and unique experiences for Dubai and Real Madrid fans. The newly formed alliance will equally serve as a powerhouse platform to create new growth opportunities for both institutions and support Dubai's ambitious plans as part of its recently announced Dubai Economic Agenda – D33. Being at the forefront of global sports entertainment with the world's greatest Club aligns perfectly with Dubai's ambitious plans to consolidate its position among the top three global cities. Launching this October, the partnership encompasses Real Madrid's First Men and Women Football Teams, bringing a taste of Dubai to Santiago Bernabéu offering fans unforgettable experiences and services. Issam Kazim, Chief Executive Officer of Dubai Corporation for Tourism and Commerce Marketing (DCTCM), and Florentino Perez, President of Real Madrid Club de Fútbol, formalised the partnership during an official ceremony at the legendary Sala de Juntas in Ciudad Real Madrid, in the presence of Jose Angel Sanchez, Chief Executive Officer of the Club, and Emilio Butragueño, Real Madrid legend and Director of Institutional Relations. Kazim commented, \"We are excited to begin our journey with Real Madrid as a global partner. This game-changing collaboration between Dubai and the greatest Club in the world is built upon a shared vision and values, where every achievement motivates one to pursue new heights. With our aim to consolidate Dubai's position among the top three global cities, this strategic alliance will harness the strengths of a leading destination and the world's most celebrated team to reaffirm Dubai globally as the best city to visit, live, and work in.\" Butragueño, in turn, said, \"We are very proud of this new partnership with Dubai's Department of Economy and Tourism as the Club's first Official Destination Partner. Dubai is a destination that strives for excellence in all its entertainment offerings, a value shared by the Club. We are delighted to bring this exciting tourist destination to our millions of Madridistas around the world.\" Dubai's strong public and private sector relations are at the heart of its success, and this new collaboration with Real Madrid further builds on a longstanding partnership that Emirates has cemented since 2011. It is also perfectly timed for the upcoming Real Madrid themed-park at Dubai Parks and Resorts, the largest theme park destination in the Middle East, which will further expand the city's diverse destination proposition. The park, which will be the world's first Real Madrid-themed park, will feature a number of Real Madrid-related attractions, such as a museum, amusement rides and football skill games, food and beverage outlets, and retail spaces selling official Real Madrid products.","pubDate":"2023-10-06 06:25:05","image_url":null,"source_id":"wam","source_priority":799259,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"article_id":"0128ab392d5b9f1a65d4d5c5c4f9bb60","title":"Punjab FC vs NorthEast United FC, ISL 2023-24 Live Streaming Online on JioCinema: Watch Telecast of PFC vs NEUFC Match in Indian Super League 10 on TV and Online","link":"https://www.latestly.com/sports/football/punjab-fc-vs-northeast-united-fc-isl-2023-24-live-streaming-online-on-jiocinema-watch-telecast-of-pfc-vs-neufc-match-in-indian-super-league-10-on-tv-and-online-5466637.html","keywords":null,"creator":null,"video_url":null,"description":"North East United had a poor campaign last season and they have a win and loss in their two games this term. They will be fancying themselves to come up with a good performance this evening. Punjab FC on the other hand, have lost both their matches so far. Read below to check out the live streaming and telecast details of the Punjab FC vs NorthEast United FC match.","content":"Newly promoted Punjab FC will be taking on North East United at home with an aim to secure their first win of the 2023-24 Indian Super League season. It has not been the best of starts by them with two straightforward losses against Mohun Bagan and Goa. While the defence did shore up a bit against the Gaurs in the last game, the attacking and midfield display was well below par which is a cause for worry. The team lacks the big game experience and it is evident with their display on the pitch. North East United had a poor campaign last season and they have a win and loss in their two games this term. They will be fancying themselves to come up with a good performance this evening. Punjab FC versus NorthEast United FC will be telecasted on the Sports18 network and streamed on the Jio Cinema app from 8:00 pm. ISL 2023-24 Points Table Updated Live. Nikhil Prabhu in defence looked lively against Goa and his partnership against Melroy Melwin Assisi will be crucial against North East. Luka Majcen and Juan Mera have not had much opportunity to score goals which is a concern. The duo will need their midfielder to try and dominate possession to create chances. Parthib Gogoi was the star of the show for North East United against Chennaiyin as he tormented the opposition backlines with his darting runs. He was rewarded with a goal while fellow attacking player Konsam Phalguni Singh was also on the scoresheet. The team has quality players going forward and when they click, the team does score a few. Indian international Manvir Singh is expected to keep his place on the flanks. ISL 2023–24 Schedule Announced . When Is Punjab FC vs NorthEast United FC, ISL 2023-24, Football Match Schedule (Know Date, Time and Venue) Punjab FC will face NorthEast United FC in the Indian Super League 2023-24 on Friday, October 6. The PFC vs NEUFC ISL match will be played at the Jawaharlal Nehru Stadium in New Delhi and it starts at 8:00 pm IST (Indian Standard Time). Where To Watch Punjab FC vs NorthEast United FC, ISL 2023-24 Football Telecast On TV? Viacom18 Network have the broadcasting rights for the Indian Super League in India. Fans can tune into VH1, Sports18 1 SD/HD (English Commentary), Sports18 Khel (Hindi Commentary, Surya Movies (Malayalam Commentary), Colours Bangla Cinema (Bangla Commentary for MBSG and EBFC only) channels to watch live telecast of the Punjab FC vs NorthEast United FC match. For live streaming details, scroll down. How To Watch Punjab FC vs NorthEast United FC, ISL 2023-24 Football Live Streaming Online? JioCinema, the official OTT platform of Viacom18 Network, will live stream the Punjab FC vs NorthEast United FC, ISL 2023-24 match on online platforms. Fans can tune into the JioCinema app and website to catch the action live. One Football will provide live streaming of the match Internationally. NorthEast United should win this game although it may not be a high-scoring encounter. (The above story first appeared on LatestLY on Oct 06, 2023 11:41 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-10-06 06:11:23","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"bf709676a6fe3f31033180b28afdb7fc","title":"Ross County's women and girls aiming for the top","link":"https://www.ross-shirejournal.co.uk/sport/ross-countys-women-and-girls-aiming-for-the-top-328760/","keywords":null,"creator":null,"video_url":null,"description":"The Staggies&#39; women&#39;s and girls&#39; section has grown rapidly in recent years, and those involved see no reason why they can&#39;t aim for the highest level.","content":"Women's football at Ross County will take a significant step forward next year with the introduction of two new senior teams. A development team will , while the first team will take part in Scottish Women's Football's performance pathway, joining the regional SWFL leagues. This is a step that has been a long time coming. Starting off as Invergordon Girls, the club joined forces with Ross County in 2019, and have since grown beyond anyone's wildest expectations. Now, it is not uncommon to see more than 100 girls attending training. The current oldest age group side, the under-16s, have also already played other senior teams and competed well. That has only fuelled confidence of what can be achieved by the Staggies – and quickly, if expectations are met. \"We want to take the club as far as we possibly can,\" head coach Iain MacIver explained. \"In the first year we enter that North League, a lot of people would probably look at it as a development year but we'll be looking to go up if possible. \"We've played the team that are currently sitting top a few weeks ago, and we did pretty well, so we'll be looking to do pretty well and get into the national leagues. \"I think all the players there have the ambition to go as far as they can – ideally with us, but they want to forge a career in football. \"A few years ago that wouldn't really have been a possibility for girls from here. Even going back a couple of decades in Scotland, it wouldn't have been physically possible, but now, they have ambitions and see professional players on TV so it's something for them to aspire to.\" Those ambitions come through clearly by talking to the players themselves. Sisters Kiera and Teagan Syrjanen both play for the club's under-16s, and have been part of the squads that took on senior teams elsewhere. The Dingwall Academy pupils are in no doubt about where they want to go in football, and the impact that establishing senior teams at Ross County could have on their chances of being successful. Kiera said: \"It's just good for girls' football in general. Obviously men's football is huge, so I hope women's football keeps growing too. \"I want to play for Scotland or a high-end team in England. Maybe Rangers as well. \"We're playing friendlies against teams more well-known than us, which will make us well-known, and we've matched their standards so it shows that in the future we can be just as big. \"We're obviously starting a women's team, so we're building that pathway up to the top which wasn't always there. It's good for the club to have somewhere to go after you've finished with the under-16s.\" Teagan explained: \"We think about it for when we're older. \"One of my main goals is to play for Scotland, but I think I'd also like to play for Chelsea or a team in England, and I think that is realistic, because we're playing a few top teams already and have performed very well. \"When we first joined, we didn't really know what the future would look like for us, but now we know more and can see the pathway there. \"If new girls join, they know there's that pathway there and it's not just one team and then that's the end of it.\" One of the things that will help Staggies talents reach those heights is greater integration between the women's club and the men's academy and senior side. With plans in place for the new senior women's teams in 2024, that connection has recently taken a big step forward as County's head of professional academy Gary Warren has started to get involved in training sessions. Even on first impressions, he has been very impressed – and with a young daughter Warren has every reason to take a vested interest in the fortunes of the women's side of the club. \"My main role now is to oversee a programme that will unite the girls and the boys together,\" Warren said. \"I've just recently had my first coaching session with the girls, and it was really good and really enjoyable. There's some great talent, and that's not just at one particular level – that's across the age groups. \"There is so much out there to offer – not just in the local area but also in Stornoway and the islands – it would be silly not to develop a programme that will help these girls flourish. \"It's so important. You look at how the game has developed and the academies that have been created down south and oversees, and we're in a position where we can try and do that. \"We can nurture and develop these girls. They've got a great set-up – when I was out there over 120 girls showed up in one night, which is incredible. These coaches give up their own time to help out, so it's important that we help to maximise the opportunity for everyone to flourish. \"Before you would look at the women's game and a lot of people wouldn't think it was at the same level, but you look at how much it has changed and how much the quality has improved in terms of technical, tactical and physical, and the game has improved so much. \"I have a little girl myself, and she loves her football, so it's great for me to see the game develop and hopefully one day she can follow in the current players' footsteps. If she can emulate some of these players now, she'll have a good upbringing in football and a good understanding. \"You feel the excitement just by turning up and watching them train. When you do that, you see the standards and that makes you think 'wow, this could be something really special'. \"It's important that we really now work together as a club and as a group to join forces and develop the programme as much as we can.\" The commitment from the men's side of Ross County is absolute, and goes right to the top of the club. Chief executive officer Steven Ferguson was at pains to hail the work that MacIver and Glenda Scobbie have done with the women's side over recent years, and is looking forward to seeing how an even more integrated set-up will progress in the future. \"We recognise how important it is for girls and women in this area, and we also recognise the part that we have to play as the senior club,\" Ferguson added. \"We are ready to make sure that we are completely joined up, and give them the opportunity and the support that they deserve. \"When this got off the ground many years ago now, it was essentially a partnership in name only, but the plan was always to make sure that year by year we had something that was sustainable and growing organically. \"We weren't trying to force or demand anything, and it has grown to this stage where it needs more and more input and support from the football club to make sure it's fully integrated. \"The most important thing is that it's sustainable so that we have a Ross County women's team in 10 years' time, and we have the solid foundations in place. \"It's so important to us as a football club that everybody is catered to whatever their level, and I'm really looking forward to see the young girls developing into young women that will go on to compete at a national level and represent this area and club. It's really exciting. \"There is definitely a buzz around girls' and women's football. As a football club and as an area, we are no different. \"I see girls who have played on a Saturday morning, and both them and the team they have played are in the stadium watching a first team game in the afternoon. That's what gives me a buzz – the fact that it's completely integrated across the women's and men's game, and everybody is enjoying both parts of it, to make it that one club. \"That's my goal, to very much be catering for absolutely everybody and inclusive for everyone. That's really important to us as a football club, and it's really exciting to think about the distance that we've come over the last four or five years – and we're only just scratching the surface. \"What we have in place are really solid foundations that will shape the next five years, and I think that's the bit that excites everybody.\"","pubDate":"2023-10-06 06:00:00","image_url":null,"source_id":"ross_shirejournal","source_priority":1094642,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"3aa82fdc02d28e8217aa3710d9a6f94b","title":"Daily Schmankerl: Chelsea in the mix for Bayern Munich’s Alphonso Davies; Bayern eyeing Valencia youngster; Liverpool duo headed to Saudi Arabia?; Chelsea looking Dušan Vlahović and Alvaro Morata; Frans Krätzig praised again; and MORE!","link":"https://www.bavarianfootballworks.com/2023/10/6/23904435/chelsea-bayern-munich-davies-valencia-guerra-liverpool-juventus-vlahovic-morata-kratzig-transfer-tel","keywords":null,"creator":["CSmith1919"],"video_url":null,"description":null,"content":"Davies rumors are persisting (Chelsea Chronicle) Rumors have been floating for a few months now that Alphonso Davies could be on the fast track out of Bayern Munich . With his contract negotiations at a standstill and his agent popping off intermittently about a potential move, Davies’ future in Germany is uncertain as ever. With Real Madrid already considered a prime contender to get Davies, Chelsea FC and Manchester City are also getting ready for the transfer competition: There’s been transfer rumours emerge this week involving both Chelsea and Bayern Munich’s Alphonso Davies, which is why it’s certainly worth looking back on previous comments from Ashley Cole. 90min claimed on Wednesday that Chelsea are being kept informed on Bayern left-back Alphonso Davies. The German heavyweights want their 22-year-old defender to sign a new contract with them, but he’s grabbing the attention of Chelsea, Real Madrid and Manchester City. Speaking in 2020 via The Mirror, Cole raved about Davies’ quality: “He’s so direct, he’s quick, he can go inside or outside. “I played against him in the MLS and, obviously, he couldn’t combine there with players of the quality Bayern have. Moving to Bayern was a big step, it was a huge risk going from somewhere he was comfortable to play with top stars, but he has just improved –his timing, his understanding, when to go in behind, when to drag people out of position. He has improved on his decision-making and, of course, his strength is his speed.” With clubs like Real Madrid, Manchester City, and Chelsea in the mix, Davies is going to have his choice of destinations should he want to go. Will it happen? The next few months will certainly give fans an indication of how things are progressing. The initial 90Min.com report also states the obvious — Bayern Munich wants to re-up its Canadian star, but it is unclear at this point how serious Davies is about leaving the club. Related With Real Madrid planning 2024 heist, Bayern Munich preps for talks with Alphonso Davies Alphonso Davies’ agent puts Bayern Munich on notice, says Real Madrid and Premier League clubs are interested (Update: Full quote) Salah, Thiago headed to Saudi league? (Fichajes via 90Min.com) It sure seems like Liverpool FC is heading for a changing of the guard next summer. Thiago Alcantara and Mo Salah are two of the big names who could move on: Liverpool duo Mohamed Salah and Thiago Alcantara are among the top targets for the Saudi Pro League next summer. Related What is going on with former Bayern Munich man Thiago at Liverpool? Bavarian Podcast Works: Weekend Warm-up Podcast Season 3, Episode 13 (Bavarian Football Works) As Bayern Munich heads into another international break, the Bavarians will face a stiff test from SC Freiburg, but also have the opportunity to quiet some of noise surrounding the team. Thomas Tuchel has the fanbase at each other’s throats and while the team is winning, things are not as pretty as most would like. There are transfer rumors and A LOT to talk about with the squad. So, let’s get to it! Here is what we have on tape for this episode: A preview of the Bayern Munich vs. SC Freiburg match where we take a look at the form of each team, the potential starting lineup for Bayern, and give a prediction on the match. Discussing the uneasy feeling that Bayern Munich’s wins are covering for a lot of flaws with the team. Bayern Munich is not getting the most out of Harry Kane...but why? Let’s talk about it. Leroy Sané, Serge Gnabry, Alphonso Davies, Matthijs de Ligt, and Joshua Kimmich are just some of the names that have already been linked with a transfer away for next summer. Asr these just baseless rumors or is there a brewing problem on the squad? Addressing those Jerome Boateng rumors. Related Bavarian Podcast Works: Weekend Warm-up Podcast Season 3, Episode 13 — A preview of Bayern Munich vs. SC Freiburg; Why Bayern’s wins don’t mean everything; Bayern’s recent transfer rumors; and MORE! Bayern eyeing Valencia youngster (Bild via @iMiaSanMia) Bayern Munich could be looking at another young midfielder — this time, Valencia’s Javi Guerra: Valencia midfielder Javi Guerra (20) is one of the players being watched by FC Bayern, although there’s nothing concrete at the moment. Guerra profiles mostly as a No. 8 per Transfermarkt and could be a relatively cheap acquisition should Bayern Munich opt to go into that direction. Related Bayern Munich looking to splash the cash in January as squad is reduced to bare bones Morata in the mix if Chelsea can’t get Juve star (CalciomercatoTV via 90Min.com) If Chelsea cann not get Juventus striker Dušan Vlahović, it will push to get Atlético Madrid striker Alvaro Morata: Chelsea are prepared to try and re-sign Atletico Madrid striker Alvaro Morata if they fail to convince Juventus to part ways with Dušan Vlahović. Related Report: If Harry Kane transfer sputters, Bayern Munich could shift quickly to Plan B — Juventus star Dušan Vlahović Bavarian Podcast Works — Postgame Show: FC Copenhagen 1-2 Bayern Munich (Bavarian Football Works) Bayern Munich once again came into a game completely unprepared and paid for it with a poor first half in which the team came to the dressing room behind on goals. Just like the last game however, Tuchel was bailed out by individual brilliance from the usual suspects. After a pair of games that made it look like Thomas Tuchel knew what he was doing, we have been treated to a pair of games that have made it look like Tuchel has never managed a game of football in his life. In this podcast, Rayyan goes over (rants about) the game and Bayern in detail. A look at the starting XIs for the game. The tactical decisions that Thomas Tuchel made. The lack of any direction or ‘game plan’ for Tuchel. A signature Cyler Meltdown™ over the state of Bayern. Related Bavarian Podcast Works: Postgame Show — FC Copenhagen 1-2 Bayern Munich (UEFA Champions League) Matthäus says Bayern can trust Krätzig (Tz via @iMiaSanMia) Lothar Matthäus has seen Bayern Munich’s depth issues, but he does think that Thomas Tuchel can trust youngster Frans Krätzig. “I saw him during pre-season in Asia, not just his goal against Liverpool back then. You can rely on some young players. You have to trust them, play them and talk to them. In the future, I would like to see young players integrated step by step,” Matthäus remarked. Krätzig has certainly impressed and brought a spark to each game that he has entered. However, with Bayern Munich looking to add depth in January, the Krätzig’s potential role in the second half of the season could decrease. Related Bayern Munich star Leon Goretzka lauds “clever” Frans Krätzig after Preußen Münster performance Surging Stuttgart star gets interest from Spurs, Hammers (TEAMtalk) VfB Stuttgart attacker Serhou Guirassy has gotten off to a red hot start for Die Schwaben and is now getting interest from Tottenham Hotspur and West Ham United: A host of Premier League clubs including Tottenham and West Ham have taken an interest in a Stuttgart striker who is currently outscoring Harry Kane in the Bundesliga. Serhou Guirassy is hitting the radar of Premier League clubs following his early season goal-blitz in Germany. The Stuttgart striker is one of the most in-form front men in Europe after a return of 10 goals from six Bundesliga outings. Related FC Barcelona’s Robert Lewandowski says Harry Kane was “good solution” for Bayern Munich, eager to see how it all plays out Bavarian Podcast Works — Flagship Show: Season 6, Episode 12 (Bavarian Football Works) Compared to last week, Bayern Munich really gave us a lot to talk about this time round. Unfortunately, not a lot of it is good news. A 2-2 draw to RB Leipzig marks the third consecutive game where Thomas Tuchel has failed to win versus Marco Rose and his cans. In the meanwhile, the bosses have suddenly begun and almost finalized talks with Jerome Boateng, which is causing a variety of reactions from the fanbase. Meanwhile, Max Eberl was sacked by RBL and he’s rumored to be on his way to Bayern, while there’s also a game against Copenhagen in the Champions League this week. In this episode, INNN and Cyler discuss the following: Why does Thomas Tuchel seem incapable of beating the better teams that he faces? Understanding why Tuchel dislikes giving certain players like Thomas Muller, Noussair Mazraoui, and Matthijs de Ligt playing time. The entire problem with Tuchel’s philosophy with the squad. An in-depth look at the controversy surrounding the Jerome Boateng transfer — why this move would be a complete travesty. Is Max Eberl the next board member at Bayern Munich? How might Christoph Freund and Eberl get along? A quick preview of the Champions League game versus Copenhagen and what we can expect. Related Bavarian Podcast Works S6E12: Why Jerome Boateng would be a disgusting signing for Bayern Munich + Why can’t Thomas Tuchel beat top teams? + Eberl updates + UCL preview","pubDate":"2023-10-06 04:00:00","image_url":null,"source_id":"bavarianfootballworks","source_priority":27959,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b3686054adb6754f41017ad75806507c","title":"NFL Week 5 Picks: Eagles suffer first loss, Vikings upset Chiefs, Niners beat Cowboys yet again","link":"https://torontosun.com/sports/football/nfl/nfl-week-5-picks-eagles-suffer-first-loss-vikings-upset-chiefs-niners-beat-cowboys-yet-again","keywords":["Football","NFL","Sports"],"creator":["Don Brennan"],"video_url":null,"description":"After winning 11 games over their last three seasons, the Texans appear headed in the right direction after destroying Jacksonville and Pittsburgh the last two weeks.","content":"HOUSTON TEXANS (2-2) at ATLANTA FALCONS (2-2) LINE: Atlanta by 1.5 CHEWABLE: After winning 11 games over their last three seasons, the Texans appear headed in the right direction after destroying Jacksonville and Pittsburgh the last two weeks. A lot of that is rookie C.J. Stroud, who currently sits fourth in passing yards with 1212, which is more than Justin Herbert, Patrick Mahomes, Josh Allen and Jalen Hurts. First-year head coach DeMeco Ryans also deserves credit, as the Texans have a banged-up offensive line that was missing four starters in last week’s 30-6 dominance of T.J. Watt, Alex Highsmith and the rest of the Steelers. Texans supposedly have a poor run defence, but they have not allowed any one player more than 88 rushing yards or any team more than 126 to date. Now they face a Falcons team whose offence is built around backs Bijan Robinson and Tyler Allgeier. While many think the injuries will catch up to the Texans, Pro Bowl LT Laremy Tunsil was back at practice Wednesday. The Falcons lose because of the QB matchup — Desmond Ridder is the worst starter in the league — and because this week they’re having to deal with jet lag from their trip to England. TAKING: HOUSTON +1.5 SCORE (O/U: 41.5): Texans 24, Falcons 17 CINCINNATI BENGALS (1-3) at ARIZONA CARDINALS (1-3) LINE: Cincinnati by 3 CHEWABLE: Does this not look like a mistake? Don’t you think the wrong side is being cast as the favourite? I had the Cardinals as the 32nd-best team in the league to start the season, but no longer. They’ve been in every game this season — except for their 35-16 loss to the Niners last week, but even that score is misleading as their back-to-back Zachs, Ertz and Pascal, dropped what would have been sure TD passes in the last minute — and they put a beating on the Cowboys. The Bengals’ three losses include both their road games to date, a 24-3 pounding by Cleveland in Week 1 and a 27-3 spanking in Tennessee last week, which I think means they’re being outscored 51-6 as visitors. And now they’re laying points in Arizona? Something you wouldn’t have thought possible — the quarterback matchup is heavily in favour of the Cards. Joshua Dobbs has a 4/0 touchdown to interception ratio, been sacked just four times and, in his worst outing, completed 67.7 percent of his passes. Joe Burrow shouldn’t be playing. The calf injury he brought with him into the season has prevented him from throwing downfield with any type of authority. He has two touchdown passes and two interceptions and has guided the Bengals offence into dead last place in total yards, with and average of 236 per game — or 101 yards per game behind Arizona, which is 12th. With the Bengals also now missing Tee Higgins, this could come down to a duel between Joe Mixon and James Conner, as the latter will be carrying the ball against the 31st-ranked run defence while the former will be weaving holes through an Arizona ‘D’ that sits 24th against the run. Bengals coach Zac Taylor is 8-2 ATS in the second of back-to-back road games, but that winning percentage will dip this week — because the wrong team is cast as the favourite. TAKING: ARIZONA +3 SCORE (O/U 44.5): Cardinals 23, Bengals 21 NEW YORK JETS (1-3) at DENVER BRONCOS (1-3) LINE: Denver by 1.5 CHEWABLE: It’s a showdown of the Wilsons at Empower Field at Mile High, where Zach will be coming off a game in which he finally gave the Jets hope that there is life after Aaron Rodgers (injury), and Russell was near perfect in leading the Broncos to a come-from-behind victory over the lowly Bears. Old Russ has faced a lineup of easy defences, while young Zach has gone up against four stout Ds, and now the tables get turned. If the Jets could force Patrick Mahomes into having a very un-Patrick Mahomes like night (18-of-30, 203 yards, two interceptions) what will they do to Russ? Quarterbacks aside, the tangible evidence on why to back the visitors: The Broncos have by far the worst run defence in the NFL, allowing an average of 176 ground yards per game. Jets running backs Breece Hall, Dalvin Cook and even Michael Carter have to be wringing their hands in anticipation. The intangible: When Broncos coach Sean Payton was a TV analyst he said of Nathaniel Hackett’s 15-game run as the Denver sideline boss, “(it) may be one of the worst coaching jobs in the history of the NFL. That’s how bad it was.” Hackett is now the Jets offensive coordinator. If he gets his players wanting to rub it in Payton’s face as much as he does, things could get out of control. TAKING: N.Y. JETS +1.5 SCORE (O/U 43): Jets 27, Broncos 10 JACKSONVILLE JAGUARS (2-2) vs. BUFFALO BILLS (3-1) (at London) LINE : Buffalo by 5.5 CHEWABLE: Never has there been a square-off between two such red-hot Josh Allens as this, where the one that’s an edge rusher for the Jaguars is coming off a three-sack game in a victory over the Falcons while the one who quarterbacks the Bills threw for four TDs and ran for one in a blowout beating of the Dolphins. Never has there been a game played in London where one team has been acclimatizing to the time change, sleep patterns, food, etc., for the better part of two weeks while its opponent is flying in a few days before the game for only its second ever visit to England. When Jaguars schooled the Falcons 23-7 at Wembley Stadium last Sunday it evened their franchise record in London at 5-5, a mark that includes a 34-31 victory over the Bills in 2015, the only other time Buffalo has played overseas … Do the Bills have the same type of letdown they’ve had in the past for games following meetings with Miami, when they are 12-37 ATS in the last 25 years? Probably not, because they’ll be pumped playing in another country. But their offence is about to have a bigger test against a defence that is much better than the one in Miami … The Bills are the best team in the AFC and, looking at the bigger picture, right up there with the Niners. In terms of total yards, they have the NFL’s sixth-ranked defence and sixth-ranked offence. Josh Allen, the quarterback, has yet to amass 100 yards rushing for the season, reaching as high as 46 in just one of the four games. With the Jags owning a strong pass rush, he should be on the move more in this one … After a uninspiring start, Jacksonville will build off the win against Atlanta, but Trevor Lawrence will find the Bills ‘D’ too tough to beat. TAKING: JACKSONVILLE +5.5 SCORE (O/U 48.5): Bills 24, Jaguars 20 CAROLINA PANTHERS (0-4) at DETROIT LIONS (3-1) LINE: Detroit by 10 CHEWABLE: The task of putting clamps on David Montgomery, Jahmyr Gibbs and the rest of the Lions ground attack is too much for the injury-riddled Panthers, who are among the worst in the league when it comes to stopping a running game. These toothless cats from Carolina will also have their hands full with Jared Goff, who is seventh in passing yardage, WR extraordinaire Amon-Ra St. Brown and rookie tight end Sam LaPorta, who seems to be good for one or three big catches per game. Detroit’s Aidan Hutchinson and Charles Harris will too much for the overmatched Carolina pass protectors, which means another tough outing for Bryce Young. If you’re laying the points you’re concerned about the possibility of a back-door cover, but you’re better off sticking with the surging home side. Lions are the second best Survivor Pool pick of the week, and when was the last time you’ve seen or heard those words? TAKING: DETROIT -10 SCORE (O/U 45): Lions 30, Panthers 17 TENNESSEE TITANS (2-2) at INDIANAPOLIS COLTS (2-2) LINE: Tennessee by 2.5 CHEWABLE: Titans are a funny team. They get crushed 27-3 by the Browns in Week 3 and destroy the Bengals 27-3 in Week 4. I have a good feeling about them this week, and at least part of it has to do with Derrick Henry finally getting untracked with his biggest day — just in time to set up a potential showdown with Jonathan Taylor. The Colts have a much better run defence than the Bengals, so Henry is facing a stiffer challenge. I also like that Mike Vrabel gets to game plan against a rookie QB for the first time this season. He better come up with a strong one, because Colts QB Anthony Richardson has shown he has a very good, albeit sometimes erratic arm, and the Titans secondary is below average. TAKING: TENNESSEE -2.5 SCORE (O/U 42.5): Titans 23, Colts 20 NEW YORK GIANTS (1-3) at MIAMI DOLPHINS (3-1) LINE: Miami by 11 CHEWABLE: Hate laying double digits, especially against a team that won a playoff game nine months ago and was expected to take a step forward from there. But along with squeaking by the Cardinals, the G-Men lost by 40 to the Cowboys, by 18 to the Niners and by 21 to the Seahawks, who also sacked quarterback Daniel Jones 11 times on Monday. This week they’re playing a Dolphins team, in Miami, that was being hailed for its greatness before it was pounded by the Bills. It’s also looking like they’ll again be without superstar left tackle Andrew Thomas and quite likely Saquon Barkley, who is not only their best offensive player but their only real threat. The Fish beat them 20-9 at Hard Rock Stadium the last time the teams met, Dec. 12, 2021, and the boys in blue won’t get that close this time. Miami, which is the No. 1 Survivor Pool pick of the week, not only redeems itself from the Buffalo beating but may actually score 70 again. TAKING: MIAMI -11 SCORE (O/U 49.5): Dolphins 37, Giants 14 NEW ORLEANS SAINTS (2-2) at NEW ENGLAND PATRIOTS (1-3) LINE: New England by 1 CHEWABLE: Two teams that failed to reach double digits on the scoreboard in lopsided and ugly defeats last week. With all their weapons, including the return of Alvin Kamara, the Saints managed just nine points, while being torched by Baker Mayfield, because Derek Carr clearly should have been resting his injured shoulder. The Patriots scored just three while giving up 38 in the most lopsided defeat of Bill Belichick’s career. Their normally solid defence was hurt by injuries to CB Christian Gonzalez and LB Matthew Judon, while Mac Jones simply fell on his face in giving Dallas a pair of defensive touchdowns. Sounds like Carr’s shoulder is still problematic, so I’m going to side with the Belichick squelching the whispers that he’s in danger of losing his job — at least for one week — and Jones responding positively to his third-quarter benching. TAKING: NEW ENGLAND -1 SCORE (O/U 40.0): Patriots 21, Saints 17 BALTIMORE RAVENS (3-1) at PITTSBURGH STEELERS (2-2) LINE: Baltimore by 4 CHEWABLE: Already without WR Diontae Johnson, the Steelers offence took a couple of big hits last week when QB Kenny Pickett suffered a muscle strain/bone bruise and TE Pat Freiermuth was sidelined by a hamstring injury. While Freiermuth was not practising as of Wednesday and will likely miss this one, Pickett wore a “bulky knee brace” but says he’ll be ready to go. If not, the Steelers would turn to Mitchell Trubisky, who is mobile and one of the better backups in the league. Coming off an embarrassing 30-6 loss, the Steelers are facing a division rival who just went into Cleveland and beat the Browns (and their backup QB) 28-3. Mike Tomlin, whose teams are 13-2 ATS after losing by 20+ points and 54-30 ATS as a dog, will have his team ready for the Ravens. Expect a huge day from a top-tier defence looking to atone for its mistakes against Houston, with the T.J. Watt-Lamar Jackson matchup must-see TV. Steelers have won five of the last six meetings and whichever way this one goes, getting more than three points with the home team is too good to pass up. TAKING: PITTSBURGH +4 SCORE (O/U: 37.5): Ravens 20, Steelers 17 PHILADELPHIA EAGLES (4-0) at LOS ANGELES RAMS (2-2) LINE: Philadelphia by 4.5 CHEWABLE: The Rams are anticipating the return of Cooper Kupp this week, if only in a limited capacity. A hamstring injury prevented Kupp from suiting up for more than nine games in 2022, but when he played a full season in 2021, he was the NFL’s best receiver. Having him back will cut down on the balls going to Puka Nacua, who leads the NFL with 39 receptions, but it could it also give the Rams the best 1-2 receiving punch in the league. The Eagles are undefeated but still giving their fans reason to squawk. With two new coordinators, they rank 10th in offence and 18th in defence, where they have also allowed nine TD passes, third most in the NFL. Rans quarterback Matthew Stafford is dealing with a hip injury, but he is expected to play, and I’m expecting he’ll have success working against struggling Philly cornerbacks James Bradberry and Darius Slay. TAKING: L.A. RAMS +4.5 SCORE (O/U 50.5): Rams 28, Eagles 24 KANSAS CITY CHIEFS (3-1) at MINNESOTA VIKINGS (1-3) LINE: Kansas City by 4 CHEWABLE: If you have paid attention to the Chiefs offence (and not focused on the next camera shot of Taylor Swift) as it works, you’ll notice something isn’t quite right. Patrick Mahomes himself has said “I just haven’t played very good.” This is a chance to fix that against a defence that is low on talent, and don’t be surprised if Mahomes has his biggest afternoon of the season. But don’t expect the Chiefs to run away and hide against Minnesota. The Vikings offence is good — their passing game ranks third behind the Dolphins and Rams — and even though the Chiefs defend aerial attacks well, the home team will put up some points. The difference might just be Isiah Pacheco, who commentators were comparing to Marshawn Lynch, as he attempts to build off a game against the Jets in which he averaged 5.8 yards per carry over 20 rushes. At the end of the day, Justin Jefferson posts his fourth game of more than 148 receiving yards, and Kirk Cousins enjoys the post-game handshakes a little more than his friend from the Netflix special Quarterbacks . TAKING: MINNESOTA +4 SCORE (O/U 53): Vikings 28, Chiefs 24 DALLAS COWBOYS (3-1) at SAN FRANCISCO 49ERS (4-0) LINE: San Francisco by 3.5 CHEWABLE: Imagine being Brock Purdy, after completing 20 of 21 passes for 283 yards in a 35-16 victory over a division rival to improve your career record (in games you’ve started and finished) to 9-0, and still winding up as a sidebar to the main story — Christian McCaffrey. After scoring four touchdowns last Sunday, the NFL’s best offensive player has seven scores on the season and at least one in 10 straight games. He also leads the league with 459 rushing yards and Sunday, against a Cowboys who can be exploited over the middle, is apt to have a huge receiving day. The Cowboys don’t have anything comparable — Tony Pollard will have a hard time finding room against a run defence that is holding opponents to 66 yards per game — but could get something done by throwing deep balls to CeeDee Lamb against Niners sometimes shaky corners. That’s providing Dak Prescott gets the time against Nick Bosa and friends, who should be able to take advantage of injuries along the Cowboys offensive line. Prescott wants to avenge last year’s 19-12 loss in the divisional playoffs in which he threw two picks and was outplayed by Purdy, but he won’t. Not this time. TAKING: SAN FRANCISCO -3.5 SCORE (O/U 45): Niners 23, Cowboys 17 GREEN BAY PACKERS (2-2) at LAS VEGAS RAIDERS (1-3) LINE: Green Bay by 1 CHEWABLE: Jimmy Garoppolo was practising while still in concussion protocol on Thursday, which means by Monday he should be ready to go and Aidan O’Connell return to the sidelines as a backup. Meanwhile, Packers RB Aaron Jones and WR Christian Watson, who were on snap-count limits when returning from injuries for last Thursday’s loss to the Lions, will be at full steam ahead after a 10-day break. Jones particularly should loom large against Vegas’ 26th ranked run defence. Bottom line: Josh McDaniels’ winning percentage of .333 (7-14) as the Raiders coach drops a little more as the Packers are victorious for the ninth straight time in games between the two teams. TAKING: GREEN BAY -1 SCORE (O/U 44.5): Packers 27, Raiders 20","pubDate":"2023-10-06 03:12:39","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1006stroud-scaled-e1696561933732.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"215f65f696dc8eba38f2fea15c5b15be","title":"WATCH: Alarcon back in action with superb solo goal","link":"https://www.barcablaugranes.com/2023/10/6/23905432/watch-angel-alarcon-offers-barcelona-timely-reminder-of-his-talents-with-solo-goal","keywords":null,"creator":["Barca Blaugranes Staff"],"video_url":null,"description":null,"content":"Angel Alarcon is back from injury and back in the goals too. The Barcelona youngster scored in a 2-0 win for the club in a Youth League win over Porto in midweek. The 19-year-old’s strike may well have made Xavi sit up and take notice too. Alarcon picked up possession in his own half before racing through on goal and finishing neatly. ¡QUÉ GOLAZO DE COSTA A COSTA DE ÁNGEL ALARCÓN (2004)! #UYL pic.twitter.com/TLWzYPBy9F — Football Report (@FootballReprt) October 4, 2023 Alarcon is back after several months out with injury but his return looks to be well-timed with Barcelona having lost Robert Lewandowski to injury. The striker has suffered a sprained ankle , but there are already fears he could miss around a month of action for Xavi’s side . Barca are also without Raphinha due to injury right now, leaving Xavi a little short of options in attack currently. Xavi does still have Ferran Tores, Joao Felix and Lamine Yamal available, but it seems that Alarcon could also be an option if needed.","pubDate":"2023-10-06 03:00:00","image_url":null,"source_id":"barcablaugranes","source_priority":20780,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"92e543de14ec42139744a5cea4c4aec7","title":"Ukraine demands FIFA, UEFA review decision to allow Russians to compete","link":"https://mb.com.ph/2023/10/6/ukraine-demands-fifa-uefa-review-decision-to-allow-russians-to-compete","keywords":null,"creator":null,"video_url":null,"description":"Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions.","content":"Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions. PARIS (AFP) -- Ukraine on Thursday, Oct. 5, demanded that FIFA and UEFA review their decisions to allow Russian youth teams to compete in international competitions. World football's governing body FIFA on Wednesday, Oct. 4, lifted its suspension on Russia's under-17 teams, following in the footsteps of UEFA, and clearing the way for them to play at the World Cup. UEFA last week reinstated Russian youth teams to its competitions but maintained a ban on the country's senior sides due to the ongoing war in Ukraine. The decision is conditional on Russian teams playing under the name of the \"Football Union of Russia\", while the country's flag, anthem and national playing kit would not be allowed either, FIFA said. On Thursday, Ukraine's Ministry of Youth and Sports condemned \"the decisions of FIFA and UEFA to allow Russian citizens to participate in international competitions\". \"We call on FIFA and UEFA to stand up to the violence and aggression of the Russian federation,\" Ukraine's Sports Ministry said in a statement. \"We demand to review of the FIFA and UEFA decisions as infringing on the rights of Ukrainian children who have been deprived by Russia of the right to train safely and simply live in their homeland without the threat of being kidnapped, raped or killed. \"The occupying Russian regime continues to kill and kidnap Ukrainian children, destroying civilian infrastructure, including stadiums and sports schools, leaving Ukrainian children no opportunity to play sports or live a normal life. \"It has deprived hundreds of our children of their lives. \"At the same time, UEFA and FIFA are bringing back Russian children to compete, and they, through the fault of these organizations, will be convinced that their country has the right to kill others and is doing the right things.\" Russia was barred from all international football tournaments following its invasion of Ukraine in February 2022.","pubDate":"2023-10-06 02:51:22","image_url":"https://storage.googleapis.com/mb-mkt-neo-prod-1-uploads-2/media/FIFA_logo_28ca0b8f93/FIFA_logo_28ca0b8f93.jpg","source_id":"mb","source_priority":29418,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"b9fcc42102557fc3f6d3affc44a0e1a5","title":"Korea faces off with Japan in men's football final; female archers set for gold","link":"https://koreatimes.co.kr/www/nation/2023/10/829_360565.html?utm_source=fl","keywords":null,"creator":["webmaster@koreatimes.co.kr(KoreaTimes)"],"video_url":null,"description":"Korea will meet its archrival Japan in the men's football final at the 19th Asian Games on Saturday, the last step toward the ultimate goal of the third straight gold medal.","content":"Korean players and coaches celebrate their 2-1 win over Uzbekistan in the men's football semifinals at the Asian Games at Huanglong Sports Centre Stadium in Hangzhou, China, Oct. 4. Yonhap Korea will meet its archrival Japan in the men's football final at the 19th Asian Games on Saturday, the last step toward the ultimate goal of the third straight gold medal. The gold medal match between Korea and Japan will take place at 8 p.m. at Huanglong Sports Centre Stadium in Hangzhou, China. It will be the final stage for the Korean football team to extend its winning streak to three. The country has topped the podium of men's football for two straight Asiads since 2014. Led by head coach Hwang Sun-hong, the players cruised to the gold medal match, scoring 25 goals in six matches, including the semifinal against Uzbekistan, and allowing two. Korea's baseball team is also seeking its fourth consecutive Asian Games title Saturday. If it wins against China in its second Super Round game Friday, Korea will take on Chinese Taipei in the final at Shaoxing Baseball and Softball Sports Centre in Shaoxing. Korean players celebrate their 2-0 victory after the teams' first Super Round game against Japan in the 19th Asian Games baseball tournament at Shaoxing Baseball and Softball Sports Centre in Shaoxing, China, Oct. 5. Yonhap Female archers will target multiple gold medals Saturday at Fuyang Yinhu Sports Centre Final Field in Hangzhou, with one already in hand. Koreans Lim Si-hyeon and An San will compete in women's individual recurve archery for gold in a fresh all-Korean final, while So Chae-won will have a duel with India's Jyothi Surekha Vennam in the women's individual compound final. In women's hockey, Korea will vie for the Asian Games crown with host China at Gongshu Canal Sports Park Stadium. It grabbed the final berth after a shootout victory over Japan in the semis. Korean breakdancers will also go for the gold medal at the Hangzhou Asian Games, where the sport of breaking is being competed for the first time as a medal program. Sport climber Seo Cha-hyun will compete in the semifinals and finals of the women's boulder and lead sport climbing competition Saturday to try to become the first female Korean to win the gold medal in the event. (Yonhap)","pubDate":"2023-10-06 02:05:05","image_url":"http://img.koreatimes.co.kr/upload/thumbnailV2/026a6eb948da4b2985c86381b1f2ba25.jpg","source_id":"koreatimes","source_priority":35310,"country":["south korea"],"category":["sports"],"language":"english"},{"article_id":"4b29eb68b60ba339f183d46f0be86895","title":"Bears' DJ Moore makes fantasy owners happy after torching Commanders in first half","link":"https://www.foxnews.com/sports/bears-dj-moore-makes-fantasy-owners-happy-torching-commanders-first-half","keywords":null,"creator":null,"video_url":null,"description":"Chicago Bears top wide receiver D.J. Moore helped his winless team get off to a hot start against the Washington Commanders, collecting two touchdowns in just over 15 minutes.","content":"close Video Fox News Flash top sports headlines for October 4 Fox News Flash top sports headlines are here. Check out what's clicking on Foxnews.com. The Chicago Bears , winless in their last 14 games, came out firing against the Washington Commanders on Thursday night, and top wide receiver D.J. Moore was the key reason why the score was 27-3 at halftime. Bears quarterback Justin Fields had a career game last week against the Denver Broncos despite the loss, and he continued that momentum on the first drive of the game when he found Moore for a 58-yard bomb down the left sideline to Washington’s 16-yard line. Then, when it seemed the Bears were going to get stopped after a Fields sack forcing a 3rd-and-14, Fields threw an absolute dot to Moore in the back left of the end zone for a quick six points. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM D.J. Moore #2 of the Chicago Bears catches a touchdown pass during the second quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) But Moore wasn’t done making it hurt in the first quarter. The Bears quickly got the ball back after forcing a three-and-out on the Commanders , and the Fields-Moore combo was on full display yet again. To begin the drive, Moore ran a simple curl route where Fields put it right on his chest for a completion. It looked like the Commanders corner that was covering Moore was going to take him down the second he caught the ball. DICK BUTKUS, HALL OF FAMER AND LEGENDARY BEARS LINEBACKER, DEAD AT 80 However, the tackle was poor and Moore made Washington pay. He slipped the tackle and hit the jets down the right sideline for a 39-yard completion instead of the seven yards he was expected to get. That fired up the Bears who continued moving the ball down the field into Washington territory. On 3rd-and-6 on Washington’s 11, Fields trusted Moore once more, lofting a fade pass to the back of the end zone. Moore jumped up and snatched the ball out of the air for his second touchdown of the half in just over 15 minutes of play. D.J. Moore of the Chicago Bears, center, celebrates with teammates after scoring a touchdown during the first quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) Moore finished the half with five receptions for 137 yards with his two scores, making fantasy football owners very happy if he was in their starting lineups. But it wasn’t just Moore that led the Bears to outgain the Commanders, 307-84, in terms of yards in the first half. They rushed for 122 yards, with running back Khalil Herbert leading the way with 76 yards on nine carries. Of course, Fields had his fair share of rushes, gaining 27 yards on six tries. Also, Fields found Cole Kmet for a touchdown, as he had five catches for 42 yards with his score. The Bears are desperate for a win and are in prime position to finally snap that losing streak that spans to the 2022 season. D.J. Moore of the Chicago Bears runs after catching a pass during the first quarter against the Washington Commanders at FedExField in Landover, Maryland, on October 5, 2023. (Greg Fiume/Getty Images) CLICK HERE TO GET THE FOX NEWS APP Moore and the rest of the offense will do what it can in the second half to secure that victory. Scott Thompson is a sports writer for Fox News Digital.","pubDate":"2023-10-06 01:54:50","image_url":null,"source_id":"foxnews","source_priority":59,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"b862ad69af6f28de643cb6e47f857445","title":"Nothing’s changed with VAR, says Gareth Southgate","link":"https://www.basingstokegazette.co.uk/sport/national/23837624.nothings-changed-var-says-gareth-southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The England boss says off-field decision-making process has not done anything to resolve controversial refereeing decisions.","content":"The off-field decision-making process has come under renewed fire this week after Liverpool were denied a fair goal in their defeat at Tottenham when VAR Darren England mistakenly thought the on-field decision was onside and inadvertently validated the linesman’s offside call, with play restarting before the mistake was noticed. There has been a huge fallout from the gaffe, with Reds boss Jurgen Klopp calling for the game to be replayed while the Professional Game Match Officials Limited (PGMOL) has announced a review into VAR and its practices. Southgate has always been against it and says nothing has changed from when on-field decisions were final. “Well, all I would say is everybody used to go to the pub and moan about the ref and they still go to the pub and moan about the ref,” he quipped. “So I’m not sure what we’ve resolved, really. I don’t like it, never have, so I have sort of dismissed it. “I just was always brought up as a kid that the referee’s decision was final. You might agree or disagree but we have to get on with it. “I didn’t ever feel we were going to resolve every issue. “I think we are probably too far down the line now to go back but I didn’t like it from the off. “Once you open up a technology opportunity, you are normally going that way and you have got to refine and improve on what happens. But yes, I don’t like it.” The PGMOL has taken unprecedented steps in recent times of retrospectively releasing audio of the decision-making process, including England’s expletive-filled mistake at the weekend. But fans in the stadium remain in the dark at the time, often left waiting for up to five minutes while decisions are scrutinised in Stockley Park. “When I am at games I am always conscious that the only people who don’t know what is going on are the people who have paid to go,” he said. “I find that really difficult. “I am sitting in the stadium next to people and I am lucky as I normally get a free ticket and other people pay a lot of money and haven’t got a clue or are on the phone to someone at home asking what’s going on. “The frustration, you can feel it in the stadium, you can feel the view. “I know if we didn’t have it people would go back to, ‘well this could be resolved’, but when I am in the stadiums my sense is they don’t necessarily want 14 minutes of added time or a decision by something that they are not totally across the process of.” Meanwhile, Spurs boss Ange Postecoglou has said he does not know if he likes “where the game’s heading” in the wake of the VAR controversy. Speaking to the Sydney Morning Herald, prior to the audio emerging and Klopp’s suggestion of a replay, Postecoglou questioned the game’s pursuit of “perfection”. He told the paper: “It seems like we’re now heading towards that space of trying to find perfection in a game where the beauty of it is the imperfection. “What makes our game different from any other game is that the goal – the actual goal, the scoring of a goal – is that most precious commodity. It’s the flaws in the game that creates goals. “Sometimes we think it’s the brilliance – yeah, it is the brilliance, but mostly on the back of somebody’s flaw, either an opposition player or your own teammate or a referee. “We’re trying to make this perfect game, which the other codes do – but they have to, because goals in their game don’t mean anything, so they try and create this perfect product. And that’s not football. “Football is Maradona putting it (in with) his hand. I don’t like it, but that’s the game, and if you want to eliminate that? Yes, OK, but if you’re searching for perfection within football, I just think you take away from what the essence of it is.”","pubDate":"2023-10-06 01:50:54","image_url":"https://www.basingstokegazette.co.uk/resources/images/17302874/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"}]}