{"newsArray":[{"title":"Wesley wins U-14 ten-a-side Rugby Championship","link":"https://www.ft.lk/sports/Wesley-wins-U-14-ten-a-side-Rugby-Championship/23-748860","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Wesley College retained their All Island Under-14 ten-a-side championship when they outplayed Isipathana College 21/0 in the Cup final which was organised by Sri Lanka Schools Rugby Football Association (SSRFA) and worked off at the Royal Sports Complex yesterday. Wesley led 14/0 at the short breather. Jonathan Wijesinghe, Akesh Sadish and Mohamed Shibly scored the tries with Mohamed Sharafaan made the conversions. Wesley was led by Akesh Sadish coached by Thushara Bandara. Defending champions, Wesley College beat Antonians in the last year Cup final as well making this two in a row for the double Blues. Royal won the Plate while Prince of Wales won the Bowl while Sumangala Panadura walked away with the Shield win.","pubDate":"2023-05-28 22:14:24","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Everton 1-0 Bournemouth LIVE! Doucoure goal – Premier League result, match stream and latest updates today","link":"https://www.standard.co.uk/sport/football/everton-vs-bournemouth-live-stream-premier-league-2022-latest-score-result-watch-tv-team-news-b1084238.html","keywords":["Football","Sport"],"creator":["Dominic Booth"],"video_url":null,"description":"Everton 1-0 Bournemouth – as it unfolded","content":"1-0 – as it unfolded It was do or die Sean Dyche and Everton on the final day of the season as they took on AFC Bournemouth at Goodison Park knowing a win would seal their Premier League survival for another year. And that’s exactly what they got, with Abdoulaye Doucoure volleying home in the second half to clinch a narrow victory in front of a riotous home crowd. With Leeds losing 4-1 to Tottenham, they went down with a whimper. But with Leciester beating West Ham 2-1 at the King Power Stadium, it made for a nerve-wrecking with plenty of drama. Doucoure’s eye-catching goal will live long in the memory for Everton fans, with Dyche doing a superb job to save the Toffees after his mid-season arrival following Frank Lampard’s sacking. See how the game unfolded on LIVE blog below. Right that’s pretty much us done in terms of our live blog for today – and indeed for the 2022/23 Premier League season. The drama came at Goodison Park, with Abdoulaye Doucoure making himself an Everton hero with that stunning volley. It earned them three vital points against Bournemouth, with a pitch invasion at full-time showing the full extent of the relief among Toffees fans that they’ve earned Premier League survival for another year. Signing off. We’ll be back soon, for sure. And why not. It was a goal worthy of winning any game, not least a relegation decider. Some riotous scenes on the pitch at the end of this one, as fans spill out onto the pitch amid a cloud of blue smoke. Joy and relief are the overriding emotions right now. It’s all over and Everton are safe! A 1-0 win courtesy of Doucoure’s goal has sealed the Toffees’ survival for another season. Well done Sean Dyche. Leeds are down, having lost 4-1 to Tottenham. Another big delay here, with Everton players down. Leicester have won. Everton have to hold on. Doucoure has the chance to double the lead, and his own tally. He wins a corner, at least. 94 min: This stoppage time period is going just as Everton would have hoped... so far. Plenty of delays... But now Pickford is called into action! A very good save to keep out Vina’s fizzing volley. It’s becoming almost too much to take for the Everton fans, as Solanke is flagged offside to alleviate some pressure. It’s 10 minutes! (Six at Leicester, by the way)","pubDate":"2023-05-28 20:58:36","image_url":"https://static.standard.co.uk/2023/05/28/18/GettyImages-1258248520.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Leicester 2-1 West Ham LIVE! Premier League result, match stream, latest reaction and updates today","link":"https://www.standard.co.uk/sport/football/leicester-vs-west-ham-live-stream-premier-league-2023-latest-score-result-watch-tv-team-news-b1084240.html","keywords":["Football","Sport"],"creator":["Matt Verri and Malik Ouzia"],"video_url":null,"description":"Leicester vs West Ham - LIVE!","content":"vs - LIVE! Leicester’s relegation to the Championship was confirmed despite a 2-1 victory over West Ham. The Foxes went into their match at the King Power needing a favour from Bournemouth, who travelled to face an Everton side that knew they would stay up should they secure victory over the Cherries. At half-time on the final day of the season, Leicester were on course to survive after Harvey Barnes gave them the lead, while Everton were being held to a goalless draw at Goodison Park. That changed after the break though, as Abdoulaye Doucoure fired Everton in front, and it meant Wout Faes’ header to double Leicester’s advantage meant very little, and Pablo Fornals’ finish to pull one back even less, as the Foxes dropped into the second tier after nine years in the top-flight, and seven years on from their stunning Premier League title success. Thank you for joining Standard Sport’s LIVE coverage of West Ham’s loss to Leicester. Find our report, ratings, reaction and analysis below! David Moyes has challenged Declan Rice to seize his “big moment” as he bids to end his West Ham career with Europa Conference League glory in Prague next month. Rice played what is likely to prove his penultimate game for the club in Sunday’s 2-1 defeat at Leicester at the King Power Stadium. The scarf sellers here at the King Power Stadium did not miss a trick, posting up near the away entrance having ordered in some extra stock from the Europa Conference League final collection. Shrewd business sense had clearly told them that West Ham thoughts and focus have been on Prague and next month’s showpiece against Fiorentina ever since the semi-final win over AZ Alkmaar a week-and-a-half ago. On the final day of this marathon Premier League season it showed, as the Hammers were beaten 2-1 by a Leicester side playing with the contrasting incentive of avoiding relegation, though Everton’s victory at home to Bournemouth rendered the result here irrelevant, a club that won this division only seven years ago on their way out of it anyway. Leicester’s relegation to the Championship was confirmed despite a 2-1 victory over West Ham. The Foxes went into their match at the King Power needing a favour from Bournemouth, who travelled to face an Everton side that knew they would stay up should they secure victory over the Cherries. At half-time on the final day of the Premier League season, Leicester were on course to survive after Harvey Barnes gave them the lead, while Everton were being held to a goalless draw at Goodison Park. That changed after the break though, as Abdoulaye Doucoure fired Everton in front, and it meant Wout Faes’ header to double Leicester’s advantage meant very little, and Pablo Fornals’ finish to pull one back even less, as the Foxes dropped into the second tier after nine years in the top-flight, and seven years on from their stunning Premier League title success. Scuffed wide when taking effort on early, but continued his good recent run with late consolation. Missed two best chances of the first half, shooting straight at Iverson and then lifting over. That is now confirmed. Everton have held on against Bournemouth, and it means Leicester and Leeds are the two sides to join Southampton in dropping down to the Championship. Huge disappointment for the Foxes - seven years on from their stunning title win. And that is that at the King Power. A couple of minutes to go at Goodison Park, still time for Bournemouth. But as it stands, Leicester are going down. Leicester sitting right back, West Ham passing the ball around without any real threat. Fornals slides the pass through to Emerson, who has a shot charged down. Rice swings the ball into the box, Faes heads it out. West Ham fans continue to remind Leicester that they’re going down. Sure that’s much appreciated. Not a huge amount of urgency from the visitors to try and get something from this match. Six minutes added on. Moyes not impressed. There is some positive news for Leicester... ten minutes to play at Goodison Park! Still time for Bournemouth.","pubDate":"2023-05-28 20:50:31","image_url":"https://static.standard.co.uk/2023/05/28/18/newFile-10.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sean Connor: Sorry Arsène Wenger, but I don’t agree!","link":"https://www.derryjournal.com/sport/football/sean-connor-sorry-arsene-wenger-but-i-dont-agree-4161146","keywords":["Football","Sport"],"creator":["Sean Connor"],"video_url":null,"description":"​There is a video doing the rounds on social media this past w eek or so of Arsène Wenger. In it he talks about development being carried out in stages.","content":"​Now maybe he simplified his message for expediency, but he stated that skill and technical development should be first, then followed by the physical development and finally tactical. I did not agree with was the fact that Arsène stated that if a player has not developed fully technically by 14, he will not become an elite player. Why do I not agree, well it’s simple. Yes skill and technical development must be focussed on from day one in a player’s journey, but it does not stop at 14, or any other specific age in an athlete’s developmental pathway. Skill acquisition and technical development must be continuously worked on and adapted always, it takes time and hard work and planning by both coach and player, here’s why! Having observed a lot of underage coaching over these past five years or so, I have come to the belief that the majority of coaches working at this’ elite level’ are still coaching and preparing their players around the physical requirement of the game, because it’s easier and requires less thinking. For me, coaching skills should be at the very heart of player development, especially in the formative years. Mr Wenger I agree. Ask any coach or player and they will tell you skill development is essence of any sport. It’s why we love Messi, Federer, or Jonny Sexton, we love their high levels of skill, and how they execute these skills consistently and within a highly competitive environment. How many of those coaching at the top youth level actually focusses on skill development? How many players have engaged with a coach in their formative years who assisted in their skill development? I bet the answer is very few and here is a reason why. Two weeks ago, I watched an U12 boys football game, where one of the coaches was so intent on winning the game, he made minimal substitutions, leaving a number of players with no game time. Once his side got in front, and only after the opposition had made eight changes, he then openly encouraged his players to kick the ball out of play, to time waste. It was embarrassing. This coach was ego driven and only concerned with winning, from the way he celebrated after the game, this was obvious. He had zero interest in letting players express themselves or actually try something in the game. In other words have fun. I fear for the players who spend any length of time with this type of coach. What is skill? well, here is a definition I use; ‘it’s the ability to solve a sporting problem with a specific technique consistently well at speed, under pressure and under fatigue in a competitive environment’. How can we coach it and do we need it to be coached technically text book perfect? But, if you want to win in the real world, it is more than just coaching the text book skill. Your players must be able to execute in performance and pressure situations, they must understand when and where to use the skill. So, how can we do this? The answer is we can create the environment within our sessions to allow players to try and fail again and again as they develop their technique or skill. We begin with skill work in isolation, at the very beginning, but quickly we must work towards performance practice. The first step in this process is to begin and learn the skill. The next stage is mastery of the skill, this comes with regular practice and feedback and can include video analysis and personal reflection. Now, this is where the development stops with a lot of coaches, they think they have done their job. Wrong, you have only scratched the surface and in no way have you equipped your player for a performance environment. The player must be able to perform the skill at speed and consistently, technical perfection at slow speed maybe pleasant on the eye, but if the skill cannot hold up under competitive conditions and with agility, accelerations and explosivity, it’s not game ready. How many coaches work on skill development at this level, or are they purely focussed on winning. Because the work done at this stage still carries a level of error, re-adaption and fine tuning. The next stage once we have perfected our skill at match tempo, is the ability to perform under fatigue. It’s a swimmer holding his technique together in the last 10 metres of a 200-metre race, or a player in the last five minutes of a match. Most games at an elite level come down to moments, inches and being able to perform skills while dehydrated or in glycogen depletion and muscular fatigue. Are we done yet, no! Now you have to prepare your players to perform the skill at speed, under fatigue and under stress, and this is a coaching issue. You can incorporate the element of pressure by making your sessions more demanding and as challenging as any competitive environment your players will perform in. The next stage is taking the skill execution to a high level of consistency. For this to occur you have to adapt a ‘no-compromise’ attitude to skill execution in training, set high standards and look for them to be met. Some players will struggle with these demands, but the very best embrace and devour them. Most athletes have two brains, their ‘training brain’ and the ‘competition brain’. The secret here is getting your players training with the competition mindset. That’s down to you as a coach, you set the climate for your sessions, you set and accept the standards. If you are willing to work through this process then you will have developed players capable of performing skills at high speed, under fatigue, under pressure consistently and in competition conditions. This process begins with the players’ coach at the start of their development journey, allowing them to make mistakes, to adjust and adapt as they perfect their skills. But it does not stop at 14 or any age, in my opinion it should never stop.","pubDate":"2023-05-28 20:41:58","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjBlZmNkNzYyLTdkYjQtNDNkMy05NTg2LTY1N2UwZWIxMTNlZDoxNWI0NDU0Ni00YWJkLTRiYmYtOTczOC0wYTYzMDVhNjY0NjY=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Defender Shane McEleney feels poor start cost Derry City","link":"https://www.derryjournal.com/sport/football/defender-shane-mceleney-feels-poor-start-cost-derry-city-4161232","keywords":["Football","Sport"],"creator":["Kevin McLaughlin"],"video_url":null,"description":"Centre-back Shane McEleney admitted he couldn’t put his finger on why Derry City never really got going, as they suffered their fourth defeat of the season at an out of sorts Sligo Rovers, on Saturday night.","content":"Will Fitzgerald’s deflected early strike was enough for the Bit O’Red to secure North West bragging rights at the Showgrounds and McEleney conceded that Derry’s poor start is what in the end cost them, as the ten men deservedly held on for the win. “It was a disappointing evening and I think we started the game poorly,” he insisted. “I don’t remember ever having an easy game down here, it’s always been a humdinger, it’s a North West derby and I think our start has cost us. “I know Sligo started the game well and we were on the back foot. They got a goal, yes there might have been a bit of luck involved, but I think the overall picture, the start has cost us in the end. “They got a man sent-off and we didn’t capitalise on it, but it just wasn’t our night for a number of reasons. We just didn’t get going and I don’t know if we were a wee bit naive, I honestly can’t put my finger on it. “We were on a really good run for a while but we’ve had a set-back against a team, where we should have been coming down here smelling blood, because they haven’t been on a great run themselves. “Look it’s a set-back for us but I think we’ve showed resilience every time we’ve had a set-back, we’ve went back on a good run.”","pubDate":"2023-05-28 20:40:40","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjJlYmQxN2Q0LTIzMzktNDU5My05MmI2LWQ1N2NkZGExZmZhNzo4MGE2NzFjNi1jMjQyLTQyYmItOTQ5Mi0wNjI0YTIxYzFmYjE=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Chelsea send Premier League relegation jibe to old rivals Leeds - ‘Life comes at you fast’","link":"https://www.standard.co.uk/sport/football/chelsea-fc-leeds-premier-league-2023-b1084288.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Two clubs historic rivals after battles in 1960s and 1970s","content":"fired a social media jibe at old rivals following their relegation from the on Sunday. Sam Allardyce’s side needed to beat Tottenham while hoping neither of Leicester or Everton picked up points on the final day of the season. The Yorkshire side to bring an end to their three-year stint in the top flight. While the last two seasons have seen Leeds battle relegation, they have produced some big results during their latest Premier League run. Not only did the iconic Marcelo Bielsa lead them to ninth in the first season following promotion, they beat the Blues in resounding fashion back in August. SPONSORED Then under the tutelage of Jesse Marsch, Leeds thrashed Thomas Tuchel’s side 3-0 at Elland Road little under a year ago. Such is the rivalry between the two clubs stemming in part from the gruesome 1970 FA Cup final, the Leeds official Twitter account posted a screenshot of their first two goals that day captioned: “Life comes at you fast.” In response to the post many months ago, the Chelsea admin fired back: “It certainly does.”","pubDate":"2023-05-28 20:34:02","image_url":"https://static.standard.co.uk/2023/05/28/21/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Premier League table 2022-23: Final standings and results as Everton stay up","link":"https://www.standard.co.uk/sport/football/premier-league-table-2022-2023-results-fixtures-standings-scores-matchday-38-b1083546.html","keywords":["Football","Sport"],"creator":["Standard Sport"],"video_url":null,"description":"The final day of the Premier League season is over with Everton surviving after a nervy win over Bournemouth.","content":"he final day of the season is over with surviving after a nervy win over . and will play in the Championship next season as relegation was confirmed by the Toffees’ three points regardless of the while . Spurs were ultimately unable to qualify for European football as beat Brighton to secure seventh place. had already lifted the Premier League trophy before a , with second-place . The best of the entertainment on the final day came at Southampton, where the bottom club came back from two goals down to lead Liverpool 4-2 before the ahead of finishing fifth in the . SPONSORED","pubDate":"2023-05-28 20:13:08","image_url":"https://static.standard.co.uk/2023/05/28/18/SEI158118114.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Derry Minors pip Monaghan to Ulster title after penalty drama in Athletic Grounds","link":"https://www.derryjournal.com/sport/gaa/derry-minors-pip-monaghan-to-ulster-title-after-penalty-drama-in-athletic-grounds-4161226","keywords":["GAA","Sport"],"creator":["Michael Wilson"],"video_url":null,"description":"Ulster Minor Football Championship Final","content":"Derry 1-15, Monaghan 3-09 WOW! Sometimes football reminds you it's brilliant. Bizarre, crazy, bonkers . . . but beautiful. Derry are the Ulster minor football champions for the third time in four years after one of the most memorable finals in history. It was a case of what the senior can do well, the minor can do better as Conall Higgins capped a brilliant individual display by firing home the winning spot-kick to see Derry crowned provincial champions via penalties for the second time this month! Monaghan can feel hard done by. They contributed fully to a wonderful spectacle but championship final days are for winners and this Derry squad are full of them. Keeper Jack McCloy did his best Odhran Lynch impression in the shootout, saving brilliantly from Matthew Carolan and Conor Jones after James Sargent, Deaglan McNamee and Johnny McGuckin had scored. It meant Higgins had the kick to win it and juts as he had when he shot Derry into the shoot out with a sublime extra-time free, the Magherafelt youngster was spot on! Derry were playing in a seventh minor final in nine years and few will have started quite as badly as this one. Key man Johnny McGuckin went down from the throw in and looked in bother but while Derry were scrambling to cover the gaps, Monaghan took full advantage. They'd already hit one wide when the Farney men successfully broke the kick-out to Luke McKenna who found Monaghan dangerman Tommy Mallen whose pace cut Derry's defence in half before his lovely low finish found the far corner of Jack McCloy's net for a three point lead with only one minute on the clock. The start made a sizeable Monaghan support even more raucous but if Derry were unsettled they didn't show it and set about dominating the remainder of the half. Indeed, the main Oak Leaf disappointment was that their interval advantage was only three points at 1-07 to 1-04. Mallen's goal was wiped out inside five minutes as Conall Higgins took centre stage with three successive frees as the Oak Leafers pressed up on the Farney kick-out and gave Monaghan all sorts of trouble on their restart. It forced Jamie Mooney to go long and when he did, he found Derry's twin towers of Tommy Rogers and James Sargent. It all added up to Derry dominance with Monaghan restricted to breakaways but the Farney men remained a real danger with the pace of Mallen from deep a concern. Luke McKenna edged the Farney men back in front at 1-1 to 0-3 on eight minutes but Derry responded again with the move of the match which picked the Monaghan defence apart and ended with Oisin Doherty playing in Johnny McGuckin to blast home Derry's opening goal. James Sargent struck a wonderful '45' seconds after Higgins had seen his pass to John Boyle glance of Mooney and bounce inches past an empty Monaghan net. That was added to by a first from play on 16 minutes from Higgins to put Derry in control at 1-5 to 1-01. Max McGinnity, the championship's top scorers coming into the final, grabbed a free on 19 minutes to break an 11 minute barren run for the Farney, with Tommy Rogers and Monaghan corner-back Ethan McCaffrey swapping scores for 1-06 to 1-03. And three points would be Derry's lead at the break when McGuckin cancelled out an effort by Conor Jones, but it barely told the story of an open half in which Derry could have had more goals. The second half exploded into controversy after the sides had exchanged early points. With Derry leading by three Jack McCloy's short kick was intercepted by Monaghan sub Sean Og McElwain who gleefully rolled the ball back into the empty net. the celebrations were cut short when referee Mark Loughran adjudged the ball hadn't left the keeper's 'D'. James Sargent fisted Derry further ahead but Monaghan's sense of injustice has fired the Farney and within seconds McElwain was rifling into the roof of Derry's net for 1-09 to 2-05. With one point between them all sense of shape and composure was shot as the game turned into a thrilling shoot-out. Both counties had goal chances, plenty of them with barely time for a breath as the final 20 minutes accelerated into crazy, brilliant madness of a match. Derry had worked a four point lead at 1-12 to 2-05 as we approached the final 10 minutes but just as it looked to be settling Conor Jones burst through the middle, lost grip of the ball but still managed to find the Derry net with a soccer style finish. A Ger Dillon free edged Derry two in front and that looked like that until a back card for the brilliant Johnny McGuckin, who had been dragged down himself numerous times, handed Monghan the initiative. It looked like the clock would beat Monaghan but just as they had against Tyrone, the Farney men dragged themselves to extra time with points from Max Maguire and Matthew Finn, his the final kick of regulation time. The opening period of extra time saw Derry manage McGuckin's black card superbly, Conall Higgins shooting them in front before Monaghan keeper Mooney stepped forward to draw the sides level once again with a superb 45m point. The second period was a role reversal, Tommy Mallen edging Monagh in front but when Derry need composure, Conall Higgins had ice in his veins to slot over a free with one minute left to force the penalty shoot out. The stage was set and Derry didn't disappoint. The Oak Leaf conveyor belt keeps on running!","pubDate":"2023-05-28 19:58:34","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjM1ZjM4ZGI0LWJkMjYtNGI4NS05ZGJhLTUzMTVmY2U3ODM1Mzo2Nzc0OTRjYy0wZDNhLTRlYmItYmVkMS05ODhhNzA5OGVkZWE=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Thrilling match-ups in Gujarati IDC semis","link":"https://www.fbcnews.com.fj/sports/football/thrilling-match-ups-in-gujarati-idc-semis/","keywords":["Football"],"creator":["Julia Vadei"],"video_url":null,"description":"The top four teams for the 68th Fiji Gujarati Sports Association IDC have been confirmed. The semi-finals will begin at 9am between Flying Arrows New Zealand and defending champion Lautoka. This is expected to be a thriller as Lautoka will be out for revenge after losing to Flying Arrows 2-0 yesterday. In the second semi-final, […]","content":"The top four teams for the 68th Fiji Gujarati Sports Association IDC have been confirmed. The semi-finals will begin at 9am between Flying Arrows New Zealand and defending champion Lautoka. This is expected to be a thriller as Lautoka will be out for revenge after losing to Flying Arrows 2-0 yesterday. In the second semi-final, Suva takes on Rewa at 10.15am. Matches will be held at Ratu Cakobau Park in Nausori.","pubDate":"2023-05-28 19:19:27","image_url":null,"source_id":"fbcnews","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Монзуль вилучила 4 гравців Дніпра-1 згідно з протоколом матчу","link":"https://champion.com.ua/football/2023/05/28/930460/monzul-vyluchyla-4-hravtsiv-dnipra-1-zhidno-z-protokolom-matchu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Згідно з протоколом матчу 29-го туру УПЛ Шахтар - Дніпро-1 (3:0) у гостей було 4 вилучення, а не 2, як було показано в трансляції.Про це повідомляє УПЛ.У Шахтаря були вилучені Єгор Назарина та Анатолій Трубін, у Дніпра-1 - Пеглов та Віталій Федорів (...","content":"#СК Дніпро-1 , #Шахтар Джерело - Tribuna.com . Згідно з протоколом матчу 29-го туру УПЛ Шахтар - Дніпро-1 (3:0) у гостей було 4 вилучення, а не 2, як було показано в трансляції. Про це повідомляє УПЛ. У Шахтаря були вилучені Єгор Назарина та Анатолій Трубін, у Дніпра-1 - Пеглов та Віталій Федорів (на лаві запасних), а також, як вказано у протоколі, Рональд Матарріта та Олексій Гуцуляк. У компенсований до другого тайму час футболісти обох команд почали бійку, після чого головна арбітриня Катерина Монзуль показала червоні картки її учасникам. Шахтар після цього матчу достроково став чемпіоном.","pubDate":"2023-05-28 18:40:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Wesley wins U-14 ten-a-side Rugby Championship","link":"https://www.ft.lk/sports/Wesley-wins-U-14-ten-a-side-Rugby-Championship/23-748860","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Wesley College retained their All Island Under-14 ten-a-side championship when they outplayed Isipathana College 21/0 in the Cup final which was organised by Sri Lanka Schools Rugby Football Association (SSRFA) and worked off at the Royal Sports Complex yesterday. Wesley led 14/0 at the short breather. Jonathan Wijesinghe, Akesh Sadish and Mohamed Shibly scored the tries with Mohamed Sharafaan made the conversions. Wesley was led by Akesh Sadish coached by Thushara Bandara. Defending champions, Wesley College beat Antonians in the last year Cup final as well making this two in a row for the double Blues. Royal won the Plate while Prince of Wales won the Bowl while Sumangala Panadura walked away with the Shield win.","pubDate":"2023-05-28 22:14:24","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Everton 1-0 Bournemouth LIVE! Doucoure goal – Premier League result, match stream and latest updates today","link":"https://www.standard.co.uk/sport/football/everton-vs-bournemouth-live-stream-premier-league-2022-latest-score-result-watch-tv-team-news-b1084238.html","keywords":["Football","Sport"],"creator":["Dominic Booth"],"video_url":null,"description":"Everton 1-0 Bournemouth – as it unfolded","content":"1-0 – as it unfolded It was do or die Sean Dyche and Everton on the final day of the season as they took on AFC Bournemouth at Goodison Park knowing a win would seal their Premier League survival for another year. And that’s exactly what they got, with Abdoulaye Doucoure volleying home in the second half to clinch a narrow victory in front of a riotous home crowd. With Leeds losing 4-1 to Tottenham, they went down with a whimper. But with Leciester beating West Ham 2-1 at the King Power Stadium, it made for a nerve-wrecking with plenty of drama. Doucoure’s eye-catching goal will live long in the memory for Everton fans, with Dyche doing a superb job to save the Toffees after his mid-season arrival following Frank Lampard’s sacking. See how the game unfolded on LIVE blog below. Right that’s pretty much us done in terms of our live blog for today – and indeed for the 2022/23 Premier League season. The drama came at Goodison Park, with Abdoulaye Doucoure making himself an Everton hero with that stunning volley. It earned them three vital points against Bournemouth, with a pitch invasion at full-time showing the full extent of the relief among Toffees fans that they’ve earned Premier League survival for another year. Signing off. We’ll be back soon, for sure. And why not. It was a goal worthy of winning any game, not least a relegation decider. Some riotous scenes on the pitch at the end of this one, as fans spill out onto the pitch amid a cloud of blue smoke. Joy and relief are the overriding emotions right now. It’s all over and Everton are safe! A 1-0 win courtesy of Doucoure’s goal has sealed the Toffees’ survival for another season. Well done Sean Dyche. Leeds are down, having lost 4-1 to Tottenham. Another big delay here, with Everton players down. Leicester have won. Everton have to hold on. Doucoure has the chance to double the lead, and his own tally. He wins a corner, at least. 94 min: This stoppage time period is going just as Everton would have hoped... so far. Plenty of delays... But now Pickford is called into action! A very good save to keep out Vina’s fizzing volley. It’s becoming almost too much to take for the Everton fans, as Solanke is flagged offside to alleviate some pressure. It’s 10 minutes! (Six at Leicester, by the way)","pubDate":"2023-05-28 20:58:36","image_url":"https://static.standard.co.uk/2023/05/28/18/GettyImages-1258248520.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Leicester 2-1 West Ham LIVE! Premier League result, match stream, latest reaction and updates today","link":"https://www.standard.co.uk/sport/football/leicester-vs-west-ham-live-stream-premier-league-2023-latest-score-result-watch-tv-team-news-b1084240.html","keywords":["Football","Sport"],"creator":["Matt Verri and Malik Ouzia"],"video_url":null,"description":"Leicester vs West Ham - LIVE!","content":"vs - LIVE! Leicester’s relegation to the Championship was confirmed despite a 2-1 victory over West Ham. The Foxes went into their match at the King Power needing a favour from Bournemouth, who travelled to face an Everton side that knew they would stay up should they secure victory over the Cherries. At half-time on the final day of the season, Leicester were on course to survive after Harvey Barnes gave them the lead, while Everton were being held to a goalless draw at Goodison Park. That changed after the break though, as Abdoulaye Doucoure fired Everton in front, and it meant Wout Faes’ header to double Leicester’s advantage meant very little, and Pablo Fornals’ finish to pull one back even less, as the Foxes dropped into the second tier after nine years in the top-flight, and seven years on from their stunning Premier League title success. Thank you for joining Standard Sport’s LIVE coverage of West Ham’s loss to Leicester. Find our report, ratings, reaction and analysis below! David Moyes has challenged Declan Rice to seize his “big moment” as he bids to end his West Ham career with Europa Conference League glory in Prague next month. Rice played what is likely to prove his penultimate game for the club in Sunday’s 2-1 defeat at Leicester at the King Power Stadium. The scarf sellers here at the King Power Stadium did not miss a trick, posting up near the away entrance having ordered in some extra stock from the Europa Conference League final collection. Shrewd business sense had clearly told them that West Ham thoughts and focus have been on Prague and next month’s showpiece against Fiorentina ever since the semi-final win over AZ Alkmaar a week-and-a-half ago. On the final day of this marathon Premier League season it showed, as the Hammers were beaten 2-1 by a Leicester side playing with the contrasting incentive of avoiding relegation, though Everton’s victory at home to Bournemouth rendered the result here irrelevant, a club that won this division only seven years ago on their way out of it anyway. Leicester’s relegation to the Championship was confirmed despite a 2-1 victory over West Ham. The Foxes went into their match at the King Power needing a favour from Bournemouth, who travelled to face an Everton side that knew they would stay up should they secure victory over the Cherries. At half-time on the final day of the Premier League season, Leicester were on course to survive after Harvey Barnes gave them the lead, while Everton were being held to a goalless draw at Goodison Park. That changed after the break though, as Abdoulaye Doucoure fired Everton in front, and it meant Wout Faes’ header to double Leicester’s advantage meant very little, and Pablo Fornals’ finish to pull one back even less, as the Foxes dropped into the second tier after nine years in the top-flight, and seven years on from their stunning Premier League title success. Scuffed wide when taking effort on early, but continued his good recent run with late consolation. Missed two best chances of the first half, shooting straight at Iverson and then lifting over. That is now confirmed. Everton have held on against Bournemouth, and it means Leicester and Leeds are the two sides to join Southampton in dropping down to the Championship. Huge disappointment for the Foxes - seven years on from their stunning title win. And that is that at the King Power. A couple of minutes to go at Goodison Park, still time for Bournemouth. But as it stands, Leicester are going down. Leicester sitting right back, West Ham passing the ball around without any real threat. Fornals slides the pass through to Emerson, who has a shot charged down. Rice swings the ball into the box, Faes heads it out. West Ham fans continue to remind Leicester that they’re going down. Sure that’s much appreciated. Not a huge amount of urgency from the visitors to try and get something from this match. Six minutes added on. Moyes not impressed. There is some positive news for Leicester... ten minutes to play at Goodison Park! Still time for Bournemouth.","pubDate":"2023-05-28 20:50:31","image_url":"https://static.standard.co.uk/2023/05/28/18/newFile-10.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sean Connor: Sorry Arsène Wenger, but I don’t agree!","link":"https://www.derryjournal.com/sport/football/sean-connor-sorry-arsene-wenger-but-i-dont-agree-4161146","keywords":["Football","Sport"],"creator":["Sean Connor"],"video_url":null,"description":"​There is a video doing the rounds on social media this past w eek or so of Arsène Wenger. In it he talks about development being carried out in stages.","content":"​Now maybe he simplified his message for expediency, but he stated that skill and technical development should be first, then followed by the physical development and finally tactical. I did not agree with was the fact that Arsène stated that if a player has not developed fully technically by 14, he will not become an elite player. Why do I not agree, well it’s simple. Yes skill and technical development must be focussed on from day one in a player’s journey, but it does not stop at 14, or any other specific age in an athlete’s developmental pathway. Skill acquisition and technical development must be continuously worked on and adapted always, it takes time and hard work and planning by both coach and player, here’s why! Having observed a lot of underage coaching over these past five years or so, I have come to the belief that the majority of coaches working at this’ elite level’ are still coaching and preparing their players around the physical requirement of the game, because it’s easier and requires less thinking. For me, coaching skills should be at the very heart of player development, especially in the formative years. Mr Wenger I agree. Ask any coach or player and they will tell you skill development is essence of any sport. It’s why we love Messi, Federer, or Jonny Sexton, we love their high levels of skill, and how they execute these skills consistently and within a highly competitive environment. How many of those coaching at the top youth level actually focusses on skill development? How many players have engaged with a coach in their formative years who assisted in their skill development? I bet the answer is very few and here is a reason why. Two weeks ago, I watched an U12 boys football game, where one of the coaches was so intent on winning the game, he made minimal substitutions, leaving a number of players with no game time. Once his side got in front, and only after the opposition had made eight changes, he then openly encouraged his players to kick the ball out of play, to time waste. It was embarrassing. This coach was ego driven and only concerned with winning, from the way he celebrated after the game, this was obvious. He had zero interest in letting players express themselves or actually try something in the game. In other words have fun. I fear for the players who spend any length of time with this type of coach. What is skill? well, here is a definition I use; ‘it’s the ability to solve a sporting problem with a specific technique consistently well at speed, under pressure and under fatigue in a competitive environment’. How can we coach it and do we need it to be coached technically text book perfect? But, if you want to win in the real world, it is more than just coaching the text book skill. Your players must be able to execute in performance and pressure situations, they must understand when and where to use the skill. So, how can we do this? The answer is we can create the environment within our sessions to allow players to try and fail again and again as they develop their technique or skill. We begin with skill work in isolation, at the very beginning, but quickly we must work towards performance practice. The first step in this process is to begin and learn the skill. The next stage is mastery of the skill, this comes with regular practice and feedback and can include video analysis and personal reflection. Now, this is where the development stops with a lot of coaches, they think they have done their job. Wrong, you have only scratched the surface and in no way have you equipped your player for a performance environment. The player must be able to perform the skill at speed and consistently, technical perfection at slow speed maybe pleasant on the eye, but if the skill cannot hold up under competitive conditions and with agility, accelerations and explosivity, it’s not game ready. How many coaches work on skill development at this level, or are they purely focussed on winning. Because the work done at this stage still carries a level of error, re-adaption and fine tuning. The next stage once we have perfected our skill at match tempo, is the ability to perform under fatigue. It’s a swimmer holding his technique together in the last 10 metres of a 200-metre race, or a player in the last five minutes of a match. Most games at an elite level come down to moments, inches and being able to perform skills while dehydrated or in glycogen depletion and muscular fatigue. Are we done yet, no! Now you have to prepare your players to perform the skill at speed, under fatigue and under stress, and this is a coaching issue. You can incorporate the element of pressure by making your sessions more demanding and as challenging as any competitive environment your players will perform in. The next stage is taking the skill execution to a high level of consistency. For this to occur you have to adapt a ‘no-compromise’ attitude to skill execution in training, set high standards and look for them to be met. Some players will struggle with these demands, but the very best embrace and devour them. Most athletes have two brains, their ‘training brain’ and the ‘competition brain’. The secret here is getting your players training with the competition mindset. That’s down to you as a coach, you set the climate for your sessions, you set and accept the standards. If you are willing to work through this process then you will have developed players capable of performing skills at high speed, under fatigue, under pressure consistently and in competition conditions. This process begins with the players’ coach at the start of their development journey, allowing them to make mistakes, to adjust and adapt as they perfect their skills. But it does not stop at 14 or any age, in my opinion it should never stop.","pubDate":"2023-05-28 20:41:58","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjBlZmNkNzYyLTdkYjQtNDNkMy05NTg2LTY1N2UwZWIxMTNlZDoxNWI0NDU0Ni00YWJkLTRiYmYtOTczOC0wYTYzMDVhNjY0NjY=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Defender Shane McEleney feels poor start cost Derry City","link":"https://www.derryjournal.com/sport/football/defender-shane-mceleney-feels-poor-start-cost-derry-city-4161232","keywords":["Football","Sport"],"creator":["Kevin McLaughlin"],"video_url":null,"description":"Centre-back Shane McEleney admitted he couldn’t put his finger on why Derry City never really got going, as they suffered their fourth defeat of the season at an out of sorts Sligo Rovers, on Saturday night.","content":"Will Fitzgerald’s deflected early strike was enough for the Bit O’Red to secure North West bragging rights at the Showgrounds and McEleney conceded that Derry’s poor start is what in the end cost them, as the ten men deservedly held on for the win. “It was a disappointing evening and I think we started the game poorly,” he insisted. “I don’t remember ever having an easy game down here, it’s always been a humdinger, it’s a North West derby and I think our start has cost us. “I know Sligo started the game well and we were on the back foot. They got a goal, yes there might have been a bit of luck involved, but I think the overall picture, the start has cost us in the end. “They got a man sent-off and we didn’t capitalise on it, but it just wasn’t our night for a number of reasons. We just didn’t get going and I don’t know if we were a wee bit naive, I honestly can’t put my finger on it. “We were on a really good run for a while but we’ve had a set-back against a team, where we should have been coming down here smelling blood, because they haven’t been on a great run themselves. “Look it’s a set-back for us but I think we’ve showed resilience every time we’ve had a set-back, we’ve went back on a good run.”","pubDate":"2023-05-28 20:40:40","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjJlYmQxN2Q0LTIzMzktNDU5My05MmI2LWQ1N2NkZGExZmZhNzo4MGE2NzFjNi1jMjQyLTQyYmItOTQ5Mi0wNjI0YTIxYzFmYjE=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Chelsea send Premier League relegation jibe to old rivals Leeds - ‘Life comes at you fast’","link":"https://www.standard.co.uk/sport/football/chelsea-fc-leeds-premier-league-2023-b1084288.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Two clubs historic rivals after battles in 1960s and 1970s","content":"fired a social media jibe at old rivals following their relegation from the on Sunday. Sam Allardyce’s side needed to beat Tottenham while hoping neither of Leicester or Everton picked up points on the final day of the season. The Yorkshire side to bring an end to their three-year stint in the top flight. While the last two seasons have seen Leeds battle relegation, they have produced some big results during their latest Premier League run. Not only did the iconic Marcelo Bielsa lead them to ninth in the first season following promotion, they beat the Blues in resounding fashion back in August. SPONSORED Then under the tutelage of Jesse Marsch, Leeds thrashed Thomas Tuchel’s side 3-0 at Elland Road little under a year ago. Such is the rivalry between the two clubs stemming in part from the gruesome 1970 FA Cup final, the Leeds official Twitter account posted a screenshot of their first two goals that day captioned: “Life comes at you fast.” In response to the post many months ago, the Chelsea admin fired back: “It certainly does.”","pubDate":"2023-05-28 20:34:02","image_url":"https://static.standard.co.uk/2023/05/28/21/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Premier League table 2022-23: Final standings and results as Everton stay up","link":"https://www.standard.co.uk/sport/football/premier-league-table-2022-2023-results-fixtures-standings-scores-matchday-38-b1083546.html","keywords":["Football","Sport"],"creator":["Standard Sport"],"video_url":null,"description":"The final day of the Premier League season is over with Everton surviving after a nervy win over Bournemouth.","content":"he final day of the season is over with surviving after a nervy win over . and will play in the Championship next season as relegation was confirmed by the Toffees’ three points regardless of the while . Spurs were ultimately unable to qualify for European football as beat Brighton to secure seventh place. had already lifted the Premier League trophy before a , with second-place . The best of the entertainment on the final day came at Southampton, where the bottom club came back from two goals down to lead Liverpool 4-2 before the ahead of finishing fifth in the . SPONSORED","pubDate":"2023-05-28 20:13:08","image_url":"https://static.standard.co.uk/2023/05/28/18/SEI158118114.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Derry Minors pip Monaghan to Ulster title after penalty drama in Athletic Grounds","link":"https://www.derryjournal.com/sport/gaa/derry-minors-pip-monaghan-to-ulster-title-after-penalty-drama-in-athletic-grounds-4161226","keywords":["GAA","Sport"],"creator":["Michael Wilson"],"video_url":null,"description":"Ulster Minor Football Championship Final","content":"Derry 1-15, Monaghan 3-09 WOW! Sometimes football reminds you it's brilliant. Bizarre, crazy, bonkers . . . but beautiful. Derry are the Ulster minor football champions for the third time in four years after one of the most memorable finals in history. It was a case of what the senior can do well, the minor can do better as Conall Higgins capped a brilliant individual display by firing home the winning spot-kick to see Derry crowned provincial champions via penalties for the second time this month! Monaghan can feel hard done by. They contributed fully to a wonderful spectacle but championship final days are for winners and this Derry squad are full of them. Keeper Jack McCloy did his best Odhran Lynch impression in the shootout, saving brilliantly from Matthew Carolan and Conor Jones after James Sargent, Deaglan McNamee and Johnny McGuckin had scored. It meant Higgins had the kick to win it and juts as he had when he shot Derry into the shoot out with a sublime extra-time free, the Magherafelt youngster was spot on! Derry were playing in a seventh minor final in nine years and few will have started quite as badly as this one. Key man Johnny McGuckin went down from the throw in and looked in bother but while Derry were scrambling to cover the gaps, Monaghan took full advantage. They'd already hit one wide when the Farney men successfully broke the kick-out to Luke McKenna who found Monaghan dangerman Tommy Mallen whose pace cut Derry's defence in half before his lovely low finish found the far corner of Jack McCloy's net for a three point lead with only one minute on the clock. The start made a sizeable Monaghan support even more raucous but if Derry were unsettled they didn't show it and set about dominating the remainder of the half. Indeed, the main Oak Leaf disappointment was that their interval advantage was only three points at 1-07 to 1-04. Mallen's goal was wiped out inside five minutes as Conall Higgins took centre stage with three successive frees as the Oak Leafers pressed up on the Farney kick-out and gave Monaghan all sorts of trouble on their restart. It forced Jamie Mooney to go long and when he did, he found Derry's twin towers of Tommy Rogers and James Sargent. It all added up to Derry dominance with Monaghan restricted to breakaways but the Farney men remained a real danger with the pace of Mallen from deep a concern. Luke McKenna edged the Farney men back in front at 1-1 to 0-3 on eight minutes but Derry responded again with the move of the match which picked the Monaghan defence apart and ended with Oisin Doherty playing in Johnny McGuckin to blast home Derry's opening goal. James Sargent struck a wonderful '45' seconds after Higgins had seen his pass to John Boyle glance of Mooney and bounce inches past an empty Monaghan net. That was added to by a first from play on 16 minutes from Higgins to put Derry in control at 1-5 to 1-01. Max McGinnity, the championship's top scorers coming into the final, grabbed a free on 19 minutes to break an 11 minute barren run for the Farney, with Tommy Rogers and Monaghan corner-back Ethan McCaffrey swapping scores for 1-06 to 1-03. And three points would be Derry's lead at the break when McGuckin cancelled out an effort by Conor Jones, but it barely told the story of an open half in which Derry could have had more goals. The second half exploded into controversy after the sides had exchanged early points. With Derry leading by three Jack McCloy's short kick was intercepted by Monaghan sub Sean Og McElwain who gleefully rolled the ball back into the empty net. the celebrations were cut short when referee Mark Loughran adjudged the ball hadn't left the keeper's 'D'. James Sargent fisted Derry further ahead but Monaghan's sense of injustice has fired the Farney and within seconds McElwain was rifling into the roof of Derry's net for 1-09 to 2-05. With one point between them all sense of shape and composure was shot as the game turned into a thrilling shoot-out. Both counties had goal chances, plenty of them with barely time for a breath as the final 20 minutes accelerated into crazy, brilliant madness of a match. Derry had worked a four point lead at 1-12 to 2-05 as we approached the final 10 minutes but just as it looked to be settling Conor Jones burst through the middle, lost grip of the ball but still managed to find the Derry net with a soccer style finish. A Ger Dillon free edged Derry two in front and that looked like that until a back card for the brilliant Johnny McGuckin, who had been dragged down himself numerous times, handed Monghan the initiative. It looked like the clock would beat Monaghan but just as they had against Tyrone, the Farney men dragged themselves to extra time with points from Max Maguire and Matthew Finn, his the final kick of regulation time. The opening period of extra time saw Derry manage McGuckin's black card superbly, Conall Higgins shooting them in front before Monaghan keeper Mooney stepped forward to draw the sides level once again with a superb 45m point. The second period was a role reversal, Tommy Mallen edging Monagh in front but when Derry need composure, Conall Higgins had ice in his veins to slot over a free with one minute left to force the penalty shoot out. The stage was set and Derry didn't disappoint. The Oak Leaf conveyor belt keeps on running!","pubDate":"2023-05-28 19:58:34","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjM1ZjM4ZGI0LWJkMjYtNGI4NS05ZGJhLTUzMTVmY2U3ODM1Mzo2Nzc0OTRjYy0wZDNhLTRlYmItYmVkMS05ODhhNzA5OGVkZWE=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Thrilling match-ups in Gujarati IDC semis","link":"https://www.fbcnews.com.fj/sports/football/thrilling-match-ups-in-gujarati-idc-semis/","keywords":["Football"],"creator":["Julia Vadei"],"video_url":null,"description":"The top four teams for the 68th Fiji Gujarati Sports Association IDC have been confirmed. The semi-finals will begin at 9am between Flying Arrows New Zealand and defending champion Lautoka. This is expected to be a thriller as Lautoka will be out for revenge after losing to Flying Arrows 2-0 yesterday. In the second semi-final, […]","content":"The top four teams for the 68th Fiji Gujarati Sports Association IDC have been confirmed. The semi-finals will begin at 9am between Flying Arrows New Zealand and defending champion Lautoka. This is expected to be a thriller as Lautoka will be out for revenge after losing to Flying Arrows 2-0 yesterday. In the second semi-final, Suva takes on Rewa at 10.15am. Matches will be held at Ratu Cakobau Park in Nausori.","pubDate":"2023-05-28 19:19:27","image_url":null,"source_id":"fbcnews","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Монзуль вилучила 4 гравців Дніпра-1 згідно з протоколом матчу","link":"https://champion.com.ua/football/2023/05/28/930460/monzul-vyluchyla-4-hravtsiv-dnipra-1-zhidno-z-protokolom-matchu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Згідно з протоколом матчу 29-го туру УПЛ Шахтар - Дніпро-1 (3:0) у гостей було 4 вилучення, а не 2, як було показано в трансляції.Про це повідомляє УПЛ.У Шахтаря були вилучені Єгор Назарина та Анатолій Трубін, у Дніпра-1 - Пеглов та Віталій Федорів (...","content":"#СК Дніпро-1 , #Шахтар Джерело - Tribuna.com . Згідно з протоколом матчу 29-го туру УПЛ Шахтар - Дніпро-1 (3:0) у гостей було 4 вилучення, а не 2, як було показано в трансляції. Про це повідомляє УПЛ. У Шахтаря були вилучені Єгор Назарина та Анатолій Трубін, у Дніпра-1 - Пеглов та Віталій Федорів (на лаві запасних), а також, як вказано у протоколі, Рональд Матарріта та Олексій Гуцуляк. У компенсований до другого тайму час футболісти обох команд почали бійку, після чого головна арбітриня Катерина Монзуль показала червоні картки її учасникам. Шахтар після цього матчу достроково став чемпіоном.","pubDate":"2023-05-28 18:40:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"},{"title":"Wesley wins U-14 ten-a-side Rugby Championship","link":"https://www.ft.lk/sports/Wesley-wins-U-14-ten-a-side-Rugby-Championship/23-748860","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Wesley College retained their All Island Under-14 ten-a-side championship when they outplayed Isipathana College 21/0 in the Cup final which was organised by Sri Lanka Schools Rugby Football Association (SSRFA) and worked off at the Royal Sports Complex yesterday. Wesley led 14/0 at the short breather. Jonathan Wijesinghe, Akesh Sadish and Mohamed Shibly scored the tries with Mohamed Sharafaan made the conversions. Wesley was led by Akesh Sadish coached by Thushara Bandara. Defending champions, Wesley College beat Antonians in the last year Cup final as well making this two in a row for the double Blues. Royal won the Plate while Prince of Wales won the Bowl while Sumangala Panadura walked away with the Shield win.","pubDate":"2023-05-28 22:14:24","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Everton 1-0 Bournemouth LIVE! Doucoure goal – Premier League result, match stream and latest updates today","link":"https://www.standard.co.uk/sport/football/everton-vs-bournemouth-live-stream-premier-league-2022-latest-score-result-watch-tv-team-news-b1084238.html","keywords":["Football","Sport"],"creator":["Dominic Booth"],"video_url":null,"description":"Everton 1-0 Bournemouth – as it unfolded","content":"1-0 – as it unfolded It was do or die Sean Dyche and Everton on the final day of the season as they took on AFC Bournemouth at Goodison Park knowing a win would seal their Premier League survival for another year. And that’s exactly what they got, with Abdoulaye Doucoure volleying home in the second half to clinch a narrow victory in front of a riotous home crowd. With Leeds losing 4-1 to Tottenham, they went down with a whimper. But with Leciester beating West Ham 2-1 at the King Power Stadium, it made for a nerve-wrecking with plenty of drama. Doucoure’s eye-catching goal will live long in the memory for Everton fans, with Dyche doing a superb job to save the Toffees after his mid-season arrival following Frank Lampard’s sacking. See how the game unfolded on LIVE blog below. Right that’s pretty much us done in terms of our live blog for today – and indeed for the 2022/23 Premier League season. The drama came at Goodison Park, with Abdoulaye Doucoure making himself an Everton hero with that stunning volley. It earned them three vital points against Bournemouth, with a pitch invasion at full-time showing the full extent of the relief among Toffees fans that they’ve earned Premier League survival for another year. Signing off. We’ll be back soon, for sure. And why not. It was a goal worthy of winning any game, not least a relegation decider. Some riotous scenes on the pitch at the end of this one, as fans spill out onto the pitch amid a cloud of blue smoke. Joy and relief are the overriding emotions right now. It’s all over and Everton are safe! A 1-0 win courtesy of Doucoure’s goal has sealed the Toffees’ survival for another season. Well done Sean Dyche. Leeds are down, having lost 4-1 to Tottenham. Another big delay here, with Everton players down. Leicester have won. Everton have to hold on. Doucoure has the chance to double the lead, and his own tally. He wins a corner, at least. 94 min: This stoppage time period is going just as Everton would have hoped... so far. Plenty of delays... But now Pickford is called into action! A very good save to keep out Vina’s fizzing volley. It’s becoming almost too much to take for the Everton fans, as Solanke is flagged offside to alleviate some pressure. It’s 10 minutes! (Six at Leicester, by the way)","pubDate":"2023-05-28 20:58:36","image_url":"https://static.standard.co.uk/2023/05/28/18/GettyImages-1258248520.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Leicester 2-1 West Ham LIVE! Premier League result, match stream, latest reaction and updates today","link":"https://www.standard.co.uk/sport/football/leicester-vs-west-ham-live-stream-premier-league-2023-latest-score-result-watch-tv-team-news-b1084240.html","keywords":["Football","Sport"],"creator":["Matt Verri and Malik Ouzia"],"video_url":null,"description":"Leicester vs West Ham - LIVE!","content":"vs - LIVE! Leicester’s relegation to the Championship was confirmed despite a 2-1 victory over West Ham. The Foxes went into their match at the King Power needing a favour from Bournemouth, who travelled to face an Everton side that knew they would stay up should they secure victory over the Cherries. At half-time on the final day of the season, Leicester were on course to survive after Harvey Barnes gave them the lead, while Everton were being held to a goalless draw at Goodison Park. That changed after the break though, as Abdoulaye Doucoure fired Everton in front, and it meant Wout Faes’ header to double Leicester’s advantage meant very little, and Pablo Fornals’ finish to pull one back even less, as the Foxes dropped into the second tier after nine years in the top-flight, and seven years on from their stunning Premier League title success. Thank you for joining Standard Sport’s LIVE coverage of West Ham’s loss to Leicester. Find our report, ratings, reaction and analysis below! David Moyes has challenged Declan Rice to seize his “big moment” as he bids to end his West Ham career with Europa Conference League glory in Prague next month. Rice played what is likely to prove his penultimate game for the club in Sunday’s 2-1 defeat at Leicester at the King Power Stadium. The scarf sellers here at the King Power Stadium did not miss a trick, posting up near the away entrance having ordered in some extra stock from the Europa Conference League final collection. Shrewd business sense had clearly told them that West Ham thoughts and focus have been on Prague and next month’s showpiece against Fiorentina ever since the semi-final win over AZ Alkmaar a week-and-a-half ago. On the final day of this marathon Premier League season it showed, as the Hammers were beaten 2-1 by a Leicester side playing with the contrasting incentive of avoiding relegation, though Everton’s victory at home to Bournemouth rendered the result here irrelevant, a club that won this division only seven years ago on their way out of it anyway. Leicester’s relegation to the Championship was confirmed despite a 2-1 victory over West Ham. The Foxes went into their match at the King Power needing a favour from Bournemouth, who travelled to face an Everton side that knew they would stay up should they secure victory over the Cherries. At half-time on the final day of the Premier League season, Leicester were on course to survive after Harvey Barnes gave them the lead, while Everton were being held to a goalless draw at Goodison Park. That changed after the break though, as Abdoulaye Doucoure fired Everton in front, and it meant Wout Faes’ header to double Leicester’s advantage meant very little, and Pablo Fornals’ finish to pull one back even less, as the Foxes dropped into the second tier after nine years in the top-flight, and seven years on from their stunning Premier League title success. Scuffed wide when taking effort on early, but continued his good recent run with late consolation. Missed two best chances of the first half, shooting straight at Iverson and then lifting over. That is now confirmed. Everton have held on against Bournemouth, and it means Leicester and Leeds are the two sides to join Southampton in dropping down to the Championship. Huge disappointment for the Foxes - seven years on from their stunning title win. And that is that at the King Power. A couple of minutes to go at Goodison Park, still time for Bournemouth. But as it stands, Leicester are going down. Leicester sitting right back, West Ham passing the ball around without any real threat. Fornals slides the pass through to Emerson, who has a shot charged down. Rice swings the ball into the box, Faes heads it out. West Ham fans continue to remind Leicester that they’re going down. Sure that’s much appreciated. Not a huge amount of urgency from the visitors to try and get something from this match. Six minutes added on. Moyes not impressed. There is some positive news for Leicester... ten minutes to play at Goodison Park! Still time for Bournemouth.","pubDate":"2023-05-28 20:50:31","image_url":"https://static.standard.co.uk/2023/05/28/18/newFile-10.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Sean Connor: Sorry Arsène Wenger, but I don’t agree!","link":"https://www.derryjournal.com/sport/football/sean-connor-sorry-arsene-wenger-but-i-dont-agree-4161146","keywords":["Football","Sport"],"creator":["Sean Connor"],"video_url":null,"description":"​There is a video doing the rounds on social media this past w eek or so of Arsène Wenger. In it he talks about development being carried out in stages.","content":"​Now maybe he simplified his message for expediency, but he stated that skill and technical development should be first, then followed by the physical development and finally tactical. I did not agree with was the fact that Arsène stated that if a player has not developed fully technically by 14, he will not become an elite player. Why do I not agree, well it’s simple. Yes skill and technical development must be focussed on from day one in a player’s journey, but it does not stop at 14, or any other specific age in an athlete’s developmental pathway. Skill acquisition and technical development must be continuously worked on and adapted always, it takes time and hard work and planning by both coach and player, here’s why! Having observed a lot of underage coaching over these past five years or so, I have come to the belief that the majority of coaches working at this’ elite level’ are still coaching and preparing their players around the physical requirement of the game, because it’s easier and requires less thinking. For me, coaching skills should be at the very heart of player development, especially in the formative years. Mr Wenger I agree. Ask any coach or player and they will tell you skill development is essence of any sport. It’s why we love Messi, Federer, or Jonny Sexton, we love their high levels of skill, and how they execute these skills consistently and within a highly competitive environment. How many of those coaching at the top youth level actually focusses on skill development? How many players have engaged with a coach in their formative years who assisted in their skill development? I bet the answer is very few and here is a reason why. Two weeks ago, I watched an U12 boys football game, where one of the coaches was so intent on winning the game, he made minimal substitutions, leaving a number of players with no game time. Once his side got in front, and only after the opposition had made eight changes, he then openly encouraged his players to kick the ball out of play, to time waste. It was embarrassing. This coach was ego driven and only concerned with winning, from the way he celebrated after the game, this was obvious. He had zero interest in letting players express themselves or actually try something in the game. In other words have fun. I fear for the players who spend any length of time with this type of coach. What is skill? well, here is a definition I use; ‘it’s the ability to solve a sporting problem with a specific technique consistently well at speed, under pressure and under fatigue in a competitive environment’. How can we coach it and do we need it to be coached technically text book perfect? But, if you want to win in the real world, it is more than just coaching the text book skill. Your players must be able to execute in performance and pressure situations, they must understand when and where to use the skill. So, how can we do this? The answer is we can create the environment within our sessions to allow players to try and fail again and again as they develop their technique or skill. We begin with skill work in isolation, at the very beginning, but quickly we must work towards performance practice. The first step in this process is to begin and learn the skill. The next stage is mastery of the skill, this comes with regular practice and feedback and can include video analysis and personal reflection. Now, this is where the development stops with a lot of coaches, they think they have done their job. Wrong, you have only scratched the surface and in no way have you equipped your player for a performance environment. The player must be able to perform the skill at speed and consistently, technical perfection at slow speed maybe pleasant on the eye, but if the skill cannot hold up under competitive conditions and with agility, accelerations and explosivity, it’s not game ready. How many coaches work on skill development at this level, or are they purely focussed on winning. Because the work done at this stage still carries a level of error, re-adaption and fine tuning. The next stage once we have perfected our skill at match tempo, is the ability to perform under fatigue. It’s a swimmer holding his technique together in the last 10 metres of a 200-metre race, or a player in the last five minutes of a match. Most games at an elite level come down to moments, inches and being able to perform skills while dehydrated or in glycogen depletion and muscular fatigue. Are we done yet, no! Now you have to prepare your players to perform the skill at speed, under fatigue and under stress, and this is a coaching issue. You can incorporate the element of pressure by making your sessions more demanding and as challenging as any competitive environment your players will perform in. The next stage is taking the skill execution to a high level of consistency. For this to occur you have to adapt a ‘no-compromise’ attitude to skill execution in training, set high standards and look for them to be met. Some players will struggle with these demands, but the very best embrace and devour them. Most athletes have two brains, their ‘training brain’ and the ‘competition brain’. The secret here is getting your players training with the competition mindset. That’s down to you as a coach, you set the climate for your sessions, you set and accept the standards. If you are willing to work through this process then you will have developed players capable of performing skills at high speed, under fatigue, under pressure consistently and in competition conditions. This process begins with the players’ coach at the start of their development journey, allowing them to make mistakes, to adjust and adapt as they perfect their skills. But it does not stop at 14 or any age, in my opinion it should never stop.","pubDate":"2023-05-28 20:41:58","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjBlZmNkNzYyLTdkYjQtNDNkMy05NTg2LTY1N2UwZWIxMTNlZDoxNWI0NDU0Ni00YWJkLTRiYmYtOTczOC0wYTYzMDVhNjY0NjY=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Defender Shane McEleney feels poor start cost Derry City","link":"https://www.derryjournal.com/sport/football/defender-shane-mceleney-feels-poor-start-cost-derry-city-4161232","keywords":["Football","Sport"],"creator":["Kevin McLaughlin"],"video_url":null,"description":"Centre-back Shane McEleney admitted he couldn’t put his finger on why Derry City never really got going, as they suffered their fourth defeat of the season at an out of sorts Sligo Rovers, on Saturday night.","content":"Will Fitzgerald’s deflected early strike was enough for the Bit O’Red to secure North West bragging rights at the Showgrounds and McEleney conceded that Derry’s poor start is what in the end cost them, as the ten men deservedly held on for the win. “It was a disappointing evening and I think we started the game poorly,” he insisted. “I don’t remember ever having an easy game down here, it’s always been a humdinger, it’s a North West derby and I think our start has cost us. “I know Sligo started the game well and we were on the back foot. They got a goal, yes there might have been a bit of luck involved, but I think the overall picture, the start has cost us in the end. “They got a man sent-off and we didn’t capitalise on it, but it just wasn’t our night for a number of reasons. We just didn’t get going and I don’t know if we were a wee bit naive, I honestly can’t put my finger on it. “We were on a really good run for a while but we’ve had a set-back against a team, where we should have been coming down here smelling blood, because they haven’t been on a great run themselves. “Look it’s a set-back for us but I think we’ve showed resilience every time we’ve had a set-back, we’ve went back on a good run.”","pubDate":"2023-05-28 20:40:40","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjJlYmQxN2Q0LTIzMzktNDU5My05MmI2LWQ1N2NkZGExZmZhNzo4MGE2NzFjNi1jMjQyLTQyYmItOTQ5Mi0wNjI0YTIxYzFmYjE=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Chelsea send Premier League relegation jibe to old rivals Leeds - ‘Life comes at you fast’","link":"https://www.standard.co.uk/sport/football/chelsea-fc-leeds-premier-league-2023-b1084288.html","keywords":["Football","Sport"],"creator":["Jonathan Gorrie"],"video_url":null,"description":"Two clubs historic rivals after battles in 1960s and 1970s","content":"fired a social media jibe at old rivals following their relegation from the on Sunday. Sam Allardyce’s side needed to beat Tottenham while hoping neither of Leicester or Everton picked up points on the final day of the season. The Yorkshire side to bring an end to their three-year stint in the top flight. While the last two seasons have seen Leeds battle relegation, they have produced some big results during their latest Premier League run. Not only did the iconic Marcelo Bielsa lead them to ninth in the first season following promotion, they beat the Blues in resounding fashion back in August. SPONSORED Then under the tutelage of Jesse Marsch, Leeds thrashed Thomas Tuchel’s side 3-0 at Elland Road little under a year ago. Such is the rivalry between the two clubs stemming in part from the gruesome 1970 FA Cup final, the Leeds official Twitter account posted a screenshot of their first two goals that day captioned: “Life comes at you fast.” In response to the post many months ago, the Chelsea admin fired back: “It certainly does.”","pubDate":"2023-05-28 20:34:02","image_url":"https://static.standard.co.uk/2023/05/28/21/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Premier League table 2022-23: Final standings and results as Everton stay up","link":"https://www.standard.co.uk/sport/football/premier-league-table-2022-2023-results-fixtures-standings-scores-matchday-38-b1083546.html","keywords":["Football","Sport"],"creator":["Standard Sport"],"video_url":null,"description":"The final day of the Premier League season is over with Everton surviving after a nervy win over Bournemouth.","content":"he final day of the season is over with surviving after a nervy win over . and will play in the Championship next season as relegation was confirmed by the Toffees’ three points regardless of the while . Spurs were ultimately unable to qualify for European football as beat Brighton to secure seventh place. had already lifted the Premier League trophy before a , with second-place . The best of the entertainment on the final day came at Southampton, where the bottom club came back from two goals down to lead Liverpool 4-2 before the ahead of finishing fifth in the . SPONSORED","pubDate":"2023-05-28 20:13:08","image_url":"https://static.standard.co.uk/2023/05/28/18/SEI158118114.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Derry Minors pip Monaghan to Ulster title after penalty drama in Athletic Grounds","link":"https://www.derryjournal.com/sport/gaa/derry-minors-pip-monaghan-to-ulster-title-after-penalty-drama-in-athletic-grounds-4161226","keywords":["GAA","Sport"],"creator":["Michael Wilson"],"video_url":null,"description":"Ulster Minor Football Championship Final","content":"Derry 1-15, Monaghan 3-09 WOW! Sometimes football reminds you it's brilliant. Bizarre, crazy, bonkers . . . but beautiful. Derry are the Ulster minor football champions for the third time in four years after one of the most memorable finals in history. It was a case of what the senior can do well, the minor can do better as Conall Higgins capped a brilliant individual display by firing home the winning spot-kick to see Derry crowned provincial champions via penalties for the second time this month! Monaghan can feel hard done by. They contributed fully to a wonderful spectacle but championship final days are for winners and this Derry squad are full of them. Keeper Jack McCloy did his best Odhran Lynch impression in the shootout, saving brilliantly from Matthew Carolan and Conor Jones after James Sargent, Deaglan McNamee and Johnny McGuckin had scored. It meant Higgins had the kick to win it and juts as he had when he shot Derry into the shoot out with a sublime extra-time free, the Magherafelt youngster was spot on! Derry were playing in a seventh minor final in nine years and few will have started quite as badly as this one. Key man Johnny McGuckin went down from the throw in and looked in bother but while Derry were scrambling to cover the gaps, Monaghan took full advantage. They'd already hit one wide when the Farney men successfully broke the kick-out to Luke McKenna who found Monaghan dangerman Tommy Mallen whose pace cut Derry's defence in half before his lovely low finish found the far corner of Jack McCloy's net for a three point lead with only one minute on the clock. The start made a sizeable Monaghan support even more raucous but if Derry were unsettled they didn't show it and set about dominating the remainder of the half. Indeed, the main Oak Leaf disappointment was that their interval advantage was only three points at 1-07 to 1-04. Mallen's goal was wiped out inside five minutes as Conall Higgins took centre stage with three successive frees as the Oak Leafers pressed up on the Farney kick-out and gave Monaghan all sorts of trouble on their restart. It forced Jamie Mooney to go long and when he did, he found Derry's twin towers of Tommy Rogers and James Sargent. It all added up to Derry dominance with Monaghan restricted to breakaways but the Farney men remained a real danger with the pace of Mallen from deep a concern. Luke McKenna edged the Farney men back in front at 1-1 to 0-3 on eight minutes but Derry responded again with the move of the match which picked the Monaghan defence apart and ended with Oisin Doherty playing in Johnny McGuckin to blast home Derry's opening goal. James Sargent struck a wonderful '45' seconds after Higgins had seen his pass to John Boyle glance of Mooney and bounce inches past an empty Monaghan net. That was added to by a first from play on 16 minutes from Higgins to put Derry in control at 1-5 to 1-01. Max McGinnity, the championship's top scorers coming into the final, grabbed a free on 19 minutes to break an 11 minute barren run for the Farney, with Tommy Rogers and Monaghan corner-back Ethan McCaffrey swapping scores for 1-06 to 1-03. And three points would be Derry's lead at the break when McGuckin cancelled out an effort by Conor Jones, but it barely told the story of an open half in which Derry could have had more goals. The second half exploded into controversy after the sides had exchanged early points. With Derry leading by three Jack McCloy's short kick was intercepted by Monaghan sub Sean Og McElwain who gleefully rolled the ball back into the empty net. the celebrations were cut short when referee Mark Loughran adjudged the ball hadn't left the keeper's 'D'. James Sargent fisted Derry further ahead but Monaghan's sense of injustice has fired the Farney and within seconds McElwain was rifling into the roof of Derry's net for 1-09 to 2-05. With one point between them all sense of shape and composure was shot as the game turned into a thrilling shoot-out. Both counties had goal chances, plenty of them with barely time for a breath as the final 20 minutes accelerated into crazy, brilliant madness of a match. Derry had worked a four point lead at 1-12 to 2-05 as we approached the final 10 minutes but just as it looked to be settling Conor Jones burst through the middle, lost grip of the ball but still managed to find the Derry net with a soccer style finish. A Ger Dillon free edged Derry two in front and that looked like that until a back card for the brilliant Johnny McGuckin, who had been dragged down himself numerous times, handed Monghan the initiative. It looked like the clock would beat Monaghan but just as they had against Tyrone, the Farney men dragged themselves to extra time with points from Max Maguire and Matthew Finn, his the final kick of regulation time. The opening period of extra time saw Derry manage McGuckin's black card superbly, Conall Higgins shooting them in front before Monaghan keeper Mooney stepped forward to draw the sides level once again with a superb 45m point. The second period was a role reversal, Tommy Mallen edging Monagh in front but when Derry need composure, Conall Higgins had ice in his veins to slot over a free with one minute left to force the penalty shoot out. The stage was set and Derry didn't disappoint. The Oak Leaf conveyor belt keeps on running!","pubDate":"2023-05-28 19:58:34","image_url":"https://www.derryjournal.com/webimg/b25lY21zOjM1ZjM4ZGI0LWJkMjYtNGI4NS05ZGJhLTUzMTVmY2U3ODM1Mzo2Nzc0OTRjYy0wZDNhLTRlYmItYmVkMS05ODhhNzA5OGVkZWE=.jpg?width=1200&auto=webp","source_id":"derryjournal","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Thrilling match-ups in Gujarati IDC semis","link":"https://www.fbcnews.com.fj/sports/football/thrilling-match-ups-in-gujarati-idc-semis/","keywords":["Football"],"creator":["Julia Vadei"],"video_url":null,"description":"The top four teams for the 68th Fiji Gujarati Sports Association IDC have been confirmed. The semi-finals will begin at 9am between Flying Arrows New Zealand and defending champion Lautoka. This is expected to be a thriller as Lautoka will be out for revenge after losing to Flying Arrows 2-0 yesterday. In the second semi-final, […]","content":"The top four teams for the 68th Fiji Gujarati Sports Association IDC have been confirmed. The semi-finals will begin at 9am between Flying Arrows New Zealand and defending champion Lautoka. This is expected to be a thriller as Lautoka will be out for revenge after losing to Flying Arrows 2-0 yesterday. In the second semi-final, Suva takes on Rewa at 10.15am. Matches will be held at Ratu Cakobau Park in Nausori.","pubDate":"2023-05-28 19:19:27","image_url":null,"source_id":"fbcnews","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Монзуль вилучила 4 гравців Дніпра-1 згідно з протоколом матчу","link":"https://champion.com.ua/football/2023/05/28/930460/monzul-vyluchyla-4-hravtsiv-dnipra-1-zhidno-z-protokolom-matchu","keywords":["Футбол"],"creator":null,"video_url":null,"description":"Згідно з протоколом матчу 29-го туру УПЛ Шахтар - Дніпро-1 (3:0) у гостей було 4 вилучення, а не 2, як було показано в трансляції.Про це повідомляє УПЛ.У Шахтаря були вилучені Єгор Назарина та Анатолій Трубін, у Дніпра-1 - Пеглов та Віталій Федорів (...","content":"#СК Дніпро-1 , #Шахтар Джерело - Tribuna.com . Згідно з протоколом матчу 29-го туру УПЛ Шахтар - Дніпро-1 (3:0) у гостей було 4 вилучення, а не 2, як було показано в трансляції. Про це повідомляє УПЛ. У Шахтаря були вилучені Єгор Назарина та Анатолій Трубін, у Дніпра-1 - Пеглов та Віталій Федорів (на лаві запасних), а також, як вказано у протоколі, Рональд Матарріта та Олексій Гуцуляк. У компенсований до другого тайму час футболісти обох команд почали бійку, після чого головна арбітриня Катерина Монзуль показала червоні картки її учасникам. Шахтар після цього матчу достроково став чемпіоном.","pubDate":"2023-05-28 18:40:00","image_url":null,"source_id":"champion","category":["sports"],"country":["ukraine"],"language":"ukrainian"}]}