{"newsArray":[{"title":"Mercato : C’est confirmé, le PSG se dirige vers un échec","link":"https://le10sport.com/football/mercato/mercato-cest-confirme-le-psg-se-dirige-vers-un-echec-659635","keywords":null,"creator":null,"video_url":null,"description":"Alors que la fin du mercato estival se profile, le PSG espère encore se renforcer par le biais des signatures de deux joueurs offensifs : Randal Kolo Muani (Eintracht Francfort) et Bradley Barcola…","content":"Alors que la fin du mercato estival se profile, le PSG espère encore se renforcer par le biais des signatures de deux joueurs offensifs : Randal Kolo Muani (Eintracht Francfort) et Bradley Barcola (OL). Mais si Marco Verratti pourrait quitter le club parisien cet été, Paris pourrait se retrouverait fort dépourvu dans l’entrejeu, mais aurait déjà abandonné l’idée de recruter un milieu ces prochains jours. Les derniers jours du mercato estival pourrait être animés du côté du PSG . Alors qu’un accord a été conclu avec Randal Kolo Muani , la ligne offensive du club de la capitale s’annonce prometteuse. Mais quid du milieu de terrain ? Mercato : Le PSG mis au défi pour ce transfert à 100M€ https://t.co/jwhRJ4wfkS pic.twitter.com/cvor0SHd9i Secteur défaillant du PSG et ce depuis plusieurs années, l’entrejeu n’a pas été renforcé à l’excès cet été. Hormis l’Uruguayen Manuel Ugarte , aucune recrue parisienne évolue au milieu de terrain, et avec le possible départ de Marco Verratti , le PSG pourrait connaître quelques problèmes dans ce secteur. Selon les informations du Parisien , Luis Enrique envisagerait d’ores et déjà la possibilité de replacer Danilo ainsi que Kang-In-Lee dans son milieu de terrain. Mais alors que la priorité de cette fin de mercato semble se situer au niveau de l’attaque pour le PSG , RMC affirme désormais que le club de la capitale aurait totalement renoncé au recrutement d’un nouveau milieu de terrain dans les prochains jours…","pubDate":"2023-08-23 19:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/226775.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"title":"Transfert surprise, voilà la recrue mystère de l'OM","link":"https://le10sport.com/football/mercato/transfert-surprise-voila-la-recrue-mystere-de-lom-659643","keywords":null,"creator":null,"video_url":null,"description":"Depuis l'ouverture du mercato, l'OM est une nouvelle fois très actif, bien que depuis l'élimination contre le Panathinaïkos en barrages de Ligue des champions, Pablo Longoria se concentre…","content":"Depuis l'ouverture du mercato, l'OM est une nouvelle fois très actif, bien que depuis l'élimination contre le Panathinaïkos en barrages de Ligue des champions, Pablo Longoria se concentre essentiellement sur son dégraissage. Cependant, un ailier gauche est attendu la piste menant à Joaquin Correa, qui évolue à l'Inter Milan, vient d'être révélée. Comme à son habitude, Pablo Longoria s'active cet été pour renouveler l'effectif de l' OM . Dans cette optique, le secteur offensif a notamment été particulièrement remanié avec les arrivées de Pierre-Emerick Aubameyang , Iliman Ndiaye et Ismaïla Sarr . Mais ce n'est pas encore terminé puisque le club phocéen cherche encore un joueur offensif. Transferts : Guendouzi fait une proposition à l’OM ! https://t.co/rnYEnLBYoA pic.twitter.com/2CVsBOmVaB Bien que l'élimination en Ligue des champions ait marqué un frein sur le mercato de l' OM , Pablo Longoria continue de s'activer en coulisses. Ces derniers jours, RMC Sport révélait même que les discussions avec un ailier gauche étaient avancées. Le nom du joueur n'avait pas encore filtré. Mais il semble bien que son nom soit désormais connu. En effet, selon les informations de Relevo , l' OM s'active pour le transfert de Joaquin Correa que l' Inter Milan souhaite vendre. Gianluca Di Marzio confirme et ajoute même que les contacts son concret entre l'Argentin et le club phocéen qui n'a toutefois pas encore démarré les négociations avec les Nerazzurri .","pubDate":"2023-08-23 19:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/227797.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"title":"Moshiri scrambles to find new Everton investment after MSP blow, talks begin - report","link":"https://www.goodisonnews.com/2023/08/23/farhad-moshiri-enters-talks-with-777-partners-again-after-latest-everton-blow/","keywords":["Boardroom","News","777 Partners","everton","Farhad Moshiri","MSP Sports Capital"],"creator":["Callum O'Connell"],"video_url":null,"description":"Everton owner Farhan Moshiri is trying to find alternatives after MSP Sports Capital pulled out of their minority investment deal, and has reopened talks with 777 Partners, according to The Athletic. The football news outlet shared on 23 August that, with MSP now out of the picture, Moshiri is pushing forward in his attempts to ... The post Moshiri scrambles to find new Everton investment after MSP blow, talks begin - report appeared first on Goodison News.","content":"The football news outlet shared on 23 August that, with MSP now out of the picture, Moshiri is pushing forward in his attempts to find new investment, although whether his talks with 777 go any further than the ones that took place previously remains to be seen. shared on 29 May that 777 were seeking guarantees around Everton’s Premier League status, which of course couldn’t be given, and that the MSP deal was looked upon more favourably by Moshiri. This news comes at a particularly bad time, with Neil Moxley warning the club that every hard-fought point Everton earn in the Premier League could be wiped away if a Premier League investigation into financial irregularities proves its case [ , 20 August]. That report shared concerns around the club’s £430million losses over the past five years, labelling it “bizarre”, while Financial Fair Play issues also hang over the club. Moshiri’s search for extra investment comes at a high point of the criticism surrounding his running of the club, with Everton fans consistently vocal in their displeasure under his ownership. FFP concerns have been the underlying talking point of this transfer window as the club look to recruit players to give them the best possible chance of Premier League survival, but after two losses from two games, those concerns are continuing to grow. Should 777 seek similar assurances to those they initially wanted, it doesn’t look like Moshiri will realistically be able to offer them, in a huge concern for everybody associated with the club.","pubDate":"2023-08-23 19:10:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2023/04/Untitled-design-1-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Coupe du monde féminine de football : nouveau scandale en Espagne, l'entraîneur surpris en train de toucher la poitrine d'une membre de son staff","link":"https://www.ladepeche.fr/2023/08/23/coupe-du-monde-feminine-de-football-nouveau-scandale-en-espagne-lentraineur-surpris-en-train-de-toucher-la-poitrine-dune-membre-de-son-staff-11411518.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Des images montrent Jorge Vilda en train de toucher la poitrine d'une membre de son staff lors de la victoire de l'Espagne en finale de la Coupe du monde féminine.","content":"Quelques jours après la polémique du baiser forcé de la part du président de la Fédération espagnole de football Luis Rubiales sur la joueuse Jennifer Hermoso, une nouvelle affaire vient gâcher la fête alors que la Roja a récemment décroché la première Coupe du monde de son histoire. Ce mercredi, de nouvelles images de la finale entre l'Espagne et l'Angleterre ont fait surface et démontrent une scène où le sélectionneur espagnol Jorge Vilda touche la poitrine d'une membre de son staff, vraisemblablement lors d'une célébration. La membre du staff n'est autre que Montserrat \"Montse\" Tomé, ancienne joueuse du FC Barcelone et adjointe de Jorge Vilda. Ce dernier, qui travaille également en tant directeur technique pour le football féminin, avait été la cible de nombreuses critiques en septembre dernier de la part de ses joueuses. Quinze d'entre elles, qui confiaient que \"leur santé et leur état émotionnel\" étaient impactés par ses méthodes, avaient menacé de ne plus porter les couleurs de la Roja s'il n'était pas démis de ses fonctions. Finalement, la Fédération avait conforté celui qui tient les rênes de la sélection depuis 2015.","pubDate":"2023-08-23 19:09:23","image_url":"https://images.ladepeche.fr/api/v1/images/view/64e654599e98330a24464efa/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"title":"49ers’ Sam Darnold wins No. 2 quarterback job, Trey Lance could be on move","link":"https://www.eastbaytimes.com/2023/08/23/49ers-sam-darnold-wins-no-2-quarterback-job-trey-lance-could-be-on-move/","keywords":["Latest Headlines","NFL","San Francisco 49ers","Sports","49ers Alert","Inside Sports"],"creator":["Cam Inman"],"video_url":null,"description":"Sam Darnold will be Brock Purdy's backup this season, thus putting Trey Lance's 49ers tenure in further jeopardy as the 2021 draft's No. 3 pick enters his third season.","content":"SANTA CLARA — With Sam Darnold reportedly locking down the 49ers’ No. 2 quarterback job, the team is exploring options on what to do with Trey Lance, a league source said Wednesday. A day earlier, coach Kyle Shanahan said he would consider rotating both Darnold and Lance as the backup to Brock Purdy, who’s made a remarkable recovery from March elbow surgery to retain the starting role he flourished in last season. Rather than retain Lance as the No. 3 quarterback, the 49ers appear willing to part with him after just four starts in two seasons, after they moved up to draft him No. 3 overall in 2021. News of Darnold securing the No. 2 job was first reported by NFL Network, about an hour before practice. Friday marks the 49ers’ final preseason game, a 7 p.m. kickoff against the Los Angeles Chargers at Levi’s Stadium. Brandon Allen has served as the No. 4 quarterback throughout camp but has not taken an 11-on-11 snap since the Aug. 13 preseason opener. In recent days, two quarterback jobs were cleared up around the league, with the Washington Commanders and the Tampa Bay Buccaneers naming Sam Howell and Baker Mayfield as their season-opening starters. The Cincinnati Bengals are navigating their way through the preseason without Joe Burrow (calf). No other starting job appears vacant, so if Lance is acquired elsewhere, it presumably would be as a backup. Lance conceivably could reunite with former 49ers coordinators who are now the head coaches with the Miami Dolphins (Mike McDaniel) and the Houston Texans (DeMeco Ryans), if they’re seeking an upgrade to backup their projected starters in Tua Tagovailoa and C.J. Stroud, respectively. Lance, 23, served as the 49ers season-opening starter last year before sustaining a fractured ankle in the home opener, thrusting Jimmy Garoppolo and eventually Purdy into that job. Lance delivered a fourth-quarter comeback win in Saturday night’s 21-20 preseason victory over the Denver Broncos, but he struggled before that fantastic finish, not just in that game but in the preseason opener at Las Vegas. After attempting just 318 passes at North Dakota State, Lance has thrown just 102 in regular-season action with the 49ers, resulting in 56 completions with five touchdowns and three interceptions. He sprained his knee in losing his career-opening start at Arizona on Oct. 10, 2021, then won his next start, in Week 16 over the Tennessee Titans amid the 49ers’ playoff push. In last season’s rainy opener, Lance and the 49ers fell at Chicago, then he got hurt the next week and required two procedures to repair an ankle that resulted in no further setbacks this offseason. Left guard Aaron Banks exited Tuesday’s practice because of cramps, after losing 14 pounds in Monday’s practice that was somewhat steamy and briefly rainy. “It’s really hard to replenish all that weight and not, the next day, cramp up in practice,” offensive coordinator Chris Foerster said. Banks, who blossomed last year as a first-year starter, is seen by Foerster as performing better in games than practice, which is unusual for linemen. “He’s in great shape. His weight’s been consistent,” Foerster said. “Sometimes in practice he gets worn down and is not as clean, but in games, he’s always fresh and ready to go. I’m really happy with his performance this camp and preseason.” When it comes to the 49ers’ offensive tackle spots, “great” competition exists as to who will back up All-Pro left tackle Trent Williams and right tackle Colton McKivitz, Mike McGlinchey’s replacement. The swing-tackle race is between: Jaylon Moore, Matt Pryor and Leroy Watson IV. Three weeks ago, Moore sustained a bruised knee and that’s lingered to hinder him. Pryor has made strides in recent weeks in practice and with the conditioning of his 6-foot-7, 332-pound frame. Watson played tight end at the University of Texas-San Antonio, “Don’t count Leroy Watson out,” Foerster said. “He’s a young, developing player and has not played a lot of offensive line. He’s got a steeper learning curve. He has really good talent and ability, but he’s a ways away.” Related Articles Roger Craig, the 49ers’ dual-threat running back and an NFL pioneer, again got rejected by Pro Football Hall of Fame voters. He was among 12 senior candidates discussed Tuesday. The three maximum finalists for 2024: Linebacker Randy Gradishar Defensive tackle Steve McMichael Wide receiver Art Powell. Craig is a three-time Super Bowl winner from his 49ers tenure (1983-90) who made four Pro Bowls and, in 1985, became the first player to produce 1,000 yards both rushing and receiving in a season, a feat matched since then by only Marshall Faulk (1999) and Christian McCaffrey (2019). Craig was a Pro Football Hall of Fame finalist in 2010 and 2020 before entering the seniors-candidate pool. Joe Montana, Jerry Rice, and Steve Young are the only 49ers’ offensive players from any of their five Super Bowl-winning teams to make the Pro Football Hall of Fame. The next Niner to make The Hall next year might be linebacker Patrick Willis, a two-time finalist who’ll be in his fifth year of eligibility. Semifinalists figure to be named in three months.","pubDate":"2023-08-23 19:03:21","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-49ERS-0820-23-1-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"49ers’ Sam Darnold wins No. 2 quarterback job, Trey Lance could be on move","link":"https://www.mercurynews.com/2023/08/23/49ers-sam-darnold-wins-no-2-quarterback-job-trey-lance-could-be-on-move/","keywords":["Latest Headlines","NFL","San Francisco 49ers","Sports","49ers Alert","49ers HQ","49ers Training Camp","Football","Inside Sports"],"creator":["Cam Inman"],"video_url":null,"description":"Sam Darnold will be Brock Purdy's backup this season, thus putting Trey Lance's 49ers tenure in further jeopardy as the 2021 draft's No. 3 pick enters his third season.","content":"SANTA CLARA — With Sam Darnold reportedly locking down the 49ers’ No. 2 quarterback job, the team is exploring options on what to do with Trey Lance, a league source said Wednesday. A day earlier, coach Kyle Shanahan said he would consider rotating both Darnold and Lance as the backup to Brock Purdy, who’s made a remarkable recovery from March elbow surgery to retain the starting role he flourished in last season. Rather than retain Lance as the No. 3 quarterback, the 49ers appear willing to part with him after just four starts in two seasons, after they moved up to draft him No. 3 overall in 2021. News of Darnold securing the No. 2 job was first reported by NFL Network, about an hour before practice. Friday marks the 49ers’ final preseason game, a 7 p.m. kickoff against the Los Angeles Chargers at Levi’s Stadium. Brandon Allen has served as the No. 4 quarterback throughout camp but has not taken an 11-on-11 snap since the Aug. 13 preseason opener. In recent days, two quarterback jobs were cleared up around the league, with the Washington Commanders and the Tampa Bay Buccaneers naming Sam Howell and Baker Mayfield as their season-opening starters. The Cincinnati Bengals are navigating their way through the preseason without Joe Burrow (calf). No other starting job appears vacant, so if Lance is acquired elsewhere, it presumably would be as a backup. Lance conceivably could reunite with former 49ers coordinators who are now the head coaches with the Miami Dolphins (Mike McDaniel) and the Houston Texans (DeMeco Ryans), if they’re seeking an upgrade to backup their projected starters in Tua Tagovailoa and C.J. Stroud, respectively. Lance, 23, served as the 49ers season-opening starter last year before sustaining a fractured ankle in the home opener, thrusting Jimmy Garoppolo and eventually Purdy into that job. Lance delivered a fourth-quarter comeback win in Saturday night’s 21-20 preseason victory over the Denver Broncos, but he struggled before that fantastic finish, not just in that game but in the preseason opener at Las Vegas. After attempting just 318 passes at North Dakota State, Lance has thrown just 102 in regular-season action with the 49ers, resulting in 56 completions with five touchdowns and three interceptions. He sprained his knee in losing his career-opening start at Arizona on Oct. 10, 2021, then won his next start, in Week 16 over the Tennessee Titans amid the 49ers’ playoff push. In last season’s rainy opener, Lance and the 49ers fell at Chicago, then he got hurt the next week and required two procedures to repair an ankle that resulted in no further setbacks this offseason. Left guard Aaron Banks exited Tuesday’s practice because of cramps, after losing 14 pounds in Monday’s practice that was somewhat steamy and briefly rainy. “It’s really hard to replenish all that weight and not, the next day, cramp up in practice,” offensive coordinator Chris Foerster said. Banks, who blossomed last year as a first-year starter, is seen by Foerster as performing better in games than practice, which is unusual for linemen. “He’s in great shape. His weight’s been consistent,” Foerster said. “Sometimes in practice he gets worn down and is not as clean, but in games, he’s always fresh and ready to go. I’m really happy with his performance this camp and preseason.” When it comes to the 49ers’ offensive tackle spots, “great” competition exists as to who will back up All-Pro left tackle Trent Williams and right tackle Colton McKivitz, Mike McGlinchey’s replacement. The swing-tackle race is between: Jaylon Moore, Matt Pryor and Leroy Watson IV. Three weeks ago, Moore sustained a bruised knee and that’s lingered to hinder him. Pryor has made strides in recent weeks in practice and with the conditioning of his 6-foot-7, 332-pound frame. Watson played tight end at the University of Texas-San Antonio, “Don’t count Leroy Watson out,” Foerster said. “He’s a young, developing player and has not played a lot of offensive line. He’s got a steeper learning curve. He has really good talent and ability, but he’s a ways away.” Roger Craig, the 49ers’ dual-threat running back and an NFL pioneer, again got rejected by Pro Football Hall of Fame voters. He was among 12 senior candidates discussed Tuesday. The three maximum finalists for 2024: Linebacker Randy Gradishar Defensive tackle Steve McMichael Wide receiver Art Powell. Craig is a three-time Super Bowl winner from his 49ers tenure (1983-90) who made four Pro Bowls and, in 1985, became the first player to produce 1,000 yards both rushing and receiving in a season, a feat matched since then by only Marshall Faulk (1999) and Christian McCaffrey (2019). Craig was a Pro Football Hall of Fame finalist in 2010 and 2020 before entering the seniors-candidate pool. Joe Montana, Jerry Rice, and Steve Young are the only 49ers’ offensive players from any of their five Super Bowl-winning teams to make the Pro Football Hall of Fame. The next Niner to make The Hall next year might be linebacker Patrick Willis, a two-time finalist who’ll be in his fifth year of eligibility. Semifinalists figure to be named in three months.","pubDate":"2023-08-23 19:03:21","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/08/BNG-L-49ERS-0820-23-1.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Aston Villa sent transfer demand after dominant Europa Conference League display vs Hibs","link":"https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-sent-transfer-demand-27581044","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Amie Wilson)"],"video_url":null,"description":"The latest Aston Villa news as Unai Emery's side came out as comfortable 5-0 winners over the Scottish side in the first leg of their play-off tie","content":"Aston Villa fans have given their response to a comfortable win over Hibernian in the Europa Conference League play-off first leg. Villa made the journey up to Scotland looking to take the advantage into the second leg of the tie. A win over the two legs would see Villa book their place in the group stages of the competition. An Ollie Watkins hat-trick was added to by a Leon Bailey goal and a Douglas Luiz penalty to effectively seal the side’s place in the group stages, with 90 minutes of the tie left to play as Villa came out as 5-0 winners. READ MORE: Aston Villa player ratings vs Hibernian: Ollie Watkins and Lucas Digne shine in 5-0 win READ MORE: Hibernian 0-5 Aston Villa LIVE: Highlights and player ratings from Easter Road One of the main creative players for Villa was full-back Lucas Digne , who played a big part in a few of the goals. The Frenchman has been linked with a move away from Villa Park this summer. After the game, Villa fans took to social media to give their reaction, with many pointing to the performance of Digne amid talks over his future. Here’s what some just said... Jay Johnson: Easy does it! Dan Reynolds : Hibs were terrible. But we’ve lost to plenty of terrible sides in cup competitions over the years. Its a pleasure watching this team play football. Chris Stanley : Tie's done, no injuries. Perfect. Well done, Villa. Garin : Perfect first leg performance & we didn’t even get out of 2nd gear, top class. Karl Bolton : Great professional display by Villa tonight. Dominated without getting out of 2nd gear. Won’t the tie in the first leg. Got few more mins in players legs. Good job all round. Jamie Gray : Too easy, and in 2nd gear. What’s beautiful tho is that, even acknowledging how poor the opposition are, is that we’re playing levels of football that were incomprehensible until recent times, and I’m all in on it. Michael Priest : It’s good to be back in European competition! Dale : really professional today.. If we have to move Digne on to fund moves fir attackers then fair enough but if we don't have to he should be staying. Mike Land : I really hope we actually keep Digne around and invest money elsewhere - last two displays he has been class! If he goes then good luck to him but I would like to see money to be used elsewhere tbh. What did you think of the performance vs Hibernian? Tell us in the comments section","pubDate":"2023-08-23 19:01:43","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27580710.ece/ALTERNATES/s615/0_Hibernian-v-Aston-Villa-UEFA-Europa-Conference-League-Play-Offs-First-Leg-Easter-Road.jpg","source_id":"birminghammail","source_priority":57681,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Today’s Radio Sports Page 8/23/23","link":"https://www.kniakrls.com/2023/08/23/todays-radio-sports-page-8-23-23/","keywords":["Today's Radio Sports Page","Today’s Local Sports"],"creator":["Spencer Dirks"],"video_url":null,"description":"On today’s (8/23) Radio Sports Page… Let’s get to know Pella volleyball player Kyli Hiemstra Andrew Swadner catches up with Simpson Women’s Soccer coach Katie Berglund Let’s get to know Pella Christian football player John Boender Today’s","content":"On today’s (8/23) Radio Sports Page… Let’s get to know Pella volleyball player Kyli Hiemstra Andrew Swadner catches up with Simpson Women’s Soccer coach Katie Berglund Let’s get to know Pella Christian football player John Boender Today’s Radio Sports Page airs during the 8 a.m., 1 p.m., and 4 p.m. news magazines on KNIA/KRLS, and will be available daily online at KNIAKRLS.com and on our podcasts. Podcast: Play in new window | Download Subscribe: Apple Podcasts | Google Podcasts | Spotify | RSS | More","pubDate":"2023-08-23 19:00:31","image_url":"https://media.blubrry.com/iowaradioplus/ins.blubrry.com/iowaradioplus/Today_s_Radio_Sports_Page_8-23-23.mp3","source_id":"kniakrls","source_priority":60909,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Karim Benzema ‘faces being frozen out by his Saudi club’ as former Tottenham boss leaves fans in disbelief","link":"https://www.thescottishsun.co.uk/sport/football/11134207/karim-benzema-al-ittihad-tottenham-nuno-espirito-santo/","keywords":["Football","Sport"],"creator":["Dylan Terry"],"video_url":null,"description":null,"content":"KARIM BENZEMA could be dropped by Al-Ittihad due to a \"tense conflict\" with manager Nuno Espirito Santo. The Ballon d'Or winner, 35, joined the Saudi Arabian club back in June after departing Real Madrid . 3 Karim Benzema could be outcast by Al-Ittihad boss Nuno Espirito Santo Credit: Getty 3 Ex-Spurs boss Nuno and star striker Benzema are reportedly not seeing eye to eye Credit: Getty 3 He kicked off life in the Middle East with three goals in four games in the Arab Club Champions Cup. However, the £3.3million-a-week star has failed to hit the back of the net in their opening two league matches - both of which Al-Ittihad won. According to Saudi outlet Asharq Al-Aswat , Nuno is considering axing Benzema from his starting line-up. Relations between the Real Madrid legend and the ex- Tottenham head coach are reportedly \"tense\". Nuno is not thought to be a fan of Benzema's style of play and it is understood it was not his decision to sign the Frenchman. Meanwhile, Benzema is said to have complained about \"being treated unprofessionally by his coach\". And a situation surrounding the club captaincy has strained relations further. Benzema had agreed to be skipper as part of his transfer negotiations with Al-Ittihad - who won the Saudi Pro League title under Nuno last season. Most read in Football TOP TIER Celtic now FAVOURITES to secure sensational Kieran Tierney transfer return OUT THE HAT Reo Hatate REJECTS new Celtic contract in huge blow to Brendan Rodgers END OF THE ROAD Nicola Sturgeon stripped of £600k VIP police security amid cash 'row' BANNER BLAST Rangers ultras unveil tifo with words from banned sectarian anthem CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 But following his arrival, Nuno then gave club legend Romarinho the armband. And friction between Benzema and his manager have led to the striker reportedly failing to show up for training. It is understood something needs to be done to fix the issue and Benzema is in danger of being frozen out if it cannot be resolve. Meanwhile, fans have been left stunned by the situation. One social media user said: \"If a 5x champions league winner doesn’t fit into his style, then maybe Nuno has no style.\" Another added: \"Benzema can win any team a trophy, they’re missing out.\" A third replied: \"If Benzema doesn’t fit in your tactical style, you have no tactics.\" While a fourth responded: \"He’s your best player. Find a way to build the team around him, Nuno.\" Benzema scored 354 goals in 648 games across a stunning 14-year stint with Real Madrid. Read more on the Scottish Sun SHOP PLANS Primark set to open huge new store at Glasgow shopping centre FROCK NO I thought I’d found dream wedding guest dress - but it’s completely see through The plethora of trophies he won at the Bernabeu included four LaLiga titles and five Champions Leagues. He also earned 97 caps for France, netting 37 goals.","pubDate":"2023-08-23 19:00:02","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"A small (but major) tweak would spare the AFL another ‘mistake of consequence’","link":"https://www.brisbanetimes.com.au/sport/afl/a-small-but-major-tweak-would-spare-the-afl-another-mistake-of-consequence-20230823-p5dyxv.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Paddy Sweeney"],"video_url":null,"description":"The AFL’s current goal review system is broken, despite head honchos in the Docklands office telling us otherwise.","content":"A “mistake of consequence” was how outgoing AFL chief executive Gillon McLachlan described the complete farce which unfolded on Saturday night, when Ben Keays’ goal was deemed a point, ultimately costing Adelaide victory over Sydney and ending the Crows’ hope of playing finals football. The league’s boss was quick to own the mistake at his Sunday morning press conference, but stopped short of admitting any major flaws or issues with the goal review system, stating that if the goal umpire reviewed Keays shot on goal, it would have been overturned. Ben Keays celebrating what he thought was a goal, before it was called as a behind. Credit: Getty Images While McLachlan had little option but to apologise, the Crows were left seething as club chief executive Tim Silvers labelled it the biggest matchday error in 20 years. The problem is that the AFL’s current system is broken, despite head honchos in the Docklands office telling us otherwise. Why so, some will ask? Plain and simple, the only reason for its existence is to get decisions right. And if it can’t complete its only task, then it’s in need of a drastic overhaul. And there are multiple ways to not only minimise the chances of this catastrophic blunder occurring again, but even better, completely ruling it out altogether. Currently, only goals are reviewed, prior to the re-start back in the middle of the ground. McLachlan pointed to the time taken as not practical to the “ebb and flow” of the game for a reason to not review behinds. Loading In a similar way to soccer, there’s no rationale why the AFL can’t and shouldn’t review close calls while play continues, before informing umpires if a wrong decision has been made. The so-called “ebb and flow” of the game isn’t impacted, while the correct decision can be reached. This wouldn’t need to happen at every behind, just those where there’s an element of doubt. And it wouldn’t take long to be conclusive. After all, vision captured on an iPhone 10 metres behind the fence on Saturday night was able to determine Keay’s kick was clearly a goal. A major boost in investing in the right technology would also make a huge improvement. For years, the AFL has been reluctant to properly tip in the coin to upgrade appropriate equipment, aiding umpires to ultimately make the right calls. The league will no doubt look into expanding its use of ball chip technology this off-season, which will assist in determining whether the ball hits any part of the post, padding or player on the way through. While a captain’s call, as we see in the NRL and cricket, can also potentially rectify the human errors like we witnessed on Saturday, a simple rule change could almost certainly be foolproof against almost all issues. The AFL should give serious thought to the idea that if the ball hits the post and goes through the goals, then it’s a goal. Yes, this would be a big call to change the scoring system we’ve known since the game’s inception. However, there’s almost zero chance of a blunder occurring. The AFL loves to tinker with the rules in a bid to assist the game against certain trends. This year the “stand” rule was introduced for the player on the mark, with the idea of making the game move quicker by preventing the person on the mark from guarding the mark. Loading The rule changes are often put in place to improve scoring, reduce congestion, but overall, the goal is to enhance the product. At present, on the eve of the finals series, trust in the current system is at an all-time low. By implementing a new definition of a goal, accuracy is greatly enhanced, while problems are eradicated. The need for the AFL to make massive technological improvements is reduced, ultimately keeping their dollars and cents. And for that reason alone, it makes sense. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Opinion Adelaide Crows Paddy Sweeney is a Nine News Perth sports presenter and journalist. Most Viewed in Sport Loading","pubDate":"2023-08-23 19:00:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"title":"Mercato : C’est confirmé, le PSG se dirige vers un échec","link":"https://le10sport.com/football/mercato/mercato-cest-confirme-le-psg-se-dirige-vers-un-echec-659635","keywords":null,"creator":null,"video_url":null,"description":"Alors que la fin du mercato estival se profile, le PSG espère encore se renforcer par le biais des signatures de deux joueurs offensifs : Randal Kolo Muani (Eintracht Francfort) et Bradley Barcola…","content":"Alors que la fin du mercato estival se profile, le PSG espère encore se renforcer par le biais des signatures de deux joueurs offensifs : Randal Kolo Muani (Eintracht Francfort) et Bradley Barcola (OL). Mais si Marco Verratti pourrait quitter le club parisien cet été, Paris pourrait se retrouverait fort dépourvu dans l’entrejeu, mais aurait déjà abandonné l’idée de recruter un milieu ces prochains jours. Les derniers jours du mercato estival pourrait être animés du côté du PSG . Alors qu’un accord a été conclu avec Randal Kolo Muani , la ligne offensive du club de la capitale s’annonce prometteuse. Mais quid du milieu de terrain ? Mercato : Le PSG mis au défi pour ce transfert à 100M€ https://t.co/jwhRJ4wfkS pic.twitter.com/cvor0SHd9i Secteur défaillant du PSG et ce depuis plusieurs années, l’entrejeu n’a pas été renforcé à l’excès cet été. Hormis l’Uruguayen Manuel Ugarte , aucune recrue parisienne évolue au milieu de terrain, et avec le possible départ de Marco Verratti , le PSG pourrait connaître quelques problèmes dans ce secteur. Selon les informations du Parisien , Luis Enrique envisagerait d’ores et déjà la possibilité de replacer Danilo ainsi que Kang-In-Lee dans son milieu de terrain. Mais alors que la priorité de cette fin de mercato semble se situer au niveau de l’attaque pour le PSG , RMC affirme désormais que le club de la capitale aurait totalement renoncé au recrutement d’un nouveau milieu de terrain dans les prochains jours…","pubDate":"2023-08-23 19:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/226775.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"title":"Transfert surprise, voilà la recrue mystère de l'OM","link":"https://le10sport.com/football/mercato/transfert-surprise-voila-la-recrue-mystere-de-lom-659643","keywords":null,"creator":null,"video_url":null,"description":"Depuis l'ouverture du mercato, l'OM est une nouvelle fois très actif, bien que depuis l'élimination contre le Panathinaïkos en barrages de Ligue des champions, Pablo Longoria se concentre…","content":"Depuis l'ouverture du mercato, l'OM est une nouvelle fois très actif, bien que depuis l'élimination contre le Panathinaïkos en barrages de Ligue des champions, Pablo Longoria se concentre essentiellement sur son dégraissage. Cependant, un ailier gauche est attendu la piste menant à Joaquin Correa, qui évolue à l'Inter Milan, vient d'être révélée. Comme à son habitude, Pablo Longoria s'active cet été pour renouveler l'effectif de l' OM . Dans cette optique, le secteur offensif a notamment été particulièrement remanié avec les arrivées de Pierre-Emerick Aubameyang , Iliman Ndiaye et Ismaïla Sarr . Mais ce n'est pas encore terminé puisque le club phocéen cherche encore un joueur offensif. Transferts : Guendouzi fait une proposition à l’OM ! https://t.co/rnYEnLBYoA pic.twitter.com/2CVsBOmVaB Bien que l'élimination en Ligue des champions ait marqué un frein sur le mercato de l' OM , Pablo Longoria continue de s'activer en coulisses. Ces derniers jours, RMC Sport révélait même que les discussions avec un ailier gauche étaient avancées. Le nom du joueur n'avait pas encore filtré. Mais il semble bien que son nom soit désormais connu. En effet, selon les informations de Relevo , l' OM s'active pour le transfert de Joaquin Correa que l' Inter Milan souhaite vendre. Gianluca Di Marzio confirme et ajoute même que les contacts son concret entre l'Argentin et le club phocéen qui n'a toutefois pas encore démarré les négociations avec les Nerazzurri .","pubDate":"2023-08-23 19:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/227797.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"title":"Moshiri scrambles to find new Everton investment after MSP blow, talks begin - report","link":"https://www.goodisonnews.com/2023/08/23/farhad-moshiri-enters-talks-with-777-partners-again-after-latest-everton-blow/","keywords":["Boardroom","News","777 Partners","everton","Farhad Moshiri","MSP Sports Capital"],"creator":["Callum O'Connell"],"video_url":null,"description":"Everton owner Farhan Moshiri is trying to find alternatives after MSP Sports Capital pulled out of their minority investment deal, and has reopened talks with 777 Partners, according to The Athletic. The football news outlet shared on 23 August that, with MSP now out of the picture, Moshiri is pushing forward in his attempts to ... The post Moshiri scrambles to find new Everton investment after MSP blow, talks begin - report appeared first on Goodison News.","content":"The football news outlet shared on 23 August that, with MSP now out of the picture, Moshiri is pushing forward in his attempts to find new investment, although whether his talks with 777 go any further than the ones that took place previously remains to be seen. shared on 29 May that 777 were seeking guarantees around Everton’s Premier League status, which of course couldn’t be given, and that the MSP deal was looked upon more favourably by Moshiri. This news comes at a particularly bad time, with Neil Moxley warning the club that every hard-fought point Everton earn in the Premier League could be wiped away if a Premier League investigation into financial irregularities proves its case [ , 20 August]. That report shared concerns around the club’s £430million losses over the past five years, labelling it “bizarre”, while Financial Fair Play issues also hang over the club. Moshiri’s search for extra investment comes at a high point of the criticism surrounding his running of the club, with Everton fans consistently vocal in their displeasure under his ownership. FFP concerns have been the underlying talking point of this transfer window as the club look to recruit players to give them the best possible chance of Premier League survival, but after two losses from two games, those concerns are continuing to grow. Should 777 seek similar assurances to those they initially wanted, it doesn’t look like Moshiri will realistically be able to offer them, in a huge concern for everybody associated with the club.","pubDate":"2023-08-23 19:10:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2023/04/Untitled-design-1-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Coupe du monde féminine de football : nouveau scandale en Espagne, l'entraîneur surpris en train de toucher la poitrine d'une membre de son staff","link":"https://www.ladepeche.fr/2023/08/23/coupe-du-monde-feminine-de-football-nouveau-scandale-en-espagne-lentraineur-surpris-en-train-de-toucher-la-poitrine-dune-membre-de-son-staff-11411518.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Des images montrent Jorge Vilda en train de toucher la poitrine d'une membre de son staff lors de la victoire de l'Espagne en finale de la Coupe du monde féminine.","content":"Quelques jours après la polémique du baiser forcé de la part du président de la Fédération espagnole de football Luis Rubiales sur la joueuse Jennifer Hermoso, une nouvelle affaire vient gâcher la fête alors que la Roja a récemment décroché la première Coupe du monde de son histoire. Ce mercredi, de nouvelles images de la finale entre l'Espagne et l'Angleterre ont fait surface et démontrent une scène où le sélectionneur espagnol Jorge Vilda touche la poitrine d'une membre de son staff, vraisemblablement lors d'une célébration. La membre du staff n'est autre que Montserrat \"Montse\" Tomé, ancienne joueuse du FC Barcelone et adjointe de Jorge Vilda. Ce dernier, qui travaille également en tant directeur technique pour le football féminin, avait été la cible de nombreuses critiques en septembre dernier de la part de ses joueuses. Quinze d'entre elles, qui confiaient que \"leur santé et leur état émotionnel\" étaient impactés par ses méthodes, avaient menacé de ne plus porter les couleurs de la Roja s'il n'était pas démis de ses fonctions. Finalement, la Fédération avait conforté celui qui tient les rênes de la sélection depuis 2015.","pubDate":"2023-08-23 19:09:23","image_url":"https://images.ladepeche.fr/api/v1/images/view/64e654599e98330a24464efa/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"title":"49ers’ Sam Darnold wins No. 2 quarterback job, Trey Lance could be on move","link":"https://www.eastbaytimes.com/2023/08/23/49ers-sam-darnold-wins-no-2-quarterback-job-trey-lance-could-be-on-move/","keywords":["Latest Headlines","NFL","San Francisco 49ers","Sports","49ers Alert","Inside Sports"],"creator":["Cam Inman"],"video_url":null,"description":"Sam Darnold will be Brock Purdy's backup this season, thus putting Trey Lance's 49ers tenure in further jeopardy as the 2021 draft's No. 3 pick enters his third season.","content":"SANTA CLARA — With Sam Darnold reportedly locking down the 49ers’ No. 2 quarterback job, the team is exploring options on what to do with Trey Lance, a league source said Wednesday. A day earlier, coach Kyle Shanahan said he would consider rotating both Darnold and Lance as the backup to Brock Purdy, who’s made a remarkable recovery from March elbow surgery to retain the starting role he flourished in last season. Rather than retain Lance as the No. 3 quarterback, the 49ers appear willing to part with him after just four starts in two seasons, after they moved up to draft him No. 3 overall in 2021. News of Darnold securing the No. 2 job was first reported by NFL Network, about an hour before practice. Friday marks the 49ers’ final preseason game, a 7 p.m. kickoff against the Los Angeles Chargers at Levi’s Stadium. Brandon Allen has served as the No. 4 quarterback throughout camp but has not taken an 11-on-11 snap since the Aug. 13 preseason opener. In recent days, two quarterback jobs were cleared up around the league, with the Washington Commanders and the Tampa Bay Buccaneers naming Sam Howell and Baker Mayfield as their season-opening starters. The Cincinnati Bengals are navigating their way through the preseason without Joe Burrow (calf). No other starting job appears vacant, so if Lance is acquired elsewhere, it presumably would be as a backup. Lance conceivably could reunite with former 49ers coordinators who are now the head coaches with the Miami Dolphins (Mike McDaniel) and the Houston Texans (DeMeco Ryans), if they’re seeking an upgrade to backup their projected starters in Tua Tagovailoa and C.J. Stroud, respectively. Lance, 23, served as the 49ers season-opening starter last year before sustaining a fractured ankle in the home opener, thrusting Jimmy Garoppolo and eventually Purdy into that job. Lance delivered a fourth-quarter comeback win in Saturday night’s 21-20 preseason victory over the Denver Broncos, but he struggled before that fantastic finish, not just in that game but in the preseason opener at Las Vegas. After attempting just 318 passes at North Dakota State, Lance has thrown just 102 in regular-season action with the 49ers, resulting in 56 completions with five touchdowns and three interceptions. He sprained his knee in losing his career-opening start at Arizona on Oct. 10, 2021, then won his next start, in Week 16 over the Tennessee Titans amid the 49ers’ playoff push. In last season’s rainy opener, Lance and the 49ers fell at Chicago, then he got hurt the next week and required two procedures to repair an ankle that resulted in no further setbacks this offseason. Left guard Aaron Banks exited Tuesday’s practice because of cramps, after losing 14 pounds in Monday’s practice that was somewhat steamy and briefly rainy. “It’s really hard to replenish all that weight and not, the next day, cramp up in practice,” offensive coordinator Chris Foerster said. Banks, who blossomed last year as a first-year starter, is seen by Foerster as performing better in games than practice, which is unusual for linemen. “He’s in great shape. His weight’s been consistent,” Foerster said. “Sometimes in practice he gets worn down and is not as clean, but in games, he’s always fresh and ready to go. I’m really happy with his performance this camp and preseason.” When it comes to the 49ers’ offensive tackle spots, “great” competition exists as to who will back up All-Pro left tackle Trent Williams and right tackle Colton McKivitz, Mike McGlinchey’s replacement. The swing-tackle race is between: Jaylon Moore, Matt Pryor and Leroy Watson IV. Three weeks ago, Moore sustained a bruised knee and that’s lingered to hinder him. Pryor has made strides in recent weeks in practice and with the conditioning of his 6-foot-7, 332-pound frame. Watson played tight end at the University of Texas-San Antonio, “Don’t count Leroy Watson out,” Foerster said. “He’s a young, developing player and has not played a lot of offensive line. He’s got a steeper learning curve. He has really good talent and ability, but he’s a ways away.” Related Articles Roger Craig, the 49ers’ dual-threat running back and an NFL pioneer, again got rejected by Pro Football Hall of Fame voters. He was among 12 senior candidates discussed Tuesday. The three maximum finalists for 2024: Linebacker Randy Gradishar Defensive tackle Steve McMichael Wide receiver Art Powell. Craig is a three-time Super Bowl winner from his 49ers tenure (1983-90) who made four Pro Bowls and, in 1985, became the first player to produce 1,000 yards both rushing and receiving in a season, a feat matched since then by only Marshall Faulk (1999) and Christian McCaffrey (2019). Craig was a Pro Football Hall of Fame finalist in 2010 and 2020 before entering the seniors-candidate pool. Joe Montana, Jerry Rice, and Steve Young are the only 49ers’ offensive players from any of their five Super Bowl-winning teams to make the Pro Football Hall of Fame. The next Niner to make The Hall next year might be linebacker Patrick Willis, a two-time finalist who’ll be in his fifth year of eligibility. Semifinalists figure to be named in three months.","pubDate":"2023-08-23 19:03:21","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-49ERS-0820-23-1-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"49ers’ Sam Darnold wins No. 2 quarterback job, Trey Lance could be on move","link":"https://www.mercurynews.com/2023/08/23/49ers-sam-darnold-wins-no-2-quarterback-job-trey-lance-could-be-on-move/","keywords":["Latest Headlines","NFL","San Francisco 49ers","Sports","49ers Alert","49ers HQ","49ers Training Camp","Football","Inside Sports"],"creator":["Cam Inman"],"video_url":null,"description":"Sam Darnold will be Brock Purdy's backup this season, thus putting Trey Lance's 49ers tenure in further jeopardy as the 2021 draft's No. 3 pick enters his third season.","content":"SANTA CLARA — With Sam Darnold reportedly locking down the 49ers’ No. 2 quarterback job, the team is exploring options on what to do with Trey Lance, a league source said Wednesday. A day earlier, coach Kyle Shanahan said he would consider rotating both Darnold and Lance as the backup to Brock Purdy, who’s made a remarkable recovery from March elbow surgery to retain the starting role he flourished in last season. Rather than retain Lance as the No. 3 quarterback, the 49ers appear willing to part with him after just four starts in two seasons, after they moved up to draft him No. 3 overall in 2021. News of Darnold securing the No. 2 job was first reported by NFL Network, about an hour before practice. Friday marks the 49ers’ final preseason game, a 7 p.m. kickoff against the Los Angeles Chargers at Levi’s Stadium. Brandon Allen has served as the No. 4 quarterback throughout camp but has not taken an 11-on-11 snap since the Aug. 13 preseason opener. In recent days, two quarterback jobs were cleared up around the league, with the Washington Commanders and the Tampa Bay Buccaneers naming Sam Howell and Baker Mayfield as their season-opening starters. The Cincinnati Bengals are navigating their way through the preseason without Joe Burrow (calf). No other starting job appears vacant, so if Lance is acquired elsewhere, it presumably would be as a backup. Lance conceivably could reunite with former 49ers coordinators who are now the head coaches with the Miami Dolphins (Mike McDaniel) and the Houston Texans (DeMeco Ryans), if they’re seeking an upgrade to backup their projected starters in Tua Tagovailoa and C.J. Stroud, respectively. Lance, 23, served as the 49ers season-opening starter last year before sustaining a fractured ankle in the home opener, thrusting Jimmy Garoppolo and eventually Purdy into that job. Lance delivered a fourth-quarter comeback win in Saturday night’s 21-20 preseason victory over the Denver Broncos, but he struggled before that fantastic finish, not just in that game but in the preseason opener at Las Vegas. After attempting just 318 passes at North Dakota State, Lance has thrown just 102 in regular-season action with the 49ers, resulting in 56 completions with five touchdowns and three interceptions. He sprained his knee in losing his career-opening start at Arizona on Oct. 10, 2021, then won his next start, in Week 16 over the Tennessee Titans amid the 49ers’ playoff push. In last season’s rainy opener, Lance and the 49ers fell at Chicago, then he got hurt the next week and required two procedures to repair an ankle that resulted in no further setbacks this offseason. Left guard Aaron Banks exited Tuesday’s practice because of cramps, after losing 14 pounds in Monday’s practice that was somewhat steamy and briefly rainy. “It’s really hard to replenish all that weight and not, the next day, cramp up in practice,” offensive coordinator Chris Foerster said. Banks, who blossomed last year as a first-year starter, is seen by Foerster as performing better in games than practice, which is unusual for linemen. “He’s in great shape. His weight’s been consistent,” Foerster said. “Sometimes in practice he gets worn down and is not as clean, but in games, he’s always fresh and ready to go. I’m really happy with his performance this camp and preseason.” When it comes to the 49ers’ offensive tackle spots, “great” competition exists as to who will back up All-Pro left tackle Trent Williams and right tackle Colton McKivitz, Mike McGlinchey’s replacement. The swing-tackle race is between: Jaylon Moore, Matt Pryor and Leroy Watson IV. Three weeks ago, Moore sustained a bruised knee and that’s lingered to hinder him. Pryor has made strides in recent weeks in practice and with the conditioning of his 6-foot-7, 332-pound frame. Watson played tight end at the University of Texas-San Antonio, “Don’t count Leroy Watson out,” Foerster said. “He’s a young, developing player and has not played a lot of offensive line. He’s got a steeper learning curve. He has really good talent and ability, but he’s a ways away.” Roger Craig, the 49ers’ dual-threat running back and an NFL pioneer, again got rejected by Pro Football Hall of Fame voters. He was among 12 senior candidates discussed Tuesday. The three maximum finalists for 2024: Linebacker Randy Gradishar Defensive tackle Steve McMichael Wide receiver Art Powell. Craig is a three-time Super Bowl winner from his 49ers tenure (1983-90) who made four Pro Bowls and, in 1985, became the first player to produce 1,000 yards both rushing and receiving in a season, a feat matched since then by only Marshall Faulk (1999) and Christian McCaffrey (2019). Craig was a Pro Football Hall of Fame finalist in 2010 and 2020 before entering the seniors-candidate pool. Joe Montana, Jerry Rice, and Steve Young are the only 49ers’ offensive players from any of their five Super Bowl-winning teams to make the Pro Football Hall of Fame. The next Niner to make The Hall next year might be linebacker Patrick Willis, a two-time finalist who’ll be in his fifth year of eligibility. Semifinalists figure to be named in three months.","pubDate":"2023-08-23 19:03:21","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/08/BNG-L-49ERS-0820-23-1.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Aston Villa sent transfer demand after dominant Europa Conference League display vs Hibs","link":"https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-sent-transfer-demand-27581044","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Amie Wilson)"],"video_url":null,"description":"The latest Aston Villa news as Unai Emery's side came out as comfortable 5-0 winners over the Scottish side in the first leg of their play-off tie","content":"Aston Villa fans have given their response to a comfortable win over Hibernian in the Europa Conference League play-off first leg. Villa made the journey up to Scotland looking to take the advantage into the second leg of the tie. A win over the two legs would see Villa book their place in the group stages of the competition. An Ollie Watkins hat-trick was added to by a Leon Bailey goal and a Douglas Luiz penalty to effectively seal the side’s place in the group stages, with 90 minutes of the tie left to play as Villa came out as 5-0 winners. READ MORE: Aston Villa player ratings vs Hibernian: Ollie Watkins and Lucas Digne shine in 5-0 win READ MORE: Hibernian 0-5 Aston Villa LIVE: Highlights and player ratings from Easter Road One of the main creative players for Villa was full-back Lucas Digne , who played a big part in a few of the goals. The Frenchman has been linked with a move away from Villa Park this summer. After the game, Villa fans took to social media to give their reaction, with many pointing to the performance of Digne amid talks over his future. Here’s what some just said... Jay Johnson: Easy does it! Dan Reynolds : Hibs were terrible. But we’ve lost to plenty of terrible sides in cup competitions over the years. Its a pleasure watching this team play football. Chris Stanley : Tie's done, no injuries. Perfect. Well done, Villa. Garin : Perfect first leg performance & we didn’t even get out of 2nd gear, top class. Karl Bolton : Great professional display by Villa tonight. Dominated without getting out of 2nd gear. Won’t the tie in the first leg. Got few more mins in players legs. Good job all round. Jamie Gray : Too easy, and in 2nd gear. What’s beautiful tho is that, even acknowledging how poor the opposition are, is that we’re playing levels of football that were incomprehensible until recent times, and I’m all in on it. Michael Priest : It’s good to be back in European competition! Dale : really professional today.. If we have to move Digne on to fund moves fir attackers then fair enough but if we don't have to he should be staying. Mike Land : I really hope we actually keep Digne around and invest money elsewhere - last two displays he has been class! If he goes then good luck to him but I would like to see money to be used elsewhere tbh. What did you think of the performance vs Hibernian? Tell us in the comments section","pubDate":"2023-08-23 19:01:43","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27580710.ece/ALTERNATES/s615/0_Hibernian-v-Aston-Villa-UEFA-Europa-Conference-League-Play-Offs-First-Leg-Easter-Road.jpg","source_id":"birminghammail","source_priority":57681,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Today’s Radio Sports Page 8/23/23","link":"https://www.kniakrls.com/2023/08/23/todays-radio-sports-page-8-23-23/","keywords":["Today's Radio Sports Page","Today’s Local Sports"],"creator":["Spencer Dirks"],"video_url":null,"description":"On today’s (8/23) Radio Sports Page… Let’s get to know Pella volleyball player Kyli Hiemstra Andrew Swadner catches up with Simpson Women’s Soccer coach Katie Berglund Let’s get to know Pella Christian football player John Boender Today’s","content":"On today’s (8/23) Radio Sports Page… Let’s get to know Pella volleyball player Kyli Hiemstra Andrew Swadner catches up with Simpson Women’s Soccer coach Katie Berglund Let’s get to know Pella Christian football player John Boender Today’s Radio Sports Page airs during the 8 a.m., 1 p.m., and 4 p.m. news magazines on KNIA/KRLS, and will be available daily online at KNIAKRLS.com and on our podcasts. Podcast: Play in new window | Download Subscribe: Apple Podcasts | Google Podcasts | Spotify | RSS | More","pubDate":"2023-08-23 19:00:31","image_url":"https://media.blubrry.com/iowaradioplus/ins.blubrry.com/iowaradioplus/Today_s_Radio_Sports_Page_8-23-23.mp3","source_id":"kniakrls","source_priority":60909,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Karim Benzema ‘faces being frozen out by his Saudi club’ as former Tottenham boss leaves fans in disbelief","link":"https://www.thescottishsun.co.uk/sport/football/11134207/karim-benzema-al-ittihad-tottenham-nuno-espirito-santo/","keywords":["Football","Sport"],"creator":["Dylan Terry"],"video_url":null,"description":null,"content":"KARIM BENZEMA could be dropped by Al-Ittihad due to a \"tense conflict\" with manager Nuno Espirito Santo. The Ballon d'Or winner, 35, joined the Saudi Arabian club back in June after departing Real Madrid . 3 Karim Benzema could be outcast by Al-Ittihad boss Nuno Espirito Santo Credit: Getty 3 Ex-Spurs boss Nuno and star striker Benzema are reportedly not seeing eye to eye Credit: Getty 3 He kicked off life in the Middle East with three goals in four games in the Arab Club Champions Cup. However, the £3.3million-a-week star has failed to hit the back of the net in their opening two league matches - both of which Al-Ittihad won. According to Saudi outlet Asharq Al-Aswat , Nuno is considering axing Benzema from his starting line-up. Relations between the Real Madrid legend and the ex- Tottenham head coach are reportedly \"tense\". Nuno is not thought to be a fan of Benzema's style of play and it is understood it was not his decision to sign the Frenchman. Meanwhile, Benzema is said to have complained about \"being treated unprofessionally by his coach\". And a situation surrounding the club captaincy has strained relations further. Benzema had agreed to be skipper as part of his transfer negotiations with Al-Ittihad - who won the Saudi Pro League title under Nuno last season. Most read in Football TOP TIER Celtic now FAVOURITES to secure sensational Kieran Tierney transfer return OUT THE HAT Reo Hatate REJECTS new Celtic contract in huge blow to Brendan Rodgers END OF THE ROAD Nicola Sturgeon stripped of £600k VIP police security amid cash 'row' BANNER BLAST Rangers ultras unveil tifo with words from banned sectarian anthem CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 But following his arrival, Nuno then gave club legend Romarinho the armband. And friction between Benzema and his manager have led to the striker reportedly failing to show up for training. It is understood something needs to be done to fix the issue and Benzema is in danger of being frozen out if it cannot be resolve. Meanwhile, fans have been left stunned by the situation. One social media user said: \"If a 5x champions league winner doesn’t fit into his style, then maybe Nuno has no style.\" Another added: \"Benzema can win any team a trophy, they’re missing out.\" A third replied: \"If Benzema doesn’t fit in your tactical style, you have no tactics.\" While a fourth responded: \"He’s your best player. Find a way to build the team around him, Nuno.\" Benzema scored 354 goals in 648 games across a stunning 14-year stint with Real Madrid. Read more on the Scottish Sun SHOP PLANS Primark set to open huge new store at Glasgow shopping centre FROCK NO I thought I’d found dream wedding guest dress - but it’s completely see through The plethora of trophies he won at the Bernabeu included four LaLiga titles and five Champions Leagues. He also earned 97 caps for France, netting 37 goals.","pubDate":"2023-08-23 19:00:02","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"A small (but major) tweak would spare the AFL another ‘mistake of consequence’","link":"https://www.brisbanetimes.com.au/sport/afl/a-small-but-major-tweak-would-spare-the-afl-another-mistake-of-consequence-20230823-p5dyxv.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Paddy Sweeney"],"video_url":null,"description":"The AFL’s current goal review system is broken, despite head honchos in the Docklands office telling us otherwise.","content":"A “mistake of consequence” was how outgoing AFL chief executive Gillon McLachlan described the complete farce which unfolded on Saturday night, when Ben Keays’ goal was deemed a point, ultimately costing Adelaide victory over Sydney and ending the Crows’ hope of playing finals football. The league’s boss was quick to own the mistake at his Sunday morning press conference, but stopped short of admitting any major flaws or issues with the goal review system, stating that if the goal umpire reviewed Keays shot on goal, it would have been overturned. Ben Keays celebrating what he thought was a goal, before it was called as a behind. Credit: Getty Images While McLachlan had little option but to apologise, the Crows were left seething as club chief executive Tim Silvers labelled it the biggest matchday error in 20 years. The problem is that the AFL’s current system is broken, despite head honchos in the Docklands office telling us otherwise. Why so, some will ask? Plain and simple, the only reason for its existence is to get decisions right. And if it can’t complete its only task, then it’s in need of a drastic overhaul. And there are multiple ways to not only minimise the chances of this catastrophic blunder occurring again, but even better, completely ruling it out altogether. Currently, only goals are reviewed, prior to the re-start back in the middle of the ground. McLachlan pointed to the time taken as not practical to the “ebb and flow” of the game for a reason to not review behinds. Loading In a similar way to soccer, there’s no rationale why the AFL can’t and shouldn’t review close calls while play continues, before informing umpires if a wrong decision has been made. The so-called “ebb and flow” of the game isn’t impacted, while the correct decision can be reached. This wouldn’t need to happen at every behind, just those where there’s an element of doubt. And it wouldn’t take long to be conclusive. After all, vision captured on an iPhone 10 metres behind the fence on Saturday night was able to determine Keay’s kick was clearly a goal. A major boost in investing in the right technology would also make a huge improvement. For years, the AFL has been reluctant to properly tip in the coin to upgrade appropriate equipment, aiding umpires to ultimately make the right calls. The league will no doubt look into expanding its use of ball chip technology this off-season, which will assist in determining whether the ball hits any part of the post, padding or player on the way through. While a captain’s call, as we see in the NRL and cricket, can also potentially rectify the human errors like we witnessed on Saturday, a simple rule change could almost certainly be foolproof against almost all issues. The AFL should give serious thought to the idea that if the ball hits the post and goes through the goals, then it’s a goal. Yes, this would be a big call to change the scoring system we’ve known since the game’s inception. However, there’s almost zero chance of a blunder occurring. The AFL loves to tinker with the rules in a bid to assist the game against certain trends. This year the “stand” rule was introduced for the player on the mark, with the idea of making the game move quicker by preventing the person on the mark from guarding the mark. Loading The rule changes are often put in place to improve scoring, reduce congestion, but overall, the goal is to enhance the product. At present, on the eve of the finals series, trust in the current system is at an all-time low. By implementing a new definition of a goal, accuracy is greatly enhanced, while problems are eradicated. The need for the AFL to make massive technological improvements is reduced, ultimately keeping their dollars and cents. And for that reason alone, it makes sense. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Opinion Adelaide Crows Paddy Sweeney is a Nine News Perth sports presenter and journalist. Most Viewed in Sport Loading","pubDate":"2023-08-23 19:00:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"title":"Mercato : C’est confirmé, le PSG se dirige vers un échec","link":"https://le10sport.com/football/mercato/mercato-cest-confirme-le-psg-se-dirige-vers-un-echec-659635","keywords":null,"creator":null,"video_url":null,"description":"Alors que la fin du mercato estival se profile, le PSG espère encore se renforcer par le biais des signatures de deux joueurs offensifs : Randal Kolo Muani (Eintracht Francfort) et Bradley Barcola…","content":"Alors que la fin du mercato estival se profile, le PSG espère encore se renforcer par le biais des signatures de deux joueurs offensifs : Randal Kolo Muani (Eintracht Francfort) et Bradley Barcola (OL). Mais si Marco Verratti pourrait quitter le club parisien cet été, Paris pourrait se retrouverait fort dépourvu dans l’entrejeu, mais aurait déjà abandonné l’idée de recruter un milieu ces prochains jours. Les derniers jours du mercato estival pourrait être animés du côté du PSG . Alors qu’un accord a été conclu avec Randal Kolo Muani , la ligne offensive du club de la capitale s’annonce prometteuse. Mais quid du milieu de terrain ? Mercato : Le PSG mis au défi pour ce transfert à 100M€ https://t.co/jwhRJ4wfkS pic.twitter.com/cvor0SHd9i Secteur défaillant du PSG et ce depuis plusieurs années, l’entrejeu n’a pas été renforcé à l’excès cet été. Hormis l’Uruguayen Manuel Ugarte , aucune recrue parisienne évolue au milieu de terrain, et avec le possible départ de Marco Verratti , le PSG pourrait connaître quelques problèmes dans ce secteur. Selon les informations du Parisien , Luis Enrique envisagerait d’ores et déjà la possibilité de replacer Danilo ainsi que Kang-In-Lee dans son milieu de terrain. Mais alors que la priorité de cette fin de mercato semble se situer au niveau de l’attaque pour le PSG , RMC affirme désormais que le club de la capitale aurait totalement renoncé au recrutement d’un nouveau milieu de terrain dans les prochains jours…","pubDate":"2023-08-23 19:15:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/226775.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"title":"Transfert surprise, voilà la recrue mystère de l'OM","link":"https://le10sport.com/football/mercato/transfert-surprise-voila-la-recrue-mystere-de-lom-659643","keywords":null,"creator":null,"video_url":null,"description":"Depuis l'ouverture du mercato, l'OM est une nouvelle fois très actif, bien que depuis l'élimination contre le Panathinaïkos en barrages de Ligue des champions, Pablo Longoria se concentre…","content":"Depuis l'ouverture du mercato, l'OM est une nouvelle fois très actif, bien que depuis l'élimination contre le Panathinaïkos en barrages de Ligue des champions, Pablo Longoria se concentre essentiellement sur son dégraissage. Cependant, un ailier gauche est attendu la piste menant à Joaquin Correa, qui évolue à l'Inter Milan, vient d'être révélée. Comme à son habitude, Pablo Longoria s'active cet été pour renouveler l'effectif de l' OM . Dans cette optique, le secteur offensif a notamment été particulièrement remanié avec les arrivées de Pierre-Emerick Aubameyang , Iliman Ndiaye et Ismaïla Sarr . Mais ce n'est pas encore terminé puisque le club phocéen cherche encore un joueur offensif. Transferts : Guendouzi fait une proposition à l’OM ! https://t.co/rnYEnLBYoA pic.twitter.com/2CVsBOmVaB Bien que l'élimination en Ligue des champions ait marqué un frein sur le mercato de l' OM , Pablo Longoria continue de s'activer en coulisses. Ces derniers jours, RMC Sport révélait même que les discussions avec un ailier gauche étaient avancées. Le nom du joueur n'avait pas encore filtré. Mais il semble bien que son nom soit désormais connu. En effet, selon les informations de Relevo , l' OM s'active pour le transfert de Joaquin Correa que l' Inter Milan souhaite vendre. Gianluca Di Marzio confirme et ajoute même que les contacts son concret entre l'Argentin et le club phocéen qui n'a toutefois pas encore démarré les négociations avec les Nerazzurri .","pubDate":"2023-08-23 19:10:00","image_url":"https://le10static.com/img/cache/article/288x162/0000/0022/227797.jpeg","source_id":"le10sport","source_priority":1001293,"country":["france"],"category":["sports"],"language":"french"},{"title":"Moshiri scrambles to find new Everton investment after MSP blow, talks begin - report","link":"https://www.goodisonnews.com/2023/08/23/farhad-moshiri-enters-talks-with-777-partners-again-after-latest-everton-blow/","keywords":["Boardroom","News","777 Partners","everton","Farhad Moshiri","MSP Sports Capital"],"creator":["Callum O'Connell"],"video_url":null,"description":"Everton owner Farhan Moshiri is trying to find alternatives after MSP Sports Capital pulled out of their minority investment deal, and has reopened talks with 777 Partners, according to The Athletic. The football news outlet shared on 23 August that, with MSP now out of the picture, Moshiri is pushing forward in his attempts to ... The post Moshiri scrambles to find new Everton investment after MSP blow, talks begin - report appeared first on Goodison News.","content":"The football news outlet shared on 23 August that, with MSP now out of the picture, Moshiri is pushing forward in his attempts to find new investment, although whether his talks with 777 go any further than the ones that took place previously remains to be seen. shared on 29 May that 777 were seeking guarantees around Everton’s Premier League status, which of course couldn’t be given, and that the MSP deal was looked upon more favourably by Moshiri. This news comes at a particularly bad time, with Neil Moxley warning the club that every hard-fought point Everton earn in the Premier League could be wiped away if a Premier League investigation into financial irregularities proves its case [ , 20 August]. That report shared concerns around the club’s £430million losses over the past five years, labelling it “bizarre”, while Financial Fair Play issues also hang over the club. Moshiri’s search for extra investment comes at a high point of the criticism surrounding his running of the club, with Everton fans consistently vocal in their displeasure under his ownership. FFP concerns have been the underlying talking point of this transfer window as the club look to recruit players to give them the best possible chance of Premier League survival, but after two losses from two games, those concerns are continuing to grow. Should 777 seek similar assurances to those they initially wanted, it doesn’t look like Moshiri will realistically be able to offer them, in a huge concern for everybody associated with the club.","pubDate":"2023-08-23 19:10:00","image_url":"https://www.goodisonnews.comhttps://www.goodisonnews.com/static/uploads/6/2023/04/Untitled-design-1-1024x703.jpg","source_id":"goodisonnews","source_priority":120305,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Coupe du monde féminine de football : nouveau scandale en Espagne, l'entraîneur surpris en train de toucher la poitrine d'une membre de son staff","link":"https://www.ladepeche.fr/2023/08/23/coupe-du-monde-feminine-de-football-nouveau-scandale-en-espagne-lentraineur-surpris-en-train-de-toucher-la-poitrine-dune-membre-de-son-staff-11411518.php","keywords":["Football"],"creator":null,"video_url":null,"description":"Des images montrent Jorge Vilda en train de toucher la poitrine d'une membre de son staff lors de la victoire de l'Espagne en finale de la Coupe du monde féminine.","content":"Quelques jours après la polémique du baiser forcé de la part du président de la Fédération espagnole de football Luis Rubiales sur la joueuse Jennifer Hermoso, une nouvelle affaire vient gâcher la fête alors que la Roja a récemment décroché la première Coupe du monde de son histoire. Ce mercredi, de nouvelles images de la finale entre l'Espagne et l'Angleterre ont fait surface et démontrent une scène où le sélectionneur espagnol Jorge Vilda touche la poitrine d'une membre de son staff, vraisemblablement lors d'une célébration. La membre du staff n'est autre que Montserrat \"Montse\" Tomé, ancienne joueuse du FC Barcelone et adjointe de Jorge Vilda. Ce dernier, qui travaille également en tant directeur technique pour le football féminin, avait été la cible de nombreuses critiques en septembre dernier de la part de ses joueuses. Quinze d'entre elles, qui confiaient que \"leur santé et leur état émotionnel\" étaient impactés par ses méthodes, avaient menacé de ne plus porter les couleurs de la Roja s'il n'était pas démis de ses fonctions. Finalement, la Fédération avait conforté celui qui tient les rênes de la sélection depuis 2015.","pubDate":"2023-08-23 19:09:23","image_url":"https://images.ladepeche.fr/api/v1/images/view/64e654599e98330a24464efa/standard/image.jpg?v=1","source_id":"ladepeche","source_priority":309204,"country":["france"],"category":["sports"],"language":"french"},{"title":"49ers’ Sam Darnold wins No. 2 quarterback job, Trey Lance could be on move","link":"https://www.eastbaytimes.com/2023/08/23/49ers-sam-darnold-wins-no-2-quarterback-job-trey-lance-could-be-on-move/","keywords":["Latest Headlines","NFL","San Francisco 49ers","Sports","49ers Alert","Inside Sports"],"creator":["Cam Inman"],"video_url":null,"description":"Sam Darnold will be Brock Purdy's backup this season, thus putting Trey Lance's 49ers tenure in further jeopardy as the 2021 draft's No. 3 pick enters his third season.","content":"SANTA CLARA — With Sam Darnold reportedly locking down the 49ers’ No. 2 quarterback job, the team is exploring options on what to do with Trey Lance, a league source said Wednesday. A day earlier, coach Kyle Shanahan said he would consider rotating both Darnold and Lance as the backup to Brock Purdy, who’s made a remarkable recovery from March elbow surgery to retain the starting role he flourished in last season. Rather than retain Lance as the No. 3 quarterback, the 49ers appear willing to part with him after just four starts in two seasons, after they moved up to draft him No. 3 overall in 2021. News of Darnold securing the No. 2 job was first reported by NFL Network, about an hour before practice. Friday marks the 49ers’ final preseason game, a 7 p.m. kickoff against the Los Angeles Chargers at Levi’s Stadium. Brandon Allen has served as the No. 4 quarterback throughout camp but has not taken an 11-on-11 snap since the Aug. 13 preseason opener. In recent days, two quarterback jobs were cleared up around the league, with the Washington Commanders and the Tampa Bay Buccaneers naming Sam Howell and Baker Mayfield as their season-opening starters. The Cincinnati Bengals are navigating their way through the preseason without Joe Burrow (calf). No other starting job appears vacant, so if Lance is acquired elsewhere, it presumably would be as a backup. Lance conceivably could reunite with former 49ers coordinators who are now the head coaches with the Miami Dolphins (Mike McDaniel) and the Houston Texans (DeMeco Ryans), if they’re seeking an upgrade to backup their projected starters in Tua Tagovailoa and C.J. Stroud, respectively. Lance, 23, served as the 49ers season-opening starter last year before sustaining a fractured ankle in the home opener, thrusting Jimmy Garoppolo and eventually Purdy into that job. Lance delivered a fourth-quarter comeback win in Saturday night’s 21-20 preseason victory over the Denver Broncos, but he struggled before that fantastic finish, not just in that game but in the preseason opener at Las Vegas. After attempting just 318 passes at North Dakota State, Lance has thrown just 102 in regular-season action with the 49ers, resulting in 56 completions with five touchdowns and three interceptions. He sprained his knee in losing his career-opening start at Arizona on Oct. 10, 2021, then won his next start, in Week 16 over the Tennessee Titans amid the 49ers’ playoff push. In last season’s rainy opener, Lance and the 49ers fell at Chicago, then he got hurt the next week and required two procedures to repair an ankle that resulted in no further setbacks this offseason. Left guard Aaron Banks exited Tuesday’s practice because of cramps, after losing 14 pounds in Monday’s practice that was somewhat steamy and briefly rainy. “It’s really hard to replenish all that weight and not, the next day, cramp up in practice,” offensive coordinator Chris Foerster said. Banks, who blossomed last year as a first-year starter, is seen by Foerster as performing better in games than practice, which is unusual for linemen. “He’s in great shape. His weight’s been consistent,” Foerster said. “Sometimes in practice he gets worn down and is not as clean, but in games, he’s always fresh and ready to go. I’m really happy with his performance this camp and preseason.” When it comes to the 49ers’ offensive tackle spots, “great” competition exists as to who will back up All-Pro left tackle Trent Williams and right tackle Colton McKivitz, Mike McGlinchey’s replacement. The swing-tackle race is between: Jaylon Moore, Matt Pryor and Leroy Watson IV. Three weeks ago, Moore sustained a bruised knee and that’s lingered to hinder him. Pryor has made strides in recent weeks in practice and with the conditioning of his 6-foot-7, 332-pound frame. Watson played tight end at the University of Texas-San Antonio, “Don’t count Leroy Watson out,” Foerster said. “He’s a young, developing player and has not played a lot of offensive line. He’s got a steeper learning curve. He has really good talent and ability, but he’s a ways away.” Related Articles Roger Craig, the 49ers’ dual-threat running back and an NFL pioneer, again got rejected by Pro Football Hall of Fame voters. He was among 12 senior candidates discussed Tuesday. The three maximum finalists for 2024: Linebacker Randy Gradishar Defensive tackle Steve McMichael Wide receiver Art Powell. Craig is a three-time Super Bowl winner from his 49ers tenure (1983-90) who made four Pro Bowls and, in 1985, became the first player to produce 1,000 yards both rushing and receiving in a season, a feat matched since then by only Marshall Faulk (1999) and Christian McCaffrey (2019). Craig was a Pro Football Hall of Fame finalist in 2010 and 2020 before entering the seniors-candidate pool. Joe Montana, Jerry Rice, and Steve Young are the only 49ers’ offensive players from any of their five Super Bowl-winning teams to make the Pro Football Hall of Fame. The next Niner to make The Hall next year might be linebacker Patrick Willis, a two-time finalist who’ll be in his fifth year of eligibility. Semifinalists figure to be named in three months.","pubDate":"2023-08-23 19:03:21","image_url":"https://www.eastbaytimes.com/wp-content/uploads/2023/08/BNG-L-49ERS-0820-23-1-1.jpg?w=1400px&strip=all","source_id":"eastbaytimes","source_priority":17164,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"49ers’ Sam Darnold wins No. 2 quarterback job, Trey Lance could be on move","link":"https://www.mercurynews.com/2023/08/23/49ers-sam-darnold-wins-no-2-quarterback-job-trey-lance-could-be-on-move/","keywords":["Latest Headlines","NFL","San Francisco 49ers","Sports","49ers Alert","49ers HQ","49ers Training Camp","Football","Inside Sports"],"creator":["Cam Inman"],"video_url":null,"description":"Sam Darnold will be Brock Purdy's backup this season, thus putting Trey Lance's 49ers tenure in further jeopardy as the 2021 draft's No. 3 pick enters his third season.","content":"SANTA CLARA — With Sam Darnold reportedly locking down the 49ers’ No. 2 quarterback job, the team is exploring options on what to do with Trey Lance, a league source said Wednesday. A day earlier, coach Kyle Shanahan said he would consider rotating both Darnold and Lance as the backup to Brock Purdy, who’s made a remarkable recovery from March elbow surgery to retain the starting role he flourished in last season. Rather than retain Lance as the No. 3 quarterback, the 49ers appear willing to part with him after just four starts in two seasons, after they moved up to draft him No. 3 overall in 2021. News of Darnold securing the No. 2 job was first reported by NFL Network, about an hour before practice. Friday marks the 49ers’ final preseason game, a 7 p.m. kickoff against the Los Angeles Chargers at Levi’s Stadium. Brandon Allen has served as the No. 4 quarterback throughout camp but has not taken an 11-on-11 snap since the Aug. 13 preseason opener. In recent days, two quarterback jobs were cleared up around the league, with the Washington Commanders and the Tampa Bay Buccaneers naming Sam Howell and Baker Mayfield as their season-opening starters. The Cincinnati Bengals are navigating their way through the preseason without Joe Burrow (calf). No other starting job appears vacant, so if Lance is acquired elsewhere, it presumably would be as a backup. Lance conceivably could reunite with former 49ers coordinators who are now the head coaches with the Miami Dolphins (Mike McDaniel) and the Houston Texans (DeMeco Ryans), if they’re seeking an upgrade to backup their projected starters in Tua Tagovailoa and C.J. Stroud, respectively. Lance, 23, served as the 49ers season-opening starter last year before sustaining a fractured ankle in the home opener, thrusting Jimmy Garoppolo and eventually Purdy into that job. Lance delivered a fourth-quarter comeback win in Saturday night’s 21-20 preseason victory over the Denver Broncos, but he struggled before that fantastic finish, not just in that game but in the preseason opener at Las Vegas. After attempting just 318 passes at North Dakota State, Lance has thrown just 102 in regular-season action with the 49ers, resulting in 56 completions with five touchdowns and three interceptions. He sprained his knee in losing his career-opening start at Arizona on Oct. 10, 2021, then won his next start, in Week 16 over the Tennessee Titans amid the 49ers’ playoff push. In last season’s rainy opener, Lance and the 49ers fell at Chicago, then he got hurt the next week and required two procedures to repair an ankle that resulted in no further setbacks this offseason. Left guard Aaron Banks exited Tuesday’s practice because of cramps, after losing 14 pounds in Monday’s practice that was somewhat steamy and briefly rainy. “It’s really hard to replenish all that weight and not, the next day, cramp up in practice,” offensive coordinator Chris Foerster said. Banks, who blossomed last year as a first-year starter, is seen by Foerster as performing better in games than practice, which is unusual for linemen. “He’s in great shape. His weight’s been consistent,” Foerster said. “Sometimes in practice he gets worn down and is not as clean, but in games, he’s always fresh and ready to go. I’m really happy with his performance this camp and preseason.” When it comes to the 49ers’ offensive tackle spots, “great” competition exists as to who will back up All-Pro left tackle Trent Williams and right tackle Colton McKivitz, Mike McGlinchey’s replacement. The swing-tackle race is between: Jaylon Moore, Matt Pryor and Leroy Watson IV. Three weeks ago, Moore sustained a bruised knee and that’s lingered to hinder him. Pryor has made strides in recent weeks in practice and with the conditioning of his 6-foot-7, 332-pound frame. Watson played tight end at the University of Texas-San Antonio, “Don’t count Leroy Watson out,” Foerster said. “He’s a young, developing player and has not played a lot of offensive line. He’s got a steeper learning curve. He has really good talent and ability, but he’s a ways away.” Roger Craig, the 49ers’ dual-threat running back and an NFL pioneer, again got rejected by Pro Football Hall of Fame voters. He was among 12 senior candidates discussed Tuesday. The three maximum finalists for 2024: Linebacker Randy Gradishar Defensive tackle Steve McMichael Wide receiver Art Powell. Craig is a three-time Super Bowl winner from his 49ers tenure (1983-90) who made four Pro Bowls and, in 1985, became the first player to produce 1,000 yards both rushing and receiving in a season, a feat matched since then by only Marshall Faulk (1999) and Christian McCaffrey (2019). Craig was a Pro Football Hall of Fame finalist in 2010 and 2020 before entering the seniors-candidate pool. Joe Montana, Jerry Rice, and Steve Young are the only 49ers’ offensive players from any of their five Super Bowl-winning teams to make the Pro Football Hall of Fame. The next Niner to make The Hall next year might be linebacker Patrick Willis, a two-time finalist who’ll be in his fifth year of eligibility. Semifinalists figure to be named in three months.","pubDate":"2023-08-23 19:03:21","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/08/BNG-L-49ERS-0820-23-1.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Aston Villa sent transfer demand after dominant Europa Conference League display vs Hibs","link":"https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-sent-transfer-demand-27581044","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Amie Wilson)"],"video_url":null,"description":"The latest Aston Villa news as Unai Emery's side came out as comfortable 5-0 winners over the Scottish side in the first leg of their play-off tie","content":"Aston Villa fans have given their response to a comfortable win over Hibernian in the Europa Conference League play-off first leg. Villa made the journey up to Scotland looking to take the advantage into the second leg of the tie. A win over the two legs would see Villa book their place in the group stages of the competition. An Ollie Watkins hat-trick was added to by a Leon Bailey goal and a Douglas Luiz penalty to effectively seal the side’s place in the group stages, with 90 minutes of the tie left to play as Villa came out as 5-0 winners. READ MORE: Aston Villa player ratings vs Hibernian: Ollie Watkins and Lucas Digne shine in 5-0 win READ MORE: Hibernian 0-5 Aston Villa LIVE: Highlights and player ratings from Easter Road One of the main creative players for Villa was full-back Lucas Digne , who played a big part in a few of the goals. The Frenchman has been linked with a move away from Villa Park this summer. After the game, Villa fans took to social media to give their reaction, with many pointing to the performance of Digne amid talks over his future. Here’s what some just said... Jay Johnson: Easy does it! Dan Reynolds : Hibs were terrible. But we’ve lost to plenty of terrible sides in cup competitions over the years. Its a pleasure watching this team play football. Chris Stanley : Tie's done, no injuries. Perfect. Well done, Villa. Garin : Perfect first leg performance & we didn’t even get out of 2nd gear, top class. Karl Bolton : Great professional display by Villa tonight. Dominated without getting out of 2nd gear. Won’t the tie in the first leg. Got few more mins in players legs. Good job all round. Jamie Gray : Too easy, and in 2nd gear. What’s beautiful tho is that, even acknowledging how poor the opposition are, is that we’re playing levels of football that were incomprehensible until recent times, and I’m all in on it. Michael Priest : It’s good to be back in European competition! Dale : really professional today.. If we have to move Digne on to fund moves fir attackers then fair enough but if we don't have to he should be staying. Mike Land : I really hope we actually keep Digne around and invest money elsewhere - last two displays he has been class! If he goes then good luck to him but I would like to see money to be used elsewhere tbh. What did you think of the performance vs Hibernian? Tell us in the comments section","pubDate":"2023-08-23 19:01:43","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article27580710.ece/ALTERNATES/s615/0_Hibernian-v-Aston-Villa-UEFA-Europa-Conference-League-Play-Offs-First-Leg-Easter-Road.jpg","source_id":"birminghammail","source_priority":57681,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Today’s Radio Sports Page 8/23/23","link":"https://www.kniakrls.com/2023/08/23/todays-radio-sports-page-8-23-23/","keywords":["Today's Radio Sports Page","Today’s Local Sports"],"creator":["Spencer Dirks"],"video_url":null,"description":"On today’s (8/23) Radio Sports Page… Let’s get to know Pella volleyball player Kyli Hiemstra Andrew Swadner catches up with Simpson Women’s Soccer coach Katie Berglund Let’s get to know Pella Christian football player John Boender Today’s","content":"On today’s (8/23) Radio Sports Page… Let’s get to know Pella volleyball player Kyli Hiemstra Andrew Swadner catches up with Simpson Women’s Soccer coach Katie Berglund Let’s get to know Pella Christian football player John Boender Today’s Radio Sports Page airs during the 8 a.m., 1 p.m., and 4 p.m. news magazines on KNIA/KRLS, and will be available daily online at KNIAKRLS.com and on our podcasts. Podcast: Play in new window | Download Subscribe: Apple Podcasts | Google Podcasts | Spotify | RSS | More","pubDate":"2023-08-23 19:00:31","image_url":"https://media.blubrry.com/iowaradioplus/ins.blubrry.com/iowaradioplus/Today_s_Radio_Sports_Page_8-23-23.mp3","source_id":"kniakrls","source_priority":60909,"country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Karim Benzema ‘faces being frozen out by his Saudi club’ as former Tottenham boss leaves fans in disbelief","link":"https://www.thescottishsun.co.uk/sport/football/11134207/karim-benzema-al-ittihad-tottenham-nuno-espirito-santo/","keywords":["Football","Sport"],"creator":["Dylan Terry"],"video_url":null,"description":null,"content":"KARIM BENZEMA could be dropped by Al-Ittihad due to a \"tense conflict\" with manager Nuno Espirito Santo. The Ballon d'Or winner, 35, joined the Saudi Arabian club back in June after departing Real Madrid . 3 Karim Benzema could be outcast by Al-Ittihad boss Nuno Espirito Santo Credit: Getty 3 Ex-Spurs boss Nuno and star striker Benzema are reportedly not seeing eye to eye Credit: Getty 3 He kicked off life in the Middle East with three goals in four games in the Arab Club Champions Cup. However, the £3.3million-a-week star has failed to hit the back of the net in their opening two league matches - both of which Al-Ittihad won. According to Saudi outlet Asharq Al-Aswat , Nuno is considering axing Benzema from his starting line-up. Relations between the Real Madrid legend and the ex- Tottenham head coach are reportedly \"tense\". Nuno is not thought to be a fan of Benzema's style of play and it is understood it was not his decision to sign the Frenchman. Meanwhile, Benzema is said to have complained about \"being treated unprofessionally by his coach\". And a situation surrounding the club captaincy has strained relations further. Benzema had agreed to be skipper as part of his transfer negotiations with Al-Ittihad - who won the Saudi Pro League title under Nuno last season. Most read in Football TOP TIER Celtic now FAVOURITES to secure sensational Kieran Tierney transfer return OUT THE HAT Reo Hatate REJECTS new Celtic contract in huge blow to Brendan Rodgers END OF THE ROAD Nicola Sturgeon stripped of £600k VIP police security amid cash 'row' BANNER BLAST Rangers ultras unveil tifo with words from banned sectarian anthem CASINO SPECIAL - BEST ONLINE CASINOS FOR 2023 But following his arrival, Nuno then gave club legend Romarinho the armband. And friction between Benzema and his manager have led to the striker reportedly failing to show up for training. It is understood something needs to be done to fix the issue and Benzema is in danger of being frozen out if it cannot be resolve. Meanwhile, fans have been left stunned by the situation. One social media user said: \"If a 5x champions league winner doesn’t fit into his style, then maybe Nuno has no style.\" Another added: \"Benzema can win any team a trophy, they’re missing out.\" A third replied: \"If Benzema doesn’t fit in your tactical style, you have no tactics.\" While a fourth responded: \"He’s your best player. Find a way to build the team around him, Nuno.\" Benzema scored 354 goals in 648 games across a stunning 14-year stint with Real Madrid. Read more on the Scottish Sun SHOP PLANS Primark set to open huge new store at Glasgow shopping centre FROCK NO I thought I’d found dream wedding guest dress - but it’s completely see through The plethora of trophies he won at the Bernabeu included four LaLiga titles and five Champions Leagues. He also earned 97 caps for France, netting 37 goals.","pubDate":"2023-08-23 19:00:02","image_url":null,"source_id":"thescottishsun","source_priority":31532,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"A small (but major) tweak would spare the AFL another ‘mistake of consequence’","link":"https://www.brisbanetimes.com.au/sport/afl/a-small-but-major-tweak-would-spare-the-afl-another-mistake-of-consequence-20230823-p5dyxv.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Paddy Sweeney"],"video_url":null,"description":"The AFL’s current goal review system is broken, despite head honchos in the Docklands office telling us otherwise.","content":"A “mistake of consequence” was how outgoing AFL chief executive Gillon McLachlan described the complete farce which unfolded on Saturday night, when Ben Keays’ goal was deemed a point, ultimately costing Adelaide victory over Sydney and ending the Crows’ hope of playing finals football. The league’s boss was quick to own the mistake at his Sunday morning press conference, but stopped short of admitting any major flaws or issues with the goal review system, stating that if the goal umpire reviewed Keays shot on goal, it would have been overturned. Ben Keays celebrating what he thought was a goal, before it was called as a behind. Credit: Getty Images While McLachlan had little option but to apologise, the Crows were left seething as club chief executive Tim Silvers labelled it the biggest matchday error in 20 years. The problem is that the AFL’s current system is broken, despite head honchos in the Docklands office telling us otherwise. Why so, some will ask? Plain and simple, the only reason for its existence is to get decisions right. And if it can’t complete its only task, then it’s in need of a drastic overhaul. And there are multiple ways to not only minimise the chances of this catastrophic blunder occurring again, but even better, completely ruling it out altogether. Currently, only goals are reviewed, prior to the re-start back in the middle of the ground. McLachlan pointed to the time taken as not practical to the “ebb and flow” of the game for a reason to not review behinds. Loading In a similar way to soccer, there’s no rationale why the AFL can’t and shouldn’t review close calls while play continues, before informing umpires if a wrong decision has been made. The so-called “ebb and flow” of the game isn’t impacted, while the correct decision can be reached. This wouldn’t need to happen at every behind, just those where there’s an element of doubt. And it wouldn’t take long to be conclusive. After all, vision captured on an iPhone 10 metres behind the fence on Saturday night was able to determine Keay’s kick was clearly a goal. A major boost in investing in the right technology would also make a huge improvement. For years, the AFL has been reluctant to properly tip in the coin to upgrade appropriate equipment, aiding umpires to ultimately make the right calls. The league will no doubt look into expanding its use of ball chip technology this off-season, which will assist in determining whether the ball hits any part of the post, padding or player on the way through. While a captain’s call, as we see in the NRL and cricket, can also potentially rectify the human errors like we witnessed on Saturday, a simple rule change could almost certainly be foolproof against almost all issues. The AFL should give serious thought to the idea that if the ball hits the post and goes through the goals, then it’s a goal. Yes, this would be a big call to change the scoring system we’ve known since the game’s inception. However, there’s almost zero chance of a blunder occurring. The AFL loves to tinker with the rules in a bid to assist the game against certain trends. This year the “stand” rule was introduced for the player on the mark, with the idea of making the game move quicker by preventing the person on the mark from guarding the mark. Loading The rule changes are often put in place to improve scoring, reduce congestion, but overall, the goal is to enhance the product. At present, on the eve of the finals series, trust in the current system is at an all-time low. By implementing a new definition of a goal, accuracy is greatly enhanced, while problems are eradicated. The need for the AFL to make massive technological improvements is reduced, ultimately keeping their dollars and cents. And for that reason alone, it makes sense. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 Opinion Adelaide Crows Paddy Sweeney is a Nine News Perth sports presenter and journalist. Most Viewed in Sport Loading","pubDate":"2023-08-23 19:00:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"}]}