{"newsArray":[{"article_id":"ca7cf57fa1f3b6b37311c7111d425d94","title":"NFF drums support for Osimhen for Ballon D’or","link":"https://dailytrust.com/nff-drums-support-for-osimhen-for-ballon-dor/","keywords":["Sports"],"creator":["Olusola Jide Jide"],"video_url":null,"description":"…As Super Eagles drop in latest FIFA rankings The Nigeria Football Federation (NFF) has taken to social media to drum up support for Super Eagles striker, Victor Osimhen to win the 2023 FIFA Best Player award. The NFF posted on their Facebook page a clarion call to Nigerians to vote one of their own while […]","content":"…As Super Eagles drop in latest FIFA rankings The Nigeria Football Federation (NFF) has taken to social media to drum up support for Super Eagles striker, Victor Osimhen to win the 2023 FIFA Best Player award. The NFF posted on their Facebook page a clarion call to Nigerians to vote one of their own while sharing a link. “Vote for your own, Victor Osimhen,” the NFF post read. It will be recalled that Osimhen was nominated alongside 11 other players for the prestigious FIFA Best Award after leading Napoli to clinch the Serie A title, marking a historic moment as the club’s first triumph in 33 years. The Nigerian striker was at the forefront, leading the lines with his incredible skills and scoring a whopping 26 goals in the Serie A which earned him the coveted title of the league’s top scorer and the best striker award. Notably, Osimhen’s achievement made history as he became the first African player in the 125-year history of Serie A to be named the best forward in Italy. In the same vein, Super Eagles head coach Jose Peseiro has insisted that Osimhen can win the Ballon d’Or. Peseiro, in a recent interview, (via II Napoli Online) proclaimed that Osimhen has all it takes to win the prestigious award. “He (Osimhen) can surely win the Ballon d’Or in the future. He’s not lacking anything to do it. He has different characteristics than other players that are at the top at this moment, but he scores a lot as well.” Meanwhile, the Super Eagles have now dropped to 6th position in Africa and 40th in the world in the latest FIFA September Rankings. They stay behind only the Atlas Lions of Morocco, the Teranga Lions of Senegal, the Carthage Eagles of Tunisia, the Desert Foxes of Algeria and Pharaohs of Egypt.","pubDate":"2023-09-21 23:54:54","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"b3e5ea707f3288594c6e30fe181e16d0","title":"Fans rue absence of Kwara football team at National Youth Games","link":"https://dailytrust.com/fans-rue-absence-of-kwara-football-team-at-national-youth-games/","keywords":["Sports"],"creator":["Mumini AbdulKareem, Ilorin"],"video_url":null,"description":"Football fans and enthusiasts in Kwara State have continued to rue the absence of the state football team at the ongoing 7th National Youth Games in Asaba, Delta State. Executive chairman of Kwara Sports Commission (KSC), Bola Mogaji, had removed all ball games except handball from the list of events to be participated in by […]","content":"Football fans and enthusiasts in Kwara State have continued to rue the absence of the state football team at the ongoing 7th National Youth Games in Asaba, Delta State. Executive chairman of Kwara Sports Commission (KSC), Bola Mogaji, had removed all ball games except handball from the list of events to be participated in by the state’s contingent which departed on Wednesday. He said the decision was dictated by Kwara’s area of strength and paucity of funds. According to him, Kwara will be fielding 215 contingents consisting of 132 athletes and 83 officials in 18 events. Reacting to the decision of the Chairman, Adex Adeyemi said “How do you conclude that soccer is not Kwara’s area of strength when the players weren’t even sponsored to Jos for the qualifying playoffs. “Kwara’s Under 15 team tipped to represent the state posted five star performances before the regional playoff”, the sports enthusiasts added. On his part, a former technical adviser of the Kwara Football Academy (KFA), Coach Paul Odey, said the situation is unfortunate. “I confronted the sports commission chairman about this and he said he believes in coaches having players on ground as a team and training them not waiting for when the festival is around the corner, you start bringing players. “But I told him that these players are in their various grassroots clubs playing so many competitions. You have to go out, pick them and bring them together since they already have the skills and technique. Kwara should not allow such to happen again”, he said. The Kwara football team is the defending champion in soccer at the NYG after winning gold at the last edition.","pubDate":"2023-09-21 23:54:39","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e4237d823f6930782939b76d9b346a89","title":"Saints look to remain unbeaten as they visit Lambeau Field in Packers’ home opener","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/saints-look-to-remain-unbeaten-as-they-visit-lambeau-field-in-packers-home-opener","keywords":["NFL"],"creator":["The Associated Press"],"video_url":null,"description":"NEW ORLEANS (2-0) at GREEN BAY (1-1) Sunday, 1 p.m. EDT, FOX OPENING LINE: Packers by 2, according to FanDuel Sportsbook Green Bay Packers defensive tackle Kenny Clark, left, and […]","content":"NEW ORLEANS (2-0) at GREEN BAY (1-1) Read this article for free: Already have an account? To continue reading, please subscribe: * NEW ORLEANS (2-0) at GREEN BAY (1-1) Sunday, 1 p.m. EDT, FOX OPENING LINE: Packers by 2, according to FanDuel Sportsbook AGAINST THE SPREAD: Saints 2-0, Packers 1-1 SERIES RECORD: Packers lead 17-10 LAST MEETING: Saints won 38-3 on Sept. 12, 2021, at Jacksonville, Florida. LAST WEEK: Saints won 20-17 at Carolina on Monday; Packers lost 25-24 at Atlanta on Sunday. PACKERS OFFENSE: OVERALL (26), RUSH (25), PASS (23), SCORING (2) SAINTS OFFENSE: OVERALL (10), RUSH (18), PASS (8), SCORING (25) PACKERS DEFENSE: OVERALL (27), RUSH (30), PASS (17), SCORING (14) SAINTS DEFENSE: OVERALL (4), RUSH (14), PASS (7), SCORING (T5) TURNOVER DIFFERENTIAL: Saints plus-1, Packers plus-3 SAINTS PLAYER TO WATCH: Chris Olave, a 2022 first-round draft choice out of Ohio State, has emerged as New Orleans’ top receiver and has been its best overall offensive playmaker during star running back Alvin Kamara’s three-game suspension. He has 14 catches for 198 yards through two games, with a 40-plus-yard reception in each game. Olave could end up seeing a lot of Green Bay’s Jaire Alexander, a two-time Pro Bowl cornerback who will be seeking to bounce back from a subpar performance in Atlanta. PACKERS PLAYER TO WATCH: QB Jordan Love leads the NFL in passer rating early in his first full season as a starter, but he’s only completing 55.8% of his passes. His inexperience showed in Green Bay’s previous game, as he went 0 for 6 in the fourth quarter as the Packers failed to get a first down and squandered a 24-12 lead. Now he gets ready for his first regular-season home start. KEY MATCHUP: Packers offensive line vs. Saints defensive line: An injury to left guard Elgton Jenkins and the uncertainty of left tackle David Bakhtiari’s health status create plenty of questions for the Packers as they face off with a potent Saints front. New Orleans’ Carl Granderson has 2 1/2 sacks through the first two games of the season, and Cameron Jordan is an eight-time Pro Bowl selection. KEY INJURIES: Saints RB Jamaal Williams (hamstring) isn’t expected to play Sunday. … Saints TE Foster Moreau is dealing with an ankle injury. … Saints rookie RB Kendre Miller is expected to make his debut Sunday after missing two games with a hamstring injury. … Jenkins is out for the Packers with a sprained medial collateral ligament. … Bakhtiari missed the Falcons game with lingering knee issues that have limited him the past few years. … Packers WR Christian Watson (hamstring) has missed Green Bay’s first two games. … Packers RB Aaron Jones (hamstring) missed the Falcons game. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. SERIES NOTES: Although the Packers lead the series 17-10, the Saints have won three of the past four meetings. Their most recent matchup — a Saints 38-3 victory in the opening week of the 2021 season — was moved from New Orleans to Jacksonville because of the impact of Hurricane Ida. Love made his NFL debut that day, as he came in for Aaron Rodgers after the Saints had put the game out of reach. The Packers’ previous win over the Saints was a 37-30 victory at New Orleans on Sept. 27, 2020. The previous time the Saints played at Lambeau Field, they won 26-17 on Oct. 22, 2017. The Saints and Packers held joint practices in Green Bay last year. This marks the fourth time the Packers have opened their home schedule against the Saints. They won their three previous home openers in this series. STATS AND STUFF: The Saints have allowed 20 points or fewer in each of their past 10 games, the longest active streak of any NFL team. … The Saints are trying to start 3-0 for the first time since 2013, when they began 5-0. … The Saints’ 30-12 road record since 2018 leads the NFC and ranks behind only the Kansas City Chiefs’ 32-9 road mark among NFL teams. … The Saints haven’t scored a first-half TD this season and have just three total TDs in two games. … Saints S Marcus Maye will be serving the first of a three-game suspension in Week 3. … Saints RB Alvin Kamara will be serving the last of a three-game suspension. … Olave is one of three NFL players (along with Justin Jefferson and Puka Nacua) with at least 85 yards receiving in each of the first two weeks. … Saints CB Paulson Adebo had his first-career fumble recovery in Week 2. … Both teams have rookie kickers. New Orleans’ Blake Grupe has made all of his first five field-goal attempts and all three of his extra points. Green Bay’s Anders Carlson is 2 of 2 on field-goal attempts — including a 52-yarder — and 8 of 8 on extra points. … The Packers’ 27-6 regular-season home record since 2018 leads all NFL teams. … The Packers have won their past 10 home openers, the NFL’s longest active streak. … The Packers haven’t committed a turnover through their first two games. … WR Jayden Reed is the second Packer since the AFL-NFL merger to have multiple touchdown catches in one of his first two games as a pro. The other was James Lofton in 1978. … Packers LB Quay Walker scored on a 37-yard interception return in Green Bay’s season-opening victory at Chicago and followed that up by making a career-high 17 tackles in the loss to the Falcons. FANTASY TIP: The flurry of running back injuries across the league could make it worth picking up Saints RB Tony Jones Jr. at least as a one-week stopgap. Jones had two touchdown runs after Williams got hurt in the Panthers game. He could have a big game against Green Bay’s vulnerable run defense, which allowed 211 yards rushing against the Falcons. One note of caution is that Miller’s return from a hamstring injury could enable the rookie to cut into Jones’ potential workload. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:42:45","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"f8c1df5af8054dd007e274887b459c50","title":"Chargers-Vikings game puts Staley-O’Connell friendship on hold with both teams at 0-2","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/chargers-vikings-game-puts-staley-oconnell-friendship-on-hold-with-both-teams-at-0-2","keywords":["NFL"],"creator":["Dave Campbell, The Associated Press"],"video_url":null,"description":"MINNEAPOLIS (AP) — Kevin O’Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. There’s […]","content":"MINNEAPOLIS (AP) — Kevin O'Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. Read this article for free: Already have an account? To continue reading, please subscribe: * MINNEAPOLIS (AP) — Kevin O’Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. There’s been no space or time for sharing this week. The two friends, now head coaches, are facing each other with both of their teams having stumbled to an 0-2 start. “I do know how ultimately competitive he is, and he knows the same thing about me,” said O’Connell, who’s in his second season with the Minnesota Vikings after two years as offensive coordinator of the Rams. “I care about him tremendously. I think he’s a great football coach and is somebody who I respect as much as anybody in this league.” Staley only spent one season as the Rams’ defensive coordinator before his big break with the Los Angeles Chargers in 2021. After guiding them to 10 wins in his second year, they blew a 27-point lead in a loss to Jacksonville in the wild-card round to put his job status in question. The Chargers opened by losing to Miami and Tennessee by a combined five points, making Staley the betting favorite to be the first head coach fired this season. Only four teams since the NFL expanded the field in 1990 have started 0-3 and still made the playoffs. O’Connell and Staley can thus be forgiven for tabling the pleasantries this week. “He’s like a brother to me, but we’re going head-to-head on Sunday, so our friendship is going to be a distant second to us winning and losing,” Staley said. “I just have the utmost respect for him as a leader, as a coach. He’s one of the top coaches that I’ve ever worked with. He’s one of the top play-callers that I’m going to have to go against.” The staff under Sean McVay with the Rams, who won the Super Bowl after the 2021 season, was full of head coach potential with O’Connell and Staley as the top lieutenants. “They’re both geniuses in their own right,” said Chargers defensive tackle Sebastian Joseph-Day, who played for the Rams in 2020 when both O’Connell and Staley were there. Staley reflected this week on how scheming against O’Connell in practice that year sharpened his skill. “That was one of the things that was, for us, such a special part of that experience,” Staley said. “We had some of the top players in the league to coach, and there was just that special environment. Each day, you had to be on it. You had to perform.” STILL SOARING The Vikings lost to Tampa Bay and Philadelphia by a combined nine points, thanks largely to a league-leading seven turnovers that have overshadowed the continued brilliance of Justin Jefferson. He can become the first receiver in NFL history with three straight 150-yard games to start a season. That would give him 11 such games for his career, the most through a player’s first four years in the league. Jefferson would also with 150 yards break Wes Welker’s 2011 record with the most receiving yards in history at the three-game mark. Perhaps the most impressive feat for Jefferson so far is that he’s played on 121 of 122 snaps. “I just don’t want to miss out on any opportunities. The majority of times when I do come out, we pass the ball,” Jefferson said, smiling. “I want to put full force on my matchups. I want to stay in the game just like they stay in the game.” AIR RAIDED The Chargers have had plenty of coverage trouble through games. Michael Davis has yielded a league-high three touchdowns. Asante Samuel has allowed receptions all six times he has been targeted. Jefferson also leads the NFL in receptions (31) and yards (681) on passes with a 50% or lower completion probability since the start of last season. In 2021 against the Chargers, he had two catches for 54 yards with a 50% or lower completion probability. “He may make a play or two, but you’ve got to get back in the huddle and keep playing against guys like that,” safety Derwin James said. KEYBOARD WARRIORS After had one of Minnesota’s four lost fumbles against the Eagles and netted only 28 yards on eight carries, Alexander Mattison was sickened by the social media backlash he encountered after the game. More than 60 messages directed toward him on Instagram contained enough hateful, racist and violent words for him to speak out against such harassment. “There’s a lot of fantasy football people out there, and they think that it’s all fun and games,” Mattison said. “We have families. We have people that love us. We have people that we’re doing this for. It’s not fantasy. This is real life.” STAYING GROUNDED The Vikings have struggled to get their ground game going, prompting the acquisition of running back Cam Akers from the Rams. Running plays have been a problem for the Vikings on the other side of the ball, too. They gave up 259 rushing yards to the Eagles, getting trampled by D’Andre Swift down the stretch when a stop or two could’ve translated into a comeback victory. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. The Chargers rushed for 234 yards in their opening loss to the Dolphins, when Austin Ekeler suffered an ankle sprain that kept him out against the Titans. Joshua Kelley would start if Ekeler is sidelined again. ___ AP Sports Writer Joe Reedy in Costa Mesa, California, contributed to this report. ___ AP NFL: https://apnews.com/hub/NFL Advertisement Advertisement","pubDate":"2023-09-21 23:22:59","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"bf945df501d0177cd3bcf33126f974a0","title":"Browns hope to keep moving without Nick Chubb as they start anew against Derrick Henry, Titans","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/browns-hope-to-keep-moving-without-nick-chubb-as-they-start-anew-against-derrick-henry-titans","keywords":["NFL"],"creator":["Tom Withers, The Associated Press"],"video_url":null,"description":"CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the […]","content":"CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the recent history of their opponent Sunday to know that everything could turn out OK. Read this article for free: Already have an account? To continue reading, please subscribe: * CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the recent history of their opponent Sunday to know that everything could turn out OK. Tennessee has been there, done that. Two years ago, the Titans lost All-Pro Derrick Henry halfway through the season with a broken foot. Not only did Tennessee survive the rest of the way without its rampaging running back, the Titans somehow flourished, finishing 12-5 and as the No. 1 seed in the AFC playoffs. The Titans (1-1) didn’t panic after losing Henry, who was on his way to another rushing title. The Browns (1-1) can only hope to be as stoic without Chubb, the four-time Pro Bowler who suffered a season-ending and career-threatening left knee injury Monday night in Pittsburgh. The sight of seeing Chubb in tears while being carted off shook many of his teammates. It was the kind of moment that can define a season. “You can’t replace 24,” Browns All-Pro guard Joel Bitonio said, referring to Chubb’s number. “But I think we have pieces that we can try and put together, a puzzle that can look similar to what we did with Nick.” The Titans were in a similar scramble mode in 2021 after Henry went down. But Tennessee stuck with its run-first, run-often offensive approach, and with Dontrell Hilliard and D’Onta Foreman filling in, the Titans finished fifth in the league, averaging 141.5 yards rushing per game. Cleveland defensive coordinator Jim Schwartz watched it. He was a senior advisor in Tennessee that season, and was impressed with how Titans coach Mike Vrabel failed to let Henry’s loss overwhelm his team. “He stays the course,” Schwartz said of Vrabel. “He’s very resilient that way, and it flowed over to the team. Part of that job of the head coach is to make sure everybody knows, ‘Hey, it’s going to be OK, we have a plan, we have good players behind.’” The Browns didn’t have much time to process losing Chubb, who was injured in the second quarter of a 26-22 loss to the Steelers. Second-year back Jerome Ford came in and caught a 3-yard TD pass one play after Chubb’s horrific injury. A fifth-round pick from Cincinnati who began his college career at Alabama, Ford later ripped off a 69-yard run and finished with 106 yards on 16 carries. Coach Kevin Stefanski plans to use Ford as his feature back, and the Browns brought in some insurance this week by re-signing Kareem Hunt, who spent four seasons in a tandem with Chubb before Cleveland elected not to retain him. While the personnel might be different, the Titans don’t expect the Browns to stray from their ground game. “It don’t really matter who’s back there,” said two-time Pro Bowl defensive lineman Jeffery Simmons. “You know they trust their offensive linemen. At the end of the day, it’s about how are we going to be able to hold up against their offensive line against the run game.” WHERE’S WATSON? The Browns are still waiting for Deshaun Watson to play like an elite, $230 million quarterback. To this point, he has been an average player with an above average contract. In eight starts over two seasons, Watson is 4-4 with nine touchdowns, seven interceptions and not nearly as many dazzling, highlight-reel type plays as expected. He’s coming off a rough performance at Pittsburgh that did nothing to quiet his critics, and after two games he’s 31st in completion percentage (55.1) and 30th in rating (69.1). Still, Vrabel, who spent a season with Watson in Houston, knows how dangerous he can be from any spot on the field. “He extends plays,” he said. “He’s got great play strength in the pocket to wait out receivers, to get him through to the second window, extends plays. Got length, stiff arm and will scramble and can run to get what he needs to get to, can throw the ball to all parts of the field.” GROUP PLAN Henry has only rushed for 140 yards through two games, but it’s only a matter of time before he gets rolling. Once he does, look out. At 6-foot-3, 250 pounds, there’s few more intimidating sights than Henry at full speed. “He’s a guy that you can stop nine times in a row and in the 10th time he can go 90 yards for a touchdown,” Schwartz said. “We’re going to tackle well, we’re going to have to be physical and we’re going to have to get hats to the ball. Tackling Derrick Henry isn’t a 1-on-1 thing, it’s an 11-on-1 thing and we have to have that mentality going in.” FAMILIAR FACE Along with Vrabel, most of the Titans know Watson well after facing him twice a year as AFC South rivals. Two-time All-Pro safety Kevin Byard knows better than to underestimate him. “He’s playing a different style of offense,” Byard said. “They’re going to run the ball more, but he likes taking shots down the field. So I think first and foremost for our defense, we’ve got to stop the run and on the second half just really just making sure that we’re defending those deep shots.” POCKET PROTECTOR The Titans aren’t doing enough to keep quarterback Ryan Tannehill upright. Only six teams have allowed more sacks than the Titans with Tannehill being taken down eight times, including five last week by the Los Angeles Chargers. One of those was the fastest sack by a defender this season as Kenneth Murray needed only 2.31 seconds to get the Titans quarterback. Tennessee’s offensive line already had four new starters before rookie left guard Peter Skoronski had an appendectomy Sept. 16. Vrabel knows the Titans’ front five have their hands full this week against a rebuilt Cleveland defensive line led by All-Pro end Myles Garrett. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. “I don’t think there’s too many guys walking the earth like Myles Garrett,” Vrabel said. “So we’ll be in for a huge challenge.” ___ AP Sports Writer Teresa Walker in Nashville, Tennessee, contributed. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:15:45","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"483af6cebea6e47b9fea21d906d227fd","title":"Unai Emery urges Aston Villa to adapt quickly to demands of European football","link":"https://www.newsr.in/n/Sports/1zpnjb4bhv/Unai-Emery-urges-Aston-Villa-to-adapt-quickly.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Unai Emery insists Aston Villa must learn how to handle European football and refused to blame his changes after their sloppy 3-2 defeat at Legia Warsaw. Ernest Muci’s second-half winner clinched a deserved victory for the hosts to ruin Villa’s Europa Conference League debut. Jhon Duran and ... Reported by SoccerNews.com 30 minutes ago.","content":"Thursday, 21 September 2023 ( 3 hours ago ) Unai Emery insists Aston Villa must learn how to handle European football and refused to blame his changes after their sloppy 3-2 defeat at Legia Warsaw. Ernest Muci’s second-half winner clinched a deserved victory for the hosts to ruin Villa’s Europa Conference League debut. Jhon Duran and Lucas Digne twice levelled for the underwhelming visitors […] 👓 View full article","pubDate":"2023-09-21 23:13:07","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6f5aa161824729ab55024934de1bbaa9","title":"Premier League fantasy football tips: Is it time to play your wildcard?","link":"https://www.newsr.in/n/Sports/1zpnjb4bhp/Premier-League-fantasy-football-tips-Is-it-time.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Will you stick or twist when it comes to playing your fantasy football wildcard? Alistair Bruce-Ball previews gameweek six. Reported by BBC Sport 31 minutes ago.","content":"Thursday, 21 September 2023 ( 1 hour ago ) Will you stick or twist when it comes to playing your fantasy football wildcard? Alistair Bruce-Ball previews gameweek six. 👓 View full article","pubDate":"2023-09-21 23:12:37","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"ae3b0f392aa75cba209a4adc5bb8080a","title":"Surprising Buccaneers face defending NFC champion Eagles in prime-time matchup of unbeaten teams","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/surprising-buccaneers-face-defending-nfc-champion-eagles-in-prime-time-matchup-of-unbeaten-teams","keywords":["NFL"],"creator":["The Associated Press"],"video_url":null,"description":"PHILADELPHIA (2-0) at TAMPA BAY (2-0) Monday, 7:15 p.m. EDT, ABC FANDUEL SPORTSBOOK NFL LINE: Eagles by 5 1/2. Tampa Bay Buccaneers quarterback Baker Mayfield (6) throws a pass during […]","content":"PHILADELPHIA (2-0) at TAMPA BAY (2-0) Read this article for free: Already have an account? To continue reading, please subscribe: * PHILADELPHIA (2-0) at TAMPA BAY (2-0) Monday, 7:15 p.m. EDT, ABC FANDUEL SPORTSBOOK NFL LINE: Eagles by 5 1/2. AGAINST THE SPREAD: Philadelphia 2-0; Tampa Bay 2-0. SERIES RECORD: Buccaneers lead 11-10, including postseason. LAST MEETING: Buccaneers beat Eagles 31-15 on Jan. 16, 2022, in NFC wild-card game in Tampa, Fla. LAST WEEK: Eagles beat Vikings 34-28 in Philadelphia; Buccaneers defeated Bears 27-17 at home. EAGLES OFFENSE: OVERALL (11), RUSH (2), PASS (29), SCORING (5). EAGLES DEFENSE: OVERALL (26), RUSH (1), PASS (31), SCORING (16). BUCCANEERS OFFENSE: OVERALL (13), RUSH (19), PASS (9), SCORING (16). BUCCANEERS DEFENSE: OVERALL (9), RUSH (2), PASS (24), SCORING (T-8). TURNOVER DIFFERENTIAL: Eagles plus 4; Buccaneers plus-5. EAGLES PLAYER TO WATCH: RB D’Andre Swift ran a for career-best 175 yards on 28 carries in last week’s win over the Vikings. The Bucs defense has limited opponents to 52 yards per game rushing. Only the Eagles (51) have been better stopping the run. BUCCANEERS PLAYER TO WATCH: QB Baker Mayfield has played turnover-free ball through two games, helping the Bucs to a surprising 2-0 start. His 104.4 passer rating is the highest of his career at this point in a season. He’s been especially good on third down, completing 20 of 23 passes (87 percent) for 201 yards and two touchdowns. KEY MATCHUP: Eagles QB Jalen Hurts against a rejuvenated Tampa Bay defense coming off limiting the Bears to 236 yards. With eight sacks and five takeaways through two games, the unit led by Shaquil Barrett, Devon White and Lavonte David appears to be back on track after being inconsistent last season. Hurts has won 19 of his past 20 regular season starts. Only five other quarterbacks —Tom Brady (twice), Patrick Mahomes, Jim McMahon, Peyton Manning and Joe Montana — have accomplished that during the Super Bowl era. KEY INJURIES: Eagles WR Quez Watkins (hamstring) was limited during last week’s win over Minnesota. His status for Monday night is uncertain. The Bucs placed backup RB Chase Edmonds (knee) on injured reserve early in the week. CB Carlton Davis (toe) and DL Calijah Kancey (calf) did not play against the Bears. A decision on their availability may not be made until the weekend. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. SERIES NOTES: The Buccaneers have won four straight in the series, including an NFC wild-card playoff victory two seasons ago. They are 2-0 against Hurts, who also lost a regular-season game to Tampa Bay in 2021. STATS AND STUFF: This is the only Week 3 matchup featuring unbeaten teams. … The Eagles, who won their first eight games a year ago, are looking to start 3-0 in consecutive seasons for the first time since 1992-93. Tampa Bay last started 3-0 in 2005. … The Bucs (plus-5) and Eagles (plus 4) rank second and third in the league in turnover ratio behind Dallas (plus 7). … Eagles QB Jalen Hurt has been sacked seven times in two games. He ran for two touchdowns last week against the Vikings. His next game with multiple TDs rushing will be the 10th of his career, tying Cam Newton’s NFL record for a quarterback. … Bucs WR Mike Evans had six receptions for 171 yards and a touchdown against the Bears. He’s the only player in the league who had six-plus catches and a TD in Weeks 1 and 2. … Bucs WR Chris Godwin has six or more catches in a franchise-best 16 consecutive games, the longest active streak in the NFL. FANTASY TIP: Evans had nine receptions for 117 yards and a touchdown the previous time the Bucs faced the Eagles (Tampa Bay’s 31-15 NFC wild-card playoff win in January 2022). He also has a knack for shining in prime time, with at least five catches and a TD in six of seven Monday night games. ___ AP NFL coverage: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:12:24","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"9489fe8ec93091a2614d9ba93c659f36","title":"Roberto De Zerbi happy with Brighton players despite defeat to AEK Athens","link":"https://www.freepressseries.co.uk/sport/national/23805963.roberto-de-zerbi-happy-brighton-players-despite-defeat-aek-athens/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Brighton were undone by an AEK side who made the best of what little they created.","content":"Despite dominating the ball and dictating the shape of the game in wet and difficult conditions at the Amex Stadium, Brighton were undone by an AEK side who made the best of what little they created and were clinical when their moments came. First, the right-back Djibril Sidibe dashed into the box unmarked at a corner and flew into a superb diving header that nestled in the corner. FT: Defeat in our opener. 😩 [2-3] 📲 // 🔵⚪️ — Brighton & Hove Albion (@OfficialBHAFC) It was a lead they twice should have doubled when striker Levi Garcia went through on goal, first denied by goalkeeper Jason Steele then sliding the ball beyond the post as two glorious chances were wasted. Brighton hit back through a penalty from Joao Pedro after a VAR check, the same means by which they levelled for a second time after the break. In between, Mijat Gacinovic had restored AEK’s lead, sliding in at a free-kick to finish from near the penalty spot. Brighton were missing the injured Lewis Dunk in defence and his absence was felt again when substitute Ezequiel Ponce was given space on the counter-attack to win it for the Greek champions late on. “We conceded three goals,” said De Zerbi. “Two goals in set pieces and one incredible goal, the third. We made some mistakes in the (final third) of the pitch, for example the chance of Joao Pedro in the second half, or the chance for Igor in the first half. But in terms of quality of play we played a very good game, I think. “I’m really proud for the performance. I think we showed not the right experience, or maybe not the same experience as AEK Athens. “But for the rest I think we played with personality and with the right attitude. We controlled the game, we dominated the game. And we are sad for the result. “We are sad because we couldn’t make happy our fans, ourselves, our club. But we have to analyse the performance and the performance was good. “We can learn. We have to learn. We can improve, but it’s difficult to accept this defeat. I congratulated the players 10 minutes ago, because I can’t be happy when we win at Old Trafford and sad today if the performances are both good performances. “We have to know, and we knew before the game, that AEK had two situations where they could score; set-pieces and counter-attack. And when we’re defending set-pieces against this team, we have to be more focused, more with the right attitude, more smart to defend the set-pieces.” De Zerbi confirmed that Dunk and striker Evan Ferguson had been ruled out of contention earlier on Thursday. “Dunk couldn’t play because after the game with Man United he felt a problem,” he added. “This afternoon Evan had a temperature, he is ill.” AEK manager Matias Almeyda reflected on a win which he hoped will help cement his team’s reputation as a serious European force this season. “We work on the basis of playing a type of football based on team work,” he said. “I live my life the way I manage the team. I like to respect people and I like to be respected. We want to be respected in Europe and we wanted to get a result to gain that respect. “We have been working together for over a year. We came here in order to play our usual game. The opposition on a number of occasions forced us to play a different kind of game. But it’s spirit of the team, a fighting spirit, and that’s what we have managed to achieve. To keep on fighting.”","pubDate":"2023-09-21 23:11:30","image_url":"https://www.freepressseries.co.uk/resources/images/17253205/?type=app&htype=0","source_id":"freepressseries","source_priority":6510927,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4e1938848804597e9aa376642cf8cc10","title":"Seahawks set to host Panthers and honor the past while focused on the present","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/seahawks-set-to-host-panthers-and-honor-the-past-while-focused-on-the-present","keywords":["NFL"],"creator":["Tim Booth, The Associated Press"],"video_url":null,"description":"SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. But not everyone can […]","content":"SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. Read this article for free: Already have an account? To continue reading, please subscribe: * SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. But not everyone can fully participate in the celebratory part of the weekend. Pete Carroll is still coaching. Bobby Wagner is still playing linebacker. And while they expect to appreciate this weekend’s events, they still have to focus on Sunday’s task of facing the Carolina Panthers. “I think there’s a balance. As I get older, you have to enjoy some of the things,” Wagner said. “Obviously, I’m going to be locked in, I’m going to be focused, so I won’t do everything. I definitely want to be around those guys, but a lot of those guys live in Seattle. I see them pretty often. It’s not going to be any different. It’s just I have a jersey on, and they don’t.” It was Wagner’s passionate speech last week that helped Seattle (1-1) refocus after its opening loss to the Los Angeles Rams. The Seahawks ultimately pulled out a 37-31 overtime win at Detroit last Sunday. It’s the same kind of leadership Wagner showed a decade ago when he was in his second year and an anchor to that Super Bowl-winning defense. “This is a once-in-a-lifetime deal when you have your 10-year anniversary of something like this. He’s those guys, they’re the same,” Carroll said. The Panthers (0-2), meanwhile, are focused on their future. It’s been a rocky start for Carolina in its first season under Frank Reich as the only team in the NFC South without a win. Much of it has to do with injuries. No. 1 overall pick Bryce Young is unlikely to play on Sunday due to an ankle injury. Young played the entire game in Carolina’s 20-17 loss to New Orleans last Monday, but came out of the game with the ankle issue. If he doesn’t play, 13-year veteran Andy Dalton would make his fifth career start against the Seahawks. Dalton is 3-1 in those previous starts, including last season when he led New Orleans to a 39-32 win. “I’m just going to operate like I know that I can. I think for me it starts with being myself pushing guys, pushing the tempo, doing everything that we need to do to give ourselves a chance,” Dalton said. GENO’S REBOUND After a shaky performance in the opener, Geno Smith was terrific in Week 2, throwing for 328 yards and two touchdowns against the Lions. Smith was able to open up an intermediate passing game that was absent against the Rams and allowed the Seahawks to push the ball downfield a little more. “We played one bad half of offensive football, and just for us to answer and just come out and put up the amount of points that we did, for Geno (Smith) to have the type of day that he did, then the O-line to play the way that they did just really speaks volumes of the type of offense that we can have,” receiver DK Metcalf said. REPLACING SHAQ Shaq Thompson has been a mainstay for the Panthers at linebacker for the last nine seasons. But Carolina will be without its emotional leader on defense for the remainder of the season after he broke his leg in Monday night’s loss to the Saints. Kamu Grugier-Hill, who has been in the league since 2016 and has spent time with five other teams, will take Thompson’s spot. Linebacker Frankie Luvu said losing Thompson, who played collegiately at Washington, was an emotional blow for the Panthers because his impact goes beyond his production on the field. “He kind of does everything for us,” Luvu said. “He’s kind of like that glue for the team. Losing a leader like that just hurts.” CORNERBACK DEPTH The Seahawks are fortunate to have depth at cornerback, especially with standout Riq Woolen unlikely to play after suffering a chest injury last week against the Lions. Rookie first-round pick Devon Witherspoon stepped in at Woolen’s spot and Tre Brown — finally healthy after injuries derailed his first two seasons — had a sack and an interception return for a touchdown. It’s likely Witherspoon and Brown will start against the Panthers. RUNNING THE ROCK The Panthers would like to recommit to running the ball in the loud environment at Seattle, which likely means a healthy dose of Miles Sanders. The free-agent pickup from the Philadelphia Eagles has just 115 yards rushing in two games despite coach Frank Reich saying he expected Sanders to be the team’s three-down back. Chuba Hubbard will also see action. Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. One of the problems for the Panthers on offense has been “getting behind the sticks,” Reich said. With two inexperienced guards in rookie Chandler Zavala and Cade Mays, Carolina hasn’t been able to establish the run and put itself in second- and third-and-short situations. ___ AP Sports Writer Steve Reed contributed to this report. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:02:21","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"ca7cf57fa1f3b6b37311c7111d425d94","title":"NFF drums support for Osimhen for Ballon D’or","link":"https://dailytrust.com/nff-drums-support-for-osimhen-for-ballon-dor/","keywords":["Sports"],"creator":["Olusola Jide Jide"],"video_url":null,"description":"…As Super Eagles drop in latest FIFA rankings The Nigeria Football Federation (NFF) has taken to social media to drum up support for Super Eagles striker, Victor Osimhen to win the 2023 FIFA Best Player award. The NFF posted on their Facebook page a clarion call to Nigerians to vote one of their own while […]","content":"…As Super Eagles drop in latest FIFA rankings The Nigeria Football Federation (NFF) has taken to social media to drum up support for Super Eagles striker, Victor Osimhen to win the 2023 FIFA Best Player award. The NFF posted on their Facebook page a clarion call to Nigerians to vote one of their own while sharing a link. “Vote for your own, Victor Osimhen,” the NFF post read. It will be recalled that Osimhen was nominated alongside 11 other players for the prestigious FIFA Best Award after leading Napoli to clinch the Serie A title, marking a historic moment as the club’s first triumph in 33 years. The Nigerian striker was at the forefront, leading the lines with his incredible skills and scoring a whopping 26 goals in the Serie A which earned him the coveted title of the league’s top scorer and the best striker award. Notably, Osimhen’s achievement made history as he became the first African player in the 125-year history of Serie A to be named the best forward in Italy. In the same vein, Super Eagles head coach Jose Peseiro has insisted that Osimhen can win the Ballon d’Or. Peseiro, in a recent interview, (via II Napoli Online) proclaimed that Osimhen has all it takes to win the prestigious award. “He (Osimhen) can surely win the Ballon d’Or in the future. He’s not lacking anything to do it. He has different characteristics than other players that are at the top at this moment, but he scores a lot as well.” Meanwhile, the Super Eagles have now dropped to 6th position in Africa and 40th in the world in the latest FIFA September Rankings. They stay behind only the Atlas Lions of Morocco, the Teranga Lions of Senegal, the Carthage Eagles of Tunisia, the Desert Foxes of Algeria and Pharaohs of Egypt.","pubDate":"2023-09-21 23:54:54","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"b3e5ea707f3288594c6e30fe181e16d0","title":"Fans rue absence of Kwara football team at National Youth Games","link":"https://dailytrust.com/fans-rue-absence-of-kwara-football-team-at-national-youth-games/","keywords":["Sports"],"creator":["Mumini AbdulKareem, Ilorin"],"video_url":null,"description":"Football fans and enthusiasts in Kwara State have continued to rue the absence of the state football team at the ongoing 7th National Youth Games in Asaba, Delta State. Executive chairman of Kwara Sports Commission (KSC), Bola Mogaji, had removed all ball games except handball from the list of events to be participated in by […]","content":"Football fans and enthusiasts in Kwara State have continued to rue the absence of the state football team at the ongoing 7th National Youth Games in Asaba, Delta State. Executive chairman of Kwara Sports Commission (KSC), Bola Mogaji, had removed all ball games except handball from the list of events to be participated in by the state’s contingent which departed on Wednesday. He said the decision was dictated by Kwara’s area of strength and paucity of funds. According to him, Kwara will be fielding 215 contingents consisting of 132 athletes and 83 officials in 18 events. Reacting to the decision of the Chairman, Adex Adeyemi said “How do you conclude that soccer is not Kwara’s area of strength when the players weren’t even sponsored to Jos for the qualifying playoffs. “Kwara’s Under 15 team tipped to represent the state posted five star performances before the regional playoff”, the sports enthusiasts added. On his part, a former technical adviser of the Kwara Football Academy (KFA), Coach Paul Odey, said the situation is unfortunate. “I confronted the sports commission chairman about this and he said he believes in coaches having players on ground as a team and training them not waiting for when the festival is around the corner, you start bringing players. “But I told him that these players are in their various grassroots clubs playing so many competitions. You have to go out, pick them and bring them together since they already have the skills and technique. Kwara should not allow such to happen again”, he said. The Kwara football team is the defending champion in soccer at the NYG after winning gold at the last edition.","pubDate":"2023-09-21 23:54:39","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e4237d823f6930782939b76d9b346a89","title":"Saints look to remain unbeaten as they visit Lambeau Field in Packers’ home opener","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/saints-look-to-remain-unbeaten-as-they-visit-lambeau-field-in-packers-home-opener","keywords":["NFL"],"creator":["The Associated Press"],"video_url":null,"description":"NEW ORLEANS (2-0) at GREEN BAY (1-1) Sunday, 1 p.m. EDT, FOX OPENING LINE: Packers by 2, according to FanDuel Sportsbook Green Bay Packers defensive tackle Kenny Clark, left, and […]","content":"NEW ORLEANS (2-0) at GREEN BAY (1-1) Read this article for free: Already have an account? To continue reading, please subscribe: * NEW ORLEANS (2-0) at GREEN BAY (1-1) Sunday, 1 p.m. EDT, FOX OPENING LINE: Packers by 2, according to FanDuel Sportsbook AGAINST THE SPREAD: Saints 2-0, Packers 1-1 SERIES RECORD: Packers lead 17-10 LAST MEETING: Saints won 38-3 on Sept. 12, 2021, at Jacksonville, Florida. LAST WEEK: Saints won 20-17 at Carolina on Monday; Packers lost 25-24 at Atlanta on Sunday. PACKERS OFFENSE: OVERALL (26), RUSH (25), PASS (23), SCORING (2) SAINTS OFFENSE: OVERALL (10), RUSH (18), PASS (8), SCORING (25) PACKERS DEFENSE: OVERALL (27), RUSH (30), PASS (17), SCORING (14) SAINTS DEFENSE: OVERALL (4), RUSH (14), PASS (7), SCORING (T5) TURNOVER DIFFERENTIAL: Saints plus-1, Packers plus-3 SAINTS PLAYER TO WATCH: Chris Olave, a 2022 first-round draft choice out of Ohio State, has emerged as New Orleans’ top receiver and has been its best overall offensive playmaker during star running back Alvin Kamara’s three-game suspension. He has 14 catches for 198 yards through two games, with a 40-plus-yard reception in each game. Olave could end up seeing a lot of Green Bay’s Jaire Alexander, a two-time Pro Bowl cornerback who will be seeking to bounce back from a subpar performance in Atlanta. PACKERS PLAYER TO WATCH: QB Jordan Love leads the NFL in passer rating early in his first full season as a starter, but he’s only completing 55.8% of his passes. His inexperience showed in Green Bay’s previous game, as he went 0 for 6 in the fourth quarter as the Packers failed to get a first down and squandered a 24-12 lead. Now he gets ready for his first regular-season home start. KEY MATCHUP: Packers offensive line vs. Saints defensive line: An injury to left guard Elgton Jenkins and the uncertainty of left tackle David Bakhtiari’s health status create plenty of questions for the Packers as they face off with a potent Saints front. New Orleans’ Carl Granderson has 2 1/2 sacks through the first two games of the season, and Cameron Jordan is an eight-time Pro Bowl selection. KEY INJURIES: Saints RB Jamaal Williams (hamstring) isn’t expected to play Sunday. … Saints TE Foster Moreau is dealing with an ankle injury. … Saints rookie RB Kendre Miller is expected to make his debut Sunday after missing two games with a hamstring injury. … Jenkins is out for the Packers with a sprained medial collateral ligament. … Bakhtiari missed the Falcons game with lingering knee issues that have limited him the past few years. … Packers WR Christian Watson (hamstring) has missed Green Bay’s first two games. … Packers RB Aaron Jones (hamstring) missed the Falcons game. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. SERIES NOTES: Although the Packers lead the series 17-10, the Saints have won three of the past four meetings. Their most recent matchup — a Saints 38-3 victory in the opening week of the 2021 season — was moved from New Orleans to Jacksonville because of the impact of Hurricane Ida. Love made his NFL debut that day, as he came in for Aaron Rodgers after the Saints had put the game out of reach. The Packers’ previous win over the Saints was a 37-30 victory at New Orleans on Sept. 27, 2020. The previous time the Saints played at Lambeau Field, they won 26-17 on Oct. 22, 2017. The Saints and Packers held joint practices in Green Bay last year. This marks the fourth time the Packers have opened their home schedule against the Saints. They won their three previous home openers in this series. STATS AND STUFF: The Saints have allowed 20 points or fewer in each of their past 10 games, the longest active streak of any NFL team. … The Saints are trying to start 3-0 for the first time since 2013, when they began 5-0. … The Saints’ 30-12 road record since 2018 leads the NFC and ranks behind only the Kansas City Chiefs’ 32-9 road mark among NFL teams. … The Saints haven’t scored a first-half TD this season and have just three total TDs in two games. … Saints S Marcus Maye will be serving the first of a three-game suspension in Week 3. … Saints RB Alvin Kamara will be serving the last of a three-game suspension. … Olave is one of three NFL players (along with Justin Jefferson and Puka Nacua) with at least 85 yards receiving in each of the first two weeks. … Saints CB Paulson Adebo had his first-career fumble recovery in Week 2. … Both teams have rookie kickers. New Orleans’ Blake Grupe has made all of his first five field-goal attempts and all three of his extra points. Green Bay’s Anders Carlson is 2 of 2 on field-goal attempts — including a 52-yarder — and 8 of 8 on extra points. … The Packers’ 27-6 regular-season home record since 2018 leads all NFL teams. … The Packers have won their past 10 home openers, the NFL’s longest active streak. … The Packers haven’t committed a turnover through their first two games. … WR Jayden Reed is the second Packer since the AFL-NFL merger to have multiple touchdown catches in one of his first two games as a pro. The other was James Lofton in 1978. … Packers LB Quay Walker scored on a 37-yard interception return in Green Bay’s season-opening victory at Chicago and followed that up by making a career-high 17 tackles in the loss to the Falcons. FANTASY TIP: The flurry of running back injuries across the league could make it worth picking up Saints RB Tony Jones Jr. at least as a one-week stopgap. Jones had two touchdown runs after Williams got hurt in the Panthers game. He could have a big game against Green Bay’s vulnerable run defense, which allowed 211 yards rushing against the Falcons. One note of caution is that Miller’s return from a hamstring injury could enable the rookie to cut into Jones’ potential workload. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:42:45","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"f8c1df5af8054dd007e274887b459c50","title":"Chargers-Vikings game puts Staley-O’Connell friendship on hold with both teams at 0-2","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/chargers-vikings-game-puts-staley-oconnell-friendship-on-hold-with-both-teams-at-0-2","keywords":["NFL"],"creator":["Dave Campbell, The Associated Press"],"video_url":null,"description":"MINNEAPOLIS (AP) — Kevin O’Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. There’s […]","content":"MINNEAPOLIS (AP) — Kevin O'Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. Read this article for free: Already have an account? To continue reading, please subscribe: * MINNEAPOLIS (AP) — Kevin O’Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. There’s been no space or time for sharing this week. The two friends, now head coaches, are facing each other with both of their teams having stumbled to an 0-2 start. “I do know how ultimately competitive he is, and he knows the same thing about me,” said O’Connell, who’s in his second season with the Minnesota Vikings after two years as offensive coordinator of the Rams. “I care about him tremendously. I think he’s a great football coach and is somebody who I respect as much as anybody in this league.” Staley only spent one season as the Rams’ defensive coordinator before his big break with the Los Angeles Chargers in 2021. After guiding them to 10 wins in his second year, they blew a 27-point lead in a loss to Jacksonville in the wild-card round to put his job status in question. The Chargers opened by losing to Miami and Tennessee by a combined five points, making Staley the betting favorite to be the first head coach fired this season. Only four teams since the NFL expanded the field in 1990 have started 0-3 and still made the playoffs. O’Connell and Staley can thus be forgiven for tabling the pleasantries this week. “He’s like a brother to me, but we’re going head-to-head on Sunday, so our friendship is going to be a distant second to us winning and losing,” Staley said. “I just have the utmost respect for him as a leader, as a coach. He’s one of the top coaches that I’ve ever worked with. He’s one of the top play-callers that I’m going to have to go against.” The staff under Sean McVay with the Rams, who won the Super Bowl after the 2021 season, was full of head coach potential with O’Connell and Staley as the top lieutenants. “They’re both geniuses in their own right,” said Chargers defensive tackle Sebastian Joseph-Day, who played for the Rams in 2020 when both O’Connell and Staley were there. Staley reflected this week on how scheming against O’Connell in practice that year sharpened his skill. “That was one of the things that was, for us, such a special part of that experience,” Staley said. “We had some of the top players in the league to coach, and there was just that special environment. Each day, you had to be on it. You had to perform.” STILL SOARING The Vikings lost to Tampa Bay and Philadelphia by a combined nine points, thanks largely to a league-leading seven turnovers that have overshadowed the continued brilliance of Justin Jefferson. He can become the first receiver in NFL history with three straight 150-yard games to start a season. That would give him 11 such games for his career, the most through a player’s first four years in the league. Jefferson would also with 150 yards break Wes Welker’s 2011 record with the most receiving yards in history at the three-game mark. Perhaps the most impressive feat for Jefferson so far is that he’s played on 121 of 122 snaps. “I just don’t want to miss out on any opportunities. The majority of times when I do come out, we pass the ball,” Jefferson said, smiling. “I want to put full force on my matchups. I want to stay in the game just like they stay in the game.” AIR RAIDED The Chargers have had plenty of coverage trouble through games. Michael Davis has yielded a league-high three touchdowns. Asante Samuel has allowed receptions all six times he has been targeted. Jefferson also leads the NFL in receptions (31) and yards (681) on passes with a 50% or lower completion probability since the start of last season. In 2021 against the Chargers, he had two catches for 54 yards with a 50% or lower completion probability. “He may make a play or two, but you’ve got to get back in the huddle and keep playing against guys like that,” safety Derwin James said. KEYBOARD WARRIORS After had one of Minnesota’s four lost fumbles against the Eagles and netted only 28 yards on eight carries, Alexander Mattison was sickened by the social media backlash he encountered after the game. More than 60 messages directed toward him on Instagram contained enough hateful, racist and violent words for him to speak out against such harassment. “There’s a lot of fantasy football people out there, and they think that it’s all fun and games,” Mattison said. “We have families. We have people that love us. We have people that we’re doing this for. It’s not fantasy. This is real life.” STAYING GROUNDED The Vikings have struggled to get their ground game going, prompting the acquisition of running back Cam Akers from the Rams. Running plays have been a problem for the Vikings on the other side of the ball, too. They gave up 259 rushing yards to the Eagles, getting trampled by D’Andre Swift down the stretch when a stop or two could’ve translated into a comeback victory. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. The Chargers rushed for 234 yards in their opening loss to the Dolphins, when Austin Ekeler suffered an ankle sprain that kept him out against the Titans. Joshua Kelley would start if Ekeler is sidelined again. ___ AP Sports Writer Joe Reedy in Costa Mesa, California, contributed to this report. ___ AP NFL: https://apnews.com/hub/NFL Advertisement Advertisement","pubDate":"2023-09-21 23:22:59","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"bf945df501d0177cd3bcf33126f974a0","title":"Browns hope to keep moving without Nick Chubb as they start anew against Derrick Henry, Titans","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/browns-hope-to-keep-moving-without-nick-chubb-as-they-start-anew-against-derrick-henry-titans","keywords":["NFL"],"creator":["Tom Withers, The Associated Press"],"video_url":null,"description":"CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the […]","content":"CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the recent history of their opponent Sunday to know that everything could turn out OK. Read this article for free: Already have an account? To continue reading, please subscribe: * CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the recent history of their opponent Sunday to know that everything could turn out OK. Tennessee has been there, done that. Two years ago, the Titans lost All-Pro Derrick Henry halfway through the season with a broken foot. Not only did Tennessee survive the rest of the way without its rampaging running back, the Titans somehow flourished, finishing 12-5 and as the No. 1 seed in the AFC playoffs. The Titans (1-1) didn’t panic after losing Henry, who was on his way to another rushing title. The Browns (1-1) can only hope to be as stoic without Chubb, the four-time Pro Bowler who suffered a season-ending and career-threatening left knee injury Monday night in Pittsburgh. The sight of seeing Chubb in tears while being carted off shook many of his teammates. It was the kind of moment that can define a season. “You can’t replace 24,” Browns All-Pro guard Joel Bitonio said, referring to Chubb’s number. “But I think we have pieces that we can try and put together, a puzzle that can look similar to what we did with Nick.” The Titans were in a similar scramble mode in 2021 after Henry went down. But Tennessee stuck with its run-first, run-often offensive approach, and with Dontrell Hilliard and D’Onta Foreman filling in, the Titans finished fifth in the league, averaging 141.5 yards rushing per game. Cleveland defensive coordinator Jim Schwartz watched it. He was a senior advisor in Tennessee that season, and was impressed with how Titans coach Mike Vrabel failed to let Henry’s loss overwhelm his team. “He stays the course,” Schwartz said of Vrabel. “He’s very resilient that way, and it flowed over to the team. Part of that job of the head coach is to make sure everybody knows, ‘Hey, it’s going to be OK, we have a plan, we have good players behind.’” The Browns didn’t have much time to process losing Chubb, who was injured in the second quarter of a 26-22 loss to the Steelers. Second-year back Jerome Ford came in and caught a 3-yard TD pass one play after Chubb’s horrific injury. A fifth-round pick from Cincinnati who began his college career at Alabama, Ford later ripped off a 69-yard run and finished with 106 yards on 16 carries. Coach Kevin Stefanski plans to use Ford as his feature back, and the Browns brought in some insurance this week by re-signing Kareem Hunt, who spent four seasons in a tandem with Chubb before Cleveland elected not to retain him. While the personnel might be different, the Titans don’t expect the Browns to stray from their ground game. “It don’t really matter who’s back there,” said two-time Pro Bowl defensive lineman Jeffery Simmons. “You know they trust their offensive linemen. At the end of the day, it’s about how are we going to be able to hold up against their offensive line against the run game.” WHERE’S WATSON? The Browns are still waiting for Deshaun Watson to play like an elite, $230 million quarterback. To this point, he has been an average player with an above average contract. In eight starts over two seasons, Watson is 4-4 with nine touchdowns, seven interceptions and not nearly as many dazzling, highlight-reel type plays as expected. He’s coming off a rough performance at Pittsburgh that did nothing to quiet his critics, and after two games he’s 31st in completion percentage (55.1) and 30th in rating (69.1). Still, Vrabel, who spent a season with Watson in Houston, knows how dangerous he can be from any spot on the field. “He extends plays,” he said. “He’s got great play strength in the pocket to wait out receivers, to get him through to the second window, extends plays. Got length, stiff arm and will scramble and can run to get what he needs to get to, can throw the ball to all parts of the field.” GROUP PLAN Henry has only rushed for 140 yards through two games, but it’s only a matter of time before he gets rolling. Once he does, look out. At 6-foot-3, 250 pounds, there’s few more intimidating sights than Henry at full speed. “He’s a guy that you can stop nine times in a row and in the 10th time he can go 90 yards for a touchdown,” Schwartz said. “We’re going to tackle well, we’re going to have to be physical and we’re going to have to get hats to the ball. Tackling Derrick Henry isn’t a 1-on-1 thing, it’s an 11-on-1 thing and we have to have that mentality going in.” FAMILIAR FACE Along with Vrabel, most of the Titans know Watson well after facing him twice a year as AFC South rivals. Two-time All-Pro safety Kevin Byard knows better than to underestimate him. “He’s playing a different style of offense,” Byard said. “They’re going to run the ball more, but he likes taking shots down the field. So I think first and foremost for our defense, we’ve got to stop the run and on the second half just really just making sure that we’re defending those deep shots.” POCKET PROTECTOR The Titans aren’t doing enough to keep quarterback Ryan Tannehill upright. Only six teams have allowed more sacks than the Titans with Tannehill being taken down eight times, including five last week by the Los Angeles Chargers. One of those was the fastest sack by a defender this season as Kenneth Murray needed only 2.31 seconds to get the Titans quarterback. Tennessee’s offensive line already had four new starters before rookie left guard Peter Skoronski had an appendectomy Sept. 16. Vrabel knows the Titans’ front five have their hands full this week against a rebuilt Cleveland defensive line led by All-Pro end Myles Garrett. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. “I don’t think there’s too many guys walking the earth like Myles Garrett,” Vrabel said. “So we’ll be in for a huge challenge.” ___ AP Sports Writer Teresa Walker in Nashville, Tennessee, contributed. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:15:45","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"483af6cebea6e47b9fea21d906d227fd","title":"Unai Emery urges Aston Villa to adapt quickly to demands of European football","link":"https://www.newsr.in/n/Sports/1zpnjb4bhv/Unai-Emery-urges-Aston-Villa-to-adapt-quickly.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Unai Emery insists Aston Villa must learn how to handle European football and refused to blame his changes after their sloppy 3-2 defeat at Legia Warsaw. Ernest Muci’s second-half winner clinched a deserved victory for the hosts to ruin Villa’s Europa Conference League debut. Jhon Duran and ... Reported by SoccerNews.com 30 minutes ago.","content":"Thursday, 21 September 2023 ( 3 hours ago ) Unai Emery insists Aston Villa must learn how to handle European football and refused to blame his changes after their sloppy 3-2 defeat at Legia Warsaw. Ernest Muci’s second-half winner clinched a deserved victory for the hosts to ruin Villa’s Europa Conference League debut. Jhon Duran and Lucas Digne twice levelled for the underwhelming visitors […] 👓 View full article","pubDate":"2023-09-21 23:13:07","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6f5aa161824729ab55024934de1bbaa9","title":"Premier League fantasy football tips: Is it time to play your wildcard?","link":"https://www.newsr.in/n/Sports/1zpnjb4bhp/Premier-League-fantasy-football-tips-Is-it-time.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Will you stick or twist when it comes to playing your fantasy football wildcard? Alistair Bruce-Ball previews gameweek six. Reported by BBC Sport 31 minutes ago.","content":"Thursday, 21 September 2023 ( 1 hour ago ) Will you stick or twist when it comes to playing your fantasy football wildcard? Alistair Bruce-Ball previews gameweek six. 👓 View full article","pubDate":"2023-09-21 23:12:37","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"ae3b0f392aa75cba209a4adc5bb8080a","title":"Surprising Buccaneers face defending NFC champion Eagles in prime-time matchup of unbeaten teams","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/surprising-buccaneers-face-defending-nfc-champion-eagles-in-prime-time-matchup-of-unbeaten-teams","keywords":["NFL"],"creator":["The Associated Press"],"video_url":null,"description":"PHILADELPHIA (2-0) at TAMPA BAY (2-0) Monday, 7:15 p.m. EDT, ABC FANDUEL SPORTSBOOK NFL LINE: Eagles by 5 1/2. Tampa Bay Buccaneers quarterback Baker Mayfield (6) throws a pass during […]","content":"PHILADELPHIA (2-0) at TAMPA BAY (2-0) Read this article for free: Already have an account? To continue reading, please subscribe: * PHILADELPHIA (2-0) at TAMPA BAY (2-0) Monday, 7:15 p.m. EDT, ABC FANDUEL SPORTSBOOK NFL LINE: Eagles by 5 1/2. AGAINST THE SPREAD: Philadelphia 2-0; Tampa Bay 2-0. SERIES RECORD: Buccaneers lead 11-10, including postseason. LAST MEETING: Buccaneers beat Eagles 31-15 on Jan. 16, 2022, in NFC wild-card game in Tampa, Fla. LAST WEEK: Eagles beat Vikings 34-28 in Philadelphia; Buccaneers defeated Bears 27-17 at home. EAGLES OFFENSE: OVERALL (11), RUSH (2), PASS (29), SCORING (5). EAGLES DEFENSE: OVERALL (26), RUSH (1), PASS (31), SCORING (16). BUCCANEERS OFFENSE: OVERALL (13), RUSH (19), PASS (9), SCORING (16). BUCCANEERS DEFENSE: OVERALL (9), RUSH (2), PASS (24), SCORING (T-8). TURNOVER DIFFERENTIAL: Eagles plus 4; Buccaneers plus-5. EAGLES PLAYER TO WATCH: RB D’Andre Swift ran a for career-best 175 yards on 28 carries in last week’s win over the Vikings. The Bucs defense has limited opponents to 52 yards per game rushing. Only the Eagles (51) have been better stopping the run. BUCCANEERS PLAYER TO WATCH: QB Baker Mayfield has played turnover-free ball through two games, helping the Bucs to a surprising 2-0 start. His 104.4 passer rating is the highest of his career at this point in a season. He’s been especially good on third down, completing 20 of 23 passes (87 percent) for 201 yards and two touchdowns. KEY MATCHUP: Eagles QB Jalen Hurts against a rejuvenated Tampa Bay defense coming off limiting the Bears to 236 yards. With eight sacks and five takeaways through two games, the unit led by Shaquil Barrett, Devon White and Lavonte David appears to be back on track after being inconsistent last season. Hurts has won 19 of his past 20 regular season starts. Only five other quarterbacks —Tom Brady (twice), Patrick Mahomes, Jim McMahon, Peyton Manning and Joe Montana — have accomplished that during the Super Bowl era. KEY INJURIES: Eagles WR Quez Watkins (hamstring) was limited during last week’s win over Minnesota. His status for Monday night is uncertain. The Bucs placed backup RB Chase Edmonds (knee) on injured reserve early in the week. CB Carlton Davis (toe) and DL Calijah Kancey (calf) did not play against the Bears. A decision on their availability may not be made until the weekend. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. SERIES NOTES: The Buccaneers have won four straight in the series, including an NFC wild-card playoff victory two seasons ago. They are 2-0 against Hurts, who also lost a regular-season game to Tampa Bay in 2021. STATS AND STUFF: This is the only Week 3 matchup featuring unbeaten teams. … The Eagles, who won their first eight games a year ago, are looking to start 3-0 in consecutive seasons for the first time since 1992-93. Tampa Bay last started 3-0 in 2005. … The Bucs (plus-5) and Eagles (plus 4) rank second and third in the league in turnover ratio behind Dallas (plus 7). … Eagles QB Jalen Hurt has been sacked seven times in two games. He ran for two touchdowns last week against the Vikings. His next game with multiple TDs rushing will be the 10th of his career, tying Cam Newton’s NFL record for a quarterback. … Bucs WR Mike Evans had six receptions for 171 yards and a touchdown against the Bears. He’s the only player in the league who had six-plus catches and a TD in Weeks 1 and 2. … Bucs WR Chris Godwin has six or more catches in a franchise-best 16 consecutive games, the longest active streak in the NFL. FANTASY TIP: Evans had nine receptions for 117 yards and a touchdown the previous time the Bucs faced the Eagles (Tampa Bay’s 31-15 NFC wild-card playoff win in January 2022). He also has a knack for shining in prime time, with at least five catches and a TD in six of seven Monday night games. ___ AP NFL coverage: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:12:24","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"9489fe8ec93091a2614d9ba93c659f36","title":"Roberto De Zerbi happy with Brighton players despite defeat to AEK Athens","link":"https://www.freepressseries.co.uk/sport/national/23805963.roberto-de-zerbi-happy-brighton-players-despite-defeat-aek-athens/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Brighton were undone by an AEK side who made the best of what little they created.","content":"Despite dominating the ball and dictating the shape of the game in wet and difficult conditions at the Amex Stadium, Brighton were undone by an AEK side who made the best of what little they created and were clinical when their moments came. First, the right-back Djibril Sidibe dashed into the box unmarked at a corner and flew into a superb diving header that nestled in the corner. FT: Defeat in our opener. 😩 [2-3] 📲 // 🔵⚪️ — Brighton & Hove Albion (@OfficialBHAFC) It was a lead they twice should have doubled when striker Levi Garcia went through on goal, first denied by goalkeeper Jason Steele then sliding the ball beyond the post as two glorious chances were wasted. Brighton hit back through a penalty from Joao Pedro after a VAR check, the same means by which they levelled for a second time after the break. In between, Mijat Gacinovic had restored AEK’s lead, sliding in at a free-kick to finish from near the penalty spot. Brighton were missing the injured Lewis Dunk in defence and his absence was felt again when substitute Ezequiel Ponce was given space on the counter-attack to win it for the Greek champions late on. “We conceded three goals,” said De Zerbi. “Two goals in set pieces and one incredible goal, the third. We made some mistakes in the (final third) of the pitch, for example the chance of Joao Pedro in the second half, or the chance for Igor in the first half. But in terms of quality of play we played a very good game, I think. “I’m really proud for the performance. I think we showed not the right experience, or maybe not the same experience as AEK Athens. “But for the rest I think we played with personality and with the right attitude. We controlled the game, we dominated the game. And we are sad for the result. “We are sad because we couldn’t make happy our fans, ourselves, our club. But we have to analyse the performance and the performance was good. “We can learn. We have to learn. We can improve, but it’s difficult to accept this defeat. I congratulated the players 10 minutes ago, because I can’t be happy when we win at Old Trafford and sad today if the performances are both good performances. “We have to know, and we knew before the game, that AEK had two situations where they could score; set-pieces and counter-attack. And when we’re defending set-pieces against this team, we have to be more focused, more with the right attitude, more smart to defend the set-pieces.” De Zerbi confirmed that Dunk and striker Evan Ferguson had been ruled out of contention earlier on Thursday. “Dunk couldn’t play because after the game with Man United he felt a problem,” he added. “This afternoon Evan had a temperature, he is ill.” AEK manager Matias Almeyda reflected on a win which he hoped will help cement his team’s reputation as a serious European force this season. “We work on the basis of playing a type of football based on team work,” he said. “I live my life the way I manage the team. I like to respect people and I like to be respected. We want to be respected in Europe and we wanted to get a result to gain that respect. “We have been working together for over a year. We came here in order to play our usual game. The opposition on a number of occasions forced us to play a different kind of game. But it’s spirit of the team, a fighting spirit, and that’s what we have managed to achieve. To keep on fighting.”","pubDate":"2023-09-21 23:11:30","image_url":"https://www.freepressseries.co.uk/resources/images/17253205/?type=app&htype=0","source_id":"freepressseries","source_priority":6510927,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4e1938848804597e9aa376642cf8cc10","title":"Seahawks set to host Panthers and honor the past while focused on the present","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/seahawks-set-to-host-panthers-and-honor-the-past-while-focused-on-the-present","keywords":["NFL"],"creator":["Tim Booth, The Associated Press"],"video_url":null,"description":"SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. But not everyone can […]","content":"SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. Read this article for free: Already have an account? To continue reading, please subscribe: * SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. But not everyone can fully participate in the celebratory part of the weekend. Pete Carroll is still coaching. Bobby Wagner is still playing linebacker. And while they expect to appreciate this weekend’s events, they still have to focus on Sunday’s task of facing the Carolina Panthers. “I think there’s a balance. As I get older, you have to enjoy some of the things,” Wagner said. “Obviously, I’m going to be locked in, I’m going to be focused, so I won’t do everything. I definitely want to be around those guys, but a lot of those guys live in Seattle. I see them pretty often. It’s not going to be any different. It’s just I have a jersey on, and they don’t.” It was Wagner’s passionate speech last week that helped Seattle (1-1) refocus after its opening loss to the Los Angeles Rams. The Seahawks ultimately pulled out a 37-31 overtime win at Detroit last Sunday. It’s the same kind of leadership Wagner showed a decade ago when he was in his second year and an anchor to that Super Bowl-winning defense. “This is a once-in-a-lifetime deal when you have your 10-year anniversary of something like this. He’s those guys, they’re the same,” Carroll said. The Panthers (0-2), meanwhile, are focused on their future. It’s been a rocky start for Carolina in its first season under Frank Reich as the only team in the NFC South without a win. Much of it has to do with injuries. No. 1 overall pick Bryce Young is unlikely to play on Sunday due to an ankle injury. Young played the entire game in Carolina’s 20-17 loss to New Orleans last Monday, but came out of the game with the ankle issue. If he doesn’t play, 13-year veteran Andy Dalton would make his fifth career start against the Seahawks. Dalton is 3-1 in those previous starts, including last season when he led New Orleans to a 39-32 win. “I’m just going to operate like I know that I can. I think for me it starts with being myself pushing guys, pushing the tempo, doing everything that we need to do to give ourselves a chance,” Dalton said. GENO’S REBOUND After a shaky performance in the opener, Geno Smith was terrific in Week 2, throwing for 328 yards and two touchdowns against the Lions. Smith was able to open up an intermediate passing game that was absent against the Rams and allowed the Seahawks to push the ball downfield a little more. “We played one bad half of offensive football, and just for us to answer and just come out and put up the amount of points that we did, for Geno (Smith) to have the type of day that he did, then the O-line to play the way that they did just really speaks volumes of the type of offense that we can have,” receiver DK Metcalf said. REPLACING SHAQ Shaq Thompson has been a mainstay for the Panthers at linebacker for the last nine seasons. But Carolina will be without its emotional leader on defense for the remainder of the season after he broke his leg in Monday night’s loss to the Saints. Kamu Grugier-Hill, who has been in the league since 2016 and has spent time with five other teams, will take Thompson’s spot. Linebacker Frankie Luvu said losing Thompson, who played collegiately at Washington, was an emotional blow for the Panthers because his impact goes beyond his production on the field. “He kind of does everything for us,” Luvu said. “He’s kind of like that glue for the team. Losing a leader like that just hurts.” CORNERBACK DEPTH The Seahawks are fortunate to have depth at cornerback, especially with standout Riq Woolen unlikely to play after suffering a chest injury last week against the Lions. Rookie first-round pick Devon Witherspoon stepped in at Woolen’s spot and Tre Brown — finally healthy after injuries derailed his first two seasons — had a sack and an interception return for a touchdown. It’s likely Witherspoon and Brown will start against the Panthers. RUNNING THE ROCK The Panthers would like to recommit to running the ball in the loud environment at Seattle, which likely means a healthy dose of Miles Sanders. The free-agent pickup from the Philadelphia Eagles has just 115 yards rushing in two games despite coach Frank Reich saying he expected Sanders to be the team’s three-down back. Chuba Hubbard will also see action. Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. One of the problems for the Panthers on offense has been “getting behind the sticks,” Reich said. With two inexperienced guards in rookie Chandler Zavala and Cade Mays, Carolina hasn’t been able to establish the run and put itself in second- and third-and-short situations. ___ AP Sports Writer Steve Reed contributed to this report. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:02:21","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"ca7cf57fa1f3b6b37311c7111d425d94","title":"NFF drums support for Osimhen for Ballon D’or","link":"https://dailytrust.com/nff-drums-support-for-osimhen-for-ballon-dor/","keywords":["Sports"],"creator":["Olusola Jide Jide"],"video_url":null,"description":"…As Super Eagles drop in latest FIFA rankings The Nigeria Football Federation (NFF) has taken to social media to drum up support for Super Eagles striker, Victor Osimhen to win the 2023 FIFA Best Player award. The NFF posted on their Facebook page a clarion call to Nigerians to vote one of their own while […]","content":"…As Super Eagles drop in latest FIFA rankings The Nigeria Football Federation (NFF) has taken to social media to drum up support for Super Eagles striker, Victor Osimhen to win the 2023 FIFA Best Player award. The NFF posted on their Facebook page a clarion call to Nigerians to vote one of their own while sharing a link. “Vote for your own, Victor Osimhen,” the NFF post read. It will be recalled that Osimhen was nominated alongside 11 other players for the prestigious FIFA Best Award after leading Napoli to clinch the Serie A title, marking a historic moment as the club’s first triumph in 33 years. The Nigerian striker was at the forefront, leading the lines with his incredible skills and scoring a whopping 26 goals in the Serie A which earned him the coveted title of the league’s top scorer and the best striker award. Notably, Osimhen’s achievement made history as he became the first African player in the 125-year history of Serie A to be named the best forward in Italy. In the same vein, Super Eagles head coach Jose Peseiro has insisted that Osimhen can win the Ballon d’Or. Peseiro, in a recent interview, (via II Napoli Online) proclaimed that Osimhen has all it takes to win the prestigious award. “He (Osimhen) can surely win the Ballon d’Or in the future. He’s not lacking anything to do it. He has different characteristics than other players that are at the top at this moment, but he scores a lot as well.” Meanwhile, the Super Eagles have now dropped to 6th position in Africa and 40th in the world in the latest FIFA September Rankings. They stay behind only the Atlas Lions of Morocco, the Teranga Lions of Senegal, the Carthage Eagles of Tunisia, the Desert Foxes of Algeria and Pharaohs of Egypt.","pubDate":"2023-09-21 23:54:54","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"b3e5ea707f3288594c6e30fe181e16d0","title":"Fans rue absence of Kwara football team at National Youth Games","link":"https://dailytrust.com/fans-rue-absence-of-kwara-football-team-at-national-youth-games/","keywords":["Sports"],"creator":["Mumini AbdulKareem, Ilorin"],"video_url":null,"description":"Football fans and enthusiasts in Kwara State have continued to rue the absence of the state football team at the ongoing 7th National Youth Games in Asaba, Delta State. Executive chairman of Kwara Sports Commission (KSC), Bola Mogaji, had removed all ball games except handball from the list of events to be participated in by […]","content":"Football fans and enthusiasts in Kwara State have continued to rue the absence of the state football team at the ongoing 7th National Youth Games in Asaba, Delta State. Executive chairman of Kwara Sports Commission (KSC), Bola Mogaji, had removed all ball games except handball from the list of events to be participated in by the state’s contingent which departed on Wednesday. He said the decision was dictated by Kwara’s area of strength and paucity of funds. According to him, Kwara will be fielding 215 contingents consisting of 132 athletes and 83 officials in 18 events. Reacting to the decision of the Chairman, Adex Adeyemi said “How do you conclude that soccer is not Kwara’s area of strength when the players weren’t even sponsored to Jos for the qualifying playoffs. “Kwara’s Under 15 team tipped to represent the state posted five star performances before the regional playoff”, the sports enthusiasts added. On his part, a former technical adviser of the Kwara Football Academy (KFA), Coach Paul Odey, said the situation is unfortunate. “I confronted the sports commission chairman about this and he said he believes in coaches having players on ground as a team and training them not waiting for when the festival is around the corner, you start bringing players. “But I told him that these players are in their various grassroots clubs playing so many competitions. You have to go out, pick them and bring them together since they already have the skills and technique. Kwara should not allow such to happen again”, he said. The Kwara football team is the defending champion in soccer at the NYG after winning gold at the last edition.","pubDate":"2023-09-21 23:54:39","image_url":null,"source_id":"dailytrust","source_priority":57151,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e4237d823f6930782939b76d9b346a89","title":"Saints look to remain unbeaten as they visit Lambeau Field in Packers’ home opener","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/saints-look-to-remain-unbeaten-as-they-visit-lambeau-field-in-packers-home-opener","keywords":["NFL"],"creator":["The Associated Press"],"video_url":null,"description":"NEW ORLEANS (2-0) at GREEN BAY (1-1) Sunday, 1 p.m. EDT, FOX OPENING LINE: Packers by 2, according to FanDuel Sportsbook Green Bay Packers defensive tackle Kenny Clark, left, and […]","content":"NEW ORLEANS (2-0) at GREEN BAY (1-1) Read this article for free: Already have an account? To continue reading, please subscribe: * NEW ORLEANS (2-0) at GREEN BAY (1-1) Sunday, 1 p.m. EDT, FOX OPENING LINE: Packers by 2, according to FanDuel Sportsbook AGAINST THE SPREAD: Saints 2-0, Packers 1-1 SERIES RECORD: Packers lead 17-10 LAST MEETING: Saints won 38-3 on Sept. 12, 2021, at Jacksonville, Florida. LAST WEEK: Saints won 20-17 at Carolina on Monday; Packers lost 25-24 at Atlanta on Sunday. PACKERS OFFENSE: OVERALL (26), RUSH (25), PASS (23), SCORING (2) SAINTS OFFENSE: OVERALL (10), RUSH (18), PASS (8), SCORING (25) PACKERS DEFENSE: OVERALL (27), RUSH (30), PASS (17), SCORING (14) SAINTS DEFENSE: OVERALL (4), RUSH (14), PASS (7), SCORING (T5) TURNOVER DIFFERENTIAL: Saints plus-1, Packers plus-3 SAINTS PLAYER TO WATCH: Chris Olave, a 2022 first-round draft choice out of Ohio State, has emerged as New Orleans’ top receiver and has been its best overall offensive playmaker during star running back Alvin Kamara’s three-game suspension. He has 14 catches for 198 yards through two games, with a 40-plus-yard reception in each game. Olave could end up seeing a lot of Green Bay’s Jaire Alexander, a two-time Pro Bowl cornerback who will be seeking to bounce back from a subpar performance in Atlanta. PACKERS PLAYER TO WATCH: QB Jordan Love leads the NFL in passer rating early in his first full season as a starter, but he’s only completing 55.8% of his passes. His inexperience showed in Green Bay’s previous game, as he went 0 for 6 in the fourth quarter as the Packers failed to get a first down and squandered a 24-12 lead. Now he gets ready for his first regular-season home start. KEY MATCHUP: Packers offensive line vs. Saints defensive line: An injury to left guard Elgton Jenkins and the uncertainty of left tackle David Bakhtiari’s health status create plenty of questions for the Packers as they face off with a potent Saints front. New Orleans’ Carl Granderson has 2 1/2 sacks through the first two games of the season, and Cameron Jordan is an eight-time Pro Bowl selection. KEY INJURIES: Saints RB Jamaal Williams (hamstring) isn’t expected to play Sunday. … Saints TE Foster Moreau is dealing with an ankle injury. … Saints rookie RB Kendre Miller is expected to make his debut Sunday after missing two games with a hamstring injury. … Jenkins is out for the Packers with a sprained medial collateral ligament. … Bakhtiari missed the Falcons game with lingering knee issues that have limited him the past few years. … Packers WR Christian Watson (hamstring) has missed Green Bay’s first two games. … Packers RB Aaron Jones (hamstring) missed the Falcons game. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. SERIES NOTES: Although the Packers lead the series 17-10, the Saints have won three of the past four meetings. Their most recent matchup — a Saints 38-3 victory in the opening week of the 2021 season — was moved from New Orleans to Jacksonville because of the impact of Hurricane Ida. Love made his NFL debut that day, as he came in for Aaron Rodgers after the Saints had put the game out of reach. The Packers’ previous win over the Saints was a 37-30 victory at New Orleans on Sept. 27, 2020. The previous time the Saints played at Lambeau Field, they won 26-17 on Oct. 22, 2017. The Saints and Packers held joint practices in Green Bay last year. This marks the fourth time the Packers have opened their home schedule against the Saints. They won their three previous home openers in this series. STATS AND STUFF: The Saints have allowed 20 points or fewer in each of their past 10 games, the longest active streak of any NFL team. … The Saints are trying to start 3-0 for the first time since 2013, when they began 5-0. … The Saints’ 30-12 road record since 2018 leads the NFC and ranks behind only the Kansas City Chiefs’ 32-9 road mark among NFL teams. … The Saints haven’t scored a first-half TD this season and have just three total TDs in two games. … Saints S Marcus Maye will be serving the first of a three-game suspension in Week 3. … Saints RB Alvin Kamara will be serving the last of a three-game suspension. … Olave is one of three NFL players (along with Justin Jefferson and Puka Nacua) with at least 85 yards receiving in each of the first two weeks. … Saints CB Paulson Adebo had his first-career fumble recovery in Week 2. … Both teams have rookie kickers. New Orleans’ Blake Grupe has made all of his first five field-goal attempts and all three of his extra points. Green Bay’s Anders Carlson is 2 of 2 on field-goal attempts — including a 52-yarder — and 8 of 8 on extra points. … The Packers’ 27-6 regular-season home record since 2018 leads all NFL teams. … The Packers have won their past 10 home openers, the NFL’s longest active streak. … The Packers haven’t committed a turnover through their first two games. … WR Jayden Reed is the second Packer since the AFL-NFL merger to have multiple touchdown catches in one of his first two games as a pro. The other was James Lofton in 1978. … Packers LB Quay Walker scored on a 37-yard interception return in Green Bay’s season-opening victory at Chicago and followed that up by making a career-high 17 tackles in the loss to the Falcons. FANTASY TIP: The flurry of running back injuries across the league could make it worth picking up Saints RB Tony Jones Jr. at least as a one-week stopgap. Jones had two touchdown runs after Williams got hurt in the Panthers game. He could have a big game against Green Bay’s vulnerable run defense, which allowed 211 yards rushing against the Falcons. One note of caution is that Miller’s return from a hamstring injury could enable the rookie to cut into Jones’ potential workload. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:42:45","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"f8c1df5af8054dd007e274887b459c50","title":"Chargers-Vikings game puts Staley-O’Connell friendship on hold with both teams at 0-2","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/chargers-vikings-game-puts-staley-oconnell-friendship-on-hold-with-both-teams-at-0-2","keywords":["NFL"],"creator":["Dave Campbell, The Associated Press"],"video_url":null,"description":"MINNEAPOLIS (AP) — Kevin O’Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. There’s […]","content":"MINNEAPOLIS (AP) — Kevin O'Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. Read this article for free: Already have an account? To continue reading, please subscribe: * MINNEAPOLIS (AP) — Kevin O’Connell and Brandon Staley were close enough in 2020 as assistants with the Los Angeles Rams that their kids were homeschooled together during the pandemic. There’s been no space or time for sharing this week. The two friends, now head coaches, are facing each other with both of their teams having stumbled to an 0-2 start. “I do know how ultimately competitive he is, and he knows the same thing about me,” said O’Connell, who’s in his second season with the Minnesota Vikings after two years as offensive coordinator of the Rams. “I care about him tremendously. I think he’s a great football coach and is somebody who I respect as much as anybody in this league.” Staley only spent one season as the Rams’ defensive coordinator before his big break with the Los Angeles Chargers in 2021. After guiding them to 10 wins in his second year, they blew a 27-point lead in a loss to Jacksonville in the wild-card round to put his job status in question. The Chargers opened by losing to Miami and Tennessee by a combined five points, making Staley the betting favorite to be the first head coach fired this season. Only four teams since the NFL expanded the field in 1990 have started 0-3 and still made the playoffs. O’Connell and Staley can thus be forgiven for tabling the pleasantries this week. “He’s like a brother to me, but we’re going head-to-head on Sunday, so our friendship is going to be a distant second to us winning and losing,” Staley said. “I just have the utmost respect for him as a leader, as a coach. He’s one of the top coaches that I’ve ever worked with. He’s one of the top play-callers that I’m going to have to go against.” The staff under Sean McVay with the Rams, who won the Super Bowl after the 2021 season, was full of head coach potential with O’Connell and Staley as the top lieutenants. “They’re both geniuses in their own right,” said Chargers defensive tackle Sebastian Joseph-Day, who played for the Rams in 2020 when both O’Connell and Staley were there. Staley reflected this week on how scheming against O’Connell in practice that year sharpened his skill. “That was one of the things that was, for us, such a special part of that experience,” Staley said. “We had some of the top players in the league to coach, and there was just that special environment. Each day, you had to be on it. You had to perform.” STILL SOARING The Vikings lost to Tampa Bay and Philadelphia by a combined nine points, thanks largely to a league-leading seven turnovers that have overshadowed the continued brilliance of Justin Jefferson. He can become the first receiver in NFL history with three straight 150-yard games to start a season. That would give him 11 such games for his career, the most through a player’s first four years in the league. Jefferson would also with 150 yards break Wes Welker’s 2011 record with the most receiving yards in history at the three-game mark. Perhaps the most impressive feat for Jefferson so far is that he’s played on 121 of 122 snaps. “I just don’t want to miss out on any opportunities. The majority of times when I do come out, we pass the ball,” Jefferson said, smiling. “I want to put full force on my matchups. I want to stay in the game just like they stay in the game.” AIR RAIDED The Chargers have had plenty of coverage trouble through games. Michael Davis has yielded a league-high three touchdowns. Asante Samuel has allowed receptions all six times he has been targeted. Jefferson also leads the NFL in receptions (31) and yards (681) on passes with a 50% or lower completion probability since the start of last season. In 2021 against the Chargers, he had two catches for 54 yards with a 50% or lower completion probability. “He may make a play or two, but you’ve got to get back in the huddle and keep playing against guys like that,” safety Derwin James said. KEYBOARD WARRIORS After had one of Minnesota’s four lost fumbles against the Eagles and netted only 28 yards on eight carries, Alexander Mattison was sickened by the social media backlash he encountered after the game. More than 60 messages directed toward him on Instagram contained enough hateful, racist and violent words for him to speak out against such harassment. “There’s a lot of fantasy football people out there, and they think that it’s all fun and games,” Mattison said. “We have families. We have people that love us. We have people that we’re doing this for. It’s not fantasy. This is real life.” STAYING GROUNDED The Vikings have struggled to get their ground game going, prompting the acquisition of running back Cam Akers from the Rams. Running plays have been a problem for the Vikings on the other side of the ball, too. They gave up 259 rushing yards to the Eagles, getting trampled by D’Andre Swift down the stretch when a stop or two could’ve translated into a comeback victory. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. The Chargers rushed for 234 yards in their opening loss to the Dolphins, when Austin Ekeler suffered an ankle sprain that kept him out against the Titans. Joshua Kelley would start if Ekeler is sidelined again. ___ AP Sports Writer Joe Reedy in Costa Mesa, California, contributed to this report. ___ AP NFL: https://apnews.com/hub/NFL Advertisement Advertisement","pubDate":"2023-09-21 23:22:59","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"bf945df501d0177cd3bcf33126f974a0","title":"Browns hope to keep moving without Nick Chubb as they start anew against Derrick Henry, Titans","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/browns-hope-to-keep-moving-without-nick-chubb-as-they-start-anew-against-derrick-henry-titans","keywords":["NFL"],"creator":["Tom Withers, The Associated Press"],"video_url":null,"description":"CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the […]","content":"CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the recent history of their opponent Sunday to know that everything could turn out OK. Read this article for free: Already have an account? To continue reading, please subscribe: * CLEVELAND (AP) — As the brutal reality of losing star running back Nick Chubb for the rest of this season sunk in, the Cleveland Browns only needed to trace the recent history of their opponent Sunday to know that everything could turn out OK. Tennessee has been there, done that. Two years ago, the Titans lost All-Pro Derrick Henry halfway through the season with a broken foot. Not only did Tennessee survive the rest of the way without its rampaging running back, the Titans somehow flourished, finishing 12-5 and as the No. 1 seed in the AFC playoffs. The Titans (1-1) didn’t panic after losing Henry, who was on his way to another rushing title. The Browns (1-1) can only hope to be as stoic without Chubb, the four-time Pro Bowler who suffered a season-ending and career-threatening left knee injury Monday night in Pittsburgh. The sight of seeing Chubb in tears while being carted off shook many of his teammates. It was the kind of moment that can define a season. “You can’t replace 24,” Browns All-Pro guard Joel Bitonio said, referring to Chubb’s number. “But I think we have pieces that we can try and put together, a puzzle that can look similar to what we did with Nick.” The Titans were in a similar scramble mode in 2021 after Henry went down. But Tennessee stuck with its run-first, run-often offensive approach, and with Dontrell Hilliard and D’Onta Foreman filling in, the Titans finished fifth in the league, averaging 141.5 yards rushing per game. Cleveland defensive coordinator Jim Schwartz watched it. He was a senior advisor in Tennessee that season, and was impressed with how Titans coach Mike Vrabel failed to let Henry’s loss overwhelm his team. “He stays the course,” Schwartz said of Vrabel. “He’s very resilient that way, and it flowed over to the team. Part of that job of the head coach is to make sure everybody knows, ‘Hey, it’s going to be OK, we have a plan, we have good players behind.’” The Browns didn’t have much time to process losing Chubb, who was injured in the second quarter of a 26-22 loss to the Steelers. Second-year back Jerome Ford came in and caught a 3-yard TD pass one play after Chubb’s horrific injury. A fifth-round pick from Cincinnati who began his college career at Alabama, Ford later ripped off a 69-yard run and finished with 106 yards on 16 carries. Coach Kevin Stefanski plans to use Ford as his feature back, and the Browns brought in some insurance this week by re-signing Kareem Hunt, who spent four seasons in a tandem with Chubb before Cleveland elected not to retain him. While the personnel might be different, the Titans don’t expect the Browns to stray from their ground game. “It don’t really matter who’s back there,” said two-time Pro Bowl defensive lineman Jeffery Simmons. “You know they trust their offensive linemen. At the end of the day, it’s about how are we going to be able to hold up against their offensive line against the run game.” WHERE’S WATSON? The Browns are still waiting for Deshaun Watson to play like an elite, $230 million quarterback. To this point, he has been an average player with an above average contract. In eight starts over two seasons, Watson is 4-4 with nine touchdowns, seven interceptions and not nearly as many dazzling, highlight-reel type plays as expected. He’s coming off a rough performance at Pittsburgh that did nothing to quiet his critics, and after two games he’s 31st in completion percentage (55.1) and 30th in rating (69.1). Still, Vrabel, who spent a season with Watson in Houston, knows how dangerous he can be from any spot on the field. “He extends plays,” he said. “He’s got great play strength in the pocket to wait out receivers, to get him through to the second window, extends plays. Got length, stiff arm and will scramble and can run to get what he needs to get to, can throw the ball to all parts of the field.” GROUP PLAN Henry has only rushed for 140 yards through two games, but it’s only a matter of time before he gets rolling. Once he does, look out. At 6-foot-3, 250 pounds, there’s few more intimidating sights than Henry at full speed. “He’s a guy that you can stop nine times in a row and in the 10th time he can go 90 yards for a touchdown,” Schwartz said. “We’re going to tackle well, we’re going to have to be physical and we’re going to have to get hats to the ball. Tackling Derrick Henry isn’t a 1-on-1 thing, it’s an 11-on-1 thing and we have to have that mentality going in.” FAMILIAR FACE Along with Vrabel, most of the Titans know Watson well after facing him twice a year as AFC South rivals. Two-time All-Pro safety Kevin Byard knows better than to underestimate him. “He’s playing a different style of offense,” Byard said. “They’re going to run the ball more, but he likes taking shots down the field. So I think first and foremost for our defense, we’ve got to stop the run and on the second half just really just making sure that we’re defending those deep shots.” POCKET PROTECTOR The Titans aren’t doing enough to keep quarterback Ryan Tannehill upright. Only six teams have allowed more sacks than the Titans with Tannehill being taken down eight times, including five last week by the Los Angeles Chargers. One of those was the fastest sack by a defender this season as Kenneth Murray needed only 2.31 seconds to get the Titans quarterback. Tennessee’s offensive line already had four new starters before rookie left guard Peter Skoronski had an appendectomy Sept. 16. Vrabel knows the Titans’ front five have their hands full this week against a rebuilt Cleveland defensive line led by All-Pro end Myles Garrett. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. “I don’t think there’s too many guys walking the earth like Myles Garrett,” Vrabel said. “So we’ll be in for a huge challenge.” ___ AP Sports Writer Teresa Walker in Nashville, Tennessee, contributed. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:15:45","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"483af6cebea6e47b9fea21d906d227fd","title":"Unai Emery urges Aston Villa to adapt quickly to demands of European football","link":"https://www.newsr.in/n/Sports/1zpnjb4bhv/Unai-Emery-urges-Aston-Villa-to-adapt-quickly.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Unai Emery insists Aston Villa must learn how to handle European football and refused to blame his changes after their sloppy 3-2 defeat at Legia Warsaw. Ernest Muci’s second-half winner clinched a deserved victory for the hosts to ruin Villa’s Europa Conference League debut. Jhon Duran and ... Reported by SoccerNews.com 30 minutes ago.","content":"Thursday, 21 September 2023 ( 3 hours ago ) Unai Emery insists Aston Villa must learn how to handle European football and refused to blame his changes after their sloppy 3-2 defeat at Legia Warsaw. Ernest Muci’s second-half winner clinched a deserved victory for the hosts to ruin Villa’s Europa Conference League debut. Jhon Duran and Lucas Digne twice levelled for the underwhelming visitors […] 👓 View full article","pubDate":"2023-09-21 23:13:07","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6f5aa161824729ab55024934de1bbaa9","title":"Premier League fantasy football tips: Is it time to play your wildcard?","link":"https://www.newsr.in/n/Sports/1zpnjb4bhp/Premier-League-fantasy-football-tips-Is-it-time.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Will you stick or twist when it comes to playing your fantasy football wildcard? Alistair Bruce-Ball previews gameweek six. Reported by BBC Sport 31 minutes ago.","content":"Thursday, 21 September 2023 ( 1 hour ago ) Will you stick or twist when it comes to playing your fantasy football wildcard? Alistair Bruce-Ball previews gameweek six. 👓 View full article","pubDate":"2023-09-21 23:12:37","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"ae3b0f392aa75cba209a4adc5bb8080a","title":"Surprising Buccaneers face defending NFC champion Eagles in prime-time matchup of unbeaten teams","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/surprising-buccaneers-face-defending-nfc-champion-eagles-in-prime-time-matchup-of-unbeaten-teams","keywords":["NFL"],"creator":["The Associated Press"],"video_url":null,"description":"PHILADELPHIA (2-0) at TAMPA BAY (2-0) Monday, 7:15 p.m. EDT, ABC FANDUEL SPORTSBOOK NFL LINE: Eagles by 5 1/2. Tampa Bay Buccaneers quarterback Baker Mayfield (6) throws a pass during […]","content":"PHILADELPHIA (2-0) at TAMPA BAY (2-0) Read this article for free: Already have an account? To continue reading, please subscribe: * PHILADELPHIA (2-0) at TAMPA BAY (2-0) Monday, 7:15 p.m. EDT, ABC FANDUEL SPORTSBOOK NFL LINE: Eagles by 5 1/2. AGAINST THE SPREAD: Philadelphia 2-0; Tampa Bay 2-0. SERIES RECORD: Buccaneers lead 11-10, including postseason. LAST MEETING: Buccaneers beat Eagles 31-15 on Jan. 16, 2022, in NFC wild-card game in Tampa, Fla. LAST WEEK: Eagles beat Vikings 34-28 in Philadelphia; Buccaneers defeated Bears 27-17 at home. EAGLES OFFENSE: OVERALL (11), RUSH (2), PASS (29), SCORING (5). EAGLES DEFENSE: OVERALL (26), RUSH (1), PASS (31), SCORING (16). BUCCANEERS OFFENSE: OVERALL (13), RUSH (19), PASS (9), SCORING (16). BUCCANEERS DEFENSE: OVERALL (9), RUSH (2), PASS (24), SCORING (T-8). TURNOVER DIFFERENTIAL: Eagles plus 4; Buccaneers plus-5. EAGLES PLAYER TO WATCH: RB D’Andre Swift ran a for career-best 175 yards on 28 carries in last week’s win over the Vikings. The Bucs defense has limited opponents to 52 yards per game rushing. Only the Eagles (51) have been better stopping the run. BUCCANEERS PLAYER TO WATCH: QB Baker Mayfield has played turnover-free ball through two games, helping the Bucs to a surprising 2-0 start. His 104.4 passer rating is the highest of his career at this point in a season. He’s been especially good on third down, completing 20 of 23 passes (87 percent) for 201 yards and two touchdowns. KEY MATCHUP: Eagles QB Jalen Hurts against a rejuvenated Tampa Bay defense coming off limiting the Bears to 236 yards. With eight sacks and five takeaways through two games, the unit led by Shaquil Barrett, Devon White and Lavonte David appears to be back on track after being inconsistent last season. Hurts has won 19 of his past 20 regular season starts. Only five other quarterbacks —Tom Brady (twice), Patrick Mahomes, Jim McMahon, Peyton Manning and Joe Montana — have accomplished that during the Super Bowl era. KEY INJURIES: Eagles WR Quez Watkins (hamstring) was limited during last week’s win over Minnesota. His status for Monday night is uncertain. The Bucs placed backup RB Chase Edmonds (knee) on injured reserve early in the week. CB Carlton Davis (toe) and DL Calijah Kancey (calf) did not play against the Bears. A decision on their availability may not be made until the weekend. Fridays The Free Press sports editor keeps you up to date on all that’s happening on the ice, the field, the court, and places in between. SERIES NOTES: The Buccaneers have won four straight in the series, including an NFC wild-card playoff victory two seasons ago. They are 2-0 against Hurts, who also lost a regular-season game to Tampa Bay in 2021. STATS AND STUFF: This is the only Week 3 matchup featuring unbeaten teams. … The Eagles, who won their first eight games a year ago, are looking to start 3-0 in consecutive seasons for the first time since 1992-93. Tampa Bay last started 3-0 in 2005. … The Bucs (plus-5) and Eagles (plus 4) rank second and third in the league in turnover ratio behind Dallas (plus 7). … Eagles QB Jalen Hurt has been sacked seven times in two games. He ran for two touchdowns last week against the Vikings. His next game with multiple TDs rushing will be the 10th of his career, tying Cam Newton’s NFL record for a quarterback. … Bucs WR Mike Evans had six receptions for 171 yards and a touchdown against the Bears. He’s the only player in the league who had six-plus catches and a TD in Weeks 1 and 2. … Bucs WR Chris Godwin has six or more catches in a franchise-best 16 consecutive games, the longest active streak in the NFL. FANTASY TIP: Evans had nine receptions for 117 yards and a touchdown the previous time the Bucs faced the Eagles (Tampa Bay’s 31-15 NFC wild-card playoff win in January 2022). He also has a knack for shining in prime time, with at least five catches and a TD in six of seven Monday night games. ___ AP NFL coverage: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:12:24","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"9489fe8ec93091a2614d9ba93c659f36","title":"Roberto De Zerbi happy with Brighton players despite defeat to AEK Athens","link":"https://www.freepressseries.co.uk/sport/national/23805963.roberto-de-zerbi-happy-brighton-players-despite-defeat-aek-athens/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Brighton were undone by an AEK side who made the best of what little they created.","content":"Despite dominating the ball and dictating the shape of the game in wet and difficult conditions at the Amex Stadium, Brighton were undone by an AEK side who made the best of what little they created and were clinical when their moments came. First, the right-back Djibril Sidibe dashed into the box unmarked at a corner and flew into a superb diving header that nestled in the corner. FT: Defeat in our opener. 😩 [2-3] 📲 // 🔵⚪️ — Brighton & Hove Albion (@OfficialBHAFC) It was a lead they twice should have doubled when striker Levi Garcia went through on goal, first denied by goalkeeper Jason Steele then sliding the ball beyond the post as two glorious chances were wasted. Brighton hit back through a penalty from Joao Pedro after a VAR check, the same means by which they levelled for a second time after the break. In between, Mijat Gacinovic had restored AEK’s lead, sliding in at a free-kick to finish from near the penalty spot. Brighton were missing the injured Lewis Dunk in defence and his absence was felt again when substitute Ezequiel Ponce was given space on the counter-attack to win it for the Greek champions late on. “We conceded three goals,” said De Zerbi. “Two goals in set pieces and one incredible goal, the third. We made some mistakes in the (final third) of the pitch, for example the chance of Joao Pedro in the second half, or the chance for Igor in the first half. But in terms of quality of play we played a very good game, I think. “I’m really proud for the performance. I think we showed not the right experience, or maybe not the same experience as AEK Athens. “But for the rest I think we played with personality and with the right attitude. We controlled the game, we dominated the game. And we are sad for the result. “We are sad because we couldn’t make happy our fans, ourselves, our club. But we have to analyse the performance and the performance was good. “We can learn. We have to learn. We can improve, but it’s difficult to accept this defeat. I congratulated the players 10 minutes ago, because I can’t be happy when we win at Old Trafford and sad today if the performances are both good performances. “We have to know, and we knew before the game, that AEK had two situations where they could score; set-pieces and counter-attack. And when we’re defending set-pieces against this team, we have to be more focused, more with the right attitude, more smart to defend the set-pieces.” De Zerbi confirmed that Dunk and striker Evan Ferguson had been ruled out of contention earlier on Thursday. “Dunk couldn’t play because after the game with Man United he felt a problem,” he added. “This afternoon Evan had a temperature, he is ill.” AEK manager Matias Almeyda reflected on a win which he hoped will help cement his team’s reputation as a serious European force this season. “We work on the basis of playing a type of football based on team work,” he said. “I live my life the way I manage the team. I like to respect people and I like to be respected. We want to be respected in Europe and we wanted to get a result to gain that respect. “We have been working together for over a year. We came here in order to play our usual game. The opposition on a number of occasions forced us to play a different kind of game. But it’s spirit of the team, a fighting spirit, and that’s what we have managed to achieve. To keep on fighting.”","pubDate":"2023-09-21 23:11:30","image_url":"https://www.freepressseries.co.uk/resources/images/17253205/?type=app&htype=0","source_id":"freepressseries","source_priority":6510927,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4e1938848804597e9aa376642cf8cc10","title":"Seahawks set to host Panthers and honor the past while focused on the present","link":"https://www.winnipegfreepress.com/sports/football/nfl/2023/09/21/seahawks-set-to-host-panthers-and-honor-the-past-while-focused-on-the-present","keywords":["NFL"],"creator":["Tim Booth, The Associated Press"],"video_url":null,"description":"SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. But not everyone can […]","content":"SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. Read this article for free: Already have an account? To continue reading, please subscribe: * SEATTLE (AP) — This weekend, the Seahawks will celebrate their history by honoring the team that brought Seattle its only Super Bowl championship 10 years ago. But not everyone can fully participate in the celebratory part of the weekend. Pete Carroll is still coaching. Bobby Wagner is still playing linebacker. And while they expect to appreciate this weekend’s events, they still have to focus on Sunday’s task of facing the Carolina Panthers. “I think there’s a balance. As I get older, you have to enjoy some of the things,” Wagner said. “Obviously, I’m going to be locked in, I’m going to be focused, so I won’t do everything. I definitely want to be around those guys, but a lot of those guys live in Seattle. I see them pretty often. It’s not going to be any different. It’s just I have a jersey on, and they don’t.” It was Wagner’s passionate speech last week that helped Seattle (1-1) refocus after its opening loss to the Los Angeles Rams. The Seahawks ultimately pulled out a 37-31 overtime win at Detroit last Sunday. It’s the same kind of leadership Wagner showed a decade ago when he was in his second year and an anchor to that Super Bowl-winning defense. “This is a once-in-a-lifetime deal when you have your 10-year anniversary of something like this. He’s those guys, they’re the same,” Carroll said. The Panthers (0-2), meanwhile, are focused on their future. It’s been a rocky start for Carolina in its first season under Frank Reich as the only team in the NFC South without a win. Much of it has to do with injuries. No. 1 overall pick Bryce Young is unlikely to play on Sunday due to an ankle injury. Young played the entire game in Carolina’s 20-17 loss to New Orleans last Monday, but came out of the game with the ankle issue. If he doesn’t play, 13-year veteran Andy Dalton would make his fifth career start against the Seahawks. Dalton is 3-1 in those previous starts, including last season when he led New Orleans to a 39-32 win. “I’m just going to operate like I know that I can. I think for me it starts with being myself pushing guys, pushing the tempo, doing everything that we need to do to give ourselves a chance,” Dalton said. GENO’S REBOUND After a shaky performance in the opener, Geno Smith was terrific in Week 2, throwing for 328 yards and two touchdowns against the Lions. Smith was able to open up an intermediate passing game that was absent against the Rams and allowed the Seahawks to push the ball downfield a little more. “We played one bad half of offensive football, and just for us to answer and just come out and put up the amount of points that we did, for Geno (Smith) to have the type of day that he did, then the O-line to play the way that they did just really speaks volumes of the type of offense that we can have,” receiver DK Metcalf said. REPLACING SHAQ Shaq Thompson has been a mainstay for the Panthers at linebacker for the last nine seasons. But Carolina will be without its emotional leader on defense for the remainder of the season after he broke his leg in Monday night’s loss to the Saints. Kamu Grugier-Hill, who has been in the league since 2016 and has spent time with five other teams, will take Thompson’s spot. Linebacker Frankie Luvu said losing Thompson, who played collegiately at Washington, was an emotional blow for the Panthers because his impact goes beyond his production on the field. “He kind of does everything for us,” Luvu said. “He’s kind of like that glue for the team. Losing a leader like that just hurts.” CORNERBACK DEPTH The Seahawks are fortunate to have depth at cornerback, especially with standout Riq Woolen unlikely to play after suffering a chest injury last week against the Lions. Rookie first-round pick Devon Witherspoon stepped in at Woolen’s spot and Tre Brown — finally healthy after injuries derailed his first two seasons — had a sack and an interception return for a touchdown. It’s likely Witherspoon and Brown will start against the Panthers. RUNNING THE ROCK The Panthers would like to recommit to running the ball in the loud environment at Seattle, which likely means a healthy dose of Miles Sanders. The free-agent pickup from the Philadelphia Eagles has just 115 yards rushing in two games despite coach Frank Reich saying he expected Sanders to be the team’s three-down back. Chuba Hubbard will also see action. Thursdays Keep up to date on sports with Mike McIntyre's weekly newsletter. One of the problems for the Panthers on offense has been “getting behind the sticks,” Reich said. With two inexperienced guards in rookie Chandler Zavala and Cade Mays, Carolina hasn’t been able to establish the run and put itself in second- and third-and-short situations. ___ AP Sports Writer Steve Reed contributed to this report. ___ AP NFL: https://apnews.com/hub/nfl Advertisement Advertisement","pubDate":"2023-09-21 23:02:21","image_url":null,"source_id":"winnipegfreepress","source_priority":101538,"country":["canada"],"category":["sports"],"language":"english"}]}