{"newsArray":[{"article_id":"e6c5a087906aca9dbc7de35ed1f80204","title":"Boca Juniors y Fluminense piden una final de Libertadores sin violencia","link":"https://esto.com.mx/776234-copa-libertadores-equipos-piden-final-sin-violencia/","keywords":["Libertadores","boca juniors","Copa Libertadores","Fluminense","top3"],"creator":["Diana Rojas"],"video_url":null,"description":"Los dirigentes de Boca y Fluminense en coordinación con la Conmebol organizaron un operativo para la final de la Libertadores The post Boca Juniors y Fluminense piden una final de Libertadores sin violencia appeared first on ESTO.","content":"en Rio de Janeiro este sábado 4 de noviembre. Hace unos días, los aficionados argentinos comenzaron a llegar a territorio brasileño, donde de inmediato comenzó la violencia y la provocación con los rivales. Derivado de dicha situación, el pasado viernes, durante la final de la Copa Libertadores de América. Disfrutemos de la Final de la CONMEBOL con respeto y sin violencia. Vamos desfrutar da Final da CONMEBOL com respeito e sem violência. , aseguró el presidente de Fluminense Mário Bittencourt. “Esto es una fiesta, al fiesta del futbol sudamericano. Pedirle a la gente por favor que respete a l contrincante .”, señaló Jorge Amor Ameal, presidente de Boca. Mediante redes sociales, la barra del Flu informó que tras una reunión con la directiva del equipo brasileño, decidieron firmar un pacto de cese inmediato a los conflictos con la afición de Boca Juniors. ” Independientemente de la nacionalidad, Las pasiones del club no están por encima del honor o la dignidad humana Que se separe el trigo de la paja, que el castigo caiga sobre quien corresponda”, expresaron. COMUNICADO CONJUNTO DAS TORCIDAS ORGANIZADAS DO FLUMINENSE FOOTBALL CLUB Em reunião realizada com a diretoria do Fluminense FC, na tarde de hoje, as torcidas organizadas do Fluminense celebraram um pacto para que os conflitos sejam cessados imediatamente com torcedores do Boca…","pubDate":"2023-11-04 15:14:22","image_url":null,"source_id":"esto_mx","source_priority":104236,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"aa50eedc3b12036893220fc8a45b1b04","title":"Lionel Messi Insists He Is Done With European Football","link":"https://www.naijanews.com/2023/11/04/lionel-messi-insists-he-is-done-with-european-football/","keywords":["Sports","2023 Ballon d'Or","FC Barcelona","Inter Miami","Lionel Messi"],"creator":["Ernest Victor"],"video_url":null,"description":"Argentina football icon, Lionel Messi, has insisted that he is done with European football, which means that he doesn’t intend to play for any European club again. Messi arrived in Europe in 2000 from the Argentine club, Newell’s Old Boys, to FC Barcelona, who oversaw his development through their prestigious football academy, La Masia. He […] The post Lionel Messi Insists He Is Done With European Football appeared first on Naija News.","content":"Argentina football icon, Lionel Messi, has insisted that he is done with European football, which means that he doesn’t intend to play for any European club again. Messi arrived in Europe in 2000 from the Argentine club, Newell’s Old Boys, to FC Barcelona, who oversaw his development through their prestigious football academy, La Masia. He got into FC Barcelona’s senior team in 2004 after going through the robes, and since then, he has been unstoppable in the game. Before he left Barcelona for Paris Saint Germain in 2021, Lionel Messi won a club-record 34 trophies, including ten La Liga titles, seven Copa del Rey titles and four UEFA Champions League titles. Despite being booed at PSG, Messi, who is currently 36-year-old helped the French club to win the league title twice, and the Trophée des Champions once. Messi left European club football in July 2023 for Major League Soccer (MLS) in the United States, where he currently plays for Inter Miami, which is co-owned by English football legend David Beckham. On Monday, October 30, Lionel Messi became the first player in the history of football to win the Ballon d’Or a record eight times. He achieved this feat after leading Argentina to win the 2022 FIFA World Cup in Qatar. After winning his 8th Ballon d’Or, Messi, who is always linked with a possible return to FC Barcelona, told French publication, L’Équipé that he has no business playing football in Europe again. He said, “Is European football closed for you? Yes. Thanks to God, I had an extraordinary career in Europe and won everything I have dreamed of”. “Now that I have decided to come to the USA, I don’t think I will ever return to playing in Europe”.","pubDate":"2023-11-04 14:37:38","image_url":null,"source_id":"naijanews","source_priority":9385,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"1778feaed9317fd20624e7d582e637c5","title":"Three things Erik ten Hag got wrong and one right as Man Utd snatch late win at Fulham","link":"https://www.dailystar.co.uk/sport/football/manchester-united-erik-ten-hag-31360807","keywords":["Sport"],"creator":null,"video_url":null,"description":"Erik ten Hag's side have again played well below par, and Daily Star Sport looks at what the Dutchman got wrong as United escaped with three point against Fulham","content":"\"Play like you mean it,\" demanded the fans - as they pleaded with their beloved side following a week of new lows for the Red Devils. could have been left venting at the controversial VAR decision that saw Scott McTominay's strike ruled out in the eighth minute. But the bottom line is he will be a very relieved man tonight because the Red Devils were way off the pace again, and they can count themselves lucky to escape with the three points. Bruno Fernandes did what captains should do and led by example with a 90th minute winner, for another late United strike. Here, looks at three things the Dutchman got wrong but one crucial decision he got right during his team's trip to Craven Cottage. Anybody that watched Antony at will understand why Ten Hag has so much faith in the Brazilian - he was electric in Amsterdam, tearing apart teams at his will. However, for whatever reason, it's never quite clicked in Manchester. Antony was handed a starting spot against , and he again failed to impress. Red Devils fans are getting more vocal in their desire to see Facundo Pellistri introduced into the squad. And many were left baffled by the chance to blood the youngster against a Fulham side they should really be beating. Scott McTominay has reinvented himself as a goalscoring midfielder in recent months - but outside of a controversial VAR call, he was largely anonymous. And it didn't help his midfield partner was Christian Eriksen, with some United fans even questioning if he was actually on the pitch. One fan fumed: \"Eriksen needs to come off, not been in the game at all and him as the deepest midfielder is a recipe for disaster on the counter attack!\" Fulham were able to control the midfield, with Ten Hag having players like Sofyan Amrabat and Mason Mount on his bench. Outside of hooking Antony for Pellistri, Ten Hag didn't make another change until the 78th minute. It was a strange decision, given how underwhelming United were on the pitch. \"I honestly can't understand why Ten Hag is persisting with this midfield that isn't even working,\" one fan fumed. While a second added: \"I’ve officially seen enough...can’t make subs when they are clearly needed!\" Eriksen was eventually subbed for Mount, while Anthony Martial was brought on in place of Rasmus Hojlund. Harry Maguire's career at the Red Devils has been tumultuous, but he was the best player on the park for Ten Hag's side on Saturday. Maguire was offside for United's disallowed goal, but that's all he did wrong at Craven Cottage. The Englishman was a rock at the back, constantly repelling Fulham's attacks, and even clearing the ball off the line. Bruno Fernandes has Maguire to thank for the fact he was able to find the net to win the game in the 90th minute.","pubDate":"2023-11-04 14:35:20","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360900.ece/ALTERNATES/s98/0_Britain-Soccer-Premier-League-23308513590650.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7aba289896595a0690b1f754623d9aad","title":"Leo Messi: \"Cristiano Ronaldo y yo merecemos mucho crédito\"","link":"https://www.diariodigital.com.do/2023/11/04/leo-messi-cristiano-ronaldo-y-yo-merecemos-mucho-credito.html/","keywords":["Deportes","Fútbol","Leo Messi"],"creator":["Servicios de Europa Press"],"video_url":null,"description":"\"No creo que vuelva a jugar nunca en Europa, pero volveré a vivir en Barcelona\" MADRID, 4 Noviembre del 2023.-El delantero argentino Leo Messi, ganador del Balón de Oro 2023, ha asegurado tanto el portugués Cristiano Ronaldo como él merecen \"mucho crédito\" por haber librado \"una buena batalla a nivel deportivo\" durante tantos años, y […] Source","content":"\"Fue una muy buena batalla a nivel deportivo. Nos alimentamos mutuamente de esta rivalidad, porque ambos somos grandes competidores. Cristiano también quiso ganarlo todo. Fue un momento muy agradable para ambos y para todos los que aman el fútbol. Creo que merecemos mucho crédito por haber podido permanecer en la cima durante tanto tiempo. Es extremadamente difícil mantenerse en la cima durante diez o quince años\", señaló en una entrevista con France Football. En este sentido, afirmó que el Balón de Oro es \"una gran recompensa por todo lo que significa\", pero recalcó que lo importante son \"los premios colectivos\". \"Tuve la posibilidad de ganar todos los títulos posibles en Barcelona, luego con Argentina, y eso es lo más importante para mí\", recalcó. \"Estos ocho Balones de Oro reflejan mi mentalidad y mi motivación, estas ganas de querer superarme día tras día. Siempre dije que me encantaba ganar y que era alérgico a perder\", añadió. Además, confesó a quién ve ganando el premio en el futuro. \"Podría haber una muy buena batalla en los próximos años, con jugadores como Haaland, Mbappé, Vinícius… Muchos jóvenes lucharán por los próximos Balones de Oro. Pienso también en -Lamine- Yamal, que todavía es muy joven pero que ya juega en el Barça y es decisivo. Aparecerán otros jugadores, como ocurre todo el tiempo. Será una nueva era que observaré con placer, desde fuera\", manifestó. También habló sobre la temporada del noruego Erling Haaland y el francés Kylian Mbappé, que le acompañaron en el podio del Balón de Oro este año. \"Haaland hizo una temporada increíble. Marcó muchos goles, ganó la 'Champions' y consiguió el triplete con el Manchester City. Estoy seguro de que será uno de los jugadores que regularmente serán candidatos al Balón de Oro en los próximos años. No me sorprendería que lo ganase muy pronto\", expuso. \"Y Kylian lo mismo: hizo una temporada muy buena, con un Mundial espectacular, casi nos arruina la final con sus goles. Es uno de los futbolistas que puede ganar el premio cada año, porque es uno de los mejores jugadores del mundo\", continuó. En otro orden de cosas, el atacante argentino relató cómo fue su marcha del Paris Saint-Germain y su fichaje por el Inter de Miami. \"Pensé en qué era lo mejor en ese momento para mi familia y para mí. El hecho de haber sido campeón del mundo y haber logrado todos los objetivos que me había propuesto durante mi carrera me permitió pensar más allá del aspecto deportivo, pensar también en el bienestar de toda mi familia, beneficiarme de otro punto de vista. Fue una decisión que tomamos juntos\", desveló. También confesó que volver al FC Barcelona fue una posibilidad. \"Podría haber vuelto al Barça, pero no pudo ser. Mi primera idea siempre fue volver a casa, poder volver a jugar en Barcelona y retirarme allí como siempre había soñado. Pero no fue posible. Entonces tomamos la decisión de venir a Miami\", indicó, negando la posibilidad de recalar en el conjunto azulgrana en el mercado invernal después de que su equipo no lograse alcanzar los 'Playoffs'. \"No, para nada\", dijo categóricamente. Por otra parte, considera que ha pasado página definitivamente del fútbol europeo. \"Sí, creo que sí. Gracias a Dios tuve la suerte de tener una carrera extraordinaria, gané todo lo que soñaba en Europa, donde jugué durante muchos años. Ahora que he dado un paso al venir a Estados Unidos, no creo que vuelva a jugar nunca en Europa. Extrañaré jugar la Liga de Campeones o La Liga por el resto de mi vida, partidos con un sabor especial. Pero lo disfruté tanto como pude, así que no tengo ninguna frustración\", desveló. Sin embargo, sí regresará a la Ciudad Condal una vez terminada su carrera futbolística. \"En principio volveremos a vivir en Barcelona. Es nuestro hogar, donde tenemos nuestras rutinas, nuestros amigos, tanto para mi mujer como para mis hijos y para mí. Pero no tengo idea de qué haré. No lo he pensado todavía y no quiero hacerlo. Quiero disfrutar de mis últimos años como futbolista, haciendo lo que siempre me ha gustado desde pequeño. Y cuando cuelgue las botas, encontraré mi nuevo camino. ¿Entrenador? No lo creo, pero tendrá algo que ver con el fútbol porque es toda mi vida\", expresó. Messi aseguró también que se siente \"bien\" físicamente. \"No pienso en el futuro, avanzo día a día. Me siento bien físicamente. Voy a tener unos meses de vacaciones, nunca me había pasado esto en mi carrera estar parado tanto tiempo. Volveré a entrenar en enero para ponerme en forma durante la pretemporada para conseguir los objetivos que tenemos aquí en el club, pero también para preparar la Copa América. No sé cuánto tiempo más jugaré. Quiero seguir hasta que sienta que no puedo más\", apuntó. Así, no quiere pensar en si podrá defender el título de campeón del mundo de Argentina en el Mundial de Estados Unidos, Canadá y México 2026. \"Queda bastante tiempo. Aunque pase rápido, todavía faltan algunos años para el Mundial y no quiero mirar tan lejos. No se trata de estar por estar, sino de sentirme bien y poder aportar cosas al grupo. Sabiendo la edad que tendré entonces (39), me parece difícil, pero ya veremos cómo me siento físicamente\", señaló. En otro orden de cosas, habló de cómo ve al Barça de Xavi. \"Los sigo, veo los partidos, por supuesto, como cuando jugué en París. Me parece que el equipo ha evolucionado bien desde que llegó. Los jóvenes tienen un nivel excelente. Hay un gran equipo que tiene la oportunidad de poder luchar en todos los frentes este año\", indicó. Recordando la final del Mundial, que considera que fue su \"mejor partido\" con la albiceleste, Messi confesó que \"nunca\" pasó por su mente que fuesen a perder el partido, ni siquiera cuando Kylian Mbappé empató para forzar la prórroga. \"Estaba convencido de que íbamos a ser campeones del mundo pasara lo que pasara. Este empate fue un duro golpe, pero ya habíamos vivido el mismo escenario contra Holanda y, en lugar de derrumbarse, el equipo volvió a hacer una muy buena prórroga\", explicó. Por último, rememoró en qué pensó cuando Gonzalo Montiel anotó el penalti decisivo. \"Por mi cabeza pasaron mil cosas… Es difícil explicar lo que sientes en ese momento. Luché por este sueño toda mi vida\", dijo. \"Era mío, pero también de mi familia, de mis amigos y de toda la Argentina. Me dije a mí mismo 'está bien, lo gané todo'. Cuando vi la copa en el escenario no podía creer que fuera nuestra, que éramos campeones del mundo. Fue la primera vez que tuve la oportunidad de tocarla y al instante quise besarla. Quería disfrutar cada segundo de ese momento\", finalizó.","pubDate":"2023-11-04 14:33:13","image_url":null,"source_id":"diariodigital","source_priority":3537270,"country":["dominican republic"],"category":["sports"],"language":"spanish"},{"article_id":"bf69f4a149c0e14e5af4412f9a191526","title":"Chelsea go top of WSL after thrashing Villa","link":"https://www.skysports.com/football/aston-villa-women-vs-chelsea-women/report/494335","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have moved top of the Women's Super League table after an emphatic 6-0 win at Aston Villa to pile more misery on the hosts.","content":"Chelsea have moved top of the Women's Super League table after an emphatic 6-0 win at Aston Villa to pile more misery on the hosts. But the victory was immediately overshadowed by the bombshell news that manager Emma Hayes will leave Chelsea at the end of the season. Captain Millie Bright fired the visitors in front in the 21st minute before Fran Kirby extended the champions' lead with a close-range effort five minutes later. In the second half, goals from Johanna Rytting Kaneryd, substitute duo Ashley Lawrence and Aggie Beever-Jones and Niamh Charles piled more misery on the visitors. Victory for Chelsea sees Hayes' side leapfrog Manchester City into first place on 13 points. Villa, meanwhile, remain pointless at the foot of the table after five games played. In an open start to the game, it was Chelsea who had the better opportunities as Johanna Rytting Kaneryd came close with a vicious strike and Kirby struck the woodwork. Rachel Daly was made to pay for her missed chance in the 16th minute, firing over the crossbar from point-blank range, as Chelsea took the lead through Bright. The England international fired her shot in on the volley after Mia Fishel had her attempt cleared off the line. How Aston Villa and Chelsea lined up Match stats Women's Super League table Stream the WSL and more with NOW Kirby continued to be dangerous on the counter-attack and deservedly opened her account for the campaign in the 26th minute as she thumped in a close-range rebound after her first shot was blocked. Chelsea continued their dominance in the second half with another four goals. Rytting Kaneryd struck in the 56th minute with a close-range finish after a slick Chelsea counter-attack. Lawrence added a fourth thanks to her right knee as she converted Jessie Fleming's cross before another substitute, Beever-Jones, made it five after a fine solo run down the left flank. In the 74th minute, Chelsea made it six thanks to a fine side-footed volley from Charles into the bottom corner. Please use Chrome browser for a more accessible video player Aston Villa boss Carla Ward speaking to Sky Sports : \"Everybody knows without momentum in football it's tough. When you've lost four games and sometimes you go a couple of goals down, you think you're still in, the third is a sucker-punch of course. \"When the confidence is not there that becomes tough. Like I said it's a tough one, we're in a really tough spot at the moment but that's football and we've got to get out of it. It's my job to do that and I will work tirelessly to try and get this back.\" Aston Villa forward Rachel Daly speaking to Sky Sports : \"The true football people who watch this game will realise that was a gutsy performance. We're in a tough spot, we know it's a long way to go but the belief we have in this team and the staff is massive. \"It doesn't look good but we've got each other's back and a lot of games coming in November. All we can do is turn this around.\" Emma Hayes will leave Chelsea at the end of the season , the WSL club have announced. Chelsea say Hayes is departing \"to pursue a new opportunity outside of the WSL and club football\". Under her leadership, Chelsea have won six FA WSL titles, five Women's FA Cups, two FA Women's League Cups, one FA Women's Spring Series trophy and one FA Women's Community Shield. Hayes also guided the team to a historic double on two occasions and achieved one domestic treble. Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Aston Villa visit Sheff Utd in the Continental Cup on Wednesday, kick-off 7pm. They then visit Bristol City in the WSL on November 12, kick-off 2pm. Chelsea are back in action with a trip to Everton next Sunday, kick-off 1pm. Their Champions League campaign then kicks off, when they head to the continent to face Real Madrid on November 15, kick-off 8pm. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-04 14:30:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-chelsea-women-wsl_6347705.jpg?20231104141633","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6afa3dc5e3adf352f2f389ba8eddaea5","title":"NFL-Deutschland-Chef: 2024 sicher nur ein Spiel in München","link":"https://www.nordbayern.de/sport/mehr-sport/nfl-deutschland-chef-2024-sicher-nur-ein-spiel-in-munchen-1.13752178","keywords":null,"creator":null,"video_url":null,"description":"Frankfurt/Main - Der NFL-Doppelpack in diesem Jahr hat das Interesse der Fans geweckt. Doch 2024 wird wieder das ursprünglich angepeilte Pensum absolviert. Die Teams sind noch nicht bekannt.","content":"Im Jahr 2024 wird nur ein Spiel der amerikanischen Football-Liga NFL in Deutschland stattfinden. Dies bekräftigte NFL-Deutschland-Chef Alexander Steinforth bei ran. \"Wir haben dieses Jahr die Ausnahmesituation gehabt, dass wir das Spiel aus Mexiko auch bekommen haben, da dort das Stadion umgebaut wird. Aber im nächsten Jahr wird es wieder das ursprünglich geplante, eine Spiel geben\", sagte Steinforth. Dieses werde, wie schon 2022, in der Allianz Arena in München stattfinden. Im Jahr 2025 ist dann wieder Frankfurt am Zug. Die Teams dafür stehen noch nicht fest. Am Sonntag (15.30 Uhr/RTL und DAZN) treffen die Miami Dolphins in Frankfurt auf Super-Bowl-Sieger Kansas City Chiefs. Eine Woche später duellieren sich die New England Patriots und die Indianapolis Colts an gleicher Stelle. Die bisherige Woche verlaufe positiv, sagte Steinforth der Deutschen Presse-Agentur: \"Wir sind sehr zufrieden mit all den Dingen, die jetzt schon in Frankfurt passiert sind. Die Dolphins haben schon sehr viel gemacht, trainiert, waren auch in der Stadt unterwegs. Man sieht es gerade, wenn man durch Frankfurt läuft, wie viel hier gerade vor Ort passiert. All das, was wir geplant haben, was die Teams geplant haben, erweckt gerade zum Leben.\"","pubDate":"2023-11-04 14:17:31","image_url":null,"source_id":"nn_de","source_priority":2872166,"country":["germany"],"category":["sports"],"language":"german"},{"article_id":"a3c41d2d992c5339a4cbcffdaa265e46","title":"NPFL: Photos, Capacity Of Best Stadiums In Nigerian Premier Football League","link":"https://www.naijanews.com/2023/11/04/npfl-photos-capacity-of-best-stadiums-in-nigerian-premier-football-league/","keywords":["Sports","Nigerian Football","Nigerian Premier Football League (NPFL)","NPFL","NPFL stadiums"],"creator":["Ernest Victor"],"video_url":null,"description":"The social media handlers of the Nigeria Premier Football League (NPFL) have compiled the best ten stadiums in the league for the 2023-2024 season. Among the top ten stadiums, the NPFL stadium that has the largest seating capacity is the Adokiye Amiesimaka Stadium in Port Harcourt, Rivers. The stadium is the home ground for Rivers […] The post NPFL: Photos, Capacity Of Best Stadiums In Nigerian Premier Football League appeared first on Naija News.","content":"The social media handlers of the Nigeria Premier Football League (NPFL) have compiled the best ten stadiums in the league for the 2023-2024 season. Among the top ten stadiums, the NPFL stadium that has the largest seating capacity is the Adokiye Amiesimaka Stadium in Port Harcourt, Rivers. The stadium is the home ground for Rivers United and has 38,000 seating capacity. According to the NPFL ratings, the stadium is the 6th best stadium in the 2023-2024 NPFL season, and it is one of the few stadiums in the Nigerian league that has a natural turf. Another NPFL Stadium that has a natural playing surface is Godswill Akpabio International Stadium, which is the home ground of Akwa United and is currently rated as the best stadium in the NPFL. Others are Samuel Ogbemudia Stadium in Benin, Edo state, used by Bendel Insurance, and Lekan Salami Stadium in Ibadan, Oyo state, used by Shooting Stars. Below are the top ten stadiums in the 2023-2024 NPFL season: 1. Godswill Akpabio International Stadium Uyo. 30,000 capacity Natural Turf. (Akwa United FC) 2. Samuel Ogbemudia Stadium Benin. 12,000 capacity Natural Turf. (Bendel Insurance FC) 3. Lekan Salami Stadium Ibadan. 10,000 capacity Natural Turf (Shooting Stars FC). 4. Mobolaji Johnson Arena Lagos, formerly known as Onikan Stadium. 10,000-capacity Artificial Turf (Sporting Lagos FC). 5. Remo Stars Stadium Ikenne Ogun state. 5,000 Capacity Artificial Turf (Remo Stars FC). 6. Adokiye Amiesimaka Stadium Port Harcourt. 38,000-capacity Natural Turf (Rivers United). 7. Muhammadu Dikko Stadium Katsina. 35,000 capacity. Artificial Turf (Katsina United FC). 8. Sani Abacha Stadium Kano 16,000-capacity Artificial Turf (Kano Pillars FC). 9. Enyimba International Stadium Aba 16,000-capacity Artificial Turf (Enyimba FC). 10. Pantami Stadium Gombe 12,000-capacity Artificial Turf. (Gombe United and Doma United).","pubDate":"2023-11-04 14:13:55","image_url":null,"source_id":"naijanews","source_priority":9385,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"d54bde090225e00f40b52cb7200a6d55","title":"Man Utd fans send flops clear message on huge banner as Erik ten Hag side battle Fulham","link":"https://www.dailystar.co.uk/sport/football/manchester-united-fans-banner-fulham-31360757","keywords":["Sport"],"creator":null,"video_url":null,"description":"Man Utd fans unfurled a banner getting stuck in their players ahead of their away trip to Fulham on Saturday as pressure on Erik ten Hag mounts","content":"fans unfurled a banner in the away end taking aim at the team’s recent miserable performances. ’s side travelled to Craven Cottage on Saturday lunchtime under mounting pressure off the back of a terrible performance and result in the Manchester Derby and in the EFL Cup against to compound the Red Devils’ terrible start to the season. United arrived in West London 8th in the table needing a win and a good performance to release the pressure on Ten Hag and his flailing squad. And some fans in the away end chose to make their recent displeasure plain ahead of the game. In an attempt to see a United performance with more energy and determination fans held up a sign reading: “Play like you mean it!!” as the player warmed up. But the message seemed to go a miss in the first half which saw yet another uninspiring United performance. Scott McTominay believed he had opened the scoring after just seven minutes but an offside against Harry Maguire who was deemed to be interfering with play following a lengthy VAR. United never got into a flow again and a drab rest of the half ensued. United began the second half brighter as Alejandro Garnacho tested Bernd Leno before his cross that would’ve let Rasmus Hojlund with a tap in was deflected over the bar. A desperately needed three points would see United temporarily climb into 6th place ahead of and Newcastle. But arguably as important is a sharp increase in a level of performance that has been rock bottom in recent weeks and frustration has clearly told on the supporters. It’s said that Ten Hag’s immediate future is secure with club CEO Richard Arnold willing to bide his time and hope that the Dutchman can pull United’s form and struggling players out of the fire.","pubDate":"2023-11-04 14:08:30","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360759.ece/ALTERNATES/s98/3_Fulham-FC-v-Manchester-United-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"847b68df6be5d1eff253b625d6bff7b4","title":"Arsenal under 18s game at Brighton postponed after team 'travel to Bournemouth by mistake'","link":"https://www.dailystar.co.uk/sport/football/arsenal-u18s-brighton-bournemouth-mistake-31360699","keywords":["Sport"],"creator":null,"video_url":null,"description":"An Arsenal youth game against Brighton has been postponed after the Gunners were mistakenly driven to Bournemouth, some two-and-half hours down the coast","content":"U18s clash against has been hilariously postponed after the team travelled to the wrong town. The fixture was scheduled to kick-off at the Seagulls' Amex Stadium at 12pm on Saturday, but the start was delayed by half-an-hour when the Gunners failed to turn up. It later transpired that they'd travelled to Bournemouth by mistake - a whopping 95 miles out of their way - and the game was then postponed. Fans on social media thought the whole thing was a farce. One X user wrote: \"Who is the driver? Was he drunk?\" Another said: \"How does this happen in this day and age?\" \"Hahaha the driver literally had one job. He's finito,\" wrote a third, while a fourth joked: \"Should've gone to Specsavers.\" were looking to extend their unbeaten run in all competitions to four matches. The team, who are managed by Gunners icon Jack Wilshere, are seventh in the U18 , having won three of their first eight games of the season. Wilshere took charge of the team just a few days after hanging up his boots in 2022. He led the team to the final of the 2022/23 FA Youth Cup in his first season in charge, though they lost the game to . The Gunners' U18s side have never won the U18 Premier League since its inception in 2012. They are, however, one of the most successful teams in FA Youth Cup history, having won the competition seven times (only and have won more). TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month","pubDate":"2023-11-04 13:57:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360756.ece/ALTERNATES/s98/0_GettyImages-1614990406.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5c3c25a9dfbe98e22fe13cd4fef90c17","title":"Arsenal under 18s game at Brighton postponed after team 'travel to Bournemouth by mistake'","link":"https://www.dailystar.co.uk/sport/football/arsenal-under-18s-game-brighton-31360699","keywords":["Sport"],"creator":null,"video_url":null,"description":"An Arsenal youth game against Brighton has been postponed after the Gunners were mistakenly driven to Bournemouth, some two-and-half hours down the coast","content":"U18s clash against has been hilariously postponed after the team travelled to the wrong town. The fixture was scheduled to kick-off at the Seagulls' Amex Stadium at 12pm on Saturday, but the start was delayed by half-an-hour when the Gunners failed to turn up. It later transpired that they'd travelled to Bournemouth by mistake - a whopping 95 miles out of their way - and the game was then postponed. Fans on social media thought the whole thing was a farce. One X user wrote: \"Who is the driver? Was he drunk?\" Another said: \"How does this happen in this day and age?\" \"Hahaha the driver literally had one job. He's finito,\" wrote a third, while a fourth joked: \"Should've gone to Specsavers.\" were looking to extend their unbeaten run in all competitions to four matches. The team, who are managed by Gunners icon Jack Wilshere, are seventh in the U18 , having won three of their first eight games of the season. Wilshere took charge of the team just a few days after hanging up his boots in 2022. He led the team to the final of the 2022/23 FA Youth Cup in his first season in charge, though they lost the game to . The Gunners' U18s side have never won the U18 Premier League since its inception in 2012. They are, however, one of the most successful teams in FA Youth Cup history, having won the competition seven times (only and have won more). TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month","pubDate":"2023-11-04 13:57:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360756.ece/ALTERNATES/s98/0_GettyImages-1614990406.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e6c5a087906aca9dbc7de35ed1f80204","title":"Boca Juniors y Fluminense piden una final de Libertadores sin violencia","link":"https://esto.com.mx/776234-copa-libertadores-equipos-piden-final-sin-violencia/","keywords":["Libertadores","boca juniors","Copa Libertadores","Fluminense","top3"],"creator":["Diana Rojas"],"video_url":null,"description":"Los dirigentes de Boca y Fluminense en coordinación con la Conmebol organizaron un operativo para la final de la Libertadores The post Boca Juniors y Fluminense piden una final de Libertadores sin violencia appeared first on ESTO.","content":"en Rio de Janeiro este sábado 4 de noviembre. Hace unos días, los aficionados argentinos comenzaron a llegar a territorio brasileño, donde de inmediato comenzó la violencia y la provocación con los rivales. Derivado de dicha situación, el pasado viernes, durante la final de la Copa Libertadores de América. Disfrutemos de la Final de la CONMEBOL con respeto y sin violencia. Vamos desfrutar da Final da CONMEBOL com respeito e sem violência. , aseguró el presidente de Fluminense Mário Bittencourt. “Esto es una fiesta, al fiesta del futbol sudamericano. Pedirle a la gente por favor que respete a l contrincante .”, señaló Jorge Amor Ameal, presidente de Boca. Mediante redes sociales, la barra del Flu informó que tras una reunión con la directiva del equipo brasileño, decidieron firmar un pacto de cese inmediato a los conflictos con la afición de Boca Juniors. ” Independientemente de la nacionalidad, Las pasiones del club no están por encima del honor o la dignidad humana Que se separe el trigo de la paja, que el castigo caiga sobre quien corresponda”, expresaron. COMUNICADO CONJUNTO DAS TORCIDAS ORGANIZADAS DO FLUMINENSE FOOTBALL CLUB Em reunião realizada com a diretoria do Fluminense FC, na tarde de hoje, as torcidas organizadas do Fluminense celebraram um pacto para que os conflitos sejam cessados imediatamente com torcedores do Boca…","pubDate":"2023-11-04 15:14:22","image_url":null,"source_id":"esto_mx","source_priority":104236,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"aa50eedc3b12036893220fc8a45b1b04","title":"Lionel Messi Insists He Is Done With European Football","link":"https://www.naijanews.com/2023/11/04/lionel-messi-insists-he-is-done-with-european-football/","keywords":["Sports","2023 Ballon d'Or","FC Barcelona","Inter Miami","Lionel Messi"],"creator":["Ernest Victor"],"video_url":null,"description":"Argentina football icon, Lionel Messi, has insisted that he is done with European football, which means that he doesn’t intend to play for any European club again. Messi arrived in Europe in 2000 from the Argentine club, Newell’s Old Boys, to FC Barcelona, who oversaw his development through their prestigious football academy, La Masia. He […] The post Lionel Messi Insists He Is Done With European Football appeared first on Naija News.","content":"Argentina football icon, Lionel Messi, has insisted that he is done with European football, which means that he doesn’t intend to play for any European club again. Messi arrived in Europe in 2000 from the Argentine club, Newell’s Old Boys, to FC Barcelona, who oversaw his development through their prestigious football academy, La Masia. He got into FC Barcelona’s senior team in 2004 after going through the robes, and since then, he has been unstoppable in the game. Before he left Barcelona for Paris Saint Germain in 2021, Lionel Messi won a club-record 34 trophies, including ten La Liga titles, seven Copa del Rey titles and four UEFA Champions League titles. Despite being booed at PSG, Messi, who is currently 36-year-old helped the French club to win the league title twice, and the Trophée des Champions once. Messi left European club football in July 2023 for Major League Soccer (MLS) in the United States, where he currently plays for Inter Miami, which is co-owned by English football legend David Beckham. On Monday, October 30, Lionel Messi became the first player in the history of football to win the Ballon d’Or a record eight times. He achieved this feat after leading Argentina to win the 2022 FIFA World Cup in Qatar. After winning his 8th Ballon d’Or, Messi, who is always linked with a possible return to FC Barcelona, told French publication, L’Équipé that he has no business playing football in Europe again. He said, “Is European football closed for you? Yes. Thanks to God, I had an extraordinary career in Europe and won everything I have dreamed of”. “Now that I have decided to come to the USA, I don’t think I will ever return to playing in Europe”.","pubDate":"2023-11-04 14:37:38","image_url":null,"source_id":"naijanews","source_priority":9385,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"1778feaed9317fd20624e7d582e637c5","title":"Three things Erik ten Hag got wrong and one right as Man Utd snatch late win at Fulham","link":"https://www.dailystar.co.uk/sport/football/manchester-united-erik-ten-hag-31360807","keywords":["Sport"],"creator":null,"video_url":null,"description":"Erik ten Hag's side have again played well below par, and Daily Star Sport looks at what the Dutchman got wrong as United escaped with three point against Fulham","content":"\"Play like you mean it,\" demanded the fans - as they pleaded with their beloved side following a week of new lows for the Red Devils. could have been left venting at the controversial VAR decision that saw Scott McTominay's strike ruled out in the eighth minute. But the bottom line is he will be a very relieved man tonight because the Red Devils were way off the pace again, and they can count themselves lucky to escape with the three points. Bruno Fernandes did what captains should do and led by example with a 90th minute winner, for another late United strike. Here, looks at three things the Dutchman got wrong but one crucial decision he got right during his team's trip to Craven Cottage. Anybody that watched Antony at will understand why Ten Hag has so much faith in the Brazilian - he was electric in Amsterdam, tearing apart teams at his will. However, for whatever reason, it's never quite clicked in Manchester. Antony was handed a starting spot against , and he again failed to impress. Red Devils fans are getting more vocal in their desire to see Facundo Pellistri introduced into the squad. And many were left baffled by the chance to blood the youngster against a Fulham side they should really be beating. Scott McTominay has reinvented himself as a goalscoring midfielder in recent months - but outside of a controversial VAR call, he was largely anonymous. And it didn't help his midfield partner was Christian Eriksen, with some United fans even questioning if he was actually on the pitch. One fan fumed: \"Eriksen needs to come off, not been in the game at all and him as the deepest midfielder is a recipe for disaster on the counter attack!\" Fulham were able to control the midfield, with Ten Hag having players like Sofyan Amrabat and Mason Mount on his bench. Outside of hooking Antony for Pellistri, Ten Hag didn't make another change until the 78th minute. It was a strange decision, given how underwhelming United were on the pitch. \"I honestly can't understand why Ten Hag is persisting with this midfield that isn't even working,\" one fan fumed. While a second added: \"I’ve officially seen enough...can’t make subs when they are clearly needed!\" Eriksen was eventually subbed for Mount, while Anthony Martial was brought on in place of Rasmus Hojlund. Harry Maguire's career at the Red Devils has been tumultuous, but he was the best player on the park for Ten Hag's side on Saturday. Maguire was offside for United's disallowed goal, but that's all he did wrong at Craven Cottage. The Englishman was a rock at the back, constantly repelling Fulham's attacks, and even clearing the ball off the line. Bruno Fernandes has Maguire to thank for the fact he was able to find the net to win the game in the 90th minute.","pubDate":"2023-11-04 14:35:20","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360900.ece/ALTERNATES/s98/0_Britain-Soccer-Premier-League-23308513590650.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7aba289896595a0690b1f754623d9aad","title":"Leo Messi: \"Cristiano Ronaldo y yo merecemos mucho crédito\"","link":"https://www.diariodigital.com.do/2023/11/04/leo-messi-cristiano-ronaldo-y-yo-merecemos-mucho-credito.html/","keywords":["Deportes","Fútbol","Leo Messi"],"creator":["Servicios de Europa Press"],"video_url":null,"description":"\"No creo que vuelva a jugar nunca en Europa, pero volveré a vivir en Barcelona\" MADRID, 4 Noviembre del 2023.-El delantero argentino Leo Messi, ganador del Balón de Oro 2023, ha asegurado tanto el portugués Cristiano Ronaldo como él merecen \"mucho crédito\" por haber librado \"una buena batalla a nivel deportivo\" durante tantos años, y […] Source","content":"\"Fue una muy buena batalla a nivel deportivo. Nos alimentamos mutuamente de esta rivalidad, porque ambos somos grandes competidores. Cristiano también quiso ganarlo todo. Fue un momento muy agradable para ambos y para todos los que aman el fútbol. Creo que merecemos mucho crédito por haber podido permanecer en la cima durante tanto tiempo. Es extremadamente difícil mantenerse en la cima durante diez o quince años\", señaló en una entrevista con France Football. En este sentido, afirmó que el Balón de Oro es \"una gran recompensa por todo lo que significa\", pero recalcó que lo importante son \"los premios colectivos\". \"Tuve la posibilidad de ganar todos los títulos posibles en Barcelona, luego con Argentina, y eso es lo más importante para mí\", recalcó. \"Estos ocho Balones de Oro reflejan mi mentalidad y mi motivación, estas ganas de querer superarme día tras día. Siempre dije que me encantaba ganar y que era alérgico a perder\", añadió. Además, confesó a quién ve ganando el premio en el futuro. \"Podría haber una muy buena batalla en los próximos años, con jugadores como Haaland, Mbappé, Vinícius… Muchos jóvenes lucharán por los próximos Balones de Oro. Pienso también en -Lamine- Yamal, que todavía es muy joven pero que ya juega en el Barça y es decisivo. Aparecerán otros jugadores, como ocurre todo el tiempo. Será una nueva era que observaré con placer, desde fuera\", manifestó. También habló sobre la temporada del noruego Erling Haaland y el francés Kylian Mbappé, que le acompañaron en el podio del Balón de Oro este año. \"Haaland hizo una temporada increíble. Marcó muchos goles, ganó la 'Champions' y consiguió el triplete con el Manchester City. Estoy seguro de que será uno de los jugadores que regularmente serán candidatos al Balón de Oro en los próximos años. No me sorprendería que lo ganase muy pronto\", expuso. \"Y Kylian lo mismo: hizo una temporada muy buena, con un Mundial espectacular, casi nos arruina la final con sus goles. Es uno de los futbolistas que puede ganar el premio cada año, porque es uno de los mejores jugadores del mundo\", continuó. En otro orden de cosas, el atacante argentino relató cómo fue su marcha del Paris Saint-Germain y su fichaje por el Inter de Miami. \"Pensé en qué era lo mejor en ese momento para mi familia y para mí. El hecho de haber sido campeón del mundo y haber logrado todos los objetivos que me había propuesto durante mi carrera me permitió pensar más allá del aspecto deportivo, pensar también en el bienestar de toda mi familia, beneficiarme de otro punto de vista. Fue una decisión que tomamos juntos\", desveló. También confesó que volver al FC Barcelona fue una posibilidad. \"Podría haber vuelto al Barça, pero no pudo ser. Mi primera idea siempre fue volver a casa, poder volver a jugar en Barcelona y retirarme allí como siempre había soñado. Pero no fue posible. Entonces tomamos la decisión de venir a Miami\", indicó, negando la posibilidad de recalar en el conjunto azulgrana en el mercado invernal después de que su equipo no lograse alcanzar los 'Playoffs'. \"No, para nada\", dijo categóricamente. Por otra parte, considera que ha pasado página definitivamente del fútbol europeo. \"Sí, creo que sí. Gracias a Dios tuve la suerte de tener una carrera extraordinaria, gané todo lo que soñaba en Europa, donde jugué durante muchos años. Ahora que he dado un paso al venir a Estados Unidos, no creo que vuelva a jugar nunca en Europa. Extrañaré jugar la Liga de Campeones o La Liga por el resto de mi vida, partidos con un sabor especial. Pero lo disfruté tanto como pude, así que no tengo ninguna frustración\", desveló. Sin embargo, sí regresará a la Ciudad Condal una vez terminada su carrera futbolística. \"En principio volveremos a vivir en Barcelona. Es nuestro hogar, donde tenemos nuestras rutinas, nuestros amigos, tanto para mi mujer como para mis hijos y para mí. Pero no tengo idea de qué haré. No lo he pensado todavía y no quiero hacerlo. Quiero disfrutar de mis últimos años como futbolista, haciendo lo que siempre me ha gustado desde pequeño. Y cuando cuelgue las botas, encontraré mi nuevo camino. ¿Entrenador? No lo creo, pero tendrá algo que ver con el fútbol porque es toda mi vida\", expresó. Messi aseguró también que se siente \"bien\" físicamente. \"No pienso en el futuro, avanzo día a día. Me siento bien físicamente. Voy a tener unos meses de vacaciones, nunca me había pasado esto en mi carrera estar parado tanto tiempo. Volveré a entrenar en enero para ponerme en forma durante la pretemporada para conseguir los objetivos que tenemos aquí en el club, pero también para preparar la Copa América. No sé cuánto tiempo más jugaré. Quiero seguir hasta que sienta que no puedo más\", apuntó. Así, no quiere pensar en si podrá defender el título de campeón del mundo de Argentina en el Mundial de Estados Unidos, Canadá y México 2026. \"Queda bastante tiempo. Aunque pase rápido, todavía faltan algunos años para el Mundial y no quiero mirar tan lejos. No se trata de estar por estar, sino de sentirme bien y poder aportar cosas al grupo. Sabiendo la edad que tendré entonces (39), me parece difícil, pero ya veremos cómo me siento físicamente\", señaló. En otro orden de cosas, habló de cómo ve al Barça de Xavi. \"Los sigo, veo los partidos, por supuesto, como cuando jugué en París. Me parece que el equipo ha evolucionado bien desde que llegó. Los jóvenes tienen un nivel excelente. Hay un gran equipo que tiene la oportunidad de poder luchar en todos los frentes este año\", indicó. Recordando la final del Mundial, que considera que fue su \"mejor partido\" con la albiceleste, Messi confesó que \"nunca\" pasó por su mente que fuesen a perder el partido, ni siquiera cuando Kylian Mbappé empató para forzar la prórroga. \"Estaba convencido de que íbamos a ser campeones del mundo pasara lo que pasara. Este empate fue un duro golpe, pero ya habíamos vivido el mismo escenario contra Holanda y, en lugar de derrumbarse, el equipo volvió a hacer una muy buena prórroga\", explicó. Por último, rememoró en qué pensó cuando Gonzalo Montiel anotó el penalti decisivo. \"Por mi cabeza pasaron mil cosas… Es difícil explicar lo que sientes en ese momento. Luché por este sueño toda mi vida\", dijo. \"Era mío, pero también de mi familia, de mis amigos y de toda la Argentina. Me dije a mí mismo 'está bien, lo gané todo'. Cuando vi la copa en el escenario no podía creer que fuera nuestra, que éramos campeones del mundo. Fue la primera vez que tuve la oportunidad de tocarla y al instante quise besarla. Quería disfrutar cada segundo de ese momento\", finalizó.","pubDate":"2023-11-04 14:33:13","image_url":null,"source_id":"diariodigital","source_priority":3537270,"country":["dominican republic"],"category":["sports"],"language":"spanish"},{"article_id":"bf69f4a149c0e14e5af4412f9a191526","title":"Chelsea go top of WSL after thrashing Villa","link":"https://www.skysports.com/football/aston-villa-women-vs-chelsea-women/report/494335","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have moved top of the Women's Super League table after an emphatic 6-0 win at Aston Villa to pile more misery on the hosts.","content":"Chelsea have moved top of the Women's Super League table after an emphatic 6-0 win at Aston Villa to pile more misery on the hosts. But the victory was immediately overshadowed by the bombshell news that manager Emma Hayes will leave Chelsea at the end of the season. Captain Millie Bright fired the visitors in front in the 21st minute before Fran Kirby extended the champions' lead with a close-range effort five minutes later. In the second half, goals from Johanna Rytting Kaneryd, substitute duo Ashley Lawrence and Aggie Beever-Jones and Niamh Charles piled more misery on the visitors. Victory for Chelsea sees Hayes' side leapfrog Manchester City into first place on 13 points. Villa, meanwhile, remain pointless at the foot of the table after five games played. In an open start to the game, it was Chelsea who had the better opportunities as Johanna Rytting Kaneryd came close with a vicious strike and Kirby struck the woodwork. Rachel Daly was made to pay for her missed chance in the 16th minute, firing over the crossbar from point-blank range, as Chelsea took the lead through Bright. The England international fired her shot in on the volley after Mia Fishel had her attempt cleared off the line. How Aston Villa and Chelsea lined up Match stats Women's Super League table Stream the WSL and more with NOW Kirby continued to be dangerous on the counter-attack and deservedly opened her account for the campaign in the 26th minute as she thumped in a close-range rebound after her first shot was blocked. Chelsea continued their dominance in the second half with another four goals. Rytting Kaneryd struck in the 56th minute with a close-range finish after a slick Chelsea counter-attack. Lawrence added a fourth thanks to her right knee as she converted Jessie Fleming's cross before another substitute, Beever-Jones, made it five after a fine solo run down the left flank. In the 74th minute, Chelsea made it six thanks to a fine side-footed volley from Charles into the bottom corner. Please use Chrome browser for a more accessible video player Aston Villa boss Carla Ward speaking to Sky Sports : \"Everybody knows without momentum in football it's tough. When you've lost four games and sometimes you go a couple of goals down, you think you're still in, the third is a sucker-punch of course. \"When the confidence is not there that becomes tough. Like I said it's a tough one, we're in a really tough spot at the moment but that's football and we've got to get out of it. It's my job to do that and I will work tirelessly to try and get this back.\" Aston Villa forward Rachel Daly speaking to Sky Sports : \"The true football people who watch this game will realise that was a gutsy performance. We're in a tough spot, we know it's a long way to go but the belief we have in this team and the staff is massive. \"It doesn't look good but we've got each other's back and a lot of games coming in November. All we can do is turn this around.\" Emma Hayes will leave Chelsea at the end of the season , the WSL club have announced. Chelsea say Hayes is departing \"to pursue a new opportunity outside of the WSL and club football\". Under her leadership, Chelsea have won six FA WSL titles, five Women's FA Cups, two FA Women's League Cups, one FA Women's Spring Series trophy and one FA Women's Community Shield. Hayes also guided the team to a historic double on two occasions and achieved one domestic treble. Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Aston Villa visit Sheff Utd in the Continental Cup on Wednesday, kick-off 7pm. They then visit Bristol City in the WSL on November 12, kick-off 2pm. Chelsea are back in action with a trip to Everton next Sunday, kick-off 1pm. Their Champions League campaign then kicks off, when they head to the continent to face Real Madrid on November 15, kick-off 8pm. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-04 14:30:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-chelsea-women-wsl_6347705.jpg?20231104141633","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6afa3dc5e3adf352f2f389ba8eddaea5","title":"NFL-Deutschland-Chef: 2024 sicher nur ein Spiel in München","link":"https://www.nordbayern.de/sport/mehr-sport/nfl-deutschland-chef-2024-sicher-nur-ein-spiel-in-munchen-1.13752178","keywords":null,"creator":null,"video_url":null,"description":"Frankfurt/Main - Der NFL-Doppelpack in diesem Jahr hat das Interesse der Fans geweckt. Doch 2024 wird wieder das ursprünglich angepeilte Pensum absolviert. Die Teams sind noch nicht bekannt.","content":"Im Jahr 2024 wird nur ein Spiel der amerikanischen Football-Liga NFL in Deutschland stattfinden. Dies bekräftigte NFL-Deutschland-Chef Alexander Steinforth bei ran. \"Wir haben dieses Jahr die Ausnahmesituation gehabt, dass wir das Spiel aus Mexiko auch bekommen haben, da dort das Stadion umgebaut wird. Aber im nächsten Jahr wird es wieder das ursprünglich geplante, eine Spiel geben\", sagte Steinforth. Dieses werde, wie schon 2022, in der Allianz Arena in München stattfinden. Im Jahr 2025 ist dann wieder Frankfurt am Zug. Die Teams dafür stehen noch nicht fest. Am Sonntag (15.30 Uhr/RTL und DAZN) treffen die Miami Dolphins in Frankfurt auf Super-Bowl-Sieger Kansas City Chiefs. Eine Woche später duellieren sich die New England Patriots und die Indianapolis Colts an gleicher Stelle. Die bisherige Woche verlaufe positiv, sagte Steinforth der Deutschen Presse-Agentur: \"Wir sind sehr zufrieden mit all den Dingen, die jetzt schon in Frankfurt passiert sind. Die Dolphins haben schon sehr viel gemacht, trainiert, waren auch in der Stadt unterwegs. Man sieht es gerade, wenn man durch Frankfurt läuft, wie viel hier gerade vor Ort passiert. All das, was wir geplant haben, was die Teams geplant haben, erweckt gerade zum Leben.\"","pubDate":"2023-11-04 14:17:31","image_url":null,"source_id":"nn_de","source_priority":2872166,"country":["germany"],"category":["sports"],"language":"german"},{"article_id":"a3c41d2d992c5339a4cbcffdaa265e46","title":"NPFL: Photos, Capacity Of Best Stadiums In Nigerian Premier Football League","link":"https://www.naijanews.com/2023/11/04/npfl-photos-capacity-of-best-stadiums-in-nigerian-premier-football-league/","keywords":["Sports","Nigerian Football","Nigerian Premier Football League (NPFL)","NPFL","NPFL stadiums"],"creator":["Ernest Victor"],"video_url":null,"description":"The social media handlers of the Nigeria Premier Football League (NPFL) have compiled the best ten stadiums in the league for the 2023-2024 season. Among the top ten stadiums, the NPFL stadium that has the largest seating capacity is the Adokiye Amiesimaka Stadium in Port Harcourt, Rivers. The stadium is the home ground for Rivers […] The post NPFL: Photos, Capacity Of Best Stadiums In Nigerian Premier Football League appeared first on Naija News.","content":"The social media handlers of the Nigeria Premier Football League (NPFL) have compiled the best ten stadiums in the league for the 2023-2024 season. Among the top ten stadiums, the NPFL stadium that has the largest seating capacity is the Adokiye Amiesimaka Stadium in Port Harcourt, Rivers. The stadium is the home ground for Rivers United and has 38,000 seating capacity. According to the NPFL ratings, the stadium is the 6th best stadium in the 2023-2024 NPFL season, and it is one of the few stadiums in the Nigerian league that has a natural turf. Another NPFL Stadium that has a natural playing surface is Godswill Akpabio International Stadium, which is the home ground of Akwa United and is currently rated as the best stadium in the NPFL. Others are Samuel Ogbemudia Stadium in Benin, Edo state, used by Bendel Insurance, and Lekan Salami Stadium in Ibadan, Oyo state, used by Shooting Stars. Below are the top ten stadiums in the 2023-2024 NPFL season: 1. Godswill Akpabio International Stadium Uyo. 30,000 capacity Natural Turf. (Akwa United FC) 2. Samuel Ogbemudia Stadium Benin. 12,000 capacity Natural Turf. (Bendel Insurance FC) 3. Lekan Salami Stadium Ibadan. 10,000 capacity Natural Turf (Shooting Stars FC). 4. Mobolaji Johnson Arena Lagos, formerly known as Onikan Stadium. 10,000-capacity Artificial Turf (Sporting Lagos FC). 5. Remo Stars Stadium Ikenne Ogun state. 5,000 Capacity Artificial Turf (Remo Stars FC). 6. Adokiye Amiesimaka Stadium Port Harcourt. 38,000-capacity Natural Turf (Rivers United). 7. Muhammadu Dikko Stadium Katsina. 35,000 capacity. Artificial Turf (Katsina United FC). 8. Sani Abacha Stadium Kano 16,000-capacity Artificial Turf (Kano Pillars FC). 9. Enyimba International Stadium Aba 16,000-capacity Artificial Turf (Enyimba FC). 10. Pantami Stadium Gombe 12,000-capacity Artificial Turf. (Gombe United and Doma United).","pubDate":"2023-11-04 14:13:55","image_url":null,"source_id":"naijanews","source_priority":9385,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"d54bde090225e00f40b52cb7200a6d55","title":"Man Utd fans send flops clear message on huge banner as Erik ten Hag side battle Fulham","link":"https://www.dailystar.co.uk/sport/football/manchester-united-fans-banner-fulham-31360757","keywords":["Sport"],"creator":null,"video_url":null,"description":"Man Utd fans unfurled a banner getting stuck in their players ahead of their away trip to Fulham on Saturday as pressure on Erik ten Hag mounts","content":"fans unfurled a banner in the away end taking aim at the team’s recent miserable performances. ’s side travelled to Craven Cottage on Saturday lunchtime under mounting pressure off the back of a terrible performance and result in the Manchester Derby and in the EFL Cup against to compound the Red Devils’ terrible start to the season. United arrived in West London 8th in the table needing a win and a good performance to release the pressure on Ten Hag and his flailing squad. And some fans in the away end chose to make their recent displeasure plain ahead of the game. In an attempt to see a United performance with more energy and determination fans held up a sign reading: “Play like you mean it!!” as the player warmed up. But the message seemed to go a miss in the first half which saw yet another uninspiring United performance. Scott McTominay believed he had opened the scoring after just seven minutes but an offside against Harry Maguire who was deemed to be interfering with play following a lengthy VAR. United never got into a flow again and a drab rest of the half ensued. United began the second half brighter as Alejandro Garnacho tested Bernd Leno before his cross that would’ve let Rasmus Hojlund with a tap in was deflected over the bar. A desperately needed three points would see United temporarily climb into 6th place ahead of and Newcastle. But arguably as important is a sharp increase in a level of performance that has been rock bottom in recent weeks and frustration has clearly told on the supporters. It’s said that Ten Hag’s immediate future is secure with club CEO Richard Arnold willing to bide his time and hope that the Dutchman can pull United’s form and struggling players out of the fire.","pubDate":"2023-11-04 14:08:30","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360759.ece/ALTERNATES/s98/3_Fulham-FC-v-Manchester-United-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"847b68df6be5d1eff253b625d6bff7b4","title":"Arsenal under 18s game at Brighton postponed after team 'travel to Bournemouth by mistake'","link":"https://www.dailystar.co.uk/sport/football/arsenal-u18s-brighton-bournemouth-mistake-31360699","keywords":["Sport"],"creator":null,"video_url":null,"description":"An Arsenal youth game against Brighton has been postponed after the Gunners were mistakenly driven to Bournemouth, some two-and-half hours down the coast","content":"U18s clash against has been hilariously postponed after the team travelled to the wrong town. The fixture was scheduled to kick-off at the Seagulls' Amex Stadium at 12pm on Saturday, but the start was delayed by half-an-hour when the Gunners failed to turn up. It later transpired that they'd travelled to Bournemouth by mistake - a whopping 95 miles out of their way - and the game was then postponed. Fans on social media thought the whole thing was a farce. One X user wrote: \"Who is the driver? Was he drunk?\" Another said: \"How does this happen in this day and age?\" \"Hahaha the driver literally had one job. He's finito,\" wrote a third, while a fourth joked: \"Should've gone to Specsavers.\" were looking to extend their unbeaten run in all competitions to four matches. The team, who are managed by Gunners icon Jack Wilshere, are seventh in the U18 , having won three of their first eight games of the season. Wilshere took charge of the team just a few days after hanging up his boots in 2022. He led the team to the final of the 2022/23 FA Youth Cup in his first season in charge, though they lost the game to . The Gunners' U18s side have never won the U18 Premier League since its inception in 2012. They are, however, one of the most successful teams in FA Youth Cup history, having won the competition seven times (only and have won more). TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month","pubDate":"2023-11-04 13:57:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360756.ece/ALTERNATES/s98/0_GettyImages-1614990406.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5c3c25a9dfbe98e22fe13cd4fef90c17","title":"Arsenal under 18s game at Brighton postponed after team 'travel to Bournemouth by mistake'","link":"https://www.dailystar.co.uk/sport/football/arsenal-under-18s-game-brighton-31360699","keywords":["Sport"],"creator":null,"video_url":null,"description":"An Arsenal youth game against Brighton has been postponed after the Gunners were mistakenly driven to Bournemouth, some two-and-half hours down the coast","content":"U18s clash against has been hilariously postponed after the team travelled to the wrong town. The fixture was scheduled to kick-off at the Seagulls' Amex Stadium at 12pm on Saturday, but the start was delayed by half-an-hour when the Gunners failed to turn up. It later transpired that they'd travelled to Bournemouth by mistake - a whopping 95 miles out of their way - and the game was then postponed. Fans on social media thought the whole thing was a farce. One X user wrote: \"Who is the driver? Was he drunk?\" Another said: \"How does this happen in this day and age?\" \"Hahaha the driver literally had one job. He's finito,\" wrote a third, while a fourth joked: \"Should've gone to Specsavers.\" were looking to extend their unbeaten run in all competitions to four matches. The team, who are managed by Gunners icon Jack Wilshere, are seventh in the U18 , having won three of their first eight games of the season. Wilshere took charge of the team just a few days after hanging up his boots in 2022. He led the team to the final of the 2022/23 FA Youth Cup in his first season in charge, though they lost the game to . The Gunners' U18s side have never won the U18 Premier League since its inception in 2012. They are, however, one of the most successful teams in FA Youth Cup history, having won the competition seven times (only and have won more). TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month","pubDate":"2023-11-04 13:57:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360756.ece/ALTERNATES/s98/0_GettyImages-1614990406.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e6c5a087906aca9dbc7de35ed1f80204","title":"Boca Juniors y Fluminense piden una final de Libertadores sin violencia","link":"https://esto.com.mx/776234-copa-libertadores-equipos-piden-final-sin-violencia/","keywords":["Libertadores","boca juniors","Copa Libertadores","Fluminense","top3"],"creator":["Diana Rojas"],"video_url":null,"description":"Los dirigentes de Boca y Fluminense en coordinación con la Conmebol organizaron un operativo para la final de la Libertadores The post Boca Juniors y Fluminense piden una final de Libertadores sin violencia appeared first on ESTO.","content":"en Rio de Janeiro este sábado 4 de noviembre. Hace unos días, los aficionados argentinos comenzaron a llegar a territorio brasileño, donde de inmediato comenzó la violencia y la provocación con los rivales. Derivado de dicha situación, el pasado viernes, durante la final de la Copa Libertadores de América. Disfrutemos de la Final de la CONMEBOL con respeto y sin violencia. Vamos desfrutar da Final da CONMEBOL com respeito e sem violência. , aseguró el presidente de Fluminense Mário Bittencourt. “Esto es una fiesta, al fiesta del futbol sudamericano. Pedirle a la gente por favor que respete a l contrincante .”, señaló Jorge Amor Ameal, presidente de Boca. Mediante redes sociales, la barra del Flu informó que tras una reunión con la directiva del equipo brasileño, decidieron firmar un pacto de cese inmediato a los conflictos con la afición de Boca Juniors. ” Independientemente de la nacionalidad, Las pasiones del club no están por encima del honor o la dignidad humana Que se separe el trigo de la paja, que el castigo caiga sobre quien corresponda”, expresaron. COMUNICADO CONJUNTO DAS TORCIDAS ORGANIZADAS DO FLUMINENSE FOOTBALL CLUB Em reunião realizada com a diretoria do Fluminense FC, na tarde de hoje, as torcidas organizadas do Fluminense celebraram um pacto para que os conflitos sejam cessados imediatamente com torcedores do Boca…","pubDate":"2023-11-04 15:14:22","image_url":null,"source_id":"esto_mx","source_priority":104236,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"aa50eedc3b12036893220fc8a45b1b04","title":"Lionel Messi Insists He Is Done With European Football","link":"https://www.naijanews.com/2023/11/04/lionel-messi-insists-he-is-done-with-european-football/","keywords":["Sports","2023 Ballon d'Or","FC Barcelona","Inter Miami","Lionel Messi"],"creator":["Ernest Victor"],"video_url":null,"description":"Argentina football icon, Lionel Messi, has insisted that he is done with European football, which means that he doesn’t intend to play for any European club again. Messi arrived in Europe in 2000 from the Argentine club, Newell’s Old Boys, to FC Barcelona, who oversaw his development through their prestigious football academy, La Masia. He […] The post Lionel Messi Insists He Is Done With European Football appeared first on Naija News.","content":"Argentina football icon, Lionel Messi, has insisted that he is done with European football, which means that he doesn’t intend to play for any European club again. Messi arrived in Europe in 2000 from the Argentine club, Newell’s Old Boys, to FC Barcelona, who oversaw his development through their prestigious football academy, La Masia. He got into FC Barcelona’s senior team in 2004 after going through the robes, and since then, he has been unstoppable in the game. Before he left Barcelona for Paris Saint Germain in 2021, Lionel Messi won a club-record 34 trophies, including ten La Liga titles, seven Copa del Rey titles and four UEFA Champions League titles. Despite being booed at PSG, Messi, who is currently 36-year-old helped the French club to win the league title twice, and the Trophée des Champions once. Messi left European club football in July 2023 for Major League Soccer (MLS) in the United States, where he currently plays for Inter Miami, which is co-owned by English football legend David Beckham. On Monday, October 30, Lionel Messi became the first player in the history of football to win the Ballon d’Or a record eight times. He achieved this feat after leading Argentina to win the 2022 FIFA World Cup in Qatar. After winning his 8th Ballon d’Or, Messi, who is always linked with a possible return to FC Barcelona, told French publication, L’Équipé that he has no business playing football in Europe again. He said, “Is European football closed for you? Yes. Thanks to God, I had an extraordinary career in Europe and won everything I have dreamed of”. “Now that I have decided to come to the USA, I don’t think I will ever return to playing in Europe”.","pubDate":"2023-11-04 14:37:38","image_url":null,"source_id":"naijanews","source_priority":9385,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"1778feaed9317fd20624e7d582e637c5","title":"Three things Erik ten Hag got wrong and one right as Man Utd snatch late win at Fulham","link":"https://www.dailystar.co.uk/sport/football/manchester-united-erik-ten-hag-31360807","keywords":["Sport"],"creator":null,"video_url":null,"description":"Erik ten Hag's side have again played well below par, and Daily Star Sport looks at what the Dutchman got wrong as United escaped with three point against Fulham","content":"\"Play like you mean it,\" demanded the fans - as they pleaded with their beloved side following a week of new lows for the Red Devils. could have been left venting at the controversial VAR decision that saw Scott McTominay's strike ruled out in the eighth minute. But the bottom line is he will be a very relieved man tonight because the Red Devils were way off the pace again, and they can count themselves lucky to escape with the three points. Bruno Fernandes did what captains should do and led by example with a 90th minute winner, for another late United strike. Here, looks at three things the Dutchman got wrong but one crucial decision he got right during his team's trip to Craven Cottage. Anybody that watched Antony at will understand why Ten Hag has so much faith in the Brazilian - he was electric in Amsterdam, tearing apart teams at his will. However, for whatever reason, it's never quite clicked in Manchester. Antony was handed a starting spot against , and he again failed to impress. Red Devils fans are getting more vocal in their desire to see Facundo Pellistri introduced into the squad. And many were left baffled by the chance to blood the youngster against a Fulham side they should really be beating. Scott McTominay has reinvented himself as a goalscoring midfielder in recent months - but outside of a controversial VAR call, he was largely anonymous. And it didn't help his midfield partner was Christian Eriksen, with some United fans even questioning if he was actually on the pitch. One fan fumed: \"Eriksen needs to come off, not been in the game at all and him as the deepest midfielder is a recipe for disaster on the counter attack!\" Fulham were able to control the midfield, with Ten Hag having players like Sofyan Amrabat and Mason Mount on his bench. Outside of hooking Antony for Pellistri, Ten Hag didn't make another change until the 78th minute. It was a strange decision, given how underwhelming United were on the pitch. \"I honestly can't understand why Ten Hag is persisting with this midfield that isn't even working,\" one fan fumed. While a second added: \"I’ve officially seen enough...can’t make subs when they are clearly needed!\" Eriksen was eventually subbed for Mount, while Anthony Martial was brought on in place of Rasmus Hojlund. Harry Maguire's career at the Red Devils has been tumultuous, but he was the best player on the park for Ten Hag's side on Saturday. Maguire was offside for United's disallowed goal, but that's all he did wrong at Craven Cottage. The Englishman was a rock at the back, constantly repelling Fulham's attacks, and even clearing the ball off the line. Bruno Fernandes has Maguire to thank for the fact he was able to find the net to win the game in the 90th minute.","pubDate":"2023-11-04 14:35:20","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360900.ece/ALTERNATES/s98/0_Britain-Soccer-Premier-League-23308513590650.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7aba289896595a0690b1f754623d9aad","title":"Leo Messi: \"Cristiano Ronaldo y yo merecemos mucho crédito\"","link":"https://www.diariodigital.com.do/2023/11/04/leo-messi-cristiano-ronaldo-y-yo-merecemos-mucho-credito.html/","keywords":["Deportes","Fútbol","Leo Messi"],"creator":["Servicios de Europa Press"],"video_url":null,"description":"\"No creo que vuelva a jugar nunca en Europa, pero volveré a vivir en Barcelona\" MADRID, 4 Noviembre del 2023.-El delantero argentino Leo Messi, ganador del Balón de Oro 2023, ha asegurado tanto el portugués Cristiano Ronaldo como él merecen \"mucho crédito\" por haber librado \"una buena batalla a nivel deportivo\" durante tantos años, y […] Source","content":"\"Fue una muy buena batalla a nivel deportivo. Nos alimentamos mutuamente de esta rivalidad, porque ambos somos grandes competidores. Cristiano también quiso ganarlo todo. Fue un momento muy agradable para ambos y para todos los que aman el fútbol. Creo que merecemos mucho crédito por haber podido permanecer en la cima durante tanto tiempo. Es extremadamente difícil mantenerse en la cima durante diez o quince años\", señaló en una entrevista con France Football. En este sentido, afirmó que el Balón de Oro es \"una gran recompensa por todo lo que significa\", pero recalcó que lo importante son \"los premios colectivos\". \"Tuve la posibilidad de ganar todos los títulos posibles en Barcelona, luego con Argentina, y eso es lo más importante para mí\", recalcó. \"Estos ocho Balones de Oro reflejan mi mentalidad y mi motivación, estas ganas de querer superarme día tras día. Siempre dije que me encantaba ganar y que era alérgico a perder\", añadió. Además, confesó a quién ve ganando el premio en el futuro. \"Podría haber una muy buena batalla en los próximos años, con jugadores como Haaland, Mbappé, Vinícius… Muchos jóvenes lucharán por los próximos Balones de Oro. Pienso también en -Lamine- Yamal, que todavía es muy joven pero que ya juega en el Barça y es decisivo. Aparecerán otros jugadores, como ocurre todo el tiempo. Será una nueva era que observaré con placer, desde fuera\", manifestó. También habló sobre la temporada del noruego Erling Haaland y el francés Kylian Mbappé, que le acompañaron en el podio del Balón de Oro este año. \"Haaland hizo una temporada increíble. Marcó muchos goles, ganó la 'Champions' y consiguió el triplete con el Manchester City. Estoy seguro de que será uno de los jugadores que regularmente serán candidatos al Balón de Oro en los próximos años. No me sorprendería que lo ganase muy pronto\", expuso. \"Y Kylian lo mismo: hizo una temporada muy buena, con un Mundial espectacular, casi nos arruina la final con sus goles. Es uno de los futbolistas que puede ganar el premio cada año, porque es uno de los mejores jugadores del mundo\", continuó. En otro orden de cosas, el atacante argentino relató cómo fue su marcha del Paris Saint-Germain y su fichaje por el Inter de Miami. \"Pensé en qué era lo mejor en ese momento para mi familia y para mí. El hecho de haber sido campeón del mundo y haber logrado todos los objetivos que me había propuesto durante mi carrera me permitió pensar más allá del aspecto deportivo, pensar también en el bienestar de toda mi familia, beneficiarme de otro punto de vista. Fue una decisión que tomamos juntos\", desveló. También confesó que volver al FC Barcelona fue una posibilidad. \"Podría haber vuelto al Barça, pero no pudo ser. Mi primera idea siempre fue volver a casa, poder volver a jugar en Barcelona y retirarme allí como siempre había soñado. Pero no fue posible. Entonces tomamos la decisión de venir a Miami\", indicó, negando la posibilidad de recalar en el conjunto azulgrana en el mercado invernal después de que su equipo no lograse alcanzar los 'Playoffs'. \"No, para nada\", dijo categóricamente. Por otra parte, considera que ha pasado página definitivamente del fútbol europeo. \"Sí, creo que sí. Gracias a Dios tuve la suerte de tener una carrera extraordinaria, gané todo lo que soñaba en Europa, donde jugué durante muchos años. Ahora que he dado un paso al venir a Estados Unidos, no creo que vuelva a jugar nunca en Europa. Extrañaré jugar la Liga de Campeones o La Liga por el resto de mi vida, partidos con un sabor especial. Pero lo disfruté tanto como pude, así que no tengo ninguna frustración\", desveló. Sin embargo, sí regresará a la Ciudad Condal una vez terminada su carrera futbolística. \"En principio volveremos a vivir en Barcelona. Es nuestro hogar, donde tenemos nuestras rutinas, nuestros amigos, tanto para mi mujer como para mis hijos y para mí. Pero no tengo idea de qué haré. No lo he pensado todavía y no quiero hacerlo. Quiero disfrutar de mis últimos años como futbolista, haciendo lo que siempre me ha gustado desde pequeño. Y cuando cuelgue las botas, encontraré mi nuevo camino. ¿Entrenador? No lo creo, pero tendrá algo que ver con el fútbol porque es toda mi vida\", expresó. Messi aseguró también que se siente \"bien\" físicamente. \"No pienso en el futuro, avanzo día a día. Me siento bien físicamente. Voy a tener unos meses de vacaciones, nunca me había pasado esto en mi carrera estar parado tanto tiempo. Volveré a entrenar en enero para ponerme en forma durante la pretemporada para conseguir los objetivos que tenemos aquí en el club, pero también para preparar la Copa América. No sé cuánto tiempo más jugaré. Quiero seguir hasta que sienta que no puedo más\", apuntó. Así, no quiere pensar en si podrá defender el título de campeón del mundo de Argentina en el Mundial de Estados Unidos, Canadá y México 2026. \"Queda bastante tiempo. Aunque pase rápido, todavía faltan algunos años para el Mundial y no quiero mirar tan lejos. No se trata de estar por estar, sino de sentirme bien y poder aportar cosas al grupo. Sabiendo la edad que tendré entonces (39), me parece difícil, pero ya veremos cómo me siento físicamente\", señaló. En otro orden de cosas, habló de cómo ve al Barça de Xavi. \"Los sigo, veo los partidos, por supuesto, como cuando jugué en París. Me parece que el equipo ha evolucionado bien desde que llegó. Los jóvenes tienen un nivel excelente. Hay un gran equipo que tiene la oportunidad de poder luchar en todos los frentes este año\", indicó. Recordando la final del Mundial, que considera que fue su \"mejor partido\" con la albiceleste, Messi confesó que \"nunca\" pasó por su mente que fuesen a perder el partido, ni siquiera cuando Kylian Mbappé empató para forzar la prórroga. \"Estaba convencido de que íbamos a ser campeones del mundo pasara lo que pasara. Este empate fue un duro golpe, pero ya habíamos vivido el mismo escenario contra Holanda y, en lugar de derrumbarse, el equipo volvió a hacer una muy buena prórroga\", explicó. Por último, rememoró en qué pensó cuando Gonzalo Montiel anotó el penalti decisivo. \"Por mi cabeza pasaron mil cosas… Es difícil explicar lo que sientes en ese momento. Luché por este sueño toda mi vida\", dijo. \"Era mío, pero también de mi familia, de mis amigos y de toda la Argentina. Me dije a mí mismo 'está bien, lo gané todo'. Cuando vi la copa en el escenario no podía creer que fuera nuestra, que éramos campeones del mundo. Fue la primera vez que tuve la oportunidad de tocarla y al instante quise besarla. Quería disfrutar cada segundo de ese momento\", finalizó.","pubDate":"2023-11-04 14:33:13","image_url":null,"source_id":"diariodigital","source_priority":3537270,"country":["dominican republic"],"category":["sports"],"language":"spanish"},{"article_id":"bf69f4a149c0e14e5af4412f9a191526","title":"Chelsea go top of WSL after thrashing Villa","link":"https://www.skysports.com/football/aston-villa-women-vs-chelsea-women/report/494335","keywords":null,"creator":null,"video_url":null,"description":"Chelsea have moved top of the Women's Super League table after an emphatic 6-0 win at Aston Villa to pile more misery on the hosts.","content":"Chelsea have moved top of the Women's Super League table after an emphatic 6-0 win at Aston Villa to pile more misery on the hosts. But the victory was immediately overshadowed by the bombshell news that manager Emma Hayes will leave Chelsea at the end of the season. Captain Millie Bright fired the visitors in front in the 21st minute before Fran Kirby extended the champions' lead with a close-range effort five minutes later. In the second half, goals from Johanna Rytting Kaneryd, substitute duo Ashley Lawrence and Aggie Beever-Jones and Niamh Charles piled more misery on the visitors. Victory for Chelsea sees Hayes' side leapfrog Manchester City into first place on 13 points. Villa, meanwhile, remain pointless at the foot of the table after five games played. In an open start to the game, it was Chelsea who had the better opportunities as Johanna Rytting Kaneryd came close with a vicious strike and Kirby struck the woodwork. Rachel Daly was made to pay for her missed chance in the 16th minute, firing over the crossbar from point-blank range, as Chelsea took the lead through Bright. The England international fired her shot in on the volley after Mia Fishel had her attempt cleared off the line. How Aston Villa and Chelsea lined up Match stats Women's Super League table Stream the WSL and more with NOW Kirby continued to be dangerous on the counter-attack and deservedly opened her account for the campaign in the 26th minute as she thumped in a close-range rebound after her first shot was blocked. Chelsea continued their dominance in the second half with another four goals. Rytting Kaneryd struck in the 56th minute with a close-range finish after a slick Chelsea counter-attack. Lawrence added a fourth thanks to her right knee as she converted Jessie Fleming's cross before another substitute, Beever-Jones, made it five after a fine solo run down the left flank. In the 74th minute, Chelsea made it six thanks to a fine side-footed volley from Charles into the bottom corner. Please use Chrome browser for a more accessible video player Aston Villa boss Carla Ward speaking to Sky Sports : \"Everybody knows without momentum in football it's tough. When you've lost four games and sometimes you go a couple of goals down, you think you're still in, the third is a sucker-punch of course. \"When the confidence is not there that becomes tough. Like I said it's a tough one, we're in a really tough spot at the moment but that's football and we've got to get out of it. It's my job to do that and I will work tirelessly to try and get this back.\" Aston Villa forward Rachel Daly speaking to Sky Sports : \"The true football people who watch this game will realise that was a gutsy performance. We're in a tough spot, we know it's a long way to go but the belief we have in this team and the staff is massive. \"It doesn't look good but we've got each other's back and a lot of games coming in November. All we can do is turn this around.\" Emma Hayes will leave Chelsea at the end of the season , the WSL club have announced. Chelsea say Hayes is departing \"to pursue a new opportunity outside of the WSL and club football\". Under her leadership, Chelsea have won six FA WSL titles, five Women's FA Cups, two FA Women's League Cups, one FA Women's Spring Series trophy and one FA Women's Community Shield. Hayes also guided the team to a historic double on two occasions and achieved one domestic treble. Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Please use Chrome browser for a more accessible video player Aston Villa visit Sheff Utd in the Continental Cup on Wednesday, kick-off 7pm. They then visit Bristol City in the WSL on November 12, kick-off 2pm. Chelsea are back in action with a trip to Everton next Sunday, kick-off 1pm. Their Champions League campaign then kicks off, when they head to the continent to face Real Madrid on November 15, kick-off 8pm. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-11-04 14:30:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-chelsea-women-wsl_6347705.jpg?20231104141633","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6afa3dc5e3adf352f2f389ba8eddaea5","title":"NFL-Deutschland-Chef: 2024 sicher nur ein Spiel in München","link":"https://www.nordbayern.de/sport/mehr-sport/nfl-deutschland-chef-2024-sicher-nur-ein-spiel-in-munchen-1.13752178","keywords":null,"creator":null,"video_url":null,"description":"Frankfurt/Main - Der NFL-Doppelpack in diesem Jahr hat das Interesse der Fans geweckt. Doch 2024 wird wieder das ursprünglich angepeilte Pensum absolviert. Die Teams sind noch nicht bekannt.","content":"Im Jahr 2024 wird nur ein Spiel der amerikanischen Football-Liga NFL in Deutschland stattfinden. Dies bekräftigte NFL-Deutschland-Chef Alexander Steinforth bei ran. \"Wir haben dieses Jahr die Ausnahmesituation gehabt, dass wir das Spiel aus Mexiko auch bekommen haben, da dort das Stadion umgebaut wird. Aber im nächsten Jahr wird es wieder das ursprünglich geplante, eine Spiel geben\", sagte Steinforth. Dieses werde, wie schon 2022, in der Allianz Arena in München stattfinden. Im Jahr 2025 ist dann wieder Frankfurt am Zug. Die Teams dafür stehen noch nicht fest. Am Sonntag (15.30 Uhr/RTL und DAZN) treffen die Miami Dolphins in Frankfurt auf Super-Bowl-Sieger Kansas City Chiefs. Eine Woche später duellieren sich die New England Patriots und die Indianapolis Colts an gleicher Stelle. Die bisherige Woche verlaufe positiv, sagte Steinforth der Deutschen Presse-Agentur: \"Wir sind sehr zufrieden mit all den Dingen, die jetzt schon in Frankfurt passiert sind. Die Dolphins haben schon sehr viel gemacht, trainiert, waren auch in der Stadt unterwegs. Man sieht es gerade, wenn man durch Frankfurt läuft, wie viel hier gerade vor Ort passiert. All das, was wir geplant haben, was die Teams geplant haben, erweckt gerade zum Leben.\"","pubDate":"2023-11-04 14:17:31","image_url":null,"source_id":"nn_de","source_priority":2872166,"country":["germany"],"category":["sports"],"language":"german"},{"article_id":"a3c41d2d992c5339a4cbcffdaa265e46","title":"NPFL: Photos, Capacity Of Best Stadiums In Nigerian Premier Football League","link":"https://www.naijanews.com/2023/11/04/npfl-photos-capacity-of-best-stadiums-in-nigerian-premier-football-league/","keywords":["Sports","Nigerian Football","Nigerian Premier Football League (NPFL)","NPFL","NPFL stadiums"],"creator":["Ernest Victor"],"video_url":null,"description":"The social media handlers of the Nigeria Premier Football League (NPFL) have compiled the best ten stadiums in the league for the 2023-2024 season. Among the top ten stadiums, the NPFL stadium that has the largest seating capacity is the Adokiye Amiesimaka Stadium in Port Harcourt, Rivers. The stadium is the home ground for Rivers […] The post NPFL: Photos, Capacity Of Best Stadiums In Nigerian Premier Football League appeared first on Naija News.","content":"The social media handlers of the Nigeria Premier Football League (NPFL) have compiled the best ten stadiums in the league for the 2023-2024 season. Among the top ten stadiums, the NPFL stadium that has the largest seating capacity is the Adokiye Amiesimaka Stadium in Port Harcourt, Rivers. The stadium is the home ground for Rivers United and has 38,000 seating capacity. According to the NPFL ratings, the stadium is the 6th best stadium in the 2023-2024 NPFL season, and it is one of the few stadiums in the Nigerian league that has a natural turf. Another NPFL Stadium that has a natural playing surface is Godswill Akpabio International Stadium, which is the home ground of Akwa United and is currently rated as the best stadium in the NPFL. Others are Samuel Ogbemudia Stadium in Benin, Edo state, used by Bendel Insurance, and Lekan Salami Stadium in Ibadan, Oyo state, used by Shooting Stars. Below are the top ten stadiums in the 2023-2024 NPFL season: 1. Godswill Akpabio International Stadium Uyo. 30,000 capacity Natural Turf. (Akwa United FC) 2. Samuel Ogbemudia Stadium Benin. 12,000 capacity Natural Turf. (Bendel Insurance FC) 3. Lekan Salami Stadium Ibadan. 10,000 capacity Natural Turf (Shooting Stars FC). 4. Mobolaji Johnson Arena Lagos, formerly known as Onikan Stadium. 10,000-capacity Artificial Turf (Sporting Lagos FC). 5. Remo Stars Stadium Ikenne Ogun state. 5,000 Capacity Artificial Turf (Remo Stars FC). 6. Adokiye Amiesimaka Stadium Port Harcourt. 38,000-capacity Natural Turf (Rivers United). 7. Muhammadu Dikko Stadium Katsina. 35,000 capacity. Artificial Turf (Katsina United FC). 8. Sani Abacha Stadium Kano 16,000-capacity Artificial Turf (Kano Pillars FC). 9. Enyimba International Stadium Aba 16,000-capacity Artificial Turf (Enyimba FC). 10. Pantami Stadium Gombe 12,000-capacity Artificial Turf. (Gombe United and Doma United).","pubDate":"2023-11-04 14:13:55","image_url":null,"source_id":"naijanews","source_priority":9385,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"d54bde090225e00f40b52cb7200a6d55","title":"Man Utd fans send flops clear message on huge banner as Erik ten Hag side battle Fulham","link":"https://www.dailystar.co.uk/sport/football/manchester-united-fans-banner-fulham-31360757","keywords":["Sport"],"creator":null,"video_url":null,"description":"Man Utd fans unfurled a banner getting stuck in their players ahead of their away trip to Fulham on Saturday as pressure on Erik ten Hag mounts","content":"fans unfurled a banner in the away end taking aim at the team’s recent miserable performances. ’s side travelled to Craven Cottage on Saturday lunchtime under mounting pressure off the back of a terrible performance and result in the Manchester Derby and in the EFL Cup against to compound the Red Devils’ terrible start to the season. United arrived in West London 8th in the table needing a win and a good performance to release the pressure on Ten Hag and his flailing squad. And some fans in the away end chose to make their recent displeasure plain ahead of the game. In an attempt to see a United performance with more energy and determination fans held up a sign reading: “Play like you mean it!!” as the player warmed up. But the message seemed to go a miss in the first half which saw yet another uninspiring United performance. Scott McTominay believed he had opened the scoring after just seven minutes but an offside against Harry Maguire who was deemed to be interfering with play following a lengthy VAR. United never got into a flow again and a drab rest of the half ensued. United began the second half brighter as Alejandro Garnacho tested Bernd Leno before his cross that would’ve let Rasmus Hojlund with a tap in was deflected over the bar. A desperately needed three points would see United temporarily climb into 6th place ahead of and Newcastle. But arguably as important is a sharp increase in a level of performance that has been rock bottom in recent weeks and frustration has clearly told on the supporters. It’s said that Ten Hag’s immediate future is secure with club CEO Richard Arnold willing to bide his time and hope that the Dutchman can pull United’s form and struggling players out of the fire.","pubDate":"2023-11-04 14:08:30","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360759.ece/ALTERNATES/s98/3_Fulham-FC-v-Manchester-United-Premier-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"847b68df6be5d1eff253b625d6bff7b4","title":"Arsenal under 18s game at Brighton postponed after team 'travel to Bournemouth by mistake'","link":"https://www.dailystar.co.uk/sport/football/arsenal-u18s-brighton-bournemouth-mistake-31360699","keywords":["Sport"],"creator":null,"video_url":null,"description":"An Arsenal youth game against Brighton has been postponed after the Gunners were mistakenly driven to Bournemouth, some two-and-half hours down the coast","content":"U18s clash against has been hilariously postponed after the team travelled to the wrong town. The fixture was scheduled to kick-off at the Seagulls' Amex Stadium at 12pm on Saturday, but the start was delayed by half-an-hour when the Gunners failed to turn up. It later transpired that they'd travelled to Bournemouth by mistake - a whopping 95 miles out of their way - and the game was then postponed. Fans on social media thought the whole thing was a farce. One X user wrote: \"Who is the driver? Was he drunk?\" Another said: \"How does this happen in this day and age?\" \"Hahaha the driver literally had one job. He's finito,\" wrote a third, while a fourth joked: \"Should've gone to Specsavers.\" were looking to extend their unbeaten run in all competitions to four matches. The team, who are managed by Gunners icon Jack Wilshere, are seventh in the U18 , having won three of their first eight games of the season. Wilshere took charge of the team just a few days after hanging up his boots in 2022. He led the team to the final of the 2022/23 FA Youth Cup in his first season in charge, though they lost the game to . The Gunners' U18s side have never won the U18 Premier League since its inception in 2012. They are, however, one of the most successful teams in FA Youth Cup history, having won the competition seven times (only and have won more). TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month","pubDate":"2023-11-04 13:57:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360756.ece/ALTERNATES/s98/0_GettyImages-1614990406.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5c3c25a9dfbe98e22fe13cd4fef90c17","title":"Arsenal under 18s game at Brighton postponed after team 'travel to Bournemouth by mistake'","link":"https://www.dailystar.co.uk/sport/football/arsenal-under-18s-game-brighton-31360699","keywords":["Sport"],"creator":null,"video_url":null,"description":"An Arsenal youth game against Brighton has been postponed after the Gunners were mistakenly driven to Bournemouth, some two-and-half hours down the coast","content":"U18s clash against has been hilariously postponed after the team travelled to the wrong town. The fixture was scheduled to kick-off at the Seagulls' Amex Stadium at 12pm on Saturday, but the start was delayed by half-an-hour when the Gunners failed to turn up. It later transpired that they'd travelled to Bournemouth by mistake - a whopping 95 miles out of their way - and the game was then postponed. Fans on social media thought the whole thing was a farce. One X user wrote: \"Who is the driver? Was he drunk?\" Another said: \"How does this happen in this day and age?\" \"Hahaha the driver literally had one job. He's finito,\" wrote a third, while a fourth joked: \"Should've gone to Specsavers.\" were looking to extend their unbeaten run in all competitions to four matches. The team, who are managed by Gunners icon Jack Wilshere, are seventh in the U18 , having won three of their first eight games of the season. Wilshere took charge of the team just a few days after hanging up his boots in 2022. He led the team to the final of the 2022/23 FA Youth Cup in his first season in charge, though they lost the game to . The Gunners' U18s side have never won the U18 Premier League since its inception in 2012. They are, however, one of the most successful teams in FA Youth Cup history, having won the competition seven times (only and have won more). TNT is the only place you can watch all the action from the Champions League this year. You can see every game from the group stage right through to the final as Manchester City look to defend their crown as the newest kings of the World's biggest and best football tournament. £29.99 a month","pubDate":"2023-11-04 13:57:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31360756.ece/ALTERNATES/s98/0_GettyImages-1614990406.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"}]}